{"id": 517, "name": "Frontiers in Cell and Development", "domain": "frontiersin.org/journals/cell-and-developmental-biology", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/cell-and-developmental-biology/articles/10.3389/fcell.2025.1606530/full", "title": "Cell And Developmental Biology", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Cancer Cell Biology Cell Adhesion and Migration Cell Death and Survival Cell Growth and Division Cellular Biochemistry Developmental Epigenetics Embryonic Development Epigenomics and Epigenetics Evolutionary Developmental Biology Membrane Traffic and Organelle Dynamics Molecular and Cellular Pathology Molecular and Cellular Reproduction Morphogenesis and Patterning Signaling Stem Cell Research Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Cancer Cell Biology Cell Adhesion and Migration Cell Death and Survival Cell Growth and Division Cellular Biochemistry Developmental Epigenetics Embryonic Development Epigenomics and Epigenetics Evolutionary Developmental Biology Membrane Traffic and Organelle Dynamics Molecular and Cellular Pathology Molecular and Cellular Reproduction Morphogenesis and Patterning Signaling Stem Cell Research Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Cancer Cell Biology Cell Adhesion and Migration Cell Death and Survival Cell Growth and Division Cellular Biochemistry Developmental Epigenetics Embryonic Development Epigenomics and Epigenetics Evolutionary Developmental Biology Membrane Traffic and Organelle Dynamics Molecular and Cellular Pathology Molecular and Cellular Reproduction Morphogenesis and Patterning Signaling Stem Cell Research Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office REVIEW article Front. Cell Dev. Biol., 11 June 2025 Sec. Cancer Cell Biology Volume 13 - 2025 |https://doi.org/10.3389/fcell.2025.1606530 This article is part of the Research TopicAdvances in Gastrointestinal CancersView all articles **The role of SIRT1 in the development of gastrointestinal tumors** 1Department of Clinical Pharmacy, The First Hospital of Jilin University, Changchun, Jilin, China 2Clinical Medical College, The First Hospital of Jilin University, Changchun, Jilin, China Gastrointestinal tumors, including esophageal cancer (EC), gastric cancer (GC) and colorectal cancer (CRC) and, pose significant global health challenges due to their high morbidity and mortality rates. SIRT1, an NAD+-dependent deacetylase, plays diverse roles in physiological processes and has been implicated in cancer development. This review examines the dual roles of SIRT1 in gastrointestinal tumors. In EC, SIRT1 consistently promotes tumor progression, with high SIRT1 expression associated with advanced TNM stage, poor prognosis, lymph node metastasis, and inferior overall survival. In GC, SIRT1 similarly promotes tumor progression via autophagy and chemoresistance, but studies also highlight its potential anti-cancer effects through ferroptosis regulation. In CRC, SIRT1 is often overexpressed and promotes tumor progression through mechanisms involving p53 inhibition, activation of the Wnt/β-catenin pathway, and regulation of Epithelial-Mesenchymal Transition (EMT). However, conflicting evidence suggests SIRT1 can also act as a tumor suppressor by inhibiting β-catenin and nuclear factor-κB (NF-κB) signaling. The dual nature of SIRT1 underscores the need for context-specific understanding of its function. Future research should focus on elucidating SIRT1’s mechanisms and developing personalized therapeutic strategies targeting SIRT1. **1 Introduction** According to the data compiled by the World Health Organization and the International Agency for Research on Cancer in 2022, cancer is indeed a significant cause of death globally, particularly among those under the age of 70 (Bray et al., 2021). Among them, colorectal cancer (CRC) accounted for 1,926,425 new cases, ranking third among the top ten most common cancers with second mortality. Gastric cancer (GC) had approximately 968,000 new cases globally, ranking fifth among all cancers. It also accounted for around 660,000 deaths, making it the fifth leading cause of cancer-related mortality (WHO, 2025). The high incidence and mortality rates for gastrointestinal tumors are largely attributed to factors such as chronic infection withHelicobacter pylori, dietary habits, and genetic predispositions. With the aggravation of population aging and the trend of cancer occurring at a younger age, the difficulty of prevention and treatment is self-evident. The burden of prevention and treatment for gastrointestinal tumors is becoming increasingly heavy. Therefore, the search for highly specific and sensitive biomarkers for early diagnosis of them and the implementation of precise targeted interventions with effective innovative drugs are extremely important. Sirtuins (SIRT1-7) are NAD+-dependent deacetylases and mono-ADP-ribosyl transferases that are associated with extensive biochemical processes like inflammation, regulation of energy metabolism, DNA repair (Mich et al., 2007). Among them, SIRT1 is the widest studied sirtuin and is highly expressed in the liver, pancreas, heart, muscle, brain, and adipose tissue (Ceballos et al., 2023). It is primarily localized in the nucleus as an important regulatory enzyme (Kupis et al., 2016). In the energy metabolism of liver, SIRT1 activates the peroxisome proliferator-activated receptor (PPAR) γ coactivator 1α (PGC-1α) (Rodgers et al., 2005), nuclear receptor PPARα (Purushotham et al., 2009) to increase glucose generation and repress glycolytic enzymes (Hallows et al., 2012) to decrease glycolysis both by deacetylating. What’s more, several studies have demonstrated that SIRT1 play a significant role in the process of inflammation, researchers delete SIRT1 inmousehepatocytes and find that the liver-specific SIRT1 knockout is easier suffer from hepatic steatosis and hepatic inflammation (Purushotham et al., 2009). For DNA repair, as a NAD+-dependent deacetylase, SIRT1 consistently localizes to the damage regions of DNA and deacetylates other proteins involved in DNA repair bothin vitroand in cells (Fan and Luo, 2010). Interestingly, while SIRT1 is essential for maintaining normal physiological functions, it can also contribute to disease and discomfort under certain circumstances. SIRT1 is often overexpressed in cancers occurring in the aforementioned tissues (Ceballos et al., 2023;Wauters et al., 2013). Notably, the relationship between CRC and SIRT1 has been extensively studied, with conflicting findings regarding its function (Menssen et al., 2012). For example,Jang et alanalyzed 680 tissue samples from CRC patients at different stages and found that SIRT1 expression declines as the tumor progresses to a more malignant state (Jang et al., 2012). Additional studies have also suggested that SIRT1 exerts an inhibitory effect on CRC, with a focus on its role in tumorigenicity and metastasis (Sun et al., 2017;Harada et al., 2016;El-Kott et al., 2021), and its potential as a drug target (García-Martínez et al., 2023;Jung et al., 2015). Conversely, numerous studies have highlighted the positive effects of SIRT1 on CRC. These studies have explored various aspects, including the mechanisms of action of drugs used to treat CRC, such as 5-Fluorouracil, oxaliplatin (Ueno et al., 2013), fentanyl (Zhang et al., 2014), resveratrol (Buhrmann et al., 2017), as well as the pathogenesis of CRC through molecular pathways like p53/miR-101/KPNA3 (Wang et al., 2023), AKT/TM4SF1 (Wang R. et al., 2021), ATGL/ mTOR (Su et al., 2023) and so on. Similarly, this phenomenon is also observed in research on GC and SIRT1. There are also discussions regarding the molecules P53 (Sun et al., 2012), AKT (Fu et al., 2021) and miRNA (Li et al., 2021), as well as the drugs 5-FU (Zhao et al., 2015) and resveratrol (Yang et al., 2013a). Similar to CRC, SIRT1 exhibits a dual role in GC, with evidence supporting both its promotion and inhibition of cancer progression. Up to now, there remains no consensus regarding the role of SIRT1 in gastrointestinal tumors. The present study compiles the most recent findings on SIRT1 in the context of gastrointestinal tumors and provides a comprehensive summary, with the aim of facilitating future research endeavors. **2 Characteristics of SIRT1** Mammals possess seven sirtuins, designated as SIRT1 to SIRT7: a conversed NAD+-dependent catalytic core domain that may act preferentially as a mono-ADP-ribosyl transferase and/or NAD+-dependent deacetylase. And both sides of the core domain connects additional N-terminal and/or C-terminal sequences of variable length (Frye, 2000). Specifically, the core domain of SIRT1 is solely responsible for deacetylation. Mammalian sirtuins also different in their sub-cellular localization. Even though SIRT1 has many vital functions in the cytoplasm, SIRT1 is mainly found in the nucleus (Michishita et al., 2005). The changing of intracellular ratio of NAD+/NAM will be caught by SIRT1 and affect its activity and substrate preference (Cantó et al., 2015). In this way, SIRT1 deacetylates different histones and other chromosomal proteins to transmit different signal of cellular metabolic status, ultimately altering gene expression (Vaquero, 2009). After that, its impact on human physiological functions is mainly manifested in the following aspects: promoting fat mobilization, stimulating the browning of white adipose tissue, controlling insulin secretion in the pancreas, sensing nutrient availability in the hypothalamus, regulating glucose and lipid metabolism in the liver, influencing obesity-induced inflammation in macrophages, and modulating the activity of the circadian clock in metabolic tissues (Li, 2013) (Figure 1). Figure 1. Schematic representation of SIRT1’s intracellular mechanisms of action. SIRT1 modulates various cellular functions such as DNA repair, gene expression regulation, and cellular metabolism through its NAD+-dependent deacetylation activity. **3 SIRT1 and EC** SIRT1 consistently promotes the progression of esophageal cancer (EC). Numerous investigations have analyzed tissues and EC cell lines from EC patients, particularly those with esophageal squamous cell carcinoma (ESCC), revealing that high SIRT1 expression is associated with advanced TNM stage (Ha et al., 2018), poor prognosis (He et al., 2016), lymph node metastasis (Yan et al., 2020), inferior overall survival (Ma MC. et al., 2018), and other adverse factors. These findings collectively suggest that SIRT1 may function as an independent prognostic predictor in EC. Studies have demonstrated that the EMT process in EC cells can be inhibited by the application of SIRT1 inhibitors in both EC cell lines and mouse models (Qin et al., 2018). This inhibitory effect may be associated with SIRT1-mediated autophagy (Zhang et al., 2024). Additionally, several studies have identified key molecules that facilitate metastasis in esophageal cancer (EC), including lncRNA MNX1-AS140 (Chu et al., 2019) and the Cystathionine-β-synthase (CBS)/H2S (Liu et al., 2022) system. These molecules enhance the metastatic potential of EC by augmenting the activity of downstream SIRT1. Regarding chemoradiotherapy resistance, miR-34a is recognized as an upstream inhibitory molecule of SIRT1. Research has shown that treatment ofRECA109cell lines with miR-34a can reverse their resistance to radiotherapy, an effect closely associated with the inhibition of SIRT1 (Ye et al., 2021). Futhermore, studies have demonstrated that genetic ablation of SIRT1 can enhance the sensitivity of cell lines to cisplatin (Yang et al., 2024;Morishita et al., 2024). Intriguingly, a recent study has correlated changes in the apparent diffusion coefficient (ADC) on MRI following chemoradiotherapy with SIRT1 levels, revealing that high SIRT1 expression is associated with diminished early efficacy of chemoradiotherapy (Chen et al., 2019). **4 SIRT1 and GC** The diverse biological functions of SIRT1 may explain the varied results observed in studies examining its relationship with GC. The number of studies suggesting that SIRT1 promotes GC is roughly equal to those indicating that SIRT1 inhibits GC. Therefore, we will elaborate on the role of SIRT1 in GC from both positive and negative perspectives. **4.1 Positive role of SIRT1 in GC** There are many studies have mentioned the high expression of SIRT1 in various GC types, such as gastric adenocarcinoma (Özcan et al., 2019), gastroesophageal junction cancer (Zhang LH. et al., 2013), gastric cardiac cancer (Feng et al., 2011), one of the studies reported that the expression level of SIRT1 in all stages of GC patient tissues (including precancerous lesions, early GC and advanced GC) was higher than that in non-cancerous gastric mucosa (Zhang S. et al., 2017). They found that the high expression of SIRT1 was statistically significantly correlated with the proliferation status of GC, advanced cancer stage (Jiang et al., 2016;Mohammadi Saravle et al., 2018), poor overall survival (OS) (Otsuka et al., 2023), recurrence free survival (Qiu et al., 2016), and increased number of metastatic lymph nodes (Cha et al., 2009;Noguchi et al., 2014). Notably, one study found that SIRT1 was associated with 3-year OS but not with 5-year OS (Jiang et al., 2016). Besides, these studies also reported some molecules that interact with SIRT1.Qiu et alexamined GC patients samples and found SIRT1 can deacetylate beclin-1 to mediate autophagy in GC cells, thereby participating in the progression of GC (Qiu et al., 2016). Similarly, the study ofZhang et alalso reported comparable results. The expression level of SIRT1 was negatively correlated with the expression levels of E-cadherin and MutL Homolog 1 in patients’ tissues, which may also be related to the mechanism of SIRT1 (Zhang LH. et al., 2013). Other molecules positively correlated with SIRT1 include Ki-6748, STAT3(Signal Transducer and Activator of Transcription 3) and its activated form pSTAT3 (Zhang S. et al., 2017). Conversely, DBC1(Deleted in Breast Cancer 1) has been shown to indicate a better prognosis in patients when highly expressed (Cha et al., 2009;Noguchi et al., 2014). These studies showed that SIRT1 is highly expressed in GC tissues and affects the progression of GC through multiple pathways, which is ultimately reflected in the prognosis of GC patients. P53, as an important target of SIRT1, is also essential in GC’s research. WhenSGC7901 human GCcells were transfected with VEGF siRNA, the expression of VEGF, SIRT1, survivin, and Bcl-2 was downregulated, while the expression of p53 and p21 was upregulated. This finding proved that the anti-cancer effect of VEGF siRNA was closely related to SIRT1/p53 pathway (Sun et al., 2012). Same as L-OHP, in addition to DNA, platinum drugs may also act on non-DNA molecules to promote their pro apoptotic effect and cytotoxicity. In gastric stomach cancer(AGS)cells, L-OHP can also act on tumor associated NADH oxidase, reduce the NAD+/NADH ratio, and reduce the activity of NAD+-dependent SIRT1, thereby enhancing the acetylation of p53 and apoptosis (Chen et al., 2017). The regulation of SIRT1 based on NAD+/NADH ratio is also seen in other molecules, Ubiquitin specific protease 22 (USP22) is a deubiquitinase that is believed to be associated with various cancers. InSCID mice, USP22 regulates the transcription of genes associated with these processes by deubiquitinating H2A or H2B histones (Liu et al., 2019). USP22 can regulate SIRT1 through the c-myc/ Nicotinamide phosphoribosyltransferase (NAMPT) pathway, thereby affecting the Forkhead Box O1 (FOXO1) and Yes-associated protein (YAP) signaling pathways, which are respectively related to GC cells apoptosis and metastasis (Liu et al., 2019). In addition, another study reported the molecular mechanism of obesity promoting the development of GC, which also upregulated the expression of SIRT1 through the same pathway in diet-induced obesemice(Li et al., 2013). In terms of the regulation of SIRT1, several studies have revealed that certain molecules can directly modify SIRT1 mRNA to modulate its expression. For example, IGF2BP2(Insulin-like Growth Factor 2 mRNA-Binding Protein 2) can directly act on the m6A modification site of SIRT1 mRNA, promoting the progression of GC through the IGF2BP2/SIRT1 axis both in cells line andmicexenograft model (Zhang Z. et al., 2022). MiRNAs also play a role in this process, miR-12129 can bind to the 3′-UTR of SIRT1 to inhibit the expression of SIRT1, thereby affecting the proliferation and cell cycle progression of GC cells (Zhang et al., 2020). Another part of the research explored SIRT1 mediated chemoresistance in GC. Multidrug resistance (MDR) in GC has always been a challenge in clinical treatment, but its mechanism is still inconclusive. Notably, GC associated with diabetes often exhibits resistance to chemotherapy drugs, there is a study reported that the expression of NAMPT, SIRT1, p53, P-gp and Topo II α is higher in patients with both diabetes and GC, and the survival time is reduced. The proliferation rate ofSGC7901cells increases at high glucose concentrations, while the inhibition rate of 5-FU on cells decreases over time. In mechanism, hyperglycemia may increase MDR by promoting the expression of NAMPT/SIRT1, which in turn promotes the expression of P-gp and reduces the expression of Topo-II α (Zhao et al., 2015). Further studies have identified molecules related to tumor MDR at the cellular level, such as downregulated miR-34a-5p and upregulated Activating Transcription Factor 4/(ATF4), both of which target SIRT1 (Deng et al., 2021;Zhu et al., 2012). These evidences further substantiate the intricate association between SIRT1 and the MDR phenotype in GC. In order to overcome the MDR of GC, new chemotherapy drugs targeting SIRT1 have also made progress. Jaridon 6, significantly inhibited the proliferation of drug-resistant GC cells and exhibited good cytotoxicity in cells andnude micemodel. Jaridon 6 exerts its effects by inhibiting SIRT1 activity, further affecting the (Phosphatidylinositol 3-Kinase)PI3K/AKT signaling pathway, inducing autophagy, and promoting the death of drug-resistant cancer cells (Fu et al., 2021). Like CRC, the SIRT1 inhibitor Tenovin-6 also exerts anti-tumor effects in GC through the same mechanism (Hirai et al., 2014). SIRT1 is also implicated in the metastasis of GC. Specifically, miR-204 overexpression reduces GC cell invasiveness and anti-apoptotic ability by targeting SIRT1, leading to decreased SIRT1 expression and subsequent modulation of EMT-related genes, such as increased E-cadherin and decreased vimentin levels. Conversely, miR-204 downregulation promotes GC cell invasion by activating the SIRT1- Liver Kinase B1(LKB1) signaling pathway (Zhang L. et al., 2013). A recent study found that USP14, which stabilizes SIRT1 through deubiquitination, is linked to poor prognosis and an immunosuppressive phenotype in GC patients. USP14-mediated SIRT1 stabilization promotes M2 macrophage polarization via SIRT1/PGC1-α-mediated lipid oxidation inmousetumor models. While USP14 overexpression alone is not enough to polarize macrophages, inhibiting USP14 with IU1 can reshape the tumor microenvironment, underscoring SIRT1’s key role in the “cold tumor” phenotype (He et al., 2023). The collective findings from the aforementioned studies offer substantial evidence that SIRT1 is intricately involved in various aspects of GC, including its initiation, proliferation, metastasis, autophagy, apoptosis, and the remodeling of the tumor microenvironment. As an oncogene, SIRT1 emerges as a pivotal player, exerting significant influence throughout the progression of GC (Figure 2). Figure 2. Schematic representation of SIRT1 promotes GC progression in multiple ways. Numerous extracellular factors influence intracellular molecular changes that affect processes such as cell apoptosis, proliferation, metastasis, mitophagy, drug resistance, and autophagy through distinct molecular pathways, with SIRT1 playing a pivotal role. Within the nucleus, SIRT1 regulates miRNAs and is itself regulated by other molecules to modulate cell phenotype. **4.2 Negative role of SIRT1 in GC** Despite numerous clinical studies indicating that SIRT1 is associated with poor prognosis in GC patients, conflicting results have also been reported. Based on the statistics of gene expression samples of 1065 GC patients in the database, it was finally found that as a prognostic marker, SIRT1 was associated with longer OS (Szász et al., 2016). Besides, some studies also reported that in SIRT1 positive GC tissues, the mRNA and protein levels of SIRT1 were lower than those in normal gastric tissues (Yang et al., 2013b;Li et al., 2016). In addition to the conflicting findings on SIRT1 expression and prognosis in GC, a substantial body of research has been dedicated to elucidating the mechanisms by which SIRT1 exerts inhibitory effects on various processes in GC. Among them, research on miRNAs accounts for a considerable proportion. Dishevelled binding inhibitor of beta catenin3 antisense 1 (DACT3-AS1) can regulate the expression of SIRT1 by sponging mir-181a-5p. Similarly, circ-SIRT1 could also sponge miR-132-3p/miR-212-3p to upregulate the expression of SIRT1. High levels of SIRT1 have been associated with inhibited tumor proliferation inmousemodel (Li et al., 2021). However, the inhibitory effect on GC proliferation diminishes due to decreased cellular levels of SIRT1, which may be caused by the upregulation of certain miRNAs that target SIRT1 mRNA. miR-132 play a cancer promoting role by directly acting on the 3′UTR of SIRT1 mRNA and inhibiting its expression (Zhang L. et al., 2017). miRNA-543 can also inhibit the expression of SIRT1, ultimately promoting EMT in GC (Li et al., 2016;Shi et al., 2019). Besides, SIRT1 has been reported to inhibit cyclin D1, thereby inducing G1 phase arrest in the cell cycle and leading to inhibitory effect on GC proliferation (Shi et al., 2019). SIRT1 can also assist with GC chemotherapy. In GC cells treated with oxaliplatin in xenograft tumormousemodel, SIRT1 may modulate chemotherapy resistance by influencing ferroptosis (Qu et al., 2023). Studies have found that in themicemodel, GC tissues with high levels of SIRT1 expression exhibit increased sensitivity to cisplatin and 5-FU. Mechanistically, SIRT1 activates AMPK by deacetylating LKB1. AMPK promotes the nuclear translocation of FOXO3 and enhances its transcriptional activity. In turn, FOXO3 increases the expression and activity of AMPKα by directly binding to its promoter and activating transcription. This coordinated effect further inhibits chemoresistance and cancer stem cell (CSC) properties (Qu et al., 2023;An et al., 2020). Meanwhile, upregulated SIRT1 can increase the inhibition of CREB(cAMP Response Element-Binding Protein), reduce its downstream product ABCG2, a protein associated with drug efflux and resistance, and ultimately increase the sensitivity of Lgr5+GCSCs to cisplatin in GC cells (Zhang L. et al., 2017). Regarding CREB, a study has shown that SIRT1 can inhibit the expression of CA9 (carbonic anhydrase IX) by forming a complex with the adapter protein p300 and CREB. This interaction leads to a decrease in both the mRNA and protein levels of CA9, thereby suppressing the growth of GC innude micemodel (Wang et al., 2015). Additionally, in mouse models deficient in SETD2—a histone methyltransferase that catalyzes H3K36 trimethylation—tumorigenesis is promoted due to the inhibition of the SIRT1/FOXO signaling pathway, highlighting SIRT1’s role downstream of SETD2 in regulating tumor progression (Feng et al., 2023). Beyond the pathways previously discussed, SIRT1 is also implicated in the STAT3/MMP-13 signaling pathway. Inmicemodels also showed depleted of SIRT1, the expression levels of phosphorylated STAT3, acetylated STAT3, and(matrix metalloproteinase 13)MMP-13 are significantly upregulated. Activation of the STAT3/MMP-13 signaling pathway promotes the progression of GC (Zhang et al., 2019). Furthermore, NF-κB, which is extensively studied in CRC, is also regulated by SIRT1 in GC. SIRT1 induces G1 phase arrest through the NF-κB/Cyclin D1 signaling pathway, thereby inhibiting tumor proliferation (Yang et al., 2013b). Additionally, analysis of clinical samples has shown that SIRT1 directly binds to and deacetylates the transcription factor c-JUN, thereby inhibiting its transcriptional activity, which in turn reduces tumor size, inhibits tumor infiltration, and decreases the likelihood of lymph node metastasis and clinical progression in GC (Dong et al., 2018). In contrast to the tumor-promoting effects of SIRT1 in GC, the mechanisms by which SIRT1 exerts its inhibitory effects on GC are remarkably diverse. Whether it is through the suppression of tumor growth and metastasis, or by playing a pivotal role in overcoming chemotherapy resistance, SIRT1 clearly demonstrates its anti-cancer potential in GC (Figure 3). Figure 3. Schematic representation of SIRT1 inhibits GC progression in multiple ways. SIRT1 is involved in various molecular pathways, such as ferroptosis, cell cycle regulation, autophagy, and EMT, thereby influencing cell drug resistance, proliferation, and metastasis. **5 SIRT1 and CRC** In CRC, SIRT1 remains an important research hotspot. Despite some studies indicating that SIRT1 expression is downregulated, the majority have shown that SIRT1 is upregulated and deemed vital for all stages of CRC tumorigenesis. We will also discuss the role of SIRT1 in CRC from both positive and negative perspectives. **5.1 SIRT1 promotes CRC progression in multiple ways** In GC, numerous studies have confirmed that SIRT1 can serve as a prognostic molecular marker to predict patient outcomes, and similar studies have also been conducted in CRC. There are many clinical statistical researches demonstrate that overexpression of SIRT1 was significantly positively correlated with poor prognosis and advanced stage of CRC (Lv et al., 2014;Lee et al., 2021;Jiang et al., 2014). Interestingly, one study reported that this association is less common in young patients (Lee et al., 2021). What’s more, SIRT1 genotypes are also associated with CRC subtypes, especially (Microsatellite Instability)MSI-high phenotype CRC (Nosho et al., 2009;Hrzic et al., 2020). Further studies have explored the reasons behind these phenomena through various molecular mechanisms. P53 is one of the important tumor suppressor proteins for CRC, and its activity can be regulated by SIRT1 via deacetylation. Knocking out the SIRT1 gene can increase the expression level of P53 in CRC cell (Chen et al., 2014;Stunkel et al., 2007;Vaziri et al., 2001). NAMPT is a significant oncogene that targets P53 via SIRT1. c-MYC, in conjunction with NAMPT, promotes the production of the SIRT1 cofactor NAD+. Notably, c-MYC can bind to the SIRT1 inhibitory protein DCB1. Simultaneously, SIRT1 can inhibit c-MYC induced cell apoptosis mediated by p53 (Menssen, 2013;Pan et al., 2019). Besides, long non-coding RNAs HNF1A-AS1 and H19 can regulate the expression of miRNA-34a and miR-194-5p by functioning as competing endogenous RNAs (ceRNAs). These miRNAs then directly target the SIRT1/P53 signaling axis, leading to the inhibition of p53 activity in bothnude micemodels and cells (Fang et al., 2017;Wang et al., 2018). Additionally, P53 requires modification to exert its proapoptotic function, specifically the acetylation of Lys382. Nox1 can upregulate the expression of SIRT1, and SIRT1 targets P53 Lys382 and mediates its deacetylation to suppress p53 proapoptotic transcriptional activity (Puca et al., 2010). These oncogenes contribute to the anti-apoptotic activity of CRC cells, highlighting the complex and critical role of SIRT1-mediated deacetylation of p53 in tumor suppression and proliferation in CRC. SIRT1/P53 signaling axis is also one of the hotspots in CRC treatment. Numerous therapeutic mechanisms targeting SIRT1 have been explored. SIRT1 inhibitors, such as 4bb (Ghosh et al., 2017), MHY2245 (Kang et al., 2022a), MHY2251 (Kang et al., 2022b), directly target SIRT1 to produce a series of cytotoxic effects inHCT116cells. These studies have shown that CRC cells undergo apoptosis through three signaling pathways after treatment with SIRT inhibitors: the SIRT1/P53 pathway via deacetylation (Ghosh et al., 2017), the c-Jun N-terminal kinase (JNK) pathway and its downstream regulated caspases (Kang et al., 2022b), and the Fas/FasL pathway (Kang et al., 2022b). Differently, MHY2245 is closely bound up with CRC cell cycle by regulating cyclin B1, cell division cycle protein 2 (Cdc2), and Cdc25c. Another study injectedHCT116cells intononobese diabetic/severe combined immunodeficiency (NOD/SCID) miceand indicated that the antipsychotic drug chlorpromazine (CPZ) has potential therapeutic effects on CRC through its interaction with SIRT1. CPZ directly induced SIRT1 ubiquitination and promoted SIRT1 protein degradation, then increase the acetylation level of P53 and lead to apoptosis of CRC cells (Lee et al., 2015). On the whole, it appears that the SIRT1/P53 axis primarily influences CRC through the mediation of cell apoptosis. However, recent studies have also highlighted the role of p53 in the immune microenvironment and metastasis of tumor cells. In CRC xenograft tumors established in nude mice, overexpression of SIRT1 leads to the deacetylation of P53, increases the expression of CXCL12, and enhance CXCR4 expression in the tumor microenvironment. Subsequently, SIRT1 regulates the migration of tumor-associated macrophages (TAMs) through the CXCR4/CXCL12 pathway, which inhibits the proliferation and activity of CD8+T cells (Fang et al., 2022). Another study reported that in nude mice, the deacetylation of P53 results in the downregulation of miR-101, thereby weakening the inhibitory effect on its target gene KPNA3. This mechanism allows SIRT1 to promote tumor cell migration, invasion, and EMT via the p53/miR-101/KPNA3 pathway (Wang et al., 2023) (Figure 4). Figure 4. Schematic representation of the role of SIRT1/P53 signing pathways on CRC. SIRT1/P53 axis interacts with various molecules and pathways to influence CRC cell behavior. Simultaneously emphasizing the role of SIRT1 inhibitors and the regulation of the tumor microenvironment by SIRT1. The Wnt signaling pathway, particularly the canonical Wnt/β-catenin pathway, is a critical regulator of various cellular processes, including cell migration, apoptosis, and proliferation (Cheng et al., 2019). The canonical Wnt/β-catenin signaling pathway is implicated in the onset of CRC and is considered a promising therapeutic target (Zhao H. et al., 2022) Abnormal activation of the Wnt/β-catenin signaling pathway can promote the progression of CRC (Sun et al., 2024). Overexpressed SIRT1 directly activates Wnt/β-catenin signaling pathway and promotes the occurrence of CRC (Zhang et al., 2023). As the oncogenes of CRC, both nuclear enriched abundant transcript 1 (NEAT1) and Pseudouridine synthase 7 (PUS7) are involved in the initiation of the tumor through SIRT1/Wnt/β-catenin axis in thenude micemodel. NEAT1 is a Long non-coding RNA which can competitively bind to miR-34a and upregulate the expression of SIRT1. PUS7 can be combined with SIRT1 to stabilize it and enhance its functionality (Zhang et al., 2023;Luo et al., 2019). Besides, downstream gene c-MYC of Wnt/β-catenin signaling pathway has been reported to be closely related to malignant transformation in the serrated route to CRC (Menssen, 2013;Kriegl et al., 2012;Brandl et al., 2018;Kriegl, 2013). After extensive analysis of CRC patient tissues and cell lines, researchers found high expression levels of c-MYC and SIRT1 can be observed in most serrated lesions, the majority of which are related to KRAS and BRAF mutations. However, serrated lesions without these two gene mutations are believed to be induced by the Wnt/β-catenin signaling pathway. Once activated, the Wnt/β-catenin signaling pathway leads to an increase in nuclear β-catenin, which induces c-MYC transcription. This process can enhance SIRT1 activity through a feedback loop involving c-MYC, NAMPT, and SIRT1 (Kriegl et al., 2012;Brandl et al., 2018). In conclusion, Wnt/β-catenin/c-MYC/NAMPT/SIRT1 axis crucially contribute to onset and development of serrated route to CRC. In addition to the occurrence of cancer, SIRT1/Wnt/β-catenin signaling pathway is also involved in many other stages of CRC. For metastasis, HNF1A-AS1 inhibits miR-34a/SIRT1/p53 feedback loop and activates Wnt/β-catenin signaling pathway to promote CRC cell EMT and metastasis (Fang et al., 2017). For CRC cell metabolism, SIRT1 expression is upregulated in a glucose-deficient tumor microenvironment, leading to the deacetylation of β-catenin. This modification facilitates the translocation of β-catenin from the nucleus to the cytoplasm. Consequently, glycolysis is weakened, and fatty acid oxidation (FAO) is activated to provide an alternative energy supply. This metabolic shift has been observed both in cell cultures and in nude mice xenograft models (Wei et al., 2023). For chemotherapy, the anticancer effect of sodium salt of butrin (a novel compound isolated from Butea monosperma flowers) was found to be achieved by downregulating SIRT1 to inhibit Wnt/β-catenin signaling pathway activity inSW480cells (Subramaniyan et al., 2017). In summary, from these studies, as one of the targets of SIRT1, Wnt/β-catenin signaling pathway also plays an assignable role in the carcinogenesis and development of CRC. Remote metastasis of CRC is a major cause of patient mortality. Approximately 20% of patients present with distant metastasis at initial diagnosis, and 50%–60% of those with primary CRC will eventually develop metastasis, commonly to the liver, lungs, and bones (Benson et al., 2017;Li et al., 2017). EMT, a process where epithelial cells transition to a mesenchymal phenotype, is crucial for metastasis. This transition increases cell mobility, invasiveness, and anti-apoptotic properties by disrupting tight junctions between tumor cells (Shin et al., 2023;Lu et al., 2023). SIRT1 is a key regulator in EMT. In tumor-bearingmice, Lipopolysaccharide-induced tumor necrosis factor alpha factor (LITAF) acts as a tumor suppressor gene, promoting FOXO-1 expression to inhibit SIRT1, thereby upregulating epithelial marker E-cadherin and downregulating mesenchymal marker N-cadherin. Conversely, silencing LITAF leads to high SIRT1 expression, promoting EMT (Guan et al., 2023). Additionally, NAMPT, an oncogene associated with CRC, induces EMT-related genes (TWIST1, VIM, SNAI1) and enhances SIRT1 activity via the NAD salvage pathway. However, inhibiting SIRT1 can reverse this effect in cell lines and nudemice(Lucena-Cacace et al., 2018). Meanwhile, Ubiquitin-conjugating enzyme E2 variant 1 (UBE2V1) degrades SIRT1 through ubiquitination, reducing its promotion of autophagy and inducing EMT via an autophagy-related mechanism in orthotropicmousexenograft model of lung metastasis (Shen et al., 2018). As a pivotal signaling hub, SIRT1 receives signals from gene transmission and activates multiple molecular downwards, such as Wnt/Fos-related antigen 1 (Diesch et al., 2014;Cheng et al., 2016), P53/ miR-101/KPNA3 (Wang et al., 2023), and NF-κb (Pyo and Kim, 2019). Innude micexenograft model and cells, Fra-1, a downstream molecule of the Wnt signaling pathway, is considered the gatekeeper of EMT in CRC cell metastasis. As previously discussed, SIRT1 activates the Wnt signaling pathway to upregulate the expression of Fra-1, ultimately inducing the EMT process in tumors (Diesch et al., 2014;Cheng et al., 2016). What’s more, researchers have constructed a xenograft model of CRC and a metastasis model usingnude miceand found that SIRT1 can also deacetylate P53 to downregulate the expression of miR-101, thereby upregulating the expression of its target gene KPNA3. The results of western blot analysis indicated that overexpression of KPNA3 can increase E-cadherin and occluding levels, while reducing vimentin, N-cadherin, and fibronectin levels (Wang et al., 2023). Regarding NF-κb, there is a study counted 261 CRC tissue samples, analyzed the relationship between NF-κb and CRC by immunohistochemical method, and found that the expression of NF-κb was significantly correlated with the expression of SIRT1 and SNAIL, a marker of EMT (Pyo and Kim, 2019). Interestingly, except SIRT1, its pre-mRNA circ-SIRT1 is also related to CRC metastatic.Wang et alanalyzedHCT116andHT29cell lines and reported that circ-SIRT1 knockdown inhibited the expression of N-cadherin and vimentin. Mechanically, they found circ-SIRT1 could bind to eukaryotic tTranslation initiation factor 4A3 (EIF4A3), which plays a role in mRNA quality control before translation initiation. Consequently, circ-SIRT1 suppressed the recruitment of EMT-related protein mRNAs by EIF4A3, thereby further regulating the progression of EMT (Wang X. et al., 2021). According to the latest research, 75% of the human genome can be transcribed into RNA, while only 3% can be translated into proteins, the RNA that is not translated into proteins is referred to as non-coding RNA(ncRNA) (Kimura, 2020). ncRNAs can be divided into microRNA (miRNA) and long ncRNA (lncRNA) based on their length, both of them are closely related to malignant tumor (Yan and Bu, 2021;Ma Y. et al., 2018;Kopp and Mendell, 2018). There is abundant evidence to confirm that miRNAs are involved in the occurrence (Wang et al., 2020), proliferation (Wang et al., 2023), invasion (Luo et al., 2019), resistance (Wang et al., 2023;Wang et al., 2018;Wu et al., 2019;Zhao B. et al., 2022), and metastasis of CRC (Sun et al., 2017;Fang et al., 2017;Shen et al., 2016) through different mechanisms. Of course, the assistance of SIRT1 is indispensable. It is worth mentioning that lncRNAs and miRNAs sometimes antagonize each other and fulfill their respective roles (Fang et al., 2017). In both cell and mouse models, researchers have reported a consistent mechanism involving miRNAs functioning as competing endogenous RNAs (ceRNAs) to sponge other non-coding RNAs (ncRNAs). Examples include miR-34a/ HNF1A-AS1 (Fang et al., 2017), miR-34a/NEAT1 (Luo et al., 2019), miR-34a/GAS5 (Zhang et al., 2021), miR-135a-5p/FOXD3-AS1 (Wu et al., 2019), miR-194–5p/H19 (Wang et al., 2018). All of these miRNAs were negatively correlated with the expression of SIRT1. Subsequently, lncRNAs, acting as ceRNAs for these miRNAs, functioned as oncogenes. They upregulated the expression of SIRT1 by sponging miRNAs and further participated in the processes of CRC. As a result of SIRT1 overexpression, different pathways, such as Wnt (Luo et al., 2019) and P53 (Fang et al., 2017) are activated and transmit signals to the downstream. Additionally, some lncRNAs directly exert their effects through SIRT1. For example, H19 mediates autophagy via SIRT1 (Wang et al., 2018). Based on the analysis of CRC tissues and corresponding hepatic metastasis tissues, the downregulation of miR-199b is closely related to the distal metastasis and high TNM stage of CRC. miR-199b can downregulate the expression of SIRT1, further enhance the acetylation of transcription factor CREB. Then the activated CREB acts on the promoter of KISS1, thereby upregulating the expression of KISS1, a metastasis suppressor (Shen et al., 2016). Similarly, low expression of miR-138 also symbolizes poor prognosis in CRC patients, as miR-138 can also target the 3′UTR of SIRT1 gene and inhibit its expression (Kang et al., 2021). MiRNA-34a can also downregulate the expression of SIRT1, exerting anti-cancer effects. Researchers evaluated in theratmodel of azoxymethane (AOM)-induced CRC and found that is alsothe mechanism by which Catalpol can treat CRC (Qiao et al., 2020). Some miRNAs are regulated by SIRT1, serving as a link in the downstream signaling of SIRT1. SIRT1 can deacetylate the promoter of miR-1185-1 and inhibit its expression, which targets CD24 gene 3′UTR to suppress its expression. In this way, SIRT1 can increase stemness in CRC by promoting CD24 expression in the mouse xenograft model (Wang et al., 2020). Likewise, SIRT1 deacetylates P53, thereby reducing the expression of miR-101, relieving miR-101's inhibition of the target gene KPNA3 and promoting the progression of CRC (Wang et al., 2023). In addition, other studies have also reported that SIRT1 can participate in tumor immune escape (Meng et al., 2021), drug resistance (Zhao B. et al., 2022), and inhibition of CRC through miRNA (Sun et al., 2017). From these various studies, we can learn that ncRNA, especially miRNA, plays an important role in various stages of CRC together with SIRT1 (Table 1). Table 1. The effect of miRNA on CRC through SIRT1. miRNAs and lncRNAs regulate SIRT1 expression by acting as ceRNAs or by directly targeting SIRT1, thereby impacting CRC progression, metastasis, and resistance. In tumor treatment, single-target agents often induce drug resistance and reduce efficacy (Antolin et al., 2016). Combination drugs, which act via multiple pathways or targets, are the best solution (Benboubker et al., 2024). In CRC treatment, the FOLFOXIRI regimen (FOL: folinic acid, F: 5-FU, OX: oxaliplatin, IRI: irinotecan) is commonly used (Benson et al., 2017). 5-Fluorouracil (5-FU) is a cornerstone in CRC treatment, primarily inhibiting thymidylate synthase (TS) to disrupt DNA synthesis by depleting intracellular deoxynucleotide pools (Vodenkova et al., 2020). Oxaliplatin, a platinum-based drug, exerts anti-CRC effects by forming active platinum complexes that bind to DNA, causing intra- and inter-strand crosslinks, leading to DNA damage and apoptosis (Zhang C. et al., 2022). As classic chemotherapy drugs for CRC, both oxaliplatin and 5-FU are closely related to SIRT1 in terms of resistance. Regarding oxaliplatin, SIRT1 influences the resistance of CRC cells through multiple molecules. Some studies conducted CRC cell andnude micemodel and identified the potential mechanism of the oxaliplatin-resistant (OR) (Zhao B. et al., 2022;Shen et al., 2016;Fang et al., 2018). In those studies, researchers stated that SIRT1 was increased in the OR-CRC tissues and the knockout of SIRT1 significantly enhanced the sensitivity of CRC tissues to oxaliplatin. In OR-CRC tissues, the aberrantly expressed SIRT1 protein binds to the promoter of miR-20b-3p and inhibits its transcription. This action relieves the repression of DEPDC1 expression, thereby increasing the cellular level of DEPDC1 and enhancing resistance to oxaliplatin (Zhao B. et al., 2022;Shen et al., 2016). It was also found that the expression levels of nuclear transcription factor Y subunit β(NFYB) and E2F transcription factor 1 (E2F1) in OR-CRC cells were significantly higher than those in non-resistant cells. High expression of NFYB can activate the transcription of E2F1 gene and E2F1 mediates oxaliplatin resistance by promoting the expression of Checkpoint Kinase 1 (CHK1). In the NFYB/ E2F1/CHK1 axis, SIRT1 can deacetylate E2F1 to inhibit its pro apoptotic activity, which is essential for maintaining oxaliplatin resistance in OR-CRC cells (Fang et al., 2018). Nucleotide excision repair (NER) pathway also plays an important role in the mechanism of oxaliplatin resistance. Studies have shown that the deacetylation of xeroderma pigmentosum complex group A (XPA) by SIRT1 can promote the NER pathway (Fan and Luo, 2010). In addition, Hypermethylated in Cancer 1 (HIC1) is a sequence specific transcriptional repressor that directly binds to the SIRT1 promoter and inhibits SIRT1 transcription. Consequently, the mutational inactivation of HIC1 results in the upregulation of SIRT1 expression and the activation of the NER pathway, as confirmed in a cohort study (Okazaki et al., 2017). Research on 5-FU resistance is inseparable from ncRNA, lncRNA H19 increases 5-FU resistance through SIRT1 mediated autophagy in CRC cells (Wang et al., 2018). At the same time, SIRT1 can also reduce p53 through deacetylation, and then downregulate the expression of miR-101, and increase the expression of miR-101 target gene KPNA3, to enhance the resistance to 5-FU (Wang et al., 2023). Interestingly, a study found that the high expression of miR-653-3p was related to the drug resistance of 5-FU in the xenograftmicemodel. Mechanically, miR-653-3p inhibited the expression of SIRT1 by directly interacting with the 3′UTR of SIRT1. Subsequently, miR-653-3p promoted the phosphorylation of STAT3 and the expression of Twist1, a transcription factor that can promote chromosomal instability, then inhibited apoptosis (W et al., 2023). The alteration of metabolic pathways in CRC cells is also one of the mechanisms underlying SIRT1-induced drug resistance. PGC1-α is a key regulatory factor for mitochondrial function and biosynthesis. Following chemotherapy, researchers have observed an increase in mitochondrial number and oxygen consumption in CRC cells, along with upregulation of SIRT1 expression. SIRT1 activates PGC1 α through deacetylation, thereby shifting the cellular metabolic pathway from glycolysis to oxidative phosphorylation. This metabolic reprogramming enhances the tumor’s resistance to chemotherapy, as demonstrated in models constructed usingCBy.Cg-Foxn1nu/Jmice orNOD/SCIDmice (Vellinga et al., 2015;Witherspoon et al., 2019). Consistent findings have been reported in studies analyzing the genomes of hundreds of CRC tissue samples (Vellinga et al., 2014). Additionally, some anti-cancer agents, such as Manuka honey and Xanthohumol, exert their effects by inhibiting the SIRT1/PGC1-α axis (Sastre-Serra et al., 2019;Afrin et al., 2018). Moreover, upon attack by anti-cancer therapies, SIRT1 deacetylates β-catenin, promoting its translocation from the nucleus to the cytoplasm. This process weakens glycolysis and is positively correlated with fatty acid oxidation (Wei et al., 2023). Conversely, conflicting results have been reported in the literature. In anude micemodel, FOXQ1, which is highly expressed in CRC, acts on the SIRT1/β-catenin axis, causing β-catenin to transfer from the cytoplasm to the nucleus. This nuclear accumulation of β-catenin results in radiation resistance of tumor cells (Yang et al., 2022). Other studies have reported that the combination of a SIRT1 inhibitor with anti-CRC drugs such as 5-FU, SN-38, or oxaliplatin can promote cell apoptosis and enhance the anti-tumor effect (Ueno et al., 2013). For example, SIRT1 inhibitors sensitize TP53 mutant (MUT)SW620cells to a variety of chemotherapeutic drugs (Yang et al., 2020). However, different scenarios have been reported in another CRC cell line. InHCT116cells harboring wild-type TP53, SIRT inhibitors showed antagonistic effects with a variety of chemotherapeutic drugs, including cisplatin, 5-fluorouracil, oxaliplatin, gefitinib, LY294002, and metformin, thereby reducing the antitumor effects of these drugs. These findings highlight the complex role of SIRT1 in CRC treatment and suggest that the efficacy of SIRT1 inhibitors may depend on the TP53 status of the cancer cells (Figure 5). Figure 5. Schematic representation of chemotherapy resistance of CRC mediated by SIRT1. SIRT1 modulates the effects of chemotherapy drugs like Oxaliplatin and 5-Fluorouracil, as well as natural compounds such as Manuka honey and Xanthohumol, by affecting pathways including DNA damage, cell cycle arrest, apoptosis, and autophagy. **5.2 SIRT1 inhibits CRC progression in multiple ways** Although many studies have provided substantial evidence that SIRT1 plays a positive role in the occurrence and development of tumors, some studies have reached the opposite conclusion. For example, while high levels of SIRT1 are often associated with advanced-stage tumors, as many studies have shown, the opposite has also been observed. High levels of SIRT1 expression are found in normal colonic mucosal tissues and benign adenomas (Kabra et al., 2009), whereas a reduction in SIRT1 expression is seen in adenocarcinoma, metastatic tissues, and advanced stage Ⅳ tumors (Jang et al., 2012). This suggests that SIRT1 may exert tumor-suppressive effects during certain stages of cancer development. In the research on SIRT1’s role in inhibiting cancer, two molecules, β-catenin and NF-κB, are particularly crucial. The anti-cancer effects of caloric restriction (CR) in mammals have been well-documented (Lien et al., 2021), with SIRT1 playing a significant role in energy metabolism (Mich et al., 2007). Concurrently, CR is associated with an upregulation of SIRT1 expression within the intestinal tract. Furthermore, SIRT1 inhibits its ability to activate transcription and drive cell proliferation by deacetylating β-catenin, and promotes the cytoplasmic localization of β-catenin. In 81 human colon tumor specimens andAPCmin/+mousemodel, the presence of SIRT1 was significantly negatively correlated with the oncogenic form of β-catenin (Firestein et al., 2008). DBC1 can promote CRC development by facilitating the formation of the LEF1-β-catenin complex and the transcription of PROX1, a transcription factor induced by the Wnt/β-catenin pathway that can drive colorectal malignant transformation. These effects are achieved through the inhibition of SIRT1 by DBC1, which has been examined in thenude micemodel (Yu et al., 2016). Moreover, this mechanism has also been confirmed in drug development (Harada et al., 2016). NF-κB is an important transcription factor that plays a central role in the regulation of immune response and inflammatory process. Its abnormal activation can promote cell proliferation, inhibit apoptosis, and promote EMT to support tumor cell growth and invasion in theApcMinmousemodel (Porta et al., 2018). This is why NF-κB is a target for many anti-tumor drugs, which generally work by increasing the expression and activity of SIRT1 (El-Kott et al., 2021;Zhang et al., 2014;Zhou et al., 2019;Buhrmann et al., 2016). The upregulated SIRT1 can directly deacetylate NF-κB and inhibit its activity, ultimately achieving the purpose of anti-tumor. There are also studies where the tumor suppressor mechanism of SIRT1 is more complex. sad1/unc84 domain protein-2 (SUN2) is a key component connecting the nucleoskeleton and the cytoskeleton complex, and it may be associated with metastasis in various cancers (Liu et al., 2021). In CRC, high expression of SUN2 is linked to a favorable prognosis. This is attributed to the regulation of the acetylation state of methyl CpG binding protein 2 (MeCP2) by a complex composed of SUN2 and SIRT1. This regulation increases MeCP2’s binding activity to the brain-derived neurotrophic factor (BDNF) promoter, thereby reducing BDNF expression. The decreased activity of bdnf/ tropomyosin-related kinase B signaling pathway ultimately reduces the metastatic ability of cells innude micemodel (Liu et al., 2021). SIRT1 can also participate in the process of suppressing cancer by regulating downstream molecules. In the analogous xenograft model constructed innude mice, SIRT1 weakens the transcriptional activation of the miR-15b-5p promoter by deacetylating the AP-1 complex. The downregulated miR-15b-5p cannot exert an inhibitory effect on its target, acyl-CoA oxidase 1 (ACOX1). High-levels ACOX1 can inhibit the proliferation and metastasis of CRC cells (Sun et al., 2017). In addition, studies have reported that SIRT1 is involved in the anti-tumor mechanisms of vitamin D. Calcitriol, an active metabolite of vitamin D, can promote the activation of SIRT1 through auto-deacetylation, thereby enhancing SIRT1’s deacetylation activity (García-Martínez et al., 2023). These studies collectively highlight the anti-tumor effects of SIRT1, which also suggested that SIRT1 has a double-sided role in the occurrence and development of CRC. **6 Conclusion** According to epidemiological statistics, gastrointestinal tumors rank high in both incidence and mortality rates. Since they typically present with significant clinical symptoms only in the advanced stages, they are characterized by late detection and poor treatment outcomes. Therefore, it is essential to identify highly sensitive and specific biomarkers for early diagnosis. This review centers on SIRT1’s complex role in gastrointestinal tumors, especially esophageal cancer (EC), gastric cancer (GC), and colorectal cancer (CRC), highlighting its dual potential as both a tumor promoter and suppressor. Understanding SIRT1’s intricate mechanisms is crucial for its context-specific function (Figure 6). Figure 6. Schematic representation of the role of SIRT1 in the development of gastrointestinal tumors, provides a concise summary of the key molecules and cellular processes influenced by SIRT1 in the context of CRC and GC. In EC, SIRT1 consistently drives the progression of tumor. In GC, SIRT1’s role is not straightforward. Like CRC, SIRT1 can also regulate similar molecules that affect tumor progression in GC cells. However, we have noticed that there are more studies on the anticancer effect of SIRT1 in GC, which may be related to SIRT1 mediated ferroptosis andHelicobacter pyloriinfection. Further research is needed to reach specific conclusions. Similarly, in CRC, SIRT1 is involved in tumor development, proliferation, invasion, and metastasis through important molecules such as P53, Wnt/β-catenin signaling pathway, and ncRNA. We also found that SIRT1 plays a crucial role in the progression of tumor EMT and drug resistance. However, contrasting findings suggest that SIRT1 can also act as a tumor suppressor by inhibiting β-catenin and NF-κB signaling pathways. This duality underscores the complexity of SIRT1’s function and suggests that its role may vary depending on the stage of cancer and the specific molecular context. Future research should focus on elucidating the specific molecular contexts in which SIRT1 exerts its pro- or anti-tumorigenic effects. This includes investigating the role of SIRT1 in different stages of cancer development and identifying biomarkers that can predict SIRT1’s function in individual patients. Moreover, the development of selective SIRT1 modulators is also an important area of research. Currently, there are many SIRT1-related drugs, such as SIRT1 inhibitors. However, specific clinical trials in this area remain largely unexplored. In conclusion, the dual roles of SIRT1 in gastrointestinal tumors present both challenges and opportunities for cancer research and therapy. By unraveling the complex mechanisms through which SIRT1 operates, we can pave the way for more effective and personalized treatments for gastrointestinal tumors. **Author contributions** YZ: Writing – original draft, Funding acquisition. XZ: Writing – original draft. JZ: Writing – original draft. JM: Writing – original draft. SZ: Writing – review and editing. **Funding** The author(s) declare that financial support was received for the research and/or publication of this article. This study was supported by the Administration of Traditional Chinese Medicine of Jilin Province, China (grant No. 2023064 to YZ), the Department of Education of Jilin Province (grant No. JJKH20221106KJ to YZ), and Jilin Provincial Health Commission (grant No. J2023JC006 to JM). **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Generative AI statement** The author(s) declare that no Generative AI was used in the creation of this manuscript. **Publisher’s note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **References** Afrin, S., Giampieri, F., Gasparrini, M., Forbes-Hernández, T. Y., Cianciosi, D., Reboredo-Rodriguez, P., et al. (2018). The inhibitory effect of Manuka honey on human colon cancer HCT-116 and LoVo cell growth. Part 2: induction of oxidative stress, alteration of mitochondrial respiration and glycolysis, and suppression of metastatic ability.FOOD Funct.9 (4), 2158–2170. doi:10.1039/c8fo00165k PubMed Abstract|CrossRef Full Text|Google Scholar An, Y., Wang, B., Wang, X., Dong, G., Jia, J., and Yang, Q. (2020). SIRT1 inhibits chemoresistance and cancer stemness of gastric cancer by initiating an AMPK/FOXO3 positive feedback loop.Cell Death Dis.11 (2), 115. doi:10.1038/s41419-020-2308-4 PubMed Abstract|CrossRef Full Text|Google Scholar Antolin, A. A., Workman, P., Mestres, J., and Al-Lazikani, B. (2016). Polypharmacology in precision oncology: current applications and future prospects.Curr. Pharm. Des.22 (46), 6935–6945. doi:10.2174/1381612822666160923115828 PubMed Abstract|CrossRef Full Text|Google Scholar Benboubker, V., Ramzy, G. M., Jacobs, S., and Nowak-Sliwinska, P. (2024). Challenges in validation of combination treatment strategies for CRC using patient-derived organoids.J. Exp. Clin. Cancer Res. CR43 (1), 259. doi:10.1186/s13046-024-03173-x PubMed Abstract|CrossRef Full Text|Google Scholar Benson, A. B., Venook, A. P., Cederquist, L., Chan, E., Chen, Y. J., Cooper, H. S., et al. (2017). Colon cancer, version 1.2017, NCCN clinical practice guidelines in oncology.J. Natl. Compr. Cancer Netw. JNCCN15 (3), 370–398. doi:10.6004/jnccn.2017.0036 PubMed Abstract|CrossRef Full Text|Google Scholar Brandl, L., Kirstein, N., Neumann, J., Sendelhofert, A., Vieth, M., Kirchner, T., et al. (2018). The c-MYC/NAMPT/SIRT1 feedback loop is activated in early classical and serrated route colorectal cancer and represents a therapeutic target.Med. Oncol. N. Lond Engl.36 (1), 5. doi:10.1007/s12032-018-1225-1 PubMed Abstract|CrossRef Full Text|Google Scholar Bray, F., Laversanne, M., Weiderpass, E., and Soerjomataram, I. (2021). The ever-increasing importance of cancer as a leading cause of premature death worldwide.Cancer127 (16), 3029–3030. doi:10.1002/cncr.33587 PubMed Abstract|CrossRef Full Text|Google Scholar Buhrmann, C., Shayan, P., Goel, A., and Shakibaei, M. (2017). Resveratrol regulates colorectal cancer cell invasion by modulation of focal adhesion molecules.Nutrients9 (10), 1073. doi:10.3390/nu9101073 PubMed Abstract|CrossRef Full Text|Google Scholar Buhrmann, C., Shayan, P., Popper, B., Goel, A., and Shakibaei, M. (2016). Sirt1 is required for resveratrol-mediated chemopreventive effects in colorectal cancer cells.NUTRIENTS8 (3), 145. doi:10.3390/nu8030145 PubMed Abstract|CrossRef Full Text|Google Scholar Cantó, C., Menzies, K. J., and Auwerx, J. (2015). NAD(+) metabolism and the control of energy homeostasis: a balancing act between mitochondria and the nucleus.Cell Metab.22 (1), 31–53. doi:10.1016/j.cmet.2015.05.023 PubMed Abstract|CrossRef Full Text|Google Scholar Ceballos, M. P., Quiroga, A. D., and Palma, N. F. (2023). Role of sirtuins in hepatocellular carcinoma progression and multidrug resistance: mechanistical and pharmacological perspectives.Biochem. Pharmacol.212, 115573. doi:10.1016/j.bcp.2023.115573 PubMed Abstract|CrossRef Full Text|Google Scholar Cha, E. J., Noh, S. J., Kwon, K. S., Kim, C. Y., Park, B. H., Park, H. S., et al. (2009). Expression of DBC1 and SIRT1 is associated with poor prognosis of gastric carcinoma.Clin. Cancer Res. Off. J. Am. Assoc. Cancer Res.15 (13), 4453–4459. doi:10.1158/1078-0432.CCR-08-3329 PubMed Abstract|CrossRef Full Text|Google Scholar Chen, H. Y., Cheng, H. L., Lee, Y. H., Yuan, T. M., Chen, S. W., Lin, Y. Y., et al. (2017). Tumor-associated NADH oxidase (tNOX)-NAD+-sirtuin 1 axis contributes to oxaliplatin-induced apoptosis of gastric cancer cells.Oncotarget8 (9), 15338–15348. doi:10.18632/oncotarget.14787 PubMed Abstract|CrossRef Full Text|Google Scholar Chen, X., Sun, K., Jiao, S., Cai, N., Zhao, X., Zou, H., et al. (2014). High levels of SIRT1 expression enhance tumorigenesis and associate with a poor prognosis of colorectal carcinoma patients.Sci. Rep.4, 7481. doi:10.1038/srep07481 PubMed Abstract|CrossRef Full Text|Google Scholar Chen, Y., Xie, T., Ye, Z., Wang, F., Long, D., Jiang, M., et al. (2019). ADC correlation with Sirtuin1 to assess early chemoradiotherapy response of locally advanced esophageal carcinoma patients.Radiat. Oncol. Lond Engl.14 (1), 192. doi:10.1186/s13014-019-1393-y PubMed Abstract|CrossRef Full Text|Google Scholar Cheng, F., Su, L., Yao, C., Liu, L., Shen, J., Liu, C., et al. (2016). SIRT1 promotes epithelial-mesenchymal transition and metastasis in colorectal cancer by regulating Fra-1 expression.Cancer Lett.375 (2), 274–283. doi:10.1016/j.canlet.2016.03.010 PubMed Abstract|CrossRef Full Text|Google Scholar Cheng, X., Xu, X., Chen, D., Zhao, F., and Wang, W. (2019). Therapeutic potential of targeting the Wnt/β-catenin signaling pathway in colorectal cancer.Biomed. Pharmacother. Biomedecine Pharmacother.110, 473–481. doi:10.1016/j.biopha.2018.11.082 PubMed Abstract|CrossRef Full Text|Google Scholar Chu, J., Li, H., Xing, Y., Jia, J., Sheng, J., Yang, L., et al. (2019). LncRNA MNX1-AS1 promotes progression of esophageal squamous cell carcinoma by regulating miR-34a/SIRT1 axis.Biomed. Pharmacother. Biomedecine Pharmacother.116, 109029. doi:10.1016/j.biopha.2019.109029 PubMed Abstract|CrossRef Full Text|Google Scholar Deng, X. J., Zheng, H. L., Ke, X. Q., Deng, M., Ma, Z. Z., Zhu, Y., et al. (2021). Hsa-miR-34a-5p reverses multidrug resistance in gastric cancer cells by targeting the 3’-UTR of SIRT1 and inhibiting its expression.Cell Signal84, 110016. doi:10.1016/j.cellsig.2021.110016 PubMed Abstract|CrossRef Full Text|Google Scholar Diesch, J., Sanij, E., Gilan, O., Love, C., Tran, H., Fleming, N. I., et al. (2014). Widespread FRA1-dependent control of mesenchymal transdifferentiation programs in colorectal cancer cells.PloS One9 (3), e88950. doi:10.1371/journal.pone.0088950 PubMed Abstract|CrossRef Full Text|Google Scholar Dong, G., Wang, B., An, Y., Li, J., Wang, X., Jia, J., et al. (2018). SIRT1 suppresses the migration and invasion of gastric cancer by regulating ARHGAP5 expression.Cell Death Dis.9 (10), 977. doi:10.1038/s41419-018-1033-8 PubMed Abstract|CrossRef Full Text|Google Scholar El-Kott, A. F., El-Kenawy, A. E., Elbealy, E. R., S. Alshehri, A., S. Khalifa, H., Mohammed Bin-Meferij, M., et al. (2021). Exendin-4 inhibits the survival and invasiveness of two colorectal cancer cell lines via suppressing GS3Kβ/β-catenin/NF-κB axis through activating SIRT1.BIOCELL45 (5), 1337–1353. doi:10.32604/biocell.2021.015464 CrossRef Full Text|Google Scholar Fan, W., and Luo, J. (2010). SIRT1 regulates UV-induced DNA repair through deacetylating XPA.Mol. Cell39 (2), 247–258. doi:10.1016/j.molcel.2010.07.006 PubMed Abstract|CrossRef Full Text|Google Scholar Fang, C., Qiu, S., Sun, F., Li, W., Wang, Z., Yue, B., et al. (2017). Long non-coding RNA HNF1A-AS1 mediated repression of miR-34a/SIRT1/p53 feedback loop promotes the metastatic progression of colon cancer by functioning as a competing endogenous RNA.Cancer Lett.410, 50–62. doi:10.1016/j.canlet.2017.09.012 PubMed Abstract|CrossRef Full Text|Google Scholar Fang, H., Huang, Y., Luo, Y., Tang, J., Yu, M., Zhang, Y., et al. (2022). SIRT1 induces the accumulation of TAMs at colorectal cancer tumor sites via the CXCR4/CXCL12 axis.Cell Immunol.371, 104458. doi:10.1016/j.cellimm.2021.104458 PubMed Abstract|CrossRef Full Text|Google Scholar Fang, Z., Gong, C., Yu, S., Zhou, W., Hassan, W., Li, H., et al. (2018). NFYB-induced high expression of E2F1 contributes to oxaliplatin resistance in colorectal cancer via the enhancement of CHK1 signaling.CANCER Lett.415, 58–72. doi:10.1016/j.canlet.2017.11.040 PubMed Abstract|CrossRef Full Text|Google Scholar Feng, A. N., Zhang, L. H., Fan, X. S., Huang, Q., Ye, Q., Wu, H. Y., et al. (2011). Expression of SIRT1 in gastric cardiac cancer and its clinicopathologic significance.Int. J. Surg. Pathol.19 (6), 743–750. doi:10.1177/1066896911412181 PubMed Abstract|CrossRef Full Text|Google Scholar Feng, W., Ma, C., Rao, H., Zhang, W., Liu, C., Xu, Y., et al. (2023). Setd2 deficiency promotes gastric tumorigenesis through inhibiting the SIRT1/FOXO pathway.Cancer Lett.579, 216470. doi:10.1016/j.canlet.2023.216470 PubMed Abstract|CrossRef Full Text|Google Scholar Firestein, R., Blander, G., Michan, S., Oberdoerffer, P., Ogino, S., Campbell, J., et al. (2008). The SIRT1 deacetylase suppresses intestinal tumorigenesis and colon cancer growth.PloS One3 (4), e2020. doi:10.1371/journal.pone.0002020 PubMed Abstract|CrossRef Full Text|Google Scholar Frye, R. A. (2000). Phylogenetic classification of prokaryotic and eukaryotic Sir2-like proteins.Biochem. Biophys. Res. Commun.273 (2), 793–798. doi:10.1006/bbrc.2000.3000 PubMed Abstract|CrossRef Full Text|Google Scholar Fu, L., Han, B. K., Meng, F. F., Wang, J. W., Wang, T. Y., Li, H. J., et al. (2021). Jaridon 6, a new diterpene from Rabdosia rubescens (Hemsl.) Hara, can display anti-gastric cancer resistance by inhibiting SIRT1 and inducing autophagy.Phytother. Res. PTR35 (10), 5720–5733. doi:10.1002/ptr.7231 PubMed Abstract|CrossRef Full Text|Google Scholar García-Martínez, J. M., Chocarro-Calvo, A., Martínez-Useros, J., Fernández-Aceñero, M. J., Fiuza, M. C., Cáceres-Rentero, J., et al. (2023). Vitamin D induces SIRT1 activation through K610 deacetylation in colon cancer.eLife12. doi:10.7554/eLife.86913 PubMed Abstract|CrossRef Full Text|Google Scholar Ghosh, A., Sengupta, A., Seerapu, G. P. K., Nakhi, A., Venkat Shivaji Ramarao, E. V., Bung, N., et al. (2017). A novel SIRT1 inhibitor, 4bb induces apoptosis in HCT116 human colon carcinoma cells partially by activating p53.Biochem. Biophys. Res. Commun.488 (3), 562–569. doi:10.1016/j.bbrc.2017.05.089 PubMed Abstract|CrossRef Full Text|Google Scholar Guan, J., Zhang, Z. Y., Sun, J. H., Wang, X. P., Zhou, Z. Q., and Qin, L. (2023). LITAF inhibits colorectal cancer stemness and metastatic behavior by regulating FOXO1-mediated SIRT1 expression.Clin. Exp. Metastasis40 (4), 309–320. doi:10.1007/s10585-023-10213-x PubMed Abstract|CrossRef Full Text|Google Scholar Hallows, W. C., Yu, W., and Denu, J. M. (2012). Regulation of glycolytic enzyme phosphoglycerate mutase-1 by Sirt1 protein-mediated deacetylation.J. Biol. Chem.287 (6), 3850–3858. doi:10.1074/jbc.M111.317404 PubMed Abstract|CrossRef Full Text|Google Scholar Han, F., Zhang, S., Liang, J., and Qiu, W. (2018). Clinicopathological and predictive significance of SIRT1 and peroxisome proliferator-activated receptor gamma in esophageal squamous cell carcinoma: the correlation with EGFR and Survivin.Pathol. Res. Pract.214 (5), 686–690. doi:10.1016/j.prp.2018.03.018 PubMed Abstract|CrossRef Full Text|Google Scholar Harada, G., Pattarawat, P., Ito, K., Matsumoto, T., Hasegawa, T., and Katakura, Y. (2016).Lactobacillus brevisT2102 suppresses the growth of colorectal cancer cells by activatingSIRT1.J. Funct. FOODS23, 444–452. doi:10.1016/j.jff.2016.01.016 CrossRef Full Text|Google Scholar He, F., Chen, Y., He, D., and He, S. (2023). USP14-mediated deubiquitination of SIRT1 in macrophage promotes fatty acid oxidation amplification and M2 phenotype polarization.Biochem. Biophys. Res. Commun.646, 19–29. doi:10.1016/j.bbrc.2022.12.076 PubMed Abstract|CrossRef Full Text|Google Scholar He, Z., Yi, J., Jin, L., Pan, B., Chen, L., and Song, H. (2016). Overexpression of Sirtuin-1 is associated with poor clinical outcome in esophageal squamous cell carcinoma.Tumour Biol. J. Int. Soc. Oncodevelopmental Biol. Med.37 (6), 7139–7148. doi:10.1007/s13277-015-4459-y PubMed Abstract|CrossRef Full Text|Google Scholar Hirai, S., Endo, S., Saito, R., Hirose, M., Ueno, T., Suzuki, H., et al. (2014). Antitumor effects of a sirtuin inhibitor, tenovin-6, against gastric cancer cells via death receptor 5 up-regulation.PloS One9 (7), e102831. doi:10.1371/journal.pone.0102831 PubMed Abstract|CrossRef Full Text|Google Scholar Hrzic, R., Simons, CCJM, Schouten, L. J., van Engeland, M., Brandt, P., and Weijenberg, M. P. (2020). Investigation of sirtuin 1 polymorphisms in relation to the risk of colorectal cancer by molecular subtype.Sci. Rep.10 (1), 3359. doi:10.1038/s41598-020-60300-2 PubMed Abstract|CrossRef Full Text|Google Scholar Jang, S. H., Min, K. W., Paik, S. S., and Jang, K. S. (2012). Loss of SIRT1 histone deacetylase expression associates with tumour progression in colorectal adenocarcinoma.J. Clin. Pathol.65 (8), 735–739. doi:10.1136/jclinpath-2012-200685 PubMed Abstract|CrossRef Full Text|Google Scholar Jiang, B., Chen, J. H., Yuan, W. Z., Ji, J. T., Liu, Z. Y., Wu, L., et al. (2016). Prognostic and clinical value of Sirt1 expression in gastric cancer: a systematic meta-analysis.J. Huazhong Univ. Sci. Technol. Med. Sci. Hua Zhong Ke Ji Xue Xue Bao Yi Xue Ying Wen Ban. Huazhong Keji Daxue Xuebao Yixue Yingdewen Ban.36 (2), 278–284. doi:10.1007/s11596-016-1580-0 PubMed Abstract|CrossRef Full Text|Google Scholar Jiang, K., Lyu, L., Shen, Z., Zhang, J., Zhang, H., Dong, J., et al. (2014). Overexpression of SIRT1 is a poor prognostic factor for advanced colorectal cancer.Chin. Med. J. Engl.127 (11), 2021–2024. doi:10.3760/cma.j.issn.0366-6999.20140044 PubMed Abstract|CrossRef Full Text|Google Scholar Jung, Y. R., Kim, E. J., Choi, H. J., Park, J. J., Kim, H. S., Lee, Y. J., et al. (2015). Aspirin targets SIRT1 and AMPK to induce senescence of colorectal carcinoma cells.Mol. Pharmacol.88 (4), 708–719. doi:10.1124/mol.115.098616 PubMed Abstract|CrossRef Full Text|Google Scholar Kabra, N., Li, Z., Chen, L., Li, B., Zhang, X., Wang, C., et al. (2009). SirT1 is an inhibitor of proliferation and tumor formation in colon cancer.J. Biol. Chem.284 (27), 18210–18217. doi:10.1074/jbc.M109.000034 PubMed Abstract|CrossRef Full Text|Google Scholar Kang, X., Kong, B., Chen, Q., and Zhao, S. (2021). Low expression of miR-138 inhibit the proliferation, migration and invasion of colorectal cancer and affect patient survival by targeting SIRT1.Transl. CANCER Res.10 (7), 3548–3559. doi:10.21037/tcr-21-559 PubMed Abstract|CrossRef Full Text|Google Scholar Kang, Y. J., Jang, J. Y., Kwon, Y. H., Lee, J. H., Lee, S., Park, Y., et al. (2022a). MHY2245, a sirtuin inhibitor, induces cell cycle arrest and apoptosis in HCT116 human colorectal cancer cells.Int. J. Mol. Sci.23 (3), 1590. doi:10.3390/ijms23031590 PubMed Abstract|CrossRef Full Text|Google Scholar Kang, Y. J., Kwon, Y. H., Jang, J. Y., Lee, J. H., Lee, S., Park, Y., et al. (2022b). MHY2251, a new SIRT1 inhibitor, induces apoptosis via JNK/p53 pathway in HCT116 human colorectal cancer cells.Biomol. Ther.31, 73–81. doi:10.4062/biomolther.2022.044 PubMed Abstract|CrossRef Full Text|Google Scholar Kimura, T. (2020). Non-coding natural antisense RNA: mechanisms of action in the regulation of target gene expression and its clinical implications.Yakugaku Zasshi140 (5), 687–700. doi:10.1248/yakushi.20-00002 PubMed Abstract|CrossRef Full Text|Google Scholar Kopp, F., and Mendell, J. T. (2018). Functional classification and experimental dissection of long noncoding RNAs.Cell172 (3), 393–407. doi:10.1016/j.cell.2018.01.011 PubMed Abstract|CrossRef Full Text|Google Scholar Kriegl, L. (2013).In situanalyses of molecular mechanisms of colorectal carcinogenesis.PATHOLOGE34, 269–273. doi:10.1007/s00292-013-1821-y PubMed Abstract|CrossRef Full Text|Google Scholar Kriegl, L., Vieth, M., Kirchner, T., and Menssen, A. (2012). Up-regulation of c-MYC and SIRT1 expression correlates with malignant transformation in the serrated route to colorectal cancer.Oncotarget3 (10), 1182–1193. doi:10.18632/oncotarget.628 PubMed Abstract|CrossRef Full Text|Google Scholar Kupis, W., Pałyga, J., Tomal, E., and Niewiadomska, E. (2016). The role of sirtuins in cellular homeostasis.J. Physiol. Biochem.72, 371–380. doi:10.1007/s13105-016-0492-6 PubMed Abstract|CrossRef Full Text|Google Scholar Lee, G. J., Jung, Y. H., Kim, T. J., Chong, Y., Jeong, S. W., Lee, I. K., et al. (2021). Surtuin 1 as a potential prognostic biomarker in very elderly patients with colorectal cancer.Korean J. Intern Med.36 (Suppl. 1), S235–S244. doi:10.3904/kjim.2019.249 PubMed Abstract|CrossRef Full Text|Google Scholar Lee, W. Y., Lee, W. T., Cheng, C. H., Chen, K. C., Chou, C. M., Chung, C. H., et al. (2015). Repositioning antipsychotic chlorpromazine for treating colorectal cancer by inhibiting sirtuin 1.ONCOTARGET6 (29), 27580–27595. doi:10.18632/oncotarget.4768 PubMed Abstract|CrossRef Full Text|Google Scholar Li, A., Tan, Z., Fu, C., Wang, H., and Yuan, J. (2017). Analysis of risk factors for bone metastasis after radical resection of colorectal cancer within 5 years.Zhonghua Wei Chang. Wai Ke Za Zhi Chin. J. Gastrointest. Surg.20 (1), 58–61. doi:10.3760/cma.j.issn.1671-0274.2017.01.012 PubMed Abstract|CrossRef Full Text|Google Scholar Li, H. J., Che, X. M., Zhao, W., He, S. C., Zhang, Z. L., Chen, R., et al. (2013). Diet-induced obesity promotes murine gastric cancer growth through a nampt/sirt1/c-myc positive feedback loop.Oncol. Rep.30 (5), 2153–2160. doi:10.3892/or.2013.2678 PubMed Abstract|CrossRef Full Text|Google Scholar Li, J., Dong, G., Wang, B., Gao, W., and Yang, Q. (2016). miR-543 promotes gastric cancer cell proliferation by targeting SIRT1.Biochem. Biophys. Res. Commun.469 (1), 15–21. doi:10.1016/j.bbrc.2015.11.062 PubMed Abstract|CrossRef Full Text|Google Scholar Li, Q. K., Liu, Y. K., Li, J. W., Liu, Y. T., Li, Y. F., and Li, B. H. (2021). Circ-sirt1 inhibits growth and invasion of gastric cancer by sponging miR-132-3p/miR-212-3p and upregulating sirt1 expression.Neoplasma68 (4), 780–787. doi:10.4149/neo_2021_210218N222 PubMed Abstract|CrossRef Full Text|Google Scholar Li, X. (2013). SIRT1 and energy metabolism.Acta Biochim. Biophys. Sin.45 (1), 51–60. doi:10.1093/abbs/gms108 PubMed Abstract|CrossRef Full Text|Google Scholar Lien, E. C., Westermark, A. M., Zhang, Y., Yuan, C., Li, Z., Lau, A. N., et al. (2021). Low glycaemic diets alter lipid metabolism to influence tumour growth.Nature599 (7884), 302–307. doi:10.1038/s41586-021-04049-2 PubMed Abstract|CrossRef Full Text|Google Scholar Liu, H., Liu, N., Zhao, Y., Zhu, X., Wang, C., Liu, Q., et al. (2019). Oncogenic USP22 supports gastric cancer growth and metastasis by activating c-Myc/NAMPT/SIRT1-dependent FOXO1 and YAP signaling.Aging11 (21), 9643–9660. doi:10.18632/aging.102410 PubMed Abstract|CrossRef Full Text|Google Scholar Liu, L., Li, S. W., Yuan, W., Tang, J., and Sang, Y. (2021). Downregulation of SUN2 promotes metastasis of colon cancer by activating BDNF/TrkB signalling by interacting with SIRT1.J. Pathol.254 (5), 531–542. doi:10.1002/path.5697 PubMed Abstract|CrossRef Full Text|Google Scholar Liu, Y., Pan, L., Li, Y., Deng, Y., Han, X., Fu, H., et al. (2022). Cystathionine-β-synthase (CBS)/H2S system promotes lymph node metastasis of esophageal squamous cell carcinoma (ESCC) by activating SIRT1.Carcinogenesis43 (4), 382–392. doi:10.1093/carcin/bgac002 PubMed Abstract|CrossRef Full Text|Google Scholar Lu, J., Kornmann, M., and Traub, B. (2023). Role of epithelial to mesenchymal transition in colorectal cancer.Int. J. Mol. Sci.24 (19), 14815. doi:10.3390/ijms241914815 PubMed Abstract|CrossRef Full Text|Google Scholar Lucena-Cacace, A., Otero-Albiol, D., Jiménez-García, M. P., Muñoz-Galvan, S., and Carnero, A. (2018). NAMPT is a potent oncogene in colon cancer progression that modulates cancer stem cell properties and resistance to therapy through Sirt1 and PARP.Clin. Cancer Res. Off. J. Am. Assoc. Cancer Res.24 (5), 1202–1215. doi:10.1158/1078-0432.CCR-17-2575 PubMed Abstract|CrossRef Full Text|Google Scholar Luo, Y., Chen, J. J., Lv, Q., Qin, J., Huang, Y. Z., Yu, M. H., et al. (2019). Long non-coding RNA NEAT1 promotes colorectal cancer progression by competitively binding miR-34a with SIRT1 and enhancing the Wnt/β-catenin signaling pathway.Cancer Lett.440-441, 11–22. doi:10.1016/j.canlet.2018.10.002 PubMed Abstract|CrossRef Full Text|Google Scholar Lv, L., Shen, Z., Zhang, J., Zhang, H., Dong, J., Yan, Y., et al. (2014). Clinicopathological significance of SIRT1 expression in colorectal adenocarcinoma.Med. Oncol. N. Lond Engl.31 (6), 965. doi:10.1007/s12032-014-0965-9 PubMed Abstract|CrossRef Full Text|Google Scholar Ma, M. C., Chiu, T. J., Lu, H. I., Huang, W. T., Lo, C. M., Tien, W. Y., et al. (2018a). SIRT1 overexpression is an independent prognosticator for patients with esophageal squamous cell carcinoma.J. Cardiothorac. Surg.13, 25. doi:10.1186/s13019-018-0718-5 PubMed Abstract|CrossRef Full Text|Google Scholar Ma, Y., Zhang, J., Wen, L., and Lin, A. (2018b). Membrane-lipid associated lncRNA: a new regulator in cancer signaling.Cancer Lett.419, 27–29. doi:10.1016/j.canlet.2018.01.008 PubMed Abstract|CrossRef Full Text|Google Scholar Meng, F., Yang, M., Chen, Y., Chen, W., and Wang, W. (2021). miR-34a induces immunosuppression in colorectal carcinoma through modulating a SIRT1/NF-κB/B7-H3/TNF-α axis.Cancer Immunol. Immunother. CII70 (8), 2247–2259. doi:10.1007/s00262-021-02862-2 PubMed Abstract|CrossRef Full Text|Google Scholar Menssen, A. (2013). c-MYC-mediated regulations in colorectal cancer.Pathol34 (Suppl. 2), 274–276. doi:10.1007/s00292-013-1819-5 PubMed Abstract|CrossRef Full Text|Google Scholar Menssen, A., Hydbring, P., Kapelle, K., Vervoorts, J., Diebold, J., Lüscher, B., et al. (2012). The c-MYC oncoprotein, the NAMPT enzyme, the SIRT1-inhibitor DBC1, and the SIRT1 deacetylase form a positive feedback loop.Proc. Natl. Acad. Sci. U. S. A.109 (4), E187–E196. doi:10.1073/pnas.1105304109 PubMed Abstract|CrossRef Full Text|Google Scholar Michan, S., and Sinclair, D. (2007). Sirtuins in mammals: insights into their biological function.Biochem. J.404 (1), 1–13. doi:10.1042/BJ20070140 PubMed Abstract|CrossRef Full Text|Google Scholar Michishita, E., Park, J. Y., Burneskis, J. M., Barrett, J. C., and Horikawa, I. (2005). Evolutionarily conserved and nonconserved cellular localizations and functions of human SIRT proteins.Mol. Biol. Cell16 (10), 4623–4635. doi:10.1091/mbc.E05-01-0033 PubMed Abstract|CrossRef Full Text|Google Scholar Mohammadi Saravle, S., Ahmadi, H. M., Mohammadi, E., Sheikhesmaeili, F., and Nikkhou, B. (2018). Sirt1 gene expression and gastric epithelial cells tumor stage in patients withHelicobacter pyloriinfection.Asian Pac J. Cancer Prev. APJCP19 (4), 913–916. doi:10.22034/APJCP.2018.19.4.913 CrossRef Full Text|Google Scholar Morishita, H., Otsuka, R., Murakami, K., Endo, S., Toyozumi, T., Matsumoto, Y., et al. (2024). SIRT1 promotes chemoradiotherapy resistance in esophageal squamous cell carcinoma.Oncology102 (11), 960–968. doi:10.1159/000540247 PubMed Abstract|CrossRef Full Text|Google Scholar Noguchi, A., Kikuchi, K., Zheng, H., Takahashi, H., Miyagi, Y., Aoki, I., et al. (2014). SIRT1 expression is associated with a poor prognosis, whereas DBC1 is associated with favorable outcomes in gastric cancer.Cancer Med.3 (6), 1553–1561. doi:10.1002/cam4.310 PubMed Abstract|CrossRef Full Text|Google Scholar Nosho, K., Shima, K., Irahara, N., Kure, S., Firestein, R., Baba, Y., et al. (2009). SIRT1 histone deacetylase expression is associated with microsatellite instability and CpG island methylator phenotype in colorectal cancer.Mod. Pathol. Off. J. U. S. Can. Acad. Pathol. Inc.22 (7), 922–932. doi:10.1038/modpathol.2009.49 PubMed Abstract|CrossRef Full Text|Google Scholar Okazaki, S., Schirripa, M., Loupakis, F., Cao, S., Zhang, W., Yang, D., et al. (2017). Tandem repeat variation near theHIC1(hypermethylated in cancer 1) promoter predicts outcome of oxaliplatin-based chemotherapy in patients with metastatic colorectal cancer.CANCER123 (22), 4506–4514. doi:10.1002/cncr.30880 PubMed Abstract|CrossRef Full Text|Google Scholar Otsuka, R., Morishita, H., Iida, K., Hayano, K., Murakami, K., Endo, S., et al. (2023). Serum versus tissue SIRT1 as potentially valuable biomarkers in gastric cancer.Anticancer Res.43 (4), 1485–1491. doi:10.21873/anticanres.16297 PubMed Abstract|CrossRef Full Text|Google Scholar Özcan, Ö., Belli, A. K., Sakallı Çetin, E., Kara, M., Çelik, Ö. İ., Kaplan, M., et al. (2019). Upregulation of SIRT1 gene in gastric adenocarcinoma.Turk J. Gastroenterol. Off. J. Turk Soc. Gastroenterol.30 (4), 326–330. doi:10.5152/tjg.2019.18550 PubMed Abstract|CrossRef Full Text|Google Scholar Pan, J. H., Zhou, H., Zhu, S. B., Huang, J. L., Zhao, X. X., Ding, H., et al. (2019). Nicotinamide phosphoribosyl transferase regulates cell growth via the Sirt1/P53 signaling pathway and is a prognosis marker in colorectal cancer.J. Cell Physiol.234 (4), 4385–4395. doi:10.1002/jcp.27228 PubMed Abstract|CrossRef Full Text|Google Scholar Porta, C., Ippolito, A., Consonni, F. M., Carraro, L., Celesti, G., Correale, C., et al. (2018). Protumor steering of cancer inflammation by p50 NF-κB enhances colorectal cancer progression.Cancer Immunol. Res.6 (5), 578–593. doi:10.1158/2326-6066.CIR-17-0036 PubMed Abstract|CrossRef Full Text|Google Scholar Puca, R., Nardinocchi, L., Starace, G., Rechavi, G., Sacchi, A., Givol, D., et al. (2010). Nox1 is involved in p53 deacetylation and suppression of its transcriptional activity and apoptosis.Free Radic. Biol. Med.48 (10), 1338–1346. doi:10.1016/j.freeradbiomed.2010.02.015 PubMed Abstract|CrossRef Full Text|Google Scholar Purushotham, A., Schug, T. T., Xu, Q., Surapureddi, S., Guo, X., and Li, X. (2009). Hepatocyte-specific deletion of SIRT1 alters fatty acid metabolism and results in hepatic steatosis and inflammation.Cell Metab.9 (4), 327–338. doi:10.1016/j.cmet.2009.02.006 PubMed Abstract|CrossRef Full Text|Google Scholar Pyo, J. S., and Kim, E. K. (2019). Clinicopathological significance and prognostic implication of nuclear factor-κB activation in colorectal cancer.Pathol. Res. Pract.215 (8), 152469. doi:10.1016/j.prp.2019.152469 PubMed Abstract|CrossRef Full Text|Google Scholar Qiao, P. F., Yao, L., and Zeng, Z. L. (2020). Catalpol-mediated microRNA-34a suppresses autophagy and malignancy by regulating SIRT1 in colorectal cancer.Oncol. Rep.43 (4), 1053–1066. doi:10.3892/or.2020.7494 PubMed Abstract|CrossRef Full Text|Google Scholar Qin, T., Liu, W., Huo, J., Li, L., Zhang, X., Shi, X., et al. (2018). SIRT1 expression regulates the transformation of resistant esophageal cancer cells via the epithelial-mesenchymal transition.Biomed. Pharmacother. Biomedecine Pharmacother.103, 308–316. doi:10.1016/j.biopha.2018.04.032 PubMed Abstract|CrossRef Full Text|Google Scholar Qiu, G., Li, X., Wei, C., Che, X., He, S., Lu, J., et al. (2016). The prognostic role of SIRT1-autophagy Axis in gastric cancer.Dis. Markers2016, 6869415. doi:10.1155/2016/6869415 PubMed Abstract|CrossRef Full Text|Google Scholar Qu, X., Liu, B., Wang, L., Liu, L., Zhao, W., Liu, C., et al. (2023). Loss of cancer-associated fibroblast-derived exosomal DACT3-AS1 promotes malignant transformation and ferroptosis-mediated oxaliplatin resistance in gastric cancer.DRUG Resist Updat68, 100936. doi:10.1016/j.drup.2023.100936 PubMed Abstract|CrossRef Full Text|Google Scholar Rodgers, J. T., Lerin, C., Haas, W., Gygi, S. P., Spiegelman, B. M., and Puigserver, P. (2005). Nutrient control of glucose homeostasis through a complex of PGC-1alpha and SIRT1.Nature434 (7029), 113–118. doi:10.1038/nature03354 PubMed Abstract|CrossRef Full Text|Google Scholar Sastre-Serra, J., Ahmiane, Y., Roca, P., Oliver, J., and Pons, D. G. (2019). Xanthohumol, a hop-derived prenylflavonoid present in beer, impairs mitochondrial functionality of SW620 colon cancer cells.Int. J. Food Sci. Nutr.70 (4), 396–404. doi:10.1080/09637486.2018.1540558 PubMed Abstract|CrossRef Full Text|Google Scholar Shen, T., Cai, L. D., Liu, Y. H., Li, S., Gan, W. J., Li, X. M., et al. (2018). Ube2v1-mediated ubiquitination and degradation of Sirt1 promotes metastasis of colorectal cancer by epigenetically suppressing autophagy.J. Hematol. OncolJ Hematol. Oncol.11 (1), 95. doi:10.1186/s13045-018-0638-9 PubMed Abstract|CrossRef Full Text|Google Scholar Shen, Z. L., Wang, B., Jiang, K. W., Ye, C. X., Cheng, C., Yan, Y. C., et al. (2016). Downregulation of miR-199b is associated with distant metastasis in colorectal cancer via activation of SIRT1 and inhibition of CREB/KISS1 signaling.Oncotarget7 (23), 35092–35105. doi:10.18632/oncotarget.9042 PubMed Abstract|CrossRef Full Text|Google Scholar Shi, Y., Yang, Z., Zhang, T., Shen, L., Li, Y., and Ding, S. (2019). SIRT1-targeted miR-543 autophagy inhibition and epithelial-mesenchymal transition promotion inHelicobacter pyloriCagA-associated gastric cancer.Cell Death Dis.10 (9), 625. doi:10.1038/s41419-019-1859-8 PubMed Abstract|CrossRef Full Text|Google Scholar Shin, A. E., Giancotti, F. G., and Rustgi, A. K. (2023). Metastatic colorectal cancer: mechanisms and emerging therapeutics.Trends Pharmacol. Sci.44 (4), 222–236. doi:10.1016/j.tips.2023.01.003 PubMed Abstract|CrossRef Full Text|Google Scholar Stunkel, W., Peh, B. K., Tan, Y. C., Nayagam, V. M., Wang, X., Salto-Tellez, M., et al. (2007). Function of the SIRT1 protein deacetylase in cancer.Biotechnol. J.2 (11), 1360–1368. doi:10.1002/biot.200700087 PubMed Abstract|CrossRef Full Text|Google Scholar Su, B. C., Xiao, K. M., Wang, K. L., Yang, S. F., Huang, Z. X., and Luo, J. W. (2023). ATGL promotes colorectal cancer growth by regulating autophagy process and SIRT1 expression.Med. Oncol. N. Lond Engl.40 (12), 350. doi:10.1007/s12032-023-02148-w PubMed Abstract|CrossRef Full Text|Google Scholar Subramaniyan, B., Kumar, V., and Mathan, G. (2017). Effect of sodium salt of Butrin, a novel compound isolated from Butea monosperma flowers on suppressing the expression of SIRT1 and Aurora B kinase-mediated apoptosis in colorectal cancer cells.Biomed. Pharmacother. Biomedecine Pharmacother.90, 402–413. doi:10.1016/j.biopha.2017.03.086 PubMed Abstract|CrossRef Full Text|Google Scholar Sun, L., Xing, J., Zhou, X., Song, X., and Gao, S. (2024). Wnt/β-catenin signalling, epithelial-mesenchymal transition and crosslink signalling in colorectal cancer cells.Biomed. Pharmacother.175, 116685. doi:10.1016/j.biopha.2024.116685 PubMed Abstract|CrossRef Full Text|Google Scholar Sun, L. N., Zhi, Z., Chen, L. Y., Zhou, Q., Li, X. M., Gan, W. J., et al. (2017). SIRT1 suppresses colorectal cancer metastasis by transcriptional repression of miR-15b-5p.Cancer Lett.409, 104–115. doi:10.1016/j.canlet.2017.09.001 PubMed Abstract|CrossRef Full Text|Google Scholar Sun, P., Yu, H., Zhang, W. Q., Hu, M., and Lv, R. (2012). Lentivirus-mediated siRNA targeting VEGF inhibits gastric cancer growthin vivo.Oncol. Rep.28 (5), 1687–1692. doi:10.3892/or.2012.1966 PubMed Abstract|CrossRef Full Text|Google Scholar Szász, A. M., Lánczky, A., Nagy, Á., Förster, S., Hark, K., Green, J. E., et al. (2016). Cross-validation of survival associated biomarkers in gastric cancer using transcriptomic data of 1,065 patients.Oncotarget7 (31), 49322–49333. doi:10.18632/oncotarget.10337 PubMed Abstract|CrossRef Full Text|Google Scholar Ueno, T., Endo, S., Saito, R., Hirose, M., Hirai, S., Suzuki, H., et al. (2013). The sirtuin inhibitor tenovin-6 upregulates death receptor 5 and enhances cytotoxic effects of 5-fluorouracil and oxaliplatin in colon cancer cells.Oncol. Res.21 (3), 155–164. doi:10.3727/096504013X13854886566598 PubMed Abstract|CrossRef Full Text|Google Scholar Vaquero, A. (2009). The conserved role of sirtuins in chromatin regulation.Int. J. Dev. Biol.53 (2-3), 303–322. doi:10.1387/ijdb.082675av PubMed Abstract|CrossRef Full Text|Google Scholar Vaziri, H., Dessain, S. K., Ng Eaton, E., Imai, S. I., Frye, R. A., Pandita, T. K., et al. (2001). hSIR2(SIRT1) functions as an NAD-dependent p53 deacetylase.Cell107 (2), 149–159. doi:10.1016/s0092-8674(01)00527-x PubMed Abstract|CrossRef Full Text|Google Scholar Vellinga, T. T., Borovski, T., de Boer, V. C. J., Fatrai, S., van Schelven, S., Trumpi, K., et al. (2015). SIRT1/PGC1α-Dependent increase in oxidative phosphorylation supports chemotherapy resistance of colon cancer.Clin. CANCER Res.21 (12), 2870–2879. doi:10.1158/1078-0432.CCR-14-2290 PubMed Abstract|CrossRef Full Text|Google Scholar Vellinga, T. T., de Boer, V. C., Borovski, T., Trumpi, K., Fatrai, S., Kranenburg, O., et al. (2014). Abstract 3351: survival of colorectal cancer cells following chemotherapy relies on a SIRT1-dependent increase in oxidative phosphorylation.CANCER Res.74 (19), 3351. doi:10.1158/1538-7445.AM2014-3351 CrossRef Full Text|Google Scholar Vodenkova, S., Buchler, T., Cervena, K., Veskrnova, V., Vodicka, P., and Vymetalkova, V. (2020). 5-fluorouracil and other fluoropyrimidines in colorectal cancer: past, present and future.Pharmacol. Ther.206, 107447. doi:10.1016/j.pharmthera.2019.107447 PubMed Abstract|CrossRef Full Text|Google Scholar Wang, G., Cheng, Z., Liu, F., Zhang, H., Li, J., and Li, F. (2015). CREB is a key negative regulator of carbonic anhydrase IX (CA9) in gastric cancer.Cell Signal27 (7), 1369–1379. doi:10.1016/j.cellsig.2015.03.019 PubMed Abstract|CrossRef Full Text|Google Scholar Wang, H., Liang, Y., Zhao, L., Deng, J., Li, Y., Zhao, H., et al. (2023). miR-653-3p promotes genomic instability of colorectal cancer cells via targeting SIRT1/TWIST1 signaling pathway.Biochim. Biophys. Acta Mol. Basis Dis.1869 (8), 166821. doi:10.1016/j.bbadis.2023.166821 PubMed Abstract|CrossRef Full Text|Google Scholar Wang, M., Han, D., Yuan, Z., Hu, H., Zhao, Z., Yang, R., et al. (2018). Long non-coding RNA H19 confers 5-Fu resistance in colorectal cancer by promoting SIRT1-mediated autophagy.Cell Death Dis.9 (12), 1149. doi:10.1038/s41419-018-1187-4 PubMed Abstract|CrossRef Full Text|Google Scholar Wang, R., Sun, L., Xia, S., Wu, H., Ma, Y., Zhan, S., et al. (2021a). B7-H3 suppresses doxorubicin-induced senescence-like growth arrest in colorectal cancer through the AKT/TM4SF1/SIRT1 pathway.CELL DEATH Dis.12 (5), 453. doi:10.1038/s41419-021-03736-2 PubMed Abstract|CrossRef Full Text|Google Scholar Wang, T. W., Chern, E., Hsu, C. W., Tseng, K. C., and Chao, H. M. (2020). SIRT1-Mediated expression of CD24 and epigenetic suppression of novel tumor suppressor miR-1185-1 increases colorectal cancer stemness.Cancer Res.80 (23), 5257–5269. doi:10.1158/0008-5472.CAN-19-3188 PubMed Abstract|CrossRef Full Text|Google Scholar Wang, X., Liu, S., Xu, B., Liu, Y., Kong, P., Li, C., et al. (2021b). circ-SIRT1 promotes colorectal cancer proliferation and EMT by recruiting and binding to eIF4A3.Anal. Cell Pathol.2021, 5739769. doi:10.1155/2021/5739769 PubMed Abstract|CrossRef Full Text|Google Scholar Wang, X. W., Jiang, Y. H., Ye, W., Shao, C. F., Xie, J. J., and Li, X. (2023). SIRT1 promotes the progression and chemoresistance of colorectal cancer through the p53/miR-101/KPNA3 axis.Cancer Biol. Ther.24 (1), 2235770. doi:10.1080/15384047.2023.2235770 PubMed Abstract|CrossRef Full Text|Google Scholar Wauters, E., Sanchez-Arévalo Lobo, V. J., Pinho, A. V., Mawson, A., Herranz, D., Wu, J., et al. (2013). Sirtuin-1 regulates acinar-to-ductal metaplasia and supports cancer cell viability in pancreatic cancer.Cancer Res.73 (7), 2357–2367. doi:10.1158/0008-5472.CAN-12-3359 PubMed Abstract|CrossRef Full Text|Google Scholar Wei, Z., Xia, J., Li, J., Cai, J., Shan, J., Zhang, C., et al. (2023). SIRT1 promotes glucolipid metabolic conversion to facilitate tumor development in colorectal carcinoma.Int. J. Biol. Sci.19 (6), 1925–1940. doi:10.7150/ijbs.76704 PubMed Abstract|CrossRef Full Text|Google Scholar WHO (2025). Cancer today. Available online at:https://gco.iarc.who.int/today/(Accessed January 26, 2025). Google Scholar Witherspoon, M., Sandu, D., Lu, C., Wang, K., Edwards, R., Yeung, A., et al. (2019). ETHE1 overexpression promotes SIRT1 and PGC1α mediated aerobic glycolysis, oxidative phosphorylation, mitochondrial biogenesis and colorectal cancer.Oncotarget10 (40), 4004–4017. doi:10.18632/oncotarget.26958 PubMed Abstract|CrossRef Full Text|Google Scholar Zhao, H., Ming, T., Tang, S., Ren, S., Yang, H., Liu, M., et al. (2022). Wnt signaling in colorectal cancer: pathogenic role and therapeutic target.Mol Cancer. 21(1), 144. doi:10.1186/s12943-022-01616-7 PubMed Abstract|CrossRef Full Text|Google Scholar Wu, Q., Shi, M., Meng, W., Wang, Y., Hui, P., and Ma, J. (2019). Long noncoding RNA FOXD3-AS1 promotes colon adenocarcinoma progression and functions as a competing endogenous RNA to regulate SIRT1 by sponging miR-135a-5p.J. Cell Physiol.234 (12), 21889–21902. doi:10.1002/jcp.28752 PubMed Abstract|CrossRef Full Text|Google Scholar Yan, H., and Bu, P. (2021). Non-coding RNA in cancer.Essays Biochem.65 (4), 625–639. doi:10.1042/EBC20200032 PubMed Abstract|CrossRef Full Text|Google Scholar Yan, L., Zhao, Q., Liu, L., Jin, N., Wang, S., and Zhan, X. (2020). Expression of SIRT1 and survivin correlates with poor prognosis in esophageal squamous cell carcinoma.Med. Baltim.99 (34), e21645. doi:10.1097/MD.0000000000021645 PubMed Abstract|CrossRef Full Text|Google Scholar Yang, H., Chen, Y., Jiang, Y., Wang, D., Yan, J., and Zhou, Z. (2020). TP53 mutation influences the efficacy of treatment of colorectal cancer cell lines with a combination of sirtuin inhibitors and chemotherapeutic agents.Exp. Ther. Med.20 (2), 1415–1422. doi:10.3892/etm.2020.8818 PubMed Abstract|CrossRef Full Text|Google Scholar Yang, M., Liu, Q., Dai, M., Peng, R., Li, X., Zuo, W., et al. (2022). FOXQ1-mediated SIRT1 upregulation enhances stemness and radio-resistance of colorectal cancer cells and restores intestinal microbiota function by promoting β-catenin nuclear translocation.J. Exp. Clin. CANCER Res.41 (1), 70. doi:10.1186/s13046-021-02239-4 PubMed Abstract|CrossRef Full Text|Google Scholar Yang, Q., Wang, B., Gao, W., Huang, S., Liu, Z., Li, W., et al. (2013b). SIRT1 is downregulated in gastric cancer and leads to G1-phase arrest via NF-κB/Cyclin D1 signaling.Mol. Cancer Res. MCR11 (12), 1497–1507. doi:10.1158/1541-7786.MCR-13-0214 PubMed Abstract|CrossRef Full Text|Google Scholar Yang, Q., Wang, B., Zang, W., Wang, X., Liu, Z., Li, W., et al. (2013a). Resveratrol inhibits the growth of gastric cancer by inducing G1 phase arrest and senescence in a Sirt1-dependent manner.PloS One8 (11), e70627. doi:10.1371/journal.pone.0070627 PubMed Abstract|CrossRef Full Text|Google Scholar Yang, X., Li, S., Xu, C., Liu, S., Zhang, X., Lian, B., et al. (2024). Sirtuin1 (sirt1) regulates the glycolysis pathway and decreases cisplatin chemotherapeutic sensitivity to esophageal squamous cell carcinoma.Cancer Biol. Ther.25 (1), 2365449. doi:10.1080/15384047.2024.2365449 PubMed Abstract|CrossRef Full Text|Google Scholar Ye, Z., Xie, T., Yan, F., Wang, L., Fang, J., Wang, Z., et al. (2021). MiR-34a reverses radiation resistance on ECA-109 cells by inhibiting PI3K/AKT/mTOR signal pathway through downregulating the expression of SIRT1.Int. J. Radiat. Biol.97 (4), 452–463. doi:10.1080/09553002.2021.1866225 PubMed Abstract|CrossRef Full Text|Google Scholar Yu, E. J., Kim, S. H., Kim, H. J., Heo, K., Ou, C. Y., Stallcup, M. R., et al. (2016). Positive regulation of β-catenin-PROX1 signaling axis by DBC1 in colon cancer progression.ONCOGENE35 (26), 3410–3418. doi:10.1038/onc.2015.401 PubMed Abstract|CrossRef Full Text|Google Scholar Zhang, C., Xu, C., Gao, X., and Yao, Q. (2022b). Platinum-based drugs for cancer therapy and anti-tumor strategies.Theranostics12 (5), 2115–2132. doi:10.7150/thno.69424 PubMed Abstract|CrossRef Full Text|Google Scholar Zhang, H. G., Wang, F. J., Wang, Y., Zhao, Z. X., and Qiao, P. F. (2021). lncRNA GAS5 inhibits malignant progression by regulating macroautophagy and forms a negative feedback regulatory loop with the miR-34a/mTOR/SIRT1 pathway in colorectal cancer.Oncol. Rep.45 (1), 202–216. doi:10.3892/or.2020.7825 PubMed Abstract|CrossRef Full Text|Google Scholar Zhang, L., Guo, X., Zhang, D., Fan, Y., Qin, L., Dong, S., et al. (2017b). Upregulated miR-132 in Lgr5+ gastric cancer stem cell-like cells contributes to cisplatin-resistance via SIRT1/CREB/ABCG2 signaling pathway.Mol. Carcinog.56 (9), 2022–2034. doi:10.1002/mc.22656 PubMed Abstract|CrossRef Full Text|Google Scholar Zhang, L., Wang, X., and Chen, P. (2013b). MiR-204 down regulates SIRT1 and reverts SIRT1-induced epithelial-mesenchymal transition, anoikis resistance and invasion in gastric cancer cells.BMC Cancer13, 290. doi:10.1186/1471-2407-13-290 PubMed Abstract|CrossRef Full Text|Google Scholar Zhang, L. H., Huang, Q., Fan, X. S., Wu, H. Y., Yang, J., and Feng, A. N. (2013a). Clinicopathological significance of SIRT1 and p300/CBP expression in gastroesophageal junction (GEJ) cancer and the correlation with E-cadherin and MLH1.Pathol. Res. Pract.209 (10), 611–617. doi:10.1016/j.prp.2013.03.012 PubMed Abstract|CrossRef Full Text|Google Scholar Zhang, Q., Fei, S., Zhao, Y., Liu, S., Wu, X., Lu, L., et al. (2023). PUS7 promotes the proliferation of colorectal cancer cells by directly stabilizing SIRT1 to activate the Wnt/β-catenin pathway.Mol. Carcinog.62 (2), 160–173. doi:10.1002/mc.23473 PubMed Abstract|CrossRef Full Text|Google Scholar Zhang, S., Huang, S., Deng, C., Cao, Y., Yang, J., Chen, G., et al. (2017a). Co-ordinated overexpression of SIRT1 and STAT3 is associated with poor survival outcome in gastric cancer patients.Oncotarget8 (12), 18848–18860. doi:10.18632/oncotarget.14473 PubMed Abstract|CrossRef Full Text|Google Scholar Zhang, S., Yang, Y., Huang, S., Deng, C., Zhou, S., Yang, J., et al. (2019). SIRT1 inhibits gastric cancer proliferation and metastasis via STAT3/MMP-13 signaling.J. Cell Physiol.234 (9), 15395–15406. doi:10.1002/jcp.28186 PubMed Abstract|CrossRef Full Text|Google Scholar Zhang, W., Liao, K., and Liu, D. (2020). MiRNA-12129 suppresses cell proliferation and block cell cycle progression by targeting SIRT1 in GASTRIC cancer.Technol. Cancer Res. Treat.19, 1533033820928144. doi:10.1177/1533033820928144 PubMed Abstract|CrossRef Full Text|Google Scholar Zhang, X., Dong, Y., Li, W., He, M., Shi, Y., Han, S., et al. (2024). The mechanism by which SIRT1 regulates autophagy and EMT in drug-resistant oesophageal cancer cells.Life Sci.343, 122530. doi:10.1016/j.lfs.2024.122530 PubMed Abstract|CrossRef Full Text|Google Scholar Zhang, X. L., Chen, M. L., and Zhou, S. L. (2014). Fentanyl increases colorectal carcinoma cell apoptosis by inhibition of NF-κB in a Sirt1-dependent manner.Asian Pac J. Cancer Prev. APJCP15 (22), 10015–10020. doi:10.7314/apjcp.2014.15.22.10015 PubMed Abstract|CrossRef Full Text|Google Scholar Zhang, Z., Xing, Y., Gao, W., Yang, L., Shi, J., Song, W., et al. (2022a). N6-methyladenosine (m6A) reader IGF2BP2 promotes gastric cancer progression via targeting SIRT1.Bioengineered13 (5), 11541–11550. doi:10.1080/21655979.2022.2068920 PubMed Abstract|CrossRef Full Text|Google Scholar Zhao B., B., Wang, Y., Zhao, X., Ni, J., Zhu, X., Fu, Y., et al. (2022). SIRT1 enhances oxaliplatin resistance in colorectal cancer through microRNA-20b-3p/DEPDC1 axis.Cell Biol. Int.46 (12), 2107–2117. doi:10.1002/cbin.11905 PubMed Abstract|CrossRef Full Text|Google Scholar Zhao, W., Chen, R., Zhao, M., Li, L., Fan, L., and Che, X. M. (2015). High glucose promotes gastric cancer chemoresistancein vivoandin vitro.Mol. Med. Rep.12 (1), 843–850. doi:10.3892/mmr.2015.3522 PubMed Abstract|CrossRef Full Text|Google Scholar Zhou, P., Li, X. P., Jiang, R., Chen, Y., Lv, X. T., Guo, X. X., et al. (2019). Evodiamine inhibits migration and invasion by Sirt1-mediated post-translational modulations in colorectal cancer.Anticancer Drugs30 (6), 611–617. doi:10.1097/CAD.0000000000000760 PubMed Abstract|CrossRef Full Text|Google Scholar Zhu, H., Xia, L., Zhang, Y., Wang, H., Xu, W., Hu, H., et al. (2012). Activating transcription factor 4 confers a multidrug resistance phenotype to gastric cancer cells through transactivation of SIRT1 expression.PloS One7 (2), e31431. doi:10.1371/journal.pone.0031431 PubMed Abstract|CrossRef Full Text|Google Scholar Keywords:SIRT1, colorectal cancer, gastric cancer, tumor progression, chemoresistance Citation:Zhang Y, Zhou X, Zhai J, Ma J and Zhang S (2025) The role of SIRT1 in the development of gastrointestinal tumors.Front. Cell Dev. Biol.13:1606530. doi: 10.3389/fcell.2025.1606530 Received:05 April 2025;Accepted:30 May 2025;Published:11 June 2025. Edited by: Reviewed by: Copyright© 2025 Zhang, Zhou, Zhai, Ma and Zhang. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY).The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Sixi Zhang,c2l4aUBqbHUuZWR1LmNu †ORCID: Xiaokai Zhou,orcid.org/0009-0001-5994-1329 ‡These authors have contributed equally to this work Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract 1 Introduction 2 Characteristics of SIRT1 3 SIRT1 and EC 4 SIRT1 and GC 5 SIRT1 and CRC 6 Conclusion Author contributions Funding Conflict of interest Generative AI statement Publisher’s note References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}