{"id": 2212, "name": "Humor Times", "domain": "humortimes.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://www.humortimes.com/128461/should-the-local-shrimp-you-buy-come-from-8000-miles-away/", "title": "Should The Local Shrimp You Buy Come From 8000 Miles Away", "content": "\"World's Funniest News Source\" Home CartoonsPolitical CartoonsEditorial Cartoons Daily UpdateHumor Times Covers GalleryRob RogersTom the Dancing Bug﻿﻿﻿Al ﻿GoodwynChuck LeggeDan AlbaDaniel MedinaDC C.R.A.P. MemesiPhoneysJoe HellerMichael EganMr. Brunelle Explains It AllPolichicsPolimerick Memes by Josh ZepessTom Toles (archives)Panel CartoonsBizarroAbsurdo!AliceAvant GaucheBerserk Alert!Big Monkey ComicCartertoonsCorneredThe Daily ToonDan RosandichDr DoodleHarley SchwadronHoss CartoonsJohn AnglinJohn GillJohn StingerTHE ODDsPlan ‘B’R. G. KarkovskySurveillance CaricaturesWeiss CracksWhat’s Up GrayWilliam Lockett ArtYin + YangsterCartoon Caption ContestFunnies FarragoHumor Times Covers GalleryInsight on CartoonistsReader-Created CartoonsCartoon AdsDr Quince, Pot Medicine Woman Political CartoonsEditorial Cartoons Daily UpdateHumor Times Covers GalleryRob RogersTom the Dancing Bug﻿﻿﻿Al ﻿GoodwynChuck LeggeDan AlbaDaniel MedinaDC C.R.A.P. MemesiPhoneysJoe HellerMichael EganMr. Brunelle Explains It AllPolichicsPolimerick Memes by Josh ZepessTom Toles (archives) Editorial Cartoons Daily Update Humor Times Covers Gallery Rob Rogers Tom the Dancing Bug ﻿﻿﻿Al ﻿Goodwyn Chuck Legge Dan Alba Daniel Medina DC C.R.A.P. Memes iPhoneys Joe Heller Michael Egan Mr. Brunelle Explains It All Polichics Polimerick Memes by Josh Zepess Tom Toles (archives) Panel CartoonsBizarroAbsurdo!AliceAvant GaucheBerserk Alert!Big Monkey ComicCartertoonsCorneredThe Daily ToonDan RosandichDr DoodleHarley SchwadronHoss CartoonsJohn AnglinJohn GillJohn StingerTHE ODDsPlan ‘B’R. G. KarkovskySurveillance CaricaturesWeiss CracksWhat’s Up GrayWilliam Lockett ArtYin + Yangster Bizarro Absurdo! Alice Avant Gauche Berserk Alert! Big Monkey Comic Cartertoons Cornered The Daily Toon Dan Rosandich Dr Doodle Harley Schwadron Hoss Cartoons John Anglin John Gill John Stinger THE ODDs Plan ‘B’ R. G. Karkovsky Surveillance Caricatures Weiss Cracks What’s Up Gray William Lockett Art Yin + Yangster Cartoon Caption Contest Funnies Farrago Humor Times Covers Gallery Insight on Cartoonists Reader-Created Cartoons Cartoon AdsDr Quince, Pot Medicine Woman Dr Quince, Pot Medicine Woman Political CartoonsEditorial Cartoons Daily UpdateHumor Times Covers GalleryRob RogersTom the Dancing Bug﻿﻿﻿Al ﻿GoodwynChuck LeggeDan AlbaDaniel MedinaDC C.R.A.P. MemesiPhoneysJoe HellerMichael EganMr. Brunelle Explains It AllPolichicsPolimerick Memes by Josh ZepessTom Toles (archives) Editorial Cartoons Daily Update Humor Times Covers Gallery Rob Rogers Tom the Dancing Bug ﻿﻿﻿Al ﻿Goodwyn Chuck Legge Dan Alba Daniel Medina DC C.R.A.P. Memes iPhoneys Joe Heller Michael Egan Mr. Brunelle Explains It All Polichics Polimerick Memes by Josh Zepess Tom Toles (archives) Editorial Cartoons Daily Update Humor Times Covers Gallery Rob Rogers Tom the Dancing Bug ﻿﻿﻿Al ﻿Goodwyn Chuck Legge Dan Alba Daniel Medina DC C.R.A.P. Memes iPhoneys Joe Heller Michael Egan Mr. Brunelle Explains It All Polichics Polimerick Memes by Josh Zepess Tom Toles (archives) Panel CartoonsBizarroAbsurdo!AliceAvant GaucheBerserk Alert!Big Monkey ComicCartertoonsCorneredThe Daily ToonDan RosandichDr DoodleHarley SchwadronHoss CartoonsJohn AnglinJohn GillJohn StingerTHE ODDsPlan ‘B’R. G. KarkovskySurveillance CaricaturesWeiss CracksWhat’s Up GrayWilliam Lockett ArtYin + Yangster Bizarro Absurdo! Alice Avant Gauche Berserk Alert! Big Monkey Comic Cartertoons Cornered The Daily Toon Dan Rosandich Dr Doodle Harley Schwadron Hoss Cartoons John Anglin John Gill John Stinger THE ODDs Plan ‘B’ R. G. Karkovsky Surveillance Caricatures Weiss Cracks What’s Up Gray William Lockett Art Yin + Yangster Bizarro Absurdo! Alice Avant Gauche Berserk Alert! Big Monkey Comic Cartertoons Cornered The Daily Toon Dan Rosandich Dr Doodle Harley Schwadron Hoss Cartoons John Anglin John Gill John Stinger THE ODDs Plan ‘B’ R. G. Karkovsky Surveillance Caricatures Weiss Cracks What’s Up Gray William Lockett Art Yin + Yangster Cartoon Caption Contest Funnies Farrago Humor Times Covers Gallery Insight on Cartoonists Reader-Created Cartoons Cartoon AdsDr Quince, Pot Medicine Woman Dr Quince, Pot Medicine Woman Dr Quince, Pot Medicine Woman VideosFunny VideosPolitical Humor VideosFunny Videos Wall of FameUser-Submitted Funny Videos Funny Videos Political Humor Videos Funny Videos Wall of Fame User-Submitted Funny Videos Funny Videos Political Humor Videos Funny Videos Wall of Fame User-Submitted Funny Videos Humor ColumnsRipping the Headlines TodayMinnesota Nice Talk RadioJim HightowerRalph LombardRoz WarrenHoward ZaharoffFunny HoroscopeWill Durst Ripping the Headlines Today Minnesota Nice Talk Radio Jim Hightower Ralph Lombard Roz Warren Howard Zaharoff Funny Horoscope Will Durst Ripping the Headlines Today Minnesota Nice Talk Radio Jim Hightower Ralph Lombard Roz Warren Howard Zaharoff Funny Horoscope Will Durst Faux News ReviewsMovie Reviews by Gary ChewBook Reviews Movie Reviews by Gary Chew Book Reviews Movie Reviews by Gary Chew Book Reviews BlogsEditor’s RantSeen & Heard on the WebNewsInsight on Cartoonists Editor’s Rant Seen & Heard on the Web News Insight on Cartoonists Editor’s Rant Seen & Heard on the Web News Insight on Cartoonists User FunReader-Created CartoonsUser-Submitted Funny VideosCartoon Caption Contest Reader-Created Cartoons User-Submitted Funny Videos Cartoon Caption Contest Reader-Created Cartoons User-Submitted Funny Videos Cartoon Caption Contest SubscribeHumor Times Magazine Subscriber Login ↗Read a Recent Issue OnlineDonate to the Cause of Political Humor! Humor Times Magazine Subscriber Login ↗ Read a Recent Issue Online Donate to the Cause of Political Humor! Humor Times Magazine Subscriber Login ↗ Read a Recent Issue Online Donate to the Cause of Political Humor! MoreDonate to the Cause of Political Humor!Free Newsletter!Letters to the EditorAdvertise in the Humor TimesHT as Teacher’s AideHT Magazine Covers GalleryLinksFunny LinksPolitical LinksOther LinksLink to the Humor Times!About HTSubscribe to HT magazine!HT FAQsHT Magazine Testimonials ↗List of Writers & CartoonistsSubmissions GuidelinesLink to the Humor Times!Humor Times Privacy PolicyHumor Times Terms of ServiceContact us Donate to the Cause of Political Humor! Free Newsletter! Letters to the Editor Advertise in the Humor Times HT as Teacher’s Aide HT Magazine Covers Gallery LinksFunny LinksPolitical LinksOther LinksLink to the Humor Times! Funny Links Political Links Other Links Link to the Humor Times! About HTSubscribe to HT magazine!HT FAQsHT Magazine Testimonials ↗List of Writers & CartoonistsSubmissions GuidelinesLink to the Humor Times!Humor Times Privacy PolicyHumor Times Terms of Service Subscribe to HT magazine! HT FAQs HT Magazine Testimonials ↗ List of Writers & Cartoonists Submissions Guidelines Link to the Humor Times! Humor Times Privacy Policy Humor Times Terms of Service Contact us Donate to the Cause of Political Humor! Free Newsletter! Letters to the Editor Advertise in the Humor Times HT as Teacher’s Aide HT Magazine Covers Gallery LinksFunny LinksPolitical LinksOther LinksLink to the Humor Times! Funny Links Political Links Other Links Link to the Humor Times! Funny Links Political Links Other Links Link to the Humor Times! About HTSubscribe to HT magazine!HT FAQsHT Magazine Testimonials ↗List of Writers & CartoonistsSubmissions GuidelinesLink to the Humor Times!Humor Times Privacy PolicyHumor Times Terms of Service Subscribe to HT magazine! HT FAQs HT Magazine Testimonials ↗ List of Writers & Cartoonists Submissions Guidelines Link to the Humor Times! Humor Times Privacy Policy Humor Times Terms of Service Subscribe to HT magazine! HT FAQs HT Magazine Testimonials ↗ List of Writers & Cartoonists Submissions Guidelines Link to the Humor Times! Humor Times Privacy Policy Humor Times Terms of Service Contact us **Should the ‘Local Shrimp’ You Buy Come from 8,000 Miles Away?** **Whether you order shrimp at a chain restaurant or Mar-a-Lago, a good question to ask is: Where do they get it?** Let’s say you like shrimp. Whether you go for a chain restaurant’s happy hour shrimp boil or a pricey plate of “shrimp a la grandioso” at President Donald Trump’s Mar-a-Lago resort — a good question to ask is: Where do they get their shrimp? Even if the restaurant has an ocean view and a shrimp boat out front, chances are its crustaceans come from industrial aquaculture farms thousands of miles away in India, Ecuador, Vietnam and Indonesia. Astonishingly, our country now imports 94% of the shrimp we eat! Astonishing, because our oceans have an abundance of top-quality shrimp, and we are blessed with highly skilled shrimping families. Worse, those foreign industrial operations, financed by Wall Street andglobal profiteers, are infamous for using forced labor, banned antibiotics and destructive environmental methods. Then they dump their grossly cheap product into the U.S. market, pushing out our superior-quality domestic product and devastating entire shrimping communities. Yet, restaurant and supermarket prices for shrimp are at historic highs, with no disclosure to us consumers of where the product is from. The import industry effectively bribes lawmakers to avoid exposing, much less punishing, this multibillion-dollar swindle of American producers and eaters alike. The bait-and-switch conspiracy is now so pervasive that at last year’s National Shrimp Festival, four out of five vendors were – Shhhh — quietly serving industrially-raised imported shrimp. Of course, corporations have no conscience, but our tough-on-crime political leaders are so pusillanimous that they won’t even stand up for their own local shrimpers. A recent Louisiana law, for example, “boldly” requires restaurants to disclose if they’re peddling imported shrimp. But, the legislature meekly provided “no penalty” if violators ignore the law. So … they do. For information on real reform, connect withSanAntonioBayWaterKeeper.org. **Right-Wingers to Women: Stay Home and Have Babies!** The right-wing routinely demonizes family-friendly policies of liberals as “social engineering.” But look out! Here come those same politicians, putting on MAGA hard hats and firing up their political bulldozers to push one of the most arrogant and intrusive social schemes imaginable. They intend to re-engineer the American family! These “pronatalists” want families to conform to a Christian Nationalist family structure — specifically, a dominant man married to a subservient stay-at-home woman, having beaucoup children. Not a couple of kiddos but six, 12 or more! For example, extremist MAGA senator Josh Hawley has become a cheerleader for a federal policy to entice women to quit work, stay home and have more babies. He proposes a tax credit of $5,000 per child, gushing that this would cause working families to exclaim, “Oh, my gosh, we can actually raise our kids.” Well, “gosh” right back at you, Josh! Just giving birth can cost more than $5,000 — and raising a child is multiples above that every year. So, you want to take away a mom’s job and her income, and add thousands in costs to the family budget — in exchange for a government tax credit? The slickest loan sharks aren’t that diabolical. Oh, wait. Right-wing pronatalists have another government incentive to jack up birth rates. Incredibly, Trump officials have proposed a “National Medal of Motherhood” for women who have six or more children! Wow, what should that medal look like, be made of and say? And when and where should it be worn? Also, will un-medaled women be socially ostracized? If right-wingers actually wanted to help families, they’d be backing family-level wages, free childcare and Medicare for all. Everything else is political BS. Author Recent Posts Should the ‘Local Shrimp’ You Buy Come from 8,000 Miles Away?- June 7, 2025 What Starlings Could Teach Trump’s Mean Government- May 27, 2025 Moral Rights for AI Bots? What About Human Bots?- May 22, 2025 **Follow the Humor Times!** **Editorial Cartoons Daily!** Check out newhilarious editorial cartoonspage, updated daily! Bookmark the page and share it! **Support the Cause of Political Humor!** Become aHumor Times patronviaPatreon.com! Help us keep the lights on with a small (or large!) sustaining monthly donation. Check out our current wonderfulSustaining Supporters here! Please join them, and help support independent media! We thank you. **Links of Interest** **Get Your Humor Times T-Shirt & Wear It Proudly!** Be the first on your block to get the newHumor Times t-shirt!! **Fun Stuff!** **Tops with Feedspot!** **Humor Times policy pages** Humor Times privacy policy. Humor Times terms of service. **HT among the Best!** **HT is a Top Website!** **Share the Humor Times!**"}