{"id": 114, "name": "Arizona Center for Investigative Reporting", "domain": "azcir.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://azcir.org/news/2024/04/23/groundwater-regulation-weaknesses-exploited-by-industrial-scale-agriculture/", "title": "Groundwater Regulation Weaknesses Exploited By Industrial Scale Agriculture", "content": "Truth matters. Support Arizona's only nonprofit newsroom dedicated to statewide investigative journalism. Your support makes our newsroom possible. Or,sign upfor our newsletter. DONATE SUBSCRIBE EDUCATION HEALTH ENVIRONMENT GOVERNMENT LAW ENFORCEMENT FACT BRIEFS HOME ABOUTOpen dropdown menuABOUT AZCIRWAYS TO GIVEAZCIR NEWSFACT BRIEFSSUBSCRIBEEVENTS ABOUT AZCIR WAYS TO GIVE AZCIR NEWS FACT BRIEFS SUBSCRIBE EVENTS ABOUT AZCIR WAYS TO GIVE AZCIR NEWS FACT BRIEFS SUBSCRIBE EVENTS CONTACT BlueSky Facebook Instagram LinkedIn RSS Feed HOME ABOUTOpen dropdown menuABOUT AZCIRWAYS TO GIVEAZCIR NEWSFACT BRIEFSSUBSCRIBEEVENTS ABOUT AZCIR WAYS TO GIVE AZCIR NEWS FACT BRIEFS SUBSCRIBE EVENTS ABOUT AZCIR WAYS TO GIVE AZCIR NEWS FACT BRIEFS SUBSCRIBE EVENTS CONTACT BlueSky Facebook Instagram LinkedIn RSS Feed Arizona Center for Investigative Reporting Independent, nonprofit investigative journalism DONATE SUBSCRIBE EDUCATION HEALTH ENVIRONMENT GOVERNMENT LAW ENFORCEMENT FACT BRIEFS **Groundwater regulation weaknesses exploited by industrial-scale agriculture** **Share this:** Click to share on Bluesky (Opens in new window)Bluesky Click to share on Facebook (Opens in new window)Facebook Click to share on LinkedIn (Opens in new window)LinkedIn Click to email a link to a friend (Opens in new window)Email Get AZCIR’s latest investigations and updates delivered straight into your inbox, for free. ELFRIDA, Ariz. — Elaine Bailey stood at the microphone at the Sunsites Community Center in southeastern Arizona, voice shaking as she described the massive scale of new agricultural development next to her property. The nearby fields have drawn so much water from the surrounding area, she said, that her well has gone dry. “Here we are, all these good people fighting for our lives, our homes, our everything,” Bailey said. “Because if the water goes, our homes aren’t worth anything. That’s the reality. And I just don’t understand how the state can even allow it.” “I don’t, either,” replied Arizona Attorney General Kris Mayes, who visited the small community in February to hear residents’ concerns about the groundwater in Sulphur Springs Valley—home to the Willcox and Douglas groundwater basins. The Douglas basin has seen agricultural development explode in recent years, despite two major attempts to limit groundwater usage in the region: In 1980, it was designated an Irrigation Non-expansion Area, barring the addition of new irrigated land, and in 2022, it became an Active Management Area, which carries the state’s most stringent level of groundwater regulation. Yet over the past 15 years, even with these restrictions in effect, at least several thousand acres of dormant farmland have again started siphoning groundwater to sustain new crops, anAZCIRanalysis has found. The increase in pumping, at an intensity not previously seen in the basin, is largely under industrial-scale owners that have consolidated the land, and the grandfathered water rights tied to it, into massive operations. The analysis, which matched federal satellite data to local property records, also shows new irrigation occurring on land that had never previously been cultivated. The resulting groundwater declines have accelerated the most on properties closest to these large-scale farms, which have embraced more water-intensive practices like double cropping, or harvesting multiple crops on the same field throughout the year. The number of acres using this method has grown by more than 600% in the Douglas basin since 2008, AZCIR’s analysis also found. Residents contend some of these well-financed agricultural players are exploiting loopholes in existing regulations, and that some could be outright violating them. Regardless of the legality of the maneuvers, the industrial farms have expanded, often at the expense of their smaller neighbors. North of Elfrida, Ariz., for instance, where much of the growth has occurred, water levels in some wells have dropped by more than four feet per year—a statistic that drew gasps at the Sunsites Community Center. It is broadly acknowledged that without current and past regulations, the situation in the Douglas basin would be much worse. But residents’ experiences, backed by mounting data, raise questions about whether existing regulatory tools are effective enough to protect the aquifer in the long term. And as the basin’s groundwater continues to decline, residents’ confidence in the ability of the Arizona Department of Water Resources to protect their sole supply of water dwindles alongside it. “From what I’ve seen, they have not been able to enforce the law and the regulations that are in place, even as it is,” said Anastasia Rabin, a neighbor of Elaine Bailey’s who has documented and reported the expansion of new fields. Statewide, the number of basins facing similar groundwater restrictions is growing for the first time in 40 years. Short of meaningful intervention by the Arizona Legislature, however, experts and residents worry the same regulatory shortfalls seen in this Cochise County basin will play out across the state, with well-financed, large-scale agriculture taking advantage of existing policies at the cost of locals who don’t have the resources or government backing to do more. Mayes, who collected Rabin and Bailey’s contact information to further investigate their claims, blames the Legislature because it has not passed meaningful groundwater regulation in decades. “This Legislature has failed all of us,” Mayes told residents in February. The room erupted with applause. When the Douglas basin was established as an Irrigation Non-expansion Area (INA) in 1980, the designation limited the expansion of irrigated farmland while allowing those already watering crops to continue doing so. As long as landowners had irrigated at any point in the five years leading up to the new regulation, they were grandfathered into the new system, meaning they could use groundwater to grow crops moving forward. But these grandfathered rights are tied to the land, not the user. Even if a parcel stops being farmed, subsequent owners have the right to irrigate again at any time. Industrial-scale farms that have settled in Cochise County since the INA was established, often from out of state, have done just that. And because the INA capped only the number of acres being irrigated—not the amount of water any one landowner can use—it enabled these operations to purchase land with grandfathered irrigation rights and deploy intensive irrigation practices like double cropping. Arizona’s climate favors such farming tactics, especially with crops like corn and winter wheat, because they give farmers the potential to grow year-round, resulting in greater efficiency and higher yields. In an industry with razor-thin margins, that profitability gives farms that can operate at scale a huge edge. Those farms seem to be pressing that advantage. AZCIR’s analysis of satellite data shows that much of the intensive irrigation is happening under several large operators, particularly in the northern portion of the basin where recent groundwater declines in nearby wells are the most severe. Farmland there is being consolidated under the biggest players, mirroring a national trend, according to the most recent U.S. Department of Agriculture’s farm census. In Arizona, these operations are using deeper wells with more powerful pumps than ever before, threatening the property of nearby residents and smaller farms. Dormant land purchased with grandfathered irrigation rights is a primary reason for recent growth in the Douglas basin’s active farmland, but it is not the only one. A small provision in the state law also allows owners to swap irrigation rights from cropland that can’t be irrigated efficiently into new acres elsewhere. Most irrigation rights were initially assigned to rectangular fields that were flood-irrigated, a method that immerses a field so water can be absorbed into the soil. But as farmers switched to more efficient center pivot irrigation, which allows more control of how much water is applied by a sprinkler arm rotating in a circle, the corners of these fields were often left uncultivated. In 2018, White Brothers Grain, one of the biggest farms in the Douglas basin, filed an application to voluntarily give up rights to irrigate the corners in some of its fields. In exchange, the company added new acreage that equaled the size of the corners it retired from irrigation. The Arizona Department of Water Resources signed off on the swap, and soon after, other farms such as Riverview followed its lead. “There’s been a lot of people, a lot of families, a lot of businesses that have benefited from things being set up the way that they are. Ultimately, they’ll be hurt too. But not yet,” Rabin said. “They’ll fight to the death of the aquifer.” In an emailed response, Denise White of White Brothers Grain said it “followed all Arizona state laws and ADWR regulation in the previous INA, and will do so going forward with the new AMA.” The White family, which has farmed in the basin since the 1950’s, said they “are proud to be part of Arizona agriculture and want future family generations to have the same opportunities,” emphasizing their commitment to more efficient forms of irrigation. Riverview did not respond to repeated requests for comment. Unlimited groundwater pumping within the Douglas basin is part of the reason voters approved the creation of an Active Management Area in 2022. Though not yet fully implemented, the regulation generally limits new expansion of irrigated land and is expected to cap the amount of groundwater pumping based on recent use. It’s the most restrictive form of groundwater regulation in Arizona, and has traditionally been applied to areas like Phoenix and Tucson, which favor urban development as farmland is retired. In the case of the Douglas basin, some farms rushed to expand their operations as soon as whispers of more regulation started. Aspreviously reported by AZCIR, this included a flurry of new applications to drill deeper wells with higher capacity pumps. This activity continued until the more stringent regulation was placed on the ballot in August 2022, at which point new irrigation was banned. Voters passed the measure, and the irrigation moratorium remains in effect. Farms that are still developing land for irrigation within the new AMA are most likely expecting to benefit from the Substantial Capital Investment exemption, which allows landowners to keep their existing irrigation rights for land that wasn’t yet irrigated before the moratorium, but only by proving they had already made substantial investment to do so. **Support AZCIR** Help AZCIR do more to keep you informed. Your contribution is appreciated. Prefer to send a check? Mail it to AZCIR: PO Box 3665, Phoenix, AZ 85030 The exemption is meant to account for the huge startup costs and lead time needed to bring new fields under irrigation. The investment must have been made prior to the basin’s current moratorium, and the time to apply for it alongside grandfathered rights was recently extended from March 1, 2024 until Sept. 3, 2024. Applications for the exemption, however, are judged on a case-by-case basis, meaning a farmer doesn’t know whether an investment will end up getting approved. Those who continue development are taking a gamble of tens, or even hundreds of thousands of dollars—a gamble that not every farm in the basin can afford. It is unclear whether the development witnessed by Bailey and Rabin is part of an intended application for the capital investment exception. Both have sought investigations by the Arizona Department of Water Resources into the activity. The department wrote in an email to AZCIR that one case involving illegal irrigation has been “resolved,” and that other investigations are ongoing. Rabin’s complaint, which was filed in January 2023, was recently closed. Despite repeated requests, ADWR declined to comment on the outcome of that investigation. Sulphur Springs Valley residents who filled the Sunsites Community Center in February said they were frustrated by what they see as unchecked development. In voicing their concerns to Attorney General Mayes, some said they hoped she could help them in ways local regulations and the Arizona Legislature had not. Residents told AZCIR they saw the visit as a new opportunity for direct action by a state leader whose job it is to enforce laws and investigate wrongdoing. Mayes told them one option could be for her office to file nuisance lawsuits against any groundwater user “that interferes with the comfortable enjoyment of life or property by an entire community or neighborhood or by a considerable number of persons.” Republican leaders at the Legislature have since rebuked the move by attempting to strip Mayes’ office of the authority to use the nuisance suit tactic. The amendment to House Bill 2124, which already seeks to protect farms against groundwater litigation, was added by Senator Sine Kerr-R, Buckeye, chair of the senate’s Natural Resources, Energy and Water committee, who also walked off the governor’s rural groundwater council last year alongside the Arizona Farm Bureau. The change would only allow county or city prosecutors to file such nuisance lawsuits. Local landowners and small farmers said they feel caught in the middle, with few options to implement changes that actually limit the withdrawal of their only reliable source of water. And as Douglas basin residents urge the state to investigate possible violations of the 2022 irrigation ban, those living in the Willcox basin are looking for alternative solutions to the groundwater depletion in their region. Unlike their neighbors, residents there did not approve the new regulation when they voted on it in 2022. But absent meaningful progress at the state level to address the growing crisis, residents in Willcox are again starting to discuss the option of designating their basin as an INA. There is some community agreement that the move could help slow the depletion of groundwater from a rush of new farmers or additional fields, as it did in Douglas. But given the weaknesses in existing regulations being exploited by those with the most resources, including political maneuvering happening at the state level, other residents aren’t sure if the designation will do enough. “I think one of the things that’s really striking is that an INA is so weak,” said Cheryl Knott, a Willcox basin resident who helped get regulation on the ballot for the Willcox and Douglas basins in 2022. “[An INA] would make it seem like something was being done, and it would not have an impact.” The same debates are occurring across Arizona, and now, some of the industrial-scale agricultural operations are using the courts to push back. Large farms in Mohave County’s Hualapai Valley basin, for example, are pursuing legal action against the state Department of Water Resources to undo the INA designation it made in 2022, arguing the data was insufficient to establish the regulation in the first place. At the state level, House Republicans have alsolaunched an inquiryinto Mayes’ office, accusing the state’s top prosecutor of overstepping her statutory authority to enforce water policy. “The ground is opening up beneath the people of Cochise County,” Mayes said at a press conference the next day, while pointing over her shoulder at the Arizona Capitol. “People are watching their livelihoods be destroyed because this place can’t get its act together, because this place is dysfunctional.” **RELATED** **Our methods: Groundwater regulation weakness exploited by large farms** To understand the growth of active farmland and groundwater declines in the Douglas basin, AZCIR analyzed data from local and state agencies, including the Arizona Department of Water Resources, as well as satellite data compiled by federal agencies such as the U.S. Geological Survey and the U.S. Department of Agriculture. **Whispers of groundwater regulations spur surges of deeper, higher-capacity wells** Arizona farmers and water experts worry that further delay in groundwater legislation will allow larger, often corporate-backed farms to continue expanding their share of groundwater before future regulation takes effect. By applying for new wells that go deeper, often with higher capacity pumps, those with the financial resources to drill them can extract so much water from the surrounding basin that smaller farms and homes can no longer reach the aquifer at all. **RELATED** Republish This Story **Republish this article** This work is licensed under aCreative Commons Attribution-NoDerivatives 4.0 International License. You must credit us: For bylines, use “Author Name, Arizona Center for Investigative Reporting.” At the top of the text of the story, include a line that reads: \"This story was originally published by the Arizona Center for Investigative Reporting.\" You must link the words \"Arizona Center for Investigative Reporting\" to the original URL of the story. You must use ourlogo. All stories must run in their entirety unless otherwise noted or agreed upon after discussion with AZCIR. All republished content delivered online must have a link to AZCIR and include all of the links in our story. All material must be attributed and credited prominently, and where appropriate for the material type throughout. Photos, graphics and other visual elements are permitted for one-time-use only. You have permission to edit AZCIR material to reflect changes in time, location and editorial style only. You have no rights to sell, license, syndicate or otherwise represent yourself as the owner of our material. This means you cannot re-distribute our material separately, or place it behind a paywall.You cannot fundraise or sell advertising against our material. **Groundwater regulation weaknesses exploited by industrial-scale agriculture** by Brendon Derr, Arizona Center for Investigative ReportingApril 23, 2024 **Brendon DerrContributing Data Reporter** x Brendon Derr, a former Roy W. Howard Fellow for AZCIR, is a contributing data reporter for the newsroom. BlueSky Facebook Instagram LinkedIn RSS Feed **About AZCIR** The Arizona Center for Investigative Reporting is the state’s only independent, nonpartisan and collaborative nonprofit newsroom dedicated to statewide, data-driven investigative reporting. AZCIR holds powerful people and institutions accountable by exposing injustice and systemic inequities through investigative journalism. LEARN MORE » **Contact** P.O. Box 3665Phoenix, AZ 85030-3665 AZCIR is a registered 501(c)(3) nonprofit corporation, Tax ID #46-1209940. info@azcir.org **INVEST** DONATE NEWSLETTER **Complete your transaction**"}