{"id": 1769, "name": "Natural Society", "domain": "naturalsociety.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://naturalsociety.com/80-percent-americans-exposed-fertility-ruining-chlormequat-pesticides-oats/", "title": "80 Percent Americans Exposed Fertility Ruining Chlormequat Pesticides Oats", "content": "Home News Healthy LivingExpandAnti AgingBrain Power and NootropicsWeight Loss / FitnessLongevitySleepMind and BodyToxins and Chemicals Anti Aging Brain Power and Nootropics Weight Loss / Fitness Longevity Sleep Mind and Body Toxins and Chemicals Anti Aging Brain Power and Nootropics Weight Loss / Fitness Longevity Sleep Mind and Body Toxins and Chemicals Food and DietExpandFood as MedicineSugarHerbs and SpicesFood Ingredients Food as Medicine Sugar Herbs and Spices Food Ingredients Food as Medicine Sugar Herbs and Spices Food Ingredients Natural HealingExpandDetox and CleanseNatural RemediesHerbalAlternativeGrow Your Own Medicine Detox and Cleanse Natural Remedies Herbal Alternative Grow Your Own Medicine Detox and Cleanse Natural Remedies Herbal Alternative Grow Your Own Medicine EnvironmentExpandSave the BeesPlastic PollutionPollutionGreen Living Save the Bees Plastic Pollution Pollution Green Living Save the Bees Plastic Pollution Pollution Green Living AboutExpandContact Contact Contact What to Buy **80% of Americans Exposed to Fertility-Ruining Pesticides in Oat-Based Foods** A concerning discovery has been made by researchers regarding the presence of a chemical pesticide,chlormequat, in oat-based foods available in the U.S. market, which could potentially affect human health. Dr. Patrick Hannon, an assistant professor in the Department of Obstetrics & Gynecology at the University of Kentucky,highlighted the potential linkbetween chlormequat exposure and fertility issues, emphasizing the importance of being mindful of what we consume. Chlormequat, which is prohibited by the Environmental Protection Agency (EPA) for use on food crops such as oats, wheat, and barley within the U.S., is designed to inhibit stem growth, resulting in a sturdier stalk that benefits production and yield. Despite this, its use is permitted in imported goods from countries like Canada and the United Kingdom, with regulated limits on its concentration. However, in 2020, the EPA raised these limits. **80% of Americans Have Detectable Levels of Chlormequat** Widespread Chemical Exposure: An Environmental Working Group peer-reviewedstudy foundthat80% of Americans have detectable levels of chlormequat, a chemical used in agriculture to enhance crop growth, in their systems. Increasing Detection Rates: The Environmental Working Group (EWG) has observed an increase in the detection rates of chlormequat in recent years, with 90% of samples testing positive in 2023, up from 69% in 2017. This suggests that exposure to chlormequat among the general population is rising. Prevalence in Non-Organic Foods: Testing revealed that 92% of non-organic oat-based foods contained detectable levels of chlormequat, whereas only a small fraction of organic and wheat-based products showed low levels of the chemical. **Chlormequat and Fertility Issues** Alarmingly, studies conducted on female pigs exposed to chlormequat revealed significant disruptions in reproductive cycles, hormone production, and fertility. Further researchindicated potential impactson embryonic development, suggesting possible implications for human health, particularly in women. Male mice studies also showed reproductive effects. **Oats Contaminated with Pesticides is Nothing New** The issue ofpesticide-riddled oats is not new. A report published in 2018 showed howsome oat products, including oat cereals, oatmeals, and granola and snack bars,contained unsafe levels of glyphosate – a chemical in the controversial weedkiller Roundup. In 2016, Grain Millers, Inc.announced that it wouldavoid buying western Canadian oatsthat have been treated with the herbicide. **The Solution for Consumers** Dr. Hannon suggests thatopting for organic oat-based productsmight be a safer choice, as these typically involve fewer pesticides and those used are derived from natural sources. He notes that the research on chlormequat’s effects is still in its early stages, but ongoing investigations are expected to provide deeper insights into its toxicological impacts. **Related posts:** Study: Children Exposed to GMO Soy Pesticides Suffer ‘Serious Genetic Damage’ EWG Report Shows Unsafe Levels of Glyphosate Herbicide in Oat Products Major Oat Buyer Now Rejects Oats With Monsanto’s Glyphosate Top 12 Pesticide-Dosed Foods of 2018 – Along with the 15 Cleanest Foods Founder of Natural Society, Mike has been exploring the world of fitness, nutrition, detoxification, and the \"natural, holistic lifestyle\" for 15 years. With an education in Nutrition Science from Stanford University and ongoing studies to be a Certified Holistic Nutritionist with American Fitness Professionals and Associates, Mike utilizes his platform to help guide individuals globally on their health journeys to achieve a new level of greater health and wellbeing. **Post navigation** **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. Latest Posts **Information** Work with Natural Society Advertise Shop Donate About Contact Our website services and content are for informational, educational, and entertainment purposes only. Natural Society does not provide medical advice, diagnosis, or treatment. Always consult a professional healthcare practitioner and remember to further research anything that could impact your life. We truly wish the best for anyone reading this. Thanks for visiting. © 2025 Natural Society Privacy Policy Sponsorship Policy Terms and Conditions Editorial Guidelines Disclaimer Home News Healthy LivingToggle child menuExpandAnti AgingBrain Power and NootropicsWeight Loss / FitnessLongevitySleepMind and BodyToxins and Chemicals Anti Aging Brain Power and Nootropics Weight Loss / Fitness Longevity Sleep Mind and Body Toxins and Chemicals Anti Aging Brain Power and Nootropics Weight Loss / Fitness Longevity Sleep Mind and Body Toxins and Chemicals Food and DietToggle child menuExpandFood as MedicineSugarHerbs and SpicesFood Ingredients Food as Medicine Sugar Herbs and Spices Food Ingredients Food as Medicine Sugar Herbs and Spices Food Ingredients Natural HealingToggle child menuExpandDetox and CleanseNatural RemediesHerbalAlternativeGrow Your Own Medicine Detox and Cleanse Natural Remedies Herbal Alternative Grow Your Own Medicine Detox and Cleanse Natural Remedies Herbal Alternative Grow Your Own Medicine EnvironmentToggle child menuExpandSave the BeesPlastic PollutionPollutionGreen Living Save the Bees Plastic Pollution Pollution Green Living Save the Bees Plastic Pollution Pollution Green Living AboutToggle child menuExpandContact Contact Contact What to Buy MoreToggle child menuExpandShopAboutContact Shop About Contact Shop About Contact"}