{"id": 1859, "name": "ACLU", "domain": "aclu.org", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.aclu.org/news/lgbtq-rights/what-the-marriage-equality-backlash-taught-me-about-the-fight-for-trans-rights", "title": "What The Marriage Equality Backlash Taught Me About The Fight For Trans Rights", "content": "**What the Marriage Equality Backlash Taught Me About the Fight for Trans Rights** On June 26, 2015, the Supreme Court ruled that excluding same-sex couples from civil marriage was unconstitutional. I was outside the Supreme Court that day, celebrating the advocacy achievement that seemed impossible a decade prior when bans on marriage for same-sex couples passed by wide margins in state after state. Couples, families, and advocates gathered on the steps outside the court, singing, crying, and embracing. I thought about my younger self who could not have imagined a life and future as a queer adult, and about the generations of LGBTQ people who came before me and faced so many more obstacles to realizing their own queer adulthoods. Though the fight for legal recognition of marriage for same-sex couples spanned decades, the final stages of progress seemed lightning fast for many people outside of the LGBTQ legal movement. In June of 2013, the Supreme Court held inUnited States v. Windsor that the federal law defining marriage as between one man and one woman violated the Constitution's equal protection and due process guarantees. That decision opened the door to immediate constitutional challenges to the remaining state-level bans on marriage for same-sex couples. Two years later, in 2015, the Supreme Court held inObergefell v. Hodgesthat excluding same-sex couples from marriage violated the Constitution. TheObergefellruling was a defining moment in our country’s legal history that came after decades of hard work and setbacks. Today, my child’s generation cannot even fathom that same-sex couples could not marry in many states when they were born. That transformation in law and culture has been met with fierce backlash from opponents of LGBTQ equality. Immediately following the court’s decision inObergefell, the aggressive movement to prevent marriage equality trained its financial resources and advocacy efforts on curtailing legal equality for LGBTQ people under local, state and federal civil rights statutes. In November 2015, a ballot campaign in Houston, Texas became the testing ground for new anti-LGBT messaging. Houston voters were voting on a repeal of a municipal non-discrimination ordinance, HERO, that would have extended local civil rights protections to fifteen classes of people, including veterans, people of color, disabled people, women and LGBTQ people. The campaign in favor of repealing the ordinance focused its messaging entirely on the false claim that passing the ordinance would allow men to enter women’s bathrooms and harm women and girls. Campaign ads depicted shadowy figures looming over young girls and the refrain “no men in women’s restrooms” became the tagline that ultimately drove voters to repeal the ordinance at the ballot that November. Hoping to redirect voters towards the many groups the ordinance would protect, the pro-HERO campaign did not engage with the opposition’s messaging directly. The strategy failed. Whether we wanted to or not, LGBTQ advocates needed to face our opposition’s messaging head-on, particularly when, in the months that followed, dozens of bills were introduced across the country to ban transgender people from using restrooms that aligned with their gender identity. We did not pick a fight over bathrooms, the fact that we exist and go to the bathroom became the focal point of efforts to undermine legal gains for all LGBTQ people. Between 2016 and 2019, efforts to enact anti-trans legislation largely stalled. Ballot measures seeking to roll back trans-inclusive laws or codify anti-trans ones also failed. It was not until the introduction of the Equality Act in Congress, a bill that would add explicit protections for LGBT people into federal civil rights statutes, that a new anti-trans strategy gained momentum. As with previous efforts to stall local non-discrimination ordinances in 2015 and 2016, efforts to kill the Equality Act claimed that protecting transgender people would threaten others. This time, our opponents focused on sports. Once again, transgender people did not pick the fight, we just existed and became the focal point of efforts to stop civil rights legislation. Just as equality opponents were building momentum coalescing around sports, in June 2020 the Supreme Court issued a decision inBostock v. Clayton County, confirming that Title VII of the Civil Rights Act applied to LGBTQ people. In a 6-3 opinion authored by Justice Neil Gorsuch, the court found three LGBTQ workers fired because they were either gay or transgender – including American Civil Liberties Union client and transgender woman Aimee Stephens – were discriminated against on the basis of their sex in violation of the law. The court concluded that it is inherently a form of sex discrimination to discriminate against someone because of their sexual orientation or transgender status. This confirmed that LGBTQ workers were federally protected under our nation’s civil rights statutes. LikeObergefell,Bostocksparked a fierce backlash from anti-equality advocates. Limiting the decision’s scope immediately became a top priority for anti-LGBTQ legislators. Between 2021 and 2023, lawmakers introduced hundreds of bills targeting LGBTQ people, the majority of which sought to limit rights for transgender adolescents. At first, these bills focused on the very small number of transgender students participating in school sports, but soon lawmakers escalated their attacks and began to introduce bills targeting medical care. When the first categorical ban on medical care for transgender adolescents passed in Arkansas in 2021, then-Governor Asa Hutchinson vetoed the bill concerned that it allowed for vast government overreach into the private and vulnerable decisions of adolescents, their parents and their doctors. That measured resistance to usurping the careful and aligned judgment of youth, their parents and their doctors quickly gave way to copycat legislation across the country that sought to categorically ban evidence-based medical care for transgender adolescents. In February 2022, Texas even threatened to investigate families for child abuse for simply following the advice of medical providers to treat their adolescent transgender children with gender affirming medical care. All of a sudden, families began to fear that they could lose custody of their children by following best practice medicine. While transgender youth and their families desperately sought refuge from fights that kept arriving at their doorstep, the ACLU and other LGBTQ legal groups immediately went to court to try to stop the escalating harms of the health bans. Our timing was critical; each day these bans were allowed to be enforced was another day transgender youth were going without needed care. Thankfully, we were largely successful at first and, until July 2023, stopped every law from going into effect. District court judges ruled that, because these bans discriminated against transgender people on the basis of their sex and transgender status, as well as infringed upon the rights of parents to direct the medical care of their minor children, they were likely unconstitutional. These district court orders protected vulnerable adolescents from losing the medical care that had allowed them to thrive. This protection changed when the Sixth Circuit Court of Appeals allowed Tennessee’s ban to go into effect. That decision set off a chain reaction in the appellate courts and soon nearly every medical care ban went into effect, forcing families to uproot their lives to try to preserve care for their adolescent children. Compelled by the severity of harms facing our clients and transgender adolescents across the country, the ACLU and Lambda Legal asked the Supreme Court to review the Sixth Circuit’s harmful decision in November 2023. Not only did the appellate court’s decision upend the state of health care for transgender youth, it also began to undermine critical constitutional protections for everyone. For those of us who have dedicated our lives to fighting for our community, it was clear that the stakes were only getting higher and bringing our fight to the Supreme Court was a necessary step to slow catastrophic erosion of medical care and legal rights. Ultimately, the LGBTQ movement did not pick a fight over restrooms or sports or health care for minors. Rather, opponents of LGBTQ equality strategically positioned transgender people as a threat to others as part of their decades-long goal to undermine LGBTQ equality movements overall. For the people who now tell transgender people that instead of fighting these bills targeting our health care, our education, our history, we should have waited for a more opportune time to defend our rights and survival, the question is: what should we have done? Just accepted our wholesale exclusion from public life? Who would that have helped? Certainly not cisgender women in sports, or LGB people seeking to learn about their histories, or people hoping to form families with IVF. We did not pick this fight, we simply existed. But not fighting to exist was never an option. **Learn More About the Issues on This Page** LGBTQ Rights Transgender Rights **Related Content** PodcastJun 2025LGBTQ RightsSkrmetti, Obergefell, and the Path Forward for LGBTQIA+ Rights with Chase StrangioBy:ACLUSkrmetti, Obergefell, And The Path Forward For Lgbtqia+ Rights With Chase Strangio. Explore Podcast. LGBTQ Rights **Skrmetti, Obergefell, and the Path Forward for LGBTQIA+ Rights with Chase Strangio** LGBTQ Rights **Skrmetti, Obergefell, and the Path Forward for LGBTQIA+ Rights with Chase Strangio** Press ReleaseJun 2025Prisoners' RightsLGBTQ RightsFederal Judge Temporarily Enjoins Federal Prison Officials from Withholding Health Care From Incarcerated Trans PeopleWASHINGTON – A federal district court judge has granted a preliminary injunction blocking enforcement of a Trump Administration executive order prohibiting federal Bureau of Prisons (“BOP”) officials from providing gender-affirming hormone therapy and accommodations to transgender people. The injunction does not require BOP to provide gender-affirming surgical care. The court also granted the plaintiff’s motion for a class certification and extended injunctive relief to the full class, which encompasses all persons who are or will be incarcerated in BOP facilities and have a current medical diagnosis of gender dysphoria or who receive that diagnosis in the future. “This is a critical ruling for our clients and all transgender people in Bureau of Prisons custody,” said Corene Kendrick, Deputy Director of the ACLU’s National Prison Project. “This administration’s cruelty towards transgender people disregards their rights under the Constitution. The denial of medically necessary health care, including gender-affirming health care, to people in prison is a violation of their fundamental constitutional rights. We will continue to advocate for the rights of all incarcerated people.” “Today’s ruling is made possible by the courageous plaintiffs who fought to protect their rights and the rights of transgender people everywhere,” said Shawn Thomas Meerkamper, Managing Attorney at Transgender Law Center. “This administration’s continued targeting of transgender people is cruel and threatens the lives of all people. No person—incarcerated or not, transgender or not—should have their rights to medically-necessary care denied. We are grateful the court understood that our clients deserve basic dignity and healthcare, and we will continue to fight alongside them.” \"Today's ruling is an important lifeline for trans people in federal custody,\" said Michael Perloff, Senior Staff Attorney at ACLU-D.C. “The ruling is also a critical reminder to the Trump administration that trans people, like all people, have constitutional rights that don't simply disappear because the president has decided to wage an ideological battle.\" Following a January 20 executive order from President Trump that prohibited gender-affirming care for transgender people in federal prisons, the BOP issued a policy stating that \"no Bureau of Prisons funds are to be expended for any medical procedure, treatment, or drug for the purpose of conforming an inmate’s appearance to that of the opposite sex.” It also prohibits clothing and commissary items it deems inconsistent with a person’s assigned sex, and requires all BOP staff to misgender transgender people. In March, two transgender men and one transgender woman serving sentences in facilities in New Jersey, Minnesota, and Florida filed a class action lawsuit against the Trump Administration and BOP, challenging the Executive Order and new BOP policies prohibiting their access to gender-affirming care. The class action lawsuit was filed in federal court in Washington, D.C., on behalf of approximately 2,000 transgender people incarcerated in federal prisons across the United States. All three plaintiffs were diagnosed with gender dysphoria by BOP medical providers and prescribed hormone therapy by health care staff, but either had their treatments suspended or were told they would be suspended soon. The filing argues this policy violates the Eighth Amendment’s prohibition on “cruel and unusual punishment,” which federal courts have long held includes the denial of medically necessary health care, including access to gender-affirming care. It also argues that the policy violates the equal protection requirement of the 5th Amendment, the Administrative Procedure Act, and the Rehabilitation Act. The case was filed on behalf of the three plaintiffs and all other transgender people in federal prisons by the ACLU, the ACLU of DC, and the Transgender Law Center. BOP also instructed officials to remove any transgender women held in women’s facilities and place them in men’s facilities, an issue under challenge in multiple separate lawsuits. Today’s order from the court can be found here.Court Case:Kingdom v. TrumpFederal Judge Temporarily Enjoins Federal Prison Officials From Withholding Health Care From Incarcerated Trans People. Explore Press Release. Prisoners' Rights LGBTQ Rights **Federal Judge Temporarily Enjoins Federal Prison Officials from Withholding Health Care From Incarcerated Trans People** Prisoners' Rights LGBTQ Rights **Federal Judge Temporarily Enjoins Federal Prison Officials from Withholding Health Care From Incarcerated Trans People** Press ReleaseMay 2025LGBTQ RightsFamilies Challenge Kansas Ban On Medical Care for Transgender AdolescentsLAWRENCE – Two transgender adolescents and their parents have filed a challenge in Kansas state court against SB 63, a law passed earlier this year prohibiting access to gender-affirming medical treatments for transgender people under 18. Filed by the ACLU and the ACLU of Kansas in District Court of Douglas County, Loe v. Kansas charges SB 63 with violating the Kansas Constitution’s guarantees of equal protection and fundamental rights. The case was filed pseudonymously on behalf of 16-year-old Ryan Roe and his mother Rebecca Roe as well as 13-year-old Lily Loe and her mother Lisa Loe. \"Our clients and every Kansan should have the freedom to make their own private medical decisions and consult with their doctors without the intrusion of Kansas politicians,\" said D.C. Hiegert, Civil Liberties Legal Fellow for the ACLU of Kansas. \"SB 63 is a particularly harmful example of politicians' overreach and their efforts to target, politicize, and control the healthcare of already vulnerable Kansas families. We are honored to represent our clients in standing up for their constitutional rights and in fighting back against this threat to our communities.\" “Bans like SB 63 have already had catastrophic effects on the families of transgender youth across the country,” said Harper Seldin, Senior Staff Attorney for the ACLU’s LGBTQ & HIV Project. “These bans have uprooted many families from the only homes they’ve ever known while forcing many more to watch their young people suffer knowing a politician stands between them and their family doctor’s best medical judgment. We are determined for every state to be a safe place to raise every family, and that means fighting SB 63 until all transgender Kansans have the freedom to be themselves.” SB 63 prohibits medical providers in the state of Kansas from providing gender-affirming medical treatments, such as hormone therapies and pubertal suppressants, to transgender youth diagnosed with gender dysphoria. The law allows these same treatments to be provided to cisgender youth for any other reason. SB 63 was passed by the Kansas state legislature in January then vetoed by Governor Laura Kelly, who said in her veto statement “it is not the job of politicians to stand between a parent and a child who needs medical care of any kind.” The legislature overrode her veto and SB 63 took effect on February 20. The complaint filed today can be found here.Affiliate:KansasFamilies Challenge Kansas Ban On Medical Care For Transgender Adolescents. Explore Press Release. LGBTQ Rights **Families Challenge Kansas Ban On Medical Care for Transgender Adolescents** LGBTQ Rights **Families Challenge Kansas Ban On Medical Care for Transgender Adolescents** Press ReleaseMay 2025LGBTQ RightsJoint Statement on Preliminary Injunction Ruling in Case Challenging Anti-Transgender Bathroom BanMISSOULA, Mont. — Earlier today, a Missoula County District Court granted a preliminary injunction in Perkins v. State of Montana, blocking HB 121 during the lifetime of the case and allowing people to use restrooms and public facilities that align with their gender identity. In its order, the court found that: “All Montanans regardless of gender, fully and properly expect their transgender or intersex identity, anatomy, and genetics will not be subject to the prying eyes of others or to governmental snooping or regulation.” HB 121 is one of the broadest anti-transgender bathroom bans in the country. It banishes transgender and intersex people to the fringes of society by making it nearly impossible for them to exist in public life. The ACLU of Montana, the ACLU, and Legal Voice filed a challenge to HB 121 on March 27, 2025, immediately after the bill was signed into law. They represent five plaintiffs who are transgender or intersex. On April 2, a District Court in Missoula issued an emergency temporary restraining order (TRO) on HB 121. At an April 21 hearing, the TRO was extended through May 16. In issuing today’s preliminary injunction, the court recognized that the plaintiffs made a strong initial argument that the law violates the Montana Constitution because it is discriminates against transgender and intersex people, undermines privacy rights, and blocks the pursuit of life’s basic necessities. It also found that HB 121 would cause real and significant injuries to the plaintiffs. In finding that the plaintiffs are likely to succeed on their constitutional equal protection claim, the court held: “Transgender Montanans have been subjected to such a history of purposeful unequal treatment and have been relegated to such a position of political powerlessness as to command extraordinary protection from the majoritarian political process.” “This ruling reaffirms the truth about bathroom bans: they’re motivated by prejudice, and they don’t protect anyone,” said Robin Turner, Montana staff attorney at Legal Voice. “HB 121 undermines Montana’s strong constitutional protections against government overreach and subjects people to unacceptable privacy violations. Transgender people are vulnerable to violence in restrooms, and they deserve protection instead of persecution.” “This law is the embodiment of the governmental overreach that the Montana Constitution protects against,” said ACLU of Montana Executive Director Akilah Deernose. “It promotes misinformation, bigotry, and fear towards our trans and intersex family and friends. Everyone deserves to use the bathroom safely and in peace. Discriminatory laws like HB 121 violate fundamental rights guaranteed by the state constitution and have no place in Montana.” The state has the option of appealing the District Court’s ruling on the preliminary injunction to the Montana Supreme Court. Meanwhile, the case will proceed in District Court. A trial has not yet been scheduled. As of 2019, twenty-one states, the District of Columbia, and more than 200 cities and counties had enacted laws permitting transgender people to access sex-separated facilities that align with their gender identity. Research has shown that these laws have not caused public safety incidents. The truth is that it is transgender people who are most vulnerable to harassment and violence in sex-separated spaces such as restrooms. One survey found that 12% of transgender respondents had been verbally harassed in public restrooms in the previous year and 60% had avoided using public restrooms because they feared confrontation.Court Case:Perkins et al. v. State (HB 121)Affiliate:MontanaJoint Statement On Preliminary Injunction Ruling In Case Challenging Anti-transgender Bathroom Ban. Explore Press Release. LGBTQ Rights **Joint Statement on Preliminary Injunction Ruling in Case Challenging Anti-Transgender Bathroom Ban** LGBTQ Rights **Joint Statement on Preliminary Injunction Ruling in Case Challenging Anti-Transgender Bathroom Ban**"}