{"id": 2109, "name": "Public Interest Legal Foundation", "domain": "publicinterestlegal.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://publicinterestlegal.org/in-the-news/vegas-voters-registered-with-addresses-at-topless-bar-casino-lawsuit/", "title": "Vegas Voters Registered With Addresses At Topless Bar Casino Lawsuit", "content": "Home AboutAbout PILFTeamBoard of DirectorsJobs About PILF Team Board of Directors Jobs About PILF Team Board of Directors Jobs Cases MediaPress ReleasesElection FrontlinePodcast Press Releases Election Frontline Podcast Press Releases Election Frontline Podcast Reports IssuesTied Elections DatabaseSave Election DayVoter Roll ErrorsForeign Nationals VotingVote by MailERIC Tied Elections Database Save Election Day Voter Roll Errors Foreign Nationals Voting Vote by Mail ERIC Tied Elections Database Save Election Day Voter Roll Errors Foreign Nationals Voting Vote by Mail ERIC Resources Contact Home AboutAbout PILFTeamBoard of DirectorsJobs About PILF Team Board of Directors Jobs About PILF Team Board of Directors Jobs Cases MediaPress ReleasesElection FrontlinePodcast Press Releases Election Frontline Podcast Press Releases Election Frontline Podcast Reports IssuesTied Elections DatabaseSave Election DayVoter Roll ErrorsForeign Nationals VotingVote by MailERIC Tied Elections Database Save Election Day Voter Roll Errors Foreign Nationals Voting Vote by Mail ERIC Tied Elections Database Save Election Day Voter Roll Errors Foreign Nationals Voting Vote by Mail ERIC Resources Contact **Vegas voters registered with addresses at topless bar, casino: lawsuit** Share on Facebook Share on Twitter Share on Telegram By: Mark Kellner Hundreds of individuals in Clark County, Nevada — home to Las Vegas and the majority of the Silver State’s registered voters — appear on the rolls with residential addresses in a casino, several industrial parks and Larry Flynt’s Hustler Erotic Ultra Club, a lawsuit filed Tuesday in district court charges. Thelegal filing allegesthat registrar Lorena Portillo, in her second year of heading the county’s election department, is not ensuring voter rolls are accurate. “In Clark County, people are registered to vote from strip clubs, casinos, gas stations and more crazy addresses where it appears no one could reasonably live,” said J. Christian Adams, president of the Public Interest Legal Foundation, which sued along with Nevada voters Frederick H. Kraus and Joey Paulos. The Hustler Erotic Ultra Club, a unit of the late pornographer’s business empire, opened in 2010 and is visible via outdoor signage as a jiggle joint. A worker who answered the phone Thursday affirmed that the business offers topless female entertainment. Photos and declarations in the filing allege voters are registered as “residing” at an industrial park in Boulder City, as well as a sushi restaurant there. A Meineke Car Care Center franchise in Las Vegas, as well as Trigg Laboratories, a manufacturer of personal lubricants, and downtown staple Binion’s Gambling Hall, one of the oldest casinos, were also documented as “home” addresses of registered voters, along with a US Postal Service branch and a US Department of Agriculture service center. Voting by mail has skyrocketed in Nevada since the pandemic. While polling places are expected to be open statewide, registered voters are sent ballots at their registered home address. The advocacy group says it has notified Clark County of irregularities in addresses since the 2020 election and points to the 2022 midterm contests as an example of the impact “bad” addresses may have on voting. Two years ago, 95,556 ballots were sent to undeliverable or “bad” mailing addresses, representing 5% of the state’s active voter roll, according tofiguresreleased by the secretary of state’s office. Of that number, 69,698 undeliverable ballots were in Clark County. That year, Democratic Sen. Catherine Cortez Masto won a second term over former state attorney general Adam Laxalt, a Republican, by 7,928 votes. “We are asking the court to force Nevada election officials to investigate any improper commercial addresses on the voter roll. We must have this fixed before the 2024 election. Otherwise, some of these strip clubs and casinos will receive ballots in the mail,” Adams said. His organization says it is the nation’s only law firm “dedicated wholly to election integrity” and last month sued Carrie-Ann Burgess, interim voter registrar in Washoe County,allegingvoters listed a Reno city park facility, a downtown office building and a coffee shop as “home” addresses. Stephanie Wheatley, a public information officer for Clark County, said the government “does not comment on pending litigation.” Washoe County spokeswoman Bethany Drysdale said via email, “We follow state and federal law in how we clean our voter rolls.” Follow Follow Follow Public Interest Legal Foundation All Rights Reserved Privacy Policy Terms and Conditions"}