{"id": 1353, "name": "The Age (Australia)", "domain": "theage.com.au", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.theage.com.au/national/victoria/life-in-the-burbs-20230508-p5d6tm.html", "title": null, "content": "We’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Our network **The Age** **The Age** **The Age** **The Age** Sections Network Home Melbourne Victoria PoliticsShow subsectionsFederal election 2025FederalVictoriaNSWQueenslandWestern Australia Federal election 2025 Federal Victoria NSW Queensland Western Australia Federal election 2025 Federal Victoria NSW Queensland Western Australia BusinessShow subsectionsCompaniesMarketsBulls N' BearsThe economyBanking & financeSmall businessMediaWorkplace Companies Markets Bulls N' Bears The economy Banking & finance Small business Media Workplace Companies Markets Bulls N' Bears The economy Banking & finance Small business Media Workplace WorldShow subsectionsNorth AmericaEuropeAsiaMiddle EastOceaniaSouth AmericaAfrica North America Europe Asia Middle East Oceania South America Africa North America Europe Asia Middle East Oceania South America Africa NationalShow subsectionsNSWQueenslandWestern Australia NSW Queensland Western Australia NSW Queensland Western Australia Opinion PropertyShow subsectionsNewsDomain MagazineLivingAuctionsFinancing News Domain Magazine Living Auctions Financing News Domain Magazine Living Auctions Financing SportShow subsectionsAFLCricketSoccerRacingTennisNRLRugby unionNetballBasketballMotorsportCyclingGolfNFLAthleticsSwimmingBoxing AFL Cricket Soccer Racing Tennis NRL Rugby union Netball Basketball Motorsport Cycling Golf NFL Athletics Swimming Boxing AFL Cricket Soccer Racing Tennis NRL Rugby union Netball Basketball Motorsport Cycling Golf NFL Athletics Swimming Boxing Good FoodShow subsectionsEating outRecipesTips & adviceDrinks Eating out Recipes Tips & advice Drinks Eating out Recipes Tips & advice Drinks CultureShow subsectionsMoviesTV & radioMusicCelebrityBooksComedyDanceMusicalsOperaTheatreArt & designLive reviewsTV guide Movies TV & radio Music Celebrity Books Comedy Dance Musicals Opera Theatre Art & design Live reviews TV guide Movies TV & radio Music Celebrity Books Comedy Dance Musicals Opera Theatre Art & design Live reviews TV guide LifestyleShow subsectionsHealth & wellnessFashionLife & relationshipsBeautyStyleHoroscopes Health & wellness Fashion Life & relationships Beauty Style Horoscopes Health & wellness Fashion Life & relationships Beauty Style Horoscopes TravellerShow subsectionsDestination guidesInspirationReviews & adviceTravel news Destination guides Inspiration Reviews & advice Travel news Destination guides Inspiration Reviews & advice Travel news Good Weekend Spectrum Sunday Life MoneyShow subsectionsSuper & retirementInvestingBankingBorrowingSavingTaxPlanning & budgetingInsurance Super & retirement Investing Banking Borrowing Saving Tax Planning & budgeting Insurance Super & retirement Investing Banking Borrowing Saving Tax Planning & budgeting Insurance Education Healthcare EnvironmentShow subsectionsConservationClimate changeSustainabilityWeather Conservation Climate change Sustainability Weather Conservation Climate change Sustainability Weather TechnologyShow subsectionsVideo gamesHome techPhonesGadgets Video games Home tech Phones Gadgets Video games Home tech Phones Gadgets Drive PremiumSubscribe Today’s Paper Good Food Guide Daily Puzzles More Letters Editorial Campus Obituaries Explainers Quizzes Podcasts The Sydney Morning Herald The Age Brisbane Times WAtoday The Australian Financial Review Domain Commercial Real Estate Drive **Life in the ’burbs** The Age asked Melburnians to write about their suburb, whether the cliches about it are true and how life there has changed in recent years. **Save articles for later** Add articles to your saved list and come back to them any time. **Has your suburb been featured? Check our interactive map** With The Age’s new interactive feature, you can easily search our archive to see all the Melbourne suburbs that have featured in our series. May 26, 2025 byPatrick O'Neil **My tiny suburb birthed two huge celebrities, but that’s not why we look down on our neighbours** Visitors come to my suburb from around Melbourne for an experience that isn’t available across the city’s flat landscape – even if it is a bit wetter here. June 9, 2025 byGreg Hardy **A chance left turn 20 years ago led me to the suburb of my dreams** I stumbled on my suburb by accident after taking a spontaneous turn off the highway to avoid a car accident. June 2, 2025 byMegan Riley **My suburb is the beating cauliflower heart of Melbourne’s gluten-free belt** Our high street has been named the coolest in the world. The actual coolest. Even if it is only a drop punt away from the “s--- Coles”. May 26, 2025 byTony Wilson **In my suburb, it’s easy to tell the locals apart – just look at their legs** A flat gradient is a rare occurrence in my suburb, where the locals stand out for one physical feature – the result of trekking up and down endless hills. May 19, 2025 byLarissa Dubecki **My suburb is an undiscovered slice of fresh air, and locals like it that way** The residents of my suburb tell me they grew up here, as did their parents, and they hope their children will stay here as well. And why wouldn’t they want to? May 12, 2025 byAramiha Harwood **My suburb has a reputation for being soulless and unliveable. But people flock here anyway** I moved back to Melbourne from Hong Kong with a mantra: I can’t do typical suburbia. Luckily, someone had built a solution. May 5, 2025 byJoanne Anderson **My suburb is one of Melbourne’s most liveable, though nobody seems to know it exists** Many feared the skyrail would tear my suburb apart, but the unified town centre has given it a heart, and a whole new personality. April 28, 2025 byMatt McDonald **My suburb’s gated enclave is known as the Toorak of the west. It wants to secede** Officially, I was a resident of a plain-jane suburb, but my letters and parcels marked me a proud inhabitant of a refined community. April 21, 2025 byDavid Goodwin **My suburb is one of Melbourne’s tiniest. I want to make it bigger** The heart of my suburb was ailing when we moved here – until something changed. Now my neighbours want to gatekeep it from new residents. April 14, 2025 byTom Hird **My suburb on the city fringe has a claim to fame, but it’s no one-trick pony** A Shake’n’Dog at Wendy’s and a movie from Blockbuster - my childhood at the end of the line was charmed. My suburb has since transformed, but my family name can rekindle the past. April 7, 2025 byMadison Griffiths **My suburb was meant to be the Toorak of the north but our reputation took a nefarious turn** A ranking of Melbourne’s suburbs once listed mine at 184th place. Its name used to make taxi drivers fearful, but life here has changed. March 31, 2025 byMichael Church **In my suburb we’re not snobs. But we look down on Black Rock and Brighton** My suburb is home to the real Fountain Lakes shopping centre, which extends ostentatiously over the top of eight lanes of the Nepean Highway. March 24, 2025 byColin Hill **My seaside suburb once had a whimsical name. Then it was given a posh rebrand** Named with a regal nod, my suburb is known for its well-heeled residents and summer vibes. But there’s more to us than our royal connection. March 10, 2025 byCaroline Baker **My suburb was a spacious garden until residents built over their backyards** In my exclusive suburb a happy coincidence made the homes friendly and green, but a big shift in recent years has changed all that. March 3, 2025 byIan Hundley **My suburb has a secret treasure that was locked away for 50 years** With restrictions preventing subdivisions despite the huge blocks, homes come onto the market in my suburb ripe for a renovation or a rebuild. February 24, 2025 bySara McMillan **My suburb has panoramic views: ‘You can see the whole world!’** What other Melbourne suburb would feature a Tram Road, even though there are no actual trams anywhere to be seen? February 17, 2025 byLouise Kloot **My suburb is known for its Karens and WAGs, but we’re not all like that** Whether you call it Brighton East, or East Brighton, there can never be enough Brightons, says a long-time local. February 10, 2025 bySamantha Keir **My suburb is known as the Elwood of the west, but it’s actually better (apart from the stench)** On warm summer evenings, when the streets are full of punters, you can understand why it was named one of the coolest neighbourhoods in the world. February 3, 2025 byJohn Weldon **My suburb has the best of all worlds. For years, there was a whiff of discontent** Even as the city has grown around it, my suburb has retained a country feel with market gardens and old farm buildings on the village fringe. January 27, 2025 byWarren Duncan **Snakes in the basement and summer dance parties: My suburb is a cut above plain old Coburg** There’s one thing that makes Coburg North superior to plain old Coburg, and it isn’t the all-day summer dance parties. January 20, 2025 byMichael Dwyer **My suburb used to be a country town that looked down on its neighbours** The country town feel of our suburb still survives, even if we’re surrounded by sprawl instead of farmland these days. December 16, 2024 byClancy Briggs **Hands off, Camberwell: Melbourne’s most charming cinema is ours, not yours** My suburb’s stereotype is Lululemon, accountants and lawyers, with a lot of “Where are your kids at school?” There’s also the case of an inter-suburban theft. December 9, 2024 bySarah Moller **The parks in my valley suburb are great – but there’s a grim reason why** Cyclists and walkers can easily find relief from the inner city in my suburb’s walking tracks, which overlook the neighbourhood’s biggest misfortune. December 2, 2024 byChris Poropat **My tiny offshoot suburb is just like Coburg – but boring** I tell myself that we made a very canny investment when we moved here. But the only reason was because we’d been priced out everywhere else. November 25, 2024 byDavid Clements **My suburb likes to hide its identity. Even our most famous building is misplaced** After coming up in the world, my suburb would love to build a moat around ourselves. Instead, we keep people out with a welcomed level crossing and plethora of speed bumps. November 18, 2024 byCara Waters **My suburb has a bad reputation, but buzzes with the energy of those making a second start** If you watched the recent Q&A filmed in my suburb, you’d think our area was little more than crime gangs, cultural ghettos and “white flight”. November 11, 2024 byRhonda Garad **My shabby suburb was once at the cutting edge. Now, it is filled with hard rubbish** I call my suburb retro chic, but others say it is shabby and tired. Change here is rapid, but one thing is certain - if you let go of your trolley in the Coles supermarket in Dorset Square it’ll go rogue. November 4, 2024 byEverard Himmelreich **A notorious YouTuber came looking for trouble in my suburb – but we surprised him** I understand why Spanian stopped by during his tour of the world’s “most dangerous and notorious neighbourhoods”. The video he shot revealed who we really are. October 28, 2024 byStefan Koomen **My suburb was like a dozy old uncle. And then it discovered designer threads** When I told a snobbish friend I had found a small but affordable house, I was firmly instructed to tell everyone it was actually in Ormond. October 21, 2024 byLinda Himmelfarb **I left Melbourne’s inner city to live on the fringe and found exactly what I needed** I’ve found a nurturing environment for my children. But like many locals in newer suburbs, I’m concerned about transport problems and access to services such as healthcare. October 14, 2024 byShemsiya Waritu **My suburb might be boring, but walking the streets is an extreme sport** Our streets have seen countless broken wrists and scraped knees, with many locals familiar with the thrill of fanging downhill on what are arguably suburban Melbourne’s steepest streets. October 7, 2024 byJoe Comer **My suburb fought so hard to stay off the radar that Melburnians can’t even get its name right** It’s nice to live in a suburb that is just somewhere people are happy to live. We’ve got one cafe, one convenience store and two churches – and the only residential tower is a retirement village. September 30, 2024 byBen Ruse **Once beautiful but neglected: My ‘Cinderella’ suburb is Melbourne’s mid-century belle** My parents’ first date in the 1950s was at a party in my now home suburb. The area was popular at the time with creative types such as writers, artists, actors, fashion designers. September 23, 2024 byFiona Austin **If Carlton North and Footscray had a love child, it would look like my suburb** The contrasts of my suburb are never more evident than at spring carnival time, when hordes of the well-heeled gatecrash the neighbourhood. September 16, 2024 byNoel Newell **My suburb is so defiantly untrendy, it feels like even the Bunnings is trying to escape** There’s no ‘keeping up with the Joneses’ around here – people quietly go about living their lives in a landscape of benign suburban sameness. September 9, 2024 byMarisa Mowszowski **Grandma said my suburb was for ‘poor people’. Now it’s one of Melbourne’s most expensive** When we moved here, Grandma couldn’t understand why my parents wouldn’t buy somewhere nice, like Glen Waverley. September 2, 2024 byIsabel Robinson **I moved from the trendy inner north to a boring suburb – and it was worth the trade-offs** Now, when I visit suburbs with cachet, I leave feeling that being burdened with that much cultural capital looks exhausting. August 26, 2024 byJustin Buckley **My little-known suburb was an inner-city swamp known as ‘Worst Smelbourne’** These days, you can look out over a valley of curved metal for the best industrial sunset view in Melbourne. August 19, 2024 byKylie Northover **There’s much more to my suburb than gangsters and footballer’s wives** My neighbourhood is considered one of the posher western suburbs – but an element of the underworld makes it an interesting proposition. August 12, 2024 byKerrie O'Brien **A fight over a mural has put a frog in my suburb’s throat** My suburb has witnessed school closures and division over elevating the train station. It’s now united but conscious of over-development and a nearby shopping centre’s sprawl. August 5, 2024 byMary-Jane Boughen **A monstrosity looms over my suburb. Yet, it’s hard to beat as the place to live** In some suburbs, you’d find irritated locals fighting tooth and nail to have this monstrosity removed. In my suburb, many fought to have it heritage listed. July 22, 2024 byLawrie Bradly **My suburb is a woke, lefty haven. It may also be Melbourne’s whitest** When Peter Dutton takes aim at “woke inner-city elites”, he means people in my suburb, where all children (or wokelings) are fluent in Welcome To Country. July 15, 2024 byTom Ormonde **My village may be tiny but you can still get a latte every 165 metres** Our little community sits at the point where concrete suburbia meets bushland. And like all good frontier communities, we make our own rules. July 8, 2024 byRosie Beaumont **My suburb once had 98 pubs. These days, you’re more likely to bump into a ‘nana trolley’** With a “pub on every corner” during the gold rush, my neighbourhood is now a source of amusement for suburban workmates. July 1, 2024 byElla Hamilton **Coles, Myer, Ansett: In my suburb, these weren’t brands. They were our neighbours** My suburb’s luminaries were regularly seen picking up their milk supplies in their Rolls-Royces, while locals told the time by spotting a tycoon in his private helicopter. June 24, 2024 byJon McMillan **My big hug of a suburb never wants for anything. Who cares if it’s boring and bland?** My suburb’s secret sauce is its solidity. What the younger me saw as boring and bland, I now recognise as reassuring, comfortable and privileged. June 17, 2024 byJacquie Byron **My unpretentious suburb is such a vast nothingness, it doesn’t even have a stereotype** Maybe Clayton South’s bubble of irrelevancy is its appeal. You can leave the house looking as terrible as you please, without fear of retribution. June 10, 2024 byMaggie Zhou **My suburb is Melbourne’s smallest – and no, it’s not the one you think** Even after the Brighton Empire’s annexation, my whole suburb has so far defied the worst of the growth-for-growth’s-sake mindset. June 3, 2024 byRobert James Stove **On the mean streets of 1970s Fitzroy, even the trees looked like they wanted to die** The Fitzroy of today – filled with bars, cafes, markets and designer boutiques – was unimaginable. But back then, locals loved the cheap rent and “anything goes” attitude. May 27, 2024 byJustine Costigan **The Age** **The Age** Twitter Facebook Instagram RSS **Our Sites** The Age The Sydney Morning Herald Brisbane Times WAtoday The Australian Financial Review Domain Drive **Classifieds** Tributes Place your ad Commercial Real Estate **The Age** Contact & support Advertise with us Newsletters Accessibility guide Sitemap Photo sales Purchase front pages Content licensing Work with us Terms of use Privacy policy Press Council Charter of Editorial Independence AI Editorial Guidelines **Products & Services** Subscription packages My account Subscriber FAQs Delivery status Today’s Paper Good Food Guide Daily Puzzles Copyright ©2025"}