{"id": 1494, "name": "Troy Messenger", "domain": "troymessenger.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.troymessenger.com/2025/06/11/council-rescinds-school-board-appointment-wingard-not-going-to-just-roll-over-and-just-let-this-be/", "title": "Council Rescinds School Board Appointment Wingard Not Going To Just Roll Over And Just Let This Be", "content": "Home NewsBusinessRecords Business Records Business Records Obituaries SportsTroy UniversityCharles Henderson HighPike County HighPike Liberal ArtsGoshen HighZion Chapel Troy University Charles Henderson High Pike County High Pike Liberal Arts Goshen High Zion Chapel Troy University Charles Henderson High Pike County High Pike Liberal Arts Goshen High Zion Chapel Lifestyles Opinion ContestsChristmas Movie Showdown Christmas Movie Showdown Christmas Movie Showdown Social MediaFacebookTwitter Facebook Twitter Facebook Twitter Special Sections2024 Graduation MagazineThe Catch 2023 Football EditionThe Catch 2023 Baseball EditionProgress 2023 2024 Graduation Magazine The Catch 2023 Football Edition The Catch 2023 Baseball Edition Progress 2023 2024 Graduation Magazine The Catch 2023 Football Edition The Catch 2023 Baseball Edition Progress 2023 Classifieds ServicesAbout UsPoliciesSubmitSubmit a News TipSubmit a PhotoEngagement AnnouncementWedding AnnouncementSubmit A Classified AdvertisementSubmit a Letter to the Editor About Us Policies SubmitSubmit a News TipSubmit a PhotoEngagement AnnouncementWedding AnnouncementSubmit A Classified AdvertisementSubmit a Letter to the Editor Submit a News Tip Submit a Photo Engagement Announcement Wedding Announcement Submit A Classified Advertisement Submit a Letter to the Editor About Us Policies SubmitSubmit a News TipSubmit a PhotoEngagement AnnouncementWedding AnnouncementSubmit A Classified AdvertisementSubmit a Letter to the Editor Submit a News Tip Submit a Photo Engagement Announcement Wedding Announcement Submit A Classified Advertisement Submit a Letter to the Editor Submit a News Tip Submit a Photo Engagement Announcement Wedding Announcement Submit A Classified Advertisement Submit a Letter to the Editor E-Edition Public Notices **Council rescinds school board appointment; Wingard ‘not going to just roll over and just let this be’** Published 12:37 pm Wednesday, June 11, 2025 ByJosh Boutwell The Troy City Council on Tuesday rescinded its appointment of Makelia LaRee Wingard to the Troy City Schools Board of Education. Wingard was appointed to the school board in a 4-0 vote with no opposition at the May 27 meeting. At the work session preceding the June 10 meeting, the council went into an executive session to discuss the “general reputation and character of an individual.” At the council meeting that followed, Councilwoman Stephanie Baker made a motion to rescind Wingard’s appointment. “At the last council meeting we took action to appoint (someone) to the Troy City Schools Board of Education,” Baker said. “At that time, to be perfectly honest, I took that vote with limited time and information, and since then, with the pleasure of a little bit more of those items, I feel burdened tonight to make a motion to rescind that vote.” Councilman Max Davis seconded the motion and he, Baker and Councilman Greg Meeks all voted to approve the motion to rescind the vote. Councilwoman Sharon McSwain-Holland abstained from the vote. Holland was not at the prior meeting. Councilwoman Wanda Moultry, who nominated Wingard, was the only opposition to the motion, which carried with a 3-1-1 vote. “The only comment I have is that I am seeking legal advice on a matter of process and procedures that are done as it relates to an appointment to my district, District 5, to the Board of Education,” Moultry toldThe Messenger. “I’m seeking legal advice in regards to that matter and what I need to do to proceed.” Wingard, who has a child in the Troy City Schools school system, said Wednesday she believes the decision to rescind her appointment came after some aldermen received pushback from community members upset over how vocal she is about the school system. “To my understanding, there are a lot of people that are upset with my appointment because I’m too vocal because I am a parent that stayed on those teachers (at Troy Elementary School) and spoke out frequently when it comes to my son,” Wingard said. Wingard said an issue with a teacher has caused her to speak out regarding her son’s treatment. “There has been an issue with a particular teacher over there that has had a lot of negative run-ins with not just my son but other kids as well,” Wingard continued.Wingard said that she had tried for months to have a discussion with the teacher with no success. The issue culminated on May 15 when Wingard went to Troy Elementary to speak to the teacher. “I entered the school on May 15 to go speak with that teacher but I didn’t sign into the office,” Wingard said. “I’ve always been a parent that would be vocal and have meetings with the principal and send emails to the board and superintendent about stuff that has gone on at the schools.” Wingard acknowledges that she should have signed in at the school office but emphasized there was no ill intent on her part. “Was I wrong for not singing into that office? I was,” she said. “It was a decision I made and I stand behind that decision. I made that decision to speak to (the teacher) without signing in first and I can’t take that back; it’s already done. What I do know is that I did not enter in a threatening or violent manner. I came to have a conversation, which I’ve been trying to do the whole year. (The teacher) would always decline meeting us, and I was informed that teachers have the right to decline speaking to parents.” Wingard said the teacher in question again refused to speak to her but that another teacher pulled her aside and spoke to her. “I was not wrong for being a parent who wanted to ensure that my child is OK over there,” Wingard emphasized. Wingard also said that she is not alone in regards to her issues. “It’s not just me. Over 30 parents have reached out to me and had the same run-ins with the same teacher and made the same exact complaints and went to the school and nothing has been done,” said Wingard. Wingard said that it’s her belief that those in leadership positions should be the ones who are vocal about student treatment. “The board of education – as well as the city council – and those types of positions are here to fight for those kids who don’t have a voice to be able to speak up against adults,” she said. “Our job is to ensure these kids receive the best education possible and they are in a safe school environment and not a hostile one, so that they can learn and be kids and can grow and form healthy relationships.” Regardless of the outcome over this situation, Wingard said she won’t be quiet. “I’m not going to just roll over and just let this be,” she stated emphatically. “I’m not, I’m just not. I won’t let that happen.” **Troy City Council recognizes City of Troy Queens** **Harrison Camwell’s way of giving back** **‘Kids Fishing Day’ a Pike County tradition** **Trojan Patriot Academy kicks off second year** Home News Sports Opinion Lifestyles Obituaries Business Small Business About Us Subscriptions Policies Submit a News Tip Submit a Photo Submit a Letter to the Editor Birth Announcement Birthday Announcement Engagement Announcement Wedding Announcement © 2025, The Troy Messenger"}