{"id": 571, "name": "Frontiers in Global Women's Health", "domain": "frontiersin.org/journals/global-womens-health", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/global-womens-health/articles/10.3389/fgwh.2025.1531934/full", "title": "Global Womens Health", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Aging in Women Contraception and Family Planning Infectious Diseases in Women Maternal Health Quality of Life Sex and Gender Differences in Disease Women's Mental Health Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Aging in Women Contraception and Family Planning Infectious Diseases in Women Maternal Health Quality of Life Sex and Gender Differences in Disease Women's Mental Health Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Aging in Women Contraception and Family Planning Infectious Diseases in Women Maternal Health Quality of Life Sex and Gender Differences in Disease Women's Mental Health Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office SYSTEMATIC REVIEW article Front. Glob. Women’s Health Sec. Women's Mental Health Volume 6 - 2025 |doi: 10.3389/fgwh.2025.1531934 This article is part of the Research TopicBridging the Knowledge Gap: Mental Health, Substance Use Disorders, and Mortality in WomenView all 6 articles **Autism, Menstruation and Mental Health-A Scoping Review and A Call to Action** SA Health, Adelaide, Australia The final, formatted version of the article will be published soon. Select one of your emails You have multiple emails registered with Frontiers: Notify me on publication Please enter your email address: If you already have an account, pleaselogin You don't have a Frontiers account ? You canregister here Introduction: There is increasing evidence regarding the mental health implications of cyclical hormonal fluctuations associated with menstruation, as well as of key reproductive transitions (menarche and menopause), in typically developing individuals. Autism spectrum disorder (ASD), a complex neurodevelopmental condition, may predispose individuals to maladaptive responses to life changes such as menstruation. Despite the importance of this topic, research relating to menstrual experiences across the lifespan of autistic adults remains scarce, largely due to the intersecting effects of multiple marginalizing characteristics experienced by this population. This research gap significantly limits our understanding of how menstruation impacts the mental health of autistic individuals.Objectives: The purpose of this scoping review was to examine existing evidence about menstrual experiences, including menarche and menopause, and their impact on mental health among autistic individuals, and propose a biopsychosocial framework for the complex interplay of individual, healthcare, and societal vulnerabilities that predispose autistic individuals to negative menstrual experiences.Methods: A scoping review of original articles, quantitative and qualitative, published in English from 1980 onwards, identified through search of online databases and reference lists, using PRISMA extension for scoping reviews.Results: A total of 45 studies were identified to meet the specified inclusion and exclusion criteria.The key emerging themes were the mental health impact of menstruation, the occurrence and experience of menstrual disorders among autistic individuals, as well as support strategies and healthcare utilization by that population.Conclusions: Although our current knowledge on menstrual health specific to autistic individuals is still scant, it nevertheless raises significant concerns regarding potential challenges. The findings of this study have been placed within the bio-psycho-socio-cultural framework to emphasize that menstrual experiences occur within the context of person-environment transactions, and that autistic individuals are vulnerable to negative menstrual experiences because of adverse or non-facilitative societal and healthcare environments. Further large-scale studies addressing identified gaps (e.g. influence of gender diversity, impact of medical comorbidities, trauma and stigma) is warranted. Keywords:Autism Spectrum Disorder, autistic individuals, Menstruation, Menarche, Menopause, sexspecific medicine Received:21 Nov 2024;Accepted:10 Jun 2025. Copyright:© 2025Skommer and Gunesh. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) or licensor are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. * Correspondence:Joanna Skommer, SA Health, Adelaide, Australia Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Share on Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}