{"id": 1134, "name": "Pride Source", "domain": "pridesource.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://pridesource.com/article/in-a-time-of-erasure-we-must-protect-queer-media-a-pride-letter-from-the-editorial-director", "title": "In A Time Of Erasure We Must Protect Queer Media A Pride Letter From The Editorial Director", "content": "Entertainment Michigan National Marketplace Entertainment Michigan National Marketplace **Can we help you find something?** BTL 30th Anniversary Michigan National Politics Advice to Be Well Wedding Features Creep of the Week Music Entertainment Opinions Advertise Pitch a Story About Pride Source Who We Are Subscribe Download BTL Marketplace Home & Garden Health Weddings News Michigan Pride 2025 **In a Time of Erasure, We Must Protect Queer Media: A Pride Letter from the Editorial Director** **Independent LGBTQ+ media like Pride Source offers more than news — it’s a lifeline for those whose stories are too often ignored** Share on Facebook Share on Twitter Share by Email Twice that day, the tears came unbidden. I sat quietly off to the side, reading prompts as activists and organizers within Michigan’s LGBTQ+ community — gathered to show their support for Between The Lines during a difficult era for independent queer press — shared raw stories of struggle and resilience. When their words unexpectedly gave way to sobs, the weight of the moment shifted. I felt it settle differently in my chest. It was day two of the shoot for our videoWhen Mainstream Media Misses Us: Why LGBTQ+ Voices Need Pride Source. Affirmations, where we were shooting, was pulsing with stories of queer love, survival and the role Pride Source and Between The Lines, the longest-running LGBTQ+ publication in Michigan, has played over its 33-year history. In a period marked by efforts from those in power to mute and erase who we are, this project — and the LGBTQ+ media that inspired it — burns brighter than ever. Pride Source has been an enduring lifeline, a beacon for those whose stories are too often pushed to the margins. The message from all of our subjects that day was clear, from the ACLU's Jay Kaplan to Trans Sistas of Color Project founder Jeynce Poindexter: We can't afford to lose independent queer media, too, when we’re already at risk of losing so much. The first two voices cracked open before the camera. One spoke of how Pride this year carries a new ache — a mingling of hope and fear that hits beneath the surface. The other remembered the haunting echoes of the AIDS crisis in the ’80s, the ghosts of that time lingering still, casting long shadows over today’s battles. Hearing those stories stirred something deep within me. It reminded me of my own journey — finding belonging in these pages long before TikTok (and before I joined the staff), before the flood of social media, when Between The Lines was one of the only places local queer people could see themselves reflected. Longtime LGBTQ+ activist Judy Lewis shared how, in the mid-’90s, someone she knew had nearly taken their own life due to isolation. She said connecting to other community members through this very publication made them feel less alone and literally saved their life. What Lewis shared with me reminded me that these pages have always been more than news; they’ve been a community, a home. As someone who oversees editorial for the full spectrum of LGBTQ+ voices, I feel a deep responsibility to elevate those most marginalized — not just in the stories we tell, but in who we invite to help tell them. That’s why, in our last issue, we asked Baddie Brooks, Miss Trans Michigan 2025, to write an op-ed — giving her more than just the spotlight, but the space to speak in her own words about her experience as a young Black trans woman. And it’s why in our latest issue, we also invited Michelle Fox-Phillips, a longtime trans activist, to take the mic. I encourage you to read their powerful essays, and to pick up a copy of Pride Source Magazine, where Poindexter takes center stage on the cover. Inside, she shared how she has weathered “a lot of internal discrimination in the community,” yet continues to lead with resilience. For us to be seen, we need a safe place to tell the world who we really are — the pain inflicted by policy, the joy of hard-won triumphs, and everything in between. With no corporate filter and no outside agenda, Pride Source and Between The Lines have been those places for 33 years. That same intention guided our choice for this year’s Pride cover. We turned to trans and nonbinary muralist Eddie Chaffer of Son Visual Co., whose work lives at the intersection of identity, community and resistance. Their cover reminds me of the protest art we’ve seen throughout queer history — bold, urgent, impossible to ignore. A powerful tribute to queer defiance, the image centers a trans woman of color, surrounded by symbols that echo past movements and sound alarms about the present. It’s a reminder that since Black and brown trans people led the Stonewall riots over 50 years ago, Pride has always been political — and who we choose to center still matters. I came out at 18 on the wings of other people's stories, their words carrying me across the threshold I couldn't cross alone. Later, in college, they helped me understand myself more fully — what it meant to live, love and exist in the world as a gay person. I think about that often now, especially when I consider the impact these stories can have on someone else — like the trans kid struggling to reconcile their identity with their faith. Maybe they will readour recent storyabout 16-year-old Zach Nawyn-Hellinga, who was baptized by a Presbyterian church in Okemos with his post-transition chosen name. On that day, Zach stood in front of his congregation and claimed his name, his truth — and the entire church stood and responded in unison: “We see you.” For us to be seen, we need a safe place to tell the world who we really are — the pain inflicted by policy, the joy of hard-won triumphs, and everything in between. With no corporate filter and no outside agenda, Pride Source and BTL have been those places for 33 years. Every chance we get, we must keep sharing the essence of our humanity — especially to those who would rather we stay silent, or disappear altogether. You never know who might be listening with their heart wide open on either end of the political spectrum. Back at Affirmations, I witnessed a moment that captured exactly why this matters — the kind of connection that forms when someone is met with empathy and care. After one participant broke down in tears during their testimonial, I walked up and hugged her. But then, so did our camera operator — an ally, a stranger to her before that day. That moment of connection — of being seen and held just for showing up as yourself, especially when the world is shouting that you shouldn’t — that’s what we mean when we say: We see you. Walking alongside you this Pride, Chris AzzopardiEditorial DirectorOur community needs your support!Champion independent queer journalism with a BTL print subscription atpridesource.com/subscribeand join our Substack community, where you’ll find exclusive content and commentary atpridesource.substack.com. **Read More** **The Sacred Work of Jeynce Poindexter: A Detroit Ballroom Mother's Mission to Transform Trans Lives Through Advocacy and Love** On a late April morning, Jeynce Poindexter sits in Detroit Metro Airport waiting for her flight to Fort Lauderdale. Tomorrow is her birthday, but this isn't a[...] **Motor City Pride 2025: Over 60K Celebrate with Political Support From Whitmer, Slotkin and More — See the Pics!** Motor City Pride 2025 proved that Detroit's LGBTQ+ community remains strong and united, drawing more than 60,000 attendees to Hart Plaza for Michigan's largest[...] **Soapy Bears Clean Up at Annual Charity Car Wash in Ferndale** The Motor City Bears turned heads and raised funds on June 7 during their 17th annual car wash fundraiser at First Merchants Bank in Ferndale, with proceeds[...] **Detroit City FC Kicks Off First Official Pride Night With Goals, Glitter and Community Love** Get ready to cheer twice as loud — Detroit City FC is throwing its first official Pride Night celebration June 21, and it's serving up everything the[...] **How to Be the Queer You Needed: 77 Tiny, Mighty Acts of Pride** Pride is a muscle boy covered float that used to be sponsored by a vodka brand (we see you, fair-weather friends). A dozen dancing drag queens. A glittery[...] **Your 2025 Small-Town Pride Road Trip Plan** Need an escape from the daily barrage of anti-LGBTQ+ rhetoric flowing from Washington these days? With the Trump administration targeting our community from[...] **Popular Articles** How One Michigan Community Events Organizer Is Rewriting What It Means to Belong In a Time of Erasure, We Must Protect Queer Media: A Pride Letter from the Editorial Director Jeremy Moss, Michigan’s First Openly Gay State Senator, Defends Trans Rights as He Launches Congressional Campaign Drag, Dance and Defiant Joy: Ferndale Pride 2025 in Full Color — Photos Inside! How Stacey Hotwaxx Hale Revolutionized Detroit’s Music Scene as a Black Lesbian Woman **Pride Source Marketplace** **Matrix Ryan White HIV/AIDS Program** **Diversity Insurance Group** **The Wedding Shoppe** **First Presbyterian Church of Birmingham** **A Play About Jesus — With Jesus Seen Through the Eyes of an LGBTQ+ Activist** The show’s writer, Antonio David Garcia, wrote the play before becoming an atheist. **Why You’ve Probably Never Heard of Edward Brezinski, a Gay Michigan Artist Who Desperately Wanted to Become Famous** ‘Make Me Famous’ doc explores the strange, sometimes sad ‘70s and ‘80s art scene. **Leader of Anti-Equality Org Thinks Republicans Are Too Cozy with the Queers** \"I mean, there are a lot of reasons to go after Republicans. But being too liberal isn’t one of them.\" **Michigan** **The Sacred Work of Jeynce Poindexter: A Detroit Ballroom Mother's Mission to Transform Trans Lives Through Advocacy and Love** On a late April morning, Jeynce Poindexter sits in Detroit Metro Airport waiting for her flight to Fort Lauderdale. Tomorrow is her birthday, but this isn't a[...] **Motor City Pride 2025: Over 60K Celebrate with Political Support From Whitmer, Slotkin and More — See the Pics!** Motor City Pride 2025 proved that Detroit's LGBTQ+ community remains strong and united, drawing more than 60,000 attendees to Hart Plaza for Michigan's largest[...] **Soapy Bears Clean Up at Annual Charity Car Wash in Ferndale** The Motor City Bears turned heads and raised funds on June 7 during their 17th annual car wash fundraiser at First Merchants Bank in Ferndale, with proceeds[...] **Detroit City FC Kicks Off First Official Pride Night With Goals, Glitter and Community Love** Get ready to cheer twice as loud — Detroit City FC is throwing its first official Pride Night celebration June 21, and it's serving up everything the[...] **How to Be the Queer You Needed: 77 Tiny, Mighty Acts of Pride** Pride is a muscle boy covered float that used to be sponsored by a vodka brand (we see you, fair-weather friends). A dozen dancing drag queens. A glittery[...] **Your 2025 Small-Town Pride Road Trip Plan** Need an escape from the daily barrage of anti-LGBTQ+ rhetoric flowing from Washington these days? With the Trump administration targeting our community from[...] **From the Pride Source Marketplace** **David Harris Ph. D.** **Salem United Church of Christ** **Williams Volkswagen** **MotorCity Casino Hotel** **Macomb County STD Clinic** 734-263-1476Ann Arbor 48104 Michigan National Politics Entertainment Features About Pride Source Who We Are Download BTL Advertise Subscribe Pitch a Story Find a Copy **Support Pride Source’s Journalism** Get top LGBTQ+ headlines from the Pride Source newsroom"}