{"id": 2061, "name": "Newsful", "domain": "newsfulonline.com", "bias": "center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://newsfulonline.com/jealous-king-charles-strikes-a-new-deal-with-kate-and-william-insiders-claim/", "title": "Jealous King Charles Strikes A New Deal With Kate And William Insiders Claim", "content": "Nostalgia Etiquette Health Relationships News Nostalgia Etiquette Health Relationships News Our content is fact checked by our senior editorial staff to reflect accuracy and ensure our readers get sound information and advice to make the smartest, healthiest choices. We adhere to structured guidelines for sourcing information and linking to other resources, including scientific studies and medical journals. If you have any concerns about the accuracy of our content, please reach out to our editors by e-mailing[email protected]. **“Jealous” King Charles Strikes a New Deal with Kate and William, Insiders Claim** The King is afraid that his heir is stealing the limelight away from him. While most of the public focus surroundingKing Charles’ relationships with his sons has been on the tension between himself andPrince Harry, there have also been some issues between him and his oldest son,Prince William. According to insiders, he is “jealous” of his heir and his wife,Kate Middleton, as they manage to steal the attention from him. But according to sources, he has struck up a new deal with the pair to remedy the situation. 1The King Is Worried Will and Kate Are Stealing Attention From Him, Source Claims **1The King Is Worried Will and Kate Are Stealing Attention From Him, Source Claims** **1The King Is Worried Will and Kate Are Stealing Attention From Him, Source Claims** A source claims that since the Coronation, King Charles has been constantly compared to his beloved mother. And now he is worried that with Kate and Will’s growing popularity, his reign will be negatively impacted. 2He Is “Jealous” of Them, Says an Insider **2He Is “Jealous” of Them, Says an Insider** **2He Is “Jealous” of Them, Says an Insider** Royal columnist at The Daily Beast, Clive Irving, claims that Charles is very jealous of his son and daughter-in-law for their surging popularity. 3There’s a “Feeling” That William “Understands” the “Reality” More Than Charles **3There’s a “Feeling” That William “Understands” the “Reality” More Than Charles** **3There’s a “Feeling” That William “Understands” the “Reality” More Than Charles** “There’s a great deal of feeling that William understands the mood and the reality on the ground far more than Charles ever will,” Irving says. 4Charles Has Negotiated with Kate and Will **4Charles Has Negotiated with Kate and Will** **4Charles Has Negotiated with Kate and Will** Irving claims that Charles has negotiated with his son and daughter-in-law to regain a degree of control. 5They Reportedly Worked Out a Deal **5They Reportedly Worked Out a Deal** **5They Reportedly Worked Out a Deal** “They worked out a kind of accommodation of how much limelight each is going to be allowed, because Charles is always very jealous of other people stealing his limelight,” said Irving. 6They Can Have the Limelight 40 Percent and Him 60 Percent **6They Can Have the Limelight 40 Percent and Him 60 Percent** **6They Can Have the Limelight 40 Percent and Him 60 Percent** Irving says the division may be around “maybe 40 percent (for the Waleses’) and he keeps 60 percent. That seems to be the working arrangement.” 7Harry Also Claimed in “Spare” That His Father Was Jealous of the Couple **7Harry Also Claimed in “Spare” That His Father Was Jealous of the Couple** **7Harry Also Claimed in “Spare” That His Father Was Jealous of the Couple** This isn’t the first time Charles has been accused of being jealous of the couple. In Harry’s bookSpare, he claims the same thing. 8Charles Didn’t Want Will and Kate “Getting Loads of Publicity” **8Charles Didn’t Want Will and Kate “Getting Loads of Publicity”** **8Charles Didn’t Want Will and Kate “Getting Loads of Publicity”** Harry said William “did as much as Pa wanted him to do” which “sometimes that wasn’t much, because Pa and Camilla didn’t want Willy and Kate getting loads of publicity,” in the book. 9He Didn’t Like Them “Drawing Attention Away From Them or Their Causes” **9He Didn’t Like Them “Drawing Attention Away From Them or Their Causes”** **9He Didn’t Like Them “Drawing Attention Away From Them or Their Causes”** “Pa and Camilla didn’t like Willy and Kate drawing attention away from them or their causes. They’d openly scolded Willy about it many times,” he said. “Case in point: Pa’s press officer berated Willy’s team when Kate was scheduled to visit a tennis club on the same day Pa was doing an engagement. Wills told me that both he and Kate felt trapped, and unfairly persecuted, by the press and by Pa and Camilla.” RELATED:Surprising Signs You’ve Already Had COVID 10“He Had Experienced That Before” **10“He Had Experienced That Before”** **10“He Had Experienced That Before”** Harry added that the reality was that his father, having dealt with his mother Diana, could not again face “a novel and resplendent” royal who would steal the limelight away from him and his wife and “dominate the monarchy” he wrote. “He had experienced that before, and he had no interest in letting it happen to him again,” he wrote. King Charles’ Paintings Have Increased By Up To 100 Percent in Price: “One of Britain’s Top Watercolorists”Over the past few years, his paintings have majorly gone up in price.February 11, 2023 **King Charles’ Paintings Have Increased By Up To 100 Percent in Price: “One of Britain’s Top Watercolorists”** **King Charles’ Paintings Have Increased By Up To 100 Percent in Price: “One of Britain’s Top Watercolorists”** King Charles Suffers Embarrassing Wardrobe Malfunction on Official VisitFaux pax in a Mosque.February 12, 2023 **King Charles Suffers Embarrassing Wardrobe Malfunction on Official Visit** **King Charles Suffers Embarrassing Wardrobe Malfunction on Official Visit** King Charles’s Coronation: 5 Most Controversial QuestionsThere are a few questions that people have been asking about the big ceremony.February 15, 2023 **King Charles’s Coronation: 5 Most Controversial Questions** **King Charles’s Coronation: 5 Most Controversial Questions** HappyThe Top 7 Most Peaceful Places to Retire in the U.S.These places are ideal for seniors. **The Top 7 Most Peaceful Places to Retire in the U.S.** These places are ideal for seniors. **The Top 7 Most Peaceful Places to Retire in the U.S.** These places are ideal for seniors. NostalgiaDo You Know These Iconic 80s Movie Quotes?These were some of the best movies ever made. **Do You Know These Iconic 80s Movie Quotes?** These were some of the best movies ever made. **Do You Know These Iconic 80s Movie Quotes?** These were some of the best movies ever made. EtiquetteCommon Social Etiquette Mistakes Seniors Make UnknowinglyDon’t slip into these bad habits. **Common Social Etiquette Mistakes Seniors Make Unknowingly** Don’t slip into these bad habits. **Common Social Etiquette Mistakes Seniors Make Unknowingly** Don’t slip into these bad habits. NostalgiaCan You Guess the State from Its Most Famous Landmark?Let’s see how much attention you were paying in school. **Can You Guess the State from Its Most Famous Landmark?** Let’s see how much attention you were paying in school. **Can You Guess the State from Its Most Famous Landmark?** Let’s see how much attention you were paying in school. HealthDaily Habits for a Stronger Immune SystemProtect your health and wellness with these tips. **Daily Habits for a Stronger Immune System** Protect your health and wellness with these tips. **Daily Habits for a Stronger Immune System** Protect your health and wellness with these tips. Etiquette7 Timeless Fashion Staples for Women Over 50These clothes will make your style effortless. **7 Timeless Fashion Staples for Women Over 50** These clothes will make your style effortless. **7 Timeless Fashion Staples for Women Over 50** These clothes will make your style effortless. King Charles’ Paintings Have Increased By Up To 100 Percent in Price: “One of Britain’s Top Watercolorists”Over the past few years, his paintings have majorly gone up in price.February 11, 2023 **King Charles’ Paintings Have Increased By Up To 100 Percent in Price: “One of Britain’s Top Watercolorists”** **King Charles’ Paintings Have Increased By Up To 100 Percent in Price: “One of Britain’s Top Watercolorists”** King Charles Suffers Embarrassing Wardrobe Malfunction on Official VisitFaux pax in a Mosque.February 12, 2023 **King Charles Suffers Embarrassing Wardrobe Malfunction on Official Visit** **King Charles Suffers Embarrassing Wardrobe Malfunction on Official Visit** King Charles’s Coronation: 5 Most Controversial QuestionsThere are a few questions that people have been asking about the big ceremony.February 15, 2023 **King Charles’s Coronation: 5 Most Controversial Questions** **King Charles’s Coronation: 5 Most Controversial Questions** **Footer menu:** About Us Sitemap Privacy Policy Terms and Conditions Contact Us Copyright 2025Galvanized Media. All Rights Reserved. Newsful is part of the Dotdash Meredith Publishing Family."}