{"id": 1962, "name": "Factly", "domain": "factly.in", "bias": "center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://factly.in/this-viral-video-does-not-show-members-of-a-hindu-organisation-making-objectionable-gestures-at-kangana-ranaut-during-an-event-the-video-is-from-pakistan/#respond", "title": "This Viral Video Does Not Show Members Of A Hindu Organisation Making Objectionable Gestures At Kangana Ranaut During An Event The Video Is From Pakistan", "content": "Facebook Twitter Youtube Instagram Subscribe StoriesIndiaInfographicsPoliticsFact CheckElectionsBusinessCrimeLifeFeaturedReview: Kolkata HC Rules that Injury is not Essential to Prove Negligence in Dog Attack CaseByPavithra K MJune 11, 20250RecentReview: Kolkata HC Rules that Injury is not Essential to Prove Negligence in Dog Attack CaseJune 11, 20250Data: Outstanding Liabilities of Government of India Increased by Over 13 Times Since the year 2000, in line With Growth in ReceiptsJune 10, 20250Review: More Than 40% of Surveyed Enterprises Have Not Reported CAPEX Plans for 2025-26June 9, 20250 India Infographics Politics Fact Check Elections Business Crime Life **Review: Kolkata HC Rules that Injury is not Essential to Prove Negligence in Dog Attack Case** India Infographics Politics Fact Check Elections Business Crime Life **Review: Kolkata HC Rules that Injury is not Essential to Prove Negligence in Dog Attack Case** Elections Fact ChecksEnglishTeluguCoronavirusOthers English Telugu Coronavirus Others English Telugu Coronavirus Others Videos Data ToolsData DashboardsCounting India Data Dashboards Counting India Data Dashboards Counting India About UsOur StoryTeamFact CheckingFact Check MethodologyFact-Check TeamNon-partisanship PolicyCorrections PolicyPolicy regarding Trauma or Harassment faced by StaffFAQ’sContact UsSubscribeCareersCompliance of IT Rules 2021Privacy Policy Our Story Team Fact CheckingFact Check MethodologyFact-Check TeamNon-partisanship PolicyCorrections PolicyPolicy regarding Trauma or Harassment faced by Staff Fact Check Methodology Fact-Check Team Non-partisanship Policy Corrections Policy Policy regarding Trauma or Harassment faced by Staff FAQ’s Contact Us Subscribe Careers Compliance of IT Rules 2021 Privacy Policy Our Story Team Fact CheckingFact Check MethodologyFact-Check TeamNon-partisanship PolicyCorrections PolicyPolicy regarding Trauma or Harassment faced by Staff Fact Check Methodology Fact-Check Team Non-partisanship Policy Corrections Policy Policy regarding Trauma or Harassment faced by Staff Fact Check Methodology Fact-Check Team Non-partisanship Policy Corrections Policy Policy regarding Trauma or Harassment faced by Staff FAQ’s Contact Us Subscribe Careers Compliance of IT Rules 2021 Privacy Policy GOVT. DATA ROUNDUP **This viral video does not show members of a Hindu organisation making objectionable gestures at Kangana Ranaut during an event; the video is from Pakistan** AAA A video from an event showing a large crowd and a woman standing on stage with a microphone is going viral on social media (here,here, andhere). In the video, some individuals in the audience can be seen making objectionable gestures, including showing the middle finger towards the woman on stage. The video is being shared with the claim that the woman is Bollywood actress Kangana Ranaut, who was allegedly trolled by members of a Hindu organisation during the event. Let’s verify the truth behind the video in this article. Claim:The video shows members of a Hindu organisation making objectionable gestures, including showing the middle finger, towards Bollywood actress and BJP MP Kangana Ranaut during an event. Fact:The video is from the ‘Pak Wheels’ event in Pakistan, featuring host Farah Hashmi. There are no credible reports of members of Hindu organisations making objectionable gestures towards Kangana Ranaut at any event. The video has no connection to Kangana Ranaut or India. Hence, the claim made in the post isFALSE. Upon closely examining the viral video, we noticed the name “Q-High Street” in the background. A Google searchrevealedthat Q-High Street is a commercial real estate company based in Pakistan. We found the officialInstagram page of Q-High Street, where a post mentions that an automotiveeventcalled ‘Pak Wheels’ was held at the venue on 25 May. The page has shared several photos from the event. The stage decorations and the text displayed on the screen in those images match exactly with what is seen in the viral video (hereandhere). We also found several YouTube videos from the event (hereandhere). These show that various vehicles were showcased during the auto show, followed by a concert. In one video, the same woman from the viral clip is seen onstage, appearing to host the event. Even in this footage, some people are seenmaking objectionable gestures, including showing her the middle finger. We found that the woman on stage is identified as Farah Hashmi. Her Instagram account features aposterof the ‘Pak Wheels’ event held on 25 May 2025, which also includes her photo. Farah’s Instagram storyhighlightsalso include a video from the event. Her outfit and the stage setup match the viral video, confirming that she is the same woman seen in the clip. We did not find any credible reports of members of a Hindu organisation making objectionable gestures, such as showing the middle finger, towards Bollywood actress and BJP MP Kangana Ranaut during any event. While we could not find any news reports specifically addressing that clip, the available evidence suggests that the video has no connection to Kangana Ranaut or India. To sum up, this viral video does not show members of a Hindu organisation making objectionable gestures at Kangana Ranaut during an event; the video is from Pakistan. **About Author** **RelatedPosts** Comments are closed. RECENT POSTSReview: Kolkata HC Rules that Injury is not Essential to Prove Negligence in Dog Attack CaseJune 11, 20250Data: Outstanding Liabilities of Government of India Increased by Over 13 Times Since the year 2000, in line With Growth in ReceiptsJune 10, 20250Review: More Than 40% of Surveyed Enterprises Have Not Reported CAPEX Plans for 2025-26June 9, 20250Data: Despite Progress, MMR in Many Large States Far Above the National Average & SDG TargetJune 6, 20250Review: SC Rules That Mere Scolding of a Student Does Not Constitute Abetment of SuicideJune 4, 20250Review: NITI Aayog’s Latest Report Sheds Light on Issues Plaguing Medium EnterprisesJune 3, 20250Data: Average Monthly SIP Contribution Increased More Than Sixfold Between 2016-17 and 2024-25June 2, 20250Data: In the 2011 to 2021 Period, 16 of the 22 Major States Recorded Highest Ever Death Rate in 2021May 30, 20250Review: Rajasthan HC Rules That Denying Education on the Basis of Health Concerns, Arising Due to Menstruation, is UnacceptableMay 28, 20250Data: Uttar Pradesh, Madhya Pradesh & West Bengal Account for More Than 35% of the Complaints Made on the National Anti-Ragging PortalMay 27, 20250 **RECENT POSTS** Review: Kolkata HC Rules that Injury is not Essential to Prove Negligence in Dog Attack CaseJune 11, 20250 Data: Outstanding Liabilities of Government of India Increased by Over 13 Times Since the year 2000, in line With Growth in ReceiptsJune 10, 20250 Review: More Than 40% of Surveyed Enterprises Have Not Reported CAPEX Plans for 2025-26June 9, 20250 Data: Despite Progress, MMR in Many Large States Far Above the National Average & SDG TargetJune 6, 20250 Review: SC Rules That Mere Scolding of a Student Does Not Constitute Abetment of SuicideJune 4, 20250 Review: NITI Aayog’s Latest Report Sheds Light on Issues Plaguing Medium EnterprisesJune 3, 20250 Data: Average Monthly SIP Contribution Increased More Than Sixfold Between 2016-17 and 2024-25June 2, 20250 Data: In the 2011 to 2021 Period, 16 of the 22 Major States Recorded Highest Ever Death Rate in 2021May 30, 20250 Review: Rajasthan HC Rules That Denying Education on the Basis of Health Concerns, Arising Due to Menstruation, is UnacceptableMay 28, 20250 Data: Uttar Pradesh, Madhya Pradesh & West Bengal Account for More Than 35% of the Complaints Made on the National Anti-Ragging PortalMay 27, 20250 **RECENT POSTS** Review: Kolkata HC Rules that Injury is not Essential to Prove Negligence in Dog Attack CaseJune 11, 20250 Data: Outstanding Liabilities of Government of India Increased by Over 13 Times Since the year 2000, in line With Growth in ReceiptsJune 10, 20250 Review: More Than 40% of Surveyed Enterprises Have Not Reported CAPEX Plans for 2025-26June 9, 20250 Data: Despite Progress, MMR in Many Large States Far Above the National Average & SDG TargetJune 6, 20250 Review: SC Rules That Mere Scolding of a Student Does Not Constitute Abetment of SuicideJune 4, 20250 Review: NITI Aayog’s Latest Report Sheds Light on Issues Plaguing Medium EnterprisesJune 3, 20250 Data: Average Monthly SIP Contribution Increased More Than Sixfold Between 2016-17 and 2024-25June 2, 20250 Data: In the 2011 to 2021 Period, 16 of the 22 Major States Recorded Highest Ever Death Rate in 2021May 30, 20250 Review: Rajasthan HC Rules That Denying Education on the Basis of Health Concerns, Arising Due to Menstruation, is UnacceptableMay 28, 20250 Data: Uttar Pradesh, Madhya Pradesh & West Bengal Account for More Than 35% of the Complaints Made on the National Anti-Ragging PortalMay 27, 20250 About FactlyFACTLY is one of the well known Data Journalism/Public Information portals in India. Each news story on FACTLY is backed by factual evidence/data from official sources that is either available in the public domain or that is collated/gathered/collected using tools such as the Right to Information (RTI). **About Factly** FACTLY is one of the well known Data Journalism/Public Information portals in India. Each news story on FACTLY is backed by factual evidence/data from official sources that is either available in the public domain or that is collated/gathered/collected using tools such as the Right to Information (RTI). **About Factly** FACTLY is one of the well known Data Journalism/Public Information portals in India. Each news story on FACTLY is backed by factual evidence/data from official sources that is either available in the public domain or that is collated/gathered/collected using tools such as the Right to Information (RTI). Subscribe to our Newsletter **Subscribe to our Newsletter** **Subscribe to our Newsletter**"}