{"id": 1570, "name": "WFAA - Dallas News", "domain": "wfaa.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wfaa.com/article/syndication/smart-deals/stackcommerce/excel-at-work-by-supercharging-your-pc-with-microsoft-office-and-windows-11-pro-for-less-than-50/608-b76cb1ea-0466-4725-96a8-68d1a63082eb", "title": "Excel At Work By Supercharging Your Pc With Microsoft Office And Windows 11 Pro For Less Than 50", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalFTWtodayTexasDALtodayNation WorldPoliticsNear MeMoneyInvestigationsWFAA OriginalsGood Morning TexasNoticiasLatest News StoriesCoca-Cola Southwest signs on as Dallas' first World Cup sponsorStrikes, smiles, and a sweet heart: Wednesday's Child 9-year-old Zachary will melt your heart!'He just needs to be loved.' | Wednesday's Child 9-year-old Zachary seeks loving parents, forever home Back Local FTWtoday Texas DALtoday Nation World Politics Near Me Money Investigations WFAA Originals Good Morning Texas Noticias Coca-Cola Southwest signs on as Dallas' first World Cup sponsor Strikes, smiles, and a sweet heart: Wednesday's Child 9-year-old Zachary will melt your heart!'He just needs to be loved.' | Wednesday's Child 9-year-old Zachary seeks loving parents, forever home Back Local FTWtoday Texas DALtoday Nation World Politics Near Me Money Investigations WFAA Originals Good Morning Texas Noticias Coca-Cola Southwest signs on as Dallas' first World Cup sponsor Strikes, smiles, and a sweet heart: Wednesday's Child 9-year-old Zachary will melt your heart!'He just needs to be loved.' | Wednesday's Child 9-year-old Zachary seeks loving parents, forever home WeatherBackForecastRadarClosings & DelaysSchool/Business LoginWeathermindsTrafficGas PricesLatest Weather StoriesDFW Weather: More storms in the forecast for North Texas this weekWFAA Weather Alert Day: Heavy rains to impact North Texas this week Back Forecast Radar Closings & Delays School/Business Login Weatherminds Traffic Gas Prices DFW Weather: More storms in the forecast for North Texas this week WFAA Weather Alert Day: Heavy rains to impact North Texas this week Back Forecast Radar Closings & Delays School/Business Login Weatherminds Traffic Gas Prices DFW Weather: More storms in the forecast for North Texas this week WFAA Weather Alert Day: Heavy rains to impact North Texas this week SportsBackHigh School SportsCowboysMavericksRangersStarsTCUSMUFC DallasLonghornsWingsScholar AthleteLocked On Podcast NetworkLatest StoriesCoca-Cola Southwest signs on as Dallas' first World Cup sponsorFemale athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law Back High School Sports Cowboys Mavericks Rangers Stars TCU SMU FC Dallas Longhorns Wings Scholar Athlete Locked On Podcast Network Coca-Cola Southwest signs on as Dallas' first World Cup sponsor Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law Back High School Sports Cowboys Mavericks Rangers Stars TCU SMU FC Dallas Longhorns Wings Scholar Athlete Locked On Podcast Network Coca-Cola Southwest signs on as Dallas' first World Cup sponsor Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law SearchSearch:Search Advertise With Us Radar Sports Noticias Contests Inside Texas Politics Vote Now Right on the Money La Vida Rescan Your TV Israel-Hamas War At the Border Wednesday's Child Reasons to Smile Family First TV Listings **'Excel' at work by supercharging your PC with Microsoft Office and Windows 11 Pro for less than $50** Credit: Microsoft This station earns commissions on purchases made through the link(s) on this page. TL;DR:Supercharge your PC with this 2-for-1 dealfor Microsoft Office 2019 and Windows 11 Pro, now over 80% off. Be honest with us. When was the last time you gave your PC an upgrade? If you can’t remember, your device is definitely due for a performance and productivity upgrade. You’ve waited long enough, and luckily, the best PC upgrade has just arrived—you can getWindows 11 Pro and Microsoft Office 2019for only $45.97 (reg. $428) for life. With the latest OS, you might just make your PC feel like new again, thanks to the sleek and redesigned UI for easy navigation, improved voice typing feature, and innovative security measures like BitLocker device encryption and Smart App Control. The best part? You’ll even score Copilot, Windows 11 Pro’s newintelligent AI assistant that’s powered by GPT-4 Turbo(which could also streamline your day. And don’t forget—you’re also getting Microsoft Office 2019, meaning you’ll have lifelong access to classic Microsoft apps like Word, Excel, PowerPoint, Outlook, OneNote, Publisher, and Access. You might just check off your work (or personal) to-do list even faster with these productivity tools at your side. Ready to upgrade your PC with the best 2-for-1 Microsoft deal? Grablifetime licenses to Windows 11 Pro and Microsoft Office 2019for just $45.97 while downloads are still available. This offer only lasts a little while longer. The All-in-One Microsoft Office Pro 2019 for Windows: Lifetime License + Windows 11 Pro Bundle See Deal StackSocialprices subject to change. StackSocialworks with a variety of merchants and brands to bring you deals worth talking about. We partner with affiliates to bring exclusive and lifetime offers to readers worldwide, helping consumers discover over five million products and counting. **** To stream WFAA on your phone, you need the WFAA app. **** **Download the WFAA app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video In Other News **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}