{"id": 1256, "name": "Shorenstein Center", "domain": "shorensteincenter.org", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://shorensteincenter.org/mina-hsiang-former-administrator-united-states-digital-service-usds-joins-shorenstein-center-fellow/", "title": "Mina Hsiang Former Administrator United States Digital Service Usds Joins Shorenstein Center Fellow", "content": "AboutAdvisory BoardFaculty and StaffCurrent FellowsJobsStudent OpportunitiesCoursesInternshipsResearch AssistantsStudent Funding RequestsDiversity, Inclusion and BelongingContact Us Advisory Board Faculty and Staff Current Fellows Jobs Student OpportunitiesCoursesInternshipsResearch AssistantsStudent Funding Requests Courses Internships Research Assistants Student Funding Requests Diversity, Inclusion and Belonging Contact Us Advisory Board Faculty and Staff Current Fellows Jobs Student OpportunitiesCoursesInternshipsResearch AssistantsStudent Funding Requests Courses Internships Research Assistants Student Funding Requests Courses Internships Research Assistants Student Funding Requests Diversity, Inclusion and Belonging Contact Us ProgramsBehavioral Insights GroupCHIP50Documentary Film in the Public InterestThe Journalist’s ResourceHKS Misinformation ReviewPublic Interest Tech LabStudent Media InitiativeFellowshipsFormer FellowsApply to be a FellowPrizes & LecturesGoldsmith Awards ProgramNyhan PrizeTheodore H. White LectureSalant Lecture Behavioral Insights Group CHIP50 Documentary Film in the Public Interest The Journalist’s Resource HKS Misinformation Review Public Interest Tech Lab Student Media Initiative FellowshipsFormer FellowsApply to be a Fellow Former Fellows Apply to be a Fellow Prizes & LecturesGoldsmith Awards ProgramNyhan PrizeTheodore H. White LectureSalant Lecture Goldsmith Awards Program Nyhan Prize Theodore H. White Lecture Salant Lecture Behavioral Insights Group CHIP50 Documentary Film in the Public Interest The Journalist’s Resource HKS Misinformation Review Public Interest Tech Lab Student Media Initiative FellowshipsFormer FellowsApply to be a Fellow Former Fellows Apply to be a Fellow Former Fellows Apply to be a Fellow Prizes & LecturesGoldsmith Awards ProgramNyhan PrizeTheodore H. White LectureSalant Lecture Goldsmith Awards Program Nyhan Prize Theodore H. White Lecture Salant Lecture Goldsmith Awards Program Nyhan Prize Theodore H. White Lecture Salant Lecture News & EventsNewsEventsUpcoming EventsEvent Recordings News EventsUpcoming EventsEvent Recordings Upcoming Events Event Recordings News EventsUpcoming EventsEvent Recordings Upcoming Events Event Recordings Upcoming Events Event Recordings PublicationsFaculty ResearchDiscussion PapersExpert CommentaryUnlocked: How Government Works Faculty Research Discussion Papers Expert Commentary Unlocked: How Government Works Faculty Research Discussion Papers Expert Commentary Unlocked: How Government Works Donate AboutAdvisory BoardFaculty and StaffCurrent FellowsJobsStudent OpportunitiesCoursesInternshipsResearch AssistantsStudent Funding RequestsDiversity, Inclusion and BelongingContact Us Advisory Board Faculty and Staff Current Fellows Jobs Student OpportunitiesCoursesInternshipsResearch AssistantsStudent Funding Requests Courses Internships Research Assistants Student Funding Requests Diversity, Inclusion and Belonging Contact Us Advisory Board Faculty and Staff Current Fellows Jobs Student OpportunitiesCoursesInternshipsResearch AssistantsStudent Funding Requests Courses Internships Research Assistants Student Funding Requests Courses Internships Research Assistants Student Funding Requests Diversity, Inclusion and Belonging Contact Us ProgramsBehavioral Insights GroupCHIP50Documentary Film in the Public InterestThe Journalist’s ResourceHKS Misinformation ReviewPublic Interest Tech LabStudent Media InitiativeFellowshipsFormer FellowsApply to be a FellowPrizes & LecturesGoldsmith Awards ProgramNyhan PrizeTheodore H. White LectureSalant Lecture Behavioral Insights Group CHIP50 Documentary Film in the Public Interest The Journalist’s Resource HKS Misinformation Review Public Interest Tech Lab Student Media Initiative FellowshipsFormer FellowsApply to be a Fellow Former Fellows Apply to be a Fellow Prizes & LecturesGoldsmith Awards ProgramNyhan PrizeTheodore H. White LectureSalant Lecture Goldsmith Awards Program Nyhan Prize Theodore H. White Lecture Salant Lecture Behavioral Insights Group CHIP50 Documentary Film in the Public Interest The Journalist’s Resource HKS Misinformation Review Public Interest Tech Lab Student Media Initiative FellowshipsFormer FellowsApply to be a Fellow Former Fellows Apply to be a Fellow Former Fellows Apply to be a Fellow Prizes & LecturesGoldsmith Awards ProgramNyhan PrizeTheodore H. White LectureSalant Lecture Goldsmith Awards Program Nyhan Prize Theodore H. White Lecture Salant Lecture Goldsmith Awards Program Nyhan Prize Theodore H. White Lecture Salant Lecture News & EventsNewsEventsUpcoming EventsEvent Recordings News EventsUpcoming EventsEvent Recordings Upcoming Events Event Recordings News EventsUpcoming EventsEvent Recordings Upcoming Events Event Recordings Upcoming Events Event Recordings PublicationsFaculty ResearchDiscussion PapersExpert CommentaryUnlocked: How Government Works Faculty Research Discussion Papers Expert Commentary Unlocked: How Government Works Faculty Research Discussion Papers Expert Commentary Unlocked: How Government Works Donate **News & Events** Upcoming Events Past Event Recordings News Upcoming Events Past Event Recordings News Center News,News **Mina Hsiang, former Administrator of the United States Digital Service (USDS), Joins Shorenstein Center as a fellow** April 22, 2025 The Shorenstein Center on Media, Politics and Public Policy at Harvard Kennedy School announces Mina Hsiang as its newest fellow. Hsiang, the most recent Administrator of the United States Digital Service (USDS), led the organization through unprecedented growth – improving critical services and technological advances across more than two dozen agencies. During her tenure, USDS improved access to social security, simplified support for veterans’ care and benefits, and launched the firstfree government tax filing toolfor 30 million Americans. During that time her team was estimated to have saved tens of billions of dollars and helped agencies shift toward long term strategic investments to dramatically improve their technology capabilities with higher user satisfaction, higher security, and at lower cost. Hsiang’s tenure at USDS spanned three administrations and included leading transformational teams at the VA, the DOD, HHS, and the White House, staffed by top tier talent recruited directly from the private sector into public service. Before her public service, Hsiang was VP of Technology Products and Policy at Devoted Health, driving its growth into a 700+ employee multibillion dollar firm. She was the VP of new product development for Optum’s analytics division, and prior to that was a venture investor and advisor across the healthcare and large-scale data system sectors, contributing to her robust background in both public and private sectors. Hsiang, who has a bachelor’s and master’s in electrical and biomedical engineering from MIT and an MBA from Harvard Business School, will research how government capabilities, services, and public servants are communicated with the American public. She’ll also be involved in the Shorenstein Center’s new Unlocked series and research programs. The Shorenstein Center on Media, Politics and Public Policy is aHarvard Kennedy Schoolresearch center dedicated to exploring and illuminating the intersection of press, politics and public policy in theory and practice. The Center strives to bridge the gap between journalists and scholars, and between them and the public. **Follow us** ABOUT|CONTACT US|PRIVACY|ACCESSIBILITY|WEB ACCESSIBILITY Unless otherwise noted this site and its contents are licensed under aCreative Commons Attribution-NonCommercial-ShareAlike 4.0 Internationallicense."}