{"id": 456, "name": "The Forward", "domain": "forward.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://forward.com/forward-newsletters/antisemitism-decoded/721972/six-categories-of-jewish-students-fill-in-the-missing-middle-pieces-of-campus-antisemitism-puzzle/", "title": "Six Categories Of Jewish Students Fill In The Missing Middle Pieces Of Campus Antisemitism Puzzle", "content": "Attack in Boulder Campus Israel Republish our articles פֿאָרווערטס Newsletters Events Podcasts News Culture Food Israel Opinion Yiddish Archive Support Our Work Learn more ways to give About Jobs Help Contact Us Store Facebook Twitter Instagram YouTube Attack in Boulder Campus Israel Republish our articles פֿאָרווערטס **Six categories of Jewish students fill in the ‘missing middle’ pieces of campus antisemitism puzzle** **A new Brandeis study identifies a missing middle of Jewish students who have been overlooked** Copy to clipboard Share on Facebook Share on X Share on Bluesky Share on Reddit Share on Email Print Article Republish Article Students and visitors make their way on the UCLA campus in August.Photo by Getty Images ByArno RosenfeldMay 21, 2025 Antisemitism Decoded is the Forward’s biweekly newsletter that helps you separate the signal from the noise and understand current debates over Jewish safety.Sign-up here. People steeped in the campus turmoil since Oct. 7 understand that there are at least two categories of Jewish students: The majority, who hold some attachment to Israel and were disturbed by the protests against it, and the minority who have participated in those protests. But where would you place Bella, a pseudonymous Jewish student, at a California university with a reputation for antisemitism? She’s proud to be Jewish but never had much connection to Israel. That made her feel guilty after Oct. 7. But learning more about the conflict left her hopeless. “Before, when I knew nothing, ignorance was kind of nice,” she said. Her roommate started sharing offensive posts about Jews and Israel on social media after the war began, so Bella quietly arranged for new housing the following semester. Yet she couldn’t say whether anti-Zionism, and the protests more generally, were antisemitic. **Antisemitism Decoded** Arno Rosenfeld helps you understand current debates over Jewish safety. Or Shira, a student in Wisconsin who grew up in an observant Conservative and Zionist home but grew disillusioned with Israel during agap year programin the country where she met with Palestinians. “I’m not a Zionist because it doesn’t capture enough,” she said, despite still believing “in Jewish autonomy, in some way.” Shira tried to go to an IfNotNow protest against the war, but was turned off by the signs and slogans and found herself sitting on the sidelines. She still attends Shabbat dinner at the Chabad on campus but walks away from the rabbi when he mentions support for Israel. *** Shira and Bella are two of the 36 Jewish students profiled anonymously in a new paper from Brandeis University that sought to break through the most common binaries — pro-Israel and anti-Israel. “There’s a vast number of people on college campuses that wouldn’t be comfortable with either of those labels,” said Jonathan Krasner, who produced the study. “We wanted to understand where those people were coming from.” Krasner and his research team found six distinct categories of Jewish students they describe this way: The Affirmed:Students whose pro-Israel activism and connection to Jewish identity deepened after Oct. 7 The Aggrieved:Activist students who felt betrayed by Jewish institutions The Retrenched:Students who retreated into private Jewish spaces for safety and support The Conflicted:Students grappling with the moral and political complexities of the Israeli-Palestinian conflict The Disillusioned:Students let down by Jewish and Israeli institutions, fostering skepticism and distrust but not action The Disengaged:Students who distanced themselves from both Jewish and campus political discourse, often due to a desire to avoid conflict Mapped onto a very rough political spectrum, these categories might look something like this. We probably hear the most from “affirmed” students, with many —Shabbos Kestenbaum,Eyal YakobyandEden Yadegar— becoming national spokespeople for embattled Jews on campus, especially those who fall into the “retrenched” category. The “aggrieved,” often represented by members of Jewish Voice for Peace, have also received a platform. But there’s a great missing middle in the discourse created by the absence, in the Brandeis study’s terms, of the “disillusioned,” “conflicted” and “disengaged.” *** The category of Jewish students most concerned about antisemitism was, notably, not the “affirmed” — vocal pro-Israel students who are often the most direct targets for harassment by campus protesters — but rather the “retrenched,” who observed anti-Zionism with alarm but desperately sought to avoid conflict and turned toward Jewish spaces on campus. Keren, who grew up in an affluent Jewish neighborhood on the East Coast, stopped wearing her Star of David necklace, hid other Jewish jewelry even from her roommate and avoided talking about the war in Gaza with other students. “I don’t want to risk my relationships,” she explained. But, at the same time, she said: “I’m pretty sure that most people I interact with hold antisemitic views.” *** That missing middle of Jewish students that we tend to hear the least about — the “conflicted,” “disengaged” and “disillusioned” — could represent half of all Jews on campus, and they need support too. You can see their voices reflected in documents like the Harvard task force report I wrote about in thelast editionof this newsletter, and my bet is that they see little benefit from the most aggressive approaches to tamping down campus activism that may appeal to the “retrenched” and “affirmed.” Instead, it may be the softer recommendations for improving the campus climate — like recruiting students interested in “open inquiry and mutual respect,” as the Harvard report suggested — that may help reduce polarization, and make the students who have stayed away from Jewish institutions at their schools and avoided conversations about Israel feel more comfortable participating. 📚 GO DEEPER Between Home and Homeland: Jewish College Students Confront the Israel-Gaza Conflict and Campus Divides(Journal of Jewish Education) A Venn diagram to help us talk about Israel and antisemitism(Forward) Arno Rosenfeld is an investigative reporter at theForwardcovering antisemitism, philanthropy and sexual misconduct. He is author of theAntisemitism Decodednewsletter. You can reach him by email or message him securely on Signal using a non-work device at 202-677-5462.[email protected]arnorosenfeld.bsky.social Arno Rosenfeld is an investigative reporter at theForwardcovering antisemitism, philanthropy and sexual misconduct. He is author of theAntisemitism Decodednewsletter. You can reach him by email or message him securely on Signal using a non-work device at 202-677-5462. [email protected] arnorosenfeld.bsky.social Arno Rosenfeld is an investigative reporter at theForwardcovering antisemitism, philanthropy and sexual misconduct. He is author of theAntisemitism Decodednewsletter. You can reach him by email or message him securely on Signal using a non-work device at 202-677-5462. [email protected] arnorosenfeld.bsky.social **NEW newsletter** Antisemitism Decoded Arno Rosenfeld helps you understand current debates over Jewish safety. **FASTFORWARD** **Outrage ensues after a Long Island high school study guide calls Zionism ‘extreme nationalism’** **Outrage ensues after a Long Island high school study guide calls Zionism ‘extreme nationalism’** **Arizona governor vetoes bill that would let parents sue teachers over antisemitism** **Arizona governor vetoes bill that would let parents sue teachers over antisemitism** **Another Irish band airs pro-Palestinian message at festival: ‘Israel is committing genocide’** **Another Irish band airs pro-Palestinian message at festival: ‘Israel is committing genocide’** **Shop the Forward Store** 100% of profits support our journalism Our founder, Ab Cahan Our founder, Ab Cahan 1960s Yiddish hipi hoodie 1960s Yiddish hipi hoodie It's spelled Khanike tee It's spelled Khanike tee The Forverts est. 1897 hoodie The Forverts est. 1897 hoodie **Dive In** Antisemitism Brandeis University Campus Antisemitism DecodedWhat happens when you dehumanize ‘Zionists’By Arno Rosenfeld4min read **What happens when you dehumanize ‘Zionists’** **What happens when you dehumanize ‘Zionists’** **What happens when you dehumanize ‘Zionists’** Antisemitism DecodedWhat do we really mean by ‘campus antisemitism’? Harvard explainsBy Arno Rosenfeld4min read **What do we really mean by ‘campus antisemitism’? Harvard explains** **What do we really mean by ‘campus antisemitism’? Harvard explains** **What do we really mean by ‘campus antisemitism’? Harvard explains** Antisemitism DecodedThis obscure rule explains Biden’s approach to antisemitismBy Arno Rosenfeld3min read **This obscure rule explains Biden’s approach to antisemitism** **This obscure rule explains Biden’s approach to antisemitism** **This obscure rule explains Biden’s approach to antisemitism** Antisemitism DecodedShadowy GOP firm is behind pressure campaign on Schumer over antisemitism billBy Arno Rosenfeld3min read **Shadowy GOP firm is behind pressure campaign on Schumer over antisemitism bill** **Shadowy GOP firm is behind pressure campaign on Schumer over antisemitism bill** **Shadowy GOP firm is behind pressure campaign on Schumer over antisemitism bill** **Most Popular** 1NewsExclusive: ADL chief compares student protesters to ISIS and al-Qaida in address to Republican officialsBy Arno Rosenfeld and Jacob Kornbluh4min read **Exclusive: ADL chief compares student protesters to ISIS and al-Qaida in address to Republican officials** **Exclusive: ADL chief compares student protesters to ISIS and al-Qaida in address to Republican officials** **Exclusive: ADL chief compares student protesters to ISIS and al-Qaida in address to Republican officials** 2NewsA Jewish farmer drove 600 miles to rescue a century-old synagogue. Now he’s building a new one in a cornfield.By Benyamin Cohen14min read **A Jewish farmer drove 600 miles to rescue a century-old synagogue. Now he’s building a new one in a cornfield.** **A Jewish farmer drove 600 miles to rescue a century-old synagogue. Now he’s building a new one in a cornfield.** **A Jewish farmer drove 600 miles to rescue a century-old synagogue. Now he’s building a new one in a cornfield.** 3OpinionPete Hegseth is targeting a Jewish American hero — who’s next?By Benjamin Ivry5min read **Pete Hegseth is targeting a Jewish American hero — who’s next?** **Pete Hegseth is targeting a Jewish American hero — who’s next?** **Pete Hegseth is targeting a Jewish American hero — who’s next?** 4OpinionGreta Thunberg’s Gaza flotilla was never going to help PalestiniansBy Nora Berman4min read **Greta Thunberg’s Gaza flotilla was never going to help Palestinians** **Greta Thunberg’s Gaza flotilla was never going to help Palestinians** **Greta Thunberg’s Gaza flotilla was never going to help Palestinians** **In Case You Missed It** Fast ForwardOutrage ensues after a Long Island high school study guide calls Zionism ‘extreme nationalism’By Hannah Feuer2min read **Outrage ensues after a Long Island high school study guide calls Zionism ‘extreme nationalism’** **Outrage ensues after a Long Island high school study guide calls Zionism ‘extreme nationalism’** **Outrage ensues after a Long Island high school study guide calls Zionism ‘extreme nationalism’** CultureTravels to ‘the sixth borough’ — a brief history of New York City mayors visiting IsraelBy Clara Shapiro6min read **Travels to ‘the sixth borough’ — a brief history of New York City mayors visiting Israel** **Travels to ‘the sixth borough’ — a brief history of New York City mayors visiting Israel** **Travels to ‘the sixth borough’ — a brief history of New York City mayors visiting Israel** OpinionA Trumpian parade with soldiers, jets and military vehicles? No tanks.By Robert Zaretsky4min read **A Trumpian parade with soldiers, jets and military vehicles? No tanks.** **A Trumpian parade with soldiers, jets and military vehicles? No tanks.** **A Trumpian parade with soldiers, jets and military vehicles? No tanks.** News‘Rabbi to watch’ Sandra Lawson turns DEI focus to North CarolinaBy Robin Washington3min read **‘Rabbi to watch’ Sandra Lawson turns DEI focus to North Carolina** **‘Rabbi to watch’ Sandra Lawson turns DEI focus to North Carolina** **‘Rabbi to watch’ Sandra Lawson turns DEI focus to North Carolina** **** **** **** Shop the Forward Store100% of profits support our journalismAccessoryOur founder, Ab CahanTote bagApparel1960s Yiddish hipi hoodiePremium pullover hoodieApparelIt's spelled Khanike teePremium teeApparelThe Forverts est. 1897 hoodieWomen's premium hoodie **Shop the Forward Store** 100% of profits support our journalism Our founder, Ab Cahan 1960s Yiddish hipi hoodie It's spelled Khanike tee The Forverts est. 1897 hoodie **Shop the Forward Store** 100% of profits support our journalism Our founder, Ab Cahan Our founder, Ab Cahan 1960s Yiddish hipi hoodie 1960s Yiddish hipi hoodie It's spelled Khanike tee It's spelled Khanike tee The Forverts est. 1897 hoodie The Forverts est. 1897 hoodie 3m READ Dive In Explore Share on Facebook Share on X Republish Article **Republish This Story** Please read before republishing We’re happy to make this story available to republish for free, unless it originated with JTA, Haaretz or another publication (as indicated on the article) and as long as you followour guidelines.You must comply with the following: Credit the Forward Retain our pixel Preserve our canonical link in Google search Add a noindex tag in Google search See ourfull guidelinesfor more information, andthis guidefor detail about canonical URLs. To republish, copy the HTML by clicking on the yellow button to the right; it includes our tracking pixel, all paragraph styles and hyperlinks, the author byline and credit to the Forward. It does not include images; to avoid copyright violations, you must add them manually, followingour guidelines. Please email us at[email protected], subject line “republish,” with any questions or to let us know what stories you’re picking up. **Six categories of Jewish students fill in the ‘missing middle’ pieces of campus antisemitism puzzle** About Contact Us Help Jobs Membership Newsletters Republication Guidelines Store Advertise Facebook Twitter Instagram YouTube TheForwardis a 501(c)(3) non-profit organization. We have removed our paywall, making all our content free for the first time in our history.Become a member and support independent Jewish journalism. THE JEWISH DAILY FORWARD ℠ Copyright © 2025 The Forward Association, Inc. All rights reserved. Privacy Policy Terms & Conditions Support our work! We don't support Internet Explorer Please use Chrome, Safari, Firefox, or Edge to view this site."}