{"id": 28, "name": "ABC12/WJRT-TV", "domain": "abc12.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.abc12.com/community/making-strides-against-breast-cancer/article_b464b3d2-44c3-11ed-875f-cbc1b010c8dd.html", "title": "Making Strides Against Breast Cancer", "content": "Facebook Twitter YouTube Instagram Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Local Business Crime Education Health Politics Regional State National International Entertainment Lottery Flood Flint Water Emergency ABC12 Investigates Dam Recovery #OxfordStrong Storm Tracker 12 Weather Links Alerts Map Center School Closings Interactive Radar Submit A Closing Color The Weather Traffic Map Gas Gauge Athlete Of The Week Highlight Zone FanZone Contests Good Morning Mid Michigan Monday's Child Community Calendar Newsmakers Person of the Week Back To The Bricks Crim Festival of Races Diaper Drive Making Strides For Breast Cancer Wings Over Flint Toys for Tots On Demand TV Apps YouTube Recipes Cars The American Athlete Livestream TV Listings Local Now Submit Story Submit Photos Submit A Video Advertise With Us Our Apps Meet the Team Email Alerts Signal Problem? Careers Streaming For Success Site searchSearch Site searchSearch Site searchSearch 85° Search Search Search Open user controlsLog In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Facebook Twitter Instagram News Storm Tracker 12 Closings Sports Video Watch Diaper Drive Contact Careers Vote For Your Fave Best Dentists for Diapers Creation Download Now ABC12 News Mobile App Facebook Twitter WhatsApp SMS Email Print Copy article link Save Facebook Twitter WhatsApp SMS Email Print Copy article link Save Facebook Twitter WhatsApp SMS Email Print Copy article link Save **Making Strides Against Breast Cancer** Oct 5, 2022 Oct 5, 2022UpdatedOct 14, 2022 Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Copy article link Save **Making Strides is more than a walk. Join the movement to end breast cancer as we know it.** For more than two decades, Making Strides Against Breast Cancer has united communities in the fight against this deadly disease and funded breakthrough research, 24/7 support for breast cancer patients, and access to lifesaving screenings. Today, Making Strides is the largest network of breast cancer events in the nation. **Join Your Local Making Strides Event** Join ABC12 and our community in taking up the fight to fund the future of breast cancer research and programs. Turning your passion into a purpose is easier than you think. Sign up, recruit a team, fundraise and be an inspiration. ABC12’s Terry Camp will be at Making Strides of the Great Lakes Bay Region on Saturday, October 8th. ABC12’s Christine Winter will be at Making Strides of Flint on Saturday, October 22nd. **Find other Making Strides Events in your area** **Can’t make an event? You can still make a difference. Click below to find out how.** **Join The Movement** American Cancer Society Making Strides Against Breast Cancer® is a nationwide movement that has united communities, companies, and individuals across the country in the fight to end breast cancer for more than two decades – and we have no intention of ever slowing down. As we look to the road ahead, more determined and more inspired than ever, we invite you to join forces with the American Cancer Society – the nation’s nonprofit leader in the breast cancer fight. Join the Making Strides movement to help save lives and fund the future of breast cancer research and programs atwww.MakingStridesWalk.org Since 1993, the American Cancer Society Making Strides Against Breast Cancer® (MSABC) campaign has united communities, companies, and individuals with a collective goalto end breast canceras we know it. Over the past two decades, the 3- to 5-mile non-competitive walks have collectively grown into thenation's largest and most impactful breast cancer movementproviding a supportive community for courageous breast cancer survivors and metastatic breast cancer thrivers, including caregivers, and families alike. This year,Making Strides Against Breast Cancercelebrates its 30th anniversary and will take place in more than 150 communities nationwide. We invite you to join the Making Strides movement to help save lives and end breast cancer as we know it. Facebook Twitter WhatsApp SMS Email Print Copy article link Save **More From ABC12** UpdatedFeb 17, 2025 UpdatedFeb 9, 2025 UpdatedAug 28, 2024 UpdatedNov 30, 2023 UpdatedOct 11, 2024 UpdatedMar 27, 2023 **Recommended for you** Facebook Twitter Instagram News Weather Traffic Sports Community Video Watch Obituaries Contact Search Careers Advertise with ABC12 FCC Public File EEO Report FCC Applications Signal Problems? Advertiser Payments AI Usage Policy Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}