{"id": 2071, "name": "Novara Media", "domain": "novaramedia.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://novaramedia.com/2025/06/03/a-scandal-rocked-trump-ally-just-won-the-polish-presidency-believe-it-could-happen-in-britain/", "title": "A Scandal Rocked Trump Ally Just Won The Polish Presidency Believe It Could Happen In Britain", "content": "About Us Support Us Newsletters How We're Funded Merch Shop ➞ Manage Donation Novara Live Downstream Novara FM ACFM If I Speak Foreign Agent Planet B Committed Latest Feature Analysis Opinion Report Long Read Red Flags **A Scandal-Rocked Trump Ally Just Won the Polish Presidency. Believe It Could Happen in Britain** **Nigel Farage is taking notes.** **byAna Oppenheim&Ewa Pospieszyńska** **3 June 2025** Paywalls? Never. We think quality reporting should be free for everyone – and our supporters make that possible.Chip in todayand help build people-powered media that everyone can access. This was not how it was meant to go. Sunday’s Polish presidential election – a narrow victory for Trump-backed Karol Nawrocki – shocked the country’s liberal establishment. On Sunday, the rightwing Law and Justice party (PiS)’s candidatedefeatedthe ruling centre-right Civic Coalition’s (KO) Rafał Trzaskowski in a knife-edge second round, 50.9% to 49.1%. This election was Trzaskowski’s to lose. The centrist mayor of Warsaw, widely seen as Donald Tusk’s natural successor, had all the markings of a front-runner with his sleek image, academic credentials and linguistic skills (he boasts fluency in five languages). For months, opinion polls were giving Trzaskowski a comfortable lead. So confident was he of a win that when an exit poll showed him just 0.6% ahead, he delivered a victory speech. The unexpected winner focused his campaign on proposals such as giving Polish citizens priority access to healthcare and schools, cutting social benefits for Ukrainian refugees, rejecting the EU’s climate policies and staunch opposition to “gender ideology”. Nawrocki was previously little known in politics: a historian who, when the election was called, was serving as the head of the Institute of National Remembrance. Yet his inexperience was the least of his worries. Nawrocki’s campaign was rocked by a string of scandals. Just ahead of the first round, it wasrevealedthat Nawrocki had taken possession of an apartment in Gdańsk in exchange for “caring” for its elderly owner, whom reporters later tracked down in a retirement home (PiS figures called the claims against Nawrocki “lies” cooked up by the security services). Nawrocki also admitted to having taken part in brawls, describing them as “noble, masculine combat”. At the end of May, it was reported that he had procured sex workers for guests at a luxury hotel where he once worked as a security guard (allegations Nawrockidenies). Yet none of this managed to put off his supporters. **The great moving right show.** Unlike Nawrocki, Trzaskowski is far from a fresh face on the political scene. Apart from having served as the capital’s mayor since 2018, he had already unsuccessfully challenged the sitting president Andrzej Duda, in 2021. He was associated with the more progressive wing of KO, known for his enthusiastic pro-EU stance and advocacy for LGBTQ+ rights. In recent months, however, Trzaskowski has changed his tune, much like the rest of his party. Much of his campaign hinged not on a vision for change, but on spreading fear of PiS – while at the same time edging towards them in language and policy. Trzaskowski has aped PiS’s anti-migrant rhetoric,pledging more deportationsandrallying against accepting refugees. Earlier this year, he spoke in favour ofrestricting access to child benefitsfor Ukrainians fleeing war. He also backpedalled on his support for LGBTQ+ people, expressingopposition to the adoption of childrenby same-sex couples. Ahead of the second round, both Nawrocki and Trzaskowski appeared on a series ofYouTube live streamshosted by Sławomir Mentzen, the third-placed candidate of the Confederation party and even further to Nawrocki’s right. Nawrocki played to type. Yet it was Trzaskowski’s performance that was most surprising: while he expressed some polite disagreements with his opponent, he alsonodded alongto demands like opposing all new taxes. He then joined the far-right radical for a friendly pint, aphoto opportunitythat stunned even Mentzen’s supporters. But there’s more to Trzaskowski’s defeat than just questionable campaign strategy. **All Tusked out.** The election took place against a backdrop of widespread disillusionment with the incumbent Donald Tusk and his KO-led coalition government. Having triumphantly defeated PiS in 2023,promising sweeping reforms, the coalition has disappointed on several fronts. Despite KO’s promise to legalise abortion within its first 100 days in power, no progress has been made in two years, due in part to the reluctance of more conservative coalition MPs. Despite Poland’s steady economic growth, the government has failed to redistribute wealth or boost public services. Instead, it hasattempted to cut health insurance contributionsfor business owners (a move that was blocked by president Andrzej Duda, following pressure from the left). In the absence of a substantive policy programme, Tusk has focused much of his efforts on attacking migrants: fromarming immigration enforcement officersto suspending the right to claim asylum for everyone arriving via Belarus, a movecondemned by several human rights organisationsas a breach of international law. Since 2021, the Polish-Belarusian border has seen a surge of crossings by asylum seekers from the Middle East and North Africa. Polish authorities haveblamed Alexander Lukashenko, accusing him of luring migrants to Europe as part of a “hybrid warfare” strategy. The border area has been turned under amilitarised zone– a policy started by PiS and continued by Tusk. Much to Tusk’s surprise, borrowing from the hard right’s playbook didn’t neutralise it – quite the opposite. **What’s left?** Luckily for KO, the Polish president’s powers are limited. The most important tool at his disposal is the ability to veto bills. However, with the lack of progressive proposals coming out of the current government, Nawrocki won’t have much to block. The real danger will come at the next general election, planned for 2027. PiS hopes to return to power, possibly with the support of the even more extreme Confederation. Were this to happen, Trzaskowski as president would have been able to stop their worst authoritarian excesses. Without these checks and balances, the future of Polish democracy is far from safe. Watching the election, it was impossible not to see parallels with similar upsets around the world. Like the US Democrats found out in November, no amount of fearmongering and personal scandals can defeat the radical right in the absence of compelling alternatives. In the UK, Starmer’s government – much like KO – has prioritisedappeasing the rightover delivering on its promise of change. The result?More and more pollsshowing Reform in the running for a parliamentary majority in 2029. Poland should serve as a warning that the far-fetched can quickly become a reality. Smug liberalism is not the answer to an insurgent right, nor is mimicking its talking points. Unless progressives can define what they stand for and tangibly improve people’s lives, they’re doomed. With Tusk stubbornly unwilling to learn this lesson, perhaps the biggest challenge is the one facing the Polish left. Its relatively good performance in the first round, especially among young voters, is a silver lining of this election. The candidate furthest to the left, the democratic socialist Adrian Zandberg, won the support of one in five voters under 30, coming second only to Mentzen in this cohort. As the only parliamentary opposition force to the left of KO, his party Razem has the opportunity to channel the growing frustration with vapid centrism. Otherwise, the future looks bleak. Ana Oppenheim and Ewa Pospieszyńska are leftwing activists who met through the Polish women’s movement. Ewa Pospieszyńska is based in London and is involved in Razem International. Ana Oppenheim is doing a master’s degree in political communication at the Complutense University of Madrid. Ana Oppenheim and Ewa Pospieszyńska met through the Polish women’s movement. Ana Oppenheim is doing a master’s degree in political communication at the Complutense University of Madrid. Ewa Pospieszyńska is based in London and is involved in the international wing of the leftwing Polish party Razem. Tweet article Share article on Facebook Email this article Post to Reddit About Support Us How We're Funded Merch Shop Pitching Jobs ➞ Manage Donation Terms & Conditions Privacy Policy Novara FM ACFM If I Speak Foreign Agent Planet B Committed Pro Revolution Soccer Doing It Right: Sex On The Left Disability: It’s Political Breaking Britain Latest Feature Analysis Opinion Report Long Read Red Flags Novara Live Downstream Explainers The Bastani Factor Novara Docs YouTube Instagram Twitter/X TikTok Bluesky Facebook **Buildpeople-poweredmedia.** **Buildpeople-poweredmedia.** **Build people-powered media.** **Build people-powered media.** We’re up against huge power and influence. Our supporters keep us entirely free to access. We don’t have any ad partnerships or sponsored content. We’re up against huge power and influence. Our supporters keep us entirely free to access. We don’t have any ad partnerships or sponsored content. We are always working to improve this website for our users. To do this we use usage data facilitated by cookies and external services. For more information read ourPrivacy Policy"}