{"id": 1473, "name": "Tennessee Holler", "domain": "tnholler.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://tnholler.com/2024/12/phd-ed-policy-researcher-to-the-tennessean-issue-a-correction-for-sen-jack-johnsons-false-claims-about-lees-vouchers/", "title": "Phd Ed Policy Researcher To The Tennessean Issue A Correction For Sen Jack Johnsons False Claims About Lees Vouchers", "content": "Twitter Facebook Instagram Got a tip? Holler At Us: TheTNHoller@gmail.com DONATE HOME ABOUT CHIP IN SUBSCRIBE HOLLER HATS! Search Menu **PHD ED POLICY RESEARCHER TO THE TENNESSEAN: “ISSUE A CORRECTION FOR SEN. JACK JOHNSON’S FALSE CLAIMS ABOUT LEE’S VOUCHERS”** Below is a letter from PHD Ed Policy researcher Ezra Howard to Tennessean opinion editor David Plazas, in reaction to a recent op-ed from Senator Jack Johnson, who is sponsoring Governor Lee’s voucher bill this upcoming session. Johnson parroted Lee’s claim that the vouchers will not negatively impact public school funding, which is simply not true.Public schools will only be held harmlessfor one year, but after that year their funding will drop if kids leave for private schools and take their funding with them. Hello Mr. Plazas, My name is Dr. Ezra Howard. My day job is the data and evaluation manager for the Nashville After Zone Alliance within Metro Nashville. However, I came back to my hometown of Nashville after a career as an ESL teacher, then district ESL administrator, as well as educational researcher while completing dual PhDs. I was reading Sen. Jack Johnson’srecent op-ed in the Tennessean.I must insist that the Tennessean issue a correction for his opinion piece as on the point of funding Mr. Johnson is either incorrect or sharing misinformation. In particular, Sen. Johnson states: “Despite the false claims of many critics, there will be no decrease in funding for any public schools as a result of this legislation. Two things can be true: we support public schools and school choice.” This is not a false claim. In fact, it is the Senator misrepresenting the language of his own bill and he has done almost immediately after submitting the bill and saying himself funds would decrease over time. As the language of the bill states on page 10: “Notwithstanding subsections (b) and (c), beginning with the TISA allocation for the 2025-2026 school year, an LEA’s allocated education funding shall not decrease from one (1) year to the next year due to the disenrollment of students from the LEA. If an LEA’s calculated TISA allocation decreases from the LEA’s TISA allocation for the prior school year, then the department shall allocate additional funds to the LEA in an amount such that the LEA’s TISA allocation for the current year is not less than the prior school year. For purposes of this subsection (i), “disenrollment” means that the LEA’s non-virtual average daily membership for the current school year is lower than the LEA’s non-virtual average daily membership for the prior school year.” With a professional background both in ESL and as a researcher, I am well practiced in reading policy. Though I also practice due diligence and consulted with a local lawyer working within educational spaces as well as a colleague in higher education whose focus is on law and education.My reading as well as theirs is that Senator Johnson is patently mis-representing his bill. Funds will go down as enrollment goes down and the stated intent of vouchers is enrollment in local public schools decreasing. It is simply that there will be a year lag.2025-26 TISA allocation will be based on 2024-25 enrollment. 2026-27 will be based on 2025-26 enrollment. So on and so forth. Furthermore, House Speaker Cameron Sexton wasrecently on Inside Tennesseeon a local affiliate in Knoxville to discuss this bill and Mr. Sexton goes into a good deal of depth explaining thatfunds will indeed go down in the exact manner I state above. As such,I respectfully ask that the Tennessean issue a correction on Sen. Johnson’s piece and retract the false statementsboth in the excerpt above as well when he states “Public schools will retain their full resources, while families gain access to new opportunities that better meet their children’s needs. There are other issues such as the “success of pro-school-choice candidates” when many purposefully either downplayed or did not run on school choice, but those can be construed as a matter of opinion.Funds decreasing over time is a matter of fact. And on that fact, Sen. Johnson is not correct. Regards, Dr. Ezra Howard (If you would like to contact David Plazas and join Ezra in asking for a correction, his email: dplazas@tennessean.com) EDITOR’S NOTE – TO EZRA’S POINT, JACK RECENTLY ADMITTED THE BILL WOULD HURT PUBLIC SCHOOLS AFTER 1 YEAR TO NEWSCHANNEL 5, THEN WALKED IT BACK: WHOOPSY! JACK WALKS IT BACK 🤔 After accidentally telling the obvious truth to@ChrisDavisMMJof@NC5that@GovBillLee’s voucher scam WILL hurt public schools — “contradicting” Lee’s claim it won’t —@SenJohnsonnow says he “misspoke” 🙃 You had it right the first time, Jack.pic.twitter.com/Dk3OgbXmUR — The Tennessee Holler (@TheTNHoller)November 7, 2024 Thanks for reading! We’re an independent, reader-supported site that depends entirely on you to help us keep holding our public officials accountable and “Yelling the Truth”, so please consider chipping in a $3, $5, or $10 monthly and we’ll keep telling the stories nobody else will: Share on Facebook Share on Twitter Share on Google+ Share on Pinterest Share on Linkedin Share on Tumblr Share on Vk Share on Reddit Share by Mail **Top News** “FIGHT LIKE A MOM” (Rep. Shaundelle Brooks Arrives)November 8, 2024 - 2:32 pm INTERVIEW: Tim Miller on Leaving the GOP, Elon, BannonNovember 1, 2024 - 10:48 am 2 Conversations: Adam Brody & Rob Huebel Talk PoliticsOctober 29, 2024 - 7:37 am INTERVIEW: Memphis Mayor Paul Young on his opposition to the referendumsSeptember 6, 2024 - 8:48 am Twitter Facebook Instagram"}