{"id": 107, "name": "Atmore Advance", "domain": "atmoreadvance.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.atmoreadvance.com/2025/06/10/city-council-adopts-resolutions-naming-baseball-fields-after-longtime-director-appoints-mayor-pro-tem/", "title": "City Council Adopts Resolutions Naming Baseball Fields After Longtime Director Appoints Mayor Pro Tem", "content": "Home News Sports Lifestyles Opinion Religion Obituaries Records Contests ServicesAbout UsPoliciesTerms of UseSubmit a News TipSubmit a PhotoBirth AnnouncementBirthday AnnouncementEngagement AnnouncementWedding AnnouncementLetter to the EditorPhotosFacebook About Us Policies Terms of Use Submit a News Tip Submit a Photo Birth Announcement Birthday Announcement Engagement Announcement Wedding Announcement Letter to the Editor Photos Facebook About Us Policies Terms of Use Submit a News Tip Submit a Photo Birth Announcement Birthday Announcement Engagement Announcement Wedding Announcement Letter to the Editor Photos Facebook Classifieds Public Notices E-Edition **City council adopts resolutions naming baseball fields after longtime director, appoints mayor pro tem** Published 9:28 am Tuesday, June 10, 2025 ByAndrew Garner The Atmore City Council adopted resolutions naming baseball fields at Tom Byrne Park and appointing a mayor pro tempore during its regular meeting June 9. The council adopted resolution 2025-13, naming the fields at Tom Byrne Park the Murray Johnson Baseball Complex. Since 1973, Johnson took the reigns of the youth baseball program in Atmore. **Sign up for our daily email newsletter** Get the latest news sent to your inbox He has been recognized by state youth officers and organizations throughout the state, and served as a coordinator for state and regional tournaments. As the late Atmore Advance Columnist Lowell McGill said in a previous column, Johnson is blessed with the ability to resolve conflicts at the ballpark. “He recognizes and uses good managers and coaches for all our teams,” McGill wrote. “And, one very important requisite is his knowledge of the game. He is extremely gifted in interpreting rules, which are outlined in the youth baseball ‘book.’” Johnson held his position until 2023. The other resolution, 2025-12, appointed District 2 Council Member Jerome Webster as mayor pro tempore. Municipal Judge Karean Reynolds swore Webster in Monday. In other business, the city: approved a request by Sandra Gray to use Houston Avery Park for a function; and, heard reports from the city department heads, including Chief Chuck Brooks and Street Department Superintendent Calvin Grace. Fire Chief Ronald Peebles was absent as he was dealing with a family matter. Brooks spoke about the May 2025 statistics the department frequently publishes. He said for the month of May, the department responded to 2,374 calls. He said many of the traffic stops (493) were given as verbal warnings instead of tickets. Brooks said the department has many spare vehicles, and he hopes to be able to fill those with officers. He added that the department is applying for a grant to help pay for two additional officers. Grace said the street department is hard at work replacing faded and missing street signs, and they hope to have its own fuel system online in July. **Grant announces candidacy for District 1 seat of Atmore City Council** **Commission moves forward with block grant disaster recovery application** **Atmore man arrested June 7 on possession, theft charges** **Final suspect in North Main, Howard Street shooting turns self into APD** Calendar of Events **Calendar of Events** **Calendar of Events** Home News Sports Opinion Lifestyles Obits Business Small Business About Us Subscribe Policies Terms of Use Submit a News Tip Submit a Photo Birth Announcement Birthday Announcement Engagement Announcement Wedding Announcement © 2025, The Atmore Advance"}