{"id": 343, "name": "DeClassified UK", "domain": "declassifieduk.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.declassifieduk.org/uk-police-spent-thousands-protecting-israeli-arms-firm-linked-to-bezalel-smotrich/", "title": "Uk Police Spent Thousands Protecting Israeli Arms Firm Linked To Bezalel Smotrich", "content": "DONATE Newsletter Africa Americas Asia Europe Middle East Empire Earth Archive About Us Funders Who We Are Contact Us Login Arms Trade Corporations Empire Intelligence Media Military Royals Secrecy **UK police spent thousands protecting Israeli arms firm** Britain has sanctioned Israel's finance minister Bezalel Smotrich (centre), but his department still owns an arms firm in England. (Photo: Ilia Yefimovich / Alamy) A police force in England has spent hundreds of thousands of pounds protecting an arms factory owned by Israel’s ministry of finance,Declassifiedcan reveal. Based in Newcastle, Pearson Engineeringmanufactures“mobility equipment to armed forces around the world”, including the British military. The arms firm was acquired by Israel’s state-owned arms giant Rafael in 2022. Its financial recordsshowhow the country’s ministry of finance now has “significant control” over the company. Documents seen byDeclassifiedreveal Northumbria police have spent £209,755 policing pro-Palestine protests at Pearson Engineering’s site, as well as at the University of Newcastle since October 2023. The bulk of this money was likely spent protecting the Israeli-owned factory. The data includes just one incident at the university while it covers at least four protests at Pearson’s factory between October 2023 and February 2025. Northumbria police said the £209,755 in policing costs accounted for a total of 337 hours of police work – amounting to £622 per hour. The revelation comes as the UK government sanctions Israel’s finance minister, Bezalel Smotrich, raising concerns about the ongoing operation of the factory in Newcastle. Jason Hussein, the vice chair of Newcastle Palestine Solidarity Campaign, toldDeclassified: “When activists jam the gears of genocide, they are frequently met with a huge police presence and a disproportionate use of force resulting in the assaults and arrests of peaceful protestors, with Palestinians and people of colour often targeted. “Just a day after the UK sanctioned the Israeli finance minister, business continues as usual and the weapons keep flowing. This factory is not welcome in Newcastle and we urge the UK government to back up their rhetoric with action”. **Pearson Engineering** Chaired by Britain’s former defence and trade secretaryLord John Hutton, Pearson Engineering has been the subject of several pro-Palestine protests since October 2023. In December 2024, activists gathered outside the factory to highlight the presence of an Israeli state-owned factory in Britain. Northumbria police officers rushed in “entirely unprovoked” and ordered people to move, according toMiddle East Monitor. A protester from the Palestine Solidarity Campaign said: “Individuals were dragged along the ground, pushed to the tarmac and grabbed around the throat by police officers”. The site has also been hit by Palestine Action, with activistsclimbingonto the factory’s gatehouse earlier this year and dropping rubble in front of the gates to prevent access. “The profits that they make, the money that they make here is funnelled into Rafael – an Israeli-owned weapons manufacturer”,declaredone activist. Rafael’s resources are also shared with its subsidiary. The company’s accounts for 2024note“progress regarding the transfer of technology from Rafael into Pearson Engineering”, with a turnover of £79 million. **RELATED** **13 British Lords Linked to Israel’s Arms Trade** **13 British Lords Linked to Israel’s Arms Trade** **Bezalel Smotrich** Bezalel Smotrich, who oversees the same Israeli finance ministry which owns Pearson Engineering, was sanctioned by the UK government this week. In a statement, the Foreign Office said Smotrich and national security minister Itamar Ben-Gvir have “incited extremist violence and serious abuses of Palestinian human rights”. It continued: “Extremist rhetoric advocating the forced displacement of Palestinians and the creation of new Israeli settlements is appalling and dangerous. These actions are not acceptable”. UK foreign secretary David Lammy has described Smotrich’s views as “monstrous”. Smotrich has alsoclaimedhumanitarian aid is only being allowed into Gaza “so the world does not stop us and accuse us of war crimes”. Israel’s goal, he said, was to “conquer, clear, and stay” in Gaza. And last year hearguedthat starving two million Gazans may be “moral… but no one in the world would let us”. Smotrich is now subject to an asset freeze, travel ban, and director disqualification “in his personal capacity”, meaning the finance ministry that he oversees has been exempted from UK sanctions. Palestine Action’s Huda Ammori toldDeclassified: “It seems convenient that the government imposed sanctions on the Israeli minister of finance, but not the ministry itself – especially as the Israeli ministry of finance owns a weapons factory in Newcastle. “The government is clearly attempting to protect the Israeli weapons industry and save face by imposing meaningless sanctions. The Israeli government, which is committing genocide, should not be able to own a weapons factory in England”. Israel Palestine **ABOUT THE AUTHOR** John McEvoy is Chief Reporter for Declassified UK. John is an historian and filmmaker whose work focuses on British foreign policy and Latin America. His PhD was on Britain’s Secret Wars in Colombia between 1948 and 2009, and he is currently working on a documentary about Britain’s role in the rise of Augusto Pinochet. **your donation funds our investigation** Arms Trade Corporations Empire Intelligence Media Military Royals Secrecy Africa Americas Asia Europe Middle East About Us Who We Are Funders Contact Us Privacy Complaints Follow Follow Follow Follow"}