{"id": 901, "name": "Fort Dodge Messenger", "domain": "messengernews.net", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.messengernews.net/life/lifestyle-briefs/2025/06/our-saviours-lutheran-church-annual-garage-sale-june-13-and-14-2/", "title": "Our Saviours Lutheran Church Annual Garage Sale June 13 And 14 2", "content": "NewsLocal NewsLocal BusinessNews of recordNews BriefReligion BriefsBusiness BriefsEducationLocal ReligionFrom Our FilesIowa NewsNational News Local News Local Business News of record News Brief Religion Briefs Business Briefs Education Local Religion From Our Files Iowa News National News Local News Local Business News of record News Brief Religion Briefs Business Briefs Education Local Religion From Our Files Iowa News National News SportsLocal SportsHigh School FootballSports ColumnsIowa SportsNational Sports Local Sports High School Football Sports Columns Iowa Sports National Sports Local Sports High School Football Sports Columns Iowa Sports National Sports OpinionLocal ColumnsEditorialLetters to the Editor Local Columns Editorial Letters to the Editor Local Columns Editorial Letters to the Editor LifeLocal LifestyleLifestyle ColumnsLifestyle BriefsWeddings and EngagementsBirthdays and Anniversaries Local Lifestyle Lifestyle Columns Lifestyle Briefs Weddings and Engagements Birthdays and Anniversaries Local Lifestyle Lifestyle Columns Lifestyle Briefs Weddings and Engagements Birthdays and Anniversaries ObituariesView ObituariesPlace Obit View Obituaries Place Obit View Obituaries Place Obit Classifieds Jobs Garage Sales Contact InformationContact UsSubmit NewsSubscribeAdvertiseStatement of ValuesTerms of Service Contact Us Submit News Subscribe Advertise Statement of Values Terms of Service Contact Us Submit News Subscribe Advertise Statement of Values Terms of Service Public NoticesView a NoticePlace Notice View a Notice Place Notice View a Notice Place Notice News Sports Opinion Life Obituaries Classifieds Jobs Garage Sales Place Notice SUBSCRIBE SUBSCRIBE June 11, 2025 | Today's Paper | Submit News | Subscribe Today Today's Paper | Subscribe Today **Our Saviour’s Lutheran Church annual garage sale June 13 and 14** **** Jun 7, 2025 CALLENDER — Our Saviour’s Lutheran Church, Callender, is holding its annual garage sale from 2 to 8 p.m. June 13 and 8 a.m. to 2 p.m. June 14 at the church. Enter through the west door. **Newsletter** **Lifestyle Briefs** **Lifestyle Briefs** **Level up your garden for adults and teens at the Fort Dodge Public Library on Monday** **Level up your garden for adults and teens at the Fort Dodge Public Library on Monday** Help us kick off the Fort Dodge Public Library adult and teen summer reading program by joining us at 6 p.m. Monday ... **CrossWay Evangelical Free Church VBS starts Monday** **CrossWay Evangelical Free Church VBS starts Monday** CrossWay Evangelical Free Church, 3058 10th Ave. N., is holding a Vacation Bible School from 9 to 11:30 a.m. Monday ... **Lehigh Methodist to hold second Sunday supper on Sunday** **Lehigh Methodist to hold second Sunday supper on Sunday** LEHIGH — The Lehigh Methodist Church will be serving second Sunday supper from 5 to 7 p.m. Sunday for a freewill ... **Livermore swimming pool benefit is Sunday** **Livermore swimming pool benefit is Sunday** LIVERMORE — The Livermore Swimming Pool benefit is 11 a.m. to 1 p.m. June 8 at the Livermore Pool Park. Pork ... **CDA meeting June 12, RSVP by June 10** **CDA meeting June 12, RSVP by June 10** The Catholic Daughters Court 216 meeting will be held on Thursday at the Corpus Christi Center, 403 N. Eighth St., ... **FDPL adult and teen coloring Tuesday** **FDPL adult and teen coloring Tuesday** Welcome summer by joining the Fort Dodge Public Library, 424 Central Ave., for adult and teen coloring. The next ... MOST READ **'Perfect spot' picked for tribute to Henderson** **'Perfect spot' picked for tribute to Henderson** **‘Did what any passerby would do’** **‘Did what any passerby would do’** **School moves to get on referendum ballot** **School moves to get on referendum ballot** **Summer fun beckons for all** **Summer fun beckons for all** **News of Record: June 11, 2025** **News of Record: June 11, 2025** **Officers assaulted as inmate attempts escape from Sac County Jail** **Officers assaulted as inmate attempts escape from Sac County Jail** **Newsletter** **Starting at $2.99/week.** **Subscribe Today** **Subscribe Today** NewsLocal NewsLocal BusinessEducationObituaries Local News Local Business Education Obituaries Local News Local Business Education Obituaries SportsLocal SportsHigh School FootballSports ColumnsIowa Sports Local Sports High School Football Sports Columns Iowa Sports Local Sports High School Football Sports Columns Iowa Sports OpinionLocal ColumnsEditorialLetters to the Editor Local Columns Editorial Letters to the Editor Local Columns Editorial Letters to the Editor LifeLocal LifestyleLifestyle ColumnsLifestyle BriefsWeddings and Engagements Local Lifestyle Lifestyle Columns Lifestyle Briefs Weddings and Engagements Local Lifestyle Lifestyle Columns Lifestyle Briefs Weddings and Engagements ContactSubmit NewsSubscribeAdvertiseContact Us Submit News Subscribe Advertise Contact Us Submit News Subscribe Advertise Contact Us Copyright © 2025 Ogden Newspapers of Iowa, LLC | https://www.messengernews.net | 713 Central Ave., Fort Dodge, IA 50501 | 515-573-2141"}