{"id": 1851, "name": "Ann Arbor's Talk 1290 WLBY", "domain": "1290wlby.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.1290wlby.com/news/us-companies-warn-of-multibillion-dollar-setbacks-amid-trade-war/", "title": "Us Companies Warn Of Multibillion Dollar Setbacks Amid Trade War", "content": "ShowsThe Lucy Ann Lance ShowBloomberg RadioThe Vince ShowThe Chris Plante ShowThe Mark Levin ShowThe John Batchelor ShowThe Inside Outside Guys The Lucy Ann Lance Show Bloomberg Radio The Vince Show The Chris Plante Show The Mark Levin Show The John Batchelor Show The Inside Outside Guys The Lucy Ann Lance Show Bloomberg Radio The Vince Show The Chris Plante Show The Mark Levin Show The John Batchelor Show The Inside Outside Guys Sweet Deals Advertising **US Companies Warn of Multibillion-Dollar Setbacks Amid Trade War** American companies are voicing concern over the escalating tariffs issued by the Trump administration to China. The Hill reported that American companies are warning of multibillion-dollar losses and deep uncertainty. United Airlines issued two separate financial outlooks, citing the unpredictable nature of the current economic climate. The company said it was “impossible to predict” whether the U.S. could slide into a recession as a result of the ongoing reciprocal tariffs. Johnson & Johnson CEO Joaquin Duato voiced his concern over the potential for new tariffs on pharmaceuticals, warning that such measures could disrupt the medical supply chain. Read more at Newsmax© 2025 Newsmax. All rights reserved. **Headlines** **GOP Govs Warn Protesters Ahead of Saturday Rallies** **Trump Admin to Rescind Power Plant Climate Rules** **US Vet Group Aids Rescue of Sex Trafficked Peruvians** **Key Republicans to Skip Trump’s Military Parade** **YMCA Probe Sought Over Gender-Based Discrimination** **Sen. Hawley Launches Investigation of LA Riots** **Free Apps** Privacy Policy Terms of Service General Contest Rules Advertise With Us Station Information Public File 2025 EEO Report Employment Opportunities Cumulus Media Corporate Copyright 2020 Cumulus Media / Cumulus Media is an equal opportunity employer / AA View Full Site"}