{"id": 215, "name": "Channel 4 News (UK)", "domain": "channel4.com/news", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.channel4.com/news/factcheck/factcheck-attacks-on-teachers-reported-by-schools-rise-by-a-fifth-exclusive-figures-show", "title": "Factcheck Attacks On Teachers Reported By Schools Rise By A Fifth Exclusive Figures Show", "content": "Skip to main news content Skip to news search Skip to news navigation Skip to Channel 4 navigation ProgrammesCatch up on TV bulletins Catch up on TV bulletins Catch up on TV bulletins Catch up on TV bulletins UK World Politics Business Science Culture Tech FactCheck Team **FactCheck** **Attacks on teachers reported by schools rise by a fifth, exclusive figures show** Share on FacebookShare Share on TwitterTweet Share on WhatsAppSend Share on WhatsAppSend Share on WhatsAppEmail Load more share options ByClaire Wilde 5 Jun 2025 Reports of violent injuries suffered by school staff have risen by nearly a fifth in a year, FactCheck can exclusively reveal. Over 800 attacks left teachers and other staff with injuries so severe, they had to be reported to the safety regulator. They include fractures, open wounds and even sight loss. **How many teachers are injured because of violence in schools?** Workplace injuries above a certain threshold of seriousness must be reported to the Health and Safety Executive (HSE). Earlier this year, FactCheck revealed thatthe number of violent injuries to staff reported by schools had doubled in the ten years to March 2023. Now new figures, obtained under the Freedom of Information Act, show the number of reported incidents has risen further. The HSE recorded 834 injuries to school staff caused by violence across England, Scotland and Wales in the year to March 2024 – 18% higher than the previous year. They included 187 fractures, 39 cuts and open wounds, 23 reports of a staff member losing consciousness and four incidents of lost or reduced sight. In each of these categories, the number of reports was higher than the previous year. The HSE figures do not cover Northern Ireland, which has a different system. The injuries were not necessarily inflicted by pupils – they could include any caused by parents or other adults. They could also include injuries sustained as a result of challenging behaviour from children with special educational needs. More than half of the reports came from primary schools. **What are governments doing about violence in schools?** Matt Wrack, acting general secretary of the NASUWT teaching union, urged ministers to establish a national forum on school safety. He said: “These figures represent the tip of the iceberg as we know that in too many cases schools fail to report serious assaults and attacks on teachers.” He called on schools to ensure they had effective behaviour management policies in place to deal with and deter violence and abuse. For England, a spokesperson for the Department for Education said they “know there is more to do to turn the tide of poor behaviour” in schools. They pointed to new “Attendance and Behaviour Hubs” to “directly support” hundreds of schools, and plans to expand “access to mental health support to every school”. A spokesperson for the Scottish Government said: “These figures show that violent behaviour in schools is an issue across the UK, and in Scotland we are providing support and direction at a national level through our Relationships and Behaviour in Schools Action Plan.” A spokesperson for the Welsh Government said: “Any form of violence or abuse against staff in our schools is completely unacceptable.” The spokesperson pointed to a recent government “behaviour summit” to help schools. Share on FacebookShare Share on TwitterTweet Share on WhatsAppSend Share on WhatsAppSend Share on WhatsAppEmail Load more share options **More from Channel 4 FactCheck** 1 in 3 cancer wards are missing nurses Two-child benefit cap will push 80 children a day into poverty, exclusive data shows What is West Nile virus, what are the symptoms and should we be worried about UK cases? Three key points from Keir Starmer’s UK-EU deal – explained About Channel 4 NewsFAQsContact us About Channel 4 News FAQs Contact us About Channel 4 News FAQs Contact us FacebookTwitterYouTubeInstagram Facebook Twitter YouTube Instagram Facebook Twitter YouTube Instagram"}