{"id": 1315, "name": "Williamsport Sun-Gazette", "domain": "sungazette.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.sungazette.com/news/top-news/2025/06/director-proposed-state-allocation-for-river-valley-transit-authority-wont-pay-citys-debt-to-federal-transit-authority/", "title": "Director Proposed State Allocation For River Valley Transit Authority Wont Pay Citys Debt To Federal Transit Authority", "content": "NewsTop NewsPolice, Fire & CourtPA NewsNational NewsInternational NewsOutdoorsBusinessHealthEducationReligionThe Chamber Connection Top News Police, Fire & Court PA News National News International News Outdoors Business Health Education Religion The Chamber Connection Top News Police, Fire & Court PA News National News International News Outdoors Business Health Education Religion The Chamber Connection Obituaries SportsLocal SportsNational SportsPA SportsLittle League Extra Local Sports National Sports PA Sports Little League Extra Local Sports National Sports PA Sports Little League Extra OpinionEditorialsLetters to the EditorOther Commentaries Editorials Letters to the Editor Other Commentaries Editorials Letters to the Editor Other Commentaries LifeLifestyle NewsShowcaseThe TasteCelebrationsWest Branch Life Magazine Lifestyle News Showcase The Taste Celebrations West Branch Life Magazine Lifestyle News Showcase The Taste Celebrations West Branch Life Magazine Classifieds Jobs Homes Garage Sales Contact InformationContact UsSubmit NewsAdvertiseStatement of ValuesTerms of Service Contact Us Submit News Advertise Statement of Values Terms of Service Contact Us Submit News Advertise Statement of Values Terms of Service Facebook Twitter Place Legal NoticesBrowse NoticesPlace Notice Browse Notices Place Notice Browse Notices Place Notice News Sports Obituaries Opinion Life Classifieds Jobs Homes Place Legal Notice Celebrations SUBSCRIBE SUBSCRIBE June 11, 2025 | Today's Paper | Submit News | Subscribe Today Today's Paper | Subscribe Today **Director: Proposed state allocation for River Valley Transit Authority won’t pay city’s debt to Federal Transit Authority** **** Jun 11, 2025 SUN-GAZETTE FILE PHOTO To be clear, the funding in Gov. Josh Shapiro’s proposed budget for mass transit, which includes an allocation for River Valley Transit Authority (RVTA), would not be used in the ongoing repayment of $1.4 million in funds owed by the City of Williamsport to the Federal Transit Administration (FTA), an administrator at RVTA said. The city is repaying prior funding from the FTA due to illegality committed by a former city finance director when the city operated the former River Valley Transit, said River Valley Transit Authority Executive Director Todd Wright. “The budgeted funding in an approved budget goes to RVTA for regular operational expenses and has nothing to do with repayment to the FTA,” said Wright in response to the headline of a story published by Northcentral Pa. on June 8. The headline stated: “If Shapiro’s budget passes, River Valley Transit could recoup misspent funds.” The story went on to connect Shapiro’s budget proposal, which does have an extra $1.39 million in it for the Williamsport-based bus service, saying that is about the same amount as what the city owes the FTA. Shapiro’s budget proposal for use of operational expenses at RVTA and the repayment by the city are separate issues, which Wright clarified. Additionally, the $1.39 million additional in the proposed budget could be tweaked by state legislators, he said. The repayments are a separate matter, and were agreed upon after investigation revealed federal transit grant misuse and misallocation by a former administrator, William E. Nichols Jr., 72, who is serving a year’s probation after pleading guilty May 5 in Dauphin County Court on theft by failure to make required disposition of funds and tampering with public records. Currently, the state allocation in the proposed budget is $6.2 million, for RVTA which has an annual budget of $10 million, Wright said. The RVTA board has been informed by the state that current public transportation law guarantees transit agencies funding at the level of the prior year, according to Meredith Biggica, Deputy Secretary Multimodal Transportation, who provided details in a letter to Wright on March 21. In order to ensure funding will be in place at the start of the fiscal year, the department is awarding the same amount it awarded in FY 2024-25. The RVTA’s Section 1513 allocation will be $6,237,634. “We will adjust your grant to include any increases after the passage of the budget,” Biggica wrote to Wright. “Should the Governor’s Executive Budget Proposal be enacted as proposed, your allocation would increase by approximately $1,394,950.” As required in Act 89 of 2013, RVTA is expected to provide local funding of $543,957, an increase of 5%, since it is not at the full 15% match. Local match may change as a result of the budget negotiations, and the state will inform the transit system of any changes to local match as a result of increases in operating funds as soon as it knows, Biggica noted. Since July 1, 2022, the RVTA board has worked directly with the authority’s executive director as the title of executive director is the former general manager. The state urged RVTA to “prudently manage your operating expenses” to ensure future fiscal sustainability. **Newsletter** **Top News** **Top News** **Life-saving kits donated to Loyalsock Township parks, include items like AEDs and tourniquets** **Life-saving kits donated to Loyalsock Township parks, include items like AEDs and tourniquets** **‘The spirit of being Bulldogs’: Jersey Shore Area’s Class of 2025 crosses commencement stage** **‘The spirit of being Bulldogs’: Jersey Shore Area’s Class of 2025 crosses commencement stage** **Director: Proposed state allocation for River Valley Transit Authority won’t pay city’s debt to Federal Transit Authority** **Director: Proposed state allocation for River Valley Transit Authority won’t pay city’s debt to Federal Transit Authority** **Missing kayaker who drowned in Loyalsock Creek identified as South Williamsport man** **Missing kayaker who drowned in Loyalsock Creek identified as South Williamsport man** **Missing kayaker’s body recovered from Loyalsock Creek** **Missing kayaker’s body recovered from Loyalsock Creek** **Amazon to bring AI jobs to site near Berwick** **Amazon to bring AI jobs to site near Berwick** Gov. Josh Shapiro announced Monday that Amazon is planning to invest at least $20 billion to establish high-tech ... MOST READ **Motorist charged after police chase with stolen car in Clinton Township** **Motorist charged after police chase with stolen car in Clinton Township** **Three men charged with assault in separate cases** **Three men charged with assault in separate cases** **South's Abby Lorson’s last at-bat may have been her most memorable** **South's Abby Lorson’s last at-bat may have been her most memorable** **Montoursville's Kirby brothers lived special moment on Monday together** **Montoursville's Kirby brothers lived special moment on Monday together** **Montoursville players see themselves as a bit of underdogs this run** **Montoursville players see themselves as a bit of underdogs this run** **Kendall Cardone’s play speaks just as loud as her positivity for South** **Kendall Cardone’s play speaks just as loud as her positivity for South** **Newsletter** **Starting at $2.99/week.** **Subscribe Today** **Subscribe Today** NewsTop NewsObituariesPolice, Fire and CourtNational News Top News Obituaries Police, Fire and Court National News Top News Obituaries Police, Fire and Court National News SportsLocal SportsPA SportsNational SportsLittle League Extra Local Sports PA Sports National Sports Little League Extra Local Sports PA Sports National Sports Little League Extra OpinionEditorialsLetters to the EditorOther Commentaries Editorials Letters to the Editor Other Commentaries Editorials Letters to the Editor Other Commentaries LifeLifestyle NewsShowcaseCelebrations Lifestyle News Showcase Celebrations Lifestyle News Showcase Celebrations ContactSubmit NewsSubscribeAdvertiseContact Us Submit News Subscribe Advertise Contact Us Submit News Subscribe Advertise Contact Us Copyright © 2025 Sun-Gazette, LLC | https://www.sungazette.com | 252 W. Fourth Street, Williamsport, PA 17703 | 570-326-1551"}