{"id": 1760, "name": "MichaelSalla.com", "domain": "michaelsalla.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://michaelsalla.com/2025/05/29/confederation-of-planets-galactic-federation-of-worlds-a-contrast-in-galactic-conflict-resolution/", "title": "Confederation Of Planets Galactic Federation Of Worlds A Contrast In Galactic Conflict Resolution", "content": "**** **** **** **** **Menu** Home About Exopolitics.org Webinars Books Events & Media Subscribe Contact **Confederation of Planets, Galactic Federation of Worlds – A Contrast in Galactic Conflict Resolution** Positively oriented galactic associations have intervened in human affairs using very different conflict resolution approaches. On the one hand, there is a spiritually oriented, almost pacifist organization that goes by names such as ‘Confederation of Planets,’ ‘Galactic Confederation,’ ‘Confederation of Light,’ etc. On the other hand, organizations such as the ‘Galactic Federation of Worlds’ and the ‘Ashtar Command’ are more military-oriented and interventionist in dealing with negative extraterrestrial activities and influences. The Confederation of Planets takes a more long-term spiritual approach, emphasizing nonviolence, cosmic consciousness, education, and love. In short, the “Confederation” is a loosely bound, noninterventionist, almost pacifist galactic alliance. In contrast, the “Federation,” has a more tightly integrated structure that includes a unified military that facilitates direct intervention in galactic conflicts. In this exopolitical commentary, Dr. Michael Salla discusses the Confederation of Planets and how it differs from the Galactic Federation of Worlds in conflict resolution. He cites extensively from his book, Galactic Federations, Councils and Secret Space Programs (2022), to provide sources and information describing these different extraterrestrial organizations, and how they intervene to improve the human situation. Podcast Episode #468 Watch onPatreon,YouTube, &Rumble Audio Podcast onApple,Spotify, orGoogle Related Articles/Interviews Sacred Encounters at Lake Titicaca Remote Viewing the Galactic Federation of Worlds Did Extraterrestrials from Venus Make Contact in 1952? Revisiting George Adamski’s claims of Human looking Extraterrestrials The Coming Solar Flash & the Galactic Federation – Q&A with Corey Goode George Adamski: A Herald for the Space Brothers – Book Review **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook **Like this:** **Related posts** **The ET Disclosure Betrayal: Galactic Federation of Worlds Agreements with Global Elites** **Psychic Communications, 12-Strand DNA and the future of Humanity** **Global Transition Energies and Benevolent ETs** **Post navigation** **Leave a ReplyCancel reply** **Rise of Red Dragon Book** **Follow Blog via Email** Enter your email address to follow this blog and receive notifications of new posts by email. Email Address: Follow **Available on Amazon!** **USAF SSP Book** **Antarctica’s Secrets Revealed!** **Search** **All Books at Amazon** **ExoNews TV** **Follow on Facebook** **Follow me on Twitter** **Translate** **Discover more from** Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading **** **** ****"}