{"id": 1942, "name": "Dallas Express", "domain": "dallasexpress.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://dallasexpress.com/state/dont-mess-with-texas-abbott-confirms-national-guard-deployed-to-enforce-order-amid-riots/", "title": "Dont Mess With Texas Abbott Confirms National Guard Deployed To Enforce Order Amid Riots", "content": "Home CategoriesDallasTarrant/Fort WorthMetroplexStateNationalCrimeEducationBusinessReal EstateFaith & FamilyHealth & ScienceSportsOpinionProfilesObituariesJobs Dallas Tarrant/Fort Worth Metroplex State National Crime Education Business Real Estate Faith & Family Health & Science Sports Opinion Profiles Obituaries Jobs Dallas Tarrant/Fort Worth Metroplex State National Crime Education Business Real Estate Faith & Family Health & Science Sports Opinion Profiles Obituaries Jobs Special FeaturesLet’s Talk Local PodcastCrime BossDallas DerbyLocal Elections Let’s Talk Local Podcast Crime Boss Dallas Derby Local Elections Let’s Talk Local Podcast Crime Boss Dallas Derby Local Elections Submit a Story Fine PrintHow to Support UsAbout Dallas ExpressThe TeamCode of EthicsContactAdvertisingTerms of ServicePrivacy PolicyComment Moderation PoliciesBecome a Member How to Support Us About Dallas Express The Team Code of Ethics Contact Advertising Terms of Service Privacy Policy Comment Moderation Policies Become a Member How to Support Us About Dallas Express The Team Code of Ethics Contact Advertising Terms of Service Privacy Policy Comment Moderation Policies Become a Member Home CategoriesDallasTarrant/Fort WorthMetroplexStateNationalCrimeEducationBusinessReal EstateFaith & FamilyHealth & ScienceSportsOpinionProfilesObituariesJobs Dallas Tarrant/Fort Worth Metroplex State National Crime Education Business Real Estate Faith & Family Health & Science Sports Opinion Profiles Obituaries Jobs Dallas Tarrant/Fort Worth Metroplex State National Crime Education Business Real Estate Faith & Family Health & Science Sports Opinion Profiles Obituaries Jobs Special FeaturesLet’s Talk Local PodcastCrime BossDallas DerbyLocal Elections Let’s Talk Local Podcast Crime Boss Dallas Derby Local Elections Let’s Talk Local Podcast Crime Boss Dallas Derby Local Elections Submit a Story Fine PrintHow to Support UsAbout Dallas ExpressThe TeamCode of EthicsContactAdvertisingTerms of ServicePrivacy PolicyComment Moderation PoliciesBecome a Member How to Support Us About Dallas Express The Team Code of Ethics Contact Advertising Terms of Service Privacy Policy Comment Moderation Policies Become a Member How to Support Us About Dallas Express The Team Code of Ethics Contact Advertising Terms of Service Privacy Policy Comment Moderation Policies Become a Member **DON’T MESS WITH TEXAS: Abbott Confirms National Guard Deployed To Enforce Order Amid Riots** Texas Gov. Greg Abbott has confirmed the deployment of the National Guard across the state to help manage the ongoing riots over immigration.As previouslyreportedbyThe Dallas Express, violent riots due to Immigration and Customs Enforcement (ICE) raids erupted in Los Angeles over the weekend and have spread across the country.Thespreadof left-wingagitators has reached Dallas and Austin, and more riots are expected to occur across the country over the coming days.Now, a representative from the San Antonio Police Department haswrittenthat Chief William McManus “was able to confirm that Gov. Greg Abbott deployed National Guard troops to San Antonio,” according to a statement sent to The San Antonio Express.CLICK HERE TO GET THE DALLAS EXPRESS APPAbbott’s press secretary, Andrew Mahaleris, also confirmed that soldiers “are on standby in areas where mass demonstrations are planned in case they are needed,” though he did not mention what areas this included.“Peaceful protests are part of the fabric of our nation, butTexas will not tolerate the lawlessness we have seen in Los Angeles,” he added in a statement sent to The San Antonio Express.“Anyone engaging in acts of violence or damaging property will be swiftly held accountable to the full extent of the law.”Abbott also personally confirmed onsocial mediathat National Guard troops have been deployed throughout the state, writing that the troops will “use every tool & strategy to help law enforcement maintain order.”“Texas National Guard will be deployed to locations across the state to ensure peace & order. Peaceful protest is legal.Harming a person or property is illegal & will lead to arrest.”Abbott could be addressing the dozens of “protests”plannedfor this weekend by the 50501 Movement, whichdescribesitself as a “national movement made up of everyday Americans who stand for democracy, and who stand against the authoritarianactions of the Trump Administration.”The violent riots in Los Angeles resulted in a total of 50 arrests and the deployment of over 600 non-lethal rounds, with two officers being transported to the hospital with injuries sustained while attempting to manage the crowd, as previouslyreportedbyThe Dallas Express. As previouslyreportedbyThe Dallas Express, violent riots due to Immigration and Customs Enforcement (ICE) raids erupted in Los Angeles over the weekend and have spread across the country. Thespreadof left-wingagitators has reached Dallas and Austin, and more riots are expected to occur across the country over the coming days. Now, a representative from the San Antonio Police Department haswrittenthat Chief William McManus “was able to confirm that Gov. Greg Abbott deployed National Guard troops to San Antonio,” according to a statement sent to The San Antonio Express. Abbott’s press secretary, Andrew Mahaleris, also confirmed that soldiers “are on standby in areas where mass demonstrations are planned in case they are needed,” though he did not mention what areas this included. “Peaceful protests are part of the fabric of our nation, butTexas will not tolerate the lawlessness we have seen in Los Angeles,” he added in a statement sent to The San Antonio Express. “Anyone engaging in acts of violence or damaging property will be swiftly held accountable to the full extent of the law.” Abbott also personally confirmed onsocial mediathat National Guard troops have been deployed throughout the state, writing that the troops will “use every tool & strategy to help law enforcement maintain order.” “Texas National Guard will be deployed to locations across the state to ensure peace & order. Peaceful protest is legal.Harming a person or property is illegal & will lead to arrest.” Abbott could be addressing the dozens of “protests”plannedfor this weekend by the 50501 Movement, whichdescribesitself as a “national movement made up of everyday Americans who stand for democracy, and who stand against the authoritarianactions of the Trump Administration.” The violent riots in Los Angeles resulted in a total of 50 arrests and the deployment of over 600 non-lethal rounds, with two officers being transported to the hospital with injuries sustained while attempting to manage the crowd, as previouslyreportedbyThe Dallas Express. As previouslyreportedbyThe Dallas Express, violent riots due to Immigration and Customs Enforcement (ICE) raids erupted in Los Angeles over the weekend and have spread across the country. Thespreadof left-wingagitators has reached Dallas and Austin, and more riots are expected to occur across the country over the coming days. Now, a representative from the San Antonio Police Department haswrittenthat Chief William McManus “was able to confirm that Gov. Greg Abbott deployed National Guard troops to San Antonio,” according to a statement sent to The San Antonio Express. Abbott’s press secretary, Andrew Mahaleris, also confirmed that soldiers “are on standby in areas where mass demonstrations are planned in case they are needed,” though he did not mention what areas this included. “Peaceful protests are part of the fabric of our nation, butTexas will not tolerate the lawlessness we have seen in Los Angeles,” he added in a statement sent to The San Antonio Express. “Anyone engaging in acts of violence or damaging property will be swiftly held accountable to the full extent of the law.” Abbott also personally confirmed onsocial mediathat National Guard troops have been deployed throughout the state, writing that the troops will “use every tool & strategy to help law enforcement maintain order.” “Texas National Guard will be deployed to locations across the state to ensure peace & order. Peaceful protest is legal.Harming a person or property is illegal & will lead to arrest.” Abbott could be addressing the dozens of “protests”plannedfor this weekend by the 50501 Movement, whichdescribesitself as a “national movement made up of everyday Americans who stand for democracy, and who stand against the authoritarianactions of the Trump Administration.” The violent riots in Los Angeles resulted in a total of 50 arrests and the deployment of over 600 non-lethal rounds, with two officers being transported to the hospital with injuries sustained while attempting to manage the crowd, as previouslyreportedbyThe Dallas Express. Terms of Service Code of Ethics Privacy Policy Advertising with Dallas Express"}