{"id": 865, "name": "Mad in America", "domain": "madinamerica.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.madinamerica.com/2025/06/depsychiatrization-dispelling-harmful-diagnostical-self-concepts-in-therapy-and-community-health-work/#comments", "title": "Depsychiatrization Dispelling Harmful Diagnostical Self Concepts In Therapy And Community Health Work", "content": "EditorialMIA ReportsBlogsPersonal StoriesResearch NewsMIA RadioOnline EventsOpen DialoguePsychiatric Drug WithdrawalSpotlightInitiativesCalendarThe ArtsAround The WebMIA LibraryCrosswords MIA Reports Blogs Personal Stories Research News MIA Radio Online EventsOpen DialoguePsychiatric Drug Withdrawal Open Dialogue Psychiatric Drug Withdrawal Spotlight InitiativesCalendar Calendar The Arts Around The Web MIA Library Crosswords MIA Reports Blogs Personal Stories Research News MIA Radio Online EventsOpen DialoguePsychiatric Drug Withdrawal Open Dialogue Psychiatric Drug Withdrawal Open Dialogue Psychiatric Drug Withdrawal Spotlight InitiativesCalendar Calendar Calendar The Arts Around The Web MIA Library Crosswords DrugsHow Psychotropics Act on the BrainRisks & Benefits/AdultsAntidepressantsAntipsychoticsAntidepressants in PregnancyRisks & Benefits/ChildrenADHD/stimulantsAntidepressantsAntipsychotics for Psychosis, Bipolar & MoreWithdrawal informationAntipsychoticsAntidepressantsScience NewsProvider DirectoryNon-Drug Therapies/AdultsAnxietyBipolar DisorderDepressionPsychotic DisordersPTSDNon-drug therapies/childrenADHDDepressionPsychosis, Bipolar & More How Psychotropics Act on the Brain Risks & Benefits/AdultsAntidepressantsAntipsychoticsAntidepressants in Pregnancy Antidepressants Antipsychotics Antidepressants in Pregnancy Risks & Benefits/ChildrenADHD/stimulantsAntidepressantsAntipsychotics for Psychosis, Bipolar & More ADHD/stimulants Antidepressants Antipsychotics for Psychosis, Bipolar & More Withdrawal informationAntipsychoticsAntidepressants Antipsychotics Antidepressants Science News Provider Directory Non-Drug Therapies/AdultsAnxietyBipolar DisorderDepressionPsychotic DisordersPTSD Anxiety Bipolar Disorder Depression Psychotic Disorders PTSD Non-drug therapies/childrenADHDDepressionPsychosis, Bipolar & More ADHD Depression Psychosis, Bipolar & More How Psychotropics Act on the Brain Risks & Benefits/AdultsAntidepressantsAntipsychoticsAntidepressants in Pregnancy Antidepressants Antipsychotics Antidepressants in Pregnancy Antidepressants Antipsychotics Antidepressants in Pregnancy Risks & Benefits/ChildrenADHD/stimulantsAntidepressantsAntipsychotics for Psychosis, Bipolar & More ADHD/stimulants Antidepressants Antipsychotics for Psychosis, Bipolar & More ADHD/stimulants Antidepressants Antipsychotics for Psychosis, Bipolar & More Withdrawal informationAntipsychoticsAntidepressants Antipsychotics Antidepressants Antipsychotics Antidepressants Science News Provider Directory Non-Drug Therapies/AdultsAnxietyBipolar DisorderDepressionPsychotic DisordersPTSD Anxiety Bipolar Disorder Depression Psychotic Disorders PTSD Anxiety Bipolar Disorder Depression Psychotic Disorders PTSD Non-drug therapies/childrenADHDDepressionPsychosis, Bipolar & More ADHD Depression Psychosis, Bipolar & More ADHD Depression Psychosis, Bipolar & More EDUCATION Veterans FamilyFamily Home PageOnline Support GroupQuestions and AnswersAntidepressants in Pregnancy Family Home Page Online Support Group Questions and Answers Antidepressants in Pregnancy Family Home Page Online Support Group Questions and Answers Antidepressants in Pregnancy MAD IN THE WORLD GET INVOLVEDSubmit a Personal StorySubmit a BlogMake a DonationSubscribe to our Newsletter Submit a Personal Story Submit a Blog Make a Donation Subscribe to our Newsletter Submit a Personal Story Submit a Blog Make a Donation Subscribe to our Newsletter ABOUTMissionStaffRobert WhitakerPosting GuidelinesFinancesContact UsSite Map Mission Staff Robert Whitaker Posting Guidelines Finances Contact Us Site Map Mission Staff Robert Whitaker Posting Guidelines Finances Contact Us Site Map Donor Login Donate EditorialMIA ReportsBlogsPersonal StoriesResearch NewsMIA RadioOnline EventsOpen DialoguePsychiatric Drug WithdrawalSpotlightInitiativesCalendarThe ArtsAround The WebMIA LibraryCrosswords MIA Reports Blogs Personal Stories Research News MIA Radio Online EventsOpen DialoguePsychiatric Drug Withdrawal Open Dialogue Psychiatric Drug Withdrawal Spotlight InitiativesCalendar Calendar The Arts Around The Web MIA Library Crosswords MIA Reports Blogs Personal Stories Research News MIA Radio Online EventsOpen DialoguePsychiatric Drug Withdrawal Open Dialogue Psychiatric Drug Withdrawal Open Dialogue Psychiatric Drug Withdrawal Spotlight InitiativesCalendar Calendar Calendar The Arts Around The Web MIA Library Crosswords DrugsHow Psychotropics Act on the BrainRisks & Benefits/AdultsAntidepressantsAntipsychoticsAntidepressants in PregnancyRisks & Benefits/ChildrenADHD/stimulantsAntidepressantsAntipsychotics for Psychosis, Bipolar & MoreWithdrawal informationAntipsychoticsAntidepressantsScience NewsProvider DirectoryNon-Drug Therapies/AdultsAnxietyBipolar DisorderDepressionPsychotic DisordersPTSDNon-drug therapies/childrenADHDDepressionPsychosis, Bipolar & More How Psychotropics Act on the Brain Risks & Benefits/AdultsAntidepressantsAntipsychoticsAntidepressants in Pregnancy Antidepressants Antipsychotics Antidepressants in Pregnancy Risks & Benefits/ChildrenADHD/stimulantsAntidepressantsAntipsychotics for Psychosis, Bipolar & More ADHD/stimulants Antidepressants Antipsychotics for Psychosis, Bipolar & More Withdrawal informationAntipsychoticsAntidepressants Antipsychotics Antidepressants Science News Provider Directory Non-Drug Therapies/AdultsAnxietyBipolar DisorderDepressionPsychotic DisordersPTSD Anxiety Bipolar Disorder Depression Psychotic Disorders PTSD Non-drug therapies/childrenADHDDepressionPsychosis, Bipolar & More ADHD Depression Psychosis, Bipolar & More How Psychotropics Act on the Brain Risks & Benefits/AdultsAntidepressantsAntipsychoticsAntidepressants in Pregnancy Antidepressants Antipsychotics Antidepressants in Pregnancy Antidepressants Antipsychotics Antidepressants in Pregnancy Risks & Benefits/ChildrenADHD/stimulantsAntidepressantsAntipsychotics for Psychosis, Bipolar & More ADHD/stimulants Antidepressants Antipsychotics for Psychosis, Bipolar & More ADHD/stimulants Antidepressants Antipsychotics for Psychosis, Bipolar & More Withdrawal informationAntipsychoticsAntidepressants Antipsychotics Antidepressants Antipsychotics Antidepressants Science News Provider Directory Non-Drug Therapies/AdultsAnxietyBipolar DisorderDepressionPsychotic DisordersPTSD Anxiety Bipolar Disorder Depression Psychotic Disorders PTSD Anxiety Bipolar Disorder Depression Psychotic Disorders PTSD Non-drug therapies/childrenADHDDepressionPsychosis, Bipolar & More ADHD Depression Psychosis, Bipolar & More ADHD Depression Psychosis, Bipolar & More EDUCATION Veterans FamilyFamily Home PageOnline Support GroupQuestions and AnswersAntidepressants in Pregnancy Family Home Page Online Support Group Questions and Answers Antidepressants in Pregnancy Family Home Page Online Support Group Questions and Answers Antidepressants in Pregnancy MAD IN THE WORLD GET INVOLVEDSubmit a Personal StorySubmit a BlogMake a DonationSubscribe to our Newsletter Submit a Personal Story Submit a Blog Make a Donation Subscribe to our Newsletter Submit a Personal Story Submit a Blog Make a Donation Subscribe to our Newsletter ABOUTMissionStaffRobert WhitakerPosting GuidelinesFinancesContact UsSite Map Mission Staff Robert Whitaker Posting Guidelines Finances Contact Us Site Map Mission Staff Robert Whitaker Posting Guidelines Finances Contact Us Site Map Donor Login Donate **Depsychiatrization: Dispelling Harmful, Diagnostical Self-Concepts in Therapy and Community Health Work** In this article I will be proposing an early framework for a mental health intervention calleddepsychiatrization. Depsychiatrization describes the processes by which a diagnosed individual learns to expel psychiatrically induced self-concepts and substitute them for more empowering and nurturing understandings. These processes are not, in themselves, entirely novel, as they have been a part of many alternative movements throughout time. It is the ambition behind this proposal to formalize a way of helping and supporting people who would benefit from depsychiatrization, as well as supplying a legitimizing platform to stand on for those who wish to encourage growth without pathology. Much has been written on the many ways in which psychiatry does harm to individuals seeking help for mental health issues: The medical treatments are far too often more harmful than beneficial, especially in the long run. The symptom-focused therapeutic treatments rarely produce sustainable outcomes leading to better lives. For instance, electroshock therapy is a disputed method at best, a harmful, medieval practice at worst. Yet we too rarely discuss the harm that psychiatric treatment does to a person’s self-concept and self-narrative. One of the purported positive effects of psychiatric diagnoses is the relief a person may feel when an expert tells them how and why they suffer. And this is sometimes true, at least in the short run. But what happens later, when the psychiatric diagnosis is ingrained in a person’s understanding of themself? What does it mean for an individual to perceive of themself as pathologically disordered in the mind? It is my contention that self-concepts stemming from psychiatric diagnoses do far more harm than good. The detrimental effects of learning to think of yourself in terms of mind-pathology affect all areas of life, including employment, relationships, parenthood, finances, self-worth, and the list goes on endlessly. The purpose of depsychiatrization is to remedy this harm. Depsychiatrization was not a method I developed intentionally. Rather, it originated as a byproduct of helping clients in therapy who had been dehumanized and gaslighted into thinking of themselves as disordered or sick. Being a public critical voice, I do tend to see many clients who’ve suffered at the hands of psychiatry, and in helping them I found the process of shedding psychiatrically induced ideas to be intertwined with the process of healing. Maybe the best way to explain the relevance of this novel concept is with illustrative cases. And none better to start with than the diagnoses labeledpersonality disorders. They comprise a group of diagnoses that do catastrophic damage to the person who is taught to identify with them. I was employed for two years in the Danish psychiatric system in an outpatient clinic treating people diagnosed with so-called personality disorders. In my two years of regrettable service I did not find anyone whose personality seemed to be disordered (whatever that means). The longer I spoke to my patients, the less sense their diagnoses made, and the more I came to understand their feelings and reactions as sensical and normal. I did not find any person whose personality seemed pathological. What I did find, however, was an abundance of traumatized, marginalized, discriminated, isolated, and oppressed people. Names and details have been anonymized in the following case-presentations. One of them, Lea, was diagnosed with borderline personality disorder. I was assigned as Lea’s therapist, and my official goal was to alleviate her of as many of her borderline symptoms as possible, and to educate her on mentalization and the ramification of her disordered personality. I opted instead to try to understand Lea. She did feel the diagnosis was a fit at first: She definitely wound up in many conflicts, she felt an emptiness inside, she did tend to feel abandoned and therefore preemptively reject others, but at the same time she felt a strong need for closeness, she did engage in frequent casual sex with men, she did engage in self-harmful practices. The diagnostic criteria seemed to fit the behavior. During the course of our year-and-a-half of therapy, we explored the many impacts that had shaped Lea’s so-called ‘symptoms’. Her mother had always told her that she’d inherited her troubled mind. Her father abandoned her when she was little. She’d been bullied a lot growing up and had learnt to compensate by making herself hard and confrontational. This side of her existed in conflict with a strongly empathetic side of her. The more we learned about Lea’s past and how she’d coped with instability and abuse, the more her present behavioral patterns made sense. And the more her patterns made sense, the better equipped we were to engage those parts of her that were in conflict within her. Lea did not want to bea badass border-bitch(her words, not mine) anymore. She wanted to feel feminine without feeling weak, and masculine without acting violently aggressively. She wanted to have friendships that were bidirectional, and not just about constantly putting out fires. And she wanted to experience love, actual love, where she’d dare let someone see those parts of her that she hid from other people. Those were the parts that we spent the most time engaging with in therapy. It took about a year’s time to lay the foundation for fundamental change towards these goals. One day as we sat quietly and gazed out my window, Lea told me after some thought:I’m not disordered… I’m traumatized. We’d discussed this several times before, but on this day the realization seemed to hit her as fully true. That day changed Lea’s life. Her journey towards healing was not done at this point, but something fundamental had shifted. She’d finally shed the psychiatric explanation for her reactions and embraced a contextualized, meaningful approach. We began to explore what else she was: Creative, caring, analytical, and also less flattering but equally important aspects. By and by she developed a nuanced and integrated understanding of herself that was defined neither by diagnoses nor trauma, but rather by just being Lea with all which that entailed, with a self-compassionate outlook on her previous (and sometimes present) modes of being in this world. The progress that Lea and I achieved would not have been possible if we’d worked within the established framework of psychiatric therapeutic treatment protocols. No protocol teaches you to like your patients, to care and root for them, and to embrace all their many ways of being themselves without judgment (and, indeed, without pathologizing). David had been depressed for a long time when I met him. The psychiatric treatment for his diagnosis—bipolar disorder—had little effect other than to quell some of his anxiety, which, admittedly, did serve to help him cope in the short run. After a few sessions I asked David: “Are you aware that you’re constantly monitoring your own mood?” He said: “Yes, of course, I’m deathly scared of becoming manic again! Or becoming depressed again, like I used to be. But I’ll probably kill myself if I become manic. I could never put my family and friends through that again!” His first manic episode occurred a few years after he’d started treatment for depression with SSRIs. This is not uncommon, as the number of manic episodes in the population has exploded since the introduction of so-called antidepressants (which, evidence-wise, can’t actually be said to be antidepressive). David was also under severe stress during the time when he experienced a manic episode: He tried to balance a fast-paced career, several hobbies, independent projects and many relationships all at once. The more we explored the circumstances of his mania, that more it made sense that his mind would launch into overdrive in an attempt to cope, even to a degree where he lost his grasp of reality. David and I did therapy in the sense that we collaborated on understanding his thoughts and feelings, both past and present. But we also did something else that was very helpful on its own: I providedtruepsychoeducation. Now, psychoeducation is usually taken to mean an expert explaining this or that about mental suffering, usually in the form of diagnoses and treatments. And few diagnoses are as adamantly claimed to be biological in nature (counter to all evidence) as much as bipolar disorder. David had been psychoeducated to accept his mood swings, mania and depressive episodes as hisneurologicalhard wiring. I told him that that was just plain wrong. That no one has ever established any such thing to be true for people diagnosed with bipolar disorder. Although David trusted in me, it took a while (and some reading on his own) before he accepted that I was right. That bipolar is indeed only a name psychiatry has for a certain type of behavior. This also led to a gradual discontinuation of the medical treatment with assistance from a Danish nonprofit that offers guidance on stepping down from psychopharmaceutical drugs. If bipolar is neither a chemical imbalance nor a brain dysfunction, then there is little reason in trying to ‘correct’ a non-existent problem. For David, depsychiatrization meant re-education on some of the fallacies and flat-out lies that patients are told during psychiatric treatment. This allowed him to oppose the instructions that he’d been given, including the hypermonitoring of his own mood. With his own words: “I’m no longer afraid to wake up in the morning. I don’t fear waking a little bit sad, and I don’t fear waking up a little bit glad. Those moods are natural, and it is unlikely that I will become psychotic or manic again, since my life has changed so much since I first collapsed”. “Do you have anything I can stir my coffee with?” she asked at the beginning of our very first session. I’d offered—as I usually do—instant coffee but had failed to provide anything to stir with. I answered “Yeah, sure, just grab that knife on the shelf right there and stir with the handle.” She froze. She froze long enough for me to notice. I sat down and waited. She did take the knife and stir her coffee, and as she sat, I asked her “It seemed something just happened. What was that?” She hesitated before saying: “I’m just so used to the idea that I’m dangerous that I couldn’t believe that you just offered me a knife”. Laura had been diagnosed with paranoid schizophrenia earlier in life. She’d been out of the system as well as out of medication for some years, but she’d never found peace with herself. She sought me out through recommendation from another therapist who thought I’d be a good match for the task at hand. This turned out to be true. As is true in almost all cases, that which psychiatry had labeled ‘paranoid schizophrenia’ was mostly trauma responses. Laura had had a rough childhood. She hadn’t ever really thought of herself as psychotic, but she did hear voices at a point in time. Psychiatric treatment did lessen the voice hearing to an extent, but along with the voices she lost a lot of herself. She fully internalized the idea that she was mentally ill and concluded that she was therefore a burden on her family, friends and society, leading to several suicide attempts. The medication made her unhealthy and uncaring, and she gave up on her dreams, including that of having a family of her own, a career and a happy relationship. In fact, she was told by several professionals that the outlook wasn’t positive with regards to those dreams. Hearing this part of her story, I reflected out loud: “Well, if anything’s gonna convince you to kill yourself, it’d be that: Being a diagnosed burden with no possibility of a better future”. Laura laughed at that. It even became a thing: “Here comes the burden!” she’d proclaim on entering my office. But it’s true: The way psychiatry defines e.g. voice hearing steals away hope, context and meaning, and it adds stigmatizing narratives such as the perceived danger of being around people diagnosed with schizophrenia. People who hear voices or have other extra-sensory experiences are not more dangerous than other people. The public just tend to hear that narrative a lot, whenever something tragic happens involving someone who is diagnosed. But voice hearing is neither dangerous nor uncommon. It’s a natural phenomenon that some experience to a higher and more manifest degree than others, especially those that are exposed to childhood trauma. Trauma-informed therapy was necessary to help Laura. She needed help to deal with the adverse experiences that had landed her in psychiatry in the first place. But first we needed to deal with a lot of the harm that psychiatry itself had done to her and her way of thinking about herself. This involved active participation by both family and friends, some of whom were invited to hear a very different story about Laura from the one where she was a paranoid schizophrenic. People fear what they don’t understand, and this unfortunately often goes for close relations as well as strangers. But hearing a story that you connect with and understand makes the other person’s mental distress familiar and natural, and it engages empathy and connectedness which are fundamental precursors for the kind of healing and comfort that only close relationships can provide. I could tell countless more cases like Lea’s, David’s and Laura’s. If you add onto those all of the cases that I’ve read and been told outside of therapy, then that strongly indicates a staggering universality in the way in which psychiatric treatment teaches patients to understand themselves in ways that are harmful and invalidating to them. It follows naturally that learning to dispel these (mis)understandings from the mind in a safe, supportive environment paves the way for other, more constructive and compassionate self-concepts. Depsychiatrization is thus not a battleagainstsomething as much as it is a battleforsomething: It is for the right to understand yourself as a normally reacting person who deserves to be understood on your own terms. I’ve mostly worked with depsychiatrization in individual therapy. I do believe, however, that the concept has just as much potential as a group intervention and even as a community intervention. In group therapy, it’d be possible to systematically undo the most common misconceptions spread by psychiatry in a setting where former (or current) patients would be safe and free to ask questions and be doubtful. It’d also be possible to work together on common themes that tend to arise with psychiatric internalization, for instance the loss of hope of any meaningful future. Depsychiatrization would lend itself perfectly to a group setting, where the group could also help each other mirror nonpathologizing perspectives on those sides of each group member that psychiatry has pathologized. As a community intervention, it’d be interesting to see what would happen if established institutions and organizations were to adopt a fully nonpathologizing approach. This would not necessarily entail the abrupt discontinuation of all collaboration with psychiatry, especially for practical reasons seeing as how psychiatry is almost universally involved in mental suffering in our day and age. But what would happen if mental health professionals outside of psychiatry rejected the legitimacy of diagnoses to say anything at all meaningful about the person we’re meant to help? Another form of nonpathologizing community intervention could be peer-run facilities. These do tend to be nonpathologizing in nature already, as they tend to grow out of a strong desire for creating a space to receive help that is not expert-driven, but rather driven by universal needs and rights that the mentally distressed individual has. I can strongly recommend looking up two places that I’ve come across during my time as an activist: Leeds Survivor-Led Crisis Service in England and The Wildflower Alliance in the US. Both places excel at offering something that is fundamentally different from pathologizing, and which allows the distressed person to grow and heal out of a pathologized self-concept. Depsychiatrization is not new, not in the sense that a lot of peer-run organizations already provide the space to achieve the same. The novelty in the concept lies in the distinct choice to formalize and label the process of dispelling those psychiatrically imposed self-narratives that do the most harm. It is a way of reclaiming the right to be understood through a nonpathologizing, rehumanized lens rather than as a pathologically afflicted, disordered patient. It is my hope that depsychiatrization will inspire and provide a platform for new discussions amongst professionals and those with lived experiences alike. *** Mad in America hosts blogs by a diverse group of writers. These posts are designed to serve as a public forum for a discussion—broadly speaking—of psychiatry and its treatments. The opinions expressed are the writers’ own. Jonas Vennike DitlevsenJune 3, 2025 at 4:52 pmHi everyone! I’m the author of this article. I’ll be following this piece up with a work-in-progress where I strive to unite voices across professional and lived experiences who wanna contribute to an anthology titled “Depsychiatrization”. I’ll be posting more on this via my Facebook-page tomorrow. It’s my hope that this concept can become part of meaningful change towards rehumanization and resistance towards dehumanization in the broader sense (and not just in the case of psyhicatric dehumanization through diagnoses). Bw, Jonas.Report commentReplyChristine BurnettJune 6, 2025 at 2:04 pmI agree with the points you may in the article. I would like to be of assistance in your goal of developing nonpathologizing understanding of psychological issues. I have professional experience but much of my knowledge come from lived experience. I, also, have anecdotal experience of providing accurate information that explains behavior and its impact, helps heal. Unfortunately, our current system isn’t doing that. I wrote a few articles for Mad in America. The last one explains how I developed a method of understanding not only my issues but how different perspectives and behavioral patterns develop. I agree that psychological issues don’t develop from abnormality period. I think an understanding of normal function is needed.Report commentReplyJonas Vennike DitlevsenJune 8, 2025 at 7:57 amI looked up a few of your articles for MiA; Phenomenal stuff! We’re trying to gather voices who’d wanna contribute to an anthology titled “Depsychiatrization” that explores the potential in abandoning psychiatrized understandings. We’ll be publishing a list of contributors on depsychiatrization.com ASAP. If you’re interested and you’ve got idea you can reach us at[email protected]Report commentReply Hi everyone! I’m the author of this article. I’ll be following this piece up with a work-in-progress where I strive to unite voices across professional and lived experiences who wanna contribute to an anthology titled “Depsychiatrization”. I’ll be posting more on this via my Facebook-page tomorrow. It’s my hope that this concept can become part of meaningful change towards rehumanization and resistance towards dehumanization in the broader sense (and not just in the case of psyhicatric dehumanization through diagnoses). Bw, Jonas. Report comment Christine BurnettJune 6, 2025 at 2:04 pmI agree with the points you may in the article. I would like to be of assistance in your goal of developing nonpathologizing understanding of psychological issues. I have professional experience but much of my knowledge come from lived experience. I, also, have anecdotal experience of providing accurate information that explains behavior and its impact, helps heal. Unfortunately, our current system isn’t doing that. I wrote a few articles for Mad in America. The last one explains how I developed a method of understanding not only my issues but how different perspectives and behavioral patterns develop. I agree that psychological issues don’t develop from abnormality period. I think an understanding of normal function is needed.Report commentReplyJonas Vennike DitlevsenJune 8, 2025 at 7:57 amI looked up a few of your articles for MiA; Phenomenal stuff! We’re trying to gather voices who’d wanna contribute to an anthology titled “Depsychiatrization” that explores the potential in abandoning psychiatrized understandings. We’ll be publishing a list of contributors on depsychiatrization.com ASAP. If you’re interested and you’ve got idea you can reach us at[email protected]Report commentReply I agree with the points you may in the article. I would like to be of assistance in your goal of developing nonpathologizing understanding of psychological issues. I have professional experience but much of my knowledge come from lived experience. I, also, have anecdotal experience of providing accurate information that explains behavior and its impact, helps heal. Unfortunately, our current system isn’t doing that. I wrote a few articles for Mad in America. The last one explains how I developed a method of understanding not only my issues but how different perspectives and behavioral patterns develop. I agree that psychological issues don’t develop from abnormality period. I think an understanding of normal function is needed. Report comment Jonas Vennike DitlevsenJune 8, 2025 at 7:57 amI looked up a few of your articles for MiA; Phenomenal stuff! We’re trying to gather voices who’d wanna contribute to an anthology titled “Depsychiatrization” that explores the potential in abandoning psychiatrized understandings. We’ll be publishing a list of contributors on depsychiatrization.com ASAP. If you’re interested and you’ve got idea you can reach us at[email protected]Report commentReply I looked up a few of your articles for MiA; Phenomenal stuff! We’re trying to gather voices who’d wanna contribute to an anthology titled “Depsychiatrization” that explores the potential in abandoning psychiatrized understandings. We’ll be publishing a list of contributors on depsychiatrization.com ASAP. If you’re interested and you’ve got idea you can reach us at[email protected] Report comment Hi everyone! I’m the author of this article. I’ll be following this piece up with a work-in-progress where I strive to unite voices across professional and lived experiences who wanna contribute to an anthology titled “Depsychiatrization”. I’ll be posting more on this via my Facebook-page tomorrow. It’s my hope that this concept can become part of meaningful change towards rehumanization and resistance towards dehumanization in the broader sense (and not just in the case of psyhicatric dehumanization through diagnoses). Bw, Jonas. Report comment Christine BurnettJune 6, 2025 at 2:04 pmI agree with the points you may in the article. I would like to be of assistance in your goal of developing nonpathologizing understanding of psychological issues. I have professional experience but much of my knowledge come from lived experience. I, also, have anecdotal experience of providing accurate information that explains behavior and its impact, helps heal. Unfortunately, our current system isn’t doing that. I wrote a few articles for Mad in America. The last one explains how I developed a method of understanding not only my issues but how different perspectives and behavioral patterns develop. I agree that psychological issues don’t develop from abnormality period. I think an understanding of normal function is needed.Report commentReplyJonas Vennike DitlevsenJune 8, 2025 at 7:57 amI looked up a few of your articles for MiA; Phenomenal stuff! We’re trying to gather voices who’d wanna contribute to an anthology titled “Depsychiatrization” that explores the potential in abandoning psychiatrized understandings. We’ll be publishing a list of contributors on depsychiatrization.com ASAP. If you’re interested and you’ve got idea you can reach us at[email protected]Report commentReply I agree with the points you may in the article. I would like to be of assistance in your goal of developing nonpathologizing understanding of psychological issues. I have professional experience but much of my knowledge come from lived experience. I, also, have anecdotal experience of providing accurate information that explains behavior and its impact, helps heal. Unfortunately, our current system isn’t doing that. I wrote a few articles for Mad in America. The last one explains how I developed a method of understanding not only my issues but how different perspectives and behavioral patterns develop. I agree that psychological issues don’t develop from abnormality period. I think an understanding of normal function is needed. Report comment Jonas Vennike DitlevsenJune 8, 2025 at 7:57 amI looked up a few of your articles for MiA; Phenomenal stuff! We’re trying to gather voices who’d wanna contribute to an anthology titled “Depsychiatrization” that explores the potential in abandoning psychiatrized understandings. We’ll be publishing a list of contributors on depsychiatrization.com ASAP. If you’re interested and you’ve got idea you can reach us at[email protected]Report commentReply I looked up a few of your articles for MiA; Phenomenal stuff! We’re trying to gather voices who’d wanna contribute to an anthology titled “Depsychiatrization” that explores the potential in abandoning psychiatrized understandings. We’ll be publishing a list of contributors on depsychiatrization.com ASAP. If you’re interested and you’ve got idea you can reach us at[email protected] Report comment I agree with the points you may in the article. I would like to be of assistance in your goal of developing nonpathologizing understanding of psychological issues. I have professional experience but much of my knowledge come from lived experience. I, also, have anecdotal experience of providing accurate information that explains behavior and its impact, helps heal. Unfortunately, our current system isn’t doing that. I wrote a few articles for Mad in America. The last one explains how I developed a method of understanding not only my issues but how different perspectives and behavioral patterns develop. I agree that psychological issues don’t develop from abnormality period. I think an understanding of normal function is needed. Report comment Jonas Vennike DitlevsenJune 8, 2025 at 7:57 amI looked up a few of your articles for MiA; Phenomenal stuff! We’re trying to gather voices who’d wanna contribute to an anthology titled “Depsychiatrization” that explores the potential in abandoning psychiatrized understandings. We’ll be publishing a list of contributors on depsychiatrization.com ASAP. If you’re interested and you’ve got idea you can reach us at[email protected]Report commentReply I looked up a few of your articles for MiA; Phenomenal stuff! We’re trying to gather voices who’d wanna contribute to an anthology titled “Depsychiatrization” that explores the potential in abandoning psychiatrized understandings. We’ll be publishing a list of contributors on depsychiatrization.com ASAP. If you’re interested and you’ve got idea you can reach us at[email protected] Report comment I looked up a few of your articles for MiA; Phenomenal stuff! We’re trying to gather voices who’d wanna contribute to an anthology titled “Depsychiatrization” that explores the potential in abandoning psychiatrized understandings. We’ll be publishing a list of contributors on depsychiatrization.com ASAP. If you’re interested and you’ve got idea you can reach us at[email protected] Report comment Katie DempseyJune 3, 2025 at 9:35 pmGreat article and I enjoyed reading the case studies. The quote “voice hearing is neither dangerous nor uncommon. It’s a natural phenomenon that some experience to a higher and more manifest degree than others, especially those that are exposed to childhood trauma” was interesting to me, as my research into this movement has led me to some very interesting cross-cultural research into what we in the west call schizophrenia. The most illuminating is when I stumbled upon research that showed that in East Asian countries where there is a strong spirituality and cultural tradition related to hearing voices of ancestors. There are people in these countries who report hearing voices that aren’t there, but they are not particularly scared of or bothered by the voices, as they believe they are the voices of their ancestor spirits. The voices usually nag them about things in their lives they could be improving – clean the house more, eat less junk. I think this could be such a crucial distinction for people in western countries dealing with ‘medicalized’ schizophrenia, that they are ‘dangerously crazy with a broken brain’. It’s more- listen, nothing is wrong with your brain. if you grew up in China, maybe you would be fine, just with nagging ancestor spirits. You just were not given a positive framework to hear the voices – and combined with trauma, it was just some very bad luck .I would also add that another positive nonpathologizing community intervention could be increased case management support for anyone who needs it. I have worked in community mental health clinics in America providing case management to individuals receiving mental health treatment, who are also living in poverty and receiving state insurance/ medicaid. The biggest issues these people were dealing with were related to systemic issues that go along with poverty and associated issues – criminal justice involvement that wealthier people don’t have to deal with like charges for marijuana possession, drunk driving, etc, being targeted for living in low income areas ; transportation issues making it hard to keep a job or get to any appointments; literacy issues related to filling out paperwork or maintaining benefits; for women, child custody battles and abusive partners; difficulties navigating housing subsidy applications and keeping up with paperwork and rent in keeping the subsidies etc etc etc. None of these issues have anything to do with ‘mental illness’ and I often felt my case management work in helping people pay their rent was a lot more useful than the nebulous therapy/psychiatry they were also receiving at my agency.Report commentReplyJonas Vennike DitlevsenJune 6, 2025 at 2:42 amYes!! Yes to all of the above. I recently attended a lecture by a psychologist who’d spent some time across East Asia trying to understand that phenomenon which psychiatry calls ‘schizophrenia’. In more spritually inclined cultures, it’d be considered insanity to try to combat voice hearing with strong pharmaceuticals. It’s just a natural part of life that some people come into contact with the spirit world. A less spiritual but equally normalizing perspective is found in the Voice Hearing Network where voice hearing is seen as a meaningful response to something in the context of life.Also hard agree on case management support. I worked with youth removed from home for a while, and what they needed most was neither therapy nor treatment. They needed a roof, safe place, someone who could translate government communicatino for them, money, jobs, hobbies (community), a playstation buddy… Sure, many of them wound up in psychiatry once old enough. But they problems never stemmed from a vaguely defined mental illness. It always made sense in contextReport commentReply Great article and I enjoyed reading the case studies. The quote “voice hearing is neither dangerous nor uncommon. It’s a natural phenomenon that some experience to a higher and more manifest degree than others, especially those that are exposed to childhood trauma” was interesting to me, as my research into this movement has led me to some very interesting cross-cultural research into what we in the west call schizophrenia. The most illuminating is when I stumbled upon research that showed that in East Asian countries where there is a strong spirituality and cultural tradition related to hearing voices of ancestors. There are people in these countries who report hearing voices that aren’t there, but they are not particularly scared of or bothered by the voices, as they believe they are the voices of their ancestor spirits. The voices usually nag them about things in their lives they could be improving – clean the house more, eat less junk. I think this could be such a crucial distinction for people in western countries dealing with ‘medicalized’ schizophrenia, that they are ‘dangerously crazy with a broken brain’. It’s more- listen, nothing is wrong with your brain. if you grew up in China, maybe you would be fine, just with nagging ancestor spirits. You just were not given a positive framework to hear the voices – and combined with trauma, it was just some very bad luck . I would also add that another positive nonpathologizing community intervention could be increased case management support for anyone who needs it. I have worked in community mental health clinics in America providing case management to individuals receiving mental health treatment, who are also living in poverty and receiving state insurance/ medicaid. The biggest issues these people were dealing with were related to systemic issues that go along with poverty and associated issues – criminal justice involvement that wealthier people don’t have to deal with like charges for marijuana possession, drunk driving, etc, being targeted for living in low income areas ; transportation issues making it hard to keep a job or get to any appointments; literacy issues related to filling out paperwork or maintaining benefits; for women, child custody battles and abusive partners; difficulties navigating housing subsidy applications and keeping up with paperwork and rent in keeping the subsidies etc etc etc. None of these issues have anything to do with ‘mental illness’ and I often felt my case management work in helping people pay their rent was a lot more useful than the nebulous therapy/psychiatry they were also receiving at my agency. Report comment Jonas Vennike DitlevsenJune 6, 2025 at 2:42 amYes!! Yes to all of the above. I recently attended a lecture by a psychologist who’d spent some time across East Asia trying to understand that phenomenon which psychiatry calls ‘schizophrenia’. In more spritually inclined cultures, it’d be considered insanity to try to combat voice hearing with strong pharmaceuticals. It’s just a natural part of life that some people come into contact with the spirit world. A less spiritual but equally normalizing perspective is found in the Voice Hearing Network where voice hearing is seen as a meaningful response to something in the context of life.Also hard agree on case management support. I worked with youth removed from home for a while, and what they needed most was neither therapy nor treatment. They needed a roof, safe place, someone who could translate government communicatino for them, money, jobs, hobbies (community), a playstation buddy… Sure, many of them wound up in psychiatry once old enough. But they problems never stemmed from a vaguely defined mental illness. It always made sense in contextReport commentReply Yes!! Yes to all of the above. I recently attended a lecture by a psychologist who’d spent some time across East Asia trying to understand that phenomenon which psychiatry calls ‘schizophrenia’. In more spritually inclined cultures, it’d be considered insanity to try to combat voice hearing with strong pharmaceuticals. It’s just a natural part of life that some people come into contact with the spirit world. A less spiritual but equally normalizing perspective is found in the Voice Hearing Network where voice hearing is seen as a meaningful response to something in the context of life. Also hard agree on case management support. I worked with youth removed from home for a while, and what they needed most was neither therapy nor treatment. They needed a roof, safe place, someone who could translate government communicatino for them, money, jobs, hobbies (community), a playstation buddy… Sure, many of them wound up in psychiatry once old enough. But they problems never stemmed from a vaguely defined mental illness. It always made sense in context Report comment Great article and I enjoyed reading the case studies. The quote “voice hearing is neither dangerous nor uncommon. It’s a natural phenomenon that some experience to a higher and more manifest degree than others, especially those that are exposed to childhood trauma” was interesting to me, as my research into this movement has led me to some very interesting cross-cultural research into what we in the west call schizophrenia. The most illuminating is when I stumbled upon research that showed that in East Asian countries where there is a strong spirituality and cultural tradition related to hearing voices of ancestors. There are people in these countries who report hearing voices that aren’t there, but they are not particularly scared of or bothered by the voices, as they believe they are the voices of their ancestor spirits. The voices usually nag them about things in their lives they could be improving – clean the house more, eat less junk. I think this could be such a crucial distinction for people in western countries dealing with ‘medicalized’ schizophrenia, that they are ‘dangerously crazy with a broken brain’. It’s more- listen, nothing is wrong with your brain. if you grew up in China, maybe you would be fine, just with nagging ancestor spirits. You just were not given a positive framework to hear the voices – and combined with trauma, it was just some very bad luck . I would also add that another positive nonpathologizing community intervention could be increased case management support for anyone who needs it. I have worked in community mental health clinics in America providing case management to individuals receiving mental health treatment, who are also living in poverty and receiving state insurance/ medicaid. The biggest issues these people were dealing with were related to systemic issues that go along with poverty and associated issues – criminal justice involvement that wealthier people don’t have to deal with like charges for marijuana possession, drunk driving, etc, being targeted for living in low income areas ; transportation issues making it hard to keep a job or get to any appointments; literacy issues related to filling out paperwork or maintaining benefits; for women, child custody battles and abusive partners; difficulties navigating housing subsidy applications and keeping up with paperwork and rent in keeping the subsidies etc etc etc. None of these issues have anything to do with ‘mental illness’ and I often felt my case management work in helping people pay their rent was a lot more useful than the nebulous therapy/psychiatry they were also receiving at my agency. Report comment Jonas Vennike DitlevsenJune 6, 2025 at 2:42 amYes!! Yes to all of the above. I recently attended a lecture by a psychologist who’d spent some time across East Asia trying to understand that phenomenon which psychiatry calls ‘schizophrenia’. In more spritually inclined cultures, it’d be considered insanity to try to combat voice hearing with strong pharmaceuticals. It’s just a natural part of life that some people come into contact with the spirit world. A less spiritual but equally normalizing perspective is found in the Voice Hearing Network where voice hearing is seen as a meaningful response to something in the context of life.Also hard agree on case management support. I worked with youth removed from home for a while, and what they needed most was neither therapy nor treatment. They needed a roof, safe place, someone who could translate government communicatino for them, money, jobs, hobbies (community), a playstation buddy… Sure, many of them wound up in psychiatry once old enough. But they problems never stemmed from a vaguely defined mental illness. It always made sense in contextReport commentReply Yes!! Yes to all of the above. I recently attended a lecture by a psychologist who’d spent some time across East Asia trying to understand that phenomenon which psychiatry calls ‘schizophrenia’. In more spritually inclined cultures, it’d be considered insanity to try to combat voice hearing with strong pharmaceuticals. It’s just a natural part of life that some people come into contact with the spirit world. A less spiritual but equally normalizing perspective is found in the Voice Hearing Network where voice hearing is seen as a meaningful response to something in the context of life. Also hard agree on case management support. I worked with youth removed from home for a while, and what they needed most was neither therapy nor treatment. They needed a roof, safe place, someone who could translate government communicatino for them, money, jobs, hobbies (community), a playstation buddy… Sure, many of them wound up in psychiatry once old enough. But they problems never stemmed from a vaguely defined mental illness. It always made sense in context Report comment Yes!! Yes to all of the above. I recently attended a lecture by a psychologist who’d spent some time across East Asia trying to understand that phenomenon which psychiatry calls ‘schizophrenia’. In more spritually inclined cultures, it’d be considered insanity to try to combat voice hearing with strong pharmaceuticals. It’s just a natural part of life that some people come into contact with the spirit world. A less spiritual but equally normalizing perspective is found in the Voice Hearing Network where voice hearing is seen as a meaningful response to something in the context of life. Also hard agree on case management support. I worked with youth removed from home for a while, and what they needed most was neither therapy nor treatment. They needed a roof, safe place, someone who could translate government communicatino for them, money, jobs, hobbies (community), a playstation buddy… Sure, many of them wound up in psychiatry once old enough. But they problems never stemmed from a vaguely defined mental illness. It always made sense in context Report comment Someone ElseJune 4, 2025 at 11:18 pmI do agree that society should “depsychiatrize,” since their “bible” was debunked as “invalid,” by the head of the NIMH in 2013, as well as being confessed to be “BS” by the head editor(s) of the DSM(s).And those of us here all know that the psych industries’ neurotoxins, can and do create the symptoms of their DSM “disorders.” (Please see my prior comments on MiA if you’d like to see my links to prove this.)Report commentReplyJonas Vennike DitlevsenJune 6, 2025 at 2:44 amAbsolutely. You needn’t fit a tin foil hat in order to realize that pharmaceutical industries have a major interest in adding or maintaing enough symptoms to warrant more drug use. Psychiatry is in itself a poorly founded endeavor, but adding the unholy alliance with pharma just makes for a catastrophic system.Report commentReply I do agree that society should “depsychiatrize,” since their “bible” was debunked as “invalid,” by the head of the NIMH in 2013, as well as being confessed to be “BS” by the head editor(s) of the DSM(s). And those of us here all know that the psych industries’ neurotoxins, can and do create the symptoms of their DSM “disorders.” (Please see my prior comments on MiA if you’d like to see my links to prove this.) Report comment Jonas Vennike DitlevsenJune 6, 2025 at 2:44 amAbsolutely. You needn’t fit a tin foil hat in order to realize that pharmaceutical industries have a major interest in adding or maintaing enough symptoms to warrant more drug use. Psychiatry is in itself a poorly founded endeavor, but adding the unholy alliance with pharma just makes for a catastrophic system.Report commentReply Absolutely. You needn’t fit a tin foil hat in order to realize that pharmaceutical industries have a major interest in adding or maintaing enough symptoms to warrant more drug use. Psychiatry is in itself a poorly founded endeavor, but adding the unholy alliance with pharma just makes for a catastrophic system. Report comment I do agree that society should “depsychiatrize,” since their “bible” was debunked as “invalid,” by the head of the NIMH in 2013, as well as being confessed to be “BS” by the head editor(s) of the DSM(s). And those of us here all know that the psych industries’ neurotoxins, can and do create the symptoms of their DSM “disorders.” (Please see my prior comments on MiA if you’d like to see my links to prove this.) Report comment Jonas Vennike DitlevsenJune 6, 2025 at 2:44 amAbsolutely. You needn’t fit a tin foil hat in order to realize that pharmaceutical industries have a major interest in adding or maintaing enough symptoms to warrant more drug use. Psychiatry is in itself a poorly founded endeavor, but adding the unholy alliance with pharma just makes for a catastrophic system.Report commentReply Absolutely. You needn’t fit a tin foil hat in order to realize that pharmaceutical industries have a major interest in adding or maintaing enough symptoms to warrant more drug use. Psychiatry is in itself a poorly founded endeavor, but adding the unholy alliance with pharma just makes for a catastrophic system. Report comment Absolutely. You needn’t fit a tin foil hat in order to realize that pharmaceutical industries have a major interest in adding or maintaing enough symptoms to warrant more drug use. Psychiatry is in itself a poorly founded endeavor, but adding the unholy alliance with pharma just makes for a catastrophic system. Report comment Moyu Watari-AlvarezJune 6, 2025 at 5:30 amDear Jonas Vennike Ditlevsen,Thank you for your article.I have received psychiatric care in Germany since 2010, when I experienced my first psychotic episode. Since then, I have been admitted to psychiatric clinics four times: Three times due to acute psychosis (in 2010, 2018, and 2019), and once due to burnout this year.My experiences in psychiatric care have varied greatly depending on whether I was recovering from psychosis or burnout.For the past eight years, I have had a trusting relationship with my psychiatrist, who treats me as an equal.From my personal perspective, I believe that psychiatry can be helpful, empowering, and healing. My diagnoses do not stand in my way.That’s why I consider the question of what is meant by “psychiatry” and “depsychiatrization” urgent and important.When I first read your article, I found myself hoping for a more nuanced view of these terms. Perhaps one that reflects the diversity and complexity of people’s experiences with psychiatric care.Best wishes,MoyuReport commentReplyCatJune 7, 2025 at 9:15 pmDear Moyu,Consider this hypothetical: if your mother was prescribed Thalidomide during her pregnancy and you were fortunate enough to be born without any physical impairments—unlike the numerous infants who suffered severe congenital malformations—would you still endorse the use of that drug? This scenario mirrors the criticisms levied against the field of psychiatry. While you may perceive your experiences, including your ongoing relationship with a psychiatrist and hospitalisation, as beneficial or “empowering,” it’s critical to acknowledge that countless individuals have faced significant harm, enduring disabilities, or even fatalities as a result of psychiatric interventions, including unborn children exposed to psychiatric drugs.It may be worthwhile for you to reflect on the complexities and ethical considerations inherent in this field.Kind regards,CatReport commentReplyMoyu Watari-AlvarezJune 8, 2025 at 3:55 amDear Cat,Thank you for your response.I’m wondering how you intended the comparison between psychiatry and the chemical substance thalidomide to work. The composition of a substance never changes, regardless of time or place. However, this does not align with my experience of psychiatry.To me, it is first and foremost a human construct and a product of human relationships. This is why I believe it is important to consider how we understand and interpret it. In my view, neither psychiatry nor diagnoses are inherently problematic. What matters is how they are practised and experienced.Of course, there are structural and individual issues in psychiatric care. It is crucial that platforms such as Mad in America exist to provide a space for justified and often necessary criticism. I have had very different experiences myself, and I know many people who have experienced little to no healing through psychiatry.For this reason, I hope Mad in America fosters discussion not only among like-minded critics, but also with those who have different views — including the professionals who are often criticised. Shouldn’t we stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management?Perhaps we ultimately mean the same thing and I simply did not express myself clearly enough in my original comment.Best wishes,MoyuReport commentReplySteve McCreaJune 8, 2025 at 12:51 pmI’m not sure psychiatry can be transformed into anything other than what it has become. I see too many conflicts of interest and too much money being made by the status quo. Having been a professional dissenter within the system, I can say that there seemed to be very little interest in changing despite demonstrating the effectiveness of a different approach. I could only conclude that healing is NOT a priority of the psychiatric system, and in fact, they tend to find it threatening to their prerogatives. The investment in biological theories of “mental illness” was so intense as to approach obsession in many, and attempts to soften it, I found, were more than unwelcome. How do you change a system whose basic intent is not to heal but to control?Report commentReplyMoyu Watari-AlvarezJune 8, 2025 at 4:06 pmDear Steve McCrea,Thank you for your reply, too.Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously.I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue.Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany.I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors.That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change.Best wishes,MoyuReport commentSteve McCreaJune 8, 2025 at 5:08 pmI hope we get to read it soon. That sounds like the kind of care we need to see encouraged!Report commentBirdsongJune 8, 2025 at 2:46 pmMoyu, if you’re interested in meaningfully broadening your perspective regarding critical psychiatry, I highly recommend the following video: “This Psychiatrist Says Chemical Imbalance is a Lie”, an interview with Dr. Joanna Moncrieff from Dr. Josef Witt-Doerring’s video series on the psychiatric profession, its drugs, and the obstacles and challenges many people face when trying to taper from psychiatric drugs.Report commentReplyCatJune 8, 2025 at 8:50 pmDear Moyu,I disagree with your thesis that “psychiatry nor diagnoses are (not) inherently problematic.” I previously compared prescribing Thalidomide to psychiatry because, like the irreversible damage Thalidomide causes, psychiatric practices also cause severe, and often irreversible damage, including to unborn humans and animals (Zanni, G., et al, 2025).Psychiatric diagnoses are not physical diseases of the brain; they are a “myth” (Szasz, T. 1961) of circular reasoning fallacy. They have no known biological origin, nor are there any tests to provide independent objective data in support of any psychiatric diagnosis (CEP, 2014). Psychiatry continually fails to identify and confirm any physical or chemical abnormality as a psychiatric ‘illness’ according to the Virchowian standard of disease (Breeding, J. 2014). If an individual exhibits multiple symptoms attributed to a ‘disorder’ from the Diagnostic and Statistical Manual, Fifth Edition, Text Revision (American Psychiatric Association., 2022) psychiatrists can diagnose them with a ‘mental illness’. Psychiatry alleges a person has a ‘mental illness’ because they display symptoms of an unproven condition; a form of circular logic that fails to identify or explain the cause of any diagnosis (Burstow, B., 2016).The foundational approach to psychiatric treatment involves brain-disabling interventions such as tranquillisers, stimulants, hallucinogens and painkillers that do not correct or improve the alleged brain dysfunction (Breggin, P. 1991). Wrongly labelled as ‘antidepressants’, ‘antipsychotics’, ‘mood stabilisers’ or ‘ADHD medication’ (Cima, R., 2025), these drugs cause a host of serious side effects, including emotional and behavioural alterations, chronic brain impairment and atrophy, chronic illness, neurotoxicity, addiction, akathisia, tardive dyskinesia, disability and premature death (Whitaker, R. 2010, Breggin, P. 1991, & Gotzsche, P. et al, 2015).The American Psychiatric Association claims that electroshock is superior to brain-disabling drugs for a variety of unproven ‘mental illnesses’, yet it admits that the distinct mechanisms by which it wields its consequences are “elusive” (Kritzer, M.D., et al, 2023, & Deng, Z.D., et al, 2023). Electroshock involves applying electricity to the brain of an anaesthetised individual through electrodes to induce a tonic-clonic seizure. It causes individuals to experience impaired judgment, headache, loss of personality, cardiac difficulties, emotional instability, nausea, temporary or enduring memory loss, stroke, disorientation, prolonged seizures, confusion, and death. The results worsen and are perpetual as they continue to be administered (Gotzsche, P., 2023; & Breggin, P.,1994).During psychiatric hospitalisation, an individual can legally be subjected to indefinite incarceration, physical and manual restraint, chemical restraint using brain-damaging drugs, solitary confinement, neurosurgery, and electroshock treatment. Psychiatric incarceration breaches the internationally ratified Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (United Nations, 1984) and the Convention on the Rights of Persons with Disability (United Nations, 2006). Furthermore, suicide in ‘mental health’ or psychiatric hospitals is fifty times higher than in the general population (Chammas, F., et al, 2022), and previous inpatients have suicide rates that are around thirty times greater than international rates (Chung, D. T., 2017).Whilst Thalidomide’s composition never changes, neither does psychiatry’s- it always causes harm. We should not “stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management.” Psychiatry is beyond repair and must be abolished. Furthermore, Mad In America is one of the few platforms that are brave enough to criticise psychiatry. People with “different views” and “professionals who are often criticised” have plenty of support from mainstream propaganda outlets.Kind regards,CatReport commentReplyJonas Vennike DitlevsenJune 8, 2025 at 8:00 amI would, akin to @Cat, argue that whereas it absolutely is possible to receive genuinely good care within the psychiatric system, that is a result of a dissenting few working within the system. There defintitely are employees who offer compassion, understanding and equal footing. But the system and its underlying logic work in opposition to equality and empowerment. The pathologization of mental distress is a severe barrier to furthering our understanding of how to help people thrive.Report commentReplySteve McCreaJune 8, 2025 at 12:46 pmHaving been one of those dissenters, I can tell you that they get a lot of crap for offering compassion, understanding and equal footing. Those in charge seem to be categorically opposed to anything that empowers clients!Report commentReplyMoyu Watari-AlvarezJune 10, 2025 at 4:07 amThank you all again for your thoughtful feedback and references.I would just like to clarify that I am not claiming that psychiatry has never caused irreversible harm, nor that the call for depsychiatrisation presented in the article is unjustified.However, when I reflect on the history of psychiatry in Germany, I recognise significant developments over the past 80 to 90 years. These range from the systematic killing of people with mental health conditions and disabilities under the Nazi regime to the Psychiatrie-Enquete of the 1970s, which initiated important deinstitutionalisation reforms and a shift towards more patient-centred care. More recently, the S3 Guidelines on Schizophrenia have acknowledged the importance of quality of life for those affected and recommended using the lowest possible dose of neuroleptics.Such progress would hardly have been possible without the persistent efforts of psychiatry’s critics. This is precisely why I think it’s important that everyone is free to live life as they personally see fit. Our social fabric depends on a diversity of opinions and beliefs, shaped by individual experiences, hopes and expectations. Ultimately, only what proves to be sustainable will endure, whatever ‘sustainable’ may mean in this context.Report commentReply Dear Jonas Vennike Ditlevsen, Thank you for your article. I have received psychiatric care in Germany since 2010, when I experienced my first psychotic episode. Since then, I have been admitted to psychiatric clinics four times: Three times due to acute psychosis (in 2010, 2018, and 2019), and once due to burnout this year. My experiences in psychiatric care have varied greatly depending on whether I was recovering from psychosis or burnout. For the past eight years, I have had a trusting relationship with my psychiatrist, who treats me as an equal. From my personal perspective, I believe that psychiatry can be helpful, empowering, and healing. My diagnoses do not stand in my way. That’s why I consider the question of what is meant by “psychiatry” and “depsychiatrization” urgent and important. When I first read your article, I found myself hoping for a more nuanced view of these terms. Perhaps one that reflects the diversity and complexity of people’s experiences with psychiatric care. Best wishes,Moyu Report comment CatJune 7, 2025 at 9:15 pmDear Moyu,Consider this hypothetical: if your mother was prescribed Thalidomide during her pregnancy and you were fortunate enough to be born without any physical impairments—unlike the numerous infants who suffered severe congenital malformations—would you still endorse the use of that drug? This scenario mirrors the criticisms levied against the field of psychiatry. While you may perceive your experiences, including your ongoing relationship with a psychiatrist and hospitalisation, as beneficial or “empowering,” it’s critical to acknowledge that countless individuals have faced significant harm, enduring disabilities, or even fatalities as a result of psychiatric interventions, including unborn children exposed to psychiatric drugs.It may be worthwhile for you to reflect on the complexities and ethical considerations inherent in this field.Kind regards,CatReport commentReplyMoyu Watari-AlvarezJune 8, 2025 at 3:55 amDear Cat,Thank you for your response.I’m wondering how you intended the comparison between psychiatry and the chemical substance thalidomide to work. The composition of a substance never changes, regardless of time or place. However, this does not align with my experience of psychiatry.To me, it is first and foremost a human construct and a product of human relationships. This is why I believe it is important to consider how we understand and interpret it. In my view, neither psychiatry nor diagnoses are inherently problematic. What matters is how they are practised and experienced.Of course, there are structural and individual issues in psychiatric care. It is crucial that platforms such as Mad in America exist to provide a space for justified and often necessary criticism. I have had very different experiences myself, and I know many people who have experienced little to no healing through psychiatry.For this reason, I hope Mad in America fosters discussion not only among like-minded critics, but also with those who have different views — including the professionals who are often criticised. Shouldn’t we stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management?Perhaps we ultimately mean the same thing and I simply did not express myself clearly enough in my original comment.Best wishes,MoyuReport commentReplySteve McCreaJune 8, 2025 at 12:51 pmI’m not sure psychiatry can be transformed into anything other than what it has become. I see too many conflicts of interest and too much money being made by the status quo. Having been a professional dissenter within the system, I can say that there seemed to be very little interest in changing despite demonstrating the effectiveness of a different approach. I could only conclude that healing is NOT a priority of the psychiatric system, and in fact, they tend to find it threatening to their prerogatives. The investment in biological theories of “mental illness” was so intense as to approach obsession in many, and attempts to soften it, I found, were more than unwelcome. How do you change a system whose basic intent is not to heal but to control?Report commentReplyMoyu Watari-AlvarezJune 8, 2025 at 4:06 pmDear Steve McCrea,Thank you for your reply, too.Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously.I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue.Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany.I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors.That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change.Best wishes,MoyuReport commentSteve McCreaJune 8, 2025 at 5:08 pmI hope we get to read it soon. That sounds like the kind of care we need to see encouraged!Report commentBirdsongJune 8, 2025 at 2:46 pmMoyu, if you’re interested in meaningfully broadening your perspective regarding critical psychiatry, I highly recommend the following video: “This Psychiatrist Says Chemical Imbalance is a Lie”, an interview with Dr. Joanna Moncrieff from Dr. Josef Witt-Doerring’s video series on the psychiatric profession, its drugs, and the obstacles and challenges many people face when trying to taper from psychiatric drugs.Report commentReplyCatJune 8, 2025 at 8:50 pmDear Moyu,I disagree with your thesis that “psychiatry nor diagnoses are (not) inherently problematic.” I previously compared prescribing Thalidomide to psychiatry because, like the irreversible damage Thalidomide causes, psychiatric practices also cause severe, and often irreversible damage, including to unborn humans and animals (Zanni, G., et al, 2025).Psychiatric diagnoses are not physical diseases of the brain; they are a “myth” (Szasz, T. 1961) of circular reasoning fallacy. They have no known biological origin, nor are there any tests to provide independent objective data in support of any psychiatric diagnosis (CEP, 2014). Psychiatry continually fails to identify and confirm any physical or chemical abnormality as a psychiatric ‘illness’ according to the Virchowian standard of disease (Breeding, J. 2014). If an individual exhibits multiple symptoms attributed to a ‘disorder’ from the Diagnostic and Statistical Manual, Fifth Edition, Text Revision (American Psychiatric Association., 2022) psychiatrists can diagnose them with a ‘mental illness’. Psychiatry alleges a person has a ‘mental illness’ because they display symptoms of an unproven condition; a form of circular logic that fails to identify or explain the cause of any diagnosis (Burstow, B., 2016).The foundational approach to psychiatric treatment involves brain-disabling interventions such as tranquillisers, stimulants, hallucinogens and painkillers that do not correct or improve the alleged brain dysfunction (Breggin, P. 1991). Wrongly labelled as ‘antidepressants’, ‘antipsychotics’, ‘mood stabilisers’ or ‘ADHD medication’ (Cima, R., 2025), these drugs cause a host of serious side effects, including emotional and behavioural alterations, chronic brain impairment and atrophy, chronic illness, neurotoxicity, addiction, akathisia, tardive dyskinesia, disability and premature death (Whitaker, R. 2010, Breggin, P. 1991, & Gotzsche, P. et al, 2015).The American Psychiatric Association claims that electroshock is superior to brain-disabling drugs for a variety of unproven ‘mental illnesses’, yet it admits that the distinct mechanisms by which it wields its consequences are “elusive” (Kritzer, M.D., et al, 2023, & Deng, Z.D., et al, 2023). Electroshock involves applying electricity to the brain of an anaesthetised individual through electrodes to induce a tonic-clonic seizure. It causes individuals to experience impaired judgment, headache, loss of personality, cardiac difficulties, emotional instability, nausea, temporary or enduring memory loss, stroke, disorientation, prolonged seizures, confusion, and death. The results worsen and are perpetual as they continue to be administered (Gotzsche, P., 2023; & Breggin, P.,1994).During psychiatric hospitalisation, an individual can legally be subjected to indefinite incarceration, physical and manual restraint, chemical restraint using brain-damaging drugs, solitary confinement, neurosurgery, and electroshock treatment. Psychiatric incarceration breaches the internationally ratified Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (United Nations, 1984) and the Convention on the Rights of Persons with Disability (United Nations, 2006). Furthermore, suicide in ‘mental health’ or psychiatric hospitals is fifty times higher than in the general population (Chammas, F., et al, 2022), and previous inpatients have suicide rates that are around thirty times greater than international rates (Chung, D. T., 2017).Whilst Thalidomide’s composition never changes, neither does psychiatry’s- it always causes harm. We should not “stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management.” Psychiatry is beyond repair and must be abolished. Furthermore, Mad In America is one of the few platforms that are brave enough to criticise psychiatry. People with “different views” and “professionals who are often criticised” have plenty of support from mainstream propaganda outlets.Kind regards,CatReport commentReply Dear Moyu, Consider this hypothetical: if your mother was prescribed Thalidomide during her pregnancy and you were fortunate enough to be born without any physical impairments—unlike the numerous infants who suffered severe congenital malformations—would you still endorse the use of that drug? This scenario mirrors the criticisms levied against the field of psychiatry. While you may perceive your experiences, including your ongoing relationship with a psychiatrist and hospitalisation, as beneficial or “empowering,” it’s critical to acknowledge that countless individuals have faced significant harm, enduring disabilities, or even fatalities as a result of psychiatric interventions, including unborn children exposed to psychiatric drugs. It may be worthwhile for you to reflect on the complexities and ethical considerations inherent in this field. Kind regards, Cat Report comment Moyu Watari-AlvarezJune 8, 2025 at 3:55 amDear Cat,Thank you for your response.I’m wondering how you intended the comparison between psychiatry and the chemical substance thalidomide to work. The composition of a substance never changes, regardless of time or place. However, this does not align with my experience of psychiatry.To me, it is first and foremost a human construct and a product of human relationships. This is why I believe it is important to consider how we understand and interpret it. In my view, neither psychiatry nor diagnoses are inherently problematic. What matters is how they are practised and experienced.Of course, there are structural and individual issues in psychiatric care. It is crucial that platforms such as Mad in America exist to provide a space for justified and often necessary criticism. I have had very different experiences myself, and I know many people who have experienced little to no healing through psychiatry.For this reason, I hope Mad in America fosters discussion not only among like-minded critics, but also with those who have different views — including the professionals who are often criticised. Shouldn’t we stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management?Perhaps we ultimately mean the same thing and I simply did not express myself clearly enough in my original comment.Best wishes,MoyuReport commentReplySteve McCreaJune 8, 2025 at 12:51 pmI’m not sure psychiatry can be transformed into anything other than what it has become. I see too many conflicts of interest and too much money being made by the status quo. Having been a professional dissenter within the system, I can say that there seemed to be very little interest in changing despite demonstrating the effectiveness of a different approach. I could only conclude that healing is NOT a priority of the psychiatric system, and in fact, they tend to find it threatening to their prerogatives. The investment in biological theories of “mental illness” was so intense as to approach obsession in many, and attempts to soften it, I found, were more than unwelcome. How do you change a system whose basic intent is not to heal but to control?Report commentReplyMoyu Watari-AlvarezJune 8, 2025 at 4:06 pmDear Steve McCrea,Thank you for your reply, too.Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously.I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue.Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany.I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors.That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change.Best wishes,MoyuReport commentSteve McCreaJune 8, 2025 at 5:08 pmI hope we get to read it soon. That sounds like the kind of care we need to see encouraged!Report commentBirdsongJune 8, 2025 at 2:46 pmMoyu, if you’re interested in meaningfully broadening your perspective regarding critical psychiatry, I highly recommend the following video: “This Psychiatrist Says Chemical Imbalance is a Lie”, an interview with Dr. Joanna Moncrieff from Dr. Josef Witt-Doerring’s video series on the psychiatric profession, its drugs, and the obstacles and challenges many people face when trying to taper from psychiatric drugs.Report commentReplyCatJune 8, 2025 at 8:50 pmDear Moyu,I disagree with your thesis that “psychiatry nor diagnoses are (not) inherently problematic.” I previously compared prescribing Thalidomide to psychiatry because, like the irreversible damage Thalidomide causes, psychiatric practices also cause severe, and often irreversible damage, including to unborn humans and animals (Zanni, G., et al, 2025).Psychiatric diagnoses are not physical diseases of the brain; they are a “myth” (Szasz, T. 1961) of circular reasoning fallacy. They have no known biological origin, nor are there any tests to provide independent objective data in support of any psychiatric diagnosis (CEP, 2014). Psychiatry continually fails to identify and confirm any physical or chemical abnormality as a psychiatric ‘illness’ according to the Virchowian standard of disease (Breeding, J. 2014). If an individual exhibits multiple symptoms attributed to a ‘disorder’ from the Diagnostic and Statistical Manual, Fifth Edition, Text Revision (American Psychiatric Association., 2022) psychiatrists can diagnose them with a ‘mental illness’. Psychiatry alleges a person has a ‘mental illness’ because they display symptoms of an unproven condition; a form of circular logic that fails to identify or explain the cause of any diagnosis (Burstow, B., 2016).The foundational approach to psychiatric treatment involves brain-disabling interventions such as tranquillisers, stimulants, hallucinogens and painkillers that do not correct or improve the alleged brain dysfunction (Breggin, P. 1991). Wrongly labelled as ‘antidepressants’, ‘antipsychotics’, ‘mood stabilisers’ or ‘ADHD medication’ (Cima, R., 2025), these drugs cause a host of serious side effects, including emotional and behavioural alterations, chronic brain impairment and atrophy, chronic illness, neurotoxicity, addiction, akathisia, tardive dyskinesia, disability and premature death (Whitaker, R. 2010, Breggin, P. 1991, & Gotzsche, P. et al, 2015).The American Psychiatric Association claims that electroshock is superior to brain-disabling drugs for a variety of unproven ‘mental illnesses’, yet it admits that the distinct mechanisms by which it wields its consequences are “elusive” (Kritzer, M.D., et al, 2023, & Deng, Z.D., et al, 2023). Electroshock involves applying electricity to the brain of an anaesthetised individual through electrodes to induce a tonic-clonic seizure. It causes individuals to experience impaired judgment, headache, loss of personality, cardiac difficulties, emotional instability, nausea, temporary or enduring memory loss, stroke, disorientation, prolonged seizures, confusion, and death. The results worsen and are perpetual as they continue to be administered (Gotzsche, P., 2023; & Breggin, P.,1994).During psychiatric hospitalisation, an individual can legally be subjected to indefinite incarceration, physical and manual restraint, chemical restraint using brain-damaging drugs, solitary confinement, neurosurgery, and electroshock treatment. Psychiatric incarceration breaches the internationally ratified Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (United Nations, 1984) and the Convention on the Rights of Persons with Disability (United Nations, 2006). Furthermore, suicide in ‘mental health’ or psychiatric hospitals is fifty times higher than in the general population (Chammas, F., et al, 2022), and previous inpatients have suicide rates that are around thirty times greater than international rates (Chung, D. T., 2017).Whilst Thalidomide’s composition never changes, neither does psychiatry’s- it always causes harm. We should not “stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management.” Psychiatry is beyond repair and must be abolished. Furthermore, Mad In America is one of the few platforms that are brave enough to criticise psychiatry. People with “different views” and “professionals who are often criticised” have plenty of support from mainstream propaganda outlets.Kind regards,CatReport commentReply Dear Cat, Thank you for your response. I’m wondering how you intended the comparison between psychiatry and the chemical substance thalidomide to work. The composition of a substance never changes, regardless of time or place. However, this does not align with my experience of psychiatry. To me, it is first and foremost a human construct and a product of human relationships. This is why I believe it is important to consider how we understand and interpret it. In my view, neither psychiatry nor diagnoses are inherently problematic. What matters is how they are practised and experienced. Of course, there are structural and individual issues in psychiatric care. It is crucial that platforms such as Mad in America exist to provide a space for justified and often necessary criticism. I have had very different experiences myself, and I know many people who have experienced little to no healing through psychiatry. For this reason, I hope Mad in America fosters discussion not only among like-minded critics, but also with those who have different views — including the professionals who are often criticised. Shouldn’t we stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management? Perhaps we ultimately mean the same thing and I simply did not express myself clearly enough in my original comment. Best wishes,Moyu Report comment Steve McCreaJune 8, 2025 at 12:51 pmI’m not sure psychiatry can be transformed into anything other than what it has become. I see too many conflicts of interest and too much money being made by the status quo. Having been a professional dissenter within the system, I can say that there seemed to be very little interest in changing despite demonstrating the effectiveness of a different approach. I could only conclude that healing is NOT a priority of the psychiatric system, and in fact, they tend to find it threatening to their prerogatives. The investment in biological theories of “mental illness” was so intense as to approach obsession in many, and attempts to soften it, I found, were more than unwelcome. How do you change a system whose basic intent is not to heal but to control?Report commentReplyMoyu Watari-AlvarezJune 8, 2025 at 4:06 pmDear Steve McCrea,Thank you for your reply, too.Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously.I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue.Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany.I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors.That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change.Best wishes,MoyuReport commentSteve McCreaJune 8, 2025 at 5:08 pmI hope we get to read it soon. That sounds like the kind of care we need to see encouraged!Report comment I’m not sure psychiatry can be transformed into anything other than what it has become. I see too many conflicts of interest and too much money being made by the status quo. Having been a professional dissenter within the system, I can say that there seemed to be very little interest in changing despite demonstrating the effectiveness of a different approach. I could only conclude that healing is NOT a priority of the psychiatric system, and in fact, they tend to find it threatening to their prerogatives. The investment in biological theories of “mental illness” was so intense as to approach obsession in many, and attempts to soften it, I found, were more than unwelcome. How do you change a system whose basic intent is not to heal but to control? Report comment Moyu Watari-AlvarezJune 8, 2025 at 4:06 pmDear Steve McCrea,Thank you for your reply, too.Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously.I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue.Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany.I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors.That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change.Best wishes,MoyuReport comment Dear Steve McCrea, Thank you for your reply, too. Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously. I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue. Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany. I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors. That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change. Best wishes,Moyu Report comment Steve McCreaJune 8, 2025 at 5:08 pmI hope we get to read it soon. That sounds like the kind of care we need to see encouraged!Report comment I hope we get to read it soon. That sounds like the kind of care we need to see encouraged! Report comment BirdsongJune 8, 2025 at 2:46 pmMoyu, if you’re interested in meaningfully broadening your perspective regarding critical psychiatry, I highly recommend the following video: “This Psychiatrist Says Chemical Imbalance is a Lie”, an interview with Dr. Joanna Moncrieff from Dr. Josef Witt-Doerring’s video series on the psychiatric profession, its drugs, and the obstacles and challenges many people face when trying to taper from psychiatric drugs.Report commentReply Moyu, if you’re interested in meaningfully broadening your perspective regarding critical psychiatry, I highly recommend the following video: “This Psychiatrist Says Chemical Imbalance is a Lie”, an interview with Dr. Joanna Moncrieff from Dr. Josef Witt-Doerring’s video series on the psychiatric profession, its drugs, and the obstacles and challenges many people face when trying to taper from psychiatric drugs. Report comment CatJune 8, 2025 at 8:50 pmDear Moyu,I disagree with your thesis that “psychiatry nor diagnoses are (not) inherently problematic.” I previously compared prescribing Thalidomide to psychiatry because, like the irreversible damage Thalidomide causes, psychiatric practices also cause severe, and often irreversible damage, including to unborn humans and animals (Zanni, G., et al, 2025).Psychiatric diagnoses are not physical diseases of the brain; they are a “myth” (Szasz, T. 1961) of circular reasoning fallacy. They have no known biological origin, nor are there any tests to provide independent objective data in support of any psychiatric diagnosis (CEP, 2014). Psychiatry continually fails to identify and confirm any physical or chemical abnormality as a psychiatric ‘illness’ according to the Virchowian standard of disease (Breeding, J. 2014). If an individual exhibits multiple symptoms attributed to a ‘disorder’ from the Diagnostic and Statistical Manual, Fifth Edition, Text Revision (American Psychiatric Association., 2022) psychiatrists can diagnose them with a ‘mental illness’. Psychiatry alleges a person has a ‘mental illness’ because they display symptoms of an unproven condition; a form of circular logic that fails to identify or explain the cause of any diagnosis (Burstow, B., 2016).The foundational approach to psychiatric treatment involves brain-disabling interventions such as tranquillisers, stimulants, hallucinogens and painkillers that do not correct or improve the alleged brain dysfunction (Breggin, P. 1991). Wrongly labelled as ‘antidepressants’, ‘antipsychotics’, ‘mood stabilisers’ or ‘ADHD medication’ (Cima, R., 2025), these drugs cause a host of serious side effects, including emotional and behavioural alterations, chronic brain impairment and atrophy, chronic illness, neurotoxicity, addiction, akathisia, tardive dyskinesia, disability and premature death (Whitaker, R. 2010, Breggin, P. 1991, & Gotzsche, P. et al, 2015).The American Psychiatric Association claims that electroshock is superior to brain-disabling drugs for a variety of unproven ‘mental illnesses’, yet it admits that the distinct mechanisms by which it wields its consequences are “elusive” (Kritzer, M.D., et al, 2023, & Deng, Z.D., et al, 2023). Electroshock involves applying electricity to the brain of an anaesthetised individual through electrodes to induce a tonic-clonic seizure. It causes individuals to experience impaired judgment, headache, loss of personality, cardiac difficulties, emotional instability, nausea, temporary or enduring memory loss, stroke, disorientation, prolonged seizures, confusion, and death. The results worsen and are perpetual as they continue to be administered (Gotzsche, P., 2023; & Breggin, P.,1994).During psychiatric hospitalisation, an individual can legally be subjected to indefinite incarceration, physical and manual restraint, chemical restraint using brain-damaging drugs, solitary confinement, neurosurgery, and electroshock treatment. Psychiatric incarceration breaches the internationally ratified Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (United Nations, 1984) and the Convention on the Rights of Persons with Disability (United Nations, 2006). Furthermore, suicide in ‘mental health’ or psychiatric hospitals is fifty times higher than in the general population (Chammas, F., et al, 2022), and previous inpatients have suicide rates that are around thirty times greater than international rates (Chung, D. T., 2017).Whilst Thalidomide’s composition never changes, neither does psychiatry’s- it always causes harm. We should not “stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management.” Psychiatry is beyond repair and must be abolished. Furthermore, Mad In America is one of the few platforms that are brave enough to criticise psychiatry. People with “different views” and “professionals who are often criticised” have plenty of support from mainstream propaganda outlets.Kind regards,CatReport commentReply Dear Moyu, I disagree with your thesis that “psychiatry nor diagnoses are (not) inherently problematic.” I previously compared prescribing Thalidomide to psychiatry because, like the irreversible damage Thalidomide causes, psychiatric practices also cause severe, and often irreversible damage, including to unborn humans and animals (Zanni, G., et al, 2025). Psychiatric diagnoses are not physical diseases of the brain; they are a “myth” (Szasz, T. 1961) of circular reasoning fallacy. They have no known biological origin, nor are there any tests to provide independent objective data in support of any psychiatric diagnosis (CEP, 2014). Psychiatry continually fails to identify and confirm any physical or chemical abnormality as a psychiatric ‘illness’ according to the Virchowian standard of disease (Breeding, J. 2014). If an individual exhibits multiple symptoms attributed to a ‘disorder’ from the Diagnostic and Statistical Manual, Fifth Edition, Text Revision (American Psychiatric Association., 2022) psychiatrists can diagnose them with a ‘mental illness’. Psychiatry alleges a person has a ‘mental illness’ because they display symptoms of an unproven condition; a form of circular logic that fails to identify or explain the cause of any diagnosis (Burstow, B., 2016). The foundational approach to psychiatric treatment involves brain-disabling interventions such as tranquillisers, stimulants, hallucinogens and painkillers that do not correct or improve the alleged brain dysfunction (Breggin, P. 1991). Wrongly labelled as ‘antidepressants’, ‘antipsychotics’, ‘mood stabilisers’ or ‘ADHD medication’ (Cima, R., 2025), these drugs cause a host of serious side effects, including emotional and behavioural alterations, chronic brain impairment and atrophy, chronic illness, neurotoxicity, addiction, akathisia, tardive dyskinesia, disability and premature death (Whitaker, R. 2010, Breggin, P. 1991, & Gotzsche, P. et al, 2015). The American Psychiatric Association claims that electroshock is superior to brain-disabling drugs for a variety of unproven ‘mental illnesses’, yet it admits that the distinct mechanisms by which it wields its consequences are “elusive” (Kritzer, M.D., et al, 2023, & Deng, Z.D., et al, 2023). Electroshock involves applying electricity to the brain of an anaesthetised individual through electrodes to induce a tonic-clonic seizure. It causes individuals to experience impaired judgment, headache, loss of personality, cardiac difficulties, emotional instability, nausea, temporary or enduring memory loss, stroke, disorientation, prolonged seizures, confusion, and death. The results worsen and are perpetual as they continue to be administered (Gotzsche, P., 2023; & Breggin, P.,1994). During psychiatric hospitalisation, an individual can legally be subjected to indefinite incarceration, physical and manual restraint, chemical restraint using brain-damaging drugs, solitary confinement, neurosurgery, and electroshock treatment. Psychiatric incarceration breaches the internationally ratified Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (United Nations, 1984) and the Convention on the Rights of Persons with Disability (United Nations, 2006). Furthermore, suicide in ‘mental health’ or psychiatric hospitals is fifty times higher than in the general population (Chammas, F., et al, 2022), and previous inpatients have suicide rates that are around thirty times greater than international rates (Chung, D. T., 2017). Whilst Thalidomide’s composition never changes, neither does psychiatry’s- it always causes harm. We should not “stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management.” Psychiatry is beyond repair and must be abolished. Furthermore, Mad In America is one of the few platforms that are brave enough to criticise psychiatry. People with “different views” and “professionals who are often criticised” have plenty of support from mainstream propaganda outlets. Kind regards, Cat Report comment Jonas Vennike DitlevsenJune 8, 2025 at 8:00 amI would, akin to @Cat, argue that whereas it absolutely is possible to receive genuinely good care within the psychiatric system, that is a result of a dissenting few working within the system. There defintitely are employees who offer compassion, understanding and equal footing. But the system and its underlying logic work in opposition to equality and empowerment. The pathologization of mental distress is a severe barrier to furthering our understanding of how to help people thrive.Report commentReplySteve McCreaJune 8, 2025 at 12:46 pmHaving been one of those dissenters, I can tell you that they get a lot of crap for offering compassion, understanding and equal footing. Those in charge seem to be categorically opposed to anything that empowers clients!Report commentReply I would, akin to @Cat, argue that whereas it absolutely is possible to receive genuinely good care within the psychiatric system, that is a result of a dissenting few working within the system. There defintitely are employees who offer compassion, understanding and equal footing. But the system and its underlying logic work in opposition to equality and empowerment. The pathologization of mental distress is a severe barrier to furthering our understanding of how to help people thrive. Report comment Steve McCreaJune 8, 2025 at 12:46 pmHaving been one of those dissenters, I can tell you that they get a lot of crap for offering compassion, understanding and equal footing. Those in charge seem to be categorically opposed to anything that empowers clients!Report commentReply Having been one of those dissenters, I can tell you that they get a lot of crap for offering compassion, understanding and equal footing. Those in charge seem to be categorically opposed to anything that empowers clients! Report comment Moyu Watari-AlvarezJune 10, 2025 at 4:07 amThank you all again for your thoughtful feedback and references.I would just like to clarify that I am not claiming that psychiatry has never caused irreversible harm, nor that the call for depsychiatrisation presented in the article is unjustified.However, when I reflect on the history of psychiatry in Germany, I recognise significant developments over the past 80 to 90 years. These range from the systematic killing of people with mental health conditions and disabilities under the Nazi regime to the Psychiatrie-Enquete of the 1970s, which initiated important deinstitutionalisation reforms and a shift towards more patient-centred care. More recently, the S3 Guidelines on Schizophrenia have acknowledged the importance of quality of life for those affected and recommended using the lowest possible dose of neuroleptics.Such progress would hardly have been possible without the persistent efforts of psychiatry’s critics. This is precisely why I think it’s important that everyone is free to live life as they personally see fit. Our social fabric depends on a diversity of opinions and beliefs, shaped by individual experiences, hopes and expectations. Ultimately, only what proves to be sustainable will endure, whatever ‘sustainable’ may mean in this context.Report commentReply Thank you all again for your thoughtful feedback and references. I would just like to clarify that I am not claiming that psychiatry has never caused irreversible harm, nor that the call for depsychiatrisation presented in the article is unjustified. However, when I reflect on the history of psychiatry in Germany, I recognise significant developments over the past 80 to 90 years. These range from the systematic killing of people with mental health conditions and disabilities under the Nazi regime to the Psychiatrie-Enquete of the 1970s, which initiated important deinstitutionalisation reforms and a shift towards more patient-centred care. More recently, the S3 Guidelines on Schizophrenia have acknowledged the importance of quality of life for those affected and recommended using the lowest possible dose of neuroleptics. Such progress would hardly have been possible without the persistent efforts of psychiatry’s critics. This is precisely why I think it’s important that everyone is free to live life as they personally see fit. Our social fabric depends on a diversity of opinions and beliefs, shaped by individual experiences, hopes and expectations. Ultimately, only what proves to be sustainable will endure, whatever ‘sustainable’ may mean in this context. Report comment Dear Jonas Vennike Ditlevsen, Thank you for your article. I have received psychiatric care in Germany since 2010, when I experienced my first psychotic episode. Since then, I have been admitted to psychiatric clinics four times: Three times due to acute psychosis (in 2010, 2018, and 2019), and once due to burnout this year. My experiences in psychiatric care have varied greatly depending on whether I was recovering from psychosis or burnout. For the past eight years, I have had a trusting relationship with my psychiatrist, who treats me as an equal. From my personal perspective, I believe that psychiatry can be helpful, empowering, and healing. My diagnoses do not stand in my way. That’s why I consider the question of what is meant by “psychiatry” and “depsychiatrization” urgent and important. When I first read your article, I found myself hoping for a more nuanced view of these terms. Perhaps one that reflects the diversity and complexity of people’s experiences with psychiatric care. Best wishes,Moyu Report comment CatJune 7, 2025 at 9:15 pmDear Moyu,Consider this hypothetical: if your mother was prescribed Thalidomide during her pregnancy and you were fortunate enough to be born without any physical impairments—unlike the numerous infants who suffered severe congenital malformations—would you still endorse the use of that drug? This scenario mirrors the criticisms levied against the field of psychiatry. While you may perceive your experiences, including your ongoing relationship with a psychiatrist and hospitalisation, as beneficial or “empowering,” it’s critical to acknowledge that countless individuals have faced significant harm, enduring disabilities, or even fatalities as a result of psychiatric interventions, including unborn children exposed to psychiatric drugs.It may be worthwhile for you to reflect on the complexities and ethical considerations inherent in this field.Kind regards,CatReport commentReplyMoyu Watari-AlvarezJune 8, 2025 at 3:55 amDear Cat,Thank you for your response.I’m wondering how you intended the comparison between psychiatry and the chemical substance thalidomide to work. The composition of a substance never changes, regardless of time or place. However, this does not align with my experience of psychiatry.To me, it is first and foremost a human construct and a product of human relationships. This is why I believe it is important to consider how we understand and interpret it. In my view, neither psychiatry nor diagnoses are inherently problematic. What matters is how they are practised and experienced.Of course, there are structural and individual issues in psychiatric care. It is crucial that platforms such as Mad in America exist to provide a space for justified and often necessary criticism. I have had very different experiences myself, and I know many people who have experienced little to no healing through psychiatry.For this reason, I hope Mad in America fosters discussion not only among like-minded critics, but also with those who have different views — including the professionals who are often criticised. Shouldn’t we stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management?Perhaps we ultimately mean the same thing and I simply did not express myself clearly enough in my original comment.Best wishes,MoyuReport commentReplySteve McCreaJune 8, 2025 at 12:51 pmI’m not sure psychiatry can be transformed into anything other than what it has become. I see too many conflicts of interest and too much money being made by the status quo. Having been a professional dissenter within the system, I can say that there seemed to be very little interest in changing despite demonstrating the effectiveness of a different approach. I could only conclude that healing is NOT a priority of the psychiatric system, and in fact, they tend to find it threatening to their prerogatives. The investment in biological theories of “mental illness” was so intense as to approach obsession in many, and attempts to soften it, I found, were more than unwelcome. How do you change a system whose basic intent is not to heal but to control?Report commentReplyMoyu Watari-AlvarezJune 8, 2025 at 4:06 pmDear Steve McCrea,Thank you for your reply, too.Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously.I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue.Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany.I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors.That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change.Best wishes,MoyuReport commentSteve McCreaJune 8, 2025 at 5:08 pmI hope we get to read it soon. That sounds like the kind of care we need to see encouraged!Report commentBirdsongJune 8, 2025 at 2:46 pmMoyu, if you’re interested in meaningfully broadening your perspective regarding critical psychiatry, I highly recommend the following video: “This Psychiatrist Says Chemical Imbalance is a Lie”, an interview with Dr. Joanna Moncrieff from Dr. Josef Witt-Doerring’s video series on the psychiatric profession, its drugs, and the obstacles and challenges many people face when trying to taper from psychiatric drugs.Report commentReplyCatJune 8, 2025 at 8:50 pmDear Moyu,I disagree with your thesis that “psychiatry nor diagnoses are (not) inherently problematic.” I previously compared prescribing Thalidomide to psychiatry because, like the irreversible damage Thalidomide causes, psychiatric practices also cause severe, and often irreversible damage, including to unborn humans and animals (Zanni, G., et al, 2025).Psychiatric diagnoses are not physical diseases of the brain; they are a “myth” (Szasz, T. 1961) of circular reasoning fallacy. They have no known biological origin, nor are there any tests to provide independent objective data in support of any psychiatric diagnosis (CEP, 2014). Psychiatry continually fails to identify and confirm any physical or chemical abnormality as a psychiatric ‘illness’ according to the Virchowian standard of disease (Breeding, J. 2014). If an individual exhibits multiple symptoms attributed to a ‘disorder’ from the Diagnostic and Statistical Manual, Fifth Edition, Text Revision (American Psychiatric Association., 2022) psychiatrists can diagnose them with a ‘mental illness’. Psychiatry alleges a person has a ‘mental illness’ because they display symptoms of an unproven condition; a form of circular logic that fails to identify or explain the cause of any diagnosis (Burstow, B., 2016).The foundational approach to psychiatric treatment involves brain-disabling interventions such as tranquillisers, stimulants, hallucinogens and painkillers that do not correct or improve the alleged brain dysfunction (Breggin, P. 1991). Wrongly labelled as ‘antidepressants’, ‘antipsychotics’, ‘mood stabilisers’ or ‘ADHD medication’ (Cima, R., 2025), these drugs cause a host of serious side effects, including emotional and behavioural alterations, chronic brain impairment and atrophy, chronic illness, neurotoxicity, addiction, akathisia, tardive dyskinesia, disability and premature death (Whitaker, R. 2010, Breggin, P. 1991, & Gotzsche, P. et al, 2015).The American Psychiatric Association claims that electroshock is superior to brain-disabling drugs for a variety of unproven ‘mental illnesses’, yet it admits that the distinct mechanisms by which it wields its consequences are “elusive” (Kritzer, M.D., et al, 2023, & Deng, Z.D., et al, 2023). Electroshock involves applying electricity to the brain of an anaesthetised individual through electrodes to induce a tonic-clonic seizure. It causes individuals to experience impaired judgment, headache, loss of personality, cardiac difficulties, emotional instability, nausea, temporary or enduring memory loss, stroke, disorientation, prolonged seizures, confusion, and death. The results worsen and are perpetual as they continue to be administered (Gotzsche, P., 2023; & Breggin, P.,1994).During psychiatric hospitalisation, an individual can legally be subjected to indefinite incarceration, physical and manual restraint, chemical restraint using brain-damaging drugs, solitary confinement, neurosurgery, and electroshock treatment. Psychiatric incarceration breaches the internationally ratified Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (United Nations, 1984) and the Convention on the Rights of Persons with Disability (United Nations, 2006). Furthermore, suicide in ‘mental health’ or psychiatric hospitals is fifty times higher than in the general population (Chammas, F., et al, 2022), and previous inpatients have suicide rates that are around thirty times greater than international rates (Chung, D. T., 2017).Whilst Thalidomide’s composition never changes, neither does psychiatry’s- it always causes harm. We should not “stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management.” Psychiatry is beyond repair and must be abolished. Furthermore, Mad In America is one of the few platforms that are brave enough to criticise psychiatry. People with “different views” and “professionals who are often criticised” have plenty of support from mainstream propaganda outlets.Kind regards,CatReport commentReply Dear Moyu, Consider this hypothetical: if your mother was prescribed Thalidomide during her pregnancy and you were fortunate enough to be born without any physical impairments—unlike the numerous infants who suffered severe congenital malformations—would you still endorse the use of that drug? This scenario mirrors the criticisms levied against the field of psychiatry. While you may perceive your experiences, including your ongoing relationship with a psychiatrist and hospitalisation, as beneficial or “empowering,” it’s critical to acknowledge that countless individuals have faced significant harm, enduring disabilities, or even fatalities as a result of psychiatric interventions, including unborn children exposed to psychiatric drugs. It may be worthwhile for you to reflect on the complexities and ethical considerations inherent in this field. Kind regards, Cat Report comment Moyu Watari-AlvarezJune 8, 2025 at 3:55 amDear Cat,Thank you for your response.I’m wondering how you intended the comparison between psychiatry and the chemical substance thalidomide to work. The composition of a substance never changes, regardless of time or place. However, this does not align with my experience of psychiatry.To me, it is first and foremost a human construct and a product of human relationships. This is why I believe it is important to consider how we understand and interpret it. In my view, neither psychiatry nor diagnoses are inherently problematic. What matters is how they are practised and experienced.Of course, there are structural and individual issues in psychiatric care. It is crucial that platforms such as Mad in America exist to provide a space for justified and often necessary criticism. I have had very different experiences myself, and I know many people who have experienced little to no healing through psychiatry.For this reason, I hope Mad in America fosters discussion not only among like-minded critics, but also with those who have different views — including the professionals who are often criticised. Shouldn’t we stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management?Perhaps we ultimately mean the same thing and I simply did not express myself clearly enough in my original comment.Best wishes,MoyuReport commentReplySteve McCreaJune 8, 2025 at 12:51 pmI’m not sure psychiatry can be transformed into anything other than what it has become. I see too many conflicts of interest and too much money being made by the status quo. Having been a professional dissenter within the system, I can say that there seemed to be very little interest in changing despite demonstrating the effectiveness of a different approach. I could only conclude that healing is NOT a priority of the psychiatric system, and in fact, they tend to find it threatening to their prerogatives. The investment in biological theories of “mental illness” was so intense as to approach obsession in many, and attempts to soften it, I found, were more than unwelcome. How do you change a system whose basic intent is not to heal but to control?Report commentReplyMoyu Watari-AlvarezJune 8, 2025 at 4:06 pmDear Steve McCrea,Thank you for your reply, too.Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously.I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue.Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany.I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors.That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change.Best wishes,MoyuReport commentSteve McCreaJune 8, 2025 at 5:08 pmI hope we get to read it soon. That sounds like the kind of care we need to see encouraged!Report commentBirdsongJune 8, 2025 at 2:46 pmMoyu, if you’re interested in meaningfully broadening your perspective regarding critical psychiatry, I highly recommend the following video: “This Psychiatrist Says Chemical Imbalance is a Lie”, an interview with Dr. Joanna Moncrieff from Dr. Josef Witt-Doerring’s video series on the psychiatric profession, its drugs, and the obstacles and challenges many people face when trying to taper from psychiatric drugs.Report commentReplyCatJune 8, 2025 at 8:50 pmDear Moyu,I disagree with your thesis that “psychiatry nor diagnoses are (not) inherently problematic.” I previously compared prescribing Thalidomide to psychiatry because, like the irreversible damage Thalidomide causes, psychiatric practices also cause severe, and often irreversible damage, including to unborn humans and animals (Zanni, G., et al, 2025).Psychiatric diagnoses are not physical diseases of the brain; they are a “myth” (Szasz, T. 1961) of circular reasoning fallacy. They have no known biological origin, nor are there any tests to provide independent objective data in support of any psychiatric diagnosis (CEP, 2014). Psychiatry continually fails to identify and confirm any physical or chemical abnormality as a psychiatric ‘illness’ according to the Virchowian standard of disease (Breeding, J. 2014). If an individual exhibits multiple symptoms attributed to a ‘disorder’ from the Diagnostic and Statistical Manual, Fifth Edition, Text Revision (American Psychiatric Association., 2022) psychiatrists can diagnose them with a ‘mental illness’. Psychiatry alleges a person has a ‘mental illness’ because they display symptoms of an unproven condition; a form of circular logic that fails to identify or explain the cause of any diagnosis (Burstow, B., 2016).The foundational approach to psychiatric treatment involves brain-disabling interventions such as tranquillisers, stimulants, hallucinogens and painkillers that do not correct or improve the alleged brain dysfunction (Breggin, P. 1991). Wrongly labelled as ‘antidepressants’, ‘antipsychotics’, ‘mood stabilisers’ or ‘ADHD medication’ (Cima, R., 2025), these drugs cause a host of serious side effects, including emotional and behavioural alterations, chronic brain impairment and atrophy, chronic illness, neurotoxicity, addiction, akathisia, tardive dyskinesia, disability and premature death (Whitaker, R. 2010, Breggin, P. 1991, & Gotzsche, P. et al, 2015).The American Psychiatric Association claims that electroshock is superior to brain-disabling drugs for a variety of unproven ‘mental illnesses’, yet it admits that the distinct mechanisms by which it wields its consequences are “elusive” (Kritzer, M.D., et al, 2023, & Deng, Z.D., et al, 2023). Electroshock involves applying electricity to the brain of an anaesthetised individual through electrodes to induce a tonic-clonic seizure. It causes individuals to experience impaired judgment, headache, loss of personality, cardiac difficulties, emotional instability, nausea, temporary or enduring memory loss, stroke, disorientation, prolonged seizures, confusion, and death. The results worsen and are perpetual as they continue to be administered (Gotzsche, P., 2023; & Breggin, P.,1994).During psychiatric hospitalisation, an individual can legally be subjected to indefinite incarceration, physical and manual restraint, chemical restraint using brain-damaging drugs, solitary confinement, neurosurgery, and electroshock treatment. Psychiatric incarceration breaches the internationally ratified Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (United Nations, 1984) and the Convention on the Rights of Persons with Disability (United Nations, 2006). Furthermore, suicide in ‘mental health’ or psychiatric hospitals is fifty times higher than in the general population (Chammas, F., et al, 2022), and previous inpatients have suicide rates that are around thirty times greater than international rates (Chung, D. T., 2017).Whilst Thalidomide’s composition never changes, neither does psychiatry’s- it always causes harm. We should not “stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management.” Psychiatry is beyond repair and must be abolished. Furthermore, Mad In America is one of the few platforms that are brave enough to criticise psychiatry. People with “different views” and “professionals who are often criticised” have plenty of support from mainstream propaganda outlets.Kind regards,CatReport commentReply Dear Cat, Thank you for your response. I’m wondering how you intended the comparison between psychiatry and the chemical substance thalidomide to work. The composition of a substance never changes, regardless of time or place. However, this does not align with my experience of psychiatry. To me, it is first and foremost a human construct and a product of human relationships. This is why I believe it is important to consider how we understand and interpret it. In my view, neither psychiatry nor diagnoses are inherently problematic. What matters is how they are practised and experienced. Of course, there are structural and individual issues in psychiatric care. It is crucial that platforms such as Mad in America exist to provide a space for justified and often necessary criticism. I have had very different experiences myself, and I know many people who have experienced little to no healing through psychiatry. For this reason, I hope Mad in America fosters discussion not only among like-minded critics, but also with those who have different views — including the professionals who are often criticised. Shouldn’t we stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management? Perhaps we ultimately mean the same thing and I simply did not express myself clearly enough in my original comment. Best wishes,Moyu Report comment Steve McCreaJune 8, 2025 at 12:51 pmI’m not sure psychiatry can be transformed into anything other than what it has become. I see too many conflicts of interest and too much money being made by the status quo. Having been a professional dissenter within the system, I can say that there seemed to be very little interest in changing despite demonstrating the effectiveness of a different approach. I could only conclude that healing is NOT a priority of the psychiatric system, and in fact, they tend to find it threatening to their prerogatives. The investment in biological theories of “mental illness” was so intense as to approach obsession in many, and attempts to soften it, I found, were more than unwelcome. How do you change a system whose basic intent is not to heal but to control?Report commentReplyMoyu Watari-AlvarezJune 8, 2025 at 4:06 pmDear Steve McCrea,Thank you for your reply, too.Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously.I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue.Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany.I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors.That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change.Best wishes,MoyuReport commentSteve McCreaJune 8, 2025 at 5:08 pmI hope we get to read it soon. That sounds like the kind of care we need to see encouraged!Report comment I’m not sure psychiatry can be transformed into anything other than what it has become. I see too many conflicts of interest and too much money being made by the status quo. Having been a professional dissenter within the system, I can say that there seemed to be very little interest in changing despite demonstrating the effectiveness of a different approach. I could only conclude that healing is NOT a priority of the psychiatric system, and in fact, they tend to find it threatening to their prerogatives. The investment in biological theories of “mental illness” was so intense as to approach obsession in many, and attempts to soften it, I found, were more than unwelcome. How do you change a system whose basic intent is not to heal but to control? Report comment Moyu Watari-AlvarezJune 8, 2025 at 4:06 pmDear Steve McCrea,Thank you for your reply, too.Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously.I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue.Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany.I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors.That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change.Best wishes,MoyuReport comment Dear Steve McCrea, Thank you for your reply, too. Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously. I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue. Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany. I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors. That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change. Best wishes,Moyu Report comment Steve McCreaJune 8, 2025 at 5:08 pmI hope we get to read it soon. That sounds like the kind of care we need to see encouraged!Report comment I hope we get to read it soon. That sounds like the kind of care we need to see encouraged! Report comment BirdsongJune 8, 2025 at 2:46 pmMoyu, if you’re interested in meaningfully broadening your perspective regarding critical psychiatry, I highly recommend the following video: “This Psychiatrist Says Chemical Imbalance is a Lie”, an interview with Dr. Joanna Moncrieff from Dr. Josef Witt-Doerring’s video series on the psychiatric profession, its drugs, and the obstacles and challenges many people face when trying to taper from psychiatric drugs.Report commentReply Moyu, if you’re interested in meaningfully broadening your perspective regarding critical psychiatry, I highly recommend the following video: “This Psychiatrist Says Chemical Imbalance is a Lie”, an interview with Dr. Joanna Moncrieff from Dr. Josef Witt-Doerring’s video series on the psychiatric profession, its drugs, and the obstacles and challenges many people face when trying to taper from psychiatric drugs. Report comment CatJune 8, 2025 at 8:50 pmDear Moyu,I disagree with your thesis that “psychiatry nor diagnoses are (not) inherently problematic.” I previously compared prescribing Thalidomide to psychiatry because, like the irreversible damage Thalidomide causes, psychiatric practices also cause severe, and often irreversible damage, including to unborn humans and animals (Zanni, G., et al, 2025).Psychiatric diagnoses are not physical diseases of the brain; they are a “myth” (Szasz, T. 1961) of circular reasoning fallacy. They have no known biological origin, nor are there any tests to provide independent objective data in support of any psychiatric diagnosis (CEP, 2014). Psychiatry continually fails to identify and confirm any physical or chemical abnormality as a psychiatric ‘illness’ according to the Virchowian standard of disease (Breeding, J. 2014). If an individual exhibits multiple symptoms attributed to a ‘disorder’ from the Diagnostic and Statistical Manual, Fifth Edition, Text Revision (American Psychiatric Association., 2022) psychiatrists can diagnose them with a ‘mental illness’. Psychiatry alleges a person has a ‘mental illness’ because they display symptoms of an unproven condition; a form of circular logic that fails to identify or explain the cause of any diagnosis (Burstow, B., 2016).The foundational approach to psychiatric treatment involves brain-disabling interventions such as tranquillisers, stimulants, hallucinogens and painkillers that do not correct or improve the alleged brain dysfunction (Breggin, P. 1991). Wrongly labelled as ‘antidepressants’, ‘antipsychotics’, ‘mood stabilisers’ or ‘ADHD medication’ (Cima, R., 2025), these drugs cause a host of serious side effects, including emotional and behavioural alterations, chronic brain impairment and atrophy, chronic illness, neurotoxicity, addiction, akathisia, tardive dyskinesia, disability and premature death (Whitaker, R. 2010, Breggin, P. 1991, & Gotzsche, P. et al, 2015).The American Psychiatric Association claims that electroshock is superior to brain-disabling drugs for a variety of unproven ‘mental illnesses’, yet it admits that the distinct mechanisms by which it wields its consequences are “elusive” (Kritzer, M.D., et al, 2023, & Deng, Z.D., et al, 2023). Electroshock involves applying electricity to the brain of an anaesthetised individual through electrodes to induce a tonic-clonic seizure. It causes individuals to experience impaired judgment, headache, loss of personality, cardiac difficulties, emotional instability, nausea, temporary or enduring memory loss, stroke, disorientation, prolonged seizures, confusion, and death. The results worsen and are perpetual as they continue to be administered (Gotzsche, P., 2023; & Breggin, P.,1994).During psychiatric hospitalisation, an individual can legally be subjected to indefinite incarceration, physical and manual restraint, chemical restraint using brain-damaging drugs, solitary confinement, neurosurgery, and electroshock treatment. Psychiatric incarceration breaches the internationally ratified Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (United Nations, 1984) and the Convention on the Rights of Persons with Disability (United Nations, 2006). Furthermore, suicide in ‘mental health’ or psychiatric hospitals is fifty times higher than in the general population (Chammas, F., et al, 2022), and previous inpatients have suicide rates that are around thirty times greater than international rates (Chung, D. T., 2017).Whilst Thalidomide’s composition never changes, neither does psychiatry’s- it always causes harm. We should not “stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management.” Psychiatry is beyond repair and must be abolished. Furthermore, Mad In America is one of the few platforms that are brave enough to criticise psychiatry. People with “different views” and “professionals who are often criticised” have plenty of support from mainstream propaganda outlets.Kind regards,CatReport commentReply Dear Moyu, I disagree with your thesis that “psychiatry nor diagnoses are (not) inherently problematic.” I previously compared prescribing Thalidomide to psychiatry because, like the irreversible damage Thalidomide causes, psychiatric practices also cause severe, and often irreversible damage, including to unborn humans and animals (Zanni, G., et al, 2025). Psychiatric diagnoses are not physical diseases of the brain; they are a “myth” (Szasz, T. 1961) of circular reasoning fallacy. They have no known biological origin, nor are there any tests to provide independent objective data in support of any psychiatric diagnosis (CEP, 2014). Psychiatry continually fails to identify and confirm any physical or chemical abnormality as a psychiatric ‘illness’ according to the Virchowian standard of disease (Breeding, J. 2014). If an individual exhibits multiple symptoms attributed to a ‘disorder’ from the Diagnostic and Statistical Manual, Fifth Edition, Text Revision (American Psychiatric Association., 2022) psychiatrists can diagnose them with a ‘mental illness’. Psychiatry alleges a person has a ‘mental illness’ because they display symptoms of an unproven condition; a form of circular logic that fails to identify or explain the cause of any diagnosis (Burstow, B., 2016). The foundational approach to psychiatric treatment involves brain-disabling interventions such as tranquillisers, stimulants, hallucinogens and painkillers that do not correct or improve the alleged brain dysfunction (Breggin, P. 1991). Wrongly labelled as ‘antidepressants’, ‘antipsychotics’, ‘mood stabilisers’ or ‘ADHD medication’ (Cima, R., 2025), these drugs cause a host of serious side effects, including emotional and behavioural alterations, chronic brain impairment and atrophy, chronic illness, neurotoxicity, addiction, akathisia, tardive dyskinesia, disability and premature death (Whitaker, R. 2010, Breggin, P. 1991, & Gotzsche, P. et al, 2015). The American Psychiatric Association claims that electroshock is superior to brain-disabling drugs for a variety of unproven ‘mental illnesses’, yet it admits that the distinct mechanisms by which it wields its consequences are “elusive” (Kritzer, M.D., et al, 2023, & Deng, Z.D., et al, 2023). Electroshock involves applying electricity to the brain of an anaesthetised individual through electrodes to induce a tonic-clonic seizure. It causes individuals to experience impaired judgment, headache, loss of personality, cardiac difficulties, emotional instability, nausea, temporary or enduring memory loss, stroke, disorientation, prolonged seizures, confusion, and death. The results worsen and are perpetual as they continue to be administered (Gotzsche, P., 2023; & Breggin, P.,1994). During psychiatric hospitalisation, an individual can legally be subjected to indefinite incarceration, physical and manual restraint, chemical restraint using brain-damaging drugs, solitary confinement, neurosurgery, and electroshock treatment. Psychiatric incarceration breaches the internationally ratified Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (United Nations, 1984) and the Convention on the Rights of Persons with Disability (United Nations, 2006). Furthermore, suicide in ‘mental health’ or psychiatric hospitals is fifty times higher than in the general population (Chammas, F., et al, 2022), and previous inpatients have suicide rates that are around thirty times greater than international rates (Chung, D. T., 2017). Whilst Thalidomide’s composition never changes, neither does psychiatry’s- it always causes harm. We should not “stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management.” Psychiatry is beyond repair and must be abolished. Furthermore, Mad In America is one of the few platforms that are brave enough to criticise psychiatry. People with “different views” and “professionals who are often criticised” have plenty of support from mainstream propaganda outlets. Kind regards, Cat Report comment Dear Moyu, Consider this hypothetical: if your mother was prescribed Thalidomide during her pregnancy and you were fortunate enough to be born without any physical impairments—unlike the numerous infants who suffered severe congenital malformations—would you still endorse the use of that drug? This scenario mirrors the criticisms levied against the field of psychiatry. While you may perceive your experiences, including your ongoing relationship with a psychiatrist and hospitalisation, as beneficial or “empowering,” it’s critical to acknowledge that countless individuals have faced significant harm, enduring disabilities, or even fatalities as a result of psychiatric interventions, including unborn children exposed to psychiatric drugs. It may be worthwhile for you to reflect on the complexities and ethical considerations inherent in this field. Kind regards, Cat Report comment Moyu Watari-AlvarezJune 8, 2025 at 3:55 amDear Cat,Thank you for your response.I’m wondering how you intended the comparison between psychiatry and the chemical substance thalidomide to work. The composition of a substance never changes, regardless of time or place. However, this does not align with my experience of psychiatry.To me, it is first and foremost a human construct and a product of human relationships. This is why I believe it is important to consider how we understand and interpret it. In my view, neither psychiatry nor diagnoses are inherently problematic. What matters is how they are practised and experienced.Of course, there are structural and individual issues in psychiatric care. It is crucial that platforms such as Mad in America exist to provide a space for justified and often necessary criticism. I have had very different experiences myself, and I know many people who have experienced little to no healing through psychiatry.For this reason, I hope Mad in America fosters discussion not only among like-minded critics, but also with those who have different views — including the professionals who are often criticised. Shouldn’t we stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management?Perhaps we ultimately mean the same thing and I simply did not express myself clearly enough in my original comment.Best wishes,MoyuReport commentReplySteve McCreaJune 8, 2025 at 12:51 pmI’m not sure psychiatry can be transformed into anything other than what it has become. I see too many conflicts of interest and too much money being made by the status quo. Having been a professional dissenter within the system, I can say that there seemed to be very little interest in changing despite demonstrating the effectiveness of a different approach. I could only conclude that healing is NOT a priority of the psychiatric system, and in fact, they tend to find it threatening to their prerogatives. The investment in biological theories of “mental illness” was so intense as to approach obsession in many, and attempts to soften it, I found, were more than unwelcome. How do you change a system whose basic intent is not to heal but to control?Report commentReplyMoyu Watari-AlvarezJune 8, 2025 at 4:06 pmDear Steve McCrea,Thank you for your reply, too.Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously.I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue.Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany.I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors.That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change.Best wishes,MoyuReport commentSteve McCreaJune 8, 2025 at 5:08 pmI hope we get to read it soon. That sounds like the kind of care we need to see encouraged!Report commentBirdsongJune 8, 2025 at 2:46 pmMoyu, if you’re interested in meaningfully broadening your perspective regarding critical psychiatry, I highly recommend the following video: “This Psychiatrist Says Chemical Imbalance is a Lie”, an interview with Dr. Joanna Moncrieff from Dr. Josef Witt-Doerring’s video series on the psychiatric profession, its drugs, and the obstacles and challenges many people face when trying to taper from psychiatric drugs.Report commentReplyCatJune 8, 2025 at 8:50 pmDear Moyu,I disagree with your thesis that “psychiatry nor diagnoses are (not) inherently problematic.” I previously compared prescribing Thalidomide to psychiatry because, like the irreversible damage Thalidomide causes, psychiatric practices also cause severe, and often irreversible damage, including to unborn humans and animals (Zanni, G., et al, 2025).Psychiatric diagnoses are not physical diseases of the brain; they are a “myth” (Szasz, T. 1961) of circular reasoning fallacy. They have no known biological origin, nor are there any tests to provide independent objective data in support of any psychiatric diagnosis (CEP, 2014). Psychiatry continually fails to identify and confirm any physical or chemical abnormality as a psychiatric ‘illness’ according to the Virchowian standard of disease (Breeding, J. 2014). If an individual exhibits multiple symptoms attributed to a ‘disorder’ from the Diagnostic and Statistical Manual, Fifth Edition, Text Revision (American Psychiatric Association., 2022) psychiatrists can diagnose them with a ‘mental illness’. Psychiatry alleges a person has a ‘mental illness’ because they display symptoms of an unproven condition; a form of circular logic that fails to identify or explain the cause of any diagnosis (Burstow, B., 2016).The foundational approach to psychiatric treatment involves brain-disabling interventions such as tranquillisers, stimulants, hallucinogens and painkillers that do not correct or improve the alleged brain dysfunction (Breggin, P. 1991). Wrongly labelled as ‘antidepressants’, ‘antipsychotics’, ‘mood stabilisers’ or ‘ADHD medication’ (Cima, R., 2025), these drugs cause a host of serious side effects, including emotional and behavioural alterations, chronic brain impairment and atrophy, chronic illness, neurotoxicity, addiction, akathisia, tardive dyskinesia, disability and premature death (Whitaker, R. 2010, Breggin, P. 1991, & Gotzsche, P. et al, 2015).The American Psychiatric Association claims that electroshock is superior to brain-disabling drugs for a variety of unproven ‘mental illnesses’, yet it admits that the distinct mechanisms by which it wields its consequences are “elusive” (Kritzer, M.D., et al, 2023, & Deng, Z.D., et al, 2023). Electroshock involves applying electricity to the brain of an anaesthetised individual through electrodes to induce a tonic-clonic seizure. It causes individuals to experience impaired judgment, headache, loss of personality, cardiac difficulties, emotional instability, nausea, temporary or enduring memory loss, stroke, disorientation, prolonged seizures, confusion, and death. The results worsen and are perpetual as they continue to be administered (Gotzsche, P., 2023; & Breggin, P.,1994).During psychiatric hospitalisation, an individual can legally be subjected to indefinite incarceration, physical and manual restraint, chemical restraint using brain-damaging drugs, solitary confinement, neurosurgery, and electroshock treatment. Psychiatric incarceration breaches the internationally ratified Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (United Nations, 1984) and the Convention on the Rights of Persons with Disability (United Nations, 2006). Furthermore, suicide in ‘mental health’ or psychiatric hospitals is fifty times higher than in the general population (Chammas, F., et al, 2022), and previous inpatients have suicide rates that are around thirty times greater than international rates (Chung, D. T., 2017).Whilst Thalidomide’s composition never changes, neither does psychiatry’s- it always causes harm. We should not “stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management.” Psychiatry is beyond repair and must be abolished. Furthermore, Mad In America is one of the few platforms that are brave enough to criticise psychiatry. People with “different views” and “professionals who are often criticised” have plenty of support from mainstream propaganda outlets.Kind regards,CatReport commentReply Dear Cat, Thank you for your response. I’m wondering how you intended the comparison between psychiatry and the chemical substance thalidomide to work. The composition of a substance never changes, regardless of time or place. However, this does not align with my experience of psychiatry. To me, it is first and foremost a human construct and a product of human relationships. This is why I believe it is important to consider how we understand and interpret it. In my view, neither psychiatry nor diagnoses are inherently problematic. What matters is how they are practised and experienced. Of course, there are structural and individual issues in psychiatric care. It is crucial that platforms such as Mad in America exist to provide a space for justified and often necessary criticism. I have had very different experiences myself, and I know many people who have experienced little to no healing through psychiatry. For this reason, I hope Mad in America fosters discussion not only among like-minded critics, but also with those who have different views — including the professionals who are often criticised. Shouldn’t we stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management? Perhaps we ultimately mean the same thing and I simply did not express myself clearly enough in my original comment. Best wishes,Moyu Report comment Steve McCreaJune 8, 2025 at 12:51 pmI’m not sure psychiatry can be transformed into anything other than what it has become. I see too many conflicts of interest and too much money being made by the status quo. Having been a professional dissenter within the system, I can say that there seemed to be very little interest in changing despite demonstrating the effectiveness of a different approach. I could only conclude that healing is NOT a priority of the psychiatric system, and in fact, they tend to find it threatening to their prerogatives. The investment in biological theories of “mental illness” was so intense as to approach obsession in many, and attempts to soften it, I found, were more than unwelcome. How do you change a system whose basic intent is not to heal but to control?Report commentReplyMoyu Watari-AlvarezJune 8, 2025 at 4:06 pmDear Steve McCrea,Thank you for your reply, too.Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously.I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue.Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany.I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors.That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change.Best wishes,MoyuReport commentSteve McCreaJune 8, 2025 at 5:08 pmI hope we get to read it soon. That sounds like the kind of care we need to see encouraged!Report comment I’m not sure psychiatry can be transformed into anything other than what it has become. I see too many conflicts of interest and too much money being made by the status quo. Having been a professional dissenter within the system, I can say that there seemed to be very little interest in changing despite demonstrating the effectiveness of a different approach. I could only conclude that healing is NOT a priority of the psychiatric system, and in fact, they tend to find it threatening to their prerogatives. The investment in biological theories of “mental illness” was so intense as to approach obsession in many, and attempts to soften it, I found, were more than unwelcome. How do you change a system whose basic intent is not to heal but to control? Report comment Moyu Watari-AlvarezJune 8, 2025 at 4:06 pmDear Steve McCrea,Thank you for your reply, too.Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously.I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue.Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany.I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors.That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change.Best wishes,MoyuReport comment Dear Steve McCrea, Thank you for your reply, too. Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously. I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue. Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany. I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors. That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change. Best wishes,Moyu Report comment Steve McCreaJune 8, 2025 at 5:08 pmI hope we get to read it soon. That sounds like the kind of care we need to see encouraged!Report comment I hope we get to read it soon. That sounds like the kind of care we need to see encouraged! Report comment BirdsongJune 8, 2025 at 2:46 pmMoyu, if you’re interested in meaningfully broadening your perspective regarding critical psychiatry, I highly recommend the following video: “This Psychiatrist Says Chemical Imbalance is a Lie”, an interview with Dr. Joanna Moncrieff from Dr. Josef Witt-Doerring’s video series on the psychiatric profession, its drugs, and the obstacles and challenges many people face when trying to taper from psychiatric drugs.Report commentReply Moyu, if you’re interested in meaningfully broadening your perspective regarding critical psychiatry, I highly recommend the following video: “This Psychiatrist Says Chemical Imbalance is a Lie”, an interview with Dr. Joanna Moncrieff from Dr. Josef Witt-Doerring’s video series on the psychiatric profession, its drugs, and the obstacles and challenges many people face when trying to taper from psychiatric drugs. Report comment CatJune 8, 2025 at 8:50 pmDear Moyu,I disagree with your thesis that “psychiatry nor diagnoses are (not) inherently problematic.” I previously compared prescribing Thalidomide to psychiatry because, like the irreversible damage Thalidomide causes, psychiatric practices also cause severe, and often irreversible damage, including to unborn humans and animals (Zanni, G., et al, 2025).Psychiatric diagnoses are not physical diseases of the brain; they are a “myth” (Szasz, T. 1961) of circular reasoning fallacy. They have no known biological origin, nor are there any tests to provide independent objective data in support of any psychiatric diagnosis (CEP, 2014). Psychiatry continually fails to identify and confirm any physical or chemical abnormality as a psychiatric ‘illness’ according to the Virchowian standard of disease (Breeding, J. 2014). If an individual exhibits multiple symptoms attributed to a ‘disorder’ from the Diagnostic and Statistical Manual, Fifth Edition, Text Revision (American Psychiatric Association., 2022) psychiatrists can diagnose them with a ‘mental illness’. Psychiatry alleges a person has a ‘mental illness’ because they display symptoms of an unproven condition; a form of circular logic that fails to identify or explain the cause of any diagnosis (Burstow, B., 2016).The foundational approach to psychiatric treatment involves brain-disabling interventions such as tranquillisers, stimulants, hallucinogens and painkillers that do not correct or improve the alleged brain dysfunction (Breggin, P. 1991). Wrongly labelled as ‘antidepressants’, ‘antipsychotics’, ‘mood stabilisers’ or ‘ADHD medication’ (Cima, R., 2025), these drugs cause a host of serious side effects, including emotional and behavioural alterations, chronic brain impairment and atrophy, chronic illness, neurotoxicity, addiction, akathisia, tardive dyskinesia, disability and premature death (Whitaker, R. 2010, Breggin, P. 1991, & Gotzsche, P. et al, 2015).The American Psychiatric Association claims that electroshock is superior to brain-disabling drugs for a variety of unproven ‘mental illnesses’, yet it admits that the distinct mechanisms by which it wields its consequences are “elusive” (Kritzer, M.D., et al, 2023, & Deng, Z.D., et al, 2023). Electroshock involves applying electricity to the brain of an anaesthetised individual through electrodes to induce a tonic-clonic seizure. It causes individuals to experience impaired judgment, headache, loss of personality, cardiac difficulties, emotional instability, nausea, temporary or enduring memory loss, stroke, disorientation, prolonged seizures, confusion, and death. The results worsen and are perpetual as they continue to be administered (Gotzsche, P., 2023; & Breggin, P.,1994).During psychiatric hospitalisation, an individual can legally be subjected to indefinite incarceration, physical and manual restraint, chemical restraint using brain-damaging drugs, solitary confinement, neurosurgery, and electroshock treatment. Psychiatric incarceration breaches the internationally ratified Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (United Nations, 1984) and the Convention on the Rights of Persons with Disability (United Nations, 2006). Furthermore, suicide in ‘mental health’ or psychiatric hospitals is fifty times higher than in the general population (Chammas, F., et al, 2022), and previous inpatients have suicide rates that are around thirty times greater than international rates (Chung, D. T., 2017).Whilst Thalidomide’s composition never changes, neither does psychiatry’s- it always causes harm. We should not “stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management.” Psychiatry is beyond repair and must be abolished. Furthermore, Mad In America is one of the few platforms that are brave enough to criticise psychiatry. People with “different views” and “professionals who are often criticised” have plenty of support from mainstream propaganda outlets.Kind regards,CatReport commentReply Dear Moyu, I disagree with your thesis that “psychiatry nor diagnoses are (not) inherently problematic.” I previously compared prescribing Thalidomide to psychiatry because, like the irreversible damage Thalidomide causes, psychiatric practices also cause severe, and often irreversible damage, including to unborn humans and animals (Zanni, G., et al, 2025). Psychiatric diagnoses are not physical diseases of the brain; they are a “myth” (Szasz, T. 1961) of circular reasoning fallacy. They have no known biological origin, nor are there any tests to provide independent objective data in support of any psychiatric diagnosis (CEP, 2014). Psychiatry continually fails to identify and confirm any physical or chemical abnormality as a psychiatric ‘illness’ according to the Virchowian standard of disease (Breeding, J. 2014). If an individual exhibits multiple symptoms attributed to a ‘disorder’ from the Diagnostic and Statistical Manual, Fifth Edition, Text Revision (American Psychiatric Association., 2022) psychiatrists can diagnose them with a ‘mental illness’. Psychiatry alleges a person has a ‘mental illness’ because they display symptoms of an unproven condition; a form of circular logic that fails to identify or explain the cause of any diagnosis (Burstow, B., 2016). The foundational approach to psychiatric treatment involves brain-disabling interventions such as tranquillisers, stimulants, hallucinogens and painkillers that do not correct or improve the alleged brain dysfunction (Breggin, P. 1991). Wrongly labelled as ‘antidepressants’, ‘antipsychotics’, ‘mood stabilisers’ or ‘ADHD medication’ (Cima, R., 2025), these drugs cause a host of serious side effects, including emotional and behavioural alterations, chronic brain impairment and atrophy, chronic illness, neurotoxicity, addiction, akathisia, tardive dyskinesia, disability and premature death (Whitaker, R. 2010, Breggin, P. 1991, & Gotzsche, P. et al, 2015). The American Psychiatric Association claims that electroshock is superior to brain-disabling drugs for a variety of unproven ‘mental illnesses’, yet it admits that the distinct mechanisms by which it wields its consequences are “elusive” (Kritzer, M.D., et al, 2023, & Deng, Z.D., et al, 2023). Electroshock involves applying electricity to the brain of an anaesthetised individual through electrodes to induce a tonic-clonic seizure. It causes individuals to experience impaired judgment, headache, loss of personality, cardiac difficulties, emotional instability, nausea, temporary or enduring memory loss, stroke, disorientation, prolonged seizures, confusion, and death. The results worsen and are perpetual as they continue to be administered (Gotzsche, P., 2023; & Breggin, P.,1994). During psychiatric hospitalisation, an individual can legally be subjected to indefinite incarceration, physical and manual restraint, chemical restraint using brain-damaging drugs, solitary confinement, neurosurgery, and electroshock treatment. Psychiatric incarceration breaches the internationally ratified Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (United Nations, 1984) and the Convention on the Rights of Persons with Disability (United Nations, 2006). Furthermore, suicide in ‘mental health’ or psychiatric hospitals is fifty times higher than in the general population (Chammas, F., et al, 2022), and previous inpatients have suicide rates that are around thirty times greater than international rates (Chung, D. T., 2017). Whilst Thalidomide’s composition never changes, neither does psychiatry’s- it always causes harm. We should not “stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management.” Psychiatry is beyond repair and must be abolished. Furthermore, Mad In America is one of the few platforms that are brave enough to criticise psychiatry. People with “different views” and “professionals who are often criticised” have plenty of support from mainstream propaganda outlets. Kind regards, Cat Report comment Dear Cat, Thank you for your response. I’m wondering how you intended the comparison between psychiatry and the chemical substance thalidomide to work. The composition of a substance never changes, regardless of time or place. However, this does not align with my experience of psychiatry. To me, it is first and foremost a human construct and a product of human relationships. This is why I believe it is important to consider how we understand and interpret it. In my view, neither psychiatry nor diagnoses are inherently problematic. What matters is how they are practised and experienced. Of course, there are structural and individual issues in psychiatric care. It is crucial that platforms such as Mad in America exist to provide a space for justified and often necessary criticism. I have had very different experiences myself, and I know many people who have experienced little to no healing through psychiatry. For this reason, I hope Mad in America fosters discussion not only among like-minded critics, but also with those who have different views — including the professionals who are often criticised. Shouldn’t we stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management? Perhaps we ultimately mean the same thing and I simply did not express myself clearly enough in my original comment. Best wishes,Moyu Report comment Steve McCreaJune 8, 2025 at 12:51 pmI’m not sure psychiatry can be transformed into anything other than what it has become. I see too many conflicts of interest and too much money being made by the status quo. Having been a professional dissenter within the system, I can say that there seemed to be very little interest in changing despite demonstrating the effectiveness of a different approach. I could only conclude that healing is NOT a priority of the psychiatric system, and in fact, they tend to find it threatening to their prerogatives. The investment in biological theories of “mental illness” was so intense as to approach obsession in many, and attempts to soften it, I found, were more than unwelcome. How do you change a system whose basic intent is not to heal but to control?Report commentReplyMoyu Watari-AlvarezJune 8, 2025 at 4:06 pmDear Steve McCrea,Thank you for your reply, too.Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously.I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue.Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany.I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors.That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change.Best wishes,MoyuReport commentSteve McCreaJune 8, 2025 at 5:08 pmI hope we get to read it soon. That sounds like the kind of care we need to see encouraged!Report comment I’m not sure psychiatry can be transformed into anything other than what it has become. I see too many conflicts of interest and too much money being made by the status quo. Having been a professional dissenter within the system, I can say that there seemed to be very little interest in changing despite demonstrating the effectiveness of a different approach. I could only conclude that healing is NOT a priority of the psychiatric system, and in fact, they tend to find it threatening to their prerogatives. The investment in biological theories of “mental illness” was so intense as to approach obsession in many, and attempts to soften it, I found, were more than unwelcome. How do you change a system whose basic intent is not to heal but to control? Report comment Moyu Watari-AlvarezJune 8, 2025 at 4:06 pmDear Steve McCrea,Thank you for your reply, too.Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously.I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue.Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany.I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors.That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change.Best wishes,MoyuReport comment Dear Steve McCrea, Thank you for your reply, too. Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously. I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue. Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany. I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors. That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change. Best wishes,Moyu Report comment Steve McCreaJune 8, 2025 at 5:08 pmI hope we get to read it soon. That sounds like the kind of care we need to see encouraged!Report comment I hope we get to read it soon. That sounds like the kind of care we need to see encouraged! Report comment I’m not sure psychiatry can be transformed into anything other than what it has become. I see too many conflicts of interest and too much money being made by the status quo. Having been a professional dissenter within the system, I can say that there seemed to be very little interest in changing despite demonstrating the effectiveness of a different approach. I could only conclude that healing is NOT a priority of the psychiatric system, and in fact, they tend to find it threatening to their prerogatives. The investment in biological theories of “mental illness” was so intense as to approach obsession in many, and attempts to soften it, I found, were more than unwelcome. How do you change a system whose basic intent is not to heal but to control? Report comment Moyu Watari-AlvarezJune 8, 2025 at 4:06 pmDear Steve McCrea,Thank you for your reply, too.Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously.I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue.Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany.I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors.That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change.Best wishes,MoyuReport comment Dear Steve McCrea, Thank you for your reply, too. Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously. I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue. Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany. I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors. That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change. Best wishes,Moyu Report comment Dear Steve McCrea, Thank you for your reply, too. Your experience of being a professional dissenter within the psychiatric system provides a valuable and powerful perspective. I take your view that there may be little chance of transforming the system for the better seriously. I find the question of what ‘healing psychiatric care’ might mean, both individually and structurally, deeply complex and worth exploring. I don’t have any simple solutions, but I believe it’s an important conversation to continue. Having followed Mad in America on and off for over ten years, I submitted my second personal story nearly six weeks ago. It recounts a highly positive experience I had at the day clinics of the university hospital here in Heidelberg, Germany. I believed the piece offered a strong example of how psychiatry can be practised in a way that supports healing. However, to my surprise, I haven’t received any acknowledgement or response from the editors. That’s why I hope Mad in America will continue to welcome voices that aim to bridge the gap between critics of psychiatry and its practitioners. I believe that dialogue across that divide is vital if we want to see meaningful change. Best wishes,Moyu Report comment Steve McCreaJune 8, 2025 at 5:08 pmI hope we get to read it soon. That sounds like the kind of care we need to see encouraged!Report comment I hope we get to read it soon. That sounds like the kind of care we need to see encouraged! Report comment I hope we get to read it soon. That sounds like the kind of care we need to see encouraged! Report comment BirdsongJune 8, 2025 at 2:46 pmMoyu, if you’re interested in meaningfully broadening your perspective regarding critical psychiatry, I highly recommend the following video: “This Psychiatrist Says Chemical Imbalance is a Lie”, an interview with Dr. Joanna Moncrieff from Dr. Josef Witt-Doerring’s video series on the psychiatric profession, its drugs, and the obstacles and challenges many people face when trying to taper from psychiatric drugs.Report commentReply Moyu, if you’re interested in meaningfully broadening your perspective regarding critical psychiatry, I highly recommend the following video: “This Psychiatrist Says Chemical Imbalance is a Lie”, an interview with Dr. Joanna Moncrieff from Dr. Josef Witt-Doerring’s video series on the psychiatric profession, its drugs, and the obstacles and challenges many people face when trying to taper from psychiatric drugs. Report comment Moyu, if you’re interested in meaningfully broadening your perspective regarding critical psychiatry, I highly recommend the following video: “This Psychiatrist Says Chemical Imbalance is a Lie”, an interview with Dr. Joanna Moncrieff from Dr. Josef Witt-Doerring’s video series on the psychiatric profession, its drugs, and the obstacles and challenges many people face when trying to taper from psychiatric drugs. Report comment CatJune 8, 2025 at 8:50 pmDear Moyu,I disagree with your thesis that “psychiatry nor diagnoses are (not) inherently problematic.” I previously compared prescribing Thalidomide to psychiatry because, like the irreversible damage Thalidomide causes, psychiatric practices also cause severe, and often irreversible damage, including to unborn humans and animals (Zanni, G., et al, 2025).Psychiatric diagnoses are not physical diseases of the brain; they are a “myth” (Szasz, T. 1961) of circular reasoning fallacy. They have no known biological origin, nor are there any tests to provide independent objective data in support of any psychiatric diagnosis (CEP, 2014). Psychiatry continually fails to identify and confirm any physical or chemical abnormality as a psychiatric ‘illness’ according to the Virchowian standard of disease (Breeding, J. 2014). If an individual exhibits multiple symptoms attributed to a ‘disorder’ from the Diagnostic and Statistical Manual, Fifth Edition, Text Revision (American Psychiatric Association., 2022) psychiatrists can diagnose them with a ‘mental illness’. Psychiatry alleges a person has a ‘mental illness’ because they display symptoms of an unproven condition; a form of circular logic that fails to identify or explain the cause of any diagnosis (Burstow, B., 2016).The foundational approach to psychiatric treatment involves brain-disabling interventions such as tranquillisers, stimulants, hallucinogens and painkillers that do not correct or improve the alleged brain dysfunction (Breggin, P. 1991). Wrongly labelled as ‘antidepressants’, ‘antipsychotics’, ‘mood stabilisers’ or ‘ADHD medication’ (Cima, R., 2025), these drugs cause a host of serious side effects, including emotional and behavioural alterations, chronic brain impairment and atrophy, chronic illness, neurotoxicity, addiction, akathisia, tardive dyskinesia, disability and premature death (Whitaker, R. 2010, Breggin, P. 1991, & Gotzsche, P. et al, 2015).The American Psychiatric Association claims that electroshock is superior to brain-disabling drugs for a variety of unproven ‘mental illnesses’, yet it admits that the distinct mechanisms by which it wields its consequences are “elusive” (Kritzer, M.D., et al, 2023, & Deng, Z.D., et al, 2023). Electroshock involves applying electricity to the brain of an anaesthetised individual through electrodes to induce a tonic-clonic seizure. It causes individuals to experience impaired judgment, headache, loss of personality, cardiac difficulties, emotional instability, nausea, temporary or enduring memory loss, stroke, disorientation, prolonged seizures, confusion, and death. The results worsen and are perpetual as they continue to be administered (Gotzsche, P., 2023; & Breggin, P.,1994).During psychiatric hospitalisation, an individual can legally be subjected to indefinite incarceration, physical and manual restraint, chemical restraint using brain-damaging drugs, solitary confinement, neurosurgery, and electroshock treatment. Psychiatric incarceration breaches the internationally ratified Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (United Nations, 1984) and the Convention on the Rights of Persons with Disability (United Nations, 2006). Furthermore, suicide in ‘mental health’ or psychiatric hospitals is fifty times higher than in the general population (Chammas, F., et al, 2022), and previous inpatients have suicide rates that are around thirty times greater than international rates (Chung, D. T., 2017).Whilst Thalidomide’s composition never changes, neither does psychiatry’s- it always causes harm. We should not “stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management.” Psychiatry is beyond repair and must be abolished. Furthermore, Mad In America is one of the few platforms that are brave enough to criticise psychiatry. People with “different views” and “professionals who are often criticised” have plenty of support from mainstream propaganda outlets.Kind regards,CatReport commentReply Dear Moyu, I disagree with your thesis that “psychiatry nor diagnoses are (not) inherently problematic.” I previously compared prescribing Thalidomide to psychiatry because, like the irreversible damage Thalidomide causes, psychiatric practices also cause severe, and often irreversible damage, including to unborn humans and animals (Zanni, G., et al, 2025). Psychiatric diagnoses are not physical diseases of the brain; they are a “myth” (Szasz, T. 1961) of circular reasoning fallacy. They have no known biological origin, nor are there any tests to provide independent objective data in support of any psychiatric diagnosis (CEP, 2014). Psychiatry continually fails to identify and confirm any physical or chemical abnormality as a psychiatric ‘illness’ according to the Virchowian standard of disease (Breeding, J. 2014). If an individual exhibits multiple symptoms attributed to a ‘disorder’ from the Diagnostic and Statistical Manual, Fifth Edition, Text Revision (American Psychiatric Association., 2022) psychiatrists can diagnose them with a ‘mental illness’. Psychiatry alleges a person has a ‘mental illness’ because they display symptoms of an unproven condition; a form of circular logic that fails to identify or explain the cause of any diagnosis (Burstow, B., 2016). The foundational approach to psychiatric treatment involves brain-disabling interventions such as tranquillisers, stimulants, hallucinogens and painkillers that do not correct or improve the alleged brain dysfunction (Breggin, P. 1991). Wrongly labelled as ‘antidepressants’, ‘antipsychotics’, ‘mood stabilisers’ or ‘ADHD medication’ (Cima, R., 2025), these drugs cause a host of serious side effects, including emotional and behavioural alterations, chronic brain impairment and atrophy, chronic illness, neurotoxicity, addiction, akathisia, tardive dyskinesia, disability and premature death (Whitaker, R. 2010, Breggin, P. 1991, & Gotzsche, P. et al, 2015). The American Psychiatric Association claims that electroshock is superior to brain-disabling drugs for a variety of unproven ‘mental illnesses’, yet it admits that the distinct mechanisms by which it wields its consequences are “elusive” (Kritzer, M.D., et al, 2023, & Deng, Z.D., et al, 2023). Electroshock involves applying electricity to the brain of an anaesthetised individual through electrodes to induce a tonic-clonic seizure. It causes individuals to experience impaired judgment, headache, loss of personality, cardiac difficulties, emotional instability, nausea, temporary or enduring memory loss, stroke, disorientation, prolonged seizures, confusion, and death. The results worsen and are perpetual as they continue to be administered (Gotzsche, P., 2023; & Breggin, P.,1994). During psychiatric hospitalisation, an individual can legally be subjected to indefinite incarceration, physical and manual restraint, chemical restraint using brain-damaging drugs, solitary confinement, neurosurgery, and electroshock treatment. Psychiatric incarceration breaches the internationally ratified Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (United Nations, 1984) and the Convention on the Rights of Persons with Disability (United Nations, 2006). Furthermore, suicide in ‘mental health’ or psychiatric hospitals is fifty times higher than in the general population (Chammas, F., et al, 2022), and previous inpatients have suicide rates that are around thirty times greater than international rates (Chung, D. T., 2017). Whilst Thalidomide’s composition never changes, neither does psychiatry’s- it always causes harm. We should not “stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management.” Psychiatry is beyond repair and must be abolished. Furthermore, Mad In America is one of the few platforms that are brave enough to criticise psychiatry. People with “different views” and “professionals who are often criticised” have plenty of support from mainstream propaganda outlets. Kind regards, Cat Report comment Dear Moyu, I disagree with your thesis that “psychiatry nor diagnoses are (not) inherently problematic.” I previously compared prescribing Thalidomide to psychiatry because, like the irreversible damage Thalidomide causes, psychiatric practices also cause severe, and often irreversible damage, including to unborn humans and animals (Zanni, G., et al, 2025). Psychiatric diagnoses are not physical diseases of the brain; they are a “myth” (Szasz, T. 1961) of circular reasoning fallacy. They have no known biological origin, nor are there any tests to provide independent objective data in support of any psychiatric diagnosis (CEP, 2014). Psychiatry continually fails to identify and confirm any physical or chemical abnormality as a psychiatric ‘illness’ according to the Virchowian standard of disease (Breeding, J. 2014). If an individual exhibits multiple symptoms attributed to a ‘disorder’ from the Diagnostic and Statistical Manual, Fifth Edition, Text Revision (American Psychiatric Association., 2022) psychiatrists can diagnose them with a ‘mental illness’. Psychiatry alleges a person has a ‘mental illness’ because they display symptoms of an unproven condition; a form of circular logic that fails to identify or explain the cause of any diagnosis (Burstow, B., 2016). The foundational approach to psychiatric treatment involves brain-disabling interventions such as tranquillisers, stimulants, hallucinogens and painkillers that do not correct or improve the alleged brain dysfunction (Breggin, P. 1991). Wrongly labelled as ‘antidepressants’, ‘antipsychotics’, ‘mood stabilisers’ or ‘ADHD medication’ (Cima, R., 2025), these drugs cause a host of serious side effects, including emotional and behavioural alterations, chronic brain impairment and atrophy, chronic illness, neurotoxicity, addiction, akathisia, tardive dyskinesia, disability and premature death (Whitaker, R. 2010, Breggin, P. 1991, & Gotzsche, P. et al, 2015). The American Psychiatric Association claims that electroshock is superior to brain-disabling drugs for a variety of unproven ‘mental illnesses’, yet it admits that the distinct mechanisms by which it wields its consequences are “elusive” (Kritzer, M.D., et al, 2023, & Deng, Z.D., et al, 2023). Electroshock involves applying electricity to the brain of an anaesthetised individual through electrodes to induce a tonic-clonic seizure. It causes individuals to experience impaired judgment, headache, loss of personality, cardiac difficulties, emotional instability, nausea, temporary or enduring memory loss, stroke, disorientation, prolonged seizures, confusion, and death. The results worsen and are perpetual as they continue to be administered (Gotzsche, P., 2023; & Breggin, P.,1994). During psychiatric hospitalisation, an individual can legally be subjected to indefinite incarceration, physical and manual restraint, chemical restraint using brain-damaging drugs, solitary confinement, neurosurgery, and electroshock treatment. Psychiatric incarceration breaches the internationally ratified Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (United Nations, 1984) and the Convention on the Rights of Persons with Disability (United Nations, 2006). Furthermore, suicide in ‘mental health’ or psychiatric hospitals is fifty times higher than in the general population (Chammas, F., et al, 2022), and previous inpatients have suicide rates that are around thirty times greater than international rates (Chung, D. T., 2017). Whilst Thalidomide’s composition never changes, neither does psychiatry’s- it always causes harm. We should not “stand together and reflect on how to transform psychiatry into a discipline that prioritises healing over management.” Psychiatry is beyond repair and must be abolished. Furthermore, Mad In America is one of the few platforms that are brave enough to criticise psychiatry. People with “different views” and “professionals who are often criticised” have plenty of support from mainstream propaganda outlets. Kind regards, Cat Report comment Jonas Vennike DitlevsenJune 8, 2025 at 8:00 amI would, akin to @Cat, argue that whereas it absolutely is possible to receive genuinely good care within the psychiatric system, that is a result of a dissenting few working within the system. There defintitely are employees who offer compassion, understanding and equal footing. But the system and its underlying logic work in opposition to equality and empowerment. The pathologization of mental distress is a severe barrier to furthering our understanding of how to help people thrive.Report commentReplySteve McCreaJune 8, 2025 at 12:46 pmHaving been one of those dissenters, I can tell you that they get a lot of crap for offering compassion, understanding and equal footing. Those in charge seem to be categorically opposed to anything that empowers clients!Report commentReply I would, akin to @Cat, argue that whereas it absolutely is possible to receive genuinely good care within the psychiatric system, that is a result of a dissenting few working within the system. There defintitely are employees who offer compassion, understanding and equal footing. But the system and its underlying logic work in opposition to equality and empowerment. The pathologization of mental distress is a severe barrier to furthering our understanding of how to help people thrive. Report comment Steve McCreaJune 8, 2025 at 12:46 pmHaving been one of those dissenters, I can tell you that they get a lot of crap for offering compassion, understanding and equal footing. Those in charge seem to be categorically opposed to anything that empowers clients!Report commentReply Having been one of those dissenters, I can tell you that they get a lot of crap for offering compassion, understanding and equal footing. Those in charge seem to be categorically opposed to anything that empowers clients! Report comment I would, akin to @Cat, argue that whereas it absolutely is possible to receive genuinely good care within the psychiatric system, that is a result of a dissenting few working within the system. There defintitely are employees who offer compassion, understanding and equal footing. But the system and its underlying logic work in opposition to equality and empowerment. The pathologization of mental distress is a severe barrier to furthering our understanding of how to help people thrive. Report comment Steve McCreaJune 8, 2025 at 12:46 pmHaving been one of those dissenters, I can tell you that they get a lot of crap for offering compassion, understanding and equal footing. Those in charge seem to be categorically opposed to anything that empowers clients!Report commentReply Having been one of those dissenters, I can tell you that they get a lot of crap for offering compassion, understanding and equal footing. Those in charge seem to be categorically opposed to anything that empowers clients! Report comment Having been one of those dissenters, I can tell you that they get a lot of crap for offering compassion, understanding and equal footing. Those in charge seem to be categorically opposed to anything that empowers clients! Report comment Moyu Watari-AlvarezJune 10, 2025 at 4:07 amThank you all again for your thoughtful feedback and references.I would just like to clarify that I am not claiming that psychiatry has never caused irreversible harm, nor that the call for depsychiatrisation presented in the article is unjustified.However, when I reflect on the history of psychiatry in Germany, I recognise significant developments over the past 80 to 90 years. These range from the systematic killing of people with mental health conditions and disabilities under the Nazi regime to the Psychiatrie-Enquete of the 1970s, which initiated important deinstitutionalisation reforms and a shift towards more patient-centred care. More recently, the S3 Guidelines on Schizophrenia have acknowledged the importance of quality of life for those affected and recommended using the lowest possible dose of neuroleptics.Such progress would hardly have been possible without the persistent efforts of psychiatry’s critics. This is precisely why I think it’s important that everyone is free to live life as they personally see fit. Our social fabric depends on a diversity of opinions and beliefs, shaped by individual experiences, hopes and expectations. Ultimately, only what proves to be sustainable will endure, whatever ‘sustainable’ may mean in this context.Report commentReply Thank you all again for your thoughtful feedback and references. I would just like to clarify that I am not claiming that psychiatry has never caused irreversible harm, nor that the call for depsychiatrisation presented in the article is unjustified. However, when I reflect on the history of psychiatry in Germany, I recognise significant developments over the past 80 to 90 years. These range from the systematic killing of people with mental health conditions and disabilities under the Nazi regime to the Psychiatrie-Enquete of the 1970s, which initiated important deinstitutionalisation reforms and a shift towards more patient-centred care. More recently, the S3 Guidelines on Schizophrenia have acknowledged the importance of quality of life for those affected and recommended using the lowest possible dose of neuroleptics. Such progress would hardly have been possible without the persistent efforts of psychiatry’s critics. This is precisely why I think it’s important that everyone is free to live life as they personally see fit. Our social fabric depends on a diversity of opinions and beliefs, shaped by individual experiences, hopes and expectations. Ultimately, only what proves to be sustainable will endure, whatever ‘sustainable’ may mean in this context. Report comment Thank you all again for your thoughtful feedback and references. I would just like to clarify that I am not claiming that psychiatry has never caused irreversible harm, nor that the call for depsychiatrisation presented in the article is unjustified. However, when I reflect on the history of psychiatry in Germany, I recognise significant developments over the past 80 to 90 years. These range from the systematic killing of people with mental health conditions and disabilities under the Nazi regime to the Psychiatrie-Enquete of the 1970s, which initiated important deinstitutionalisation reforms and a shift towards more patient-centred care. More recently, the S3 Guidelines on Schizophrenia have acknowledged the importance of quality of life for those affected and recommended using the lowest possible dose of neuroleptics. Such progress would hardly have been possible without the persistent efforts of psychiatry’s critics. This is precisely why I think it’s important that everyone is free to live life as they personally see fit. Our social fabric depends on a diversity of opinions and beliefs, shaped by individual experiences, hopes and expectations. Ultimately, only what proves to be sustainable will endure, whatever ‘sustainable’ may mean in this context. Report comment BirdsongJune 6, 2025 at 4:14 pmThank you very much for writing such a sensitive, thoughtfully crafted article. Rehumanization is the only way to undo the extensive harm psychiatric labeling, and psychiatrization in general, keeps doing to people’s self-concept, especially over time, not to mention the harmful dynamics psychiatrization creates in the minds of the people in their orbit and beyond.The key is seeing people as people, NOT as a psychiatric label in any way, shape, or form. Psychiatrization is a social malady practiced on the daily by psych professionals of all stripes. Indeed, today we live in the dark ages in this regard. It’s a worldwide case of thought pollution and soul denigration.Hopefully enough people will eventually get to a place where psych professionals of any kind are rarely needed. This would be an important element of depsychiatrization because the very idea of a “psych “professional” of any kind comes with the harmful assumption that a power imbalance is necessary for “therapy” to be “legitimate”.P.S. I hope your work addresses the unfortunate proliferation of the term “narcissist” in all its manifestations. I fail to see the advantage of it—except perhaps for those psych professionals who get their kicks and bucks from repeatedly saying it.Report commentReplyJonas Vennike DitlevsenJune 8, 2025 at 8:06 amYes! Having debated psychiatry from a critical angle for a few years, I’ve often been asked: “OK, so what’s the alternative?”And though I’ve been hesitant to point to any specific course away from psychiatry, I’ve come to the conclusion that I do in fact want to reccommend a specific alternative, which is basing alternative systems on peer philosophy. Not just in the sense that some people are peers due to having been patients, but that we are all peers as humans. In a peer-based system, no one would be hired on basis of their specific education. Rather, their experience in and attitude towards helping those in distress would matter the most. ORganizations like Leeds Survivor Led Crisis Service (UK) and The Wildflower Alliance (US) are prime examples of how to engage in community-reaching, peer-based mental health services.Psychiatry has done immense harm to our ability to understand each other as people. Narcissism is an example of that. So is what psychiatry calls ‘borderline’, which is in effect just oldschool misogyny and class-oppression in disguise.Report commentReplySteve McCreaJune 8, 2025 at 12:45 pmI have to say, I’ve always wondered why something proven to be destructive needs an “alternative” before we stop doing it?Report commentReplyBirdsongJune 8, 2025 at 2:09 pm“Psychiatry has done immense harm to our ability to understand each other as people. Narcissism is an example of that. So is what psychiatry calls ‘borderline’, which is in effect just oldschool misogyny and class oppression in disguise.”HARD YES.Psychiatry is the embodiment of institutionalized bigotry.Report commentReplyBirdsongJune 9, 2025 at 1:57 pm“…I’ve come to the conclusion that I do in fact want to recommend a specific alternative, which is basing systems on peer philosophy. Not just in the sense that some people are peers due to having been patients, but that we are all peers as humans. In a peer-based system, no one would be hired on basis of their specific education. Rather their experience in and attitude towards helping those in distress would matter most.”Thank you. That’s the kind of insight and vision that’s truly needed.My self-concept—as well as how I feel about life in general—quickly began to turn around as soon as I started taking seriously the keen and kindly insights from people outside the so-called “mental health system”, from people with no desire to reinforce diagnostic categorizations, from people who don’t live in silos of pathology.Nothing’s more healing than talking with people who have no interest in or use for diagnostic framing.Report commentReply Thank you very much for writing such a sensitive, thoughtfully crafted article. Rehumanization is the only way to undo the extensive harm psychiatric labeling, and psychiatrization in general, keeps doing to people’s self-concept, especially over time, not to mention the harmful dynamics psychiatrization creates in the minds of the people in their orbit and beyond. The key is seeing people as people, NOT as a psychiatric label in any way, shape, or form. Psychiatrization is a social malady practiced on the daily by psych professionals of all stripes. Indeed, today we live in the dark ages in this regard. It’s a worldwide case of thought pollution and soul denigration. Hopefully enough people will eventually get to a place where psych professionals of any kind are rarely needed. This would be an important element of depsychiatrization because the very idea of a “psych “professional” of any kind comes with the harmful assumption that a power imbalance is necessary for “therapy” to be “legitimate”. P.S. I hope your work addresses the unfortunate proliferation of the term “narcissist” in all its manifestations. I fail to see the advantage of it—except perhaps for those psych professionals who get their kicks and bucks from repeatedly saying it. Report comment Jonas Vennike DitlevsenJune 8, 2025 at 8:06 amYes! Having debated psychiatry from a critical angle for a few years, I’ve often been asked: “OK, so what’s the alternative?”And though I’ve been hesitant to point to any specific course away from psychiatry, I’ve come to the conclusion that I do in fact want to reccommend a specific alternative, which is basing alternative systems on peer philosophy. Not just in the sense that some people are peers due to having been patients, but that we are all peers as humans. In a peer-based system, no one would be hired on basis of their specific education. Rather, their experience in and attitude towards helping those in distress would matter the most. ORganizations like Leeds Survivor Led Crisis Service (UK) and The Wildflower Alliance (US) are prime examples of how to engage in community-reaching, peer-based mental health services.Psychiatry has done immense harm to our ability to understand each other as people. Narcissism is an example of that. So is what psychiatry calls ‘borderline’, which is in effect just oldschool misogyny and class-oppression in disguise.Report commentReplySteve McCreaJune 8, 2025 at 12:45 pmI have to say, I’ve always wondered why something proven to be destructive needs an “alternative” before we stop doing it?Report commentReplyBirdsongJune 8, 2025 at 2:09 pm“Psychiatry has done immense harm to our ability to understand each other as people. Narcissism is an example of that. So is what psychiatry calls ‘borderline’, which is in effect just oldschool misogyny and class oppression in disguise.”HARD YES.Psychiatry is the embodiment of institutionalized bigotry.Report commentReplyBirdsongJune 9, 2025 at 1:57 pm“…I’ve come to the conclusion that I do in fact want to recommend a specific alternative, which is basing systems on peer philosophy. Not just in the sense that some people are peers due to having been patients, but that we are all peers as humans. In a peer-based system, no one would be hired on basis of their specific education. Rather their experience in and attitude towards helping those in distress would matter most.”Thank you. That’s the kind of insight and vision that’s truly needed.My self-concept—as well as how I feel about life in general—quickly began to turn around as soon as I started taking seriously the keen and kindly insights from people outside the so-called “mental health system”, from people with no desire to reinforce diagnostic categorizations, from people who don’t live in silos of pathology.Nothing’s more healing than talking with people who have no interest in or use for diagnostic framing.Report commentReply Yes! Having debated psychiatry from a critical angle for a few years, I’ve often been asked: “OK, so what’s the alternative?” And though I’ve been hesitant to point to any specific course away from psychiatry, I’ve come to the conclusion that I do in fact want to reccommend a specific alternative, which is basing alternative systems on peer philosophy. Not just in the sense that some people are peers due to having been patients, but that we are all peers as humans. In a peer-based system, no one would be hired on basis of their specific education. Rather, their experience in and attitude towards helping those in distress would matter the most. ORganizations like Leeds Survivor Led Crisis Service (UK) and The Wildflower Alliance (US) are prime examples of how to engage in community-reaching, peer-based mental health services. Psychiatry has done immense harm to our ability to understand each other as people. Narcissism is an example of that. So is what psychiatry calls ‘borderline’, which is in effect just oldschool misogyny and class-oppression in disguise. Report comment Steve McCreaJune 8, 2025 at 12:45 pmI have to say, I’ve always wondered why something proven to be destructive needs an “alternative” before we stop doing it?Report commentReply I have to say, I’ve always wondered why something proven to be destructive needs an “alternative” before we stop doing it? Report comment BirdsongJune 8, 2025 at 2:09 pm“Psychiatry has done immense harm to our ability to understand each other as people. Narcissism is an example of that. So is what psychiatry calls ‘borderline’, which is in effect just oldschool misogyny and class oppression in disguise.”HARD YES.Psychiatry is the embodiment of institutionalized bigotry.Report commentReply “Psychiatry has done immense harm to our ability to understand each other as people. Narcissism is an example of that. So is what psychiatry calls ‘borderline’, which is in effect just oldschool misogyny and class oppression in disguise.” HARD YES. Psychiatry is the embodiment of institutionalized bigotry. Report comment BirdsongJune 9, 2025 at 1:57 pm“…I’ve come to the conclusion that I do in fact want to recommend a specific alternative, which is basing systems on peer philosophy. Not just in the sense that some people are peers due to having been patients, but that we are all peers as humans. In a peer-based system, no one would be hired on basis of their specific education. Rather their experience in and attitude towards helping those in distress would matter most.”Thank you. That’s the kind of insight and vision that’s truly needed.My self-concept—as well as how I feel about life in general—quickly began to turn around as soon as I started taking seriously the keen and kindly insights from people outside the so-called “mental health system”, from people with no desire to reinforce diagnostic categorizations, from people who don’t live in silos of pathology.Nothing’s more healing than talking with people who have no interest in or use for diagnostic framing.Report commentReply “…I’ve come to the conclusion that I do in fact want to recommend a specific alternative, which is basing systems on peer philosophy. Not just in the sense that some people are peers due to having been patients, but that we are all peers as humans. In a peer-based system, no one would be hired on basis of their specific education. Rather their experience in and attitude towards helping those in distress would matter most.” Thank you. That’s the kind of insight and vision that’s truly needed. My self-concept—as well as how I feel about life in general—quickly began to turn around as soon as I started taking seriously the keen and kindly insights from people outside the so-called “mental health system”, from people with no desire to reinforce diagnostic categorizations, from people who don’t live in silos of pathology. Nothing’s more healing than talking with people who have no interest in or use for diagnostic framing. Report comment Thank you very much for writing such a sensitive, thoughtfully crafted article. Rehumanization is the only way to undo the extensive harm psychiatric labeling, and psychiatrization in general, keeps doing to people’s self-concept, especially over time, not to mention the harmful dynamics psychiatrization creates in the minds of the people in their orbit and beyond. The key is seeing people as people, NOT as a psychiatric label in any way, shape, or form. Psychiatrization is a social malady practiced on the daily by psych professionals of all stripes. Indeed, today we live in the dark ages in this regard. It’s a worldwide case of thought pollution and soul denigration. Hopefully enough people will eventually get to a place where psych professionals of any kind are rarely needed. This would be an important element of depsychiatrization because the very idea of a “psych “professional” of any kind comes with the harmful assumption that a power imbalance is necessary for “therapy” to be “legitimate”. P.S. I hope your work addresses the unfortunate proliferation of the term “narcissist” in all its manifestations. I fail to see the advantage of it—except perhaps for those psych professionals who get their kicks and bucks from repeatedly saying it. Report comment Jonas Vennike DitlevsenJune 8, 2025 at 8:06 amYes! Having debated psychiatry from a critical angle for a few years, I’ve often been asked: “OK, so what’s the alternative?”And though I’ve been hesitant to point to any specific course away from psychiatry, I’ve come to the conclusion that I do in fact want to reccommend a specific alternative, which is basing alternative systems on peer philosophy. Not just in the sense that some people are peers due to having been patients, but that we are all peers as humans. In a peer-based system, no one would be hired on basis of their specific education. Rather, their experience in and attitude towards helping those in distress would matter the most. ORganizations like Leeds Survivor Led Crisis Service (UK) and The Wildflower Alliance (US) are prime examples of how to engage in community-reaching, peer-based mental health services.Psychiatry has done immense harm to our ability to understand each other as people. Narcissism is an example of that. So is what psychiatry calls ‘borderline’, which is in effect just oldschool misogyny and class-oppression in disguise.Report commentReplySteve McCreaJune 8, 2025 at 12:45 pmI have to say, I’ve always wondered why something proven to be destructive needs an “alternative” before we stop doing it?Report commentReplyBirdsongJune 8, 2025 at 2:09 pm“Psychiatry has done immense harm to our ability to understand each other as people. Narcissism is an example of that. So is what psychiatry calls ‘borderline’, which is in effect just oldschool misogyny and class oppression in disguise.”HARD YES.Psychiatry is the embodiment of institutionalized bigotry.Report commentReplyBirdsongJune 9, 2025 at 1:57 pm“…I’ve come to the conclusion that I do in fact want to recommend a specific alternative, which is basing systems on peer philosophy. Not just in the sense that some people are peers due to having been patients, but that we are all peers as humans. In a peer-based system, no one would be hired on basis of their specific education. Rather their experience in and attitude towards helping those in distress would matter most.”Thank you. That’s the kind of insight and vision that’s truly needed.My self-concept—as well as how I feel about life in general—quickly began to turn around as soon as I started taking seriously the keen and kindly insights from people outside the so-called “mental health system”, from people with no desire to reinforce diagnostic categorizations, from people who don’t live in silos of pathology.Nothing’s more healing than talking with people who have no interest in or use for diagnostic framing.Report commentReply Yes! Having debated psychiatry from a critical angle for a few years, I’ve often been asked: “OK, so what’s the alternative?” And though I’ve been hesitant to point to any specific course away from psychiatry, I’ve come to the conclusion that I do in fact want to reccommend a specific alternative, which is basing alternative systems on peer philosophy. Not just in the sense that some people are peers due to having been patients, but that we are all peers as humans. In a peer-based system, no one would be hired on basis of their specific education. Rather, their experience in and attitude towards helping those in distress would matter the most. ORganizations like Leeds Survivor Led Crisis Service (UK) and The Wildflower Alliance (US) are prime examples of how to engage in community-reaching, peer-based mental health services. Psychiatry has done immense harm to our ability to understand each other as people. Narcissism is an example of that. So is what psychiatry calls ‘borderline’, which is in effect just oldschool misogyny and class-oppression in disguise. Report comment Steve McCreaJune 8, 2025 at 12:45 pmI have to say, I’ve always wondered why something proven to be destructive needs an “alternative” before we stop doing it?Report commentReply I have to say, I’ve always wondered why something proven to be destructive needs an “alternative” before we stop doing it? Report comment BirdsongJune 8, 2025 at 2:09 pm“Psychiatry has done immense harm to our ability to understand each other as people. Narcissism is an example of that. So is what psychiatry calls ‘borderline’, which is in effect just oldschool misogyny and class oppression in disguise.”HARD YES.Psychiatry is the embodiment of institutionalized bigotry.Report commentReply “Psychiatry has done immense harm to our ability to understand each other as people. Narcissism is an example of that. So is what psychiatry calls ‘borderline’, which is in effect just oldschool misogyny and class oppression in disguise.” HARD YES. Psychiatry is the embodiment of institutionalized bigotry. Report comment BirdsongJune 9, 2025 at 1:57 pm“…I’ve come to the conclusion that I do in fact want to recommend a specific alternative, which is basing systems on peer philosophy. Not just in the sense that some people are peers due to having been patients, but that we are all peers as humans. In a peer-based system, no one would be hired on basis of their specific education. Rather their experience in and attitude towards helping those in distress would matter most.”Thank you. That’s the kind of insight and vision that’s truly needed.My self-concept—as well as how I feel about life in general—quickly began to turn around as soon as I started taking seriously the keen and kindly insights from people outside the so-called “mental health system”, from people with no desire to reinforce diagnostic categorizations, from people who don’t live in silos of pathology.Nothing’s more healing than talking with people who have no interest in or use for diagnostic framing.Report commentReply “…I’ve come to the conclusion that I do in fact want to recommend a specific alternative, which is basing systems on peer philosophy. Not just in the sense that some people are peers due to having been patients, but that we are all peers as humans. In a peer-based system, no one would be hired on basis of their specific education. Rather their experience in and attitude towards helping those in distress would matter most.” Thank you. That’s the kind of insight and vision that’s truly needed. My self-concept—as well as how I feel about life in general—quickly began to turn around as soon as I started taking seriously the keen and kindly insights from people outside the so-called “mental health system”, from people with no desire to reinforce diagnostic categorizations, from people who don’t live in silos of pathology. Nothing’s more healing than talking with people who have no interest in or use for diagnostic framing. Report comment Yes! Having debated psychiatry from a critical angle for a few years, I’ve often been asked: “OK, so what’s the alternative?” And though I’ve been hesitant to point to any specific course away from psychiatry, I’ve come to the conclusion that I do in fact want to reccommend a specific alternative, which is basing alternative systems on peer philosophy. Not just in the sense that some people are peers due to having been patients, but that we are all peers as humans. In a peer-based system, no one would be hired on basis of their specific education. Rather, their experience in and attitude towards helping those in distress would matter the most. ORganizations like Leeds Survivor Led Crisis Service (UK) and The Wildflower Alliance (US) are prime examples of how to engage in community-reaching, peer-based mental health services. Psychiatry has done immense harm to our ability to understand each other as people. Narcissism is an example of that. So is what psychiatry calls ‘borderline’, which is in effect just oldschool misogyny and class-oppression in disguise. Report comment Steve McCreaJune 8, 2025 at 12:45 pmI have to say, I’ve always wondered why something proven to be destructive needs an “alternative” before we stop doing it?Report commentReply I have to say, I’ve always wondered why something proven to be destructive needs an “alternative” before we stop doing it? Report comment I have to say, I’ve always wondered why something proven to be destructive needs an “alternative” before we stop doing it? Report comment BirdsongJune 8, 2025 at 2:09 pm“Psychiatry has done immense harm to our ability to understand each other as people. Narcissism is an example of that. So is what psychiatry calls ‘borderline’, which is in effect just oldschool misogyny and class oppression in disguise.”HARD YES.Psychiatry is the embodiment of institutionalized bigotry.Report commentReply “Psychiatry has done immense harm to our ability to understand each other as people. Narcissism is an example of that. So is what psychiatry calls ‘borderline’, which is in effect just oldschool misogyny and class oppression in disguise.” HARD YES. Psychiatry is the embodiment of institutionalized bigotry. Report comment “Psychiatry has done immense harm to our ability to understand each other as people. Narcissism is an example of that. So is what psychiatry calls ‘borderline’, which is in effect just oldschool misogyny and class oppression in disguise.” HARD YES. Psychiatry is the embodiment of institutionalized bigotry. Report comment BirdsongJune 9, 2025 at 1:57 pm“…I’ve come to the conclusion that I do in fact want to recommend a specific alternative, which is basing systems on peer philosophy. Not just in the sense that some people are peers due to having been patients, but that we are all peers as humans. In a peer-based system, no one would be hired on basis of their specific education. Rather their experience in and attitude towards helping those in distress would matter most.”Thank you. That’s the kind of insight and vision that’s truly needed.My self-concept—as well as how I feel about life in general—quickly began to turn around as soon as I started taking seriously the keen and kindly insights from people outside the so-called “mental health system”, from people with no desire to reinforce diagnostic categorizations, from people who don’t live in silos of pathology.Nothing’s more healing than talking with people who have no interest in or use for diagnostic framing.Report commentReply “…I’ve come to the conclusion that I do in fact want to recommend a specific alternative, which is basing systems on peer philosophy. Not just in the sense that some people are peers due to having been patients, but that we are all peers as humans. In a peer-based system, no one would be hired on basis of their specific education. Rather their experience in and attitude towards helping those in distress would matter most.” Thank you. That’s the kind of insight and vision that’s truly needed. My self-concept—as well as how I feel about life in general—quickly began to turn around as soon as I started taking seriously the keen and kindly insights from people outside the so-called “mental health system”, from people with no desire to reinforce diagnostic categorizations, from people who don’t live in silos of pathology. Nothing’s more healing than talking with people who have no interest in or use for diagnostic framing. Report comment “…I’ve come to the conclusion that I do in fact want to recommend a specific alternative, which is basing systems on peer philosophy. Not just in the sense that some people are peers due to having been patients, but that we are all peers as humans. In a peer-based system, no one would be hired on basis of their specific education. Rather their experience in and attitude towards helping those in distress would matter most.” Thank you. That’s the kind of insight and vision that’s truly needed. My self-concept—as well as how I feel about life in general—quickly began to turn around as soon as I started taking seriously the keen and kindly insights from people outside the so-called “mental health system”, from people with no desire to reinforce diagnostic categorizations, from people who don’t live in silos of pathology. Nothing’s more healing than talking with people who have no interest in or use for diagnostic framing. Report comment CatJune 7, 2025 at 9:04 pmDear Jonas,You mentioned the role of individual therapy alongside the possibilities for group and community-based depsychiatrization. It’s crucial to recognise, however, that many individuals embark on this journey alone.In my own experience, I ultimately decided to cease consultations with my psychiatrist, psychologist, and medical doctor after developing severe akathisia. This distressing symptom culminated in an involuntary hospitalization characterized by coercive practices, violence, and the administration of excessive pharmacological interventions. As a result, I undertook self-directed depsychiatrization, conducting a comprehensive review of relevant literature, including peer-reviewed articles and online resources, as well as engaging with insights from the psychiatry-survivor community. After a duration of twenty-two years on a regimen of three neurotoxic drugs, I successfully tapered off these substances with the assistance of microdoses of cannabis, achieved without any professional intervention.I urge you to consider the diverse and multifaceted pathways through which individuals can attain similar outcomes, particularly those that are self-initiated. This perspective is especially important given the potential for ‘professionals’ and systemic structures to cause significant, lasting harm.Kind regards,CatReport commentReplyJonas Vennike DitlevsenJune 8, 2025 at 8:12 amYou’re absolutely right. And that’s why the coming anthology “Depsychiatrization” based on the framework offered in this article here will both be intended as a professional’s and a personal guide to depsychiatrization. Realizing the illusory nature of the confines that psychiatry imposes is a powerful force that many will be able to utilize on their own. And even support each other in doing so. The anthology itself will present a multitude of perspectives on the potential in depsychiatrizing both individuals and the culture, but I also intend to include a step-by-step guide on where to find relevant knowledge and common experiences that one may have when beginning to oppose or resist diagnostical self-concepts.Whenever I’m asked about the best alternative to psychiatry, I point to peer-based philosophies and practices. People need people more than they need professionals, be it psychiatrists, psyhologists or w/e. I’m proud of the work I’m doing and grateful that my title opens some doors into public debate. But I’m also a strong advocate for doing away with all this title-based bullshit. I’m good at helpling people because that’s what I’ve trained to do and because I’ve learned both values and tools from some really awesome people.Report commentReplySteve McCreaJune 8, 2025 at 12:43 pmMost of what I know about being a good “helper” I learned from the people I was trying to help. Psychology has a few techniques that can be handy at times but no real curative plan. The best advice I got about this came from Milton Erickson, who said you have to re-invent “therapy” for every single person you’re trying to help. This means listening and getting to know the person from THEIR viewpoint rather than forcing them into some preconceived theoretical mold. I’ve always maintained that the client is the only one who knows the right answers for them, and our job is simply to help them find them and recognize their own solutions for what they are. It doesn’t take a degree or any specific training to do that. In fact, I don’t think you CAN train anyone to do that. It has to come from the heart!Report commentReplyBirdsongJune 8, 2025 at 3:04 pm“People need people more than they need professionals, …”Unfortunately, saying that to a professional a good way of getting yourself “diagnosed”—and punitively at that!Report commentReply Dear Jonas, You mentioned the role of individual therapy alongside the possibilities for group and community-based depsychiatrization. It’s crucial to recognise, however, that many individuals embark on this journey alone. In my own experience, I ultimately decided to cease consultations with my psychiatrist, psychologist, and medical doctor after developing severe akathisia. This distressing symptom culminated in an involuntary hospitalization characterized by coercive practices, violence, and the administration of excessive pharmacological interventions. As a result, I undertook self-directed depsychiatrization, conducting a comprehensive review of relevant literature, including peer-reviewed articles and online resources, as well as engaging with insights from the psychiatry-survivor community. After a duration of twenty-two years on a regimen of three neurotoxic drugs, I successfully tapered off these substances with the assistance of microdoses of cannabis, achieved without any professional intervention. I urge you to consider the diverse and multifaceted pathways through which individuals can attain similar outcomes, particularly those that are self-initiated. This perspective is especially important given the potential for ‘professionals’ and systemic structures to cause significant, lasting harm. Kind regards, Cat Report comment Jonas Vennike DitlevsenJune 8, 2025 at 8:12 amYou’re absolutely right. And that’s why the coming anthology “Depsychiatrization” based on the framework offered in this article here will both be intended as a professional’s and a personal guide to depsychiatrization. Realizing the illusory nature of the confines that psychiatry imposes is a powerful force that many will be able to utilize on their own. And even support each other in doing so. The anthology itself will present a multitude of perspectives on the potential in depsychiatrizing both individuals and the culture, but I also intend to include a step-by-step guide on where to find relevant knowledge and common experiences that one may have when beginning to oppose or resist diagnostical self-concepts.Whenever I’m asked about the best alternative to psychiatry, I point to peer-based philosophies and practices. People need people more than they need professionals, be it psychiatrists, psyhologists or w/e. I’m proud of the work I’m doing and grateful that my title opens some doors into public debate. But I’m also a strong advocate for doing away with all this title-based bullshit. I’m good at helpling people because that’s what I’ve trained to do and because I’ve learned both values and tools from some really awesome people.Report commentReplySteve McCreaJune 8, 2025 at 12:43 pmMost of what I know about being a good “helper” I learned from the people I was trying to help. Psychology has a few techniques that can be handy at times but no real curative plan. The best advice I got about this came from Milton Erickson, who said you have to re-invent “therapy” for every single person you’re trying to help. This means listening and getting to know the person from THEIR viewpoint rather than forcing them into some preconceived theoretical mold. I’ve always maintained that the client is the only one who knows the right answers for them, and our job is simply to help them find them and recognize their own solutions for what they are. It doesn’t take a degree or any specific training to do that. In fact, I don’t think you CAN train anyone to do that. It has to come from the heart!Report commentReplyBirdsongJune 8, 2025 at 3:04 pm“People need people more than they need professionals, …”Unfortunately, saying that to a professional a good way of getting yourself “diagnosed”—and punitively at that!Report commentReply You’re absolutely right. And that’s why the coming anthology “Depsychiatrization” based on the framework offered in this article here will both be intended as a professional’s and a personal guide to depsychiatrization. Realizing the illusory nature of the confines that psychiatry imposes is a powerful force that many will be able to utilize on their own. And even support each other in doing so. The anthology itself will present a multitude of perspectives on the potential in depsychiatrizing both individuals and the culture, but I also intend to include a step-by-step guide on where to find relevant knowledge and common experiences that one may have when beginning to oppose or resist diagnostical self-concepts. Whenever I’m asked about the best alternative to psychiatry, I point to peer-based philosophies and practices. People need people more than they need professionals, be it psychiatrists, psyhologists or w/e. I’m proud of the work I’m doing and grateful that my title opens some doors into public debate. But I’m also a strong advocate for doing away with all this title-based bullshit. I’m good at helpling people because that’s what I’ve trained to do and because I’ve learned both values and tools from some really awesome people. Report comment Steve McCreaJune 8, 2025 at 12:43 pmMost of what I know about being a good “helper” I learned from the people I was trying to help. Psychology has a few techniques that can be handy at times but no real curative plan. The best advice I got about this came from Milton Erickson, who said you have to re-invent “therapy” for every single person you’re trying to help. This means listening and getting to know the person from THEIR viewpoint rather than forcing them into some preconceived theoretical mold. I’ve always maintained that the client is the only one who knows the right answers for them, and our job is simply to help them find them and recognize their own solutions for what they are. It doesn’t take a degree or any specific training to do that. In fact, I don’t think you CAN train anyone to do that. It has to come from the heart!Report commentReply Most of what I know about being a good “helper” I learned from the people I was trying to help. Psychology has a few techniques that can be handy at times but no real curative plan. The best advice I got about this came from Milton Erickson, who said you have to re-invent “therapy” for every single person you’re trying to help. This means listening and getting to know the person from THEIR viewpoint rather than forcing them into some preconceived theoretical mold. I’ve always maintained that the client is the only one who knows the right answers for them, and our job is simply to help them find them and recognize their own solutions for what they are. It doesn’t take a degree or any specific training to do that. In fact, I don’t think you CAN train anyone to do that. It has to come from the heart! Report comment BirdsongJune 8, 2025 at 3:04 pm“People need people more than they need professionals, …”Unfortunately, saying that to a professional a good way of getting yourself “diagnosed”—and punitively at that!Report commentReply “People need people more than they need professionals, …” Unfortunately, saying that to a professional a good way of getting yourself “diagnosed”—and punitively at that! Report comment Dear Jonas, You mentioned the role of individual therapy alongside the possibilities for group and community-based depsychiatrization. It’s crucial to recognise, however, that many individuals embark on this journey alone. In my own experience, I ultimately decided to cease consultations with my psychiatrist, psychologist, and medical doctor after developing severe akathisia. This distressing symptom culminated in an involuntary hospitalization characterized by coercive practices, violence, and the administration of excessive pharmacological interventions. As a result, I undertook self-directed depsychiatrization, conducting a comprehensive review of relevant literature, including peer-reviewed articles and online resources, as well as engaging with insights from the psychiatry-survivor community. After a duration of twenty-two years on a regimen of three neurotoxic drugs, I successfully tapered off these substances with the assistance of microdoses of cannabis, achieved without any professional intervention. I urge you to consider the diverse and multifaceted pathways through which individuals can attain similar outcomes, particularly those that are self-initiated. This perspective is especially important given the potential for ‘professionals’ and systemic structures to cause significant, lasting harm. Kind regards, Cat Report comment Jonas Vennike DitlevsenJune 8, 2025 at 8:12 amYou’re absolutely right. And that’s why the coming anthology “Depsychiatrization” based on the framework offered in this article here will both be intended as a professional’s and a personal guide to depsychiatrization. Realizing the illusory nature of the confines that psychiatry imposes is a powerful force that many will be able to utilize on their own. And even support each other in doing so. The anthology itself will present a multitude of perspectives on the potential in depsychiatrizing both individuals and the culture, but I also intend to include a step-by-step guide on where to find relevant knowledge and common experiences that one may have when beginning to oppose or resist diagnostical self-concepts.Whenever I’m asked about the best alternative to psychiatry, I point to peer-based philosophies and practices. People need people more than they need professionals, be it psychiatrists, psyhologists or w/e. I’m proud of the work I’m doing and grateful that my title opens some doors into public debate. But I’m also a strong advocate for doing away with all this title-based bullshit. I’m good at helpling people because that’s what I’ve trained to do and because I’ve learned both values and tools from some really awesome people.Report commentReplySteve McCreaJune 8, 2025 at 12:43 pmMost of what I know about being a good “helper” I learned from the people I was trying to help. Psychology has a few techniques that can be handy at times but no real curative plan. The best advice I got about this came from Milton Erickson, who said you have to re-invent “therapy” for every single person you’re trying to help. This means listening and getting to know the person from THEIR viewpoint rather than forcing them into some preconceived theoretical mold. I’ve always maintained that the client is the only one who knows the right answers for them, and our job is simply to help them find them and recognize their own solutions for what they are. It doesn’t take a degree or any specific training to do that. In fact, I don’t think you CAN train anyone to do that. It has to come from the heart!Report commentReplyBirdsongJune 8, 2025 at 3:04 pm“People need people more than they need professionals, …”Unfortunately, saying that to a professional a good way of getting yourself “diagnosed”—and punitively at that!Report commentReply You’re absolutely right. And that’s why the coming anthology “Depsychiatrization” based on the framework offered in this article here will both be intended as a professional’s and a personal guide to depsychiatrization. Realizing the illusory nature of the confines that psychiatry imposes is a powerful force that many will be able to utilize on their own. And even support each other in doing so. The anthology itself will present a multitude of perspectives on the potential in depsychiatrizing both individuals and the culture, but I also intend to include a step-by-step guide on where to find relevant knowledge and common experiences that one may have when beginning to oppose or resist diagnostical self-concepts. Whenever I’m asked about the best alternative to psychiatry, I point to peer-based philosophies and practices. People need people more than they need professionals, be it psychiatrists, psyhologists or w/e. I’m proud of the work I’m doing and grateful that my title opens some doors into public debate. But I’m also a strong advocate for doing away with all this title-based bullshit. I’m good at helpling people because that’s what I’ve trained to do and because I’ve learned both values and tools from some really awesome people. Report comment Steve McCreaJune 8, 2025 at 12:43 pmMost of what I know about being a good “helper” I learned from the people I was trying to help. Psychology has a few techniques that can be handy at times but no real curative plan. The best advice I got about this came from Milton Erickson, who said you have to re-invent “therapy” for every single person you’re trying to help. This means listening and getting to know the person from THEIR viewpoint rather than forcing them into some preconceived theoretical mold. I’ve always maintained that the client is the only one who knows the right answers for them, and our job is simply to help them find them and recognize their own solutions for what they are. It doesn’t take a degree or any specific training to do that. In fact, I don’t think you CAN train anyone to do that. It has to come from the heart!Report commentReply Most of what I know about being a good “helper” I learned from the people I was trying to help. Psychology has a few techniques that can be handy at times but no real curative plan. The best advice I got about this came from Milton Erickson, who said you have to re-invent “therapy” for every single person you’re trying to help. This means listening and getting to know the person from THEIR viewpoint rather than forcing them into some preconceived theoretical mold. I’ve always maintained that the client is the only one who knows the right answers for them, and our job is simply to help them find them and recognize their own solutions for what they are. It doesn’t take a degree or any specific training to do that. In fact, I don’t think you CAN train anyone to do that. It has to come from the heart! Report comment BirdsongJune 8, 2025 at 3:04 pm“People need people more than they need professionals, …”Unfortunately, saying that to a professional a good way of getting yourself “diagnosed”—and punitively at that!Report commentReply “People need people more than they need professionals, …” Unfortunately, saying that to a professional a good way of getting yourself “diagnosed”—and punitively at that! Report comment You’re absolutely right. And that’s why the coming anthology “Depsychiatrization” based on the framework offered in this article here will both be intended as a professional’s and a personal guide to depsychiatrization. Realizing the illusory nature of the confines that psychiatry imposes is a powerful force that many will be able to utilize on their own. And even support each other in doing so. The anthology itself will present a multitude of perspectives on the potential in depsychiatrizing both individuals and the culture, but I also intend to include a step-by-step guide on where to find relevant knowledge and common experiences that one may have when beginning to oppose or resist diagnostical self-concepts. Whenever I’m asked about the best alternative to psychiatry, I point to peer-based philosophies and practices. People need people more than they need professionals, be it psychiatrists, psyhologists or w/e. I’m proud of the work I’m doing and grateful that my title opens some doors into public debate. But I’m also a strong advocate for doing away with all this title-based bullshit. I’m good at helpling people because that’s what I’ve trained to do and because I’ve learned both values and tools from some really awesome people. Report comment Steve McCreaJune 8, 2025 at 12:43 pmMost of what I know about being a good “helper” I learned from the people I was trying to help. Psychology has a few techniques that can be handy at times but no real curative plan. The best advice I got about this came from Milton Erickson, who said you have to re-invent “therapy” for every single person you’re trying to help. This means listening and getting to know the person from THEIR viewpoint rather than forcing them into some preconceived theoretical mold. I’ve always maintained that the client is the only one who knows the right answers for them, and our job is simply to help them find them and recognize their own solutions for what they are. It doesn’t take a degree or any specific training to do that. In fact, I don’t think you CAN train anyone to do that. It has to come from the heart!Report commentReply Most of what I know about being a good “helper” I learned from the people I was trying to help. Psychology has a few techniques that can be handy at times but no real curative plan. The best advice I got about this came from Milton Erickson, who said you have to re-invent “therapy” for every single person you’re trying to help. This means listening and getting to know the person from THEIR viewpoint rather than forcing them into some preconceived theoretical mold. I’ve always maintained that the client is the only one who knows the right answers for them, and our job is simply to help them find them and recognize their own solutions for what they are. It doesn’t take a degree or any specific training to do that. In fact, I don’t think you CAN train anyone to do that. It has to come from the heart! Report comment Most of what I know about being a good “helper” I learned from the people I was trying to help. Psychology has a few techniques that can be handy at times but no real curative plan. The best advice I got about this came from Milton Erickson, who said you have to re-invent “therapy” for every single person you’re trying to help. This means listening and getting to know the person from THEIR viewpoint rather than forcing them into some preconceived theoretical mold. I’ve always maintained that the client is the only one who knows the right answers for them, and our job is simply to help them find them and recognize their own solutions for what they are. It doesn’t take a degree or any specific training to do that. In fact, I don’t think you CAN train anyone to do that. It has to come from the heart! Report comment BirdsongJune 8, 2025 at 3:04 pm“People need people more than they need professionals, …”Unfortunately, saying that to a professional a good way of getting yourself “diagnosed”—and punitively at that!Report commentReply “People need people more than they need professionals, …” Unfortunately, saying that to a professional a good way of getting yourself “diagnosed”—and punitively at that! Report comment “People need people more than they need professionals, …” Unfortunately, saying that to a professional a good way of getting yourself “diagnosed”—and punitively at that! Report comment BillJune 9, 2025 at 8:27 amI was labelled when I was 17 years old, and being a minor I was involuntarily put into a local mental “health” facility. I got drugged with tranquilizers like thorazine in this lockdown facility. The drugs made the muscles in my body tighten up on one side all over my body and I laid on the floor ..couldnt talk..they gave me other kinds of muscle relaxant drugs to counteract the first drugs.I. was in a daze…just trying to do what they wanted so I might be let out. The psychiatrist sat on the other side of the room. I was quite scared of this guy. I made mistakes on some of my answers at first…but after a while I learned what he wanted me to say.I finally got let out after a month. Outpatient now. Heavily drugged. Barely functioning at school. Trying to graduate. …..I could write page after page of how the insane mental health system almost destroyed me.After 5 years of this criminal assault, including their attempt to change labels on me…I just stopped taking their chemical poison, cold turkey. Horrific side effects…stopped everything.I started getting better. I got a career going after a few years. Got married. Got a good life going.Got my best help from friends.Depsychiatrisation is what we need to save our kids right now.Report commentReply I was labelled when I was 17 years old, and being a minor I was involuntarily put into a local mental “health” facility. I got drugged with tranquilizers like thorazine in this lockdown facility. The drugs made the muscles in my body tighten up on one side all over my body and I laid on the floor ..couldnt talk..they gave me other kinds of muscle relaxant drugs to counteract the first drugs.I. was in a daze…just trying to do what they wanted so I might be let out. The psychiatrist sat on the other side of the room. I was quite scared of this guy. I made mistakes on some of my answers at first…but after a while I learned what he wanted me to say.I finally got let out after a month. Outpatient now. Heavily drugged. Barely functioning at school. Trying to graduate. …..I could write page after page of how the insane mental health system almost destroyed me.After 5 years of this criminal assault, including their attempt to change labels on me…I just stopped taking their chemical poison, cold turkey. Horrific side effects…stopped everything.I started getting better. I got a career going after a few years. Got married. Got a good life going.Got my best help from friends.Depsychiatrisation is what we need to save our kids right now. Report comment I was labelled when I was 17 years old, and being a minor I was involuntarily put into a local mental “health” facility. I got drugged with tranquilizers like thorazine in this lockdown facility. The drugs made the muscles in my body tighten up on one side all over my body and I laid on the floor ..couldnt talk..they gave me other kinds of muscle relaxant drugs to counteract the first drugs.I. was in a daze…just trying to do what they wanted so I might be let out. The psychiatrist sat on the other side of the room. I was quite scared of this guy. I made mistakes on some of my answers at first…but after a while I learned what he wanted me to say.I finally got let out after a month. Outpatient now. Heavily drugged. Barely functioning at school. Trying to graduate. …..I could write page after page of how the insane mental health system almost destroyed me.After 5 years of this criminal assault, including their attempt to change labels on me…I just stopped taking their chemical poison, cold turkey. Horrific side effects…stopped everything.I started getting better. I got a career going after a few years. Got married. Got a good life going.Got my best help from friends.Depsychiatrisation is what we need to save our kids right now. Report comment DogworldJune 9, 2025 at 2:57 pmThe problem with depsychiatrization as it’s often practiced is that we remove the language of psychiatry but keep its structure.We take away the diagnosis but keep the hierarchy.We reject the chemical imbalance, but accept the benevolent expert.Now, instead of being managed by a psychiatrist, we are guided by a therapist, a coach, a group leader—someone still in a position of power, still interpreting our pain for us, still being paid to help us become something better.This is where the story begins to repeat itself.It’s like the colonizer who changes his clothes and says:“I no longer bring chains or guns. I bring presence. I bring listening. I bring compassion.”And the colonized says:“Yes, but you still stand above me. You still ask me to speak so you can understand. You still position yourself as the one who gives me something I need—peace, healing, perspective. But I was not broken until I trusted someone like you the first time.”“If we are to depsychiatrize, then let’s truly de-internalize it. Let us not just replace the harshness of the institution with the warmth of a professional. Let us not treat your gentleness as liberation.”Because if we don’t name how the therapist fills the same emotional role psychiatry once did—offering regulated care in exchange for obedience, silence, or gratitude—then we are simply modernizing the colonizer’s strategy.Real depsychiatrization means not just removing the diagnosis.It means refusing to let anyone—no matter how kind—stand in the place where our own voice should be.It means remembering and recognizing:Even care can be a weapon.Even compassion can colonize.And even healing can be control—when it doesn’t come from within.Report commentReplyChristine BurnettJune 10, 2025 at 3:35 pmHi Dogworld,You said it well!! If we are going to have something better, I believe we would need a collective sharing of knowledge and working together. Personally, I feel that I have much more information of value from lived experience but I can see that isn’t valued. I found that professionals involved in critical psychiatry aren’t any more interested in what someone with lived experience can tell them than those who practice in the statue quo. They seem to equally push their view as proclaim experts.Report commentReply The problem with depsychiatrization as it’s often practiced is that we remove the language of psychiatry but keep its structure. We take away the diagnosis but keep the hierarchy.We reject the chemical imbalance, but accept the benevolent expert.Now, instead of being managed by a psychiatrist, we are guided by a therapist, a coach, a group leader—someone still in a position of power, still interpreting our pain for us, still being paid to help us become something better. This is where the story begins to repeat itself. It’s like the colonizer who changes his clothes and says:“I no longer bring chains or guns. I bring presence. I bring listening. I bring compassion.” And the colonized says:“Yes, but you still stand above me. You still ask me to speak so you can understand. You still position yourself as the one who gives me something I need—peace, healing, perspective. But I was not broken until I trusted someone like you the first time.” “If we are to depsychiatrize, then let’s truly de-internalize it. Let us not just replace the harshness of the institution with the warmth of a professional. Let us not treat your gentleness as liberation.” Because if we don’t name how the therapist fills the same emotional role psychiatry once did—offering regulated care in exchange for obedience, silence, or gratitude—then we are simply modernizing the colonizer’s strategy. Real depsychiatrization means not just removing the diagnosis.It means refusing to let anyone—no matter how kind—stand in the place where our own voice should be. It means remembering and recognizing:Even care can be a weapon.Even compassion can colonize.And even healing can be control—when it doesn’t come from within. Report comment Christine BurnettJune 10, 2025 at 3:35 pmHi Dogworld,You said it well!! If we are going to have something better, I believe we would need a collective sharing of knowledge and working together. Personally, I feel that I have much more information of value from lived experience but I can see that isn’t valued. I found that professionals involved in critical psychiatry aren’t any more interested in what someone with lived experience can tell them than those who practice in the statue quo. They seem to equally push their view as proclaim experts.Report commentReply Hi Dogworld,You said it well!! If we are going to have something better, I believe we would need a collective sharing of knowledge and working together. Personally, I feel that I have much more information of value from lived experience but I can see that isn’t valued. I found that professionals involved in critical psychiatry aren’t any more interested in what someone with lived experience can tell them than those who practice in the statue quo. They seem to equally push their view as proclaim experts. Report comment The problem with depsychiatrization as it’s often practiced is that we remove the language of psychiatry but keep its structure. We take away the diagnosis but keep the hierarchy.We reject the chemical imbalance, but accept the benevolent expert.Now, instead of being managed by a psychiatrist, we are guided by a therapist, a coach, a group leader—someone still in a position of power, still interpreting our pain for us, still being paid to help us become something better. This is where the story begins to repeat itself. It’s like the colonizer who changes his clothes and says:“I no longer bring chains or guns. I bring presence. I bring listening. I bring compassion.” And the colonized says:“Yes, but you still stand above me. You still ask me to speak so you can understand. You still position yourself as the one who gives me something I need—peace, healing, perspective. But I was not broken until I trusted someone like you the first time.” “If we are to depsychiatrize, then let’s truly de-internalize it. Let us not just replace the harshness of the institution with the warmth of a professional. Let us not treat your gentleness as liberation.” Because if we don’t name how the therapist fills the same emotional role psychiatry once did—offering regulated care in exchange for obedience, silence, or gratitude—then we are simply modernizing the colonizer’s strategy. Real depsychiatrization means not just removing the diagnosis.It means refusing to let anyone—no matter how kind—stand in the place where our own voice should be. It means remembering and recognizing:Even care can be a weapon.Even compassion can colonize.And even healing can be control—when it doesn’t come from within. Report comment Christine BurnettJune 10, 2025 at 3:35 pmHi Dogworld,You said it well!! If we are going to have something better, I believe we would need a collective sharing of knowledge and working together. Personally, I feel that I have much more information of value from lived experience but I can see that isn’t valued. I found that professionals involved in critical psychiatry aren’t any more interested in what someone with lived experience can tell them than those who practice in the statue quo. They seem to equally push their view as proclaim experts.Report commentReply Hi Dogworld,You said it well!! If we are going to have something better, I believe we would need a collective sharing of knowledge and working together. Personally, I feel that I have much more information of value from lived experience but I can see that isn’t valued. I found that professionals involved in critical psychiatry aren’t any more interested in what someone with lived experience can tell them than those who practice in the statue quo. They seem to equally push their view as proclaim experts. Report comment Hi Dogworld,You said it well!! If we are going to have something better, I believe we would need a collective sharing of knowledge and working together. Personally, I feel that I have much more information of value from lived experience but I can see that isn’t valued. I found that professionals involved in critical psychiatry aren’t any more interested in what someone with lived experience can tell them than those who practice in the statue quo. They seem to equally push their view as proclaim experts. Report comment **LEAVE A REPLYCancel reply** Save my name, email, and website in this browser for the next time I comment. Notify me of followup comments via e-mail. You can alsosubscribewithout commenting. Δ Sign-up to receive our weekly newsletter and other periodic updates. Email address Send me...Weekly NewsletterFamily NewsletterMIA Webinars and Other Educational Events **A Therapist Navigating Antidepressant Withdrawal: Nelson Lee on the Power of...** **“Progress Only Occurs when People Make Demands”: Paolo del Vecchio Reflects...** **The Poetics and Politics of Our Mental Health Metaphors: An Interview...** **The Weaponization of Woundedness: Feminist Scholars Examine Trauma Talk** **Why Psychiatry Trainees in France Want More Philosophy** **Researchers: “We Do Not Suggest” Antipsychotics for Depression** **Delusion or Design? Rethinking the Logic of Madness** **A Relationship Imbalance, Not A Chemical Imbalance** **Between Diagnoses and Dialogue: The Silent Conflict Between Psychiatry and Psychology** **Depression Caused by Kissing? Psychiatry Hits New Low with Clickbait Fear-Mongering** **The AI Who Helped Me Leave** Site Map"}