{"id": 157, "name": "Boston.com", "domain": "boston.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.boston.com/real-estate/real-estate-news/2025/06/08/renovated-office-building-near-old-state-house-hits-the-market-could-be-used-for-apartments/", "title": "Renovated Office Building Near Old State House Hits The Market Could Be Used For Apartments", "content": "Home NewsLocal NewsNational NewsPoliticsObituariesCrimeKaren ReadTraffic Local News National News Politics Obituaries Crime Karen Read Traffic Local News National News Politics Obituaries Crime Karen Read Traffic SportsCelticsRed SoxPatriotsBruinsFleetRevolutionJayson Tatum Celtics Red Sox Patriots Bruins Fleet Revolution Jayson Tatum Celtics Red Sox Patriots Bruins Fleet Revolution Jayson Tatum WeatherMapsStormsSnowSkiing ConditionsClimate Change Maps Storms Snow Skiing Conditions Climate Change Maps Storms Snow Skiing Conditions Climate Change Real EstateRenoDevelopmentsNewsBuyingOpen HousesRentingLuxury Reno Developments News Buying Open Houses Renting Luxury Reno Developments News Buying Open Houses Renting Luxury FoodRestaurantsNewsReviewsEventsBreweries & BarsClosingsOpeningsSign up for The Dish 🍽️ Restaurants News Reviews Events Breweries & Bars Closings Openings Sign up for The Dish 🍽️ Restaurants News Reviews Events Breweries & Bars Closings Openings Sign up for The Dish 🍽️ Love LettersLatest PostSend LetterAboutPodcastBookNewsletter Latest Post Send Letter About Podcast Book Newsletter Latest Post Send Letter About Podcast Book Newsletter CultureArtsEntertainmentMoviesTVStreamingCelebsMusicSign up for The Queue Arts Entertainment Movies TV Streaming Celebs Music Sign up for The Queue Arts Entertainment Movies TV Streaming Celebs Music Sign up for The Queue Things To DoNewsletterSubmit your event Newsletter Submit your event Newsletter Submit your event TravelVisiting BostonCape CodNew EnglandFlightsOutdoorsSkiingSign up for Scenic Six Visiting Boston Cape Cod New England Flights Outdoors Skiing Sign up for Scenic Six Visiting Boston Cape Cod New England Flights Outdoors Skiing Sign up for Scenic Six CommunityTell UsNeighborhoodsReaders SayBook ClubWickedpediaThe B-SideCocktail Club Tell Us Neighborhoods Readers Say Book Club Wickedpedia The B-Side Cocktail Club Tell Us Neighborhoods Readers Say Book Club Wickedpedia The B-Side Cocktail Club ExtraCustomer SupportAdvertiseClassified AdsCareersContact UsObituariesNewslettersMass. LotteryPowerballMega MillionsHoroscopesComicsToday in HistoryFresh Start Customer Support Advertise Classified Ads Careers Contact Us Obituaries Newsletters Mass. Lottery Powerball Mega Millions Horoscopes Comics Today in History Fresh Start Customer Support Advertise Classified Ads Careers Contact Us Obituaries Newsletters Mass. Lottery Powerball Mega Millions Horoscopes Comics Today in History Fresh Start Weddings CarsNew Car Specials New Car Specials New Car Specials Games Skiing Conditions SearchSearch for:Search Boston.com NewsLocal NewsNational NewsPoliticsObituariesCrimeKaren ReadTraffic Local News National News Politics Obituaries Crime Karen Read Traffic Local News National News Politics Obituaries Crime Karen Read Traffic SportsCelticsRed SoxPatriotsBruinsFleetRevolutionJayson Tatum Celtics Red Sox Patriots Bruins Fleet Revolution Jayson Tatum Celtics Red Sox Patriots Bruins Fleet Revolution Jayson Tatum WeatherMapsStormsSnowSkiing ConditionsClimate Change Maps Storms Snow Skiing Conditions Climate Change Maps Storms Snow Skiing Conditions Climate Change Real EstateRenoDevelopmentsNewsBuyingOpen HousesRentingLuxury Reno Developments News Buying Open Houses Renting Luxury Reno Developments News Buying Open Houses Renting Luxury FoodRestaurantsNewsReviewsEventsBreweries & BarsClosingsOpeningsSign up for The Dish 🍽️ Restaurants News Reviews Events Breweries & Bars Closings Openings Sign up for The Dish 🍽️ Restaurants News Reviews Events Breweries & Bars Closings Openings Sign up for The Dish 🍽️ Love LettersLatest PostSend LetterAboutPodcastBookNewsletter Latest Post Send Letter About Podcast Book Newsletter Latest Post Send Letter About Podcast Book Newsletter CultureArtsEntertainmentMoviesTVStreamingCelebsMusicSign up for The Queue Arts Entertainment Movies TV Streaming Celebs Music Sign up for The Queue Arts Entertainment Movies TV Streaming Celebs Music Sign up for The Queue Things To DoNewsletterSubmit your event Newsletter Submit your event Newsletter Submit your event TravelVisiting BostonCape CodNew EnglandFlightsOutdoorsSkiingSign up for Scenic Six Visiting Boston Cape Cod New England Flights Outdoors Skiing Sign up for Scenic Six Visiting Boston Cape Cod New England Flights Outdoors Skiing Sign up for Scenic Six CommunityTell UsNeighborhoodsReaders SayBook ClubWickedpediaThe B-SideCocktail Club Tell Us Neighborhoods Readers Say Book Club Wickedpedia The B-Side Cocktail Club Tell Us Neighborhoods Readers Say Book Club Wickedpedia The B-Side Cocktail Club ExtraCustomer SupportAdvertiseClassified AdsCareersContact UsObituariesNewslettersMass. LotteryPowerballMega MillionsHoroscopesComicsToday in HistoryFresh Start Customer Support Advertise Classified Ads Careers Contact Us Obituaries Newsletters Mass. Lottery Powerball Mega Millions Horoscopes Comics Today in History Fresh Start Customer Support Advertise Classified Ads Careers Contact Us Obituaries Newsletters Mass. Lottery Powerball Mega Millions Horoscopes Comics Today in History Fresh Start Weddings CarsNew Car Specials New Car Specials New Car Specials Games Skiing Conditions Karen Read livestream LUCE Boston movie bracket **Renovated office building near Old State House hits the market, could be used for apartments** **Mayor Michelle Wu aims to bring 1,000 new housing units to Boston by 2026.** ByMadeleine Aitken Facebook Twitter Email Email ... A federally-owned building across from Old State House in downtown Boston is available to be leased and could be used for apartments, offices, or a hotel. Former Hopkinton deputy police chief John ‘Jay’ Porter found guilty of child rape One killed, 3 seriously injured in Tyngsborough crash ‘Damn I missed this place,’ Joe Manganiello says of Peaks Island The building at 15 State St./45 Devonshire St., known as the Easton Building, is owned by the National Park Service, which also owns the adjacent Old State House, Faneuil Hall, and the Freedom Trail. Constructed in 1902, the Easton Building is 11 stories with about 37,000 square feet of gross building area. It has been under renovation since at least 2020, according toBoston Business Journal, and National Parks of Boston is now seeking “innovative proposals that can use the space effectively and that also align with NPS adaptive reuse and preservation values,” the organization said in an announcement. The building is listed as a historic building and is eligible for listing on the National Register of Historic Places. One option for the building is apartments, based in part on an incentive program launched by Mayor Michelle Wu for office-to-residential conversions with the goal of repurposing vacant office space while increasing housing supply. The program has received 15 proposals that would bring 762 units across 606,000 square feet of building space. Some have already beenapproved, including one that will turn 9 Arch St., also known as 16-18 Hawley, and 31 Milk St. in the Financial District into 110 new residential units, 22 of which will be affordable, and another that will turn 123 N. Washington St. in the North End into 45 new rental units, seven of which will be affordable. Another project at 15 Court Square approved in March will renovate another 11-story mixed use office building in 80 units, 16 of which will be affordable, theBoston Heraldreported. Wu’s tax incentive program aims to revitalize 1,000 new housing units and one million square feet by 2026. **Sign up for the Today newsletter** Get everything you need to know to start your day, delivered right to your inbox every morning. **Conversation** **Most Popular** **In Related News** **Recent homes sales in Greater Boston (June 11)** **Recent homes sales in Greater Boston (June 11)** Real EstateHere’s the latest on Somernova, the big development set for Somerville’s Union Square neighborhood MoviesThe big Boston movie tour: Here’s where 6 of your favorite Boston flicks were filmed Follow Boston.com on Instagram (Opens in a New Tab) Follow Boston.com on Twitter (Opens in a New Tab) Like Boston.com on Facebook (Opens in a New Tab) ©2025 Boston Globe Media Partners, LLC Tell Us What You Think Do not sell my data Privacy Policy Your Privacy Choices ADVERTISE Terms of Service Member Agreement CONTACT US CAREERS Site Map **Boston.com Newsletter SignupBoston.com Logo** Stay up to date with everything Boston. Receive the latest news and breaking updates, straight from our newsroom to your inbox."}