{"id": 1486, "name": "TreeHugger", "domain": "treehugger.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.treehugger.com/what-is-carmine-and-why-is-starbucks-taking-it-out-of-its-products-4868638", "title": "What Is Carmine And Why Is Starbucks Taking It Out Of Its Products 4868638", "content": "NewsEnvironmentBusiness & PolicyScienceAnimalsHome & DesignCurrent EventsTreehugger VoicesNews Archive Environment Business & Policy Science Animals Home & Design Current Events Treehugger Voices News Archive Environment Business & Policy Science Animals Home & Design Current Events Treehugger Voices News Archive EnvironmentPlanet EarthClimate CrisisPollutionRecycling & WasteNatural DisastersTransportationEco Terms A to Z Planet Earth Climate Crisis Pollution Recycling & Waste Natural Disasters Transportation Eco Terms A to Z Planet Earth Climate Crisis Pollution Recycling & Waste Natural Disasters Transportation Eco Terms A to Z Home & GardenHomeNatural CleaningGreen LivingSustainable EatingGardenPlanting GuidesIndoor GardeningUrban Farms Home Natural Cleaning Green Living Sustainable Eating Garden Planting Guides Indoor Gardening Urban Farms Home Natural Cleaning Green Living Sustainable Eating Garden Planting Guides Indoor Gardening Urban Farms ScienceSpaceNatural ScienceTechnologyAgricultureEnergy Space Natural Science Technology Agriculture Energy Space Natural Science Technology Agriculture Energy PolicyCorporate ResponsibilityEnvironmental PolicyEconomicsFood Issues Corporate Responsibility Environmental Policy Economics Food Issues Corporate Responsibility Environmental Policy Economics Food Issues Eco-DesignTiny HomesArchitectureInterior DesignGreen DesignUrban Design Tiny Homes Architecture Interior Design Green Design Urban Design Tiny Homes Architecture Interior Design Green Design Urban Design AnimalsWildlifePetsAnimal RightsEndangered Species Wildlife Pets Animal Rights Endangered Species Wildlife Pets Animal Rights Endangered Species MoreClean BeautyCulture Clean Beauty Culture Clean Beauty Culture About Us NewsEnvironmentBusiness & PolicyScienceAnimalsHome & DesignCurrent EventsTreehugger VoicesNews Archive Environment Business & Policy Science Animals Home & Design Current Events Treehugger Voices News Archive Environment Business & Policy Science Animals Home & Design Current Events Treehugger Voices News Archive EnvironmentPlanet EarthClimate CrisisPollutionRecycling & WasteNatural DisastersTransportationEco Terms A to Z Planet Earth Climate Crisis Pollution Recycling & Waste Natural Disasters Transportation Eco Terms A to Z Planet Earth Climate Crisis Pollution Recycling & Waste Natural Disasters Transportation Eco Terms A to Z Business & PolicyCorporate ResponsibilityEnvironmental PolicyEconomicsFood Issues Corporate Responsibility Environmental Policy Economics Food Issues Corporate Responsibility Environmental Policy Economics Food Issues Home & GardenHomeGarden Home Garden Home Garden ScienceSpaceNatural ScienceTechnologyAgricultureEnergy Space Natural Science Technology Agriculture Energy Space Natural Science Technology Agriculture Energy AnimalsWildlifePetsAnimal RightsEndangered Species Wildlife Pets Animal Rights Endangered Species Wildlife Pets Animal Rights Endangered Species CultureHistoryTravelSustainable FashionArt & MediaHolidaysCommunity History Travel Sustainable Fashion Art & Media Holidays Community History Travel Sustainable Fashion Art & Media Holidays Community Eco-DesignTiny HomesArchitectureInterior DesignGreen DesignUrban Design Tiny Homes Architecture Interior Design Green Design Urban Design Tiny Homes Architecture Interior Design Green Design Urban Design Clean BeautyProductsTips & Techniques Products Tips & Techniques Products Tips & Techniques Subscribe About UsContact UsEditorial GuidelinesPrivacy Policy About Us Contact Us Editorial Guidelines Privacy Policy About Us Contact Us Editorial Guidelines Privacy Policy Business & Policy Food Issues **What Is Carmine—And Why Is It So Controversial?** Chapman University Fitopardo / Getty Images Corporate Responsibility Environmental Policy Economics Food Issues What Is Carmine Dye? How Is It Made? Uses in the Beauty Industry Carmine Controversy If you’ve ever wondered what gives some of your favorite designer drinks, strawberry yogurt, or even shades of lipstick that deep crimson color, the answer may surprise you. The secret behind many of these products is carmine dye—a colored extract that comes from the dried and crushed shells of female cochineal insects. **What Is Carmine Dye?** Cochineal bugs are part of the Coccidae family, a type of scale insect closely related to aphids, mealybugs, and whiteflies. They have flat, oval-shaped bodies about the size of a grain of rice and are native to tropical and subtropical South America through North America. Roberto Michel / Getty Images These bugs invade and live off the nopal cactus, otherwise known as theprickly pear cactus, accumulating in large clusters on the cactus pad to feed on the plant’s natural moisture and nutrients. Specifically, carmine dye is produced from the acid that females naturally secrete to deter predators (the insects themselves are more of a gray-white color). Up to 20% of the insect’s body weight is made up of carminic acid.The insect typically used is the Dactylopius coccus species,​ the females of which are mostly immobile and live around 90 days in the wild. While carmine dye wasn’t largely distributed in Europe until the mid-1500s (brought over by Spanish explorers), it’s been used in South America since at least the 10th century. Touted as an inexpensive source of red dye, importers had started regulating the cochineal market by the 18th century, and carmine production has stayed primarily in South America ever since. Peru produces the most, distributing between 85% and 95% of the world’s carmine powder each year, but Mexico and the Canary Islands both have substantial carmine industries as well. **How Is Carmine Made?** Martin Siepmann / Getty Images To create carmine dye, cochineal insects are harvested, dried out, and ground up to produce the dark red color in powder form. Most cochineal insects are harvested in the wild, but there are also places where they are farmed. Traditional cochineal farming involves either cultivating cactus plants that are already infested with insects or adding insects by hand to wild cactus pads. In other carmine farming methods, baskets containing females are added to cactus pads to reproduce in a controlled environment. The dye extracted from the insect is boiled, filtered, and mixed with basic aluminum salts to produce carmine. Legally, the extract must be pasteurized or treated to destroy any salmonella microorganisms.Besides beverages and yogurt, carmine is also added to processed meats (such as sausages or artificial crab meat), pastries, juices, and cosmetics. **Carmine in the Beauty Industry** Jonathan Knowles / Getty Images In the cosmetics industry, carmine is primarily used for lipsticks, eye shadow, and lipgloss.It is added to produce a bright red color and improve the wearability or shade intensity of makeup, but also as a base to achieve cooler ranges of pinks and purples without using synthetic dyes. Although carmine is all-natural, the lack of transparency of its widespread use in the cosmetics industry has become a controversial subject. Since the terms are unregulated, any company can claim that its products are \"vegan\" or that they contain \"no animal ingredients\" based on its own definitions, and some may consider animal-derived ingredients likebeeswax, lanolin, and carmine fair game. The only way to ensure that your beauty products are indeed vegan is to look forcertifications issued by The Vegan Society, Vegan Action, or the Vegetarian Society. **Other Names for Carmine Dye** Carmine isn’t always clearly labeled on ingredients lists and may also appear under the following names: E120 Natural red 4 Crimson lake Carmine lake CI 75470 Cochineal extract Cochineal Carminic acid Natural colorings **Carmine Controversy** Pere_Rubi / Getty Images Starbucks caught flack for using carmine in its strawberry-flavored drinks back in 2012, especially from vegans and those who didn’t eat animals for religious reasons. Later that year, Starbucks President Cliff Burrows issued ablog post announcingthat the company would transition to lycopene, a tomato-based extract, and stop using carmine in its strawberry products. Campari, the Italian liqueur often mixed into negronis, used carmine dye for decades before swapping it with petroleum-based artificial colorant in 2006. Some companies that use carmine have publicly defended their use of the additive. Yoplait, for example, tweeted a response in 2020 to a customer who was concerned that they were using entire bugs, saying, “We understand your concerns & you’re not eating ground up insects. It's sourced from the dried shells of the cochineal beetle, used in a purified form, safe, natural & has the FDA’s approval for use in food.” Most concerns over carmine dye lie in its source. An estimated 22 billion to 89 billion adult female cochineals are killed each year to produce carmine, and those who live a vegan lifestyle felt misled by companies that didn’t disclose the specific nature of their additives.It’s also concerning among followers of religions with dietary restrictions. There have been health risks connected to cochineal products as well, with research showing that exposure to carmine can cause severe anaphylactic reactions, contact allergies, and even asthma.In 2009, the FDA began requiring companies that produced carmine-containing food and cosmetics to disclose the ingredient on the label. Others claim that carmine is better for the environment than artificial alternatives since it is completely natural.Artificial coloringsare often made using coal or petroleum byproducts. Studies have linked even the most common food dyes to hyperactivity in children as well as allergic reactions and other adverse effects. Many cultures around the world have embraced eating insects for thousands of years. Bugs have even been promoted as aprotein-rich superfood of the future. From the Maya to the Aztecs, indigenous people of Central and South America have used carmine to dye their fabrics for generations. It also serves as animportant source of incomefor those countries today. Regardless of which camp you belong to, consumers have a right to know what’s being added to their products. Check the ingredients list the next time you’re out shopping to see if carmine made the cut—there may already be something in your kitchen with the bug-derived dye right now. Zeece, Michael. \"Food Colorants.\"Introduction to the Chemistry of Food, 2020, pp. 314-344., doi:10.1016/B978-0-12-809434-1.00008-6 Zeece, Michael. \"Food Colorants.\"Introduction to the Chemistry of Food, 2020, pp. 314-344., doi:10.1016/B978-0-12-809434-1.00008-6 Zeece, Michael. \"Food Colorants.\"Introduction to the Chemistry of Food, 2020, pp. 314-344., doi:10.1016/B978-0-12-809434-1.00008-6 Rosales, Alejandra Cardenas, et al. \"In-Vivo Measurement of the Fluorescence Spectrum of Wild Cochineal (Dactylopius opuntiae).\"Scientific Reports, vol. 11, 2021, pp. 446., doi:10.1038/s41598-020-80108-4 Rosales, Alejandra Cardenas, et al. \"In-Vivo Measurement of the Fluorescence Spectrum of Wild Cochineal (Dactylopius opuntiae).\"Scientific Reports, vol. 11, 2021, pp. 446., doi:10.1038/s41598-020-80108-4 Rosales, Alejandra Cardenas, et al. \"In-Vivo Measurement of the Fluorescence Spectrum of Wild Cochineal (Dactylopius opuntiae).\"Scientific Reports, vol. 11, 2021, pp. 446., doi:10.1038/s41598-020-80108-4 Campana, Michael G., et al. \"America's Red Gold: Multiple Lineages of Cultivated Cochineal in Mexico.\"Ecology and Evolution, vol. 5, no. 3, 2015, pp. 607-607., doi:10.1002/ece3.1398 Campana, Michael G., et al. \"America's Red Gold: Multiple Lineages of Cultivated Cochineal in Mexico.\"Ecology and Evolution, vol. 5, no. 3, 2015, pp. 607-607., doi:10.1002/ece3.1398 Campana, Michael G., et al. \"America's Red Gold: Multiple Lineages of Cultivated Cochineal in Mexico.\"Ecology and Evolution, vol. 5, no. 3, 2015, pp. 607-607., doi:10.1002/ece3.1398 Rowe, Abraham. \"Global Cochineal Production: Scale, Welfare Concerns, and Potential Interventions.\"OSF Preprints, 2020., doi:10.31219/osf.io/t57w2 Rowe, Abraham. \"Global Cochineal Production: Scale, Welfare Concerns, and Potential Interventions.\"OSF Preprints, 2020., doi:10.31219/osf.io/t57w2 Rowe, Abraham. \"Global Cochineal Production: Scale, Welfare Concerns, and Potential Interventions.\"OSF Preprints, 2020., doi:10.31219/osf.io/t57w2 \"Part 73 - Listing of Color Additives Exempt from Certification.\"Code of Federal Regulations, Title 21. \"Part 73 - Listing of Color Additives Exempt from Certification.\"Code of Federal Regulations, Title 21. \"Part 73 - Listing of Color Additives Exempt from Certification.\"Code of Federal Regulations, Title 21. https://www.marieclaire.co.uk/beauty/carmine-in-beauty-products https://www.marieclaire.co.uk/beauty/carmine-in-beauty-products https://www.marieclaire.co.uk/beauty/carmine-in-beauty-products Sadowska, Beata and Marta Chelminska. \"Carmine- Overlooked Allergen in Diagnostic of Immediate and Delayed Idiopathic Hypersensitivity.\"Polish Journal of Allergology, vol. 6, no. 1, 2019, pp. 30-38., doi:10.5114/pja.2019.84262 Sadowska, Beata and Marta Chelminska. \"Carmine- Overlooked Allergen in Diagnostic of Immediate and Delayed Idiopathic Hypersensitivity.\"Polish Journal of Allergology, vol. 6, no. 1, 2019, pp. 30-38., doi:10.5114/pja.2019.84262 Sadowska, Beata and Marta Chelminska. \"Carmine- Overlooked Allergen in Diagnostic of Immediate and Delayed Idiopathic Hypersensitivity.\"Polish Journal of Allergology, vol. 6, no. 1, 2019, pp. 30-38., doi:10.5114/pja.2019.84262 \"Listing of Color Additives Exempt From Certification; Food, Drug, and Cosmetic Labeling: Cochineal Extract and Carmine Declaration.\"Federal Registrar. \"Listing of Color Additives Exempt From Certification; Food, Drug, and Cosmetic Labeling: Cochineal Extract and Carmine Declaration.\"Federal Registrar. \"Listing of Color Additives Exempt From Certification; Food, Drug, and Cosmetic Labeling: Cochineal Extract and Carmine Declaration.\"Federal Registrar. \"Synthetic Food Dyes Affect Children's Behavior.\"Center for Science in the Public Interest, 2021. \"Synthetic Food Dyes Affect Children's Behavior.\"Center for Science in the Public Interest, 2021. \"Synthetic Food Dyes Affect Children's Behavior.\"Center for Science in the Public Interest, 2021. Okafor, Sunday N., et al. \"Assessment of the Health Implications of Synthetic and Natural Food Colourants - a Critical Review.\"Pharmaceutical and Biosciences Journal, vol. 4, no. 4, 2016, pp. 1-11., doi:10.20510/ukjpb/4/i4/110639 Okafor, Sunday N., et al. \"Assessment of the Health Implications of Synthetic and Natural Food Colourants - a Critical Review.\"Pharmaceutical and Biosciences Journal, vol. 4, no. 4, 2016, pp. 1-11., doi:10.20510/ukjpb/4/i4/110639 Okafor, Sunday N., et al. \"Assessment of the Health Implications of Synthetic and Natural Food Colourants - a Critical Review.\"Pharmaceutical and Biosciences Journal, vol. 4, no. 4, 2016, pp. 1-11., doi:10.20510/ukjpb/4/i4/110639 How Veal Crates Are Used in Factory Farms Why We Have Factory Farming and How to End It 8 Creepy Mystery Ingredients in Fast Food What is Forced Molting in Factory Farms? Is It Safe to Eat Sunflower Seeds Whole? What's the Deal With Natural Wine? Factory Farmed Animals and Antibiotics and Hormones Organic Farming: History, Timeline, and Impact Ask Pablo: What's the Impact of Imported Tropical Fruit? A Brief History of Lettuce, America's First Fresh Vegetable Coffee Lovers, Do You Know the Difference Between Direct Trade and Fair Trade? Food Sovereignty: Definition, Principles, and Importance What Does Organic Really Mean? Food and Farming Practices The Wasteful Cost of Cold-Pressed Juice Food Fraud: 10 Counterfeit Products We Commonly Consume 8 Foods You'd Never Guess Were Artificially Colored **Follow Us** Environment Business & Policy Home & Garden News About Us Privacy Policy Editorial Guidelines Terms of Service Careers Advertise Contact Your Privacy Choices"}