{"id": 2104, "name": "Premium Times", "domain": "premiumtimesng.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.premiumtimesng.com/agriculture/agric-special-reports-and-investigations/786981-cocoa-boom-or-forest-doom-as-prices-rise-farmers-encroach-on-nigerias-conservation-areas.html", "title": "786981 Cocoa Boom Or Forest Doom As Prices Rise Farmers Encroach On Nigerias Conservation Areas.html", "content": "The Membership Club #EndSARS Dashboard PT Hausa About Us PT Jobs Advert Rates Contact Us Digital Store Home NewsHeadline StoriesTop NewsMore NewsForeign Headline Stories Top News More News Foreign Headline Stories Top News More News Foreign Gender InvestigationsAllBlood on UniformsSupporting Dads: Flexible jobs help Nigerian men attend antenatal careMalaria’s Deadly Grip: Poor sanitation undermines govt efforts in Yobe, KebbiINVESTIGATION: How Chinese, Nigerian firms destroy miners’ hopes in BenueWhy Africa must fast-track gender justice, women’s empowerment – Chichi AniagoluCocoa Boom or Forest Doom: As prices rise, farmers encroach on Nigeria’s conservation areasBinance executive Tigran Gambaryan’s healthcare journey in Nigeria: What the records showBeyond Borders: How Ogun’s healthcare crisis pushes Nigerians to neighbouring countryEXCLUSIVE: How Biden, other U.S. officials pressured Nigeria to release Binance executive Tigran GambaryanSPECIAL REPORT: Four Years After Mass Abduction: Jangebe students battle for education, hope All Blood on Uniforms **Supporting Dads: Flexible jobs help Nigerian men attend antenatal care** **Malaria’s Deadly Grip: Poor sanitation undermines govt efforts in Yobe, Kebbi** **INVESTIGATION: How Chinese, Nigerian firms destroy miners’ hopes in Benue** **Why Africa must fast-track gender justice, women’s empowerment – Chichi Aniagolu** **Cocoa Boom or Forest Doom: As prices rise, farmers encroach on Nigeria’s conservation areas** **Binance executive Tigran Gambaryan’s healthcare journey in Nigeria: What the records show** **Beyond Borders: How Ogun’s healthcare crisis pushes Nigerians to neighbouring country** **EXCLUSIVE: How Biden, other U.S. officials pressured Nigeria to release Binance executive Tigran Gambaryan** **SPECIAL REPORT: Four Years After Mass Abduction: Jangebe students battle for education, hope** All Blood on Uniforms **Supporting Dads: Flexible jobs help Nigerian men attend antenatal care** **Malaria’s Deadly Grip: Poor sanitation undermines govt efforts in Yobe, Kebbi** **INVESTIGATION: How Chinese, Nigerian firms destroy miners’ hopes in Benue** **Why Africa must fast-track gender justice, women’s empowerment – Chichi Aniagolu** **Cocoa Boom or Forest Doom: As prices rise, farmers encroach on Nigeria’s conservation areas** **Binance executive Tigran Gambaryan’s healthcare journey in Nigeria: What the records show** **Beyond Borders: How Ogun’s healthcare crisis pushes Nigerians to neighbouring country** **EXCLUSIVE: How Biden, other U.S. officials pressured Nigeria to release Binance executive Tigran Gambaryan** **SPECIAL REPORT: Four Years After Mass Abduction: Jangebe students battle for education, hope** BusinessNews ReportsFinancial InclusionAnalysis and DataBusiness SpecialsTrade InsightsOpinionOil/Gas ReportsFAAC ReportsRevenue News Reports Financial Inclusion Analysis and Data Business Specials Trade Insights Opinion Oil/Gas ReportsFAAC ReportsRevenue FAAC Reports Revenue News Reports Financial Inclusion Analysis and Data Business Specials Trade Insights Opinion Oil/Gas ReportsFAAC ReportsRevenue FAAC Reports Revenue FAAC Reports Revenue OpinionAllAnalysisColumnsContributorsEditorialRebuilding Nigeria on the foundation of righteousness by Ayo AkereleUncle Sam, the silent crusader for press freedom, By Adebayo BodunrinSin no more, Sanwoolu, By Reuben AbatiBeyond politics: The elite’s role in nation-building, By Abubakar SuleimanSaving lives: The imperatives of heeding security alerts and warnings, By Mukhtar Ya’u MadobiJapa: The courage and cost of Nigeria’s great exodus, By Dakuku Peterside All Analysis Columns Contributors Editorial **Rebuilding Nigeria on the foundation of righteousness by Ayo Akerele** **Uncle Sam, the silent crusader for press freedom, By Adebayo Bodunrin** **Sin no more, Sanwoolu, By Reuben Abati** **Beyond politics: The elite’s role in nation-building, By Abubakar Suleiman** **Saving lives: The imperatives of heeding security alerts and warnings, By Mukhtar Ya’u Madobi** **Japa: The courage and cost of Nigeria’s great exodus, By Dakuku Peterside** All Analysis Columns Contributors Editorial **Rebuilding Nigeria on the foundation of righteousness by Ayo Akerele** **Uncle Sam, the silent crusader for press freedom, By Adebayo Bodunrin** **Sin no more, Sanwoolu, By Reuben Abati** **Beyond politics: The elite’s role in nation-building, By Abubakar Suleiman** **Saving lives: The imperatives of heeding security alerts and warnings, By Mukhtar Ya’u Madobi** **Japa: The courage and cost of Nigeria’s great exodus, By Dakuku Peterside** HealthNews ReportsSpecial Reports and InvestigationsHealth SpecialsFeatures and InterviewsMultimediaPrimary Health Tracker News Reports Special Reports and Investigations Health Specials Features and Interviews Multimedia Primary Health Tracker News Reports Special Reports and Investigations Health Specials Features and Interviews Multimedia Primary Health Tracker AgricultureNews ReportSpecial Reports/InvestigationsFeaturesInterviewsMultimedia News Report Special Reports/Investigations Features Interviews Multimedia News Report Special Reports/Investigations Features Interviews Multimedia Arts/LifeArts/BooksKannywoodLifestyleMusicNollywoodTravel Arts/Books Kannywood Lifestyle Music Nollywood Travel Arts/Books Kannywood Lifestyle Music Nollywood Travel SportsFootballMore Sports NewsSports FeaturesCasinoNon AAMS Football More Sports News Sports Features CasinoNon AAMS Non AAMS Football More Sports News Sports Features CasinoNon AAMS Non AAMS Non AAMS Elections2024 Ondo Governorship Election2024 Edo Governorship ElectionPresidentialGubernatorial 2024 Ondo Governorship Election 2024 Edo Governorship Election Presidential Gubernatorial 2024 Ondo Governorship Election 2024 Edo Governorship Election Presidential Gubernatorial Home NewsHeadline StoriesTop NewsMore NewsForeign Headline Stories Top News More News Foreign Headline Stories Top News More News Foreign Gender InvestigationsAllBlood on UniformsSupporting Dads: Flexible jobs help Nigerian men attend antenatal careMalaria’s Deadly Grip: Poor sanitation undermines govt efforts in Yobe, KebbiINVESTIGATION: How Chinese, Nigerian firms destroy miners’ hopes in BenueWhy Africa must fast-track gender justice, women’s empowerment – Chichi AniagoluCocoa Boom or Forest Doom: As prices rise, farmers encroach on Nigeria’s conservation areasBinance executive Tigran Gambaryan’s healthcare journey in Nigeria: What the records showBeyond Borders: How Ogun’s healthcare crisis pushes Nigerians to neighbouring countryEXCLUSIVE: How Biden, other U.S. officials pressured Nigeria to release Binance executive Tigran GambaryanSPECIAL REPORT: Four Years After Mass Abduction: Jangebe students battle for education, hope All Blood on Uniforms **Supporting Dads: Flexible jobs help Nigerian men attend antenatal care** **Malaria’s Deadly Grip: Poor sanitation undermines govt efforts in Yobe, Kebbi** **INVESTIGATION: How Chinese, Nigerian firms destroy miners’ hopes in Benue** **Why Africa must fast-track gender justice, women’s empowerment – Chichi Aniagolu** **Cocoa Boom or Forest Doom: As prices rise, farmers encroach on Nigeria’s conservation areas** **Binance executive Tigran Gambaryan’s healthcare journey in Nigeria: What the records show** **Beyond Borders: How Ogun’s healthcare crisis pushes Nigerians to neighbouring country** **EXCLUSIVE: How Biden, other U.S. officials pressured Nigeria to release Binance executive Tigran Gambaryan** **SPECIAL REPORT: Four Years After Mass Abduction: Jangebe students battle for education, hope** All Blood on Uniforms **Supporting Dads: Flexible jobs help Nigerian men attend antenatal care** **Malaria’s Deadly Grip: Poor sanitation undermines govt efforts in Yobe, Kebbi** **INVESTIGATION: How Chinese, Nigerian firms destroy miners’ hopes in Benue** **Why Africa must fast-track gender justice, women’s empowerment – Chichi Aniagolu** **Cocoa Boom or Forest Doom: As prices rise, farmers encroach on Nigeria’s conservation areas** **Binance executive Tigran Gambaryan’s healthcare journey in Nigeria: What the records show** **Beyond Borders: How Ogun’s healthcare crisis pushes Nigerians to neighbouring country** **EXCLUSIVE: How Biden, other U.S. officials pressured Nigeria to release Binance executive Tigran Gambaryan** **SPECIAL REPORT: Four Years After Mass Abduction: Jangebe students battle for education, hope** BusinessNews ReportsFinancial InclusionAnalysis and DataBusiness SpecialsTrade InsightsOpinionOil/Gas ReportsFAAC ReportsRevenue News Reports Financial Inclusion Analysis and Data Business Specials Trade Insights Opinion Oil/Gas ReportsFAAC ReportsRevenue FAAC Reports Revenue News Reports Financial Inclusion Analysis and Data Business Specials Trade Insights Opinion Oil/Gas ReportsFAAC ReportsRevenue FAAC Reports Revenue FAAC Reports Revenue OpinionAllAnalysisColumnsContributorsEditorialRebuilding Nigeria on the foundation of righteousness by Ayo AkereleUncle Sam, the silent crusader for press freedom, By Adebayo BodunrinSin no more, Sanwoolu, By Reuben AbatiBeyond politics: The elite’s role in nation-building, By Abubakar SuleimanSaving lives: The imperatives of heeding security alerts and warnings, By Mukhtar Ya’u MadobiJapa: The courage and cost of Nigeria’s great exodus, By Dakuku Peterside All Analysis Columns Contributors Editorial **Rebuilding Nigeria on the foundation of righteousness by Ayo Akerele** **Uncle Sam, the silent crusader for press freedom, By Adebayo Bodunrin** **Sin no more, Sanwoolu, By Reuben Abati** **Beyond politics: The elite’s role in nation-building, By Abubakar Suleiman** **Saving lives: The imperatives of heeding security alerts and warnings, By Mukhtar Ya’u Madobi** **Japa: The courage and cost of Nigeria’s great exodus, By Dakuku Peterside** All Analysis Columns Contributors Editorial **Rebuilding Nigeria on the foundation of righteousness by Ayo Akerele** **Uncle Sam, the silent crusader for press freedom, By Adebayo Bodunrin** **Sin no more, Sanwoolu, By Reuben Abati** **Beyond politics: The elite’s role in nation-building, By Abubakar Suleiman** **Saving lives: The imperatives of heeding security alerts and warnings, By Mukhtar Ya’u Madobi** **Japa: The courage and cost of Nigeria’s great exodus, By Dakuku Peterside** HealthNews ReportsSpecial Reports and InvestigationsHealth SpecialsFeatures and InterviewsMultimediaPrimary Health Tracker News Reports Special Reports and Investigations Health Specials Features and Interviews Multimedia Primary Health Tracker News Reports Special Reports and Investigations Health Specials Features and Interviews Multimedia Primary Health Tracker AgricultureNews ReportSpecial Reports/InvestigationsFeaturesInterviewsMultimedia News Report Special Reports/Investigations Features Interviews Multimedia News Report Special Reports/Investigations Features Interviews Multimedia Arts/LifeArts/BooksKannywoodLifestyleMusicNollywoodTravel Arts/Books Kannywood Lifestyle Music Nollywood Travel Arts/Books Kannywood Lifestyle Music Nollywood Travel SportsFootballMore Sports NewsSports FeaturesCasinoNon AAMS Football More Sports News Sports Features CasinoNon AAMS Non AAMS Football More Sports News Sports Features CasinoNon AAMS Non AAMS Non AAMS Elections2024 Ondo Governorship Election2024 Edo Governorship ElectionPresidentialGubernatorial 2024 Ondo Governorship Election 2024 Edo Governorship Election Presidential Gubernatorial 2024 Ondo Governorship Election 2024 Edo Governorship Election Presidential Gubernatorial A section of the warehouse of Goddy Ukwu, an LBA. A section of the warehouse of Goddy Ukwu, an LBA. **Cocoa Boom or Forest Doom: As prices rise, farmers encroach on Nigeria’s conservation areas** **Nigeria is a major cocoa exporter, though it ranks behind Ghana and Ivory Coast, with the EU being its largest market.** Six years after graduating from the university in his Cross River home state, John Etta abandoned his search for a white-collar job. Following his uncle’s advice, he ventured into agribusiness in 2021, focusing on cocoa, the key ingredient in chocolate, with bush mangoes, plantain, yam, and cocoyam on the side. His uncle, a university teacher, had introduced him to the wealth of opportunities in cocoa farming, particularly in their community of Bendeghe-Afi, 240 kilometres from the state capital Calabar, where rising cocoa prices have created millionaires and sustained many livelihoods. About 50 minutes from Afi Forest Reserve on a fast motorcycle, the community is 23 kilometres from Ikom, the state’s cocoa trading hub, and home to major Licensed Buying Agents (LBAs) who serve as intermediaries between farmers and exporters. With cocoa prices soaring and formal employment scarce, nearly every family in Ikom and surrounding communities, such as Etta’s and Abangku, now owns cocoa farms, even on small plots at their homes. Demand for land has surged, prompting locals to expand their farms to meet the increasing global demand for the crop and encroach on the Afi reserve, a protected forest critical for the fight against climate change. Villagers argue that these forests, handed to the government decades ago, have remained unused. “Everybody is now in the forest reserve,” said Bassey Foster, a forest ranger. He said he could not stop the farmers from using the forest land illegally. “The forest is not expanding, but the population is increasing. People need the forest to survive.” Benjamin Takim, secretary of the Trackers’ Union in Bendeghe-Afi and a motorcycle rider transporting cocoa, echoed this: “People from Abangku farm in the Afi Reserve. Nobody gave them access; they encroached because the government abandoned the land. Now, they consider themselves the owners.” **Nigerians need credible journalism. Help us report it.** Support journalism driven by facts, created by Nigerians for Nigerians. Our thorough, researched reporting relies on the support of readers like you. Help us maintain free and accessible news for all with a small donation. Every contribution guarantees that we can keep delivering important stories—no paywalls, just quality journalism. “Here we don’t joke with forest. When cocoa business is concerned, we don’t joke with forest,” Mr Takim said. In January, cocoa’s off-season price ranged from N12,500 to N13,500 per kilogram, with a 100kg bag selling for N1,250,000 to N1,350,000. Prices are expected to rise further when the cocoa season begins in October. Retired civil servant-turned-cocoa farmer Takaim Ekori, confirmed this trend. **Join the Premium Times WhatsApp Community For Quick Access To News and Happenings Around You.** **Join the Premium Times WhatsApp Community For Quick Access To News and Happenings Around You.** The cocoa trade involves a structured supply chain: farmers harvest, dry the beans, and sell to LBAs through intermediaries. LBAs, who own warehouses, support farmers with logistics, training, high-yield varieties, and pesticides like Gammalin to control black pod disease. The LBAs in turn sell to exporters, including international suppliers, such as Olam, Tulip, and Cargill, among others, who then supply the global chocolate industry. The chocolate industry has long fueled deforestation due to the failure of the industry and its suppliers to monitor farmers – like those around Ikom – who are cutting down forests for cocoa plantations. This concern motivated the European Union to establish the European Union Deforestation Regulation (EUDR), which requires exporters to prove that cocoa and other primary products entering Europe are not sourced from deforested land or reserves. Originally set for January 2025, the regulation has been postponed by a year due to concerns from international stakeholders. Among Ikom’s major cocoa exporters is Tulip Cocoa Processing Limited, a subsidiary of Amsterdam-based Theobroma, which has been trading cocoa butter since 1922. According to the Nigeria Export Promotion Council (NEPC), Tulip has expanded its grinding capacity from 12,000 to over 30,000 tonnes annually. Tulip, whose major export destination is the EU, did not respond to our email enquiry. Also, phone calls to the number on its official website did not go through. However, a senior official at the company said Tulip maintains a strict traceability system for its cocoa. “We have field officers, agronomists, and a traceability system in place. We don’t buy cocoa from protected areas,” the official said asking not to be named as they had no permission to talk to journalists. “We register farmers, track supply quantities, and provide training to discourage deforestation.” However, community members dispute this claim. Farmers allegedly mix cocoa from both family-owned and reserve forests before selling to LBAs, who in turn sell to exporters like Tulip. The ‘tracker’ who transports the products from the farms confirmed this. “I cannot count the number of bags we carry out of this place because sometimes some persons bring out two (2) tonnes in a year. That is 32 bags. A tonne is 16 bags. So there’s no way we can keep records of the total bags that are being taken out from the forest in a season,” Mr Benjamin said. “My normal load is two bags of two 200kg bags; that is 400kg at once and I can do that like 10 times in a day during the season. My members are many and depends on where you have your contract for the day.” This was corroborated by Mr Foster, the ranger, saying: “Everybody is now in the forest reserve. Tulip and Olams, all of them give LBAs money to farmers to buy and supply cocoa. All these Goddy Ukwu, and all of them, they buy these cocoa and supply to them. Anywhere there is cocoa, nobody wants to know where you get them from. What they want is cocoa. Will cocoa tell you I’m from the forest?” Godwin Ukwu, the owner of Goddy Ukwu warehouse, a prominent LBA in Ikom and the National General Secretary of theCocoa Association of Nigeria(CAN), explained that the company indeed has a sound tracing system. Notwithstanding, Mr Ukwu, a major supplier to Tulip, admitted that about 20 per cent of cocoa from untraceable sources finds its way to the exporters. “Here in Cross River State, we’ve been informed of this (EU regulation) for a very long time. And I think we are working, not only in Cross River but across Nigeria. We are working tirelessly to make sure that the reserve areas are not being encroached. **READ ALSO:Cocoa farmers count gains as cocoa bean prices soar** “The cocoa we do now, that we sell, majority, about 80 percent of the cocoa are traceable cocoa in the sense that, even if we go to my warehouse now before we load and if you ask my traceable manager downstairs, we have the document of every cocoa in the store, who supplied what and where the cocoa came from,” Mr Ukwu said. Mr Ukwu advocates legislation to de-reserve some reserve areas because cocoa from the areas cannot be traced “because they belong to an area that is not acceptable by the EU law.” “What we are trying to do now is to go back to the Cross Rivers State House of Assembly that those areas that were already planted before this law came on board, we should de-reserve them. Once we de-reserve them, they fit into the acceptable areas,” he said. “The company we work with presently is Tulip Cocoa Processing and you know that they are good at record-keeping. So, the truth is, what we do now is that whichever cocoa leaves our warehouse, it gets to Tullip in Ijebu Mushin; they scan it, and they know the farmer the cocoa is coming from because they have gone around to register the farmers using the GPS Coordinate to check all the farms and you know that if you use the GPS coordinates to check your farms and plot it, if it is a reserved area they will know. If it’s a reserved area, it would come out. Some of them used to be,” he said. Mr Ukwu argued that some farms were in reserve areas before the EU regulation but his association is making moves in Cross River State to de-reserve those farms. “What is the EU saying, should we cut down the stems and replant trees? So, what we’re trying to do is to go back to the state House of Assembly to ask that some areas, some reserves should be de-reserved.” He argued that cocoa trees contribute to carbon absorption. “I don’t see why planting cocoa should be an issue when it serves the same purpose as trees in the forest. Of course, forests provide greater ecosystem benefits, but cocoa trees also add value.” When asked about the 20 per cent untraceable cocoa, Mr Ukwu suggested redirecting it to non-EU markets. “The EU regulation isn’t global. Asia and other markets still buy cocoa. If Europe won’t take it, we’ll find other buyers before this becomes a global issue.” Speaking on behalf of George Obenechi, the chairman of the Cross River State Forestry Commission, the commission’s Director of Operations, Ibiang Essien, confirmed that the Afi forest in Ikom local government area is a government reserve. **READ ALSO:Cocoa farmers count gains as cocoa bean prices soar** While admitting that some villagers have indeed encroached into the forest to farm cocoa, he disclosed that measures were being put in place to sanction such farmers through mobile courts to be set up by the state government. The director said the agitation by some communities to de-reserve certain portions of the forests will be considered by the commission. “As the population is growing higher, there is bound to be a need for land to farm. But then, due process must be followed to ensure that the right thing is done. “We are the custodian, we are aware of population explosion, meaning that the quest for land will come on board. Anytime they come up with demand for a particular area, we will know what to do,” he said. Nigeria is a major cocoa exporter, though it ranks behind Ghana and Ivory Coast, with the EU being its largest market. Concerns have thus increased regarding the impact on Nigeria’s cocoa, a top non-oil export, if the EUDR is enforced, as the West African nation seeks solutions for its cocoa sourced from forests. (This reporting was completed with the support of the Centre for Journalism Innovation and Development as part of the Centre for Investigative Journalism’s Open Climate Reporting Initiative). **Share this:** Twitter Facebook WhatsApp Telegram LinkedIn Email Print Support PREMIUM TIMES' journalism of integrity and credibility **Support PREMIUM TIMES' journalism of integrity and credibility** **Support PREMIUM TIMES' journalism of integrity and credibility** At Premium Times, we firmly believe in the importance of high-quality journalism. Recognizing that not everyone can afford costly news subscriptions, we are dedicated to delivering meticulously researched, fact-checked news that remains freely accessible to all. Whether you turn to Premium Times for daily updates, in-depth investigations into pressing national issues, or entertaining trending stories, we value your readership. It’s essential to acknowledge that news production incurs expenses, and we take pride in never placing our stories behind a prohibitive paywall. Would you consider supporting us with a modest contribution on a monthly basis to help maintain our commitment to free, accessible news? TEXT AD:Call Willie - +2348098788999 **NERC sanctions AEDC, Eko DisCo, others for overbilling unmetered customers** **NERC sanctions AEDC, Eko DisCo, others for overbilling unmetered customers** **Wema Bank seeks “too big to fail” status as N150 billion rights issue starts** **Wema Bank seeks “too big to fail” status as N150 billion rights issue starts** **Remi Oladayo** **MoreNews** **IPOB: Over 700 dead, N7.6 trillion lost in South-east – Report** **18 killed in renewed farmers-herders crisis in Plateau State** **Despite UK court judgement, Nigerian senator claims wife innocent of money laundering mess** **ANALYSIS: Lungu’s death and the perils of a weak opposition in Zambia** **Nigerian lawmakers mull bill for president’s inauguration at National Assembly Complex** **$6.6 billion Damages: Nigeria floors P&ID again, wins UK appeal** About Us Contact Us **Our Digital Network** PT Hausa Election Centre Human Trafficking Investigation Centre for Investigative Journalism National Conference Press Attack Tracker PT Academy Dubawa LeaksNG Campus Reporter **Resources** Oil & Gas Facts List of Universities in Nigeria LIST: Federal Unity Colleges in Nigeria NYSC Orientation Camps in Nigeria Nigeria’s Federal/States’ Budgets since 2005 Malabu Scandal Thread World Cup 2018 Panama Papers Game **Projects & Partnerships** AUN-PT Data Hub #EndSARS Dashboard Parliament Watch Panama Papers AGAHRIN #PandoraPapers #ParadisePapers #SuisseSecrets Our Digital Network About Us Contact Us Resources Projects Data & Infographics DONATE All content is Copyrighted © 2025The Premium Times, Nigeria **Welcome Back!** Login to your account below Remember Me **Retrieve your password** Please enter your username or email address to reset your password. **Add New Playlist** - Select Visibility -PublicPrivate Home Elections2024 Ondo Governorship Election2024 Edo Governorship ElectionPresidential & NASSGubernatorial & State House 2024 Ondo Governorship Election 2024 Edo Governorship Election Presidential & NASS Gubernatorial & State House 2024 Ondo Governorship Election 2024 Edo Governorship Election Presidential & NASS Gubernatorial & State House NewsHeadline StoriesTop NewsMore NewsForeign Headline Stories Top News More News Foreign Headline Stories Top News More News Foreign Investigations BusinessGenderNews ReportsFinancial InclusionAnalysis and DataTrade InsightsBusiness SpecialsOil/Gas ReportsFAAC ReportsRevenue Gender News Reports Financial Inclusion Analysis and Data Trade Insights Business Specials Oil/Gas ReportsFAAC ReportsRevenue FAAC Reports Revenue Gender News Reports Financial Inclusion Analysis and Data Trade Insights Business Specials Oil/Gas ReportsFAAC ReportsRevenue FAAC Reports Revenue FAAC Reports Revenue HealthCOVID-19News ReportsSpecial Reports and InvestigationsData and InfographicsHealth SpecialsFeaturesEventsPrimary Health Tracker COVID-19 News Reports Special Reports and Investigations Data and Infographics Health Specials Features Events Primary Health Tracker COVID-19 News Reports Special Reports and Investigations Data and Infographics Health Specials Features Events Primary Health Tracker AgricultureNews ReportResearch & InnovationData & InfographicsSpecial Reports/InvestigationsFeaturesInterviewsMultimedia News Report Research & Innovation Data & Infographics Special Reports/Investigations Features Interviews Multimedia News Report Research & Innovation Data & Infographics Special Reports/Investigations Features Interviews Multimedia Arts/LifeArts/BooksKannywoodLifestyleMusicNollywoodTravel Arts/Books Kannywood Lifestyle Music Nollywood Travel Arts/Books Kannywood Lifestyle Music Nollywood Travel SportsFootballMore Sports NewsSports FeaturesCasinoNon AAMS Football More Sports News Sports Features CasinoNon AAMS Non AAMS Football More Sports News Sports Features CasinoNon AAMS Non AAMS Non AAMS #EndSARS Dashboard AUN-PT Data Hub ProjectsPanama PapersParadise PapersSuisseSecretsParliament WatchAGAHRIN Panama Papers Paradise Papers SuisseSecrets Parliament Watch AGAHRIN Panama Papers Paradise Papers SuisseSecrets Parliament Watch AGAHRIN OpinionEditorial Editorial Editorial PT Hausa The Membership Club DONATE About Us Dubawa NG Advert Rates PT Jobs Digital Store Contact Us All content is Copyrighted © 2025The Premium Times, Nigeria"}