{"id": 70, "name": "American Affairs Journal", "domain": "americanaffairsjournal.org", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://americanaffairsjournal.org/2024/02/foreign-government-subsidies-and-fda-regulatory-failures-are-causing-drug-shortages-in-the-united-states-heres-how-to-fix-it/", "title": "Foreign Government Subsidies And Fda Regulatory Failures Are Causing Drug Shortages In The United States Heres How To Fix It", "content": "Current Issue Archive About Contact Donate American Affairs Journal American Affairs Journal Like us on Facebook Follow us on Twitter Articles RSS Feed Search this site Current Issue Archive About Contact Donate **Foreign Government Subsidies and FDA Regulatory Failures Are Causing Drug Shortages in the United States: Here’s How to Fix It** The United States is suffering from the worst drug shortage crisis in recent history. Whether it is basic generic drugs, antibiotics, or chemotherapy drugs, patients, doctors, and hospitals are facing shortages that are claiming American lives and straining our nation’s health care system. According to FDA data on drug shortages from 2015 to 2022, drug shortages have shot up to an eight-year high.1In the second quarter of 2023, more than three hundred medicines were in shortage.2Alarmingly, last year, nearly every major U.S. cancer center indicated in a survey that they faced chemotherapy shortages, and one survey released in August 2023 found that 60 percent of more than one thousand pharmacy respondents said that chemotherapy drug shortages were “critically impactful.”3A survey from the Institute for Safe Medication Practices of nearly two hundred respondents “confirmed that during the 6 months prior to the survey, shortages continued to be a daily struggle, involved an increasing number of lifesaving drugs without viable alternatives, and lasted longer than ever before.”4 This crisis is the result of decades of offshoring our nation’s drug manufacturing capacity, massive failures by the U.S. Food and Drug Administration (FDA) to properly regulate and oversee foreign drug manufacturers, and a massive system of subsidies used by foreign governments to shift generic drug production away from the United States. Americans take 131 million prescription drugs each day, and generic medicines account for roughly 90 percent of all prescriptions dispensed in the United States.5While brand name drugs drive massive profits for Big Pharma, generic drugs, which sell for roughly $20 on average, are critical to our nation’s health care system and more than a hundred million patients every day.6Unfortunately, the United States is dangerously dependent on foreignmanufacturers—particularlyin China andIndia—foressential, lifesaving generic medicines. Chinese and Indian manufacturers have demonstrated a pattern of repeatedly violating FDA regulations, which has resulted in the FDA issuing Form 483 observations and Warning Letters to document significant violations of FDAregulations—andeven import bans on foreign manufacturers that have committed the most serious violations. This raises real questions regarding the FDA’s efforts to mitigate shortages in light of increased risk of noncompliance. In our view, the data show a disturbing pattern of rising shortages and morerisk—theworst outcome. In recent decades, U.S. domestic production of generic pharmaceuticals has been offshored to China and India. Subsidized foreign manufacturers have sought to eliminate U.S. competition by racing to the bottom in price, only to drastically increase prices and gouge American patients once they have monopolized a product. In a previous article, we covered multiple examples this pernicious trend.7 Currently, the United States is reliant on imports for at least two-thirds of our generic medicines, and nearly 90 percent of generic active pharmaceutical ingredient (API) facilities are overseas.8The majority of those supply chains run through China and India. China, in particular, has a strong hold on the production of API and key starting materials (KSMs). In 2021, China was the leading source for U.S. pharmaceutical imports measured by weight, accounting for 418 million pounds, or 23 percent of total pharma imports.9 A report issued by the Inspector General of the U.S. Department of Defense stated that our nation’s reliance on foreign medicine sources is a national security threat.10China now accounts for 95 percent of imports of ibuprofen, 91 percent of imports of hydrocortisone, 70 percent of imports of acetaminophen, and 40–45 percent of imports of penicillin.11Moreover, China and India’s dominance of the U.S. generic pharmaceutical supply chain is growing. These two countries account for 85 percent of filings for new active pharmaceutical ingredients, according to data from an industry watchdog.12 The United States once led the world in pharmaceutical manufacturing. Today, however, we cannot even manufacture the most basic essential medicines domestically, and we are witnessing alarming exodus of critical medical supplies like syringes and needles. In the past 24 months, two of the three major U.S. domestic manufacturers that produce syringes and needles shuttered their facilities, choosing to instead source products exclusively from foreign manufacturers in China.13 It is clear that Congress, in partnership with the FDA and the Biden administration, must work to address this dependence through a mix of industrial and trade policies that incentivize U.S. domestic production, reshore pharmaceutical supply chains, and protect U.S. producers from unfair trade practices by foreign competitors. While the Covid-19 pandemic certainly exacerbated drug shortages in the United States, this national health care crisis started well before the pandemic. In 1984, Congress passed the Hatch-Waxman Act, formally known as the Drug Price Competition and Patent Term Restoration Act, to create more competition in the generic drug market. Despite the good intentions of creating competition, increasing innovation, and lowering prices for Americans, the bill’s changes to testing requirements made it easier for foreign producers to enter the U.S. market and facilitated the offshoring of America’s domestic production of generic pharmaceuticals to China and India. A report by our organization details how Hatch-Waxman caused a race to the bottom in price that triggered the offshoring of America’s domestic production of essential generic medicines, widespread illegal price manipulation, shortages of life-saving medicines, and poor quality, unsafe generic drugs.14 Group Purchasing Organizations (GPOs) and Pharmacy Benefit Managers (PBMs), which act as middlemen in the purchasing market, have also contributed to the drug shortage crisis. GPOs and PBMs are focused solely on maximizing returns without regard for other considerations like safety and quality. While their efforts to secure the lowest drug prices aim to cut costs, they have contributed to the offshoring of generic drug manufacturing in China and India where manufacturers compromise on environmental and worker standards to produce drugs at below-market rates. Since the 1960s, PBMs have acted as intermediaries between drug manufacturers and pharmacies, handling both brand name and generic drugs. As prescription drug spending surged, PBMs consolidated, leading to just threecompanies—CVSCaremark, Optum Rx, and ExpressScripts—controlling80 percent of the prescription drug market. Generics now account for nine out of ten prescriptions filled. This market dominance gives PBMs significant buying power, allowing them to negotiate substantial discounts from manufacturers for favorable inclusion in insurance policy formularies. The PBM model succeeded in driving down prices far enough to push U.S. generics producers out of the market, but it has not been effective at controlling price volatility driven by foreign monopolies, or addressing regulatory differences and quality issues. A third issue is the concentration of upstream suppliers in the production value chain. USP, a nonprofit research organization that advocates for patient safety by ensuring high pharmaceutical quality, analyzed the evolution of the supply chain in APIs, which are the essential building blocks for all pharmaceutical products.15USP mined Drug Master Files (DMFs) of pharmaceutical companies filed with the U.S. Food & Drug Administration and non-U.S. regulatory agencies to determine the country of origin of APIs. In 2000, China and India combined accounted for about a quarter of the global share of API filings. By 2021, India accounted for 62 percent of active filings and China accounted for 23 percent of active filings, a combined 85 percent of the global share of active API filings. The analysis shows an increasing concentration and supply-chain reliance on China and India for key inputs to critical medicines. Further upstream in the production of pharmaceuticals are the necessary chemicals and plants needed to make APIs. Despite accounting for only about 3 percent of finished pharmaceuticals imported into the United States, China controls the production of key starting materials (KSMs) that are the initial ingredients in the production of pharmaceuticals. Even India relies heavily on China for sourcing its raw materials. The U.S.-China Economic and Security Review Commission reported that India sources 80 percent of raw materials for its pharmaceutical production from China.16 China’s chokehold on the raw materials necessary for the production of pharmaceuticals and its increasing output of finished pharmaceuticals displays a pattern Beijing has frequently replicated in other industries. First, China controls the process of production of raw materials necessary for a given industry. Once it has dominated the upstream production, it then subsidizes companies downstream that produce the finished product by undercutting the cost of production through cheap labor and large state subsidies. The result is a lack of supply chain resilience and a growing concentration within the pharmaceutical industry. The dependence on a single supplier upstream of KSMs and APIs leads to shortages downstream in the finished product. Among generic medications, about 40 percent have only one manufacturer.17 Despite a disturbing pattern of failing to protect American patients from foreign drug manufacturers in China and India and blatant inaction to increase the domestic supply of generic drugs, to be covered further in this article, FDA Commissioner Robert Califf recognizes that this import dependence is unsustainable, recently warning “there’s not enough reserve and supply” of generic drugs in the United States. Commissioner Califf fears “there’s too much at stake when shortages occur” and believes “the economics of the industry” need fixing.18 Commissioner Califf is right that the economics of the industry, driven by actions of foreign governments, has led to a drastic rise in shortages. A recent NPR interview with Valerie Jensen, associate director for drug shortages at the Food and Drug Administration, documented how foreign drug manufacturers racing to the bottom in price are having unintendedconsequences—includingincreasing drug shortages.19The report found that “when it comes to generic sterile injectables, medicines that are workhorses in hospitals, the opposite problem is true. They can be too cheap. . . . Companies compete with each other to offer hospital purchasers the lowest price, driving the prices to rock bottom. Over time, prices can get so low that it doesn’t always make good business sense for the companies to keep making some drugs. So they stop.”20 To address this, it is clear that Congress must take significant steps to reshore the domestic pharmaceutical supply chain and boost domestic manufacturing of generic drugs. Earlier this year, Congresswoman Claudia Tenney (R-NY) introduced the Producing Incentives for Long-term Production of Lifesaving Supply of Medicines (PILLS) Act. This legislation would incentivize the strategic reshoring of U.S. domestic production of generic medicines with a domestic production-based tax credit, domestic content bonus credit, and an investment tax credit. This includes upstream inputs such as API, and downstream materials and services such as packaging and quality testing. While additional solutions are needed to fully address our nation’s overdependence on foreign supply chains and to solve the drug shortage crisis, the PILLS Act is an important industrial policy that would create massive incentives to strategically reshore U.S. domestic production of generic medicines. In particular, it would counter the Government of India’s massive subsidy regime that has directly undercut American generic drug producers. The government of India provides massive subsidies to its generic pharmaceutical manufacturing industry. This substantial system of subsidies has directly led to the offshoring of America’s domestic production of generic pharmaceuticals, resulting in a dangerous dependence on Indian generic drug manufacturers. The Indian government provides a variety of subsidies that have been found, in prior countervailing duty cases in the United States, to result in a countervailable subsidy. According to the U.S. International Trade Administration, “Foreign governments subsidize industries when they provide financial assistance to benefit the production, manufacture, or exportation of goods. Subsidies can take many forms, such as direct cash payments, credits against taxes, and loans at terms that do not reflect market conditions.”21 Most Indian pharmaceutical companies that export take advantage of one or more of these subsidy programs, and the Indian pharmaceutical industry widely advertises its use of subsidies. In one article, Gaurav Gupta, the CEO of Indian company SubsidyPro, outlines how “government subsidies are transforming the pharmaceutical industry” and that “State governments are also leading the pharma industry towards unprecedented heights by offering various incentives.”22This includes “reimbursement of 100% of actual filing costs on domestic patents and 50% of actual filing costs on international patents . . . being provided by [the] Uttar Pradesh Government. It is also reimbursing 75% of total expenditure on clinical trials.” Currently, India’s massive subsidy regime includes export subsidies, domestic subsidies, tax subsidies, loan subsidies, input subsidies, and import substitution subsidies. Notably, in numerous proceedings, the U.S. Department of Commerce has deemed each of these schemes to be a countervailable subsidy. The amount of subsidies the foreign producer receives from the foreign government is the basis for the subsidy rate by which the subsidy is offset, or “countervailed,” through higher import duties as determined by the U.S. government. The Duty Drawback (DDB) Program provides rebates for duties or taxes chargeable on any imported or excisable materials used to manufacture exported goods. Specifically, the duties and taxes “neutralized” under the program are the Customs and Central Excise Duties for inputs used to manufacture exported goods. The duty drawback is generally fixed as a percentage of the free-on-board (FOB) price of the exported product. Drawback rates are calculated based on averages known as the “All Industry Rates” or AIRs for a given product. In the absence of an AIR, the Government of India will calculate DDB on the actual duty. The U.S. Department of Commerce has determined in numerous proceedings that India’s DBB scheme provides a subsidy and is countervailable. The Export Promotion of Capital Goods Scheme (EPCGS) provides for a reduction or exemption of customs duties and excise taxes on imports of capital goods used in the production of exported products. Under this program, producers pay reduced duty rates on imported capital equipment by committing to earn convertible foreign currency equal to six times the value of the capital goods within a period of six years. Once a company has met its export obligation, the Government of India will formally waive the duties on the imported goods. If a company fails to meet the export obligation, the company is subject to payment of all or part of the duty reduction, depending on the extent of the shortfall in foreign currency earnings, plus a penalty interest. The Merchandise Export from India Scheme (MEIS), as detailed in the Foreign Trade Policy (FTP) Report for 2015–20, was created to promote the manufacture and export of certain goods to specified markets. Under this program, the government of India issues a scrip (duty credit) worth either 2, 3, or 5 percent of the FOB values of certain exports. To receive the scrip, a recipient must file an electronic application and supporting shipping documentation for each port of export with the Directorate General of Foreign Trade (DGFT). After a recipient receives and registers the scrip, it may either use the scrip for the payment of future customs duties for importing goods or transfer the scrip to another company. The Interest Equalization Scheme (IES), first introduced in April 2015, applies to rupee- denominated pre-shipment and post-shipment export financing. Under this program, the Reserve Bank of India provides a refund of 3 percent (and up to 5 percent as of November 2, 2018) of interest charged by a commercial bank on rupee-denominated pre-shipment and post-shipment export financing. This scheme is available to certain products that are exported under specific tariff codes, as well as all exports made by Micro, Small & Medium Enterprises (MSMEs) across all tariff codes. The Status Holder Incentive Scheme (SHIS) was introduced in 2009 with the objective to promote investment in upgrading technology in specific sectors. Status Holders under the government’s listing of specific exported products receive incentive scrip (or credit) equal to one percent of the FOB value of the exports in the form of a duty credit. The SHIS license can only be used for imports of capital goods and it can be transferred to another Status Holder for the import of capital goods. While this program was reportedly discontinued in 2013, companies were still able to apply for licenses for up to three years after the program ended (i.e., through 2016). Moreover, because this program applies to capital goods, the U.S. Department of Commerce will allocate any benefits that generic injectable producers receive from this program over time and thus pharmaceutical companies may receive residual benefits from this program through at least 2026. Under India’s SEZ Act of 2005, a Special Economic Zone (SEZ) may be established jointly or individually by the central government, a state government, or an individual or entity to manufacture goods and/or provide services and to serve as a Free Trade and Warehousing Zone. Entities that want to set up an SEZ in an identified area may submit their proposal to the relevant state government. To be eligible under the SEZ Act, the companies inside an SEZ must commit to export their production of goods and/or services. Specifically, companies must achieve a positive net foreign exchange. In return, the companies inside the SEZ are eligible to receive various benefits, including: (1) duty-free importation of capital goods and raw materials; (2) purchase of capital goods and raw materials without the payment of central sales tax (“CST”); (3) exemption from the services tax for the services consumed within the SEZ; (4) exemption from stamp duty for all transactions and transfers of immovable property, or documents related thereto within the SEZ; (5) exemption from electricity duty, and cess (tax or levy) thereon, on the sale or supply to the SEZ unit; (6) income tax exemptions under Section 10A of the Income Tax Exemption Scheme; and (7) discounted land in the SEZ. India’s Ministry of Commerce operates eleven SEZs specifically for India’s pharmaceutical producers. These include Amneal (located in a Pharma SEZ in Gujarat), Gland Pharma (has a formulation facility located in a SEZ in Andhra Pradesh), Aurobindo (has a manufacturing unit in a pharma SEZ in Telangana), Dr. Reddy (Vishakhapatnam SEZ in Andhra Pradesh), and Mylan (manufacturing in a pharma SEZ in Gujarat). Aurobindo notes in its financial statement that “the Company benefits from the tax holiday for units set up under the Special Economic Zone Act, 2005. These tax holidays are available for a period of fifteen years from the date of commencement of operations. Under the SEZ scheme, the unit which begins providing services on or after April 1, 2005 will be eligible for deductions of 100% of profits or gains derived from export of services for the first five years, 50% of such profit or gains for a further period of five years and 50% of such profits or gains for the balance period of five years subject to fulfillment of certain conditions. From April 1, 2011 units set up under SEZ scheme are subject to Minimum Alternate Tax (MAT).” In a number of investigations over the last several years, the U.S. Department of Commerce has found that the SEZ program provides subsidy benefits. The Advanced Authorization Program (AAP) allows exporters to import duty-free, specified quantities of materials required to manufacture products that are subsequently exported. The exporting companies, however, remain liable for the unpaid duties if they fail to utilize the imported inputs in exported products. The quantities of imported materials and exported finished products are linked through standard input-output norms established by the Government of India. In recent investigations and administrative reviews, U.S. Department of Commerce has found this export subsidy to be countervailable. In addition to these export subsidies, there are a variety of other subsidies available from the government of India to promote the export of pharmaceuticals from India. The Ministry of Commerce and Industry Export Products (Pharmaceuticals) Division is in charge of export promotion of pharmaceutical products and works closely with the Pharmaceutical Export Promotion Council of India (“Pharmexcil”), a quasi-governmental industry association. The Market Development Assistance (MDA) scheme provides assistance to exporters for export promotion activities abroad. Exporting companies with an FOB export value of up to Rs. 15 crores (more than $1.8 million) are eligible for MDA assistance to participate in trade delegations, trade fairs, and trade exhibitions conducted by Pharmexcil. The Market Access Initiative (MAI) scheme was first introduced in 2018 and was renewed again in July 2021. This program provides reimbursement of various expenses incurred by exporters to comply with statutory requirements in export markets. The ceiling amount for such expenses is Rs. 2 crore annually (nearly $250,000 USD). Expenses eligible for reimbursement under the MAI scheme include product registration, patent filing fees, plant inspection charges, barcoding development expenses, and quality certification expenses. The Pharmaceutical Promotion and Development Scheme (PPDS) was introduced in 2005. The purpose of the PPDS is to provide financial support for promotion of Indian pharmaceutical exports. Grants are available to organize conventions and exhibitions and to produce promotional materials. The Pharmaceutical Technology Upgradation Assistance Scheme (PTUAS) was established in 2014. The PTUAS is available to small and medium size enterprise (SME) pharma companies producing bulk drugs and pharmaceutical formulations. The goal is to assist recipients to migrate from Schedule M to World Health Organization Good Manufacturing Practices (WHO/GMP) norms, to enable them to participate and compete in global markets and earn foreign exchange. The maximum loan amount eligible for assistance is Rs. 4 crores (nearly $500,000 USD) and the upper limit for the interest subsidy is 6 percent. Interest subsidy recipients must obtain WHO/GMP certification within two and a half years from the date of disbursement of the loan. Recipients must also achieve incremental export revenue in excess of the loan amount within thirty-six months of the last draw on the loan. The government of India allocated Rs. 300 crore (roughly $36 billion USD) for disbursal as interest subsidies for the period 2020–22. There are a number of government grants that the Government of India offers to its pharmaceutical industry. The Production Linked Incentive (PLI) scheme for promotion of domestic manufacturing of critical KSMs, drug intermediates, and APIs was introduced in July 2020. This scheme aims to boost domestic manufacturing of KSMs, DIs, and APIs by attracting large investments in the sector and thereby reducing import dependence in critical materials, much of which India currently has to import (primarily from China). The PLI scheme will provide up to 20 percent incentives on incremental sales of forty-one products with a $2.05 billion program budget. The Credit Linked Capital Subsidy Scheme (CLCSS) for Technology Upgradation of Small Scale Enterprises is aimed at facilitating technology upgrades by providing upfront capital subsidies to small-scale industries companies to modernize production equipment, including plant and machinery, and techniques. The CLCSS is limited to specific subsectors and products approved under the scheme. Under the scheme, companies can receive 15 percent of the value loans made by Primary Lending Institutions funding the eligible investment. The amount of the loan cannot exceed Rs. 100 lakhs, (how much in USD?) and the amount of the subsidy cannot exceed 15 percent of that, or Rs. 15 lakhs. Interestingly, the CLCSS specifically provides for subsidies to producers of injectable medications. Specifically, the program identifies filter cartridges, bubble point apparatus, automated filling and sealing machines, horizontal autoclaves, and dry heat sterilizers as eligible for government support. The government of the state of Telangana offers investment subsidies at a rate of 14 percent of the fixed capital investment to promote R&D activities. Subsidy applications are reviewed by the Life Sciences Counsel, and subsidy benefits are spread over a five-year period. The state government of Karnataka provides a one-time capital subsidy of up to 50 percent of the of cost of constructing an effluent treatment plant for a pharmaceutical facility, subject to a ceiling of Rs. 250 lakhs. ($25 million) It will also provide a one-time subsidy of the cost of a Common Effluent Treatment Plant (serving more than one entity) established in a designated Pharma Park, Pharma SEZ, or pharmaceutical cluster. This scheme pays for 50 percent of the cost of construction up to Rs. 500 lakhs. ($50 million) The state government of Karnataka also provides grants to medium scale manufacturing enterprises (those employing twenty-five to fifty workers) to promote investment. The maximum size of the grant depends on the region of Karnataka of the manufacturing unit, and ranges from Rs. 20–25 lakhs. Additionally, it provides subsidies of up to 50 percent of the cost of unspecified go green initiatives to pharmaceutical producers, up to a maximum of Rs. 50 lakhs. ($5 million) Under its Investment Policy 2020–2025, the state government of Karnataka offers investment promotion subsidies to companies investing in manufacturing in Karnataka. The amount and duration of the subsidy depends on the number of employees of the company and the size of the investment. Subsidies range from 1.75 percent of turnover for Super Mega companies with 750 or more employees and fixed assets of more that Rs. 1000 crore (roughly $120 million USD), to 2.25 percent of turnover for large enterprises with 50 employees and fixed assets of up to Rs. 250 crore (roughly $30 million USD). Under the Karnataka Industrial Policy (2020–2025), the state government of Karnataka will pay one-time capital subsidies up to 50 percent of the total cost of establishing a Pharma Park subject to a ceiling of Rs. 5 crores ($600,000). It will also pay an annual incentive up to 20 percent of a pharmaceutical company’s expenditure towards clinical trials for bio-availability and bio-equivalence subject to a maximum of Rs. 1 crore per clinical trial. The state government of Gujarat provides tax incentives to new or existing industrial companies that undertake expansion of production between July 2016 and July 2021. Under this scheme, it will reimburse recipients the amount of general sales tax paid on intra-state sales. The state government of Gujarat also has the Scheme of Assistance to Mega/Innovation Projects. The purpose of the program is to promote mega projects that have a large multiplier effect on the economy and that leads to employment generation. The State Government of Karnataka has subsidy schemes to increase the industrial growth rate of the state, attract investment, and create employment opportunities. Various tax benefits are available to Large, Mega, Ultra Mega, and Super Mega enterprises, including (1) exemption from the stamp tax, (2) concessional registration charges, (3) reimbursement of land conversion fees, (4) exemption from entry tax, (5) subsidies for setting up effluent treatment plants and anchor units, (6) interest free loans on VAT and GST payments, (7) refunds of central sales tax and, (8) budgetary support for infrastructure upgrades. These programs were extended in the Industrial Policy for 2020–2025. The state government of Telangana provides tax incentives to encourage industrialization under the Telangana State Industrial Development and Entrepreneur Advancement (T-IDEA) incentive scheme. Under this scheme companies are eligible to receive a permanent 100 percent reimbursement of stamp taxes and transfer duty reimbursement. The T-IDEA scheme also provides for a reimbursement of VAT, Central Sales Taxes, and State Sales Taxes for a period of seven years from initiation of operations, up to 100 percent of fixed capital investments. Medium-size companies receive 75 percent reimbursement, and large firms receive 50 percent reimbursement. In July 2021, the government of India announced a new program that provides interest subsidies for small- and medium-sized pharma companies. Under the scheme, the government will provide an interest subsidy of 6 percent on loans up to Rs. 10 crore (roughly $1.2 million) for a period of three years. The purpose of the loan is to upgrade infrastructure and technology. The aim is to improve the manufacturing practices and quality of medicines. To qualify for the subsidy, the company must achieve incremental export revenue in excess of the loan amount within three years of the last draw on the loan. The state of Karnataka Interest Subsidy for Micro, Small, and Medium Pharmaceutical Manufacturing Enterprises offers interest subsidies of 5 percent on term loans for micro, small, and medium scale pharmaceutical manufacturing units of up to Rs. 7.00 lakhs per unit. The interest is payable only on interest actually paid to financial institutions and does not apply in the case of loan default. The period of the interest subsidy ranges from three to five years depending on the zone where the unit is located. The State of Karnataka Interest Free Loan on VAT scheme offers all pharmaceutical manufacturers establishing in the state an interest free loan of 100 percent of assessed gross VAT for an initial period of ten years, subject to a limit of 150 percent of the value of fixed assets. The loan is repayable in ten equal annual installments after completion of the ten-year loan period. In March 2018, the state government of Telangana announced the creation of the world’s largest integrated pharmaceutical cluster, exceeding nineteen thousand acres. Dubbed Pharma City, the cluster is recognized as a National Investment and Manufacturing Zone (“NIMZ”) by the Government of India. Pharma City became operational in 2020. The zone will provide complete utility infrastructure, including roads, water, power, steam, and IT network service, as well as access to specialized warehouses, logistics, cold chains, and smart infrastructure. In addition, companies located in Industrial Estates or Industrial Parks are eligible to receive a rebate of up to 25 percent of land costs up to Rs. 10 lakhs ($1.1 million). Micro, small, and medium companies also qualify for a rebate of 25 percent of land conversion charges. The state government of Telangana also offers 25 percent subsidies on lease rentals for plug and play lab space of up to five thousand square feet, leased by life sciences start-ups in notified zones. The benefit is up to Rs. 5 lakh for a period of three years. In January 2019, the Indian government introduced a “Make in India” initiative, stating that its Public Procurement Programme would prioritize purchasing pharmaceutical products from local suppliers with 80 percent local content from 2019–21, increasing to 85 percent from 2021–23 and 90 percent from 2023–25. This policy encompasses various pharmaceutical formulations like antibiotics, vitamins, pain relievers, anti-diabetes medications, cardiac drugs, and blood pressure medications. In January 2021, revised guidelines classified suppliers into Class I (80 percent or more local content), Class II (50–80 percent local content), and non-local suppliers (less than 50 percent local content), with Class I and Class II suppliers receiving preferential treatment in government procurement decisions. These rules apply to all central sector/centrally sponsored schemes for procurements by state and local bodies, if the scheme is partially or fully funded by the government of India. However, such local content requirements may potentially violate World Trade Organization rules and U.S. countervailing duty laws as import substitution is considered a prohibited subsidy under WTO rules. Indian prime minister Narendra Modi has often described his country’s push to increase drug production as part of a large-scale effort to become the “pharmacy of the world.” India has certainly increased exports of pharmaceutical products, thanks in large part to the Indian government’s substantial system of subsidies to its generic pharmaceutical manufacturing sector. Nevertheless, as a Bloomberg report notes, “India is the largest provider of generic medicines” but it is “scandalously short on regulatory oversight.”23As Katherine Eban documented in her book, India’s pharmaceutical industry is plagued with “systemic fraud” “where data was routinely falsified to fool inspectors, increase production and maximize profit.”24 India’s extensive subsidy system has contributed to the outsourcing of the United States’ domestic production of generic pharmaceuticals and an overdependence on foreign supply chains, exacerbating the drug shortage crisis and creating a national security risk. Equally concerning, India’s regulatory oversight over its pharmaceutical industry, and a repeated pattern of significant safety and regulatory violations by its generic drug manufacturers, only compounds the current drug shortage crisis. Not only are American patients beholden to a single source for many generic drugs, but the manufacturers of these products are Indian firms with a frightening track record of safety and regulatory violations. The FDA’s foreign inspection program, which the Government Accountability Office (GAO) recently described as facing “unique challenges,” is failing to hold foreign manufacturers accountable for repeatedly violating regulations.25In particular, the GAO noted that the FDA’s practice of conducting preannounced foreign inspections is inadequate, and raises “questions about the equivalence of foreign to domestic inspections.” From 2014 to 2015, the FDA implemented a pilot program in India that eliminated extended advance notice for inspections. Instead, the FDA conducted short-notice or unannounced visits and selected sites for the program that the agency believed had significant issues. By all accounts, the program was widely successful at exposing widespread misconduct and significant violations of FDA regulations, including falsified quality records and even a bird infestation at a manufacturing site. Importantly, OAI findings increased by almost 60 percent under the pilot program.26 This short-lived experiment revealed the extent of the misconduct that could occur in the absence of unannounced inspections. Unfortunately, the FDA discontinued the program and reverted to preannounced visits and even virtual inspections of overseas facilities. In 2021, the FDA admitted, “We recognize that remote interactive evaluations do not replace inspections, and that there are situations where only an inspection is appropriate based on risk and history of compliance with FDA regulations.”27 The FDA would never view preannounced or virtual inspections as sufficient for domestic U.S. drug factories. Additionally, it would never grant U.S. drug manufacturers an exception after failing to meet basic safety standards. This double standard is a core part of the FDA’s culpability in offshoring America’s essential medicine production. Such a huge disparity in oversight gives a tremendous advantage to drug makers in India and China. The FDA’s apparent favoritism to foreign drugmanufacturers—regardlessof their compliancehistory—allowsthem to export drugs to the United States long before America’s domestic pharmaceutical plants can receive similar clearances. This past year, FDA inspectors found significant violations at foreign manufacturing facilities. ABloombergreport published in April 2023 documented the rising dangers of India’s generic drug industry, observing that “India is scandalously short on regulatory oversight” and that “[i]n the last six months alone, its generic cough syrups have killed dozens of children, its eye drops have caused blindness and its chemotherapy drugs have been contaminated.”28 Despite FDA inspectors finding an increase in significant violations at Indian facilities, the FDA is still struggling to inspect foreign facilities. In April 2023, nonprofit investigative news publisher ProPublica found that FDA inspection data showed that FDA inspections of overseas labs, mainly those in India and China, have “dropped precipitously..”29According to the report, “In fiscal year 2019, the year before the COVID-19 pandemic limited travel and movement, the FDA inspected 37% of the nearly 2,500 overseas manufacturers; in 2022, the agency only inspected 6% of around 2,800. And in India, where the contaminated eyedrops originated, the FDA inspected only 3% of manufacturers in2022—significantlyless than in 2019, when 45% of plants were inspected.”30 The FDA’s failure to properly inspect and oversee foreign drug facilities is having a serious impact on American patients. Last year, the FDA was forced to allow Chinese drug manufacturer Qilu Pharmaceutical to ship an unapproved cancer drug to the United States due to the national cancer drug shortage.31The drug, cisplatin, is widely used in chemotherapy to treat testicular, lung, bladder, cervical, and ovarian cancers. Similarly, the FDA allowed a banned factory in India to ship the lung medication Atovaquone to the United States.32This repeated pattern by the agency has become essentially a pharmaceutical offshoring policy by the FDA. The agency simply ignores the need to boost domestic production and approves foreign manufacturers that repeatedly violate safety regulations. In June 2022, FDA inspected Indian multinational pharmaceutical company Glenmark’s Baddi facility and consequently issued a Warning Letter after finding significant violations of FDA regulations, including that its methods, facilities, or controls for manufacturing, processing, packing, or holding do not conform to current good manufacturing practices (CGMP) , and that its drug products are adulterated. As a result, the FDA placed Glenmark under import alert 66-40 and Official Action Indicated (OAI), meaning objectionable conditions were found and regulatory action should be recommended.33Per FDA regulations, import alert 66-40 implies detention without physical examination of drugs from firms which have not conformed to CGMP. Despite Glenmark’s serious violations and resulting FDA action, the agency provided an exception to Glenmark in January, enabling it to supply Atovaquone oral suspension to the U.S. market from its Baddi facility.34In a regulatory filing, Glenmark said the FDA was giving it an exception “due to medical necessity and potential drug shortage expectations.” Atovaquone is used to prevent or treat a serious lung infection called Pneumocystis pneumonia (PCP). This medication helps to stop infection symptoms such as fever, cough, tiredness, and shortness of breath. Glenmark has a troubling history of safety issues and product recalls. In November 2022, the company received a Warning Letter from the FDA for violations at its Goa, India factory related to batch failures, lab controls, and record-keeping.3536In 2019, the company recalled shipments ofRanitidine—soldunder the brand nameZantac—fromtwo Indian factories due to potentially carcinogenic ingredients.37 Glenmark isn’t the only drug maker in India experiencing safety problems. Aurobindo Pharma38—America’s largest supplier of genericdrugs—hasalso repeatedly been cited by the Food and Drug Administration for unsafe manufacturing practices.39 Last year, the FDA issued a Warning Letter to Aurobindo for “significant deviations from CGMP for active pharmaceutical ingredients.”40And in 2019, federal regulators warned Aurobindo of “repeated failures” to address safety concerns, including “contamination at levels above the acceptable limit” and “inadequate cleaning procedures.”41 The same month that the FDA issued a Warning Letter to Aurobindo, Auromedics Pharma LLC, a subsidiary of Aurobindo, recalled an injectable antibiotic after a hair was found in a vial.42Despite repeated violations of FDA regulations and more than a dozen recent recalls of defective or potentially harmful products, the FDA granted Aurobindo’s subsidiary, Eugia Pharma Specialties Ltd, final approval to manufacture and market its generic version of Bortezomib for an injection used to treat certain types of cancer.43 Despite multiple Warning Letters and more than a dozen recalls for unsafe or substandard drugs, instead of placing Aurobindo on import alert, testing its products, and finding alternative suppliers, the FDA has instead continued to reward Aurobindo with countless firstgenerics—thefirst approval FDA permits which allows for a period of exclusivity in sales. A report released by our organization also documents Aurobindo’s substantial, alarming ties to Chinese companies sanctioned by the United States, tied to People’s Republic of China (PRC) military industries or to human rights violations.44This includes ties between Aurobindo and a PRC supplier with documented violations of U.S. pharmaceutical regulations. Our report exposes that “Aurobindo does business with at least four suppliers that have ties to organizations under US sanctions for their connections to China’s military industry.” AsBloombergreported, “[o]ne of Aurobindo’s suppliers in China last year was Zhejiang Huahai Pharmaceutical Co.” and that “Aurobindo ordered valsartan, a blood pressure medication, from Huahai. The drug went into shortage five years ago when a probable carcinogen, N-Nitrosodimethylamine, or NDMA, was found in ingredients used to make it that were supplied by Huahai. FDA inspectors found that the China-based company had ignored evidence that the ingredient was contaminated.”45 Wintac, the contract manufacturing organization (CMO) arm of New Jersey-based Somerset Therapeutics, which sells critical care and COVID drugs, received a Warning Letter from the FDA in 2020 for bacterial contamination on a media fill line at its Bangalore facility. The Warning Letter outlined Wintac’s failure to follow “procedures that are designed to prevent microbiological contamination of drug products purporting to be sterile.”46The FDA cited Wintac for a similar violation of its aseptic fill line in July 2019. Incredibly, Somerset sales doubled from 2019 to 2021, while the company was under Warning Letter.47 Emcure Pharmaceuticals, another Indian manufacturer, has received Warning Letters from the FDA since 2015. That same year, the FDA banned imports from Emcure’s Hinjawadi plant due to manipulating drug testing analysis and deviations in lab testing, an issue the FDA has frequently uncovered at Indian manufacturing facilities.48In 2019, Emcure’s subsidiary, Heritage Pharmaceuticals, agreed to pay more than $7 million for price fixing several medicines, including key drugs for diabetes, blood pressure, and asthma. Recently, FDA inspectors found a “cascade of failure” at Intas Pharmaceuticals, an Indian generic drug manufacturer.49After an inspection from November 22 to December 2, 2022, an Intas plant in Gujarat, India, received eleven observations on Form 483.50According to the Form 483, inspectors “found a truck full of transparent plastic bags containing shredded documents and black plastic bags mostly containing documents torn randomly into pieces.” FDA inspectors also found “a large black plastic bag that was hidden under the staircase” filled with torn pieces of disposed CGMP documents. Inspectors document that the trash bag had a very strong smell of chemicals spread across the area and that the documents found inside were wet. When FDA investigators put “together some of the torn pieces of documents,” they found that the torn pieces pertained to products commercialized in the U.S. market. The FDA also found serious violations at a Cipla facility, an Indian multinational pharmaceutical manufacturer, in 2023.51An inspection of Cipla’s manufacturing sites in Pithampur unveiled several quality and data observations. According to the observations on Form 483, the manufacturing site received over 3,000 complaints between 2020 and 2022. The FDA’s report also stated that 266 complaints were received this year and are still under investigation. According to the FDA report, 91 percent of the complaints were related to product performance. The manufacturing site has also experienced eight power failures since January 2021, including an HVAC system shutting down in an area of the facility. The FDA also noted that Cipla does not have data on hand that studied the effect that a power failure may have on the pharmaceutical products. Lupin, an Indian multinational pharmaceutical company based in Mumbai, is one of the largest generic pharmaceutical companies by revenue globally and the third largest in the United States by prescriptions.52In its FY23 annual report, Lupin states that it is the number one provider of forty-two products in the U.S. market and top three in 107 products. One product is Lisinopril tablets, a drug that belongs to a class of angiotensin converting enzyme (ace) inhibitors medication used to treat high blood pressure and to reduce the risk of death after a heart attack. According to the Centers for Disease Control and Prevention (CDC), heart disease remains the leading cause of death in the U.S.53According to data provided to the committee by industry, Lupin accounts for more than 80 percent of the U.S. market of Lisinopril tablets. Last September, the FDA issued a Warning Letter to Lupin following an inspection of its manufacturing facility in Tarapur, India, documenting “significant deviations from current good manufacturing practice (CGMP) for active pharmaceutical ingredients (API)” and that Lupin’s API are adulterated “[b]ecause your methods, facilities, or controls for manufacturing, processing, packing, or holding do not conform to CGMP.”54 The FDA issued a similar Warning Letter to Lupin in 2019 after an investigation at its Mandideep facility, as well as a Warning Letter in November 2017 after FDA investigators found issues at Lupin’s Goa facility that manufacturers key finished products.55FDA investigators highlighted major concerns on product testing, causing the FDA to order Lupin to retest batches of drugs the company had released for sale in the United States despite repeated testing showing that they failed to meet FDA specifications. Lupin has issued a number of recalls for its products, including nearly twelve thousand bottles of Lisinopril in 2020 due to the presence of foreign tablets.56Lupin recalled more than sixteen thousand bottles of Rifampin, a drug used in the treatment of all forms of tuberculosis, from the U.S. market in December 2022, due to “Failed Impurities/Degradation Specifications.”57 Dr. Reddy’s Laboratories is another Indian multinational pharmaceutical company based in Hyderabad. Dr. Reddy’s manufactures Tacrolimus, a critical drug used in heart transplant patients to prevent organ rejection. In April 2021, theJournal of Heart and Lung Transplantation, which is the official publication of the International Society for Heart and Lung Transplantation, published a study that compared the API and dissolution kinetics of Tacrolimus manufactured by Dr. Reddy’s and Intas as compared to the branded version. The study found notable differences with Dr. Reddy’s and Intas, including that it dissolved too quickly, putting transplant patients at risk.58Last year, Dr. Reddy’s initiated a Class II recall for over four thousand bottles of Tacrolimus due to “Presence of one Tacrolimus 1 mg capsule co-mingled in a bottle containing and labeled as Tacrolimus 0.5 mg capsules.”59In January 2024, Dr. Reddy’s was forced to again recall more than eight thousand bottles of Tacrolimus for “presence of foreign tablets/capsules” in the affected lot.60 Historically, Indian drug manufacturers have received a high proportion of FDA warning letters. In 2015, half of FDA Warning Letters were issued to Indian pharmaceutical companies.61In 2022, the FDA issued 31 Form 483s, including 15 to Indian manufacturers.62Moreover, it is clear that the FDA’s recent inspections of Indian manufacturing facilities have uncovered systemic issues. Nonetheless, these facilities have faced little to no restrictions on their ability to manufacture products for the U.S. market. Foreign manufacturers that have demonstrated a pattern of repeatedly violating FDA regulations are only increasing their stranglehold on the U.S. market. This raises serious questions over whether noncompliant foreign firms that continue to significantly violate FDA regulations have become too big to fail. Despite these repeated violations, the FDA has taken no action to procure these critical products from domestic sources. Furthermore, the FDA has demonstrated a pattern of approving foreign manufacturers for products that are in shortage over domestic firms (despite these foreign manufacturers not having been recently inspected) or that have received Warning Letters or Form 483 observations. For example, the FDA approved Chinese company Hainan Poly to manufacture Iopamidol, a contrast dye that was to be imported from Europe unapproved in order to address the contrast shortage.63According to FDA records, Hainan Poly has not been inspected since September 2019. Another example is Nelarabine, a critical oncology product used to treat T-cell acute lymphoblastic leukemia (T-ALL) and T-cell lymphoblastic lymphoma (T-LBL) in children, which was cited on page 16 of the FDA’s report to congress on drug shortages in 2020.64 There are only three approved API suppliers for Nelarabine allowed for use in the U.S.market—onein Germany and two in India. The facility in Germany was successfully audited by the European Medicines Agency in the summer of 2021 and yet, to date, no U.S. manufacturer has received approval for the generic version of Nelarabine using the German API. However, the FDA approved India’s Zydus Cadila in October 2021 to sell Nelarabine to the U.S. market despite the FDA sending a Warning Letter to the company in 2019 for CGMP violations at its Ahmedabad facility.65 The Warning Letter documented how Zydus Cadila “failed to clean, maintain, and, as appropriate for the nature of the drug, sanitize and/or sterilize equipment and utensils at appropriate intervals to prevent malfunctions or contamination that would alter the safety, identity, strength, quality, or purity of the drug product beyond the official or other established requirements.” Additionally, it stated that until Zydus Cadila corrected “all violations completely and we confirm your compliance with CGMP, FDA may withhold approval of any new drug applications or supplements listing your firm as a drug manufacturer.” In addition to the drug shortage crisis, the United States also has a similar, and dangerous, dependence on foreign manufacturers for essential medical devices like syringes and needles. Particularly concerning is that in the past 24 months, two of the three major U.S. domestic manufacturers of syringes and needles closed their U.S. facilities and began sourcing products exclusively from Chinese manufacturers.66 Based on industry data, the United States uses roughly ten million units of syringes daily. In fact, roughly two-thirds of all medical procedures in the United States utilize a syringe or needle. According to a report from MERICS, China is now the market-leading source of syringes and needles and receives numerous domestic benefits to compete against U.S. manufacturers.67Import data shows that shipments of Chinese-made syringes to the United States increased 51 percent in 2023 alone. After the two U.S. manufacturers of syringes and needles began outsourcing products, serious quality issues have arisen, resulting in major product recalls. In November 2023, the FDA issued a critical safety alert on syringes manufactured in China.68The safety communication states that the “FDA received information about quality issues associated with several Chinese manufacturers of syringes. We are concerned that certain syringes manufactured in China may not provide consistent and adequate quality or performance.”6970 The movement of these devices to Chinese facilities subjects them to FDA oversight and inspection. However, according to the FDA’s online database, the last time the FDA inspected a Chinese hypodermic device manufacturing facility was in 2018. FDA failed to inspect a single medical device facility in China, but inspected 1,706 facilities in the United States in 2022. Given the FDA’s regulatory oversight failures of generic drug manufacturers in China and India, we believe that lawmakers should be equally concerned about the FDA’s ability to properly ensure medical device manufacturers in China are making products that are safe for the U.S. market. Lawmakers and regulators need to adopt policies that help put U.S. hypodermic device manufacturers on a level playing field with Chinese competitors. In other similar situations, the U.S. government has imposed tariffs (301 tariffs) and imposed tighter import control and quality oversight. There have been reports that the Biden administration is considering tariffs on Chinese medical devices.71 Notably, countries like India and Brazil have implemented robust policy measures to safeguard their domestic medical technology industries from Chinese imports. Since 2009, Brazil has consistently imposed a 140.9 percent tariff on Chinese syringes and needles, pausing it briefly during the COVID-19 pandemic. India is actively promoting its “Make in India” initiative, with a primary focus on fostering domestic production of medical devices. The government has employed various policy tools and subsidies, including the implementation of a “National Medical Device Policy,” establishment of an “Export-Promotion Council for Medical Devices,” provision of “Production-Linked Incentives,” and the creation of incentives to attract manufacturers to invest in “Medical Devices Parks.” As is the case with a race to the bottom in price in the generic drug market, the medical device industry has been driven by a similar race to the bottom that has incentivized the offshoring of U.S. production to China. As a result, the United States has just a single major domestic manufacturer of syringes and needles. Just as the PILLS Act would incentivize the strategic reshoring of U.S. production of generic medicines, lawmakers should pursue similar legislation that would provide a domestic production-based tax credit, domestic content bonus credit, and an investment tax credit for critical medical device products like syringes and needles. This legislation would reduce U.S. dependence on foreign supply chains for these products and support one of America’s most innovative and vital industries. There is no silver bullet to solve the drug shortage crisis plaguing the United States, nor one to prevent a crisis for medical devices. Health care and industry experts, as well as regulators and policymakers, rightly recognize the complexity of the situation. However, there are multiple policy solutionsthat—ifimplementedtogether—wouldsignificantly address the drug shortage crisis, prevent a shortage crisis in the medical device industry, and reduce America’s dependence on foreign supply chains and manufacturers. There is a growing, bipartisan consensus in Congress that the United States needs to launch a major effort to rebuild domestic production of essential medicines and reform the FDA to ensure that the agency is properly overseeing foreign drug manufacturers that repeatedly violate FDA safety regulations. Last year, Senate Majority Leader Chuck Schumer (D-NY) released a plan to “repair the nation’s drug supply chains and thwart future crises,” stating specifically that “legislative action will be necessary to address systemic problems” within the U.S. generic drug market.72 Part of Senate Majority Leader Schumer’s legislative plan is “incentivizing domestic manufacturing and onshoring” and “improving production safety and quality.”73Boosting domestic production of generic medicines would be a critical first step in addressing the drug shortage crisis. In our view, Congresswoman Claudia Tenney’s (R-NY) PILLS Act is the best solution to do this. Her legislation would incentivize the strategic reshoring of U.S. domestic production of generic medicines with a domestic production-based tax credit, domestic content bonus credit, and an investment tax credit. The PILLS Act would provide a 35 percent production-based tax credit for final manufacturers of APIs and finished drug products and 30% for all other components. An additional, domestic content bonus credit is awarded for the proportion of domestic content in the drug’s constituent materials, up to 20 percent additional for 100 percent domestic content. This incentivizes firms to maximize U.S. content at each stage in a drug’s production to claim as much eligible credit as possible. Additionally, the PILLS Act would provide an optional investment tax credit in lieu of the production-based tax credit equal to 25 percent of the qualified investment to offset costs of creating new production capacity. This would be most useful for antibiotics producers with immense capital costs to stand up fermentation plants. As we have documented, foreign drug manufacturers have a long history of evading the bulk of the FDA’s oversight, as the agency’s inspectors have no statutory authority abroad and their ability to inspect facilities is restricted to the level of access that foreign countries and companies are willing to provide.74 The FDA’s uneven enforcement has created a multibillion-dollar regulatory loophole for Chinese and Indian manufacturers that undermines the agency’s ability to protect the American people. It incentivizes companies to shift production to foreign countries beyond the reach of the FDA’s more rigorous inspections. The consequence is less resilient pharmaceutical supply chains, and more Americans exposed to substandard, harmful, and even lethal generic drugs. At a Congressional hearing last March, Commissioner Califf testified thatChina—theworld’s largest supplier of KSMs andAPI—blockedon-site plant inspections until January of this year. Commissioner Califf also acknowledged that the FDA faces serious challenges when attempting to obtain transparent information about pharmaceutical quality.75 In order to address the rampant violations and regulatory failures of foreign drug manufacturers, the FDA must conduct thorough, in-person inspections of drug factories in India and China. It also must test the drugs being supplied to U.S.patients—andfully insist on safe manufacturing facilities as a condition for selling in the U.S. market. Currently, the FDA does not test imported medicines or inspect the foreign plants making them. Recent reports show that imports of generic medicines from manufacturers in India and China are not functioning as they should. The FDA does not test medicines imported into the U.S. from foreign manufacturers that have received Warning Letters for significantly violating the agency’s regulations for safety and quality control. We recommend that the Biden administration implement the following reforms: (1) Use all authority to identify U.S. companies that can manufacture essential generics and work to get them approved and manufacturing at scale, rather than prioritizing the approval of poor-quality imported products from noncompliant foreign manufacturers; (2) Increase in-person foreign inspections without advanced notice to create parity with the standard applied to U.S. facilities; (3) Work in coordination with Health and Human Services (HHS), the Department of Defense (DOD), and with the White House to invoke the Defense Production Act to finance and build new production facilities and procure domestically made essential generics; (4) Amend internal procedures across agencies, including with new regulations or guidance, to prioritize increasing U.S. manufacturing across all essential medicines and dramatically reduce reliance on foreign sources; and (5) Review and change FDA leadership and personnel who are failing to fix the shortages, refusing to enable foreign inspection and testing, and unwilling to prohibit foreign manufacturers that have a history of repeated violations from selling medicines in the U.S. According to data from the Centers for Medicare and Medicaid Services (CMS), more than sixty-five million Americans are enrolled in Medicare, and nearly ninety million Americans are enrolled in Medicaid and Children’s Health Insurance Programs (CHIP).76This is a massive customer base that the U.S. government should leverage to realign federal government health care programs to support domestic manufacturers. At a minimum, the federal government should provide priority to domestic manufacturers when federal agencies are procuring drugs directly. The Department of Veterans Affairs, the Department of Health and Human Services’ Strategic National Stockpile, and the Department of Defense’s Defense Health Agency should all prioritize signing long-term contracts with domestic manufacturers to give them the confidence of knowing that they will have a buyer for multiple years. CMS should also advance payment policies to support procurement of higher-quality domestic essential medical supplies in line with President Biden’s Executive Order 14001, which was intended to create a sustainable public health supply chain.77This action would also align with the Biden administration’s National Strategy for a Resilient Public Health Supply Chain.78The U.S. healthcare supply chain consists of medical countermeasures that include drugs, biological products, devices, diagnostics, personal protective equipment (PPE), and ancillary supplies such as devices required to deliver critical drug substances and products. CMS should expand the existing payment adjustments, which are currently provided to hospitals to account for additional costs incurred for domestically produced N95 respirators, for all critical medical supplies. This will incentivize hospitals to procure higher-quality, domestically made products. During the pandemic, payment adjustments were issued to providers under the Inpatient Prospective Payment System (IPPS) and Hospital Outpatient Prospective Payment System (OPPS) to overcome similar barriers with respect to domestic NIOSH-approved surgical N95 respirators. Additional policies that could help reshore the domestic pharmaceutical industry include strengthening the regulatory oversight of foreign-made drugs and providing more transparency about quality issues and country-of-origin information to consumers. Congress could also consider passing new legislation to provide a “first to file” preference for American manufacturers, which would allow them to become the first entrants in new generic markets. As we have documented, India uses a massive subsidy regime to support its pharmaceutical industry, distorting market conditions and undercutting American producers. In numerous cases, the Department of Commerce has ruled that India’s subsidies are countervailable. It is clear that the U.S. government must use trade remedies to defend domestic manufacturers from predatory policies by foreign governments and manufacturers. Currently, U.S. generic pharmaceutical manufacturers do not receive the same government support that their foreign counterparts do to enable them to withstand extended periods of losses. While we suggest implementing policies like the PILLS Act to change the economics of the industry and boost U.S. domestic generic drug production, American firms are currently vulnerable to foreign companies selling their products below cost in order to corner the market, only to immediately raise their rates by several orders of magnitude. The U.S. government has a wide range of trade remedies available to stop this predatory behavior, and fully utilizing these authorities to combat price gouging would significantly reduce overall health care costs, increase the resiliency of domestic supply chains, and combat shortages of critical and lifesaving medicines. Additionally, Section 232 duties and quotas should be phased in on all medicines listed in the FDA’s essential medicine list to help bring about the necessary domestic investment in their production. The benefit of this approach is that it provides the administration with a great amount of flexibility to adjust rates and exempt specific products or countries as factors change. Section 232 duties and quotes are also less prone to litigation risk than traditional antidumping and countervailing duties cases. The U.S. government should also build upon the Section 301 tariffs to include critical generic drugs and medical devices like syringes and needles. Section 301 exists to authorize the president to deploy duties and quotas in response to unfair trade practices by foreign governments. The term “unfair trade practices” is defined quite broadly and captures a wide swath of foreign government activity happening today in the pharmaceutical industry. Clearly, India and China are engaged in practices to boost their pharmaceutical manufacturing industries in an effort to increase U.S. dependence on their producers. Utilizing Section 301 of the Trade Act of 1974 provides the administration with a clear avenue to counter these efforts. The drug shortage crisis facing our nation is a result of decades of offshoring of pharmaceutical production and a dereliction of duty by the FDA to ensure our nation has a safe, affordable, and readily accessible supply of generic and other essential medicines. Solving this crisis will require bipartisan action to reshore and boost domestic pharmaceutical manufacturing for generic medicines and critical medical devices, like syringes and needles. Congress and the Biden administration must respond with swift action. That starts with passing legislation to incentivize the manufacturing of every stage of generic drug production in the United States, and reforming the FDA’s regulatory and oversight regime to hold foreign drug manufacturers accountable for repeated violations. Our nation once led the world in pharmaceutical manufacturing, and with the right policies, incentives, and regulatory reforms, the United States can once again be a leader in this critical industry. 2“Drug Shortages Statistics,” ASHP.org, accessed February 2024. 3Christina Jewett, “I’m Scared to Death.’ Behind the Shortage Keeping Cancer Patients From Chemo,”New York Times, December 19, 2023. 4“Drug, Supply, and Equipment Shortages Continue to Compromise Patient Care,” Institute for Safe Medication Practices, September 7, 2023.. 5“Prescription Drugs,” Georgetown University, accessed February 2024. 6“Prescription Drugs: Spending, Use, and Prices,” Congressional Budget Office, January 2022. 7Nick Iacovella and Jon Toomey, “America’s Other Health Care Crisis: Generic Medicine Supply Chains,”American Affairs6, no. 1 (Spring 2022): 33–48. 8“FACT SHEET: Biden-⁠Harris Administration Announces Supply Chain Disruptions Task Force to Address Short-Term Supply Chain Discontinuities,” Whitehouse.gov, June 8, 2021. 9Whitehouse.gov. 10“Evaluation of the Department of Defense’s Mitigation of Foreign Suppliers in the Pharmaceutical Supply Chain (DODIG-2021-126),” Department of Defense – Office of the Inspector General, September 20, 2021 11Department of Defense – Office of the Inspector General. 12Department of Defense – Office of the Inspector General. 13Tinglong Dai, “U.S. Needs to Shore Up Medical Device Manufacture or Risk Vulnerability in Times of Crisis,”The Baltimore Sun, December 26, 2023. 14“Generic Drug Shortages and How a Race to the Bottom in Price has Upended 30 years of Hatch-Waxman,” Coalition for a Prosperous America, October 2021. 15Vimala Raghavendran and Matthew Christian, “Geographic Concentration of Pharmaceutical Manufacturing: USP Medicine Supply Map Analysis,” USP, May 18, 2022. 16U.S.-China Economic and Security Review Commission, “Growing U.S. Reliance on China’s Biotech and Pharmaceutical Products,” USCC.gov, November 2019. 17U.S.-China Economic and Security Review Commission. 18Grace Da Rocha, “FDA Commissioner, at Expo in Las Vegas, Weighs in on Rise in U.S. Drug Shortages,”Las Vegas Sun, October 17, 2023. 19Syndey Lupkin, “How Rock-Bottom Prices Drive Shortages of Generic Drugs Used in Hospitals,” NPR, December 28, 2023. 20Lupkin. 21“Get Relief from Unfair Trade. Subsidy Allegation,” International Trade Administration, accessed February 2024. 22Gaurav Gupta, “Innovate to Cure: How Government Subsidies are Transforming the Pharmaceutical Industry,” LinkedIn.com, November 3, 2023. 23Ruth Pollard, “Just How Dangerous Are India’s Generic Drugs? Very,” Bloomberg, April 4, 2023 24Pollard. 25“Drug Safety: FDA Should Take Additional Steps to Improve Its Foreign Inspection Program,” Government Accountability Office, January 7, 2022. 26“Proposed Bill Seeks to Eliminate Preannounced Foreign Drug Inspections,” Sidley, January 31, 2023. 27“FDA Provides Guidance on Remote Interactive Evaluations for Oversight of Drug Facilities During COVID-19,” U.S. Food & Drug Administration, April 14, 2021. 28Pollard. 29Irena Hwang, “After Pandemic Delays, FDA Still Struggling to Inspect Foreign Drug Manufacturers,” ProPublica, April 19, 2023. 30Hwang. 31Spencer Kimball, “FDA Allows Temporary Import of Unapproved Chinese Cancer Drug to Ease U.S. Shortage.” CNBC.com, June 2, 2023. 32“USFDA Gives Exception to Glenmark Pharma to Supply Pneumonia Drug from Baddi Facility,”The Economic Times of India, January 27, 2023. 33“USFDA Issues Import Alert On Glenmark Pharma’s Baddi Plant,”Press Trust of India, October 26, 2022. 34The Economic Times of India. 35“Warning Letter, Glenmark Pharmaceuticals Limited,” U.S. Food & Drug Administration. November 22, 2022. 36Fraiser Kansteiner, “Glenmark Suffers Recall, Warning Letter After Subpar Investigation into Tablet Manufacturing Glitch,’ Fierce Pharma, December 7, 2022. 37“Glenmark Pharmaceuticals Inc., USA Voluntarily Recalls All Unexpired Lots of its Ranitidine Tablets and Ceases Distribution, Due to Possible Presence of N-nitrosodimethylamine (NDMA) Impurity,” U.S. Food & Drug Administration, December 17, 2019. 38“Integrated Annual Report 2022-23,”Aurobindo Pharma, August 23, 2023. 39Joseph Keenan, “FDA Slaps Aurobindo with Warning Letter on API Testing Failures, Repeated Violations,” Fierce Pharma, January 27, 2022. 40“Warning Letter, Aurobindo Pharmaceutical Limited,” U.S. Food & Drug Administration, January 12, 2022. 41“Warning Letter, Aurobindo Pharmaceutical Limited,” U.S. Food & Drug Administration, June 20, 2019. 42“AuroMedics Pharma LLC Issues Voluntary Nationwide Recall of Polymyxin B for Injection USP, 500000 Unit per Vial, Due to the Presence of Particulate Matter,” US Food and Drug Administration, 26 January 2022, 43“Aurobindo Pharma Gets Usfda Nod For Generic Injectible Cancer Drug Bortezomib; To Be Launched Immediately,” CNBC TV18, May 3. 2022. 44Coalition for a Prosperous America, “New CPA Report: Aurobindo, Largest Generic Drug Provider to U.S. Market, Has Substantial Ties to Sanctioned CCP Companies,” February 5, 2024. 45Anna Edney, “US Leans on India’s Pharma Industry to Snub China. There’s Just One Catch,” Bloomberg, February 5, 2024. <sup46“Warning Letter, Wintac Limited,” US Food and Drug Administration, August 13, 2020. 47IQVIA data. 48Eric Palmer and John Oyler. “Emcure India Plant Banned by the FDA,” Fierce Pharma, July 14, 2015. 49Fraiser Kansteiner, “Burn After Reading: FDA Blasts Intas for ‘Cascade of Failure’ After Investigators Find Heaps of Shredded Documents,” Fierce Pharma, January 20, 2023. 50“FDA 483 Alert: Intas Employees Tore Documents, Threw Acid to Destroy Evidence,” Pharma Compass, January 13, 2023. 51Tyler Patchen, “Thousands of Complaints and Lab Records in ‘Bags of Scrap’: FDA Inspects Cipla Site in India,”Endpoints News, March 6, 2023. 52“Investor Presentation — Q3 FY23,” Lupin, February 10, 2023. 53“Leading Causes of Death,” Centers for Disease Control and Prevention – National Centre for Health Statistics, January 17, 2024. 54“Warning Letter, Lupin Limited,” U.S. Food & Drug Administration, September 27, 2022. 55Kyle Blankenship, “FDA Knocks Lupin Plant with Warning Letter After Drugmaker Failed to Remedy Operational Woes,” Fierce Pharma, September 19, 2019. 56“Lupin, Sun Pharma Recall Lisinopril and Clonazepam Respectively in the US Market,”Economic Times of India, August 9, 2020. 57Press Trust of India, “Lupin Recalls Over 16,000 Bottles of Tuberculosis Drug In US,” Business Standard, January 21, 2023. 58Zachary J. Il’Giovine, J. Bradley Williams, R. Preston Mason, Samuel C.R. Sherratt, Eileen M. Hsich, Harry Lever, Mandeep R. Mehra, Randall C. Starling, “Kinetics of Generic Tacrolimus in Heart Transplantation: A Cautionary Note,” The Journal of Heart and Lung Transplantation 40, no. 7, July 2021. 59“Dr Reddy’s Lab Recalls Over 4,000 Bottles Of Generic Drug In US,”Outlook India, March 7, 2023. 60Ruchika Sharma, “Dr Reddy’s Labs Recalls Over 8000 Bottles Of Generic Medication In US Over Packaging Error,“Medical Dialogues, January 8, 2024. 61Rohan Gupta, “Indian Pharma Firms Receive 34% of FDA Warnings This Year,”Down to Earth, August 21, 2019. 62“Frequently Requested or Proactively Posted Compliance Records,” U.S. Food and Drug Administration, accessed February 8, 2024. 63“FDA-Approved Drugs-Abbreviated New Drug Application (ANDA): 215382,” U.S. Food & Drug Administration, accessed February 10, 2024. 64“Drug Shortages: Root Causes and Potential Solutions,” U.S. Food & Drug Administration, March 11, 2020. 65“Warning Letter, Cadila Healthcare,” U.S. Food & Drug Administration, October 29, 2019. 66Tinglong Dai. “U.S. Needs to Shore up Medical Device Manufacture or Risk Vulnerability in Times of Crisis.”The Baltimore Sun. December 26, 2023. 67Alexander Brown, François Chimits, Jeroen Groenewegen-Lau, Jacob Gunter, Gregor Sebastian, “Investigating State Support for China’s Medical Technology Companies.” MERICS, November 20, 2023. 68“Evaluating Plastic Syringes Made in China for Potential Device Failures: FDA Safety Communication,” U.S. Food & Drug Administration, November 30, 2023. 69U.S. Food & Drug Administration, “Evaluating Plastic Syringes.“ 70U.S. Food & Drug Administration, “Evaluating Plastic Syringes.“ 71Doug Palmer, “USTR Mulls Tariff Hikes on Chinese Medical Products Spared During Pandemic,” PoliticoPro, November 29, 2023. 72“Press Release: Schumer: Dire Drug Shortage Could Delay Treatments In Fulton & Across Upstate NY Unless FDA Acts & Congress Passes Legislation,” Office of Senator Chuck Schumer, June 26, 2023. 73Office of Senator Chuck Schumer. 74Anna Edney and Riley Griffin, “The Pentagon Wants to Root Out Shoddy Drugs. The FDA Is In Its Way,” Bloomberg, December 4, 2023. 75“Budget Hearing – Fiscal Year 2024 Request for the Food and Drug Administration,” House Committee on Appropriations, March 29, 2023. 76“October 2023 Medicaid & CHIP Enrollment Data Highlights,” The Centers for Medicare & Medicaid Services, January 31, 2024. 77Executive Order 14001, “A Sustainable Public Health Supply Chain,” January 21, 2021. 78U.S. Department of Health and Human Services, “National Strategy for a Resilient Public Health Supply Chain,” July 2021. Nick Iacovellais a senior vice president at the Coalition for a Prosperous America. America’s Other Health Care Crisis: Generic Medicine Supply Chains Jon Toomeyis a senior vice president at the Coalition for a Prosperous America. America’s Other Health Care Crisis: Generic Medicine Supply Chains Like us on Facebook Follow us on Twitter Articles RSS Feed Current Issue Archive About Contact Donate Subscribe Already subscribed?Sign In With Your AAJ Account|Sign In with Blink"}