{"id": 1390, "name": "Chelmsford Landmark", "domain": "thelandmark.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thelandmark.com/off-the-shelf-flowing-with-gratitude-fidelity-brings-hydration-to-library/", "title": "Off The Shelf Flowing With Gratitude Fidelity Brings Hydration To Library", "content": "Home News Sports School News Lifestyle Opinion ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary ClassifiedsSubmit a ClassifiedJobs Submit a Classified Jobs Submit a Classified Jobs LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Conversations Login Contact Us Subscribe Login Home News Sports School News Lifestyle Opinion ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary ClassifiedsSubmit a ClassifiedJobs Submit a Classified Jobs Submit a Classified Jobs LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Conversations Subscribe Login **Off the Shelf – Flowing with gratitude: Fidelity brings hydration to library** February 27, 2025 Conversations,Newsletter-Early-Week By Pam ChenevertRichards Memorial Library PAXTON — Thanks to a generous grant from Fidelity Bank, drinking water at Richards Memorial Library in Paxton now flows as abundantly as the stories on its shelves. The library is deeply grateful for the bank’s support in making this possible. Water, water, everywhere but here Hear me out, I’m going to bring up the “P” word. During the pandemic, the library’s drinking water fountain rusted out, and it started to leak. We turned it off and placed the dreaded “Out ofOrder” sign on it. One of my goals in 2024 was to identify and land a grant to replace the water fountain. Lucky day The library’s lucky day came when Fidelity VP/Banking Center Manager Tracy Sasseville visited the library to introduce herself and ask if we needed anything. The Youth Services Librarian requested and received the “Ssspectacular” Snake program, and the snake-themed gift bags with bookmarks and slap bracelets were a big hit. But when Sasseville visited, I had already received an initial quote to replace the old water fountain with a bottle filler, so the library was prepared to seize the opportunity to enhance the library experience for our patrons. Fidelity Bank’s support for the new water fountain at Richards Memorial Library reflects their deep commitment to community well-being. As they put it, “Giving back to the communities we serve is important to Fidelity Bank, and helping people stay hydrated is just one more way to show we care.” This generous donation not only enhances the library’s offerings but also ensures that visitors can stay hydrated and refreshed while enjoying the resources the library provides. The bank’s contribution demonstrates its dedication to supporting local initiatives that positively impact residents. Drink up! Please join Richards Memorial Library and Fidelity Bank for the official unveiling of the water bottle filler drinking fountain at 6 p.m. Tuesday, March 4. There will be a short presentation, free water bottles, and some fun swag. Community Partnership Richards Memorial Library is pleased to have a community partner in Fidelity Bank. We will be hosting financial literacy programs for various age groups in the next coming months. Recently, Fidelity Bank presented a program at the Paxton Council on Aging about seniors and fraud that was well-received. If there are any financial topics that you would like to hear about, please let us know. The Richards Memorial Library is open Tuesday and Thursday from 1 to 8 p.m., Wednesday and Friday from 9 a.m. to 5 p.m., and Saturdays from 10 a.m. to 2 p.m. The library is closed Saturdays when Monday is a holiday. Search our catalog atPaxton.Cwmars.org. View our website atRMLPaxton.org. Pam Chenevert is the library director of the Richards Memorial Library in Paxton, Massachusetts. She is currently readingWhat the Wife Knewby Darby Kane and recently watchedSaturday Night. She earned her master’s degree in library science (MSLS) from PennWest Clarion (formerly Clarion University), and a bachelor of arts in journalism from the University of Massachusetts at Amherst. Wachusett Regional High Graduation 2025June 10, 2025 Houghton garden is an outdoor classroomJune 5, 2025 Paxton charter effort moving forward, looking for inputJune 5, 2025 Princeton Business Association connects local businessesJune 5, 2025 Wachusett Goings OnJune 5, 2025 Paxton domain changing to .govJune 5, 2025 Daga named Student of the YearJune 5, 2025 Campus NewsJune 5, 2025 Letter: Garden Club thanks sponsors, contributorsJune 5, 2025 Public Safety logsJune 5, 2025 **Other News** June 5, 2025 June 5, 2025 May 29, 2025 Home About Accessibility Community Rules Contact Us Cookie Policy Privacy Policy Terms of Service Copyright © 2025 The Landmark, aCherryRoad MediaNewspaper. All rights reserved."}