{"id": 995, "name": "News Facts Network (NFN)", "domain": "newsfactsnetwork.com", "bias": "center", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://newsfactsnetwork.com/local-news/mayor-bass-condemns-ice-raids-as-riot-police-clash-with-protesters-in-downtown-los-angeles/", "title": "Mayor Bass Condemns Ice Raids As Riot Police Clash With Protesters In Downtown Los Angeles", "content": "**News Facts Network** Verified Factual News Home About News By BiasLeft-CenterLeast BiasedRight-Center Left-Center Least Biased Right-Center Left-Center Least Biased Right-Center News CategoriesNFN OriginalNFN Fact ChecksPolitics NFN Original NFN Fact Checks Politics NFN Original NFN Fact Checks Politics Fact vs. FictionAll Fact ChecksSubmit Fact Check All Fact Checks Submit Fact Check All Fact Checks Submit Fact Check From the Wires (NEW)NFN’s U.S. NewsNFN’s World News NFN’s U.S. News NFN’s World News NFN’s U.S. News NFN’s World News Support NFNAd-Free Ad-Free Ad-Free Log In/Log Out **Mayor Bass Condemns ICE Raids as Riot Police Clash with Protesters in Downtown Los Angeles** LOS ANGELES, CA — Tensions erupted in downtown Los Angeles Friday night afterU.S.Immigration and Customs Enforcement (ICE) agents conducted sweeping federal immigration raids across the city, detaining dozens of individuals. Riot police from the LAPD confronted protesters as demonstrations spread through the area. Federal agents reportedly targeted locations including a Home Depot in the Westlake District, a clothing warehouse in South L.A., and stores in the Fashion District. Protesters gathered throughout the day, culminating in a confrontation near the Los Angeles Federal Building after nightfall. Los Angeles Mayor Karen Bass issued a strong rebuke of the enforcement actions, stating, “These tactics sow terror in our communities and disrupt basic principles of safety in our city.” LAPD officers, equipped with riot gear, tear gas, and flash-bang devices, were deployed in response to what police declared an unlawful assembly. Protesters reportedly hurled debris at officers, prompting the use of non-lethal crowd control measures. The LAPD emphasized it was not involved in theICEraids but acted to prevent civil unrest. Among the detained was labor leader David Huerta of SEIU California, who was reportedly injured while documenting law enforcement activities. Source(s) Reuters–MBFC Rating Reuters–MBFC Rating Reuters–MBFC Rating **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Tumblr (Opens in new window)Tumblr **Like this:** **Related** **Discover more from News Facts Network** Subscribe to get the latest posts sent to your email. Type your email… Subscribe **Related News:** Los Angeles Mayor Karen Bass faces mounting backlash over wildfire response Shooting in downtown Louisville leaves ‘multiple casualties,’ police say ICE Conducts Nationwide Raids, Arrests Nearly 1,300 in First Week of Trump Administration **Post navigation** Media Bias Fact Check was founded by Dave Van Zandt in 2015. Dave is a registered Non-Affiliated voter who values evidence-based reporting. Δ Δ Illinois Ranks Dead Last in Economic Health, New Report Findson June 7, 2025 at 2:02 pmIllinois has landed at the bottom of a new national ranking of state economies, placing... The post Illinois Ranks Dead Last in Economic Health, New […] Illinois has landed at the bottom of a new national ranking of state economies, placing... The post Illinois Ranks Dead Last in Economic Health, New […] Illinois has landed at the bottom of a new national ranking of state economies, placing... The post Illinois Ranks Dead Last in Economic Health, New […] Trump Warns Musk of “Serious Consequences” if He Funds Democratson June 7, 2025 at 2:01 pmPresident Donald Trump warned Saturday there would be “serious consequences” if Elon Musk finances Democratic... The post Trump Warns Musk of […] President Donald Trump warned Saturday there would be “serious consequences” if Elon Musk finances Democratic... The post Trump Warns Musk of […] President Donald Trump warned Saturday there would be “serious consequences” if Elon Musk finances Democratic... The post Trump Warns Musk of […] Mayor Bass Condemns ICE Raids as Riot Police Clash with Protesters in Downtown Los Angeleson June 7, 2025 at 8:54 amLOS ANGELES, CA — Tensions erupted in downtown Los Angeles Friday night after U.S. Immigration... The post Mayor Bass Condemns ICE Raids as Riot […] LOS ANGELES, CA — Tensions erupted in downtown Los Angeles Friday night after U.S. Immigration... The post Mayor Bass Condemns ICE Raids as Riot […] LOS ANGELES, CA — Tensions erupted in downtown Los Angeles Friday night after U.S. Immigration... The post Mayor Bass Condemns ICE Raids as Riot […] Conspiracy Theorists Claim Trump-Musk Feud Is a Staged Distractionon June 7, 2025 at 6:00 amAs the bitter public fallout between Donald Trump and Elon Musk rattles Washington and Wall... The post Conspiracy Theorists Claim Trump-Musk Feud Is […] As the bitter public fallout between Donald Trump and Elon Musk rattles Washington and Wall... The post Conspiracy Theorists Claim Trump-Musk Feud Is […] As the bitter public fallout between Donald Trump and Elon Musk rattles Washington and Wall... The post Conspiracy Theorists Claim Trump-Musk Feud Is […] Trump Suggests Musk’s Erratic Attacks Tied to Drug Use as Feud Escalateson June 7, 2025 at 4:01 amDonald Trump is privately blaming Elon Musk’s recent erratic behavior on drug use, according to... The post Trump Suggests Musk’s Erratic Attacks […] Donald Trump is privately blaming Elon Musk’s recent erratic behavior on drug use, according to... The post Trump Suggests Musk’s Erratic Attacks […] Donald Trump is privately blaming Elon Musk’s recent erratic behavior on drug use, according to... The post Trump Suggests Musk’s Erratic Attacks […] Two Unvaccinated Infants Die from Whooping Cough in Kentucky, Health Officials Warnon June 7, 2025 at 1:00 amTwo unvaccinated infants have died from pertussis—commonly known as whooping cough—in Kentucky over the last... The post Two Unvaccinated Infants […] Two unvaccinated infants have died from pertussis—commonly known as whooping cough—in Kentucky over the last... The post Two Unvaccinated Infants […] Two unvaccinated infants have died from pertussis—commonly known as whooping cough—in Kentucky over the last... The post Two Unvaccinated Infants […] Newsom Fires Back at Trump, Suggests California Stop Sending Billions to Fedson June 6, 2025 at 10:00 pmSACRAMENTO — California Gov. Gavin Newsom suggested Friday that the state may consider withholding federal... The post Newsom Fires Back at Trump, […] SACRAMENTO — California Gov. Gavin Newsom suggested Friday that the state may consider withholding federal... The post Newsom Fires Back at Trump, […] SACRAMENTO — California Gov. Gavin Newsom suggested Friday that the state may consider withholding federal... The post Newsom Fires Back at Trump, […] Elon Musk Floats New ‘America Party’ After Feud with Trumpon June 6, 2025 at 9:00 pmElon Musk is floating the idea of a new political party after his public fallout... The post Elon Musk Floats New ‘America Party’ After Feud with […] Elon Musk is floating the idea of a new political party after his public fallout... The post Elon Musk Floats New ‘America Party’ After Feud with […] Elon Musk is floating the idea of a new political party after his public fallout... The post Elon Musk Floats New ‘America Party’ After Feud with […] Supreme Court Grants DOGE Team Access to Social Security Records Amid Privacy Concernson June 6, 2025 at 6:01 pmIn a 6–3 decision Friday, the Supreme Court granted the Trump administration’s DOGE team, led... The post Supreme Court Grants DOGE Team Access […] In a 6–3 decision Friday, the Supreme Court granted the Trump administration’s DOGE team, led... The post Supreme Court Grants DOGE Team Access […] In a 6–3 decision Friday, the Supreme Court granted the Trump administration’s DOGE team, led... The post Supreme Court Grants DOGE Team Access […] Wrongly deported Maryland man Abrego Garcia returned to U.S.on June 6, 2025 at 6:01 pmKilmar Abrego Garcia, a Maryland man wrongly deported to El Salvador in March, was returned... The post Wrongly deported Maryland man Abrego Garcia […] Kilmar Abrego Garcia, a Maryland man wrongly deported to El Salvador in March, was returned... The post Wrongly deported Maryland man Abrego Garcia […] Kilmar Abrego Garcia, a Maryland man wrongly deported to El Salvador in March, was returned... The post Wrongly deported Maryland man Abrego Garcia […] FBI Recovers Fauci Devices as Trump Allies Push Discredited COVID Claimson June 6, 2025 at 6:01 pmFBI Director Kash Patel announced a “breakthrough” in the agency’s ongoing investigation into Dr. Anthony... The post FBI Recovers Fauci […] FBI Director Kash Patel announced a “breakthrough” in the agency’s ongoing investigation into Dr. Anthony... The post FBI Recovers Fauci […] FBI Director Kash Patel announced a “breakthrough” in the agency’s ongoing investigation into Dr. Anthony... The post FBI Recovers Fauci […] Pardoned Proud Boys Sue U.S. Government for $100M Over Jan. 6 Convictionson June 6, 2025 at 4:01 pmFive leaders of the Proud Boys filed a federal lawsuit Friday seeking $100 million in... The post Pardoned Proud Boys Sue U.S. Government for $100M […] Five leaders of the Proud Boys filed a federal lawsuit Friday seeking $100 million in... The post Pardoned Proud Boys Sue U.S. Government for $100M […] Five leaders of the Proud Boys filed a federal lawsuit Friday seeking $100 million in... The post Pardoned Proud Boys Sue U.S. Government for $100M […] Yale, UPenn Say Trump’s Health Cuts Could Kill 51,000 a Yearon June 6, 2025 at 2:01 pmHealth policy researchers from Yale University and the University of Pennsylvania warn that Donald Trump‘s... The post Yale, UPenn Say Trump’s […] Health policy researchers from Yale University and the University of Pennsylvania warn that Donald Trump‘s... The post Yale, UPenn Say Trump’s […] Health policy researchers from Yale University and the University of Pennsylvania warn that Donald Trump‘s... The post Yale, UPenn Say Trump’s […] Poll: Most Americans Side with Neither in Trump-Musk Feud, But GOP Backs Trumpon June 6, 2025 at 1:00 pmA new YouGov poll reveals that while the public feud between Donald Trump and Elon... The post Poll: Most Americans Side with Neither in Trump-Musk […] A new YouGov poll reveals that while the public feud between Donald Trump and Elon... The post Poll: Most Americans Side with Neither in Trump-Musk […] A new YouGov poll reveals that while the public feud between Donald Trump and Elon... The post Poll: Most Americans Side with Neither in Trump-Musk […] Musk Signals Slight Shift After Escalating Feud with Trumpon June 6, 2025 at 8:01 amElon Musk offered a small gesture of reconciliation Thursday night after a bitter public feud... The post Musk Signals Slight Shift After Escalating […] Elon Musk offered a small gesture of reconciliation Thursday night after a bitter public feud... The post Musk Signals Slight Shift After Escalating […] Elon Musk offered a small gesture of reconciliation Thursday night after a bitter public feud... The post Musk Signals Slight Shift After Escalating […] About News Facts Network (NFN)News Facts Network (NFN) publishes news that is certified to be factual according toMedia Bias Fact Check. MBFC vets each article for accuracy and clearly labels the bias of the original source. **News Facts Network** Verified Factual News © Copyright 2025 News Facts Network. All Rights Reserved. Terms and Conditions Disclaimer Fair Use Policy Corrections Policy Funding Contact **Add News Facts Network to your Homescreen!**"}