{"id": 899, "name": "Munchner Merkur", "domain": "merkur.de", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.merkur.de/verbraucher/stiftung-warentest-org65863/", "title": null, "content": "Merkur.de Startseite Verbraucher Stiftung Warentest **Stiftung Warentest** **Stiftung Warentest** Politik Wirtschaft Welt Deutschland Bayern Lokales Leben VerbraucherStiftung WarentestSchließen Stiftung Warentest Schließen Stiftung Warentest Schließen Sport Rätsel PDF-Bibliothek Wissen Kultur Stars & TV Auto Meinung Reise Produktempfehlung Anzeigen & Märkte Wetter Abo Über uns ⛅ Schließen Fotos Fotos Discounter schneiden gut ab **Bekannte Marke vorne, andere fällt durch: Das sind die besten Sonnencremes 2025** Fischgenuss ohne Reue Aromatisch gut? **Split-Klimageräte im Test - welche Modelle effizient kühlen** Fotos **Private Rentenversicherungen unter der Lupe: Welches Alter man erreichen muss, damit sie sich lohnen** **Arztkosten im Urlaub: Ab 20 Euro „sehr gut“ geschützt** Fotos Video **Stiftung Warentest untersucht Dubai Schokolade: Spezialisten stoßen auf krebserregende Schadstoffe** **Geschäftsunfähigkeit bei Demenz: So sorgen Sie vor** Fotos Video **„Existenzbedrohende Kostenfalle“ für Rentner: Viele Privatversicherungen können nicht überzeugen** Video **Nicht ratsam: „Existenzbedrohenden Kostenfalle“ bei den meisten PKV-Tarifen** Fotos Video **Stiftung Warentest prüft Akku-Staubsauger: Teuerste Produkte gewinnen – Top-Marken fallen durch** Video **Stiftung Warentest prüft Olivenöl: Vier Produkte mit Mineralöl belastet – Nur Eigenmarken überzeugen** Video **Stiftung Warentest nimmt Qualität von Mystery Boxes und Secret Packs unter die Lupe** **Akku-Staubsauger im Test: Nur drei schneiden „gut“ ab** Video **Stiftung Warentest testet Räucherlachs: Viele Enttäuschungen – Aldi-Lachs und Bio-Produkt überzeugen** **Spenden für Kinder: Die passende Hilfsorganisation finden** **Festgeld: Drei Prozent sind ein guter Zinssatz** Fotos Video **ARD testet Weihnachts-Backmischungen: Konditor fällt vernichtendes Urteil** Video **Weihnachtsgebäck im Test: Krebserregende Schadstoffe in Produkten von Kaufland und Aldi entdeckt** Video **Traditionsmarke führt bei Filterkaffee-Test – Bei einem Kriterium kassiert es aber eine schlechte Note** **Front- oder Toplader: Welche Waschmaschinen überzeugen?** Video **Steigende Beiträge der Krankenkassen – was Versicherte erwartet** Seit 1964 **Produkttests, Gütesiegel und Lizensierung: So arbeitet die Verbraucher-Organisation Stiftung Warentest** Stiftung Warentest prüft regelmäßig diverse Produkte und Dienstleistungen des täglichen Lebens. In der Test-Zeitschrift veröffentlicht sie ihre Ergebnisse. Berlin – Die Stiftung Warentest ist eine gemeinnützige Organisation in Deutschland. Sie hat einen staatlichen Auftrag und wird entsprechend zu einem Teil mit Steuermitteln gefördert. Die Stiftung untersucht und vergleicht die Waren und Dienstleistungen verschiedener Anbieter. Seit dem Dezember 1964 sitzt das Unternehmen am Lützowplatz in Berlin und testet Produkte. **Die Geschichte der Stiftung Warentest** Die Gründung und Finanzierung einer derartigen Organisation wurde im Oktober 1962 vom damaligen Bundeskanzler Konrad Adenauer (†1967) und der Bundesregierung beschlossen. Am 4. Dezember 1964 wurde sie vom Bundeswirtschaftsminister Kurt Schmücker (†1966) als eine selbstständige, rechtsfähige Stiftung bürgerlichen Rechts errichtet. Dabei handelte es sich um einen wichtigen Fortschritt im Verbraucherschutz. Die erste Test-Zeitschrift kam im Jahr 1966 auf den Markt. Die Auflage hatte 210.000 Exemplare. Jedoch war der Verkauf im Einzelhandel wenig erfolgreich, sodass die Stiftung ihre Testergebnisse fortan an Abonnenten und Einzelhändler in Heftform verkaufte. Wichtige Untersuchungsergebnisse gibt die Stiftung seit 1968 an Zeitungs- und Zeitschriftenverlage weiter, was ihre Beliebtheit und Bekanntheit steigerte. Seit 1997 ist die Stiftung Warentest auch im Internet vertreten. **Die Testarbeit der gemeinnützigen Organisation** Zur Arbeit von Stiftung Warentest gehört die jährliche Durchführung von mehr als 100 vergleichenden Tests und Untersuchungen von Waren und Dienstleistungen. Mit ihren Testergebnissen deckt die Stiftung fast alle Bereiche des täglichen Lebens ab. Die gemeinnützige Organisation berücksichtigt bei ihrer Testarbeit die folgenden Prioritäten: Produkte des alltäglichen Lebens Neu auf dem Markt Wöchentliche Testergebnisse zu Aktionswarenangeboten von Lebensmitteldiscountern Untersuchung von Aspekten der sozialen Unternehmensverantwortung (Corporate Social Responsibility) Informationen zu einzelnen Arzneimitteln und Anwendungsgebieten Informationen zur Eignung für Kinder Neben diesen thematischen Schwerpunkten zeichnet sich die Organisation auch durch ihre einzigartige Testmethode aus. Marktforscher und wissenschaftliche Mitarbeiter sind für die Auswahl und Durchführung der Prüfungen für die Test-Zeitschrift verantwortlich. Jedes Untersuchungsvorhaben ist mit dem Kuratorium und dem Fachbeirat abgestimmt. Externe, neutrale Prüfinstitute führen die Untersuchungen durch, indem sie die Prüfmuster anonym im Handel erwerben. Die Institute übermitteln der Stiftung ihre objektiven Testergebnisse, die die Stiftung Warentest dann prüft und auswertet. Zudem leitet sie die Ergebnisse vor der Veröffentlichung an die Anbieter weiter. Diese können das Testergebnis kontrollieren und eine Stellungnahme abgeben. Redakteure, deren Finanzierung unter anderem aus Steuermitteln erfolgt, veröffentlichen die Tests online und in gedruckter Form. **Die Finanzierung der Stiftung Warentest** Stiftung Warentest finanziert sich zu etwa 90 Prozent durch den Verkauf der Test-Zeitschrift. Im Jahr 2022 wurden monatlich 334.000 Exemplare gedruckt. Auch Finanztest mit rund 211.000 Heften im Jahr gehört zu der gemeinnützigen Organisation. Darüber hinaus verkauft die Stiftung Bücher, Sonderpublikationen, Werbelizenzen für die Nutzung der Testergebnisse sowie die Online-Testergebnisse. Im Jahr 2022 beliefen sich diese Umsätze auf etwa 49 Millionen Euro. Hinzu kamen fast eine Million Euro aus staatlichen Zuwendungen. Diese Summe zahlte die Bundesregierung als Ausgleich dafür, dass die Stiftung keine Werbeanzeigen in ihren Publikationen druckt. Somit ist ein Teil der Stiftung durch Steuermittel finanziert. Werbeanzeigen für Produkte könnten die Stiftung Warentest in Abhängigkeit von bestimmten Anbietern bringen, weshalb sie nicht erwünscht sind. Zugleich gibt die Stiftung an, dass sie nicht von den öffentlichen Mitteln abhängig ist, da sie ihr Budget größtenteils selbst erwirtschaftet. Nach einer Reduktion der Unterstützung aus Steuermitteln im Jahr 2009 erwirtschaftete die Stiftung im Jahr 2012 erstmalig Verluste. Auch eine niedrigere Verzinsung des Stiftungskapitals war dafür verantwortlich. In den Haushaltsjahren 2016 und 2017 hat die Bundesregierung das Kapital der Stiftung um insgesamt 100 Millionen Euro aufgestockt. **Diese Produkte testet die Stiftung Warentest** Die Stiftung testet zahlreiche Produkte des Alltags, Dienstleistungen und Medikamente. Jedoch steht sie vor dem Problem, dass es nicht möglich ist, alle auf dem Markt vorhandenen Produkte in die Testergebnisse einzubeziehen. Daher handelt es sich stets um eine Auswahl an Produkten, die sich durch Marktrelevanz oder bestimmte Eigenschaften auszeichnen. Die gemeinnützige Organisation konzentriert sich auf Artikel, die besonders häufig verkauft werden, um diesem Dilemma zu entgehen. Zudem gibt es auf der Internetseite der Stiftung einen Produktfinder, der alle Tests aus der gewählten Produktkategorie zusammenfasst. So können Interessierte in den meisten Fällen mehrere hundert getestete Modelle aus dieser Kategorie miteinander vergleichen. Bei allen Produkten, die für die Test-Zeitschrift und andere Publikationen unter die Lupe genommen werden, testet die Stiftung auf diese Aspekte: Objektive Merkmale des Nutzwertes und des Gebrauchswertes Umweltverträglichkeit Qualität und Langlebigkeit Nebenwirkungen oder Auswirkungen auf die Gesundheit Insbesondere bei Lebensmitteln und Produkten für Kinder sind diese Informationen sehr wichtig. Die Finanzierung der Stiftung Warentest aus Steuermitteln dient dazu, den Verbraucher zu informieren, ihn aber auch bei einer wirtschaftlichen Haushaltsführung sowie einem gesundheits- und umweltbewussten Verhalten zu unterstützen. **Veröffentlichung der Testergebnisse in der Test-Zeitschrift** Auf der Webseite der Stiftung Warentest finden sich alle Testergebnisse der Stiftung seit Anfang 1998. Neben den Tests gehören dazu auch aktuelle Meldungen wie Gerichtsurteile und Rückrufaktionen, interaktive Rechner und kostenlose Kurzfassungen der Tests. Die früheren Test-Zeitschriften lassen sich online für geringe Beträge erwerben. Die gedruckte Test-Zeitschrift können Interessierte online bestellen oder in einem Abonnement regelmäßig beziehen. Jede Ausgabe enthält verschiedene Tests und interessante Meldungen. Produkte und Themen aus den Bereichen Ernährung und Kosmetik, Freizeit und Verkehr, Geld und Recht, Gesundheit, Haushalt und Garten sowie Multimedia sind besonders häufig vorhanden. Übrigens: Das Verbraucher-MagazinÖko-Testgehört trotz des ähnlichen Namens nicht zur Stiftung Warentest. **Die Bewertungsnoten der Stiftung Warentest** In ihren Bewertungen nutzt die Stiftung Warentest ein System, das den deutschen Schulnoten ähnelt. Die folgenden Zahlen kommen zum Einsatz: 0,5 bis 1,5: sehr gut 1,6 bis 2,5: gut 2,6 bis 3,5: befriedigend 3,6 bis 4,5: ausreichend 4,6 bis 5,5: mangelhaft In den Ergebnissen in der Test-Zeitschrift und den anderen Publikationen der gemeinnützigen Organisation kommen diese Kategorien zum Einsatz. In Kombination mit dem Logo der Stiftung ist so auf einen Blick ersichtlich, welche Bewertung die Stiftung Warentest den einzelnen Produkten gegeben hat. Die Noten sind in Deutschland weit verbreitet und bekannt. Ein Produkt, das von der Stiftung Warentest eine schlechte Bewertung erhalten hat, wird es in der Folge eher schwer auf dem Markt haben. Wer hingegen eine gute Note erhält, kann mit guten Umsätzen seiner Produkte oder Dienstleistungen rechnen. Dies gilt auch für die Ergebnisse von Finanztest. **Lizenzierung der Ergebnisse von Stiftung Warentest** Seit dem Juli 2013 ist die Werbung mit Testergebnissen der Stiftung für alle Unternehmen kostenpflichtig. Stiftung Warentest nutzt neben den Steuermitteln die Einnahmen aus dieser Lizenzierung für die eigene Finanzierung. Die Preisspanne für eine Lizenz der Testergebnisse liegt im vier- bis fünfstelligen Bereich. Die Lizenz ist normalerweise für ein bis zwei Jahre gültig. Mit den Markenlizenzen sind 2022 rund sechs Millionen Euro eingenommen worden. Rubriklistenbild: © picture alliance / dpa-tmn / Stiftung Warentest **Unsere Services für Sie im Überblick** **Service** **Anzeigen** **Abo** **Über uns** Startseite Israel im Krieg Ukraine-Krieg China Schließen Startseite BMW Bürgergeld Rente Tesla Volkswagen Schließen Startseite Urlaub in Italien Urlaub in Österreich Vulkane Erdbeben Vermisstenfälle Schließen Startseite Nürnberg & Franken Augsburg & Schwaben Regensburg & Oberpfalz Passau & Niederbayern Schließen Startseite Bad Tölz Dachau Ebersberg Erding Freising Fürstenfeldbruck Garmisch-Partenkirchen Geretsried-Wolfratshausen Holzkirchen Landsberg Miesbach München Landkreis München Schongau Starnberg Tegernsee Weilheim Würmtal Unsere PartnerLokalesDasGelbeBlattForumHallo EbersbergHallo ErdingHallo FalkeIntelligenzblattKreisboteKurierSchließen Lokales DasGelbeBlatt Forum Hallo Ebersberg Hallo Erding Hallo Falke Intelligenzblatt Kreisbote Kurier Schließen Lokales DasGelbeBlatt Forum Hallo Ebersberg Hallo Erding Hallo Falke Intelligenzblatt Kreisbote Kurier Schließen Schließen Startseite 24garten Buchtipps Familie Fitness Games Geld Genuss Gesundheit KarriereLebenSprachkurseSchließen Leben Sprachkurse Schließen Leben Sprachkurse Schließen Tiere Wohnen Schließen Startseite Stiftung Warentest Schließen Startseite Lokalsport FC Bayern TSV 1860 Fußball Amateurfußball Wintersport Eishockey Mehr Sport Schließen Startseite Reisewelt Schließen Startseite Leser werben Leser Schließen Startseite Projekt KLASSE Schließen"}