{"id": 1115, "name": "Popular Resistance", "domain": "popularresistance.org", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://popularresistance.org/brazils-mst-promotes-agrarian-reform-amidst-environmental-crisis-during-nature-day/", "title": "Brazils Mst Promotes Agrarian Reform Amidst Environmental Crisis During Nature Day", "content": "**Daily movement news and resources** About Us Resources News PodcastsClearing The FOGWTF is Going on in Latin America & the Caribbean Clearing The FOG WTF is Going on in Latin America & the Caribbean Clearing The FOG WTF is Going on in Latin America & the Caribbean Kevin Zeese Emerging Activists Fund Campaigns School Donate About Us Resources News PodcastsClearing The FOGWTF is Going on in Latin America & the Caribbean Clearing The FOG WTF is Going on in Latin America & the Caribbean Clearing The FOG WTF is Going on in Latin America & the Caribbean Kevin Zeese Emerging Activists Fund Campaigns School Donate **Daily movement news and resources** About Resources About Resources News PodcastsClearing The FOGWTF is Going on in Latin America & the Caribbean Clearing The FOG WTF is Going on in Latin America & the Caribbean Clearing The FOG WTF is Going on in Latin America & the Caribbean School Store News PodcastsClearing The FOGWTF is Going on in Latin America & the Caribbean Clearing The FOG WTF is Going on in Latin America & the Caribbean Clearing The FOG WTF is Going on in Latin America & the Caribbean School Store **Brazil’s MST Promotes Agrarian Reform Amidst Environmental Crisis** By Telesur,Orinoco Tribune. June 4, 2025 Organize! Above photo: MST flag on a field next to books. MST. Brazil’s Landless Rural Workers’ Movement (MST) launched the third edition of Nature Day this Monday, an initiative that is part of its national plan “Plant Trees, Produce Healthy Food.” The goal is not only reforestation but also strengthening popular agrarian reform as an alternative to the current environmental crisis. This was stated by Camilo Augusto, project coordinator, in an interview with local media. Since 2021, the MST has promoted this event across Brazil, carrying out activities that include planting, seed distribution and mobilizing around environmental preservation. A prominent example is in Paraná state, where aerial sowing of juçara palm and araucaria pine seeds has become a nationally recognized tradition. Both are endangered species. A post shared by MST (@movimentosemterra) This year, according to Camilo Augusto, the MST hopes to release more than 15 tons of these seeds. “It’s a real feat. In a protected area, this could remove these species from the endangered species list,” Augusto stated, highlighting the initiative’s potential impact. For the MST, Nature Day is also a fundamental tool for exposing those truly responsible for the climate emergency. “The important thing is to denounce those who deforest, burn and pollute the waters, and to present an alternative proposal that doesn’t rely solely on financial figures and data to solve the problem, as capital does,” Augusto explained. The event includes technical seed monitoring with the Federal University of Paraná (UFPR), measuring germination rates and planting effectiveness as environmental preservation strategies. This initiative has support from traditional communities – including Indigenous peoples, riverside dwellers and quilombolas – and institutions like the National Institute of Colonization and Agrarian Reform (INCRA), Federal Police (PF), Ministry of Agrarian Development (MDA) and National Supply Company (CONAB). Brazil’s Landless Rural Workers’ Movement (MST) launched its third Nature Day, an event that not only seeks reforestation but also denounces those responsible for the environmental crisis and promotes popular agrarian reform as a transformative solution. Agrarian Reform,Brazil,Environment,Landless Workers’ Movement (MST),MST,Reforestation **Daily Movement News And Resources.** Home Resist! Create! Educate! Organize! Strategize! Newsletter Donate Home Resist! Create! Educate! Organize! Strategize! Newsletter Donate **Urgent End Of Year Fundraising Campaign** Online donations are back!Keep independent media alive. Due to the attacks on our fiscal sponsor, we were unable to raise funds online for nearly two years. As the bills pile up, your help is needed now to cover the monthly costs of operating Popular Resistance. **Urgent End Of Year Fundraising Campaign** Online donations are back! Keep independent media alive. Due to the attacks on our fiscal sponsor, we were unable to raise funds online for nearly two years. As the bills pile up, your help is needed now to cover the monthly costs of operating Popular Resistance. Independent media outlets are being suppressed and dropped by corporations like Google, Facebook and Twitter. Sign up for our daily email digest before it’s too late so you don’t miss the latest movement news."}