{"id": 1904, "name": "Citizens Against Government Waste (CAGW)", "domain": "cagw.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.cagw.org/trumps-rescissions-are-the-next-step-to-save-taxpayer-dollars/", "title": "Trumps Rescissions Are The Next Step To Save Taxpayer Dollars", "content": "ABOUTMISSION/HISTORYDIRECTORS/STAFFSUPPORTINTERNSHIPSFINANCIAL INFORMATIONJOBSCONTACT US MISSION/HISTORYDIRECTORS/STAFFSUPPORTINTERNSHIPSFINANCIAL INFORMATIONJOBSCONTACT US MISSION/HISTORYDIRECTORS/STAFFSUPPORTINTERNSHIPS MISSION/HISTORY DIRECTORS/STAFF SUPPORT INTERNSHIPS FINANCIAL INFORMATIONJOBSCONTACT US FINANCIAL INFORMATION JOBS CONTACT US MISSION/HISTORYDIRECTORS/STAFFSUPPORTINTERNSHIPSFINANCIAL INFORMATIONJOBSCONTACT US MISSION/HISTORYDIRECTORS/STAFFSUPPORTINTERNSHIPS MISSION/HISTORY DIRECTORS/STAFF SUPPORT INTERNSHIPS FINANCIAL INFORMATIONJOBSCONTACT US FINANCIAL INFORMATION JOBS CONTACT US MISSION/HISTORYDIRECTORS/STAFFSUPPORTINTERNSHIPS MISSION/HISTORY DIRECTORS/STAFF SUPPORT INTERNSHIPS MISSION/HISTORY DIRECTORS/STAFF SUPPORT INTERNSHIPS FINANCIAL INFORMATIONJOBSCONTACT US FINANCIAL INFORMATION JOBS CONTACT US FINANCIAL INFORMATION JOBS CONTACT US WASTEWATCHER MEDIACOMMENTARYPRESS RELEASESVIDEOS COMMENTARYPRESS RELEASESVIDEOS COMMENTARYPRESS RELEASESVIDEOS COMMENTARY PRESS RELEASES VIDEOS COMMENTARYPRESS RELEASESVIDEOS COMMENTARYPRESS RELEASESVIDEOS COMMENTARY PRESS RELEASES VIDEOS COMMENTARYPRESS RELEASESVIDEOS COMMENTARY PRESS RELEASES VIDEOS COMMENTARY PRESS RELEASES VIDEOS ISSUESCONGRESSIONAL PIG BOOKEARMARK DATABASEPRIME CUTSISSUE BRIEFSAGENCY COMMENTSDEFENSEAVIATION & SPACEF-35 JOINT STRIKE FIGHTERPROCUREMENTINNOVATION & TECHNOLOGY POLICY CENTERANTITRUSTARTIFICIAL INTELLIGENCEBIOPHARMACEUTICALSINTELLECTUAL PROPERTYPRIVACYTECHNOLOGY AND INNOVATIONTELECOMMUNICATIONSGENERAL WASTEAGRICULTURE REFORMPOSTAL SERVICETAXESTRANSPORTATIONHEALTH AND SCIENCEPRICE CONTROLSGOVERNMENT RUN HEALTHCARE340B DRUG DISCOUNT PROGRAMPHARMACY BENEFIT MANAGERSTOBACCO HARM REDUCTIONSTATE ISSUES CONGRESSIONAL PIG BOOKEARMARK DATABASEPRIME CUTSISSUE BRIEFSAGENCY COMMENTS EARMARK DATABASE PRIME CUTS ISSUE BRIEFS AGENCY COMMENTS DEFENSEAVIATION & SPACEF-35 JOINT STRIKE FIGHTERPROCUREMENT AVIATION & SPACE F-35 JOINT STRIKE FIGHTER PROCUREMENT INNOVATION & TECHNOLOGY POLICY CENTERANTITRUSTARTIFICIAL INTELLIGENCEBIOPHARMACEUTICALSINTELLECTUAL PROPERTYPRIVACYTECHNOLOGY AND INNOVATIONTELECOMMUNICATIONS ANTITRUST ARTIFICIAL INTELLIGENCE BIOPHARMACEUTICALS INTELLECTUAL PROPERTY PRIVACY TECHNOLOGY AND INNOVATION TELECOMMUNICATIONS GENERAL WASTEAGRICULTURE REFORMPOSTAL SERVICETAXESTRANSPORTATION AGRICULTURE REFORM POSTAL SERVICE TAXES TRANSPORTATION HEALTH AND SCIENCEPRICE CONTROLSGOVERNMENT RUN HEALTHCARE340B DRUG DISCOUNT PROGRAMPHARMACY BENEFIT MANAGERSTOBACCO HARM REDUCTION PRICE CONTROLS GOVERNMENT RUN HEALTHCARE 340B DRUG DISCOUNT PROGRAM PHARMACY BENEFIT MANAGERS TOBACCO HARM REDUCTION STATE ISSUES CONGRESSIONAL PIG BOOKEARMARK DATABASEPRIME CUTSISSUE BRIEFSAGENCY COMMENTS EARMARK DATABASE PRIME CUTS ISSUE BRIEFS AGENCY COMMENTS EARMARK DATABASE PRIME CUTS ISSUE BRIEFS AGENCY COMMENTS DEFENSEAVIATION & SPACEF-35 JOINT STRIKE FIGHTERPROCUREMENT AVIATION & SPACE F-35 JOINT STRIKE FIGHTER PROCUREMENT AVIATION & SPACE F-35 JOINT STRIKE FIGHTER PROCUREMENT INNOVATION & TECHNOLOGY POLICY CENTERANTITRUSTARTIFICIAL INTELLIGENCEBIOPHARMACEUTICALSINTELLECTUAL PROPERTYPRIVACYTECHNOLOGY AND INNOVATIONTELECOMMUNICATIONS ANTITRUST ARTIFICIAL INTELLIGENCE BIOPHARMACEUTICALS INTELLECTUAL PROPERTY PRIVACY TECHNOLOGY AND INNOVATION TELECOMMUNICATIONS ANTITRUST ARTIFICIAL INTELLIGENCE BIOPHARMACEUTICALS INTELLECTUAL PROPERTY PRIVACY TECHNOLOGY AND INNOVATION TELECOMMUNICATIONS GENERAL WASTEAGRICULTURE REFORMPOSTAL SERVICETAXESTRANSPORTATION AGRICULTURE REFORM POSTAL SERVICE TAXES TRANSPORTATION AGRICULTURE REFORM POSTAL SERVICE TAXES TRANSPORTATION HEALTH AND SCIENCEPRICE CONTROLSGOVERNMENT RUN HEALTHCARE340B DRUG DISCOUNT PROGRAMPHARMACY BENEFIT MANAGERSTOBACCO HARM REDUCTION PRICE CONTROLS GOVERNMENT RUN HEALTHCARE 340B DRUG DISCOUNT PROGRAM PHARMACY BENEFIT MANAGERS TOBACCO HARM REDUCTION PRICE CONTROLS GOVERNMENT RUN HEALTHCARE 340B DRUG DISCOUNT PROGRAM PHARMACY BENEFIT MANAGERS TOBACCO HARM REDUCTION STATE ISSUES ITPCANTITRUSTARTIFICIAL INTELLIGENCEBIOPHARMACEUTICALSINTELLECTUAL PROPERTYPRIVACYTECHNOLOGY AND INNOVATIONTELECOMMUNICATIONS ANTITRUSTARTIFICIAL INTELLIGENCEBIOPHARMACEUTICALSINTELLECTUAL PROPERTYPRIVACYTECHNOLOGY AND INNOVATIONTELECOMMUNICATIONS ANTITRUSTARTIFICIAL INTELLIGENCEBIOPHARMACEUTICALSINTELLECTUAL PROPERTYPRIVACYTECHNOLOGY AND INNOVATIONTELECOMMUNICATIONS ANTITRUST ARTIFICIAL INTELLIGENCE BIOPHARMACEUTICALS INTELLECTUAL PROPERTY PRIVACY TECHNOLOGY AND INNOVATION TELECOMMUNICATIONS ANTITRUSTARTIFICIAL INTELLIGENCEBIOPHARMACEUTICALSINTELLECTUAL PROPERTYPRIVACYTECHNOLOGY AND INNOVATIONTELECOMMUNICATIONS ANTITRUSTARTIFICIAL INTELLIGENCEBIOPHARMACEUTICALSINTELLECTUAL PROPERTYPRIVACYTECHNOLOGY AND INNOVATIONTELECOMMUNICATIONS ANTITRUST ARTIFICIAL INTELLIGENCE BIOPHARMACEUTICALS INTELLECTUAL PROPERTY PRIVACY TECHNOLOGY AND INNOVATION TELECOMMUNICATIONS ANTITRUSTARTIFICIAL INTELLIGENCEBIOPHARMACEUTICALSINTELLECTUAL PROPERTYPRIVACYTECHNOLOGY AND INNOVATIONTELECOMMUNICATIONS ANTITRUST ARTIFICIAL INTELLIGENCE BIOPHARMACEUTICALS INTELLECTUAL PROPERTY PRIVACY TECHNOLOGY AND INNOVATION TELECOMMUNICATIONS ANTITRUST ARTIFICIAL INTELLIGENCE BIOPHARMACEUTICALS INTELLECTUAL PROPERTY PRIVACY TECHNOLOGY AND INNOVATION TELECOMMUNICATIONS CCAGW **Trump’s Rescissions Are the Next Step to Save Taxpayer Dollars** Following the Biden administration’s multi-trillion spending spree, which has pushed the national debt to $36.9 trillion, the government must tighten its belt and cut costs. After the House passed the One Big Beautiful Bill Act and it moved to the Senate, President Trump took the next step in his efforts to cut waste, fraud, and abuse bysubmittinga $9.4 billion rescission package to Congress on June 3, 2025. The proposal includes $1.1 billion in cuts for the Corporation for Public Broadcasting (CPB), which funds the Public Broadcasting Service and National Public Radio, along with unnecessary and wasteful foreign aid spending. Citizens Against Government Waste (CAGW) agrees with Sen. John Cornyn, whosaidthis is a “good start” and “We need to do about one a month.” The use of a rescissions package is challenging for any President. According to theCongressional Budget and Impoundment Control Act of 1974, a president cannot refuse to spend (impound) congressionally appropriated funds unless Congress agrees to this decision. Cutting spending that has been appropriated requires the submission of a rescissions proposal, after which Congress has 45 days to vote to approve. Rescission legislation is filibuster-proof and only requires a simple majority in both chambers of Congress. Congress can amend the provisions in the President’s proposal but cannot change the list of cuts or add more spending. According to a July 16, 2020, Government Accountability Officereport, since the enactment of the Congressional Budget Act, Congress has approved $25 billion out of the $92 billion in proposed rescissions. President Trump proposed rescissions in his first term, but they were rejected by the Senate. The $9.4 billion rescissions package includes programs that have been identified in CAGW’s2024 Prime Cutsreport, like international organizations and the CPB. The next package could include more cuts to federal agencies whose functions should be purely private, like eliminating the National Endowment for the Arts and National Endowment for the Humanities, which wouldsave$2 billion over five years. Congress should quickly consider and approve the rescissions. With a $36.9 trillion debt and interest on that debt the largest expenditure other than Social Security, the need for more and even larger rescissions packages is clear. **Post navigation** This Week in Waste – June 6, 2025byGrigory MenshikovJune 6, 2025 Citizens Against Government Waste works to eliminate waste, fraud, abuse, and mismanagement in government through research and public education. ABOUT WASTEWATCHER MEDIA CENTER ISSUES ITPC CCAGW 1-800-USA-DEBT ® MEDIA@CAGW.ORG 317 MASSACHUSETTS AVENUE, N.E.SUITE 300WASHINGTON, D.C. 20002 © Citizens Against Government Waste"}