{"id": 1979, "name": "Peoples Gazette", "domain": "gazettengr.com", "bias": "center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://gazettengr.com/exclusive-fidelity-faces-bankruptcy-as-supreme-court-orders-banking-giant-to-pay-n225-billion-damages-to-nigerian-firm/", "title": "Exclusive Fidelity Faces Bankruptcy As Supreme Court Orders Banking Giant To Pay N225 Billion Damages To Nigerian Firm", "content": "#EndSARS Politics Anti-Corruption Rights Economy Education Health Sport Nationwide Opinion #EndSARS Politics Anti-Corruption Rights Economy Education Health Sport Nationwide Opinion **EXCLUSIVE: Fidelity faces bankruptcy as Supreme Court orders banking giant to pay N225 billion damages to Nigerian firm** The bank is in talks with Sagecom to hammer out a repayment plan, but the urgency stipulated in the ruling could hamper its ability to spread out the liability without going under. The bank is in talks with Sagecom to hammer out a repayment plan, but the urgency stipulated in the ruling could hamper its ability to spread out the liability without going under. The bank is in talks with Sagecom to hammer out a repayment plan, but the urgency stipulated in the ruling could hamper its ability to spread out the liability without going under. Fidelity Bank is scrambling to stave off a looming insolvency after a Supreme Court panel found the top lender liable in a years-long tort dispute with a little-known general services venture operating out of Ibadan, Peoples Gazette heard from people familiar with the situation. The Lagos-based banking group has opened talks with lawyers representing Sagecom Concept Ltd to hammer out a repayment plan, but The Gazette understands that the urgency stipulated in the judgement could hamper the bank’s ability to spread out the N225 billion liability without going under. “To be honest, this is the biggest crisis the bank has ever faced,” a top management official told The Gazette via video conference over the weekend. “The obligation is simply too big.” “If the bank is miraculously spared, we would have the altruism of the small business that got this unprecedented judgement to appreciate,” the C-suite official added with precise candour under anonymity to discuss a development that has rattled the entire management. The company’s stock closed at N20.80 per share on Friday. Overall, it’s up nearly 140 per cent this year. Whereasthe bank declared N385 billion in profit before taxat the end of 2024, officials said it was largely driven by interests from loans that had since been rolled over, saying they were not uncertain about the inability of its balance sheet to absorb the massive judgement. No other institutions that could underwrite the damages have been identified as of Monday morning, the people added. A person familiar with banking regulations said the Central Bank of Nigeria might ultimately intervene rather than oversee the collapse of a top-tier commercial lender during a fragile economic environment. A bank spokesman declined to comment on the development. The bank’s lawyers in the matter, including senior practitioners Kanu Agabi and Onyechi Ikpeazu, did not return requests for comments. The April 11, 2025, unanimous decision of five justices who heard the matter stemmed from a pair of loans obtained by engineering giant G. Cappa Plc from FSB International Bank in the early 2000s. The loans, recorded as $3 million and N100 million at the time, were executed before Fidelity Bank bought FSB International and its liabilities as part of the banking sector consolidation in 2005. The cumulative facility was issued at prohibitive interest per annum, and Fidelity began seizing G. Cappa’s assets in Ikoyi and Ibadan that had been used to secure the deal when the company allegedly defaulted in 2005. G. Cappa sued at the time, and a federal judge in Lagos ordered Fidelity to desist from its aggressive depletion of G. Cappa’s assets, court documents said. But Fidelity’s management failed to obey the court order, and instead listed the assets for sale to potential buyers, including Sagecom. Court documents said Sagecom, run by Bamidele Ogunkanmi and U.S.-based Nigerian Dakore Miriki, paid N350 million to buy some of the properties from Fidelity Bank, but the company quickly sought to recoup its payment after seeing a January 2006 disclaimer that said a court order had enjoined Fidelity from selling G. Cappa’s assets. The matter was later remanded to the Lagos State High Court. After several years of litigation, during which the bank lost repeatedly, including at the Lagos Division of the Court of Appeal, the dispute wound up at the Supreme Court in 2018, leading to the final judgement last month. “Apart from the mountain of evidence against it, allowing the appellant to escape liability as it so desperately seeks to do here would be tantamount to allowing it to benefit from its own wrong,” the Supreme Court said in its lead opinion by Justice Adamu Jauro. “The notorious principle of equity that a court ought not to allow a person to take advantage of his own wrong still remains part of our jurisprudence.” The Gazette exclusively obtained the Supreme Court judgement, which had not been previously reported, after being informed that Fidelity Bank’s management was holding unusually long and frequent meetings lately. Sagecom, represented by Muiz Banire and Adeyinka Olumide-Fusika, successfully argued throughout the case that it suffered damages through Fidelity’s action because it borrowed the N350 million from FMCB to secure the troubled assets from Fidelity, enduring 19.5 per cent annual interest. Fidelity lawyers argued that the bank was not responsible for the damages and blamed G. Cappa for collecting rents on the Lagos assets following the initial court injunction. But the Supreme Court justices said Fidelity must pay for its apparent decision to disregard a live injunctive relief from a federal court. “At the heart of the matter lies the appellant’s somewhat egregious conduct in selling a property it knew was subject to a restraining court order,” the court said, adding that Fidelity deprived Sagecom of “the possession and the economic benefits of its purchase for many years.” The justices were unsparing as to Fidelity management’s conduct at the early stages of the dispute, repeatedly stating throughout the judgement that the bank admitted that it received notice of the injunction that blocked it from selling G. Cappa’s assets but proceeded anyway. “This was not mere negligence but a deliberate disregard for both the court’s authority (with the intention to undermine it) and the first respondent’s rights as an innocent purchaser,” Justice Jummai Hannatu Sankey said in her concurring opinion. “The law remains that parties to a suit must obey court orders whether or not they are correct.” The three other justices on the panel were Mohammed Lawal Garba, Moore Aseimo Ibrahim Adumein and Abubakar Saqid Umar. The justices also said that one way Fidelity might have prevailed in its appeal was if the bank had argued that there had been a perversion or miscarriage of justice in the lower courts. “The appellant has failed to demonstrate any perversity in the findings of the lower courts or any miscarriage of justice warranting this court’s intervention,” the court added. Consequently, the Supreme Court upheld the damages as calculated by the Lagos high court and imposed against Fidelity in a June 20, 2011, judgement, which Fidelity appealed. The Lagos judge, whom the Supreme Court lauded for doing a good job on the case, had ordered Fidelity to pay accrued earnings for several flats over many years Sagecom was unable to take possession of the assets. Following the Supreme Court judgement, Justice Olabisi Akinlade of the Lagos State High Court calculated damages due to Sagecom, finding that as of May 16, 2025, Fidelity Bank owed the firm $139,064,896.18. The court put the naira value at N225,285,131,812.38, using N1620 per dollar as of the close of business on May 15, 2025. Officials said Fidelity planned to argue the calculation during a court hearing before Mrs Akinlade, scheduled for May 19 at 9:00 a.m. However, sources familiar with the matter said it was unlikely the calculation would change. Mrs Akinlade, however, noted in a worksheet seen by The Gazette that “naira equivalent to be determined using the official exchange rate on the date of actual payment.” Representatives for G. Cappa and Sagecom could not be reached for comments. Fidelity Bank, led by its first female CEO Nneka Onyeali-Ikpe, has consistently ranked among the biggest banks in Nigeria, often placed at number six for its massive asset base. Today’s opposition leader Peter Obi ran the bank in the early oughts, leaving as chairman to seek office as Anambra governor in 2003. It has for years courted public dread as one of the financial institutions notorious for draconian loan practices, and a Lagos family recently blamed the bank’s management for the death of a real estate investor following a prolonged facility dispute. The bank has maintained no wrongdoing, often blaming the central bank and other regulators for imposing virtually all loan conditions on commercial lenders nationwide. A CBN spokeswoman did not immediately return a request seeking comment. We have recently deactivated our website's comment provider in favour of other channels of distribution and commentary. We encourage you to join the conversation on our stories via our Facebook, Twitter and other social media pages. **More from Peoples Gazette** **Agriculture** **FG tasks ECOWAS on leveraging financing strategies for agroecology** The federal government has urged stakeholders in the agriculture and finance sectors in the West Africa region to leverage financing strategies to enhance agroecology practicesNews Agency of Nigeria The federal government has urged stakeholders in the agriculture and finance sectors in the West Africa region to leverage financing strategies to enhance agroecology practices The federal government has urged stakeholders in the agriculture and finance sectors in the West Africa region to leverage financing strategies to enhance agroecology practices **Politics** **Katsina youths pledge to deliver over 2 million votes to Atiku** “Katsina State is Atiku’s political base because it is his second home.” “Katsina State is Atiku’s political base because it is his second home.” “Katsina State is Atiku’s political base because it is his second home.” **NationWide** **NEMA raises alarm over imminent flooding in 12 states** Mrs Umar appealed to residents to begin preparations in anticipation of the looming flood. Mrs Umar appealed to residents to begin preparations in anticipation of the looming flood. Mrs Umar appealed to residents to begin preparations in anticipation of the looming flood. **NationWide** **Tinubu says APC ready to welcome Wike** The president commended Mr Wike for his dedication and collaborative approach to governance. The president commended Mr Wike for his dedication and collaborative approach to governance. The president commended Mr Wike for his dedication and collaborative approach to governance. **NationWide** **Lawmakers’ primary duty is lawmaking, not projects: Gov. Otu** GovNews Agency of Nigeria Gov Gov **Lagos** **Lagos LG Polls: PDP candidate pledges inclusive leadership** He urged voters to come out in large numbers and support the PDP during the July 12 election. He urged voters to come out in large numbers and support the PDP during the July 12 election. He urged voters to come out in large numbers and support the PDP during the July 12 election. **NationWide** **Kaigama calls for renewed commitment for poor, elderly** He urged Nigerians, especially public servants, to emulate the selfless values of the deceased. He urged Nigerians, especially public servants, to emulate the selfless values of the deceased. He urged Nigerians, especially public servants, to emulate the selfless values of the deceased. **Economy** **Nigeria’s total trade for Q1 2025 stood at N36 billion: NBS** The report said that total exports increased by 7.42 per cent. The report said that total exports increased by 7.42 per cent. The report said that total exports increased by 7.42 per cent. **** In an era of fake news and overcrowded media marketplace, the journalists at Peoples Gazette aim to provide quality and practical information to help our readers stay ahead and better understand events around them. We focus on being the balanced source of true, stimulating and independent journalism. The Peoples Gazette Ltd, Plot 1095, Umar Shuaibu Avenue, Utako, Abuja. +234 805 888 8330. **Quick Links** Comment Policy Editorial Code of Conduct Share Your Tips Advert Rates **Follow** © 2025 Peoples Gazette™ Limited. Home #EndSARS Politics Anti-Corruption Rights Exclusive Economy Education Health Sport Showbiz NationwidePort HarcourtEnuguIbadanJosKanoMaiduguri Port Harcourt Enugu Ibadan Jos Kano Maiduguri Port Harcourt Enugu Ibadan Jos Kano Maiduguri Diaspora Abuja Lagos Africa Faith Agriculture"}