{"id": 1934, "name": "Crooked Media", "domain": "crooked.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://crooked.com/podcast/the-tonys-bet-awards-and-new-pop-releases-with-benito-skinner/", "title": "The Tonys Bet Awards And New Pop Releases With Benito Skinner", "content": "PodcastsAllNews & PoliticsEntertainment & CultureLimited SeriesSubscriber Series All News & Politics Entertainment & Culture Limited Series Subscriber Series All News & Politics Entertainment & Culture Limited Series Subscriber Series Daily News Newsletters Crooked Media Reads ShopMerchCoffeeFriends of the Pod Merch Coffee Friends of the Pod Merch Coffee Friends of the Pod Events AboutTeamNetworkCareers Team Network Careers Team Network Careers Vote Save America Friends of the PodHow To: Unlock Ad-FreeHow To: Join Crooked’s Discord How To: Unlock Ad-Free How To: Join Crooked’s Discord How To: Unlock Ad-Free How To: Join Crooked’s Discord PodcastsAllNews & PoliticsEntertainment & CultureLimited SeriesSubscriber Series All News & Politics Entertainment & Culture Limited Series Subscriber Series All News & Politics Entertainment & Culture Limited Series Subscriber Series Daily News Newsletters Crooked Media Reads ShopMerchCoffeeFriends of the Pod Merch Coffee Friends of the Pod Merch Coffee Friends of the Pod Events AboutTeamNetworkCareers Team Network Careers Team Network Careers Vote Save America Friends of the PodHow To: Unlock Ad-FreeHow To: Join Crooked’s Discord How To: Unlock Ad-Free How To: Join Crooked’s Discord How To: Unlock Ad-Free How To: Join Crooked’s Discord Popular Searches Pod Save America Voting Rights Video Hysteria **Filters** **Content Types** **Tags** **Results** Apple Podcasts Spotify Stitcher **Share This Podcast** FaceBook IconFaceBook Icon **Listen** Tune In RSS Spotify YouTube Pocket Casts YouTube Music Amazon Music Apple Podcasts **In This Episode** Ira and Louis discuss the Tony Awards, BET Awards, J Lo at World Pride, Gen Z trend pieces, and new music from Addison Rae, Mariah Carey, Sabrina Carpenter, and Madonna. Benito Skinner joins to discuss Overcompensating, translating millennial life to television, and more. Subscribe to Keep It on YouTube to catch full episodes, exclusive content, and other community events. Find us there at YouTube.com/@KeepItPodcast **Latest Episodes** **Related Articles** Sponsors Friends of the Pod Contact Careers Articles Archive Terms of Service Privacy **Sign up for our nightly newsletter.** © Crooked Media 2025 Terms of Service Privacy Policy Do Not Sell My Information **Subscribe to our nightly newsletter** What A Day -- what’s happening, why it matters, and what you can do about it. Cookies and similar technologies are used by Crooked Media and our third-party partners to personalize content and ads. You can click “OK” to accept these cookies and similar technologies or select “No Thanks” to opt out. You can learn more about our privacy practices by reviewing ourPrivacy Policy."}