{"id": 250, "name": "Climate Home News", "domain": "climatechangenews.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.climatechangenews.com/2024/07/02/beyond-lithium-how-a-swedish-battery-company-wants-to-power-europes-green-transition-with-salt/", "title": "Beyond Lithium How A Swedish Battery Company Wants To Power Europes Green Transition With Salt", "content": "News ▾PoliticsEnergyJusticeFinanceBusinessScienceNatureCarbon marketsExplainersAll news Politics Energy Justice Finance Business Science Nature Carbon markets Explainers All news Politics Energy Justice Finance Business Science Nature Carbon markets Explainers All news Investigations Series ▾Clean Energy Frontier Clean Energy Frontier Clean Energy Frontier Comment About ▾AboutThe teamWhat we stand forWrite for usTransparencyAdvertising, partners and sponsorship About The team What we stand for Write for us Transparency Advertising, partners and sponsorship About The team What we stand for Write for us Transparency Advertising, partners and sponsorship Contact News ▾PoliticsEnergyJusticeFinanceBusinessScienceNatureCarbon marketsExplainersAll news Politics Energy Justice Finance Business Science Nature Carbon markets Explainers All news Politics Energy Justice Finance Business Science Nature Carbon markets Explainers All news Investigations Series ▾Clean Energy Frontier Clean Energy Frontier Clean Energy Frontier Comment About ▾AboutThe teamWhat we stand forWrite for usTransparencyAdvertising, partners and sponsorship About The team What we stand for Write for us Transparency Advertising, partners and sponsorship About The team What we stand for Write for us Transparency Advertising, partners and sponsorship Contact **Beyond lithium: how a Swedish battery company wants to power Europe’s green transition with salt** **Martin Gelin** Photos & videos:Meli Petersson Ellafi Editor:Chloé Farand Data visualisation:Fanis Kollias X (Twitter) Facebook LinkedIn WhatsApp Email Print Northvolt’s sprawling battery research facility stands out as a modern cubic building of wood and steel between groves of birch trees and tall firs in eastern Sweden. The Swedish company’s labs form the largest campus for battery research in Europe. It’s here, in a former industrial zone on the outskirts of the town of Västerås, about 100 kilometres northwest of the capital Stockholm, that one of the continent’s best-funded climate tech companies could write the future of batteries. In November 2023, Northvolt – Europe’s only major home-grown EV battery maker –announceda breakthrough in battery development. The company had manufactured a first-of-its-kind energy storage battery by replacing widely usedcritical minerals– such as lithium, cobalt, nickel and graphite – with cheaper and far more abundant sodium – a chemical element which is found in table salt – as well as iron, nitrogen and carbon. “This is a fundamentally new technology,” Andreas Haas, head of Northvolt’s sodium-ion programme, told Climate Home News in an interview. The timing of Northvolt’s innovation took the battery industry bysurprise. According to Daniel Brandell, a materials chemist at Uppsala University in Sweden, technology roadmaps in North America and Europe had put this developmentcloser to 2030than prior to 2025. While Chinese companies were first to use sodium to replace lithium in batteries, they often relied on other critical minerals such as nickel or cobalt to optimise their performance, Brandell said. Today, there is stilllimited transparencyover the detailed performance and specific type of sodium-ion batteries Chinese companies are deploying. Northvolt’s sodium batteries, however, are critical mineral-free. In recent years, concerns have grown over the social and environmental harms of extracting and refining battery minerals. Reserves of lithium, nickel and cobalt areconcentrated in a handful of countries, making them prone to geopolitical and trade disruptions, and subject to intense competition. Meanwhile, Chinadominatesthe lithium-ion battery supply chain,controlling 70%of global lithium refining capacity. Sodium-based batteries offer a solution to the electric battery supply chain challenges, particularly for Western countries seeking to reduce their dependence on China for cleantech. According to2023 analysis by BloombergNEF, sodium batteries could displace272,000 tonnes of lithium demandby 2035, equivalent to about 7% of the overall market projected for that year. “The real value of sodium-ion batteries is the potential to build a European supply chain,” said Iola Hughes, research manager at London-based battery consultancy Rho Motion. “In the US and the EU, there is growing pressure to decouple from China and to build domestic supply, and sodium-ion batteries could have strong potential in that transition.” In January, the European Investment Bankbacked the company with over $1 billion in financing, citing Northvolt’s ability to create the first fully integrated circular lithium-ion battery production facility outside Asia. At the time, EU Commission Vice President Maroš Šefčovič, in charge of the European Green Deal, said the battery industry was of “strategic importance and a key battleground for global competitiveness”. “Northvolt, our battery pioneer, showcases that the EU has what it takes to build an innovative, sustainable and globally competitive battery ecosystem,” he said. **The vision: regional battery hubs** Northvolt’s sodium batteries have been designed to store excess power generated by renewable energy such as wind and solar, and dispatch it back to the grid when it is most needed. The International Energy Agency (IEA) says global energy storage capacity needs toincrease six timesfor the world to achieve the goal of tripling global renewable capacity by 2030, with batteries expected to deliver 90% of that growth. Sodium batteries, which are around30% cheaper than lithium onesto produce, could account for about 10% of the added capacity by 2030 and keep rising after that, according to the IEA. Northvolt says its batteries can be produced with locally sourced materials more cheaply and sustainably than lithium batteries. While the US holds92% of the world’s sodium carbonatereserves, the chemical is the sixth most common element on Earth –1,000 times more abundant than lithium– and is widely available in Europe. “The risk of dependence on US supply chains is low,” the company told Climate Home. This could enable the creation of regional battery manufacturing hubs, which could help accelerate decarbonisation in emerging economies and developing countries. “Because we’re not tied to a geography, we will no longer have to rely on lithium from mines in China or South America. We can produce these batteries all over the world,” said Haas. With better resistance to high temperatures than lithium batteries, which are inherently flammable, sodium-ion batteries could helpspeed up electrificationin regions exposed to extreme heat such as India, Africa and the Middle East by providing cheap and safe clean energy storage options. SeveralIndiancompanies,including multinational conglomerate Reliance, are working to produce sodium batteries in the country. They could become “crucial” to India’s transition from coal to renewable energy by making energy storage “cheaper and more accessible,” Brandell, of Uppsala University, told Climate Home. Northvolt said it will finalise its first sodium battery prototypes for energy storage later this year before developing a production line to manufacture them. **The destination: sodium-powered EVs** Over the last 30 years, lithium has been used to manufacture rechargeable batteries that are lightweight, compact, and yet can store a lot of energy. Sodium, while cheaper and more abundant, is larger and heavier than lithium, making for bulkier batteries. That means sodium-ion batteries store a lower amount of energy than lithium ones of the same size. That might not be a problem for static energy storage but can become an issue for electric cars, as most drivers want to get more miles out of a single charge. But despite sodium batteries’ lower energy density and the falling price of lithium, excitement around the technology has remained high. China leads the world in manufacturing clean energy technologies and sodium-based batteries are no exception. There are nearly30 sodium-ion battery manufacturing plantscurrently operating, planned or under construction globally – almost all of them in China. In May, the country put its first large-scale sodium-ion battery energy storage stationinto operation. The country has shown that sodium batteries could still have a role to play in decarbonising road transport. Earlier this year, Chinese EV manufacturerslaunchedsmall sodium-powered electric vehicles (EV) models, designed for short-range travel. The IEAfoundthat sodium-ion batteries could be used to power two-wheeled scooters and small EVs in cities, where drivers don’t require such long-range autonomy. With a capacity of 160 watt-hours per kilogramme (Wh/kg), Northvoltsaidits sodium-ion battery is the best performing battery of its type on the market. However, more work is needed before it can power long-range EVs. “We’re not yet ready for the European automotive market,” said Haas. But in a few years, Northvolt hopes to produce sodium-ion batteries with 180 Wh/kg capacity – packing the same amount of energy as some lithium batteries used in long-range electric cars, he added. “This is a first-generation technology and we see so much potential in it. But the second generation will be even better,” Haas told Climate Home. **Mission to ‘make oil history’** Northvolt was started in Stockholm in 2016 by former Tesla employees Peter Carlsson and Paolo Cerutti, who shared the goal of making battery manufacturing more sustainable by creating “the world’s greenest battery”. The company is on a mission to“make oil history”. “Renewable energy storage is the key to a carbon-neutral society, and batteries are the key to getting there,” Northvolt CEO Carlssontoldthe European Investment Bank (EIB) in 2018 after it offered the company a large investment. TheEIB loancontributed to the construction of the Västerås battery research facility, which opened the following year. The plant was intended toresearch and improvethe lithium battery cell manufacturing process for mass production at Northvolt’s Skellefteå gigafactory, not far below the Arctic Circle in northeast Sweden. It wasn’t long before the research focused on sodium battery development. Shortly after his arrival in 2019, Haas, who had left his job at a German energy company to work for Northvolt, became the head of the company’s sodium-ion project – a research initiative designed to find cost-efficient solutions to make batteries without lithium, cobalt or nickel. Together with a team of engineers, chemists and researchers from around the world, Haas worked closely with Altris, a Swedish battery developer and Northvolt’s research partner. Altris had achieved a breakthrough in battery chemistry by relying on research by Nobel Prize winning materials scientist John Goodenough and Japanese battery company Sharp, which together created Prussian White, the material used to manufacture the “negative” side of a sodium-ion battery, also known asthe cathode. “The issues that remained were energy density and moisture control. Northvolt came in and solved those two things”, increasing the battery’s performance to make it “commercially relevant,” said Haas. **A town of engineers** Kyrkbacken, a quaint downtown area of Västerås, where colourful 18th century houses line cobblestone streets, feels a world away from the glitzy hubs of green tech innovation. Yet, Northvolt’s choice of a nearby location for its R&D centre was not for the town’s picturesque attributes. The city has a rich history of technical innovation and engineering, and is home to titan ABB, a leader in industrial electrification and automation, which has been based in the city for more than 100 years. It now provides machinery to Northvolt. “It’s hard to overestimate the value of being in an existing ecosystem for engineering, chemistry and local industry while also being close enough to Stockholm for daily commuters,” Emma Nehrenheim, Northvolt’s chief environmental officer, told Climate Home during a visit of the labs. A notable number of the company’s engineers have the distinct local twang of the Västerås area. Like others here, Nehrenheim calls herself an “ABB child” – a descendant from generations of local engineers who worked for the firm. Northvolt’s mission to clean up the battery industry has also helped it attract global talent. In one of the facility’s staff rooms hangs a world map on which employees have placed pins on the location of their hometowns. At least 110 countries are represented, with clusters around southern India, Japan, South Korea and across Europe. Nehrenheim said the company receives more than 10,000 work applications every month. “Northvolt is a purpose-driven company and this makes it easier for us to recruit internationally, especially with young people who are eager to find meaningful work,” she said. **Expansion plans** For Hughes, of battery consultancy Rho Motion, Northvolt is well placed to bring its sodium-ion storage batteries into large-scale factory production. The company has received billions in funding from investors such as Goldman Sachs, BlackRock, Volkswagen and the Swedish Energy Agency and secured$55bnin lithium-ion battery orders from major car makers, such as BMW, Scania, Volvo and Volkswagen. At the start of 2024, Northvolt raised$5bn worth of debt– which it described as Europe’slargest-ever green loan– to expand its Skellefteå battery factory and finance its recycling efforts. This included over $1bn from the EIB. In April this year, Northvolt opened its first factory for producing sodium-ion batteries at its manufacturing facility in Skellefteå, with additional plants being planned in Canada, Germany and across Sweden, it said. However, Northvolt’s rapid growth has not been all plain sailing. In 2023, two Northvolt employees died inworkplace accidents. In June, BMW announced it had cancelleda $2bn order for lithium-ion batteriesafter production delays meant Northvolt could not deliver on a long-term supply contract on time. The German car makertold Reutersits partnership with Northvolt was focused on “the goal of developing next-generation battery cells”. Local media described the production delays as a “crisis”. Northvolt told Climate Home the delays will have no impact on the advancement of sodium batteries, citing “separate production and also a separate team working on the technology”. **Closing the supply chain loop** While still in the early stages of development, Northvolt’s sodium-ion batteries could become pivotal to the company’s sustainability strategy. By 2030, the companysaysit wants to bring down the carbon emissions embedded in the battery production process by 90%. For now, recycling and reusing materials for its lithium-ion batteries are key to Northvolt’s plans to meet the goal. Nehrenheim, Northvolt’s chief environmental officer, said the company is able to recycle around 95% of a lithium-ion battery’s materials, which can then be used again in its production process, creating a circular supply chain. By 2030, the company wants all its new battery cells to be produced with 50% recycled material. Sodium, which is easier and more cost-effective to recycle than lithium, could help the company reach future recycling goals. “We live on a planet with a finite number of natural resources. To accommodate future demand and sustain ethical supply chains, we need to recycle more,” said Nehrenheim. “We can already recycle 95% of battery materials. We’ll soon reach 100% and then we can use a battery for infinity.” “We will continue our work with Sodium ion batteries at Northvolt Labs. We are still in early development of that specific technology so no large-scale production is going on, it’s mainly on lab scale work.” Update: In September 2024, Northvoltannouncedit would cut 1,600 jobs across its operations in Sweden amid a slowdown of the EV market. The company said it would focus on scaling battery production at its gigafactory in northern Sweden. The expansion of the Västerås site will be slowed down, Northvolt said, but battery innovation will be maintained. A spokesperson told Climate Home: “We will continue our work with sodium-ion batteries at Northvolt Labs.” Main image: A Northvolt employee at the company’s battery research labs outside Västerås, Sweden Join the community of more than 21,000 other climate-conscious professionals and experts I agree to receive your newsletters and accept the data privacy statement. **Stories from the same category** Jan 21, 2025Clean Energy FrontierIndian start-ups mine e-waste for battery minerals but growing industry has a dark sideRecycling e-waste can unlock a vast and sustainable supply of transition minerals but in India the sector relies on a neglected informal economyRead more **Indian start-ups mine e-waste for battery minerals but growing industry has a dark side** **Indian start-ups mine e-waste for battery minerals but growing industry has a dark side** Dec 17, 2024Clean Energy Frontier‘The state doesn’t want to know’: Doctors raise alarm on children’s health crisis in Chile’s copper heartlandAutism and cancer cases are soaring in Chile linked to pollution from copper mining critical for the energy transition, doctors sayRead more **‘The state doesn’t want to know’: Doctors raise alarm on children’s health crisis in Chile’s copper heartland** **‘The state doesn’t want to know’: Doctors raise alarm on children’s health crisis in Chile’s copper heartland** Jun 17, 2024Clean Energy FrontierLithium tug of war: the US-China rivalry for Argentina’s white goldAs global competition hots up to secure lithium supplies for batteries, China is boosting its investments in Argentina while the US courts President Javier MileiRead more **Lithium tug of war: the US-China rivalry for Argentina’s white gold** **Lithium tug of war: the US-China rivalry for Argentina’s white gold** May 28, 2024Clean Energy FrontierThe Canadian city betting on recycling rare earths for the energy transitionAs countries scramble to secure critical minerals, Kingston’s burgeoning clean tech ecosystem is attracting startups to create circular supply chains and reduce reliance on ChinaRead more **The Canadian city betting on recycling rare earths for the energy transition** **The Canadian city betting on recycling rare earths for the energy transition** Feb 9, 2024Clean Energy FrontierIndonesia turns traditional Indigenous land into nickel industrial zoneIndonesia supplies the EV industry with critical battery materials but the sector’s rapid expansion is infringing the rights of Indigenous peoplesRead more **Indonesia turns traditional Indigenous land into nickel industrial zone** **Indonesia turns traditional Indigenous land into nickel industrial zone** Feb 2, 2024Clean Energy FrontierIndia wants its own solar industry but has to break reliance on China firstThe Indian government wants to supply solar PV to its domestic market and the world. But reliance on components from its geopolitical rival makes it a challenging taskRead more **India wants its own solar industry but has to break reliance on China first** **India wants its own solar industry but has to break reliance on China first** **Other stories** **Over half of countries push for plastic production cuts in new UN pact** **‘Hectic’ in high heels? Women still face gender hurdles at UN climate talks** **Pará’s Amazon forest carbon deal in doubt as prosecutors move to block it** **A credible UN carbon market needs rules that count – we’ve just set them** **Nigeria’s deadly flood exposes urgent need for climate adaptation plan** **Treaty to protect seas short on support ahead of UN ocean summit** **Brazil’s new funding initiative can help bring rainforests back from the brink – if done right** **As EU acts to stop greenwash, funds drop climate claims from their names** **Early warnings for heatwaves can save lives – and we need them now** **Green groups push back on fossil gas funding as AfDB welcomes new head** News Clean Energy Frontier Investigations Sponsored Explainers Advertising, partners and sponsorship About Contact us Privacy policy ▾Terms and conditions Terms and conditions Terms and conditions"}