{"id": 2182, "name": "Who.What.Why", "domain": "whowhatwhy.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://whowhatwhy.org/politics/us-politics/millions-stand-to-lose-medicaid-coverage-if-trumps-big-beautiful-bill-passes/", "title": "Millions Stand To Lose Medicaid Coverage If Trumps Big Beautiful Bill Passes", "content": "A Nonprofit,Reader-SupportedNews Organization Politics Elections International Justice Economy Science Culture Recent Subscribe Recent Stories PoliticsElectionsUS PoliticsUS PoliticsGuns in the USAGovernment IntegrityImmigration Elections US PoliticsUS Politics Guns in the USA Government Integrity Immigration Elections US PoliticsUS Politics Guns in the USA Government Integrity Immigration International JusticeCriminal JusticeRights & Liberties Criminal Justice Rights & Liberties Criminal Justice Rights & Liberties Hidden Power EconomyBusinessLabor Business Labor Business Labor ScienceEnvironmentHealth & MedicineTechnology Environment Health & Medicine Technology Environment Health & Medicine Technology CultureArtEducationOne Small ThingJournalism & Media Art Education One Small Thing Journalism & Media Art Education One Small Thing Journalism & Media Opinion Cartoon Podcast Video About Us Mentor Apprentice ProgramApprentice Stories Apprentice Stories Apprentice Stories Volunteer Donate Contact Newsletters Submissions **Science** **Millions Stand to Lose Medicaid Coverage If Trump’s ‘Big, Beautiful Bill’ Passes** **** Medicaid cuts are one of the main ways in which Republicans want to pay for President Donald Trump's agenda. However, the nonpartisan Congressional Budget Office estimates that this would cost millions of Americans their health care coverage. Tax cuts for the richdon’t pay for themselves, no matter how much conservative economists tout the benefits of a “trickle-down economy.” The GOP’s most recent corporate and billionaire giveaway, the “Tax Cuts and Jobs Act” that Donald Trump signed into law in 2017, is a great example of this: Future generations will pay for the privilege of making incredibly rich people even more wealthy. Now, as congressional Republicans are trying to extend those tax cuts, they have to find some ways to offset the trillions of dollars that they, and the rest of Trump’s agenda, will cost. Naturally, they want the poorest Americans to shoulder that burden and pay for the “Big, Beautiful Bill.” And that means slashing Medicaid. AsWhoWhatWhypreviously reported, the kind of “savings” GOP lawmakers hope to achievecannot be realizedwithout cutting the popular health care program that was expanded under President Barack Obama. While Republicans are claiming that the money they hope to save will come from cutting waste, fraud, and abuse, the nonpartisan Congressional Budget Office (CBO) estimated this week that, under various cost-cutting proposals the GOP is considering,millions of Americans would lose their health insurance coverage. It should be noted that Republicans have not yet settled on how, specifically, they want to cut Medicaid. However, CBO analyzed five different options that are on the table. For example, if Congress were to reduce the share that the federal government pays into Medicaid, which is operated and funded together with the states, then 5.5 million people would lose coverage. While House Speaker Mike Johnson (R-LA) said earlier this week that this option is off the table, fiscal conservatives have said the reduction is necessary to return the program to serving only the most vulnerable Americans. Other potential options that CBO analyzed include the repeal of a rule from the Biden administration that lowered the barrier to Medicaid enrollment, which would result in 2.3 million people losing their coverage, and limiting the taxes that states can impose on providers, such as hospitals and doctors, to pay for their share of Medicaid costs, which would lead to more than 8 million Americans being kicked out of the program. Knowing that they are a political winner for them, Democrats quickly seized on the findings. “It’s time for Republicans to stop lying about taking health care away from Americans so they can give tax breaks to billionaires and big corporations,” stated Rep. Frank Pallone Jr. (NJ), the leading Democrat on the Energy and Commerce Committee, which oversees Medicaid. Pallone and Sen. Ron Wyden (OR), the top Democrat on the Senate Finance Committee, had asked CBO to conduct the analysis. “Medicaid cuts will result in the federal government paying more and a sicker society overall,” Pallone added. “Republicans don’t care as long it means a windfall for billionaires like Elon Musk.” Klaus MarreKlaus Marre is a senior editor for Politics and director of the Mentor Apprentice Program at WhoWhatWhy. Follow him on Bluesky @unravelingpolitics.bsky.social.View all posts Klaus Marre is a senior editor for Politics and director of the Mentor Apprentice Program at WhoWhatWhy. Follow him on Bluesky @unravelingpolitics.bsky.social. Klaus Marre is a senior editor for Politics and director of the Mentor Apprentice Program at WhoWhatWhy. Follow him on Bluesky @unravelingpolitics.bsky.social. **Related Posts:** Trump Finds New Conspiracy Theory to Embrace in… Trumpocracy: Robbin’ the Hood Trump Shares Craziest Conspiracy Theory Yet Reprint Policy Privacy Policy DMCA Policy About Us Contact Volunteer **Glad you found us on Flipboard. Let’s keep in touch.** **Subscribe to our newsletter for weekly updates onour investigative journalism and enlightening editorials.** **Glad you found us on Google News. Let’s keep in touch.** **Subscribe to our newsletter for weekly updates onour investigative journalism and enlightening editorials.**"}