{"id": 960, "name": "NBCNewYork.com", "domain": "nbcnewyork.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.nbcnewyork.com/news/business/money-report/rfk-jr-s-firing-of-cdc-vaccine-advisors-circumvents-science-and-could-threaten-public-health-experts-say/6296807/", "title": "Rfk Jr S Firing Of Cdc Vaccine Advisors Circumvents Science And Could Threaten Public Health Experts Say", "content": "**Money Report** **Money Report** **RFK Jr.'s firing of CDC vaccine panel undermines science, could threaten public health, experts say** **It is still unclear who will replace the current panel, but experts warn that Kennedy could try to appoint members who are sympathetic to his anti-vaccine views.** Health and Human Services Secretary Robert F. Kennedy Jr. has gutted a key government panel of vaccine advisors, a stunning move that some public health experts say undermines science, disrupts a trusted regulatory process, and could sow public distrust in vaccinations and federal health agencies. It is still unclear who will replace the current panel, but experts warn that Kennedy could try to appoint members who are sympathetic to his anti-vaccine views. Some experts say the firings could ultimately threaten public health, eroding already falling U.S. immunization rates against once-common childhood diseases and making the nation less equipped to grapple with new or existing outbreaks of vaccine-preventable diseases. Health and Human Services Secretary Robert F. Kennedy Jr. hasgutted a key government panelof vaccine advisors, saying he wants to \"re-establish public confidence\" in shots. Some health policyexperts say firing the committee members will do the opposite. Watch NBC 4 free wherever you are \"Rather than restoring public trust, his actions are simply politicizing science and vaccine policy,\" Lawrence Gostin, professor of public health law at Georgetown University, told CNBC. \"I don't know how it is possible to trust HHS anymore.\" Gostin and other experts said the move undermines science, disrupts a trusted regulatory process for shots, and could increase public distrust in both vaccinations and federal health agencies. Some experts said the firings could threaten public health, erodingalready falling U.S. immunization ratesagainst once-common childhood diseases and making the nation less equipped to grapple with new or existing outbreaks of vaccine-preventable diseases. Get Tri-state area news delivered to your inbox with NBC New York's News Headlines newsletter. The potential impact on vaccine manufacturers likeModerna,Merck,PfizerandBioNTechis less clear, but some analysts say it introduces more uncertainty to the regulatory process around shots. **** **RFK Jr. removes all members of CDC panel advising U.S. on vaccines** **How RFK Jr. is quickly changing U.S. health agencies** **Fact check: RFK Jr. denies cuts to scientific research while slashing staff, funding** Kennedy, a prominent vaccine skeptic, said Monday he is firing all 17 members of the Advisory Committee on Immunization Practices, or ACIP, which advises the Centers for Disease Control and Prevention. The group of independent medical and public health experts reviews vaccine data and makes crucial recommendations that determine who is eligible for shots and whether insurers should cover them, among other efforts. It is the latest in a series of steps Kennedy has taken as head of HHS to dismantle decades of U.S. vaccination policy standards and chip away at the public's confidence in immunizations. Among his most recent efforts, he dropped the CDC's recommendation for routine Covid-19 vaccines for healthy children and healthy pregnant women, which also sparked outrage in the medical and science community. While it is unclear who will replace the current panel, some experts warn that Kennedy could try to appoint members who are sympathetic to his anti-vaccine views. That could lead to politicized recommendations that highlight the harms rather than the benefits of shots or make them widely voluntary, deterring more Americans from receiving shots or vaccinating their children, according to some experts. \"It's really important that we recognize that these actions impact everyone,\" Dr. Neil Maniar, a public health professor at Northeastern University, told CNBC. \"This is not just a committee that was retired. It is a committee whose work has broad implications.\" HHS did not immediately respond to a request for comment on who will be appointed to the panel, and the concerns from health policy experts. **Kennedy's 'unfounded' claims and what's next** HHS on Monday did not provide a timeline for when it will appoint new members. But the agency in a release said ACIP will still hold a planned meeting from June 25 to 27. A source familiar with the matter, who requested anonymity to speak freely, told CNBC on Monday that entirely new members will run that meeting. In an op-ed in The Wall Street Journal on Monday, Kennedy claimed that the current ACIP panel has been \"plagued with persistent conflicts of interest and has become little more than a rubber stamp for any vaccine.\" But those allegations are \"completely unfounded\" and will have a \"significant negative impact on Americans of all ages,\" Tina Tan, president of the Infectious Diseases Society of America, said in an emailed statement. She said ACIP is a highly qualified group of experts that has \"always operated with transparency and a commitment to protecting the public's health.\" All HHS agencies and their advisory panels have also long had rigorous policies for conflicts of interest, and there have been no related issues for years. Members of federal vaccine advisory committees are already required to comply with regulations around disclosing potential conflicts of interest. \"The secretary is using conflicts of interest as a ruse to ignore or cherry pick scientific evidence,\" Gostin said. \"ACIP members fully disclose all potential conflicts and excuse themselves from voting if there are any perceived conflicts.\" In a statement Tuesday, the American Academy of Physician Associates said it is \"imperative that the administration acts promptly to reconstruct the committee through an open and transparent process that includes diverse provider voices,\" including physician associates. But Northeastern's Maniar said he wouldn't be surprised if Kennedy taps political appointees who share his views around vaccine science. That could lead to recommendations that restrict who is eligible for different vaccinations or give much more leeway for individuals to decide whether to get immunized, Maniar said. He added that Kennedy's restacked panel may want to take a longer period of time to vet certain vaccines before they become available, delaying the time it takes for them to reach patients. \"It is certainly within the realm of possibility that we will see lower vaccination rates as a result of this,\" Maniar said. That could increase the risk of vaccine-preventable diseases spreading as the U.S. is already grappling with an unprecedented measles outbreak and is heading into a summer season of more travel and crowding, according to Maniar. The new panel's recommendations will also be crucial for children as the nation approaches a new school year in the fall. Kennedy's decision contradicts a promise he made to Sen. Bill Cassidy, a Louisiana Republican and chairman of the Senate Health, Education, Labor and Pensions Committee, during his confirmation hearings. Kennedy told Cassidy, who cast the deciding vote to advance his nomination through the committee at that time, that he would not alter ACIP. On Monday, Cassidy said in a post on X that the fear is now that \"ACIP will be filled up with people who know nothing about vaccines except suspicion.\" But he said he will continue to talk with Kennedy to \"ensure this is not the case.\" **Impact on vaccine manufacturers** Some Wall Street analysts also said the move is a risk to vaccine manufacturers, which depend on federal agencies like the Food and Drug Administration and the CDC to approve and recommend their products. \"At worst, the committee could upend current recommendations for [new] and existing vaccines,\" Leerink Partners analyst Daina Graybosch said in a note Monday. But she noted that the firm can't fully quantify the impact of the move before seeing who will replace the current panel. In a note Monday, BMO Capital Markets analyst Evan Seigerman said Kennedy's decision is \"a negative headwind\" to vaccine manufacturers, as new appointees are likely to be more critical of future recommendations. But he said he expects \"most impacts to be broadly muted.\" Seigerman pointed to Kennedy's picks to lead the FDA and its division that regulates biological products, the Center for Biologics Evaluation and Research, noting the ultimate selection for each seat did not reflect a \"doomsday\" scenario. FDA Commissioner Marty Makary and CBER head Vinay Prasad have so far been \"less negative for the sector than initially feared,\" he said. \"While RFK Jr.'s commentary surrounding vaccines has been consistently critical, we believe this has been well established with realistic headwinds largely priced in by the market,\" Seigerman said. As the TACO trade goes viral, another is gaining traction: 'Anywhere But The USA' Oil giant BP seeks buyers for one of its crown jewels as it looks to stave off a takeover Best Stocks: This momentum play seeing huge investor accumulation is on the verge of another breakout Why the stock market continues to hold up in the face of uncertain trade policy **Also on CNBC** RFK Jr. removes all members of CDC panel advising U.S. on vaccines FDA approves Merck’s RSV shot for infants, ramping up competition Omada shares rise 21% in Nasdaq debut after health tech company's IPO **Trending Stories** New York CityBody of child believed to be missing NYC 2-year-old found by Whitestone Bridge: Source ImmigrationDozens detained at NYC ICE protest as more demonstrations are planned nationwide MilitaryNavy sailor who vanished is found dead, another sailor held in her death Crime and CourtsNYC teens charged with attempted gang assault in girl's subway station beatdown Crime and CourtsDaughter of Gilgo Beach suspect believes her dad is the killer. His wife isn't sold **Weather Forecast** Facebook Instagram TikTok Submit Tri-State News Tips Contact WNBC Connect With NBC Network TV Listings Archives / Licensing Newsletters Community Our News Standards Xfinity: Internet, TV, streaming, more WNBC Public Inspection File WNBC Accessibility WNBC Employment Information Terms of Service FCC Applications Privacy Policy Your Privacy Choices Send Feedback to WNBC CA Notice Ad Choices Advertise with us Facebook Instagram TikTok"}