{"id": 423, "name": "Evonomics", "domain": "evonomics.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://evonomics.com/how-to-unite-nations-to-deal-with-climate-change-introducing-new-multilateralism/", "title": "How To Unite Nations To Deal With Climate Change Introducing New Multilateralism", "content": "**** **How to Unite Nations to Deal with Climate Change: Introducing New Multilateralism** **The answer to this question is surprisingly simple. Climate change is not a problem that can be solved through a top-down policy architecture.** ByDennis J. SnowerNovember, 14 2022 COP27, as the name suggests, is the 27thtime the Conference of Parties has met to negotiate climate action. Since the first COP took place in Berlin in 1995, the emissions of CO2 and other greenhouse gases have risen remorselessly. Some progress has been made, but it has been insufficient. Thus UN Secretary General Guterres could tell the delegates of COP27, “We are on a highway to climate hell with our foot still on the accelerator.” How has the community of nations come to be trapped in a cycle of negotiations, inadequate promises, followed by inadequate compliance with the promises made? Einstein is reputed to have said, “Insanity is doing the same thing over and over and expecting different results.” How did we get stuck in such insanity? Many answers have been proposed, but one in particular stands out, in terms of giant policy implications despite the minuscule policy attention. By and large, policy makers usually address the challenge of climate change as a problem to be solved either by governments or by economic markets. According to the government approach, the problem can be solved by government regulation: figure out what regulations are required to give us a 50-50 chance of restricting global warming to under 1.5 degrees Celsius compared with pre-industrial levels and then implement the regulations. According to the market approach, the problem can be solved by economic markets, provided that the emitters pay for the harm that they do, for example through the imposition of carbon taxes or trading of emission rights. Both approaches assume that people behave like Homo Economicus – instrumentally rational, far-sighted, self-interested, individualistic utility maximizers. Such beings can be expected to respond appropriately and predictably to government regulations and carbon pricing. When emitters pay the right price for their emissions, their private costs – to which they as rational individual respond – are equated to the social costs, and consequently they emit no more than is socially desirable This is the frame of reference for what we may call “Multilateralism 1.0.” In practice, however, people are not like Homo Economicus. They are social creatures capable of altruism under some circumstances and selfishness under others. They are often not instrumentally rational or far-sighted. In short, they are human beings. What Multilateralism 1.0 overlooks is that climate policy needs to be implemented by these human beings. They are the ones that vote for the politicians that are meant to design climate policy and that engage in economic transactions. These economic transactions are grounded in their social relationships, which may be cooperative or antagonistic, trusting or mistrusting. By focusing attention exclusively on the selfish reponses of Homo Economicus to the government or the market, Multilateralism 1.0 overlooks the role of communities in society. In this setting, people may pursue individual or collective interests. Their collective interests are spread across diverse groups. These groups may themselves pursue their individual and collective interests in the context of other groups. **Climate Policy for Human Beings** The world’s climate system constitutes a global commons. We know what people in diverse settings do when they successfully manage their commons. The Nobel Laureate Elinor Ostrom has described their actions in terms of eight Core Design Principles:[1]shared identity and purpose, equitable distribution of costs and benefits, fair and inclusive decision making, monitoring of agreed-on actions, graduated rewards for compliance and graduated sanctions for violations, fast and fair conflict resolution mechanisms, the authority to self-govern, and polycentric governance (multiple layers of governing bodies acting in harmony). These are the principles that human beings – rather than Homo Economicus – generally follow when they preserve their common pool resources. What we may call “Multilateralism 2.0” rests on these principles, which take the social foundations of human behavior seriously. The implications for climate policy are far-reaching. Here are some important ones: Shared identities – local, regional, national and supra-national – are essential for the social acceptance of climate action. Thus, nationalism and other “ism’s” need to be mobilized to motivate the implementation of climate policies that serve a common goal, as articulated by the Paris Climate Agreement. For this to work, people need to exercise their agency in contributing – directly through citizens’ groups and indirectly through their representatives – to the rules whereby they are to be governed. This means that a “one-size-fits-all” climate policy is inappropriate; rather, diverse policies are required that drive towards the common goal. Having contributed to the rule-making, people are to be accountable for their actions, through monitoring, graduated rewards and sanctions, conflict resolutions mechanisms, and nested tiers of governance. Fortunately, the seeds of such this new approach to climate policy have become visible through Chancellor Olaf Scholz’s “Climate Club,” aimed primarily at the international coordination of climate mitigation policies. Though this initiative is sadly misnamed – since “club” sounds like an exclusive association of privileged members, but climate change is a global problem concerning the entire world community of nations – the Climate Club aims for a shared commitment to the Paris climate goals, open to different country pathways in achieving these goals, inclusive of developed, emerging and developing countries, and supportive of existing international law. It is easy to get lost in the maze of institutions that form part of the international climate architecture within which the Climate Club is meant to work.[2]How should a so-called “Climate Club” navigate this jungle? The answer to this question is surprisingly simple. Climate change is not a problem that can be solved through a top-down policy architecture. What is required are straightforward guiding principles on which widespread agreement can be expected and then to allow the bottom-up initiatives of the public and private sectors to self-organize around these principles. Consider an analogy: Global value chains (GVCs) are fiendishly complex, usually spanning many sectors and countries in the production of most goods and even services. No one organizes these GVCs as a top-down central planning exercise; instead businesses organize themselves into these chains, guided by the principles of profit maximization alongside legal and ethical considerations. These principles are sufficient for worldwide coordination. The coordination emerges at many levels, from local plants to multinational firms. Climate action now requires guiding principles that spur spontaneous, climate-friendly self-organization. This self-organizing reconfiguration of the climate policy architecture needs to emerge at many levels, spanning the public and private sectors. This reconfiguration will take place at the micro level (e.g., decisions by individual households and firms), the meso level (e.g., decisions by sectoral organizations, NGOs, business and labor associations) and the macro level (international organizations). Under the appropriate principles, businesses can compete for profits without damaging the natural world; politicians can pursue their national policies while stabilizing the climate and biodiversity; international organizations and NGOs can do their work in ways compatible with the Paris Climate Agreement. Accordingly, if the Climate Club is to be useful and effective, it must work in two ways: first, it must articulate the appropriate guiding principles to induce international cooperation on climate action; and second, it should provide guidance on how the principles can be implemented, giving public- and private-sector decision-makers an idea of how the climate policy architecture may change in response to the principles. Thus far, this second level – indicating what to expect concerning to the reconfiguration of the climate policy architecture – has received most of the attention in policy circles.[3] This article, however, focuses on the Climate Club’s guiding principles for such a policy reconfiguration. In so doing, we gain insights into a new approach to multilateralism. In order to understand the purpose of the guiding principles, to respond to the above-mentioned misgivings about the Climate Club and apply the guiding principles to global problems beyond climate change, it is useful to begin by confronting the deficiencies of the current multilateral approaches. **Deficiencies of Current Multilateral Approaches** The last few decades have seen rising disillusionment with multilateralism, as multilateral agreements on climate, trade, financial stability, and the sustainable development goals have had a poor record in inducing countries to cooperate in managing the global commons and in providing global public goods. The principle of state sovereignty has come into repeated conflict with the need to address global challenges in the global public interest. The major deficiencies of the current multilateral systems are easy to identify. First, where states are invited to make voluntary contributions to a global goal – such as the Nationally Determined Contributions under the Paris Climate Agreement – the sum of the contributions usually fall short of the global target. Second, as states differ in terms of their willingness to comply with their promised contributions, the multilateral agreements lead exhibit a propensity towards leveling-down. The most ambitious contributors are left with little incentive to pursue their ambitions, since the global value of their efforts depends on the contributions of their less ambitious counterparts. Third, multilateral agreements often require consensus on specific policies, such as emissions trading rules or carbon taxes to combat climate change. Such consensus is however often fiendishly difficult to achieve, since different states face different social, political and economic conditions. Thus, one-size-fits all policy proposals usually fail. For example, Prime Minister Emanuel Macron’s attempt to impose carbon taxes in France led to thegillets jaunesprotests that prevented this policy from being implemented. Fourth, states pursuing global goals often put themselves at a competitive disadvantage vis-à-vis non-compliant states. For example, carbon taxes and emission trading systems give rise to “carbon leakage,” as companies may relocate to locations where production is relatively cheap on account of weak environmental standards. Larry Fink, the CEO of Blackrock, called carbon leakage “the biggest capital markets arbitrage of my lifetime.”[4] And fifth, heterogeneous social, political and economic conditions also make agreement on a common global goal difficult, since the negotiations on the common goal are generally not tied to negotiations in other domains that could facilitate the former negotiations. Prime Minister Narendra Modi refused to commit India to carbon neutrality by 2050 at the COP26 Climate Summit, since – in the absence of agreements concerning green technology transfers – such a commitment could have been a death sentence for hundreds of millions of Indians who rely on fossil fuels to cook their food. **Multilateralism 2.0** To begin with, to clear our minds from prejudicial thinking in reaction to the name “Climate Club,” let us call the initiative the “Climate Alliance,” perhaps as an intermediate step towards a better appellation to be chosen in the future. The guiding principles underlying the Climate Club address each of these deficiencies. These principles provide a blue-print for multilateral action beyond climate change, thereby articulating a vision for the future of multilateralism. They are summarized in Figure 1 and may be summarized as follows. Figure 1: Principles for Multilateralism 2.0 Common, ambitious goal: The common global goal of the Climate Alliance is specified by the Alliance’s most ambitious members, who set the goal in accord with the Paris Climate Agreement. This goal is not to be diluted in subsequent negotiations, avoiding the leveling-down problem. Flexibility in policy pathways to achieve the goal: The focus of policy is on the goal, not the instruments to achieve this goal. The Climate Alliance gives different countries the latitude to pursue different policy pathways towards a common goal, since performance is to be measured exclusively in terms of the milestones towards achievement of the well-defined climate objective. Some countries may wish to achieve this objective through carbon taxes, others through an emissions trading system, yet others through regulations or enforceable social norms. This guiding principle should ensure that the rules governing climate action are suited to the diverse social, political and economic conditions that different countries face. It also ensures that those affected by the rules participate in their formulation. Monitoring and accountability: Despite the different pathways, all members of the Climate Alliance must make predictable, measurable progress towards the specified common goal. Since the ultimate objective is to achieve the aims of the Paris Climate Accord, progress towards this objective becomes the center of attention for reporting and monitoring – not progress with respect to particular policy measures that serve as the means to achieve the objective (such as carbon taxes, emission trading or regulations that phase out fossil fuels). The measures of progress towards the common goal must be comparable, including “a uniform measurement of CO2content of products and materials.”[5] Support for emerging and developing countries: Since the Climate Alliance seeks to provide support to non-members in the achievement of its common objective, it is maximally inclusive, permitting rich and poor countries to make common cause in the attainment of an common goal. Developing and emerging countries can receive support in order enable them to achieve the same level of ambition as the developed countries belonging to the Climate Alliance. Such support could, for example, be achieved by“Just Energy Transition Partnerships.”As noted in theG7 Statement on Climate Club, the Climate Club aims “to provide the support necessary for developing countries to join the Club and share its ambitious targets by “Boosting international ambition through partnerships and cooperation to encourage and facilitate climate action and unlock socio-economic benefits of climate cooperation and to promote just energy transition. As a complement, Just Energy Transition Partnerships (JETPs) have the potential to leverage support and assistance to developing countries for decarbonising energy and industrial sectors, transparency, including through financial, technical capacity support and technology transfer development and deployment depending on their level of climate ambition.” Incentives to prevent competitive disadvantage: The monitoring and reporting must be accompanied by incentives, in the form of graduated rewards for rule-observance and sanctions for rule-violation. These rewards and sanctions take the form of differential treatment of Climate Alliance members and non-members. In particular, the Climate Alliance ensures that its members do not suffer competitive disadvantage. This means imposing a level-playing field on competition among countries – again through diverse policy pathways, such as a carbon border adjustment mechanism,[6]regulations and so on. The measured effects of these pathways on the common goal are to be comparable and thus forming a coherent regime that prevents “carbon leakage” from members of Climate Alliance members to non-member countries, so that the emission reduction of member countries is not accompanied by an increase in emissions of non-members. Thereby the Climate Alliance puts pressure on non-members to adopt more ambitious climate protection standards. Empowering international coordination: The rules above are to be embedded in a governance framework that empowers all relevant actors to contribute in the appropriate way. This framework should build responsibility for climate action in nested tiers from the micro to the macro level of decision making in a coherent interconnected system. This may involve an independent secretariat from relevant international organizations, focused on the collective agenda and led by co-chairs from an advanced and developing nation, with time-limited tenure. The organization should include accessible, low-cost means of dispute resolution. Responsibilities for outcomes should rest at the level of national administrations, with sponsorship from national leaders (rather than particular government departments and ministries). The international coordination may also involve working groups focused on well-defined issues, drawing on institutional partnerships established by the G20.[7] These principles of the Climate Alliance – in accord with Ostrom’s Core Design Principles – constitute a new approach to multilateralism. They can be applied to other international problems. **Extending the Climate Alliance to Health** To illustrate the potential generality of this new approach to multilateralism, let us consider its application to the challenge of universal health coverage. In fact, combining this approach to climate with an analogous approach to health may be far more effective than pursuing climate and health goals independently. The reason is simple. If two sets of global goals are strategically complementary – in the sense that the pursuit of one goal promotes the achievement of the other goal – then combining the two goals within this policy framework will increase the chances of achieving both sets of goals. A good example is the achievement of the global climate goals (as articulated in the Paris Climate Agreement) combined with the achievement of global pandemic-related health goals (as articulated in the International Treaty on Pandemic Prevention, Preparedness and Response). The reason why these two sets of goals are strategically complementary is that developed and developing nations generally have different objectives and capabilities regarding climate and pandemic policy. Developed countries tend to place relatively more emphasis on climate goals than developing countries do, since the former have satisfied relatively more of their economic needs and thus can better afford to prioritize climate action. Obversely, the need for pandemic protection is relatively greater in developing countries, since the latter have less access to vaccines, protective equipment and relevant medical experience. On this account, combining climate and pandemic policy enables developing countries to make special efforts on climate action (beyond their self-interest) in return for special efforts by developed countries in supporting pandemic protection in developing countries (beyond the developed countries’ self-interest). Furthermore, the effectiveness of climate policy per unit of expenditure tends to be higher in developing countries than in developed ones, since developing countries have had less opportunity to exploit green technologies. Similarly, the effectiveness of pandemic policy per unit of expenditure also tends to be higher in developing countries, since these countries have had less access to the relevant health measures. Consequently, there are significant global gains to be reaped through technology transfer from developed to developing countries, involving transfer of both physical and human capital with respect to both climate action and pandemic action. Technological know-how is a public good, since the global cost of transmitting the relevant information is negligible relative to the associated global benefits. On the microeconomic level, however, technology transfer is often costly to the businesses doing the transferring, since they may thereby promote their rivals’ competitiveness. This distributional cost may be understood in terms of the cost of a global fund to compensate businesses for their technology transfers. The creation of a global fund to promote such technology transfers regarding climate and pandemic action could generate large-scale gains, when operating in the context of the new approach to multilateralism. This new approach could encompass the Climate Alliance working alongside an analogous policy initiative with respect to pandemic-related health goals. Analogously to the Climate Alliance, the policy approach to pandemic action could have the following features: First, the common objective could be the attainment of specified vaccination and treatment rates in the national population in a developing country, on terms that are broadly comparable to the rates achieved in developed countries. Second, different countries could have the latitude to reach this objective differently. Thirdly, developing countries could receive support from developed countries in reaching this objective, such as support in building up production and distribution capacity for vaccines. And fourth, countries would negotiate mechanisms that ensure that membership of a proposed Climate-Health Alliance would create no competitive disadvantage vis-à-vis non-members. In short, the Climate Alliance as currently conceived could be extended to a Climate-Health Alliance,[8]in order to exploit the asymmetries in objectives and capabilities and thereby create a win-win outcome for developed and developing nations. Roughly speaking, developed nations cannot achieve their climate goals without the cooperation of the developing nations and developing nations cannot achieve their pandemic-related health goals without the cooperation of the developed nations. Both groups of nations need one another to achieve both sets of goals. By negotiating policy proposals that cover both sets of goals together, greater latitude for agreement can be achieved than would have been possible through international climate policy and international pandemic policy in isolation. In the resulting grand bargain, developed countries achieve their climate objectives by enabling developing countries to achieve their pandemic-related objectives. **Collaboration between Government and Business** The proposed Climate-Health Alliance would require a new collaboration between government and business. Individual businesses cannot be expected to successfully pursue the goals of the proposed Climate-Health Alliance, however well-intentioned. There are compelling examples of businesses taking a lead with respect to both climate action and pandemic protection, but this not sufficient to move overall economic activity at the required pace and scale. On this account, governments have an important role to play in shaping an appropriate operative business environment. This can be done in three broad ways. The first is to set, in collaboration with business, the responsibilities of business in accord with the goals of the Climate-Health Alliance. These responsibilities must be reflected in the legal responsibilities of companies as well as their specified corporate purposes. The second way of shaping the operative business environment is through targets and requirements in line with the goals of the Climate-Health Alliance. Once these targets are appropriately defined for businesses and then embedded in the operating requirements for business generally, then business can take environmental and health costs into account and to compete on a level playing field as they do so. With such targets in place, business can be given the latitude to exploit all profitable opportunities consistent with its purpose-driven objectives. Thirdly, the government can influence business activities through through its procurement contracts, which can require companies to meet certain conditions in relation to environment (e.g., net zero), health (e.g. contributions to the health infrastructures in developing countries), diversity (e.g., in terms of race and/or gender), and inclusion (e.g., “living wages” paid throughout the supply chain). Within these new operational boundaries, businesses can then compete to make a profit, again on a level playing field. The same logic can apply to the formulation of other policy measures, such as regulatory licenses to operate, regulatory approvals, conditions for grants, or tax incentives. **Concluding Thought** The past three decades have witnessed a proliferation of global problems, which no state can tackle on its own. The poor record of our multilateral systems in managing global collective goods has been aggravated by deficiencies in the underlying negotiation processes. These deficiencies include a missing recourse against non-compliance, a tendency toward level-down of global policy ambitions, disagreements over policy instruments rather than policy goals, vulnerability to competitive disadvantage by adherents to global goals, and disregard for strategic complementarities among policy goals. The Climate Alliance offers a new approach to multilateralism that addresses all these deficiencies. It thereby offers new hope for the achievement of multilateral agreements that are ambitious, inclusive and comprehensive. References Bhattacharya A, Kyriakopoulou D, Stern N (2022),The G20’s Crucial Role in Mobilising Climate Finance, Observer Research Foundation.https://www.orfonline.org/expert-speak/g20s-crucial-role-in-mobilising-climate-finance/ BMF (2021). Steps towards an alliance for climate, competitiveness and industry – building blocks of a cooperative and open climate club. BMF, AA, BMWi, BMU and BMZ.https://www.bundesfinanzministerium.de/Content/EN/Downloads/Climate-Action/key-issues-paper-international-climate-club.pdf?__blob=publicationFile&v=4 G7 Statement on Climate Club (2022),https://www.g7germany.de/resource/blob/974430/2057926/2a7cd9f10213a481924492942dd660a1/2022-06-28-g7-climate-club-data.pdf Lima de Miranda, K., & Snower, D. J. (2020). Recoupling Economic and Social Prosperity.Global Perspectives,1(1), 11867. OECD (2019a), “Better Life Index.” https://www.oecdbe tterlifeindex.org. OECD (2019b), “Better Life Index: Definitions and Metadata.”https://www.oecd.org/statistics/OECD-Bet ter-Life-Index-definitions-2019.pdf. Ostrom, E. (1990).Governing the commons: The Evolution of institutions for collective Action. Cambridge University Press. Ostrom, E. (2010a). Beyond Markets and States: Polycentric Governance of Complex Economic Systems.American Economic Review,100, 1–33. Stern, N., and H.P. Lankes (2022),Collaborating and Delivering on Climate Action through a Climate Club: An independent report to the G7, October, LSE Consulting,https://www.lse.ac.uk/granthaminstitute/wp-content/uploads/2022/10/Collaborating-and-delivering-on-climate-action-through-a-Climate-Club.pdf [1]Ostrom, Elinor (1990).Governing the Commons: The Evolution of Institutions for Collective Action. Cambridge, UK: Cambridge University Press. [2]These include climate governance initiatives (UNFCCC, NDC Partnership, UNEP, Green Climate Fund, etc.), climate-active international organizations (OECD, IEA, WTO, IMF, UNIDO, MDBs, NDB, AIIB, etc.), private sector initiatives (GFANZ, GISD, SMI, CFLI, WBCSD, MPP, FMC, PRI, PRB, CDP, etc.), as well as domain-specific initiatives (Coalition of Finance Ministers for Climate Action, Central Banks and Supervisors Network for Greening of the Financial System, Clean Energy Ministerial, Industrial Deep Decarbonization Initiative, etc.). [3]It includes the institutional underpinnings of the Climate Club, mechanisms for financial and technological partnerships, measures to manage carbon leakage, dispute resolution mechanisms, alignment on the decarbonization of emissions-intensive heavy industries, product standards, government procurement policy, state support, trade law implications, and more. (Stern and Lankes (2022) offer an excellent overview of these issues. See also Bhattacharya, Kyriakopoulou and Stern (2022) for the role of the G20 and BMF (2021) on the German government’s elaboration of the Climate Club. [4]https://www.ft.com/content/f8e4af63-e793-4ce1-89c8-44af2b74ca55 [5]https://www.bundesfinanzministerium.de/Content/EN/Pressemitteilungen/2021/20210825-german-government-wants-to-establish-an-international-climate-club.html [6]https://www.consilium.europa.eu/en/press/press-releases/2022/03/15/carbon-border-adjustment-mechanism-cbam-council-agrees-its-negotiating-mandate/ [7]See Stern and Lankes (2022) for a suggested structure. [8]I am deeply indebted to Colin Mayer for his insights on a Climate-Health Alliance. **Donating = Changing Economics. And Changing the World.** Evonomics is free, it’s a labor of love, and it's an expense. We spend hundreds of hours and lots of dollars each month creating, curating, and promoting content that drives the next evolution of economics. If you're like us — if you think there’s a key leverage point here for making the world a better place — please consider donating. We’ll use your donation to deliver even more game-changing content, and to spread the word about that content to influential thinkers far and wide. MONTHLY DONATION$3 / month$7 / month$10 / month$25 / month **How a Ruthless Network of Super-Rich Ideologues Killed Choice and Destroyed People’s Faith in Politi...** **How a Ruthless Network of Super-Rich Ideologues Killed Choice and Destroyed People’s Faith in Politi...** **Why Society’s Biggest Freeloaders are at the Top** **Why Society’s Biggest Freeloaders are at the Top** **The Trump Presidency: An Embarrassment for Those Who Believe in the Market** **The Trump Presidency: An Embarrassment for Those Who Believe in the Market** **Economist Dierdre McCloskey Promotes False Math About Inequality and Redistribution** **Economist Dierdre McCloskey Promotes False Math About Inequality and Redistribution** **BE INVOLVED** We welcome you to take part in the next evolution of economics. Sign up now to be kept in the loop! **Post navigation** **Dennis Snower** **Donating = Changing Economics. And changing the world.** Evonomicsis a labor of love, it’s free, and it’s ad-free. We spend hundreds of hours and thousands of dollars spreading the word about The Next Evolution of Economics.If you think that’s a worthy mission, as we do—one with powerful leverage to make the world a better place—please consider offering your support.Change the World Search Contributors About Newsletter Donate **The future of economics is here!Be a part of the conversation by getting the latest in your inbox.**"}