{"id": 1580, "name": "WHIO - Dayton News", "domain": "whio.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.whio.com/news/local/7-circle-kindness-community-recycling-drive-returns-june-28/YO7JWAW4XRCE5B6LB43OEYMB4U/", "title": "7 Circle Kindness Community Recycling Drive Returns June 28", "content": "NewsLocalCrime And LawState And RegionalElection 2025WHIO YouTube(Opens in new window)Dayton Gets Real(Opens in new window)Nation And WorldIsrael At WarMaking a DifferenceBeat The Stigma(Opens in new window)Web LinksLottery ResultsEntertainmentWHIO-TV Closed Captioning Local Crime And Law State And Regional Election 2025 WHIO YouTube(Opens in new window) Dayton Gets Real(Opens in new window) Nation And World Israel At War Making a Difference Beat The Stigma(Opens in new window) Web Links Lottery Results Entertainment WHIO-TV Closed Captioning Local Crime And Law State And Regional Election 2025 WHIO YouTube(Opens in new window) Dayton Gets Real(Opens in new window) Nation And World Israel At War Making a Difference Beat The Stigma(Opens in new window) Web Links Lottery Results Entertainment WHIO-TV Closed Captioning Storm Center 77 DayInteractive RadarHour by Hour ForecastClosingsClosings & Delays Participation Info#Skywitness7WHIO Weather 24/7 Stream 7 Day Interactive Radar Hour by Hour Forecast Closings Closings & Delays Participation Info #Skywitness7 WHIO Weather 24/7 Stream 7 Day Interactive Radar Hour by Hour Forecast Closings Closings & Delays Participation Info #Skywitness7 WHIO Weather 24/7 Stream TrafficLive Traffic ConditionsGas Prices: Pump Patrol(Opens in new window) Live Traffic Conditions Gas Prices: Pump Patrol(Opens in new window) Live Traffic Conditions Gas Prices: Pump Patrol(Opens in new window) VideoWHIO NowWHIO 24/7 NewsThe $pend $mart StreamCheddarLaw & CrimeCuriosity NOWGusto TV WHIO Now WHIO 24/7 News The $pend $mart Stream Cheddar Law & Crime Curiosity NOW Gusto TV WHIO Now WHIO 24/7 News The $pend $mart Stream Cheddar Law & Crime Curiosity NOW Gusto TV I-Team 2025 Summer Guide(Opens in new window) SportsTouchdown 7Cincinnati BengalsCleveland BrownsDayton FlyersOhio State Buckeyes Touchdown 7 Cincinnati Bengals Cleveland Browns Dayton Flyers Ohio State Buckeyes Touchdown 7 Cincinnati Bengals Cleveland Browns Dayton Flyers Ohio State Buckeyes WHIO-TV 75 Years(Opens in new window) WHIO-TV7 Circle of KindnessAbout WHIO-TVContests(Opens in new window)What's on WHIO-TVCBS Programming(Opens in new window)ME TVAbout Laff TV(Opens in new window)TV StaffOn DemandMore Ways to WatchWatch LivePodcastsFAQ: WHIO TV & RadioFCC ApplicationsVisitor AgreementPrivacy PolicyPets(Opens in new window) 7 Circle of Kindness About WHIO-TV Contests(Opens in new window) What's on WHIO-TV CBS Programming(Opens in new window) ME TV About Laff TV(Opens in new window) TV Staff On Demand More Ways to Watch Watch Live Podcasts FAQ: WHIO TV & Radio FCC Applications Visitor Agreement Privacy Policy Pets(Opens in new window) 7 Circle of Kindness About WHIO-TV Contests(Opens in new window) What's on WHIO-TV CBS Programming(Opens in new window) ME TV About Laff TV(Opens in new window) TV Staff On Demand More Ways to Watch Watch Live Podcasts FAQ: WHIO TV & Radio FCC Applications Visitor Agreement Privacy Policy Pets(Opens in new window) WHIO RadioProgram LineupAdvertise With UsAsk The ExpertsCleveland BrownsContact WHIO RadioContestsOfficial Contest RulesDayton FlyersFAQ: WHIO TV & RadioFCC ApplicationsHow to Listen To WHIO RadioPodcastsRadio StaffVisitor AgreementPrivacy Policy Program Lineup Advertise With Us Ask The Experts Cleveland Browns Contact WHIO Radio Contests Official Contest Rules Dayton Flyers FAQ: WHIO TV & Radio FCC Applications How to Listen To WHIO Radio Podcasts Radio Staff Visitor Agreement Privacy Policy Program Lineup Advertise With Us Ask The Experts Cleveland Browns Contact WHIO Radio Contests Official Contest Rules Dayton Flyers FAQ: WHIO TV & Radio FCC Applications How to Listen To WHIO Radio Podcasts Radio Staff Visitor Agreement Privacy Policy Steals and Deals Share Your Pics! Best of Class 2025 WHIO 7 NOW **7 Circle of Kindness Community Recycling Drive returns on June 28** The 7 Circle of Kindness Community Recycling Drive is back and growing, offering the Miami Valley a one-of-a-kind opportunity to drop off an expanded list of hard-to-recycle items that would otherwise be sent to a landfill, all in one place. You can drop off unwanted household and hard-to-recycle items listed below for free at the Cox Media Group Ohio Media Center parking lot (1611 S. Main St., Dayton, OH 45409) on Saturday, June 28, 2025, between 8:00 AM and 1:00 PM. This year, the 7 Circle of Kindness is teaming up with several local organizations that are passionate about preserving our environment and offer many services, allowing for reuse, repurposing, and recycling possibilities that go beyond traditional curbside recycling provided in the greater Dayton region. The third annual 7 Circle of Kindness Community Recycling Drive is a collaboration between WHIO-TV, Goodwill Easterseals Miami Valley, Montgomery County Environmental Services, Washington-Centerville Public Library Creativity Commons, the Montgomery County Sheriff’s Office, and Waste-free Dayton. This event is sponsored byMorris Home,Ashley, and theResident Home Association. 2025 Recycling Event Parking Lot Instructions Unless you are dropping off heavier pieces of furniture, this is a drive-through event. Please follow the map above and the signs at the event for traffic directions and to identify the location and order of recycling stations you are interested in. Our team will be there to assist with any questions. The following items will be accepted by each of the recycling stations this year: Montgomery County Environmental Services Styrofoam Montgomery County Sheriff’s Office Inhalers Creams Loose pills (need to be taken out of pill containers and put in a Ziplock bag) Goodwill Easterseals Miami Valley Clothing Textiles Shoes Furniture Small appliances (microwaves, toasters,smallrefrigerators (dorm-size, beverage-size) Radios and electronics Housewares Toys Bicycles Books/Jewelry Computers and accessories Non-Motorized Medical Equipment Important note:for items accepted by Goodwill Easterseals Miami Valley, please only bring items that are gently used and can be repurposed for the benefit of our community—the organization will be unable to take in items in distress or broken furniture. Washington-Centerville Public Library Creativity Commons Air & home care: all brands of air and home cartridges and plugs, spray bottles, and pump and spray trigger heads Drink pouches: all brands of aluminum and plastic drink pouches (no need to remove straws) Eye care packaging: all brands of contact lens cases and packaging, contact solution bottle caps, eye drop single-dose vials, and eye drop bottles and caps. Oral care products and packaging: all brands of used or empty toothpaste tubes and caps, toothbrushes, toothpaste cartons, toothbrush outer packaging, and floss containers Razors: all brands of blades, razors, and plastic razor packaging Snack Pouches: all brands of squeezable snack plastic pouches and caps Socks: all brands ofused,clean socks. Important: stockings, tights, and pantyhose are not accepted. This program is for used socks only, not donations of new pairs. Waste-free Dayton PacTek can holders Twist ties and bread tags Coffee bags Pens, markers, highlighters Plastic gift cards Pleasedo notbring the following items, as we will not be able to accept them at the event: Mattresses and box springs Chemicals Flammable liquids Paint Automotive parts: batteries and tires Infant furniture/safety device (including car seats) Televisions Large appliances: refrigerators, washers, dryers, full-size refrigerators, etc. Batteries (any type) Light bulbs (any type) The event is open to all the greater Dayton regional counties. Want to drop off items that cannot be accepted during this drive? Our team will be there to share the detailed information on alternative ways to recycle, reuse, and repurpose items that go beyond the scope of this event. About 7 Circle of Kindness and Event Partners Montgomery County Environmental Servicesprovides high-quality drinking water, solid waste, recycling, and wastewater reclamation services to the citizens of Montgomery County. The organization works to preserve public health, foster economic development, and protect the environment and local natural resources for future generations. They also offer educational programs to local schools, community organizations, and businesses that want to learn more about conservation and sustainability in the Miami Valley region. Goodwill Easterseals Miami Valley‘s mission is to empower people with disabilities and other disadvantages to achieve independence and enhance their quality of life. The agency offers more than 40 programs and services in a 29-county region in Ohio and Kentucky, with more than 1,400 dedicated employees. In 2024, GESMV served 24,450 people, including employing more than 600 people with disabilities and assisting nearly 1,000 people to find jobs in the community. The organization’s staff and volunteers work hard every day to make it possible for all people to live, learn, work, and play in our community. In 2024, Goodwill Easterseals Miami Valley, through its more than 40 Goodwill retail stores it operates, helped redirect over 22 million pounds of reusable and recyclable goods from local landfills. The Montgomery County Sheriff’s Office, located in Dayton, Ohio, is a full-service law enforcement agency dedicated to protecting and serving the residents of Montgomery County. Under the leadership of Sheriff Rob Streck, the office provides patrol, investigations, jail operations, court services, civil enforcement, and emergency communications. The Sheriff’s Office is dedicated to enhancing public safety while strengthening trust with the residents it serves. Creativity Commons, the makerspace ofWashington-Centerville Public Library, is committed to sustainability, including proper disposal of hazardous materials, recycling, and presenting educational programs. The Library’spublic recycling collections– in partnership withTerracycle– include many hard-to-recycle items like oral care products, disposable razors, drink & snack pouches, eye care packaging, socks, and much more. The Library’s Fixit Clinics, held quarterly since 2018, are all-ages, do-it-together events where people bring their broken household items and learn how to assess, disassemble, and repair them instead of sending them to the landfill. Washington-Centerville Public Library is community-focused and strives to be a dynamic leader in fueling the intellect and imagination of those we serve. Waste-free Daytonis a grassroots nonprofit created in 2020 to foster community and encourage collaboration towards a healthier and more sustainable future in the Dayton region. The primary focus areas are awareness and advocacy around plastic pollution, reducing waste by recycling right, composting, and being a conscious consumer, and community rejuvenation. 7 Circle of Kindnesswas born out of a sense of responsibility to our community. It is a WHIO-TV initiative serving communities with seven pillars that focus on things important to our viewers, including education, peace, environment, diversity, and more. 7 Circle of Kindness is sponsored byMorris Home,Ashley, andResident Home Association. For questions about this event or the WHIO-TV 7 Circle of Kindness program, please contact Niki Mayakova atksenia.mayakova@cmg.com. ©2025 Cox Media Group **Most Read** **City says arbitrator ignored ‘simply obvious dangers’ by reinstating fired police sergeant** **FBI investigation blocks off Ohio neighborhood** **24-year-old man enrolled in an Ohio high school in U.S. Marshals custody** **Woman unable to walk, sues hospital after she says surgeon operated on the wrong knee** **Kettering Health Cyberattack: Concerns raised about alerting those impacted by sensitive data breach** Local Crime and Law State and Regional Politics Share with Us Lottery Live Traffic Conditions Pump Patrol Weather Interactive Radar Closings Severe Weather Cincinnati Bengals Cincinnati Reds Cleveland Browns Dayton Flyers Ohio State Buckeyes Contest Rules Advertise With Us About WHIO-TV More Ways to Watch About WHIO Radio WHIO Radio Official Contest Rules Work With Us EEO Statement for WHIO-TV and WHIO-AM/FM Photo & Video Release Terms & Conditions WHIO-TV Public File WHIO-TV Public File Contact WHIO-TV Closed Captioning WHIO-AM Public File WHIO-AM Public File Contact WHIO-FM Public File WHIO-FM Public File Contact FCC Applications **Follow Us** © 2025Cox Media Group.This station is part of Cox Media Group Television. Learn aboutcareersat Cox Media Group. By using this website, you accept the terms of ourVisitor AgreementandPrivacy Policy, and understand your options regardingAd Choices."}