{"id": 863, "name": "Luverne Journal", "domain": "luvernejournal.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.luvernejournal.com/2025/06/05/crenshaw-county-natives-named-to-jax-state-presidents-list/", "title": "Crenshaw County Natives Named To Jax State Presidents List", "content": "News Sports Obituaries Records Contests E-Edition **Crenshaw County natives named to Jax State President’s List** Published 6:00 pm Thursday, June 5, 2025 ByLanell Downs Smith Two Crenshaw County natives received honors during Jacksonville State University’s (JSU) spring 2025 semester. Sarainiah Xiong of Luverne, Brice Mckenzie of Highland Home and Aislynn Brown of Honoraville have been named to the university President’s List for outstanding academic performance over the spring 2025 semester. Appointment to the list requires that students earn a perfect 4.0 GPA (grade point average) while completing at least 12 credit hours of courses. Xiong is a graduate of Luverne School majoring in art at JSU. Brown, a graduate of Highland Home School, was salutatorian of the class of 2021 and is pursuing a degree in forensic investigation. **Email newsletter signup** Mckenzie is also a graduate of Highland Home School studying management at JSU, where he plays football for JAX State. Founded in 1883 as a state teachers college, Jacksonville State University has grown from into the Alabama regional university with the highest percentage of accredited programs. Located in the Appalachian foothills midway between Birmingham and Atlanta, Jax State offers more than 150 courses of study, including over 40 online programs, at the undergraduate and graduate level. To learn more, visitwww.jsu.edu, call 1-800-231-JAX1 or e-mail jaxfacts@jsu.edu. **From classroom to career** **Farmers market returns to Crenshaw County** **Luverne Kiwanians host state officers** **Journal welcomes summer intern Abbigail Vickery** Calendar of events **Calendar of events** **Calendar of events** News Sports Obituaries Records Small Business About Us Contact Us © 2025, Luverne Journal"}