{"id": 1972, "name": "Washington Free Beacon", "domain": "freebeacon.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://freebeacon.com/democrats/that-was-quick-democrats-postpone-sista-soulja-moment-to-defend-illegal-immigrants-and-rioters-waving-mexicans-flags-on-burning-cars/", "title": "That Was Quick Democrats Postpone Sista Soulja Moment To Defend Illegal Immigrants And Rioters Waving Mexicans Flags On Burning Cars", "content": "News Columns Videos Newsletters Politics National Security Culture Opinion Fact Check ColumnsMatthew ContinettiEditorialsMen of the Year Matthew Continetti Editorials Men of the Year Matthew Continetti Editorials Men of the Year Tehran Awakens a Jacksonian Giant Why Trump Is Perplexed by Putin Awash in Anti-Semitism Morning Beacon Weekend Beacon Stiles Section Sign Up Politics National Security Culture Policy Opinion Fact Check ColumnsMatthew ContinettiEditorialsMen Of The Year Matthew Continetti Editorials Men Of The Year Matthew Continetti Editorials Men Of The Year NewslettersMorning BeaconWeekend BeaconStiles SectionSign Up Morning Beacon Weekend Beacon Stiles Section Sign Up Morning Beacon Weekend Beacon Stiles Section Sign Up Videos **TOP** **HITS** **That Was Quick: Democrats Postpone ‘Sista Soulja Moment’ To Defend Illegal Immigrants and Rioters Waving Mexicans Flags on Burning Cars** **The party was (allegedly) seeking to 'ratchet back' its 'leftward lurch on social issues'** Most Americans approve of President Donald Trump's efforts to deport illegal immigrants and crack down on the violent protests that erupted in Los Angeles over the weekend in response to immigration raids. Doing what comes naturally, elected Democrats rallied in opposition to Trump's popular agenda as hooligans threw bricks at police officers, ransacked local shops, set fire to cars, and spit on American flags (while waving Mexicans flags). So much for the Democratic Party's short-lived efforts to rebrand as a no-nonsense party capable of understanding the concerns of normal Americans. As the chaos was enfolding on the streets of Los Angeles,Politicoreportedthat the Democratic Party was in the midst of a \"Great Un-Awokening.\" Ambitious Democrats were \"in the middle of a slow-motion Sista Souljah moment\" aiming to \"ratchet back a leftward lurch on social issues some in the party say cost them the November election.\" As an example,Politicopraised California governor Gavin Newsom for having \"muted his tone on immigration issues,\" noting that in addition to proposing \"cuts\" to a state program that gives free health care to illegal immigrants, Newsom had also stopped using the term \"sanctuary\" to describe state policies that prohibit local authorities from cooperating with federal immigration officers. While Republicans were busy compiling footage of the LA riots to use in campaign ads next year, Democrats reiterated their support for illegal immigration. Newsom insisted that local authorities had the situation under control, a claimnot supportedby the evidence. He blamed Trump for having \"flamed the fires,\" whatever that means, andannouncedhe was suing the Trump administration over its efforts to deploy the National Guard to restore peace. Kamala Harris, who is eyeing a run for California governor in 2026,saidTrump's efforts to enforce immigration law were part of a \"cruel, calculated agenda to spread panic and division.\" Democratic governors, including several possible 2028 contenders such as J.B. Pritzker of Illinois, Wes Moore of Maryland, Gretchen Whitmer of Michigan, and Josh Shapiro of Pennsylvania, piled on in ajoint statementcondemning Trump for trying to quell the insurrection in defense of illegal immigration. Even during the summer of 2020, at the peak of woke nonsense, a majority of Americansapprovedof deploying the U.S. military to intervene in violent protests, as suggested by Sen. Tom Cotton (R., Ark.) in aNew York Timesop-edthat was widely denounced (by deranged liberals) as \"dangerous.\" The mediadescribedthose violent protests as \"mostly peaceful\" at the time. On Sunday, Rep. Maxine Waters (D., Calif.)insistedthere was \"no violence\" at the Los Angeles riots, during which shop owners have been assaulted and police officers pelted with bricks and Molotov cocktails. When they weren't attacking Trump, Democrats were half-heartedly criticizing the LA insurrectionists—not for rioting or attacking cops, but for giving Trump \"what he wants.\" Their allies in the mainstream press sought todownplay the chaosunfolding on the streets as a totally normal gathering of \"people having fun watching cars burn.\" And it's happening amid widespread criticism of the media's inability totell the truthabout former president Joe Biden's cognitive decline, even though most Americans could clearly see it with their own eyes. Recent polls show that Trump's approach to immigration is the most popular part of his agenda. A majority of Americansapproveof Trump's efforts to deploy federal agents to deport illegal immigrants. \"The American electorate believe that the Democrats don't have a clue on the issue of immigration,\" said CNN pollster Harry Enten, citing polls that showed Americans trusting Republicans more than Democrats to handle immigration by margins of up to 19 percentage points. Los Angeles mayor Karen Bassdismissedthese poll results during an interview with CNN, arguing the numbers would be different \"if you did the polling in Los Angeles.\" Sara Jacobs, a Democratic congresswoman from California,braggedabout having dinner at a trendy Italian restaurant that was raided earlier this month by federal authorities investigating allegations that the owner was exploiting illegal immigrants. \"We will continue to stand with our immigrant communities,\" she wrote in a social media post that included a photo of the congresswoman enjoying a glass of wine and an artisanal pizza. Jacobs, a Columbia grad who is the granddaughter of tech oligarch Irwin Jacobs, has anet worthof up to $65 million. Meanwhile, residents of Martha's Vineyard, the elite liberal haven where Barack Obama lives in an oceanfront mansion worth almost $20 million,complainedthat immigration authorities were deporting the people who were supposed to be renovating their pool houses. Immigration is hardly the only issue on which Democrats have struggled to adopt a more sensible position that aligns with the preferences of most Americans. Few of the party's lawmakers have managed to articulate acoherent positionon the issue of transgender athletes in women's sports. A recentNew York Timespoll found that nearly 80 percent of Americans, including 67 percent of Democrats,opposeletting so-called transgender females compete against women. Published under:California,Democratic Party,Gavin Newsom,Kamala Harris,Los Angeles,Riots,Violent Crime,Wes Moore **TOP** **HITS** About Us Masthead Advertise With Us Terms of Use Privacy Policy 2025 All Rights Reserved"}