{"id": 818, "name": "La Presse", "domain": "lapresse.ca", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.lapresse.ca/actualites/justice-et-faits-divers/2025-06-07/couronne-nord-de-montreal/un-mort-et-une-femme-hospitalisee-a-la-suite-de-travaux-effectues-dans-une-piscine-creusee.php", "title": "Un Mort Et Une Femme Hospitalisee A La Suite De Travaux Effectues Dans Une Piscine Creusee.php", "content": "Consulter lapresse.ca Actualités International Dialogue Contexte Affaires Sports Auto Arts Cinéma Société Gourmand Voyage Maison Votre compte La PressePour des raisons de sécurité, veuillez valider votre adresse courrielEnvoyer un courriel de validation.Un courriel de validation vous a été envoyé.Se connecterMon profilMes donsSe déconnecter Se connecter Mon profil Mes dons Se déconnecter Se connecter Se connecter Mon profil Mon profil Mes dons Mes dons Se déconnecter Se déconnecter Chroniques Éditoriaux Caricatures Analyses National Politique Grand Montréal Régional Justice et faits divers Santé Éducation Environnement Sciences ActualitésTousChroniquesÉditoriauxCaricaturesAnalysesNationalPolitiqueGrand MontréalRégionalJustice et faits diversSantéÉducationEnvironnementSciences Tous Chroniques Éditoriaux Caricatures Analyses National Politique Grand Montréal Régional Justice et faits divers Santé Éducation Environnement Sciences Tous Chroniques Éditoriaux Caricatures Analyses National Politique Grand Montréal Régional Justice et faits divers Santé Éducation Environnement Sciences InternationalTousChroniquesAfriqueAmérique latineAsie et OcéanieCaraïbesÉtats-UnisEuropeMoyen-Orient Tous Chroniques Afrique Amérique latine Asie et Océanie Caraïbes États-Unis Europe Moyen-Orient Tous Chroniques Afrique Amérique latine Asie et Océanie Caraïbes États-Unis Europe Moyen-Orient DialogueTousChroniquesOpinionsCourrier des lecteursTémoignages Tous Chroniques Opinions Courrier des lecteurs Témoignages Tous Chroniques Opinions Courrier des lecteurs Témoignages ContexteTousChroniques Tous Chroniques Tous Chroniques AffairesTousChroniquesÉconomieMarchésEntreprisesMarché immobilierTechnoMédiasFinances personnellesPMEPortfolio Tous Chroniques Économie Marchés Entreprises Marché immobilier Techno Médias Finances personnelles PME Portfolio Tous Chroniques Économie Marchés Entreprises Marché immobilier Techno Médias Finances personnelles PME Portfolio SportsTousChroniquesHockeyJeux olympiquesSoccerFootballTennisBaseballCourse automobileGolfSports de combatSports d'hiverBasketballCyclisme Tous Chroniques Hockey Jeux olympiques Soccer Football Tennis Baseball Course automobile Golf Sports de combat Sports d'hiver Basketball Cyclisme Tous Chroniques Hockey Jeux olympiques Soccer Football Tennis Baseball Course automobile Golf Sports de combat Sports d'hiver Basketball Cyclisme AutoTousGuide autoVoitures électriquesConseilsRappels Tous Guide auto Voitures électriques Conseils Rappels Tous Guide auto Voitures électriques Conseils Rappels ArtsTousChroniquesMusiqueTélévisionQuoi regarderThéâtreLittératureArts visuelsSpectaclesHumourCélébrités Tous Chroniques Musique Télévision Quoi regarder Théâtre Littérature Arts visuels Spectacles Humour Célébrités Tous Chroniques Musique Télévision Quoi regarder Théâtre Littérature Arts visuels Spectacles Humour Célébrités CinémaTousChroniquesEntrevuesCritiques Tous Chroniques Entrevues Critiques Tous Chroniques Entrevues Critiques SociétéTousChroniquesSantéFamilleMode et beautéSexualitéAnimaux Tous Chroniques Santé Famille Mode et beauté Sexualité Animaux Tous Chroniques Santé Famille Mode et beauté Sexualité Animaux GourmandTousChroniquesAlimentationRecettesRestaurantsAlcools Tous Chroniques Alimentation Recettes Restaurants Alcools Tous Chroniques Alimentation Recettes Restaurants Alcools VoyageTousChroniquesQuébec et CanadaÉtats-UnisEuropeAsieAmérique latineCaraïbesAfriqueOcéanieTrucs et conseilsPlein air Tous Chroniques Québec et Canada États-Unis Europe Asie Amérique latine Caraïbes Afrique Océanie Trucs et conseils Plein air Tous Chroniques Québec et Canada États-Unis Europe Asie Amérique latine Caraïbes Afrique Océanie Trucs et conseils Plein air MaisonTousChroniquesImmobilierArchitectureDécorationRénovationCour et jardin Tous Chroniques Immobilier Architecture Décoration Rénovation Cour et jardin Tous Chroniques Immobilier Architecture Décoration Rénovation Cour et jardin Liens utiles Se connecter Se connecter Mon profil Mon profil Mes dons Mes dons Se déconnecter Se déconnecter **Couronne nord de MontréalUn mort et une femme hospitalisée à la suite de travaux effectués dans une piscine creusée** PHOTO AJAX9, ARCHIVES GETTY IMAGES La Régie intermunicipale de police Thérèse-De Blainville (RIPTB) a ouvert une enquête sur les circonstances de cette tragédie survenue vendredi soir sur le carré Hotte à Sainte-Thérèse, dans les Laurentides. (Sainte-Thérèse) Un homme est mort et une femme a été hospitalisée à la suite de travaux effectués dans une piscine creusée, vidée de son eau, à Sainte-Thérèse, sur la couronne nord de Montréal. La Régie intermunicipale de police Thérèse-De Blainville (RIPTB) a ouvert une enquête sur les circonstances de cette tragédie survenue vendredi soir sur le carré Hotte à Sainte-Thérèse, dans les Laurentides. Les services d’urgence ont été alertés peu avant 22 heures, vendredi. L’appel à la centrale d’urgence faisait état de deux personnes qui semblaient avoir des problèmes de santé. À leur arrivée sur les lieux, les policiers ont remarqué que des produits chimiques avaient été utilisés pour des travaux extérieurs et ils pourraient être à l’origine des malaises des victimes, ce que l’enquête devra confirmer. « Les gens faisaient des travaux de réfection sur une membrane d’une piscine creusée à l’arrière de la résidence », a raconté l’inspectrice-chef de la RIPTB, Karine Desaulniers. L’homme et la femme, tous deux dans la fin quarantaine, ont été trouvés inconscients sur place. Des manœuvres de réanimations ont été effectuées et les deux personnes ont été transportées vers un centre hospitalier, où la mort de l’homme a été constatée environ une heure plus tard, vers 23 h 30. « La dame est présentement au centre hospitalier et son état est stable », a indiqué l’inspectrice-chef Karine Desaulniers en entrevue samedi matin. Quelques policiers de la RIPTB ont aussi été incommodés par les émanations des produits et ont reçu des soins préventifs. Les deux résidences voisines ont dû être évacuées par mesure préventive, mais les gens ont pu réintégrer leur domicile. Le dossier a été pris en charge par le bureau du coroner. « Il n’y a pas d’élément criminel au moment où l’on se parle », a par ailleurs souligné MmeDesaulniers. Le périmètre de la scène a été levé très tôt samedi matin, mais les enquêteurs de la RIPTB devaient rencontrer des témoins au cours de la journée et faire des vérifications supplémentaires sur les lieux. L’enquête se poursuit. Justice et faits diversGatineauUn homme meurt dans un accident de la circulationPublié le 7 juin Justice et faits diversAprès une altercationL’homme qui a chuté dans le canal de Lachine est mortPublié le 5 juin Justice et faits diversSaint-HippolyteUn homme barricadé, une école ferméePublié le 2 juin Justice et faits diversEstrieDeux suspects arrêtés en lien avec un homicide survenu à Lac-BromeUn homme et une femme ont été arrêtés mercredi en lien avec l’homicide de Junior Mouckagni Bouelili, retrouvé mort dans une voiture volée incendiée en mars dernier à Lac-Brome, en Estrie. Un troisième suspect manque toujours à l’appel.Publié à 17 h 37 Un homme et une femme ont été arrêtés mercredi en lien avec l’homicide de Junior Mouckagni Bouelili, retrouvé mort dans une voiture volée incendiée en mars dernier à Lac-Brome, en Estrie. Un troisième suspect manque toujours à l’appel. Un homme et une femme ont été arrêtés mercredi en lien avec l’homicide de Junior Mouckagni Bouelili, retrouvé mort dans une voiture volée incendiée en mars dernier à Lac-Brome, en Estrie. Un troisième suspect manque toujours à l’appel. Justice et faits diversDrame d’AmquiUn témoignage confus, bizarre et truffé de jurons(Québec) Après quatre semaines de procès, c’était finalement au tour de l’auteur du drame d’Amqui de prendre la parole. Steeve Gagnon a livré un témoignage décousu mercredi, émaillé de théories du complot sur le fentanyl, les Hells Angels ou encore des policiers corrompus.Publié à 16 h 33 (Québec) Après quatre semaines de procès, c’était finalement au tour de l’auteur du drame d’Amqui de prendre la parole. Steeve Gagnon a livré un témoignage décousu mercredi, émaillé de théories du complot sur le fentanyl, les Hells Angels ou encore des policiers corrompus. (Québec) Après quatre semaines de procès, c’était finalement au tour de l’auteur du drame d’Amqui de prendre la parole. Steeve Gagnon a livré un témoignage décousu mercredi, émaillé de théories du complot sur le fentanyl, les Hells Angels ou encore des policiers corrompus. 00:25Justice et faits diversCasino de MontréalDes militants environnementalistes aspergent la façade de peintureÀ quelques jours du Grand Prix du Canada, le Casino de Montréal a été la cible de vandalisme, mercredi matin, vers 9 h 15. Des militants d’un groupe environnementaliste ont aspergé la façade de l’établissement avec de la peinture rose lavable.Publié à 13 h 06 À quelques jours du Grand Prix du Canada, le Casino de Montréal a été la cible de vandalisme, mercredi matin, vers 9 h 15. Des militants d’un groupe environnementaliste ont aspergé la façade de l’établissement avec de la peinture rose lavable. À quelques jours du Grand Prix du Canada, le Casino de Montréal a été la cible de vandalisme, mercredi matin, vers 9 h 15. Des militants d’un groupe environnementaliste ont aspergé la façade de l’établissement avec de la peinture rose lavable. Justice et faits diversOpération policière contre un réseau d’exportation de véhicules volésLa Sûreté du Québec (SQ), en collaboration avec deux autres corps policiers, mène mercredi une opération contre ce qui est décrit comme un « réseau d’exportation outre-mer de véhicules volés ».Publié à 9 h 51 La Sûreté du Québec (SQ), en collaboration avec deux autres corps policiers, mène mercredi une opération contre ce qui est décrit comme un « réseau d’exportation outre-mer de véhicules volés ». La Sûreté du Québec (SQ), en collaboration avec deux autres corps policiers, mène mercredi une opération contre ce qui est décrit comme un « réseau d’exportation outre-mer de véhicules volés ». Justice et faits diversMort d’Amélie ChampagneUne naturopathe accusée de pratique illégale de la médecineLe Collège des médecins du Québec poursuit la naturopathe Kadeja Lefebvre pour avoir fait des gestes réservés à la profession médicale sur Amélie Champagne, dont le suicide avait fait l’objet d’une enquête publique.Publié à 5 h 00 Le Collège des médecins du Québec poursuit la naturopathe Kadeja Lefebvre pour avoir fait des gestes réservés à la profession médicale sur Amélie Champagne, dont le suicide avait fait l’objet d’une enquête publique. Le Collège des médecins du Québec poursuit la naturopathe Kadeja Lefebvre pour avoir fait des gestes réservés à la profession médicale sur Amélie Champagne, dont le suicide avait fait l’objet d’une enquête publique. Justice et faits diversMontréalUne mère et son fils meurent noyés dans une piscineUne femme de 34 ans et son fils de 3 ans ont perdu la vie mardi soir après s’être noyés dans une piscine résidentielle dans l’arrondissement de Lachine, à Montréal.Publié à 0 h 16 Une femme de 34 ans et son fils de 3 ans ont perdu la vie mardi soir après s’être noyés dans une piscine résidentielle dans l’arrondissement de Lachine, à Montréal. Une femme de 34 ans et son fils de 3 ans ont perdu la vie mardi soir après s’être noyés dans une piscine résidentielle dans l’arrondissement de Lachine, à Montréal. Justice et faits diversUn suspect de terrorisme extradé du Canada vers les États-Unis(Ottawa) Un citoyen pakistanais résidant au Canada a été extradé vers New York, où il est accusé d’avoir comploté pour commettre une fusillade de masse dans un centre juif, a annoncé le département américain de la Justice.Publié hier à 20 h 31 (Ottawa) Un citoyen pakistanais résidant au Canada a été extradé vers New York, où il est accusé d’avoir comploté pour commettre une fusillade de masse dans un centre juif, a annoncé le département américain de la Justice. (Ottawa) Un citoyen pakistanais résidant au Canada a été extradé vers New York, où il est accusé d’avoir comploté pour commettre une fusillade de masse dans un centre juif, a annoncé le département américain de la Justice. Justice et faits diversCampement près de la rue Notre-DamePas de décision sur le démantèlement pour le momentLa Clinique juridique itinérante a déposé mardi matin une demande d’urgence à la Cour supérieure pour empêcher le démantèlement du campement de sans-abri situé le long de la rue Notre-Dame, dans Hochelaga-Maisonneuve. Le juge a reporté sa décision à mercredi, laissant donc une période de répit aux campeurs.Mis à jour hier à 17 h 57 La Clinique juridique itinérante a déposé mardi matin une demande d’urgence à la Cour supérieure pour empêcher le démantèlement du campement de sans-abri situé le long de la rue Notre-Dame, dans Hochelaga-Maisonneuve. Le juge a reporté sa décision à mercredi, laissant donc une période de répit aux campeurs. La Clinique juridique itinérante a déposé mardi matin une demande d’urgence à la Cour supérieure pour empêcher le démantèlement du campement de sans-abri situé le long de la rue Notre-Dame, dans Hochelaga-Maisonneuve. Le juge a reporté sa décision à mercredi, laissant donc une période de répit aux campeurs. Justice et faits diversLa Cour d’appel confirme la validité d’une enquête deLa PresseDans une décision majeure pour le journalisme d’enquête, la Cour d’appel du Québec a confirmé mardi queLa Presseavait mené une enquête de type #moiaussi dans les règles de l’art en 2017. Deux ans après le rejet initial de sa poursuite en diffamation, le chorégraphe Steve Bolton vient cette fois d’être débouté par le plus haut tribunal de la province.Publié hier à 16 h 44 Dans une décision majeure pour le journalisme d’enquête, la Cour d’appel du Québec a confirmé mardi queLa Presseavait mené une enquête de type #moiaussi dans les règles de l’art en 2017. Deux ans après le rejet initial de sa poursuite en diffamation, le chorégraphe Steve Bolton vient cette fois d’être débouté par le plus haut tribunal de la province. Dans une décision majeure pour le journalisme d’enquête, la Cour d’appel du Québec a confirmé mardi queLa Presseavait mené une enquête de type #moiaussi dans les règles de l’art en 2017. Deux ans après le rejet initial de sa poursuite en diffamation, le chorégraphe Steve Bolton vient cette fois d’être débouté par le plus haut tribunal de la province. Justice et faits diversAccusé de crimes sexuelsLe milliardaire Robert Miller n’aura pas de procèsRobert Miller, le milliardaire octogénaire accusé d’une série de crimes sexuels, en majorité sur des mineures, n’aura pas de procès criminel. La Cour supérieure juge que l’homme est trop malade et ordonne l’arrêt du processus judiciaire. « Ce n’est pas un acquittement », a précisé la juge.Mis à jour hier à 16 h 20 Robert Miller, le milliardaire octogénaire accusé d’une série de crimes sexuels, en majorité sur des mineures, n’aura pas de procès criminel. La Cour supérieure juge que l’homme est trop malade et ordonne l’arrêt du processus judiciaire. « Ce n’est pas un acquittement », a précisé la juge. Robert Miller, le milliardaire octogénaire accusé d’une série de crimes sexuels, en majorité sur des mineures, n’aura pas de procès criminel. La Cour supérieure juge que l’homme est trop malade et ordonne l’arrêt du processus judiciaire. « Ce n’est pas un acquittement », a précisé la juge. Justice et faits diversMeurtre de Maxime Berthiaume en 1999Deux hommes arrêtés, un quart de siècle plus tardDeux hommes ont été arrêtés mardi en lien avec le meurtre de Maxime Berthiaume, qui demeurait non résolu depuis plus d’un quart de siècle.Publié hier à 11 h 48 Deux hommes ont été arrêtés mardi en lien avec le meurtre de Maxime Berthiaume, qui demeurait non résolu depuis plus d’un quart de siècle. Deux hommes ont été arrêtés mardi en lien avec le meurtre de Maxime Berthiaume, qui demeurait non résolu depuis plus d’un quart de siècle. Justice et faits diversSaint-Mathieu-du-ParcUn corps retrouvé dans la rivière Shawinigan(Saint-Mathieu-du-Parc) Le corps d’un homme a été retrouvé dans la rivière Shawinigan, dans le parc récréoforestier de Saint-Mathieu-du-Parc, en Mauricie, lundi. Selon la Sûreté du Québec (SQ), il pourrait s’agir du corps d’un randonneur qui était porté disparu depuis le temps des Fêtes.Publié hier à 10 h 32 (Saint-Mathieu-du-Parc) Le corps d’un homme a été retrouvé dans la rivière Shawinigan, dans le parc récréoforestier de Saint-Mathieu-du-Parc, en Mauricie, lundi. Selon la Sûreté du Québec (SQ), il pourrait s’agir du corps d’un randonneur qui était porté disparu depuis le temps des Fêtes. (Saint-Mathieu-du-Parc) Le corps d’un homme a été retrouvé dans la rivière Shawinigan, dans le parc récréoforestier de Saint-Mathieu-du-Parc, en Mauricie, lundi. Selon la Sûreté du Québec (SQ), il pourrait s’agir du corps d’un randonneur qui était porté disparu depuis le temps des Fêtes. Justice et faits diversMontréalCoups de feu tirés dans le Sud-OuestDes coups de feu ont été tirés lundi soir à Montréal, dans l’arrondissement du Sud-Ouest.Publié hier à 7 h 41 Des coups de feu ont été tirés lundi soir à Montréal, dans l’arrondissement du Sud-Ouest. Des coups de feu ont été tirés lundi soir à Montréal, dans l’arrondissement du Sud-Ouest. Justice et faits diversProcès de François Pelletier« J’ai essentiellement évité l’Apocalypse », témoigne le tueur de Romane BonnierFrançois Pelletier « devait » tuer Romane Bonnier pour… la protéger. « J’ai essentiellement évité l’Apocalypse », a-t-il affirmé au jury. Au quatrième jour d’un témoignage déroutant, l’accusé a finalement raconté le meurtre de son ex-copine.Mis à jour le 9 juin François Pelletier « devait » tuer Romane Bonnier pour… la protéger. « J’ai essentiellement évité l’Apocalypse », a-t-il affirmé au jury. Au quatrième jour d’un témoignage déroutant, l’accusé a finalement raconté le meurtre de son ex-copine. François Pelletier « devait » tuer Romane Bonnier pour… la protéger. « J’ai essentiellement évité l’Apocalypse », a-t-il affirmé au jury. Au quatrième jour d’un témoignage déroutant, l’accusé a finalement raconté le meurtre de son ex-copine. Justice et faits diversAccusations de crimes sexuelsRobert Miller risque d’échapper à son procès criminelMême la Couronne en convient : Robert Miller, le milliardaire octogénaire accusé d’une série de crimes sexuels pour des gestes qui remontent à aussi loin que 30 ans, est désormais trop malade pour subir un procès criminel. Tout porte à croire que la Cour supérieure ordonnera l’arrêt du processus judiciaire mardi, au palais de justice de Montréal.Publié le 9 juin Même la Couronne en convient : Robert Miller, le milliardaire octogénaire accusé d’une série de crimes sexuels pour des gestes qui remontent à aussi loin que 30 ans, est désormais trop malade pour subir un procès criminel. Tout porte à croire que la Cour supérieure ordonnera l’arrêt du processus judiciaire mardi, au palais de justice de Montréal. Même la Couronne en convient : Robert Miller, le milliardaire octogénaire accusé d’une série de crimes sexuels pour des gestes qui remontent à aussi loin que 30 ans, est désormais trop malade pour subir un procès criminel. Tout porte à croire que la Cour supérieure ordonnera l’arrêt du processus judiciaire mardi, au palais de justice de Montréal. Justice et faits diversUne clé USB perdue de la GRC tombée entre les mains de criminels(Ottawa) L’organisme fédéral de surveillance de la vie privée affirme que la Gendarmerie royale du Canada (GRC) a perdu une clé USB contenant des renseignements personnels sur des victimes, des témoins et des informateurs, et a appris plus tard qu’elle était mise en vente par des criminels.Publié le 9 juin (Ottawa) L’organisme fédéral de surveillance de la vie privée affirme que la Gendarmerie royale du Canada (GRC) a perdu une clé USB contenant des renseignements personnels sur des victimes, des témoins et des informateurs, et a appris plus tard qu’elle était mise en vente par des criminels. (Ottawa) L’organisme fédéral de surveillance de la vie privée affirme que la Gendarmerie royale du Canada (GRC) a perdu une clé USB contenant des renseignements personnels sur des victimes, des témoins et des informateurs, et a appris plus tard qu’elle était mise en vente par des criminels. Nos applications La Presse+ Application mobile La Presse Contact Centre d'aide À propos de nous Faire carrière chez nous Annoncer chez nous Services Nos infolettres Avis de décès Les Éditions La Presse Météo Concours Archives Recherche Renseignements surles archives Suivez La Presse Légal Conditions d'utilisation Politique de confidentialité Registre de publicité électorale Code de conduite © La Presse Inc. Tous droits réservés. Conditions d'utilisation|Politique de confidentialité|Registre de publicité électorale|Code de conduite"}