{"id": 1807, "name": "Sustainable Pulse", "domain": "sustainablepulse.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://sustainablepulse.com/2024/05/14/groundbreaking-toxic-chemical-certification-cleanscan-enables-first-brand-greenonyx-to-reach-new-levels-of-transparency/", "title": "Groundbreaking Toxic Chemical Certification Cleanscan Enables First Brand Greenonyx To Reach New Levels Of Transparency", "content": "About Advertise Contact Us News rss twitter linkedin gplus facebook currents Monsanto Roundup Hawaii Seralini GMO MAHA Commission Calls Out Toxic Chemicals including Glyphosate and Atrazine for Damaging the Health of Americans Industrial No-Till Agriculture Increases Pesticide Use and Harms Soil – New Report Consumers Demand Conagra Eliminate Dangerous Pesticides from Popcorn Supply Chain Gambian Government Throws Weight Behind Regenerative Agroforestry for Improving Rural Economies Pesticide Industry Pushes for Exemption from Liability in Massive Threat to U.S. Public Health Federal Court Rules Health Canada Approval of Mad Dog Glyphosate Weedkiller as ‘Unreasonable’ PFAS Contaminated Sewage Sludge Fertilizers Can Cause Cancer and Other Diseases – US EPA Home Sustainable Food Sustainable Agriculture Global GMO Free Coalition GMO Evidence GMO Seralini **Groundbreaking Toxic Chemical Certification CleanScan Enables First Brand GreenOnyx to Reach New Levels of Transparency** Breaking News News Sustainable Food **MAHA Commission Calls Out Toxic Chemicals including Glyphosate and Atrazine for Damaging the Health of Americans** **Industrial No-Till Agriculture Increases Pesticide Use and Harms Soil – New Report** **Consumers Demand Conagra Eliminate Dangerous Pesticides from Popcorn Supply Chain** **Gambian Government Throws Weight Behind Regenerative Agroforestry for Improving Rural Economies** **Pesticide Industry Pushes for Exemption from Liability in Massive Threat to U.S. Public Health** The Detox Project announced Wednesday that the first brand ever to receive their new CleanScan certification has completed its certification process successfully. GreenOnyx’s flagship fresh water lentils superfood product, Wanna Greens®, recently received its CleanScan Certificate of Compliance. In a massive boost for transparency for consumers globally, brands such as GreenOnyx are now able to show, via their CleanScan QR Code, exactly what toxic chemicals they test for, including the laboratory results, and that their testing process meets theCleanScan Certification Standard. Following their success in developing Glyphosate Residue Free certification around the world, The Detox Projecthas launchedCleanScan to revolutionize the way food, supplement, personal care and clothing brands interact with consumers on toxic contaminants and their current third-party certifications. Dr. Tsipi Shoham, Co-Founder and CEO of GreenOnyx, expressed her pride in both their CleanScan and Glyphosate Residue Free certifications, stating, “These certifications are a testament to our commitment to delivering unparalleled freshness, sterility, and quality on a global scale. This achievement symbolizes trust and assurance for our consumers and expresses our core values of transparency and sustainability.” Henry Rowlands, Founder of The Detox Project, stated, “We are proud to certify GreenOnyx and Wanna Greens, as they exemplify the highest purity and environmental stewardship standards. GreenOnyx’s commitment to transparency and sustainability aligns perfectly with our mission to promote safer and healthier products for consumers worldwide.The level of interest in CleanScan certification has been massive, with both brands and retailers from around the world including a large retailer in China set to become certified soon.” The initial contaminants included in CleanScan certification are Pesticides and Heavy Metals, with more to follow soon. In addition to this new level of transparency for toxic contaminants The Detox Project is also including third-party certifications inside the CleanScan QR Codes, so that brands can at last easily showcase the multiple certifications they have worked hard to obtain, without taking up too much space on their packaging. Upon certification, brands are issued with a CleanScan QR Code, which can be used on packaging, websites or marketing material. Whenever a consumer scans the QR Code they will be taken to the brand’s CleanScan page, which shows the contaminants the certified product has been tested for, including latest lab results. “Toxic chemicals and other unhealthy contaminants have become a major issue for consumers over the last decade. CleanScan is available for brands from the food, supplement, personal care and clothing industries – we want to add a new level of transparency across the board,” Rowlands concluded. About GreenOnyx GreenOnyx is committed to promoting healthy nutritional consumption and environmental consciousness, contributing to the future of the world’s global fresh food supply. Founded in 2013 by Dr. Tsipi Shoham and Benny Shoham, Tel Aviv-based GreenOnyx is an agro-tech company at the forefront of revolutionizing how fresh food is produced, distributed, and enjoyed. Its flagship product, Wanna Greens® is the world’s smallest green vegetable with powerful nutrients that make it 100% safe, 100% healthy, and 100% accessible with a happy taste. Additional information about Wanna Greens® can be foundhere. Sustainable Pulse is a global news outlet covering sustainable agriculture, GMOs and pesticides. **1 Commentso far. Feel free to join this conversation.** OKay JacksonMay 14, 2024 at 18:08 -Well done GreenOnyx – and how great many consumers are now giving serious thought to this issue of poisons in our foods. I wish your company great success! We MUST stop poisoning our planet! Well done GreenOnyx – and how great many consumers are now giving serious thought to this issue of poisons in our foods. I wish your company great success! We MUST stop poisoning our planet! Well done GreenOnyx – and how great many consumers are now giving serious thought to this issue of poisons in our foods. I wish your company great success! We MUST stop poisoning our planet! Tanya Marquette:Have never trusted BRM. Sadly even health food stores promote this company as organic even when the label does not&helli… Dr Walter Young AP:There is now a one of a kind, worldwide, safe, effective, cost effective way to remove ALL Heavy Metals. The…… Brenda Paulson:Stop the madness! We need clean food!!!… About Sustainable Food Sustainable Agriculture Global GMO Free Coalition (GGFC) GMO Evidence GMO Seralini GMO Judy Carman GMO Pictures Privacy Disclaimer Advertise Contact Us **Most viewed posts** EU Parliament Votes ‘Yes’ on GMO Opt-Out for Member States A Short History of Glyphosate GM Crops Now Banned in 39 Countries Worldwide – Sustainable Pulse Research US Court Documents Show Monsanto Manager Led Cancer Cover Up for Glyphosate and PCBs Bob’s Red Mill Faces Class Action Lawsuit over Glyphosate Weedkiller Contamination The Creator of GMO Potatoes Reveals The Dangerous Truth – Exclusive Interview Roundup Linked to Global Boom in Celiac Disease and Gluten Intolerance **Most Popular Posts** **Recent Posts** **MAHA Commission Calls Out Toxic Chemicals including Glyphosate and Atrazine for Damaging the Health of Americans** **Industrial No-Till Agriculture Increases Pesticide Use and Harms Soil – New Report** **Consumers Demand Conagra Eliminate Dangerous Pesticides from Popcorn Supply Chain** **Gambian Government Throws Weight Behind Regenerative Agroforestry for Improving Rural Economies** **Pesticide Industry Pushes for Exemption from Liability in Massive Threat to U.S. Public Health**"}