{"id": 693, "name": "IPM Newsroom", "domain": "ipmnewsroom.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://ipmnewsroom.org/campus-to-coast-a-university-of-illinois-urbana-champaign-grad-student-investigates-the-gambias-fishmeal-crisis-and-its-toll-on-west-african-communities/", "title": "Campus To Coast A University Of Illinois Urbana Champaign Grad Student Investigates The Gambias Fishmeal Crisis And Its Toll On West African Communities", "content": "About Us Agriculture Education Environment Politics WILL Call Student Newsroom Donate Now **Campus to coast: A University of Illinois Urbana-Champaign grad student investigates The Gambia’s fishmeal crisis and its toll on West African communities** By Arielle Raveney and Kennedy Vincent June 6, 2025 The Gambia’s coastal communities rely heavily on fishing for their livelihoods. Large-scale fisheries and fishmeal projects have expanded along the coast. These projects promise economic growth but also create social and environmental challenges. Dialogue sits down with a University of Illinois Urbana-Champaign doctoral student born in America and raised in The Gambia. She investigates how these projects impact local communities and marine ecosystems from the perspective of blue justice, a global initiative that addresses unfair fishing practices. __GUESTS:Fatou H. Jobe Doctoral student, University of Illinois Urbana-Champaign WILL and the Illinois Newsroom are committed to bringing you in-depth, relevant coverage that keeps you informed and engages you with our community and state. Join with thousands of others to keep this important public media-based resource available to all.Donate today >> Accessibility at Illinois Admissions Alumni Athletics Bookstore Calendar Campus Directory Campus Map COVID-19 Diversity, Equity, & Inclusion Emergency Employment Giving Mental Health WILL Home Office of the Chancellor Office of the Provost Research Student Assistance Center University of Illinois System Privacy Policy Accessibility © 2024 University of Illinois"}