{"id": 1617, "name": "WTHI - Terre Haute News", "domain": "wthitv.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wthitv.com/features/submit-your-nomination-for-a-make-a-difference-award/article_5972050c-1cda-11ee-8679-a7aaff74c974.html", "title": "Submit Your Nomination For A Make A Difference Award", "content": "Facebook Twitter YouTube Instagram Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Local News Crime Education Health Indiana Illinois Food Inspections The Wrap Southern Indiana US & World Politics Consumer Business News Alerts Closings and Delays Interactive Radar Maps & Radars Climate Change Weather Pics Submit Closings College High School Indiana State On Demand Recipes Cars Watch Now TV Apps YouTube The American Athlete Community Calendar Contests Union Health Today Deals Fork Favorites Fork In The Road Pump Watch Wabash Valley Golf Pass Finding Family Contact Fork In The Road CBS News Livestream Eye on Terre Haute TV Listings Local Now Digital Marketing Meet the Team Our Apps Jobs Sign up for Email Alerts Site searchSearch Site searchSearch Site searchSearch 84° Search Search Search Open user controlsLog In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Facebook Twitter Instagram News Weather Sports Video Features Report It Watch Now Contests Obituaries Contact Weather Interactive radar Submit a photo WTHI Make a Difference Nominations Watch Live **Submit your nomination for a Make a Difference Award** Chris EssexChris EssexDigital DirectorChris started his career at WTHI-TV in January 2004. He started as a videographer and editor before moving to the digital team in 2007.Download the News 10 and Storm Team 10 apps here.Author facebookAuthor twitterAuthor email Digital Director Chris started his career at WTHI-TV in January 2004. He started as a videographer and editor before moving to the digital team in 2007.Download the News 10 and Storm Team 10 apps here. Chris started his career at WTHI-TV in January 2004. He started as a videographer and editor before moving to the digital team in 2007. Download the News 10 and Storm Team 10 apps here. Author facebook Author twitter Author email Digital Director Chris started his career at WTHI-TV in January 2004. He started as a videographer and editor before moving to the digital team in 2007.Download the News 10 and Storm Team 10 apps here. Chris started his career at WTHI-TV in January 2004. He started as a videographer and editor before moving to the digital team in 2007. Download the News 10 and Storm Team 10 apps here. Chris started his career at WTHI-TV in January 2004. He started as a videographer and editor before moving to the digital team in 2007. Download the News 10 and Storm Team 10 apps here. Author facebook Author twitter Author email Jul 7, 2023 Jul 7, 2023UpdatedApr 16, 2025 0 Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Copy article link Save Has a person or a business significantly had a positive impact on you or someone you know? WTHI-TV has teamed up with Andrews Heating & Air Conditioning to honor those people with a Make a Difference Award. We need your help recognizing them for their hard work. All you have to do is submit a nomination below. We will spotlight that person or business each month for making a positive impact. Facebook Twitter WhatsApp SMS Email Print Copy article link Save Digital Director Chris started his career at WTHI-TV in January 2004. He started as a videographer and editor before moving to the digital team in 2007.Download the News 10 and Storm Team 10 apps here. Chris started his career at WTHI-TV in January 2004. He started as a videographer and editor before moving to the digital team in 2007. Download the News 10 and Storm Team 10 apps here. Chris started his career at WTHI-TV in January 2004. He started as a videographer and editor before moving to the digital team in 2007. Download the News 10 and Storm Team 10 apps here. Author facebook Author twitter Author email {{description}} Email notifications are only sent once a day, and only if there are new matching items. **More From News 10** UpdatedApr 4, 2024 UpdatedMay 3, 2023 UpdatedNov 15, 2023 UpdatedMar 7, 2024 UpdatedDec 10, 2021 UpdatedJul 1, 2022 **Recommended for you** Facebook Twitter Instagram News Weather Sports Video Features Report It Watch Now Contact Search Digital Marketing FCC Public Inspection File Careers EEO Report Child Programming FCC Applications Advertiser Payments AI Usage Policy Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}