{"id": 950, "name": "Nature", "domain": "nature.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://www.nature.com/openresearch/about-open-access/information-for-institutions", "title": "Information For Institutions", "content": "SearchSearch CN (Chinese) DE (German) ES (Spanish) FR (Français) JP (Japanese) Open scienceHomeProductsOpen scienceAuthorsEditorsPeer ReviewersPoliciesLibrariansResearch & DevelopmentBooksellersSocietiesPartners & AffiliatesShopWhat we doContact-------Careers ↗Investors ↗Media ↗Corporate Site ↗ HomeProductsOpen scienceAuthorsEditorsPeer ReviewersPoliciesLibrariansResearch & DevelopmentBooksellersSocietiesPartners & AffiliatesShopWhat we doContact-------Careers ↗Investors ↗Media ↗Corporate Site ↗ Home Products Open science Authors Editors Peer Reviewers Policies Librarians Research & Development Booksellers Societies Partners & Affiliates Shop What we do Contact ------- ------- Careers ↗ Investors ↗ Media ↗ Corporate Site ↗ HomeProductsOpen scienceAuthorsEditorsPeer ReviewersPoliciesLibrariansResearch & DevelopmentBooksellersSocietiesPartners & AffiliatesShopWhat we doContact-------Careers ↗Investors ↗Media ↗Corporate Site ↗ Home Products Open science Authors Editors Peer Reviewers Policies Librarians Research & Development Booksellers Societies Partners & Affiliates Shop What we do Contact ------- ------- Careers ↗ Investors ↗ Media ↗ Corporate Site ↗ Home Products Open science Authors Editors Peer Reviewers Policies Librarians Research & Development Booksellers Societies Partners & Affiliates Shop What we do Contact ------- ------- ------- Careers ↗ Investors ↗ Media ↗ Corporate Site ↗ About open scienceFundamentals of open researchGold or Green routes to open researchBenefits of open researchOpen research timelineWhitepapersContact usAbout overview Fundamentals of open researchGold or Green routes to open research Fundamentals of open research Gold or Green routes to open research Benefits of open researchOpen research timeline Benefits of open research Open research timeline WhitepapersContact usAbout overview Whitepapers Contact us About overview Fundamentals of open researchGold or Green routes to open research Fundamentals of open research Gold or Green routes to open research Fundamentals of open research Gold or Green routes to open research Benefits of open researchOpen research timeline Benefits of open research Open research timeline Benefits of open research Open research timeline WhitepapersContact usAbout overview Whitepapers Contact us About overview Whitepapers Contact us About overview OA Journals & booksJournalsJournal pricing FAQsBooksPublishing an OA bookJournals & books overview JournalsJournal pricing FAQs Journals Journal pricing FAQs BooksPublishing an OA bookJournals & books overview Books Publishing an OA book Journals & books overview JournalsJournal pricing FAQs Journals Journal pricing FAQs Journals Journal pricing FAQs BooksPublishing an OA bookJournals & books overview Books Publishing an OA book Journals & books overview Books Publishing an OA book Journals & books overview Funding & supportOA article fundingArticle OA funding and policy guidanceOA book fundingBook OA funding and policy guidanceFunding & support overview OA article fundingArticle OA funding and policy guidance OA article funding Article OA funding and policy guidance OA book fundingBook OA funding and policy guidanceFunding & support overview OA book funding Book OA funding and policy guidance Funding & support overview OA article fundingArticle OA funding and policy guidance OA article funding Article OA funding and policy guidance OA article funding Article OA funding and policy guidance OA book fundingBook OA funding and policy guidanceFunding & support overview OA book funding Book OA funding and policy guidance Funding & support overview OA book funding Book OA funding and policy guidance Funding & support overview Open access agreements Data Open access policiesSpringer Nature journal policiesAPC waivers and discountsSpringer Nature book policiesPublication policies overview Springer Nature journal policiesAPC waivers and discounts Springer Nature journal policies APC waivers and discounts Springer Nature book policiesPublication policies overview Springer Nature book policies Publication policies overview Springer Nature journal policiesAPC waivers and discounts Springer Nature journal policies APC waivers and discounts Springer Nature journal policies APC waivers and discounts Springer Nature book policiesPublication policies overview Springer Nature book policies Publication policies overview Springer Nature book policies Publication policies overview **Open access agreements** Information for authors Publishing your article open access (OA) can bring you several benefits, including increased downloads and citations—and make your research more accessible to readers globally. To help you take advantage of these benefits, many institutions cover researchers’ OA publishing costs (known as article processing charges, or APCs) as part of OA agreements with Springer Nature. **Upcoming author webinars** **Upcoming author webinars** **Paying for OA APCs through your institution** Publishing your article through an OA agreement is the easiest route to OA for eligible authors **Financial support for APCs** Many institutions offer financial support for researchers to pay APCs. One way is through OA agreements with publishers—either on their own or through a consortium agreement across many institutions. Your institution’s OA agreement with Springer Nature may provide: Full APC coverage - 100% of the APC is paid by the institution A percentage discount - e.g. 10% off the list price APC Fixed price coverage - e.g. up to €1,000 paid by the institution. **Different OA agreements include different journals** Institutions take different approaches to how they support their researchers publishing in different journals. Your institution’s agreement with Springer Nature may include journals from across Springer, Nature, BMC, Palgrave, and/or Adis. **Seamlessly integrated in the publishing workflow** Getting your APC paid via an OA agreement is seamlessly integrated into the Springer Nature publishing workflows and led by you, the corresponding author. Your article will be identified as part of an agreement based on details submitted. After your article has been accepted for publication, you will be notified of your coverage options and prompted to confirm your OA licensing on behalf of all co-authors.Explore the steps in detail. **OA agreements by region** Find out more about the terms of your agreement on the agreement webpages or by contacting your library or research office. **Region** **Africa** Egypt Saudi Arabia South Africa, Botswana & Namibia Australia & New Zealand -CAUL Consortium -Commonwealth Scientific and Industrial Research Organisation (CSIRO) -University of Otago -Victorian Health Libraries Consortium (VHLC) -Western Australian Hospitals China Hong Kong India -Department of Atomic Energy (DAE), Government of India -MAHE, Manipal institution Indonesia Israel Japan Korea (South) -Chung-Ang University -Daegu Gyeongbuk Institute of Science and Technology (DGIST) -Korea Advanced Institute of Science and Technology (KAIST) -Pohang University of Science and Technology (Postech) -Seoul National University -Sung Kyun Kwan University (SKKU) -Ulsan National Institute of Science and Technology (UNIST) Malaysia Qatar Taiwan Thailand Türkiye Austria Cyprus Czech Republic Denmark Finland France Germany -Projekt DEAL -Germany - Nature TA Greece Hungary Ireland Italy Malta Netherlands Norway Poland Portugal Romania Slovakia Slovenia Spain Sweden Switzerland United Kingdom Brazil Chile Colombia Mexico -Benemérita Universidad Autónoma de Puebla (BUAP) -Cinvestav -National Autonomous University of Mexico (UNAM) -Universidad Autónoma de Baja California -Universidad Autónoma Metropolitana Peru Trinidad & Tobago Venezuela Canada Federal Science Libraries Network Canada United States of America **Upcoming author webinars** Pan-Europe 18 June 2025: Research Integrity 25 June 2025: Real world examples of accepted and rejected submissions Australia and New Zealand 01 July 2025: AI in Scientific Writing 08 July 2025: Understanding the Peer Review Process 15 July 2025: Research Integrity Essential - What Every Researchers Should Know Japan 02 July 2025: The Present and Future of Open Access Publishing: Transformative Agreements Accelerating the Visibility of Research 09 July 2025: Generative AI in Academic Writing and Publishing 16 July 2025: An Editor’s Perspective on Efficient Journal Publishing 23 July 2025: Upholding Research Integrity at Springer Nature **Learn more about** **Open research at Springer Nature** **Open research at Springer Nature** **Benefits of open research** **Benefits of open research** **Green or Gold routes to open access** **Green or Gold routes to open access** **The fundamentals of open access and open research** **The fundamentals of open access and open research** **Stay up to date** Here to foster information exchange with the library community Here to foster information exchange with the library community Connect with us on LinkedIn and stay up to date with news and development. Connect with us on LinkedIn and stay up to date with news and development. Journals Books Platforms Databases Authors Editors Open science Societies Partners & Affiliates Policies Overview Products Licensing Tools & Services Account Development Blog Sales and account contacts Overview About us Careers Education Professional Media Centre Locations & Contact Contact Shop About usWe are a world leading research, educational and professional publisher. Visit our main website for more information.Corporate site ↗ **About us** We are a world leading research, educational and professional publisher. Visit our main website for more information. **About us** We are a world leading research, educational and professional publisher. Visit our main website for more information. _ _ small_youtube © 2025 Springer Nature General terms and conditions Privacy Your US State Privacy Rights Your Privacy Choices / Manage Cookies Accessibility Legal notice Help us to improve this site, send feedback."}