{"id": 911, "name": "Military.com", "domain": "military.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.military.com/join-military/military-ranks-everything-you-need-know.html", "title": "Military Ranks Everything You Need Know.html", "content": "ProfileProfileResumesCover LettersJobs I've Applied ToSaved JobsSaved SearchesSubscriptionsLog out Profile Resumes Cover Letters Jobs I've Applied To Saved Jobs Saved Searches Subscriptions Log out Profile Resumes Cover Letters Jobs I've Applied To Saved Jobs Saved Searches Subscriptions Log out NewsNews HomeArmyNavyAir ForceMarine CorpsCoast GuardSpace ForceMilitary PodcastsOpinionVideos News Home Army Navy Air Force Marine Corps Coast Guard Space Force Military Podcasts Opinion Videos News Home Army Navy Air Force Marine Corps Coast Guard Space Force Military Podcasts Opinion Videos BenefitsBenefits HomeMilitary Pay and MoneyGI BillVeteran Health CareTricareVA LoansInsuranceRetirementVA eBenefits Benefits Home Military Pay and Money GI Bill Veteran Health Care Tricare VA Loans Insurance Retirement VA eBenefits Benefits Home Military Pay and Money GI Bill Veteran Health Care Tricare VA Loans Insurance Retirement VA eBenefits Veteran JobsVeteran Job SearchUpload Your ResumeVeteran Employment ProjectVet Friendly EmployersCareer Advice Veteran Job Search Upload Your Resume Veteran Employment Project Vet Friendly Employers Career Advice Veteran Job Search Upload Your Resume Veteran Employment Project Vet Friendly Employers Career Advice Military LifeMilitary Life HomeMoneyOff DutyFitnessMilitary Trivia GameVeterans DaySpouse & FamilyDeploymentMilitary History Military Life Home Money Off Duty Fitness Military Trivia Game Veterans Day Spouse & Family Deployment Military History Military Life Home Money Off Duty Fitness Military Trivia Game Veterans Day Spouse & Family Deployment Military History DiscountsDiscounts HomeFeatured DiscountsVeterans Day Restaurant DiscountsDiningTravelRetailInsuranceServicesAutoElectronics Discounts Home Featured Discounts Veterans Day Restaurant Discounts Dining Travel Retail Insurance Services Auto Electronics Discounts Home Featured Discounts Veterans Day Restaurant Discounts Dining Travel Retail Insurance Services Auto Electronics Join the MilitaryJoin the Military HomeASVABContact a RecruiterMilitary FitnessBenefits Join the Military Home ASVAB Contact a Recruiter Military Fitness Benefits Join the Military Home ASVAB Contact a Recruiter Military Fitness Benefits Profile Resumes Cover Letters Jobs I've Applied To Saved Jobs Saved Searches Subscriptions Log out ProfileProfileResumesCover LettersJobs I've Applied ToSaved JobsSaved SearchesSubscriptionsLog out Profile Resumes Cover Letters Jobs I've Applied To Saved Jobs Saved Searches Subscriptions Log out Profile Resumes Cover Letters Jobs I've Applied To Saved Jobs Saved Searches Subscriptions Log out NewsNews HomeArmyNavyAir ForceMarine CorpsCoast GuardSpace ForceMilitary PodcastsOpinionVideos News Home Army Navy Air Force Marine Corps Coast Guard Space Force Military Podcasts Opinion Videos News Home Army Navy Air Force Marine Corps Coast Guard Space Force Military Podcasts Opinion Videos BenefitsBenefits HomeMilitary Pay and MoneyGI BillVeteran Health CareTricareVA LoansInsuranceRetirementVA eBenefits Benefits Home Military Pay and Money GI Bill Veteran Health Care Tricare VA Loans Insurance Retirement VA eBenefits Benefits Home Military Pay and Money GI Bill Veteran Health Care Tricare VA Loans Insurance Retirement VA eBenefits Veteran JobsVeteran Job SearchUpload Your ResumeVeteran Employment ProjectVet Friendly EmployersCareer Advice Veteran Job Search Upload Your Resume Veteran Employment Project Vet Friendly Employers Career Advice Veteran Job Search Upload Your Resume Veteran Employment Project Vet Friendly Employers Career Advice Military LifeMilitary Life HomeMoneyOff DutyFitnessMilitary Trivia GameVeterans DaySpouse & FamilyDeploymentMilitary History Military Life Home Money Off Duty Fitness Military Trivia Game Veterans Day Spouse & Family Deployment Military History Military Life Home Money Off Duty Fitness Military Trivia Game Veterans Day Spouse & Family Deployment Military History DiscountsDiscounts HomeFeatured DiscountsVeterans Day Restaurant DiscountsDiningTravelRetailInsuranceServicesAutoElectronics Discounts Home Featured Discounts Veterans Day Restaurant Discounts Dining Travel Retail Insurance Services Auto Electronics Discounts Home Featured Discounts Veterans Day Restaurant Discounts Dining Travel Retail Insurance Services Auto Electronics Join the MilitaryJoin the Military HomeASVABContact a RecruiterMilitary FitnessBenefits Join the Military Home ASVAB Contact a Recruiter Military Fitness Benefits Join the Military Home ASVAB Contact a Recruiter Military Fitness Benefits Join the Military ASVAB Contact a Recruiter Navy Advancement Exam Military Fitness Benefits Join the Military **Military Ranks: Everything You Need to Know** Understanding military ranks can be tricky, especially when it comes to knowing the military ranks in order. Some of the military services -- theArmy,Air ForceandMarine Corps-- have their own enlisted military rank structures; theCoast GuardandNavygenerally mirror each other; and theSpace Forcerelies on the Air Force rank system with the exception of specialists, who replaced airmen. A service member'smilitary rankdoesn't just determine their level of responsibility, but also theirpay. That's why each service's ranks are tied to paygrades in an \"enlisted,\" \"warrant officer\" and \"officer\" number system, written as the letters \"E,\" \"W,\" \"O\" and a number. For example, the lowest military enlisted rank is \"E-1,\" while the highest military officer rank in use is \"O-10.\" While each service may call them something different, they all can be boiled down to \"E\" and \"O.\" The only rank names and abbreviations that are exactly the same across all services who use them are those for warrant officers. Related:Calculate your military pay These military ranks are displayed on service memberuniformsthrough a series of symbols, such as chevrons, stripes, stars and bars. **What Are the Military Ranks?** To learn the military ranks, you need to know what each service specifically calls the E and O levels, their abbreviations andhow they look in the symbols, also known as insignias. For officers, Air Force, Army and Marine Corps symbols are largely the same, while the Navy and Coast Guard generally mirror each other. The rank symbols can vary broadly for enlisted troops, with the Marine Corps and Army having many commonalities, and the Coast Guard and Navy again mirroring each other. Additionally, while all the military services stick to the same paygrade structure, the Navy and Coast Guard organize their enlisted ranks in a \"rate\" system. Learn more aboutNavy enlisted ratesandCoast Guard enlisted rates. **What Is the Highest Military Rank?** Generally, the highest U.S. military rank is O-10, or a four-star general. A five-star rank, created during World War II, was meant to be reserved for wartime or exceptional circumstances. Only nine Americans ever have held this rank. The last living five-star general was Omar Bradley, who died in 1981. **Army Ranks** The best way to understand Army ranks in order is to see each pay grade paired with what the service calls the rank and the abbreviation used by the Army. You also can read more details forArmy enlisted ranksandArmy officer ranks. **Paygrade** **Rank** **Military Rank Abbreviation** **Army Enlisted Ranks** **Army Non-Commissioned Officers (NCO) Ranks** Master Sergeant First Sergeant MSG 1SG Sergeant Major Command Sergeant Major SGM CSM **Army Warrant Officer Ranks** **Army Commissioned Officers Ranks** Army Chief of Staff (special) General GEN GEN **Air Force Ranks** The best way to understand Air Force ranks in order is to see each paygrade paired with what the service calls the rank and the abbreviation used by the Air Force. Unlike the other services, the Air Force does not have warrant officers. You can also see more specifics forAir Force enlisted ranksandAir Force officer ranks. **Paygrade** **Rank** **Military Rank Abbreviation** First Sergeant (Chief Master Sergeant) Chief Master Sergeant Air Force Chief of Staff (special) General **Coast Guard and Navy Ranks** Both maritime services, the Navy and Coast Guard use a rank structure that mirrors each other. While the symbols for the ranks used on their uniforms are different shades of blue, if you learn to recognize the ranks for one, you'll know the ranks for the other. You also can see more specifics forNavy enlisted ranks, organized by rates;Navy officer ranks;Coast Guard enlisted ranks and rates; andCoast Guard officer ranks. **Paygrade** **Rank** **Military Rank Abbreviation** Special (Navy) Special (Coast Guard) Master Chief Petty Officer of the Navy Master Chief Petty Officer of the Coast Guard MCPON MCPOCG Chief of Naval Operations (special) Commandant of the Coast Guard (special) Admiral **Marine Corps Ranks** The best way to understand Marine Corps ranks in order is to see each paygrade paired with what the service calls the rank and the abbreviation used by the Marine Corps. You can also read more details forMarine Corps enlisted ranksandMarine Corps officer ranks. **Paygrade** **Rank** **Military Rank Abbreviation** Master Sergeant First Sergeant Mgst 1stSgt Master Gunnery Sergeant Sergeant Major MGySgt SgtMaj Commandant of the Marine Corps General **Space Force Ranks** The best way to understand Space Force ranks in order is to see each paygrade paired with what the service calls the rank and the abbreviation used by the Space Force. You also can read more details forSpace Force enlisted ranksandSpace Force officer ranks. **Paygrade** **Rank** **Military Rank Abbreviation** **Want to Know More About the Military?** Be sure to get the latest news about the military, as well as critical info about how to join and all the benefits of service.Subscribe to Military.comand receive customized updates delivered straight to your inbox. **Amanda Miller** **About Amanda Miller** Amanda Miller is an editor and writer specializing in coverage of military and veteran pay and benefits, along with other financial topics, for Military.com.Read Full Bio **You May Also Like** The Air Force commissions only U.S. citizens with a bachelor's degree. Some career choices require additional academic... The Air Force commissions only U.S. citizens with a bachelor's degree. Some career choices require additional academic... If you're thinking about becoming a Marine Corps officer, there are a few different ways to get there. Whether you're in... If you're thinking about becoming a Marine Corps officer, there are a few different ways to get there. Whether you're in... Whether you're about to finish high school, already in college, or working in a professional field, the Army may have an... Whether you're about to finish high school, already in college, or working in a professional field, the Army may have an... A Navy officer must assume a variety of duties at sea, in the air and ashore. Officers must be physically fit, at least 19... A Navy officer must assume a variety of duties at sea, in the air and ashore. Officers must be physically fit, at least 19... **Military News** Investigations and Features Army Navy Air Force Marine Corps Coast Guard Space Force Military Opinion **Select Service** Army Marines Navy Air Force National Guard Coast Guard Space Force Spouse **Most Popular Military News** The deployment marks a sharp escalation in the military's role in domestic unrest in the city caused by immigration raids by... The deployment marks a sharp escalation in the military's role in domestic unrest in the city caused by immigration raids by... A migrant from Peru has been acquitted in Texas of charges related to trespassing on a newly created military zone along the... A migrant from Peru has been acquitted in Texas of charges related to trespassing on a newly created military zone along the... Military Families for Free Expression has plans for virtual events and \"activations\" in communities around military bases... Military Families for Free Expression has plans for virtual events and \"activations\" in communities around military bases... The plaintiff, Army Spc. Winston Hencely, suffered a serious head injury in the attack. The plaintiff, Army Spc. Winston Hencely, suffered a serious head injury in the attack. After Military.com's reporting, CBS confirmed the defense secretary's plans to rename seven other naval ships who honor civic... After Military.com's reporting, CBS confirmed the defense secretary's plans to rename seven other naval ships who honor civic... **Latest Benefits Info** Maryland State Veteran Benefits Ask the Right Questions Before Choosing a School Military Child Care Fees Checklists for Your PCS Move The Personally Procured Move (PPM): Steps to Take **More Military Headlines** VA doctors and staff worked Sunday to help vulnerable patients -- especially those with mental health conditions or substance... VA doctors and staff worked Sunday to help vulnerable patients -- especially those with mental health conditions or substance... Relatives of the late Lt. Gen. Arthur Gregg and Lt. Col. Charity Adams-Earley anticipated it, but when President Donald Trump... Relatives of the late Lt. Gen. Arthur Gregg and Lt. Col. Charity Adams-Earley anticipated it, but when President Donald Trump... Defense Secretary Pete Hegseth added that \"hopefully\" governors in other states would mobilize their Guards themselves and... Defense Secretary Pete Hegseth added that \"hopefully\" governors in other states would mobilize their Guards themselves and... Defense Secretary Pete Hegseth also \"has authorized the voluntary departure of military dependents from locations\" across the... Defense Secretary Pete Hegseth also \"has authorized the voluntary departure of military dependents from locations\" across the... Germany suspended compulsory military and civilian service in 2011 after 55 years, dismantling all relevant structures. Germany suspended compulsory military and civilian service in 2011 after 55 years, dismantling all relevant structures. **Army** As National Guard Arrived in Los Angeles, VA Docs Scrambled to Make Sure Veteran Patients Received Care 'Deeply Negative Message': Relatives of Fort Gregg-Adams' Namesakes React to Trump Renaming Hegseth Suggests LA-Style Troop Deployments Could Happen Anywhere in US 'if Necessary' **Air Force** SpaceX Plans up to 76 Starship Launches Annually from Old Delta IV Launch Site What it Would Take to Convert a Jet From Qatar into Air Force One to Safely Fly Trump Why One Detroiter Is on a Mission to Honor Tuskegee Airmen and Train Future Pilots **Navy** Yorktown Naval Weapons Station, Dominion Exploring Energy Projects, Including Nuclear Reactor Navy Man Charged with Firing Gun in Downtowns of 2 Connecticut Cities Hegseth Wants to Rename 8 Naval Ships. Here Are the Stories Behind Their Namesakes **Military Benefits Updates** Tricare Patients Fear Losing Preferred Health Care Providers Amid Contract Transition The Next Deadline for Backdated PACT Act Payments Is Coming Soon. Here’s What You Need to Know VA Fertility Benefits for Military Veterans **Marine Corps** California Governor Says 'Democracy Is Under Assault' by Trump as Feds Intervene in LA Protests California Governor Asks Court to Block Trump Administration from Using Troops in Immigration Raids Hegseth, Democrats Tangle over Troop Deployments to Los Angeles **Coast Guard** Construction of $150M Coast Guard Museum Set to Begin Next Month as Donations Rise Coast Guard Helps Rescue Crew After Vehicle Cargo Ship Catches Fire Coasties Braved Withering German Fire to Put Troops Ashore on D-Day **Entertainment** How Aviation Helps the Army Fulfill its Mission How a Military Veteran's Experience in Vietnam Inspired Him to Write 'Cast Away' Ken Burns Reveals Why He Chose to Tell the Story of 'The American Revolution' ProfileProfileResumesCover LettersJobs I've Applied ToSaved JobsSaved SearchesSubscriptionsLog out Profile Resumes Cover Letters Jobs I've Applied To Saved Jobs Saved Searches Subscriptions Log out Profile Resumes Cover Letters Jobs I've Applied To Saved Jobs Saved Searches Subscriptions Log out NewsNews HomeArmyNavyAir ForceMarine CorpsCoast GuardSpace ForceMilitary PodcastsOpinionVideos News Home Army Navy Air Force Marine Corps Coast Guard Space Force Military Podcasts Opinion Videos News Home Army Navy Air Force Marine Corps Coast Guard Space Force Military Podcasts Opinion Videos BenefitsBenefits HomeMilitary Pay and MoneyGI BillVeteran Health CareTricareVA LoansInsuranceRetirementVA eBenefits Benefits Home Military Pay and Money GI Bill Veteran Health Care Tricare VA Loans Insurance Retirement VA eBenefits Benefits Home Military Pay and Money GI Bill Veteran Health Care Tricare VA Loans Insurance Retirement VA eBenefits Veteran JobsVeteran Job SearchUpload Your ResumeVeteran Employment ProjectVet Friendly EmployersCareer Advice Veteran Job Search Upload Your Resume Veteran Employment Project Vet Friendly Employers Career Advice Veteran Job Search Upload Your Resume Veteran Employment Project Vet Friendly Employers Career Advice Military LifeMilitary Life HomeMoneyOff DutyFitnessMilitary Trivia GameVeterans DaySpouse & FamilyDeploymentMilitary History Military Life Home Money Off Duty Fitness Military Trivia Game Veterans Day Spouse & Family Deployment Military History Military Life Home Money Off Duty Fitness Military Trivia Game Veterans Day Spouse & Family Deployment Military History DiscountsDiscounts HomeFeatured DiscountsVeterans Day Restaurant DiscountsDiningTravelRetailInsuranceServicesAutoElectronics Discounts Home Featured Discounts Veterans Day Restaurant Discounts Dining Travel Retail Insurance Services Auto Electronics Discounts Home Featured Discounts Veterans Day Restaurant Discounts Dining Travel Retail Insurance Services Auto Electronics Join the MilitaryJoin the Military HomeASVABContact a RecruiterMilitary FitnessBenefits Join the Military Home ASVAB Contact a Recruiter Military Fitness Benefits Join the Military Home ASVAB Contact a Recruiter Military Fitness Benefits **Military.com Network** Air Force Army Coast Guard Marine Corps National Guard Navy Space Force **About Military.com** About Us & Press Room Mobile Apps RSS Advertise with Us Reprints & Permissions Subscriptions User Agreement Privacy Policy Your Privacy Choices Site Map **Need customer support?** Visit our Customer Support center for solutions or to contact us."}