{"id": 1734, "name": "Higher Perspective", "domain": "higherperspectives.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.higherperspectives.com/technology-and-pyramids-found-under-the-bermuda-triangle-are-not-likely-to-have-originated-on-planet-earth-2657211142.html", "title": "Technology And Pyramids Found Under The Bermuda Triangle Are Not Likely To Have Originated On Planet Earth 2657211142.html", "content": "Relationships Astrology Spirituality Psychology Uplifting Search for: Relationships Astrology Spirituality Psychology Uplifting About Contact Copyright Privacy Terms **Technology And Pyramids Found Under The Bermuda Triangle Are Not Likely To Have Originated On Planet Earth** We tend to live in our own little bubble and get accustomed to the world that makes our environment, that we forget that there is a whole big world out there far greater than anything we can imagine. In reality, we don’t even have the capacity to understand the depth and the complexity that creates the world around us. There is still so much that we don’t know. No matter how far our technology advances, we still can’t figure out some of our world’s mysteries, namely the mysterious body of water where many ships have disappeared, never to be found. There are many stories surrounding the Bermuda trinagle , yet no one actually knows what lives within those waters. New findings allude to technology that isn’t even known to our modern science. Could there be some supernatural, or outwardly force at work? **Known As “Th Devil’s Traingle”** Bettmann / Getty Images Bettmann / Getty Images The Bermuda Triangle, also known as the “Devil’s Triangle“ is located in the western part of the North Atlantic Ocean and is defined by points in Bermuda, Florida and Puerto Rico. The region covers about a thousand miles on any given side. Numerous planes and ships that have attempted to go over have been reported mysteriously missing and none of the occupants were found again. No one knows why. Yet, the US Navy says that the Bermuda Triangle doesn’t even exist. In fact, the name is not recognized by the US Board on Geographic Names. Could they be hiding something? According to an oceanographer, it’s possible that there is really special technology hiding underneath that region of the ocean. It’s claimed however that the origins of that technology are not from Earth… **Elevate Your Inbox** Sign up for weekly affirmations and articles delivered directly to your inbox. All fields are required. About Contact Copyright Privacy Terms"}