{"id": 214, "name": "WISC - Madison News", "domain": "channel3000.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.channel3000.com/news/national-and-world-news/", "title": "National And World News", "content": "About Us Advertise Apps Email Newsletters & Alerts Meet the Team Request Story Removal Submit a News Tip What's on WISC-TV Latest Newscasts Television Wisconsin Apostolate for Persons with Disabilities Local News National & World Crime Investigative Reports Politics 3 For The People: Election 2025 For the Record Education Food & Recipes Health Environment Entertainment Health In the 608 Time for Kids Pets & Animals Technology Shareable Stories Forecast Radar School Closings & Delays Weather Alerts Traffic Beyond the Barometer Plan My Day/Hey, Alex! Upland Hills Health Weathercam - Dodgeville Edgewater Weathercam - Madison Janesville Nissan Weathercam QueenB Radio Weathercam - Platteville WISC-TV Weathercam Badgers Packers Brewers Bucks High School Sports Coach of the Week The Final Drive Badger Blueprint Dining & Drink Best of Madison Home & Lifestyle Arts & Culture Columns City Life About Us Sponsored Content Subscribe Events Facebook Twitter LinkedIn YouTube TikTok Instagram Reddit Email iOS App Android App OTT Live stream **Madison man arrested for allegedly posting terrorist threats online** **Crash reported at Summit Credit Union in Cottage Grove** **Jury convicts Harvey Weinstein of top charge in the retrial of his landmark #MeToo sex crimes case** **Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82** 87° Site searchSearch Site searchSearch Site searchSearch Madison News Weather Wisconsin Huddle Obituaries Packers Best of Madison **Channel 3000+ News** Live updates all day, breaking news as it happens and weather every 10 minutes Resize: **In the 608: Madison Night Mares opening season on Thursday night** **In the 608: Madison Night Mares opening season on Thursday night** **In the 608: Madison Night Mares to open season on Thursday night** **In the 608: Madison Night Mares to open season on Thursday night** **Family fights for lost Medicaid benefits for 6-year-old with chronic illnesses** **Family fights for lost Medicaid benefits for 6-year-old with chronic illnesses** **National and World News** 8 mins ago The Gaza Health Ministry says that the Palestinian death toll from the Israel-Hamas war has climbed past 55,000. The ministry doesn’t distinguish between civilians and…Read MoreMore than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say 30 mins ago 👋 Welcome to 5 Things PM! Forgetting things is frustrating, but humans aren’t designed to remember everything. An expert offers five tips to improve your memory of th…Read MoreLA protest weapons, extreme winter weather, protein in coffee: Catch up on the day’s stories 3 hrs ago Former movie mogul Harvey Weinstein has been convicted of one of the top charges in his sex crimes retrial. But the former movie mogul was also acquitted Wednesday of …Read MoreJury convicts Harvey Weinstein of top charge in the retrial of his landmark #MeToo sex crimes case 4 hrs ago Click here for updates on this storyRead MoreInvasive wild boars population rising in Bay Area with reports of more 'scary' sightings, damage 4 hrs ago (CNN) — Brian Wilson, cofounder of The Beach Boys and the creative force behind the group’s surf sound, orchestral arrangements and perfect harmonies, has died, his fa…Read MoreBrian Wilson, music icon and creative force behind The Beach Boys, dead at 82 4 hrs ago Brian Wilson of the Beach Boys has died at 82. One of the world’s most beloved and influential musicians, his family posted news of his death to his website Wednesday.… 5 hrs ago Disney and Universal have filed a copyright lawsuit against popular artificial intelligence image-generator Midjourney on Wednesday, marking the first time major Holly… 5 hrs ago Click here for updates on this story 7 hrs ago Hong Kong (CNN) — The United States and China have agreed on a framework to implement their trade truce, officials on both sides said Wednesday, after concluding two d… 8 hrs ago Khaby Lame, the world's most popular TikTok personality with millions of followers, left the U.S. after immigration agents detained him in Las Vegas for allegedly over… 8 hrs ago Click here for updates on this story 8 hrs ago Click here for updates on this story 8 hrs ago (CNN) — Inflation rose less than expected in May, a month when the effects of higher tariffs were starting to become more widespread. **Most Popular** Aaron Rodgers announces marriage Culver's introduces new chicken sandwich lineup 2-year-old injured in Rock County crash dies, family confirms UTV driver sustains life-threatening injuries in rollover crash Dane County completes major Highway M construction project, improving safety and access 9 hrs ago (CNN) — Scientists studying ancient human remains uncovered in Colombia have found that the people they were researching have no known ancestors or modern descendants. 9 hrs ago Musk's break with Trump appeared to put an end to his influence in the White House and prompted concerns about effects on his companies. 9 hrs ago MADISON, Wis. -- The Wisconsin Democracy Campaign and two Wisconsin voters are suing Elon Musk, alleging payments offered to voters during the state's Supreme Court race earlier this year amount to bribery. Digital Content Manager 10 hrs ago New York (CNN) — Nintendo announced Wednesday that it sold more than 3.5 million Switch 2 consoles, marking a new record for the company. 10 hrs ago (CNN) — The US Army announced on Tuesday that it plans to restore the names of seven bases that previously honored Confederate leaders. The names being brought back are: Fort Pickett, Fort Hood, Fort Gordon, Fort Rucker, Fort Polk, Fort A.P. … 11 hrs ago (CNN) — Democratic politicians have spent the last few months talking about standing up to President Donald Trump in his second term. California Gov. Gavin Newsom is among the first faced with figuring out what standing up actually looks like. 13 hrs ago London (CNN) — Elon Musk said Wednesday that he regrets some of his recent social media posts about President Donald Trump. 17 hrs ago (CNN) — President Donald Trump said Tuesday that he plans to phase out the Federal Emergency Management Agency after this year’s hurricane season, offering the clearest timeline yet for his administration’s long-term plans to dismantle the di… **Latest News** More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Legislative Black Caucus prepares for annual Juneteenth celebration Wisconsin Dells police K9 recovering after mass found on spleen Milwaukee County Zoo to close Small Mammals Building by end of year Beloit man sentenced to 4 years in prison for possessing child sexual abuse materials More News 17 hrs ago (CNN) — More than 90% of samples of a dozen fruits and vegetables tested positive for potentially harmful pesticide residues, according to the 2025 Shopper’s Guide to Pesticides in Produce. 17 hrs ago Israel has deported activist Greta Thunberg a day after Israel's military seized the Gaza-bound ship she was on. Thunberg spoke in Paris on Tuesday and described a “quite chaotic and uncertain” situation during the detention. She was one of 1… 20 hrs ago Mayor Karen Bass has issued a curfew for downtown Los Angeles on Tuesday “to stop the vandalism, to stop the looting.” She said in a news conference that she had declared a local emergency and that the curfew will run from 8 p.m. Tuesday unti… 21 hrs ago Parsippany, NJ (CNN) — Mikie Sherrill, a four-term Democratic congresswoman, and former Republican state Rep. Jack Ciattarelli have won their parties’ nominations for New Jersey governor, according to projections from CNN’s Decision Desk. 21 hrs ago Click here for updates on this story 21 hrs ago The Associated Press has asked for a full hearing before the U.S. Court of Appeals in Washington, seeking to overturn last week's decision by three judges of that court that continues to allow the Trump administration to restrict the outlet's… 22 hrs ago (CNN) — General Motors said on Tuesday that it would invest $4 billion into three US plants to boost production of gas and electric vehicles, as a 25% tariff on imported cars by President Donald Trump threatens the bottom lines of automakers … 22 hrs ago (CNN) — Offline, in real-world Los Angeles, most Angelenos are having a perfectly normal day. But online, the fires and riots are still raging. Dec 31, 1969 1 min to consume {{summary}} {{title}} Facebook Twitter LinkedIn YouTube TikTok Instagram Reddit Email iOS App Android App OTT Live stream Watch Now! View Archive Advertise Email Alerts Submission Forms Events Contests Search News Weather Sports Obituaries Lifestyle Television Wisconsin Madison Magazine Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}