{"id": 297, "name": "Cold Spring Harbor Laboratory", "domain": "cshl.edu", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.cshl.edu/education/center-for-humanities/grants-fellowships/sydney-brenner-research-fellowship/", "title": "Sydney Brenner Research Fellowship", "content": "About UsContact UsDirectionsLeadershipCSHL PresidentCSHL Chief Operating OfficerAdministrative DepartmentsBoard of TrusteesDivisionsSize and Reach: 2023Annual ReportsHistoryA Lab Like No OtherDiscoveries TimelineInstitutes & Directors TimelineNobel Prize WinnersHow one family secured the future of a laboratoryGood genes, bad scienceOffice of Diversity, Equity, & Inclusion Contact Us Directions Leadership CSHL President CSHL Chief Operating Officer Administrative Departments Board of Trustees Divisions Size and Reach: 2023 Annual Reports HistoryA Lab Like No OtherDiscoveries TimelineInstitutes & Directors TimelineNobel Prize WinnersHow one family secured the future of a laboratoryGood genes, bad science A Lab Like No Other Discoveries Timeline Institutes & Directors Timeline Nobel Prize Winners How one family secured the future of a laboratory Good genes, bad science Office of Diversity, Equity, & Inclusion Contact Us Directions Leadership CSHL President CSHL Chief Operating Officer Administrative Departments Board of Trustees Divisions Size and Reach: 2023 Annual Reports HistoryA Lab Like No OtherDiscoveries TimelineInstitutes & Directors TimelineNobel Prize WinnersHow one family secured the future of a laboratoryGood genes, bad science A Lab Like No Other Discoveries Timeline Institutes & Directors Timeline Nobel Prize Winners How one family secured the future of a laboratory Good genes, bad science A Lab Like No Other Discoveries Timeline Institutes & Directors Timeline Nobel Prize Winners How one family secured the future of a laboratory Good genes, bad science Office of Diversity, Equity, & Inclusion EventsEvent CalendarLecturesConcertsTour CSHL Event Calendar Lectures Concerts Tour CSHL Event Calendar Lectures Concerts Tour CSHL NewsCSHL Stories and MediaNewsFeaturesHarborScopeBlogLabDishBlogFor the MediaHarbor TranscriptmagazineNewsletterPodcastsVideo LibraryLogos/Graphic identity guidelines CSHL Stories and MediaNewsFeatures News Features HarborScopeBlog LabDishBlog For the Media Harbor Transcriptmagazine Newsletter Podcasts Video Library Logos/Graphic identity guidelines CSHL Stories and MediaNewsFeatures News Features News Features HarborScopeBlog LabDishBlog For the Media Harbor Transcriptmagazine Newsletter Podcasts Video Library Logos/Graphic identity guidelines Partner With UsBusiness Development & Technology TransferTechnology Transfer ResourcesOffice of ProcurementOffice of Sponsored Programs/GrantsPreprints Business Development & Technology TransferTechnology Transfer Resources Technology Transfer Resources Office of Procurement Office of Sponsored Programs/Grants Preprints Business Development & Technology TransferTechnology Transfer Resources Technology Transfer Resources Technology Transfer Resources Office of Procurement Office of Sponsored Programs/Grants Preprints Careers GivingDonate NowAnnual GivingPlanned GivingFunds & EndowmentGiving CalendarDouble Helix Medals dinnerAttendPress PackageDouble Helix Medals Dinner VideoPast DHMDCSHL’s 29th Annual Golf TournamentWomen’s Partnership for ScienceCSHL Association DirectorsCorporate Advisory BoardHonor Roll of DonorsLocal SupportNewsHistoryContact Giving Donate Now Annual Giving Planned Giving Funds & Endowment Giving Calendar Double Helix Medals dinnerAttendPress PackageDouble Helix Medals Dinner VideoPast DHMD Attend Press Package Double Helix Medals Dinner Video Past DHMD CSHL’s 29th Annual Golf Tournament Women’s Partnership for Science CSHL Association Directors Corporate Advisory Board Honor Roll of Donors Local Support News History Contact Giving Donate Now Annual Giving Planned Giving Funds & Endowment Giving Calendar Double Helix Medals dinnerAttendPress PackageDouble Helix Medals Dinner VideoPast DHMD Attend Press Package Double Helix Medals Dinner Video Past DHMD Attend Press Package Double Helix Medals Dinner Video Past DHMD CSHL’s 29th Annual Golf Tournament Women’s Partnership for Science CSHL Association Directors Corporate Advisory Board Honor Roll of Donors Local Support News History Contact Giving Education ProgramsUndergraduate Research ProgramPartners for the FutureCSHL Graduate ProgramPostdoc ResourcesCenter for Humanities & History of Modern Biology Undergraduate Research Program Partners for the Future CSHL Graduate Program Postdoc Resources Center for Humanities & History of Modern Biology Undergraduate Research Program Partners for the Future CSHL Graduate Program Postdoc Resources Center for Humanities & History of Modern Biology Faculty Research Banbury Center CSHL Press DNA Learning Center Meetings & Courses Ph.D. Program **Education** Partners for the FuturePartners for the Future Alumni Partners for the Future Alumni Partners for the Future Alumni Science Careers and Opportunities in Policy and Education Science, Technology, and Research Scholars Program Undergraduate Research ProgramURP Alumni 2024URP Alumni 2023URP Alumni 2022URP Alumni 2021 URP Alumni 2024 URP Alumni 2023 URP Alumni 2022 URP Alumni 2021 URP Alumni 2024 URP Alumni 2023 URP Alumni 2022 URP Alumni 2021 CSHL Graduate Program Postbaccalaureate Research Education Program Postdoc Resources Center for Humanities & History of Modern BiologyCarnegie BuildingCenter’s EventsDirectors of CSHLExhibits, Projects and InitiativesTraveling ExhibitGrants & FellowshipsCelia and Wally Gilbert Artist-in-Residence ProgramEllen Brenner Memorial FellowshipEllen Brenner Memorial InternshipInternships for graduate studentsResearch Travel GrantsSydney Brenner Research FellowshipThe Gardiner Young Scholars ProgramResearch FellowsResearch OpportunityHistory of Science MeetingsInternational catalog of Human Genome Project historyWaclaw Szybalski Lecture Series Carnegie Building Center’s Events Directors of CSHL Exhibits, Projects and InitiativesTraveling Exhibit Traveling Exhibit Grants & FellowshipsCelia and Wally Gilbert Artist-in-Residence ProgramEllen Brenner Memorial FellowshipEllen Brenner Memorial InternshipInternships for graduate studentsResearch Travel GrantsSydney Brenner Research FellowshipThe Gardiner Young Scholars ProgramResearch FellowsResearch Opportunity Celia and Wally Gilbert Artist-in-Residence Program Ellen Brenner Memorial Fellowship Ellen Brenner Memorial Internship Internships for graduate students Research Travel Grants Sydney Brenner Research Fellowship The Gardiner Young Scholars Program Research Fellows Research Opportunity History of Science Meetings International catalog of Human Genome Project history Waclaw Szybalski Lecture Series Carnegie Building Center’s Events Directors of CSHL Exhibits, Projects and InitiativesTraveling Exhibit Traveling Exhibit Traveling Exhibit Grants & FellowshipsCelia and Wally Gilbert Artist-in-Residence ProgramEllen Brenner Memorial FellowshipEllen Brenner Memorial InternshipInternships for graduate studentsResearch Travel GrantsSydney Brenner Research FellowshipThe Gardiner Young Scholars ProgramResearch FellowsResearch Opportunity Celia and Wally Gilbert Artist-in-Residence Program Ellen Brenner Memorial Fellowship Ellen Brenner Memorial Internship Internships for graduate students Research Travel Grants Sydney Brenner Research Fellowship The Gardiner Young Scholars Program Research Fellows Research Opportunity Celia and Wally Gilbert Artist-in-Residence Program Ellen Brenner Memorial Fellowship Ellen Brenner Memorial Internship Internships for graduate students Research Travel Grants Sydney Brenner Research Fellowship The Gardiner Young Scholars Program Research Fellows Research Opportunity History of Science Meetings International catalog of Human Genome Project history Waclaw Szybalski Lecture Series Home/Education/Center for Humanities & History of Modern Biology/Grants & Fellowships/Sydney Brenner Research Fellowship **Sydney Brenner Research Fellowship** The Sydney Brenner Research Fellowship, endowed by the Francis Goelet Charitable Trust in 2006, is one of three opportunities offered by the CSHL Center for Humanities & History of Modern Biology. It offers stipends of up to $5,000 to fund travel and other expenses associated with work on a significant research project in the history of the life sciences. Ideal projects will be advanced and broad in scope, with at least some relevance to collections in the Cold Spring Harbor Laboratory Archives. The CSHL collections themselves are very broad in scope, encompassing activity around the world as well as at CSHL and several precursor institutions. Please see descriptions of the CSHL collections at the Archives homepage and consult detailed finding aids onCSHL ArchivesSpace. Applications must be received by August 1st each year to be considered for the upcoming Fall-Spring academic year. Application form (pdf) Mission About the Award How to Apply Award Conditions Previous Awardees Sydney Brenner Research Fellowships are intended to support research and publication (or other exhibition/dissemination) of ambitious, original projects in the history of the life sciences. **Award Benefits** The Sydney Brenner Research Fellowship awards up to $5,000 (USD) to each recipient to support direct costs of completing the proposed project, which should include a period in residence at CSHL. While here, Brenner Fellows will have a work space in the Carnegie Library, complete access to our collections, and support from our team of archivists, librarians, and historians. If space permits, Brenner Fellows will have the opportunity to rent accommodation on campus during their stay. **Who is Eligible?** The fellowship is open to scholars (at any career stage), journalists, writers, filmmakers, and creative artists undertaking substantial research into the history of the life sciences. **How to Apply** The application package must include the following: A completed application form, including names and contact information for two individuals who are familiar with your work and would be willing to provide letters of recommendation upon request from CSHL. A research proposal (see below for detailed instructions). A selected bibliography of titles or collections in the Cold Spring Harbor Laboratory Library and Archives that are relevant to your research proposal. A brief budget statement showing the expenses for which support is requested. A curriculum vitae. Please include education and employment history, dates of study, areas of study, previous publications, and previous or current fellowships, grants, and awards. Please submit applications electronically via email toSydneyBrennerScholarship@cshl.edu. Attach all documents in .pdf, .doc, or .docx formats, with a brief covering letter in the body of the email. Please format the subject line of your email as “Sydney Brenner Research Fellowship application [Year] – [Your Name]” **About the Research Proposal** In a maximum of 1000 words, the proposal should explain your research question or objective, the sources you intend to use (both at CSHL and elsewhere), and the significance of the proposed research to your scholarly trajectory and to your discipline or field. Please specify the items or record groups you would use at the CSHL Library and Archives and give a tentative schedule for completion of your project. Please submit your proposal in double-spaced 12-point font. **Selection Criteria** The Brenner Fellowship committee seeks proposals that are sophisticated, detailed, and original. Relevance of CSHL collections to the project (and vice versa) is an important factor, but the committee’s primary consideration will be the overall quality and significance of the project. If you are still at the initial stages of formulating a project, please consider applying instead for one of our travel grants to visit CSHL. **Announcement of Scholarship Recipients** The Brenner Fellowship committee will notify recipients in August of a given year. **What is Expected of Fellowship Recipients** Brenner Fellowship funds must be used during the academic year following notification of the award (Sept. 1 to July 31). If possible, Brenner Fellows will present preliminary results of their research to the CSHL community in a talk. The research findings should also be presented in professional talks or other venues, and culminate in scholarly articles, book(s), or other forms of creative expression. A copy of the final research output is to be donated to the CSHL Library and Archives. **Allowable Expenses** The stipend can be used for any purpose relating to the scholar’s research project, including travel, transportation, daily expenses, and accommodations at CSHL and other relevant archives, over the course of one year. Other types of permissible expenses include those associated with translating relevant primary sources, recording oral history interviews, transcribing oral history interviews, and microfilming archival materials. Dr. Langer says of the Sydney Brenner Research Scholarship and her time at Cold Spring Harbor Laboratory: My visit to Cold Spring Harbor Laboratory deepened my understanding of my subject matter, not only through the Archives’ preservation of rich source materials relevant to my project but also through the direct experience of the Laboratory setting–its architecture, environment, and celebration of living history. The Archives offers scholars excellent open access to its digitized collections, but I am indebted to the Sydney Brenner Research Scholarship for the unparalleled experience of an in-person visit with the superb help of onsite staff.” The mystery of inheritance has captivated thinkers since antiquity, and the unlocking of this mystery—the development of classical genetics—is one of humanity’s greatest achievements. This great scientific and human drama is the story told fully and for the first time in this book. Acclaimed science writer James Schwartz presents the history of genetics through the eyes of a dozen or so central players, beginning with Charles Darwin and ending with Nobel laureate Hermann J. Muller. In tracing the emerging idea of the gene, Schwartz deconstructs many often-told stories that were meant to reflect glory on the participants and finds that the “official” version of discovery often hides a far more complex and illuminating narrative. The discovery of the structure of DNA and the more recent advances in genome science represent the culmination of one hundred years of concentrated inquiry into the nature of the gene. Schwartz’s multifaceted training as a mathematician, geneticist, and writer enables him to provide a remarkably lucid account of the development of the central ideas about heredity, and at the same time bring to life the brilliant and often eccentric individuals who shaped these ideas. In the spirit of the late Stephen Jay Gould, this book offers a thoroughly engaging story about one of the oldest and most controversial fields of scientific inquiry. It offers readers the background they need to understand the latest findings in genetics and those still to come in the search for the genetic basis of complex diseases and traits. “This engrossing biography by one of molecular biology’s foremost scholars reveals the remarkable evolution of Francis Crick’s scientific career and the shaping of his personality. From unpromising beginnings, he became a vital contributor to a remarkably creative period in science. Olby chronicles Crick’s life from his early studies in biophysics, to the discovery of the structure of DNA, to his later work in neuroscience and the nature of consciousness. This account is woven together with insights into his personal life gained through access to Crick’s papers, family, and friends. Robert Olby’s book is a richly detailed portrait of one of the great scientists of our time.” Review fromHuman Genetics: Crick could have wished for no more suitable biographer than science historian Robert Olby, who knew him for almost 40 years and who has had full access to family members and documents…Olby gives a vivid account both of Crick’s work over a period of 60 years, and of his life, and there is much in this book that will prove to be unfamiliar, perhaps especially to geneticists…For exploring and documenting all these and other aspects of Crick’s life in a readable, sensitive and not uncritical manner, readers from all backgrounds have much to thank Robert Olby for. His story will help to confirm Francis Crick as one of the key people responsible for the transformation of our understanding of life and its processes.” **Education Programs** DNA Learning CenterPartners for the FutureCenter for Humanities & History of Modern Biology CSHL Graduate ProgramUndergraduate Research ProgramPostbaccalaureate Research Education ProgramStony Brook University Meetings & Courses ProgramBanbury Center CSHL PressLibrary & ArchivesDNA Learning CenterPreprints **Main Menu** About Events News Partner With Us Careers Giving Education Programs Faculty **Divisions** Research Banbury Center Center for Humanities CSHL Press DNA Learning Center Meetings & Courses Program Ph.D. Program **Resources** CSHL Archives Library Preprints Non-discrimination Service of Legal Papers Whistleblower Policy (pdf) UHC Medical Transparency in Coverage **Contact** 516-367-8800info@cshl.eduMaps & Directions Donate Now Newsletter **Connect with CSHL** © 2025 Cold Spring Harbor Laboratory. All Rights Reserved. One Bungtown Road, Cold Spring Harbor, NY 11724 Sitemap|Privacy Policy|Web Accessibility"}