{"id": 1384, "name": "Institute for Humane Studies", "domain": "theihs.org", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.theihs.org/academic-programs/graduate-programs/", "title": "Academic Programs", "content": "Funding OpportunitiesOverviewExpense SupportEvent SupportEducational Entrepreneurship GrantsGrants For Course BuyoutsHumane Studies FellowshipGraduate Sabbatical GrantsResidency FundingAcademic MentorshipIHS Funding FAQ Overview Expense Support Event Support Educational Entrepreneurship Grants Grants For Course Buyouts Humane Studies Fellowship Graduate Sabbatical Grants Residency Funding Academic Mentorship IHS Funding FAQ Overview Expense Support Event Support Educational Entrepreneurship Grants Grants For Course Buyouts Humane Studies Fellowship Graduate Sabbatical Grants Residency Funding Academic Mentorship IHS Funding FAQ Events & ProgramsOverviewDiscussion-Based EventsGraduate Programs Overview Discussion-Based Events Graduate Programs Overview Discussion-Based Events Graduate Programs About IHSOverviewCore PrinciplesIdeas that Shape the WorldCareers Overview Core Principles Ideas that Shape the World Careers Overview Core Principles Ideas that Shape the World Careers ScholarsEdge Blog DonateOverviewMatching GiftsPlanned GivingDonor Events Overview Matching Gifts Planned Giving Donor Events Overview Matching Gifts Planned Giving Donor Events search Funding OpportunitiesOverviewExpense SupportEvent SupportEducational Entrepreneurship GrantsGrants For Course BuyoutsHumane Studies FellowshipGraduate Sabbatical GrantsResidency FundingAcademic MentorshipIHS Funding FAQ Overview Expense Support Event Support Educational Entrepreneurship Grants Grants For Course Buyouts Humane Studies Fellowship Graduate Sabbatical Grants Residency Funding Academic Mentorship IHS Funding FAQ Overview Expense Support Event Support Educational Entrepreneurship Grants Grants For Course Buyouts Humane Studies Fellowship Graduate Sabbatical Grants Residency Funding Academic Mentorship IHS Funding FAQ Events & ProgramsOverviewDiscussion-Based EventsGraduate Programs Overview Discussion-Based Events Graduate Programs Overview Discussion-Based Events Graduate Programs About IHSOverviewCore PrinciplesIdeas that Shape the WorldCareers Overview Core Principles Ideas that Shape the World Careers Overview Core Principles Ideas that Shape the World Careers ScholarsEdge Blog DonateOverviewMatching GiftsPlanned GivingDonor Events Overview Matching Gifts Planned Giving Donor Events Overview Matching Gifts Planned Giving Donor Events **Succeed as a Student and Secure a Career in Academia** **Succeed as a Student and Secure a Career in Academia** **Graduate Career Support Events** No matter where you are in your graduate school journey, IHS can help you set yourself up for success in graduate school and on the academic job market. Graduate Policy Career Events Graduate Research Workshops Graduate Research Conference IHS organizes a variety of policy career development events for graduate students interested in pursuing policy work. **Advancing Liberty in Public Policy: Bridging Theory and Practice Happy Hour** Washington, DC·Event date:July 10, 2025·Event time:4:30–6:30 PM ET **Overview** How can early career professionals and rising scholars champion classical liberal ideas in today’s complex policy landscape? Join the Institute for Humane Studies (IHS) for a happy hour featuringJustin Callaisof the Archbridge Institute. Whether you’re an intern at a think tank, a graduate student interested in policy, or an emerging policy professional, this event is an opportunity to explore how classical liberal insights can shape your work and impact public discourse. Dr. Callais will speak briefly on the intersections of liberalism and real-world policy careers. Time will be reserved at the end for networking among attendees with drinks, light fare, and engaging conversation. **Details** Date: Thursday, July 10, 2025 Time: 4:30–6:30 PM ET Venue:The Crown & Crow IHS hosts a variety of graduate research workshops where students from across the social sciences and humanities can workshop their research in preparation for presentation and publication. **The Ethics and Governance of Markets and Innovation: A Graduate Papers Workshop** Zoom·Event date:July 17, 2025·Event time:9:00 AM–5:00 PM ET **Overview** The Institute for Humane Studies is pleased to invite graduate students to apply for participation in a research workshop focused on topics related to the ethics and governance of markets and innovation. This program offers participants the opportunity to refine their research with feedback from leading faculty advisors and expand their academic networks. If you are interested in participating, please submit your CV and an abstract or working paper on a topic related to political philosophy or ethics, along with a brief description of the areas where you would like to receive feedback. We are looking for research that is in progress and could benefit from expert insight and constructive critique. IHS will provide participants with a $200 honoraria for their time and efforts. **Faculty Advisers** Jessica Flanigan, Professor at University of Richmond Christopher Freiman, Professor at West Virginia University **Schedule** *All times are listed in Eastern Time Thursday, July 17, 2025 9:00 AM | Welcome and Introductions9:15 AM | Paper Review Session 110:00 AM | Paper Review Session 210:45 AM | Break11:00 AM | Paper Review Session 311:45 AM | Paper Review Session 412:30 PM | Lunch Break1:30 PM | Paper Review Session 52:15 PM | Paper Review Session 63:00 PM | Break3:15 PM | Paper Review Session 74:00 PM | Paper Review Session 84:45 PM | Closing Remarks **The Political Economy of Emerging Tech: A Graduate Papers Workshop** Richmond, VA·Event date:July 25, 2025·Event time:9:00 AM–7:00 PM ET **Overview** The Institute for Humane Studies is pleased to invite graduate students to apply for participation in a papers workshop focused on topics related to the political economy of emerging technologies. This program offers participants the opportunity to refine their research with feedback from leading faculty advisors and expand their academic networks. If you are interested in participating, please submit your CV and an abstract or working paper on a topic related to emerging tech, along with a brief description of the areas where you would like to receive feedback. We are looking for research that is in progress and could benefit from expert insight and constructive critique. The IHS will provide participants with travel stipends, accommodations, and a $200 honoraria for their time and efforts **Faculty Advisers** Christopher Whyte, Associate Professor at Virginia Commonwealth University **Schedule** *All times are listed in Eastern Time Thursday, July 24, 2025 6:30 PM | Optional Welcome Dinner – Location TBD Friday, July 25, 2025 9:00 AM | Breakfast and Opening Remarks9:30 AM | Paper Review Session 110:15 AM | Paper Review Session 211:00 AM | Break11:15 AM | Paper Review Session 312:00 PM | Lunch1:15 PM | Paper Review Session 42:00 PM | Paper Review Session 52:45 PM | Break3:00 PM | Paper Review Session 63:45 PM | Open Discussion and Q&A6:00 PM | Off-Site Dinner and Reception IHS hosts a series of graduate research conferences where students from across the social sciences and humanities can present their most recent work to esteemed faculty and peers. **Experience an Enlightening Summer Through Our Junior Fellowship** Our Junior Fellowship provides an exclusive opportunity to engage in interdisciplinary discussions and collaborate with top graduate students working to advance the ideas shaping the world. **The Junior Fellowship Offers:** Experience two weekends of collaboration and in-depth conversation with other passionate scholars in the liberal tradition. Present your work to faculty and peers for feedback, personalized advice, and discussion—and hear lectures from the experts! Expand your network and enrich your research by meeting scholars at social events and meals. **Stay Up To Date On Programs** Subscribe to our Opportunities Newsletter to receive updates on upcoming funding applications, events, programs, and more. Contact Careers ScholarsEdge Donate Subscribe Privacy Policy © 2024 Institute for Humane Studies at George Mason University Here is the timeline for our application process: Apply for a position An HR team member will review your application submission If selected for consideration, you will speak with a recruiter If your experience and skills match the role, you will interview with the hiring manager If you are a potential fit for the position, you will interview with additional staff members If you are the candidate chosen, we will extend a job offer All candidates will be notified regarding the status of their application within two to three weeks of submission. As new positions often become available, we encourage you to visit our site frequently for additional opportunities that align with your interests and skills."}