{"id": 1970, "name": "Foreign Policy News", "domain": "foreignpolicynews.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://foreignpolicynews.org/2021/08/25/u-s-foreign-policy-and-its-discontents-playing-moral-leadership-or-planning-a-regime-change-in-ethiopia/#comment-1872", "title": "U S Foreign Policy And Its Discontents Playing Moral Leadership Or Planning A Regime Change In Ethiopia", "content": "Who should be NATO’s next Secretary General? The New World (Dis)order ASEAN must change or face inevitable irrelevance Color revolution in Pakistan? The New World (Dis)order Withdrawal of the US from Afghanistan: A moment of diplomatic rivalry between Japan and China Immigration into Europe has to slow down Strategic business decisions — not the luck of ancestors — created a modern, burgeoning Irish economy Debating the morality of going to war The winner of the U.S.-China trade war is… RSS Facebook X Pinterest YouTube Instagram \">Facebook \">Twitter Random Article Sidebar Menu Home NEWSEUROPEAMERICASMIDDLE EASTASIAOCEANIAAFRICA EUROPE AMERICAS MIDDLE EAST ASIA OCEANIA AFRICA EUROPE AMERICAS MIDDLE EAST ASIA OCEANIA AFRICA POLITICS BUSINESS ENERGY SOCIETY OPINION HEALTH Washington88℉ Random Article Search for **U.S. foreign policy and its discontents, playing moral leadership or planning a regime change in Ethiopia?** By Zerihun Kinate After visiblyangeredby Trump’s “blow up the dam” reckless and dangerous remark many Ethiopians thought a candidate from the Democratic Party could help reconfigure and strengthen the two countries’ diplomatic relationship. Many Ethiopians thought this could change under Biden’s presidency. However, the relation seems strained, and Biden’s foreign policy is not making many Ethiopians. Last week USAID Chief Administrator Samantha Power hadtraveledto Ethiopia announcing that she intends to assess and address the humanitarian aid and access to people affected in the Tigray conflict. However, Prime Minister Abiye Ahmed evenrebuffeda request to meet face to face with her. There are signs that one of the oldest and strongest diplomatic relations in Africa with the US seems heading downhill. Observers fear that the Biden foreign policy towards East Africa’s most populous and oldest nation could backfire and could Abiye to slide out to China, Turkey, and Russia. The Biden administration hasassignedJeffrey Feltman, a seasoned former senior U.S., and United Nations diplomat to assume the newly created role of special envoy for the Horn of Africa, particularly to deal with Ethiopia’s current situation. Though the US security and military assistance is still tremendously significant in the region, the influence of the United States has been diminishing as the dominant external power in the Red Sea arena, a process that has been going on before Trump but has dramatically accelerated under him. The lack of political will to support a genuine political settlement in Yemen is one example of this trend. Equally, the US failed to provide a stronger diplomatic leadership and resources with the necessary measures to ensure the successful transition in Ethiopia. This is in a stark contrast with the George Bush era where the US played crucial role in brokering the end of Sudan’s civil war. Trump’s attempt to mediate the utilization of the Nile’s waters and the Grand Ethiopian Renaissance Dam (GERD) has escalated the tensions instead of resolving the issue exacerbating rivalries in Khartoum between the two groups who are sympathetically divided between Ethiopia and Egypt. Some people are wondering if the US is contemplating a regime change or military intervention. On May 23rdthe US announced visa restrictions for officials andimposedwide-ranging economic and security assistance except humanitarian aid and other areas. In aninterviewupon her return from the trip in East Africa Samantha Power told Ari Shapiro of NPR she disingenuously presented the conflict as a war of two equal parties that are determined to continue to fight believing they can win. This false clam of equivalence purporting the situation as civilians are getting caught in the crosshairs is misleading and misrepresentation of facts as the TPLF should have been given the lion’s share of the blames. It has become an open secret that the current Ethiopian government led by Abiye Ahmed has fallen out of the US favour and there is clear message that any semblance of friendly treatment from Washington is getting in short supply. Critics argue that Biden is handling the East African country’s situation in a manner that has been completely blind to the brutal and authoritarian rule of TPLF. It is clear to any learned political observer that Abiye has mismanaged the transition and handled the political process in a manner that does not guarantee the deepening of institutional reform. His approach of simplistic and focusing on his personal power grab and consolidation has resulted quite a resentment from many political groups. Lack of a clear and tangible roadmap to lead the transition has caused anxiety and uncertainty across the political divide. Given the expectation and enthusiasm from diverse and contending political forces that aspire to see their version of the political project has brought about a large-scale disharmony and dissonance even inside his own Prosperity Party. In the face of this mounting pressure and adversity, what the US could have done is providing more assistance for the democratization, security sector reform, institutional capacity building and technical support, loans, and aids to make sure the economy continues in a path of self sustenance and stability. Given the long-standing friendship and strong public opinion for a US favoured relationship the US could leverage this strong social capital and soft power to work with Ethiopians and their government. Obviously, there is a clear and understandable fear among Ethiopians that they have zero appetite to see a TPLF-led government controlling the central power. This tangible concern emanated from their lived experience and horrific accounts evidenced under their rule. From the standpoint of the elements of national power, strategic and geopolitical factors which foreign policy makers and scholars employ as a yardstick to determine and analyze a state’s position in regional and international relations, Ethiopia stands out as a state that can play a critical role in the region. It is the second most populous country in the continent and represents a nearly half of the Horn of Africa’s population in one of the most conflict prone region in the world. It also has a significant influence in international affairs of the continent being the seat of the African Union. The lopsided approaches of neglect and expediency led to policy blunders that showered resources and attention on unstable governments and military engagements spawning endless violence. Somalia, led by pan ethnic nationalists and repressive institutions was enabled to pave the roads of violence and disintegration with huge injections of funds and arms supplied by the international community as well as the United States.U.S. foreign policyof expediency translated into blind support for a repressive regime is believed to have contributed to the eventual collapse of the state. The USenabledTPLF-EPRDF led repressive regime and highly assisted with the counterterrorism security and militaryaidthat deliberately downplayed domestic democratic aspirations and clampdown of human rights and freedom of expression. Sudan, likewise, the recipient of billions of dollars worth of arms from the Soviet Union, China, the Arab countries, and Western Europe again emerged as the premier client state for unsupervised US. military assistance after the end of the 1970s. At one of its peaks in 1982, U.S. grant aid reached $101 million constituting two-thirds of all U.S.military assistanceto sub-Saharan Africa. And “by the close of the 1980s, Sudan was among the largest overall recipients of US. military aid in the world and by far the largest in sub-Saharan Africa.” U.S. experts and military advisors came to Sudan in droves to support the state. The U.S. embassy inSudan“was fortified and reconstructed to include a rooftop helicopter pad for rapid evacuation, while dollars were also dispensed in generous and generally unmonitored economic aid grants. The result, however, was a spate of poorly conceived and mismanaged ‘development’ projects that did little to relieve the country’s chronic poverty and spiraling debt. At the same time, strains within the country intensified, as the corrupt military government, bloated with new U.S. arms, became convinced it had the power to impose its will on the oil rich south.” These conditions in conjunction with the myriad of internal and external factors that went into the national mix of problems provided the background for the violence that decimated whole regions and has consumed the lives of millions. Ironically, the al Qaeda organization that mounted the most devastating terrorist attack on the United States also was incubated and developed in the Sudan during and right after this period as well. On March 28, 2011, US President Barack Obamaaddressedthe nation: “The task that I assigned our forces is to protect the Libyan people from immediate danger and to establish a no-fly zone… Broadening our military mission to include regime change would be a mistake.” Yet the actions and outcomes reveal the hidden goal of achieving regime change and toppling the leader. Looking back the Libyaninterventionwas based on exaggerated accounts and lies that were aimed covering up the west’s unholy coalition to “get him out” rather than ending the atrocities. The UK House of Commons bipartisan Foreign Affairs Committeeinvestigation“Libya: Examination of intervention and collapse and the UK’s future policy options,” strongly condemns the UK’s role in the war which plunged the Northern African country into chaos. “we have no evidence that UK Government carried out a proper analysis of the nature of the rebellion in Libya,” the report states. “UK strategy was founded on erroneous assumptions and an incomplete understanding of the violence.” The report further lists five reasons which drove France’s president Sarkozy to plan the intervention. These are a desire to gain a greater share of the Libyan oil production; increasing French influence in the North Africa; improving the internal political situation in France; seizing the opportunity to assert French military power position in the world and Gaddafi’s long-term plan to supplant France as the dominant power in Francophone region. Looking beyond the arguments proposed in the United Nations Security Council, other factors in besides civilian protection influenced French policy makers. Libyanexilesbased in France were vocal in promoting the agenda raising fears about a possible massacre in Benghazi. Visiting Professor at King’s College London, Professor George Joffé, stated “the decisions of President Sarkozy and his Administration were driven by Libyan exiles getting allies within the French intellectual establishment who were anxious to push for a real change in Libya.” It is not fair to see Libya as an intra-administration fiasco and soap-opera focusing on the roles of Hilary or Susan Rice or Samantha Power in advising Obama to make the decision to intervene. It would be far more pertinent to treat Libya as a textbook case to serve as a teachable moment that supposedly limited interventions tend to mushroom into campaigns for regime change. Unfortunately, the recent trends of the Biden administration indicate the same path dependency of a well trodden path of enabling few high-ranking officials to play a shuttle diplomacy and when the going gets tough it ultimately becomes a one man’s blunder and tough choices. Now Samantha Power, Blinken and Feltman are the faces of the humanitarian intervention doctrine that gravely totalizes every political violence and structural as well as regional and historical context placed into a narrow pedestal of self-serving legacy making initiative. In order to see a tangible and credible changes in terms of prevention of conflicts in the Horn of Africa, preventing their further escalation, and even, in the longer run, addressing their root causes. Twenty years ago, it was commonplace to hear experts talk about bringing those outcomes, yet we are not there. In order to make meaningful progress in the prevention and provision of justice for victims of atrocity crimes and bring lasting peace in Ethiopia and the region, the United States and others with naming power must be willing to confront the hypocrisy of labeling practices that allow for many genocides to occur unchecked and with impunity. It is widely believed that the notion of promoting human rights as the new “standard of civilization” was meant to push states to prioritize human dignity over power politics. However, recent events and thestudiesdemonstrate the ways in which the recognition of, intervention in, and prevention of genocide and other atrocity crimes are subject to the influence of realpolitik. However, the fluidity of the term “genocide,” as well as the moral hierarchy of atrocity crimes, allows those withnaming powerthe ability to decide which conflicts are legitimate, which are not, and when and where they wish to intercede in the promotion of human rights. The American government insists that its actions in Iraq and Afghanistan constitute the execution of a legitimate counter-insurgency campaign. It’s an attempt to occupy the moral high ground while selectively invoking international law by calling certain conflicts elsewhere “genocide” in order to promote U.S. foreign policy interests. While we know that even in those areas misguided US foreign policy has been one of the main if not the root causes of the violence committed. It at least has equipped, aided, and supported regimes that have betrayed their own people and caused a lot of suffering. That is one of the reasons why the United States in particular, has been notoriously inconsistent in its classification of genocide and other forms of violence. By creating this hierarchy of harm through the condemnation or legitimization of violence, the United States government has manipulated theResponsibility to Protect(R2P) to serve what it regards as its own foreign policy interests. The choice of words ofethnic cleansingby Secretary Blinken and the unilateral action of the US to categorize the four atrocities of war crimes, crimes against humanity, genocide and ethnic cleansing are part of this effort farming andpoliticizingthe whole human rights issue within the geopolitical interest. Announcing the 2021Congressional reportof pursuant to the Elie Wiesel Genocide and Atrocities Prevention Act efforts to prevent and respond to atrocities the US placed Ethiopia among the six countries. Policies of expediency flowed from political leaders’ lack of commitment as much as from the idiosyncratic roles institutions or even individuals played at key historic periods. One such case is the most ignoble and misinformed act a U.S. Undersecretary of State, Herman Cohen, played while presiding over Ethiopia’s transition from a discredited military Marxist government. Like President Carter’s administration that could not comprehend Ethiopia’s critical position in anchoring the region, Cohen found himself in an elevated official situation well above his capacity to understand the larger implications of the task he was entrusted. Rather than looking beyond the downsides of a dying repressive regime to a democratic Ethiopian polity that would bring stability and peace in the region, he single-handedly, and by his own admission against the wishes of his superior, Secretary of State Mr. James Baker, took it upon himself to blindly endorse programs of state dissolution and the turning of an ancient nation that was a pillar of regional security for a long time into a landlocked country. Several case studies of where and how U.S. policies went wrong and contributed to the violence, terrorism and instability that have reigned in the Horn could be cited and discussed in greater detail. The foregoing examples, however, can serve as lessons for reminding policymakers, scholars, and all citizens of goodwill that the choice, implementation, and institutionalization of policies grounded in mutual respect, interdependence and principle have great values for both the people of the Horn and the United States. While America’s return in the region as key partner to Africa a welcome reminder of the continent’s growing importance, a new and divergent approach might help the US meet better its goals and build strong relations. Both the US and Samantha Power as well as JeffreyFeltmanwho is Biden’s special envoy to Ethiopia need to be careful not to repeat history making the same mistake again. While Sudan’s withdrawal from the US State Sponsors of Terrorism list and the ongoing transition is encouraging and should be welcomed. However, there is deep fissure and contestation for power between the civilian government led Prime Minister Abdalla Hamdok and the country’s defence force. Unless this is handled with nuanced and strong calibration of US policy goals and actions it could bring another rogue state with an authoritarian power consolidation. The unstable, uncertain, and volatile situation inside the regime might bring more catastrophic humanitarian and security consequences if military and security aid is pumped without robust investigation and understanding of the domestic political contexts and competing interests. Instead of creating another client state in the region the US must learn and adopt a policy of mutual respect and shared interests that can bind the relationship together on a set of values in a sustainable manner that could materialize an incremental change. This is very much essential for the stability of the region as the US shall catalyze a potential confrontation bypittingSudan against Ethiopia given the recent borderdisputeand the GERD dam disagreement over the Nile water. If the US wants to preserve a long-standing relationship with one of Africa’s oldest and strongest states it should be through the maintenance of Ethiopia’s sate capacity and composure that ultimately helps help promote its security and geopolitical interests. If another military intervention or more diplomatic and economic measures loom over the horizon of the African country it has the unintended effect of crumbling its structure, economy and endangering the entire region. The US needs to learn from its callous and horrendous experience in the neighbouring Somalia which has been since then a safe harbour for terrorist groups and armed militias after its institutions have collapsed. The US could play a key role in stabilizing the country, offering humanitarian assistance and disaster relief, rebuilding the infrastructure, and jump-starting the economy. Politically, once this conflict is over and stability has been achieved the tasks consists of creating self-sustaining political and economic institutions that will ultimately permit competent democratic governance and economic growth could be spearheaded by its civil society organizations. And the US must seize this moment to assist Ethiopia and its people to come to terms and resolve this conundrum. As the fighting continues and TPLF vows to scale up its military offensive expanding into neighbouring regions ofAfar, the country is going under an enormous crisis that is plaguing its people and the economy in greater danger of long-term instability and risk of collapse. Though the Tigrayan forces stated they are not interested in territorial gains in Afar claiming they are only interested in degrading enemy fighting capability, there is a growing understanding that the forces who had been ruling Ethiopia with an iron feast are eyeing for a return to 4 Kilo palace in Addis Ababa. It is true that the government of Ethiopia bears the highest responsibility to maintain order and peace in the country. United Nations aid chief Martin Griffithssaidthat Tigrayan forces pushing south and west into the neighbouring Amhara region have displaced 200,000 people there, Griffiths said, and 54,000 in Afar region to the east. This is a critical existential threat to the country as its state structure and capacity is being eroded and undermined with these protracted conflicts. This requires an urgent and coordinated diplomatic pressure on the rebel group that is causing regional havoc and instability as refugees and displaced people are flooding into the neighbouring regions inside the country and to Sudan. The US needs to work with the Ethiopian government, African Union and other key partners including the European Union and United Nations to resolve the crisis.Criticsargue that its shallow understanding of the deep structural, historical, and systemic political problems has led its leaders to frequently devise and implement one-sided and ill-conceived interventions. Repeating the same gravely erroneous policies will undoubtedly brings a total brink of a hundred years of state building history to its demise. A positive and engaging approach based on supportinternally-drivenprocess of political reform and legal reconciliation, as pioneered in South Africa. Greater understanding of the political system helps the US maintain its interest while balancing the moral leadership and friendly leverage that emanates from an age-old relationship that has survived imperialism, communism, and terrorism at the global and regional levels. By Zerihun Kinate is an MPACS Candidate at University of Waterloo, Canada **Foreign Policy News** Website Facebook X YouTube Pinterest **Read Next** **America’s uncredited role for global peace** **The Democrats: lacking cohesion and direction** **Will the new U.S. visa policy for Bangladesh achieve its objectives?** **Do federal or state prosecutors get to go first in trying Trump? A law professor untangles the conflict** **US debt default could trigger dollar’s collapse – and severely erode America’s political and economic might** **Biden’s strategy for cutting carbon emissions from electricity generation could extend the lives of fossil fuel power plants** **The New World (Dis)order** **Is it immigration versus the working class?** **Default in the United States?** **Nuclear war can be avoided in Korea** **America’s uncredited role for global peace** **The Democrats: lacking cohesion and direction** **Will the new U.S. visa policy for Bangladesh achieve its objectives?** **Do federal or state prosecutors get to go first in trying Trump? A law professor untangles the conflict** **US debt default could trigger dollar’s collapse – and severely erode America’s political and economic might** **Biden’s strategy for cutting carbon emissions from electricity generation could extend the lives of fossil fuel power plants** **The New World (Dis)order** **Is it immigration versus the working class?** **Default in the United States?** **Nuclear war can be avoided in Korea** **Food insecurity and what you can do** **Food insecurity and what you can do** **Ukraine is dying a deindustrialized death** **Ukraine is dying a deindustrialized death** **Related Articles** **The New World (Dis)order** **Sinaloa Cartel as international terror organization** **Walking the tightrope: Sheikh Hasina Wajed’s high-stakes political gamble amid economic crisis in Bangladesh** **Is the path of relations between the European Union and Turkey uncertain after Erdoğan’s re-election?** EUROPEIs the path of relations between the European Union and Turkey uncertain after Erdoğan’s re-election?July 12, 2023 Popular Recent Comments Can the United States legally justify an attack against Iran?June 24, 2019 The War in Ukraine: Understanding and resisting the global elite’s deeper agendaApril 5, 2022 Deficits as far as the eye can seeJune 17, 2019 Kingdom of Norway and Saudi Arabia bilateral diplomatic relationsNovember 30, 2018 Why Trump’s tax cut is not workingApril 6, 2019 The New World (Dis)orderJuly 15, 2023 Sinaloa Cartel as international terror organizationJuly 15, 2023 Walking the tightrope: Sheikh Hasina Wajed’s high-stakes political gamble amid economic crisis in BangladeshJuly 14, 2023 Is the path of relations between the European Union and Turkey uncertain after Erdoğan’s re-election?July 12, 2023 China-Pakistan nuclear deal and Nuclear Suppliers GroupJuly 10, 2023 EU Today Russian Prisoners of War: Angola, Afghanistan, Ukraine - IEyeNews[…] Soviet spymasters: The limits of democracy and Nav... […] Soviet spymasters: The limits of democracy and Nav... […] Soviet spymasters: The limits of democracy and Nav... CPEC: A Game Changer for Pakistan’s Energy Sector | Paradigm Shift[…] CPEC’s “Early Harvest” scheme, energy projects are... […] CPEC’s “Early Harvest” scheme, energy projects are... […] CPEC’s “Early Harvest” scheme, energy projects are... US Congress and the Armed Conflict in Ethiopia – Counterpunch – Eritrean Express News[…] the US efforts over the past 1,5 year were even ma... […] the US efforts over the past 1,5 year were even ma... […] the US efforts over the past 1,5 year were even ma... US Congress and the Armed Conflict in Ethiopia – CounterPunch 04:42[…] the US efforts over the past 1,5 year were even ma... […] the US efforts over the past 1,5 year were even ma... […] the US efforts over the past 1,5 year were even ma... Congress Risks Prolonging the Ethiopian Civil War – The American Conservative 00:10[…] over the past year and a half have been even marke... […] over the past year and a half have been even marke... […] over the past year and a half have been even marke... AMERICASSinaloa Cartel as international terror organizationJuly 15, 2023 Walking the tightrope: Sheikh Hasina Wajed’s high-stakes political gamble amid economic crisis in BangladeshJuly 14, 2023 Is the path of relations between the European Union and Turkey uncertain after Erdoğan’s re-election?July 12, 2023 China-Pakistan nuclear deal and Nuclear Suppliers GroupJuly 10, 2023 June 24, 2019Can the United States legally justify an attack against Iran? **Can the United States legally justify an attack against Iran?** **Can the United States legally justify an attack against Iran?** **Can the United States legally justify an attack against Iran?** April 5, 2022The War in Ukraine: Understanding and resisting the global elite’s deeper agenda **The War in Ukraine: Understanding and resisting the global elite’s deeper agenda** **The War in Ukraine: Understanding and resisting the global elite’s deeper agenda** **The War in Ukraine: Understanding and resisting the global elite’s deeper agenda** June 17, 2019Deficits as far as the eye can see **Deficits as far as the eye can see** **Deficits as far as the eye can see** **Deficits as far as the eye can see** HOME ABOUT US SUBMIT AN ARTICLE PRIVACY POLICY AUTHORS CONTACT AFFILIATE DISCLOSURE RSS Facebook X Pinterest YouTube Instagram \">Facebook \">Twitter RSS Facebook X Pinterest YouTube Instagram \">Facebook \">Twitter MIDDLE EASTCan the United States legally justify an attack against Iran?June 24, 2019 The War in Ukraine: Understanding and resisting the global elite’s deeper agendaApril 5, 2022 Deficits as far as the eye can seeJune 17, 2019 Kingdom of Norway and Saudi Arabia bilateral diplomatic relationsNovember 30, 2018 Why Trump’s tax cut is not workingApril 6, 2019 February 2, 2015First tranche of Chinese loan to build dams in Argentine Patagonia; CFK en route to Beijing **First tranche of Chinese loan to build dams in Argentine Patagonia; CFK en route to Beijing** **First tranche of Chinese loan to build dams in Argentine Patagonia; CFK en route to Beijing** **First tranche of Chinese loan to build dams in Argentine Patagonia; CFK en route to Beijing** April 7, 2016Paraguay: Medical oligarchy defies justice system **Paraguay: Medical oligarchy defies justice system** **Paraguay: Medical oligarchy defies justice system** **Paraguay: Medical oligarchy defies justice system** February 22, 2016Political appointees, impunity harm Albanian foreign service **Political appointees, impunity harm Albanian foreign service** **Political appointees, impunity harm Albanian foreign service** **Political appointees, impunity harm Albanian foreign service** March 24, 2016Edi Rama: Europe’s wealthiest and controversial politician **Edi Rama: Europe’s wealthiest and controversial politician** **Edi Rama: Europe’s wealthiest and controversial politician** **Edi Rama: Europe’s wealthiest and controversial politician** September 18, 2015The rise of proxy leaders in Somalia **The rise of proxy leaders in Somalia** **The rise of proxy leaders in Somalia** **The rise of proxy leaders in Somalia** April 29, 2015Indo-US strategic partnership & its implications on regional security **Indo-US strategic partnership & its implications on regional security** **Indo-US strategic partnership & its implications on regional security** **Indo-US strategic partnership & its implications on regional security** EU Today Russian Prisoners of War: Angola, Afghanistan, Ukraine - IEyeNews[…] Soviet spymasters: The limits of democracy and Nav... […] Soviet spymasters: The limits of democracy and Nav... […] Soviet spymasters: The limits of democracy and Nav... CPEC: A Game Changer for Pakistan’s Energy Sector | Paradigm Shift[…] CPEC’s “Early Harvest” scheme, energy projects are... […] CPEC’s “Early Harvest” scheme, energy projects are... […] CPEC’s “Early Harvest” scheme, energy projects are... US Congress and the Armed Conflict in Ethiopia – Counterpunch – Eritrean Express News[…] the US efforts over the past 1,5 year were even ma... […] the US efforts over the past 1,5 year were even ma... […] the US efforts over the past 1,5 year were even ma... US Congress and the Armed Conflict in Ethiopia – CounterPunch 04:42[…] the US efforts over the past 1,5 year were even ma... […] the US efforts over the past 1,5 year were even ma... […] the US efforts over the past 1,5 year were even ma... Congress Risks Prolonging the Ethiopian Civil War – The American Conservative 00:10[…] over the past year and a half have been even marke... […] over the past year and a half have been even marke... […] over the past year and a half have been even marke... **Adblock Detected**"}