{"id": 1619, "name": "WTKR - Norfolk News", "domain": "wtkr.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wtkr.com/news/in-the-community/hampton/man-who-shot-his-mother-before-taking-his-own-life-was-former-hampton-councilman-randy-gilliland-source", "title": "Man Who Shot His Mother Before Taking His Own Life Was Former Hampton Councilman Randy Gilliland Source", "content": "Menu NewsPositively Hampton RoadsCrimeMilitaryEnvironmentNationalHealthPoliticsFood & EntertainmentApp Center Positively Hampton Roads Crime Military Environment National Health Politics Food & Entertainment App Center Positively Hampton Roads Crime Military Environment National Health Politics Food & Entertainment App Center WeatherMaps & RadarDaily ForecastHurricane ResourcesHampton Roads Closings & Delays Maps & Radar Daily Forecast Hurricane Resources Hampton Roads Closings & Delays Maps & Radar Daily Forecast Hurricane Resources Hampton Roads Closings & Delays In Your CommunityNorfolkVirginia BeachChesapeakeHamptonNewport NewsSuffolkPortsmouthEastern ShoreOuter BanksGloucester CountyWilliamsburg, James City County, YorktownSouthampton-SurryIsle of Wight-FranklinNortheastern North Carolina Norfolk Virginia Beach Chesapeake Hampton Newport News Suffolk Portsmouth Eastern Shore Outer Banks Gloucester County Williamsburg, James City County, Yorktown Southampton-Surry Isle of Wight-Franklin Northeastern North Carolina Norfolk Virginia Beach Chesapeake Hampton Newport News Suffolk Portsmouth Eastern Shore Outer Banks Gloucester County Williamsburg, James City County, Yorktown Southampton-Surry Isle of Wight-Franklin Northeastern North Carolina Investigations Positively Hampton Roads SportsStudent Athlete of the WeekWashington NFLCollegeHigh SchoolHampton Roads High School ScoresLocker Room Student Athlete of the Week Washington NFL College High School Hampton Roads High School Scores Locker Room Student Athlete of the Week Washington NFL College High School Hampton Roads High School Scores Locker Room Live Hampton Roads traffic updates News 3 Everyday Hero Coast LiveAbout Coast LiveContests About Coast Live Contests About Coast Live Contests Contact UsNews 3 TeamApp CenterJobs at News 3Sales Team News 3 Team App Center Jobs at News 3 Sales Team News 3 Team App Center Jobs at News 3 Sales Team Contests WGNT: Your home for local news & sportsWGNT Program Schedule WGNT Program Schedule WGNT Program Schedule Team 3 Professionals Sign In Newsletters Sign Out Manage Emails Apps Careers Search News Weather Live Traffic In Your Neighborhood Sports Positively Hampton Roads Everyday Hero Team 3 Pros Contests Coast Live News 3 Team WTKR/WGNT TV Schedule Dream Home Giveaway **Actions** Facebook Tweet Email **Former Hampton Councilman Randy Gilliland shot & killed his mother before taking his own life: Source** Warning: This story may be disturbing to some viewers. The man who police say shot his mother before taking his own life Tuesday morning has been identified by police as 64-year-old Randy Gilliland, who city officials say was a former Hampton city councilman and vice mayor. City officials and a nonprofit Gilliland held a leadership role with both sent WTKR News 3 statements regarding Gilliland's passing and his impact on their respective communities. This comes after Hampton police said they found a man and a woman who had both been shot to death in the 1st block of Capps Quarters after a report of a shooting came in around 6:30 a.m. Police say they deemed the incident a \"homicide/suicide\" after learning that the man had contacted emergency communications stating he had shot his mother, then took his own life prior to officers arriving. Police have since confirmed that the man in the incident was Randy Gilliland, and the woman was his mother, 86-year-old Patsy Gilliland. Shortly before police responded to the incident, Randy Gilliland made the following post to Facebook: On Tuesday, WTKR News 3's Kelsey Jones spoke to Patsy Gilliland's brother, who says he was just texting his sister Monday night about baseball. He added that she battled dementia for a couple years, but despite this, she was still in good shape. Jones also spoke with Douglas Pettie, who says he was Patsy Gilliland's best friend for more than 30 years. \"This is such a tragedy to me and my family, my son especially. The Gillilands were special people to us,\" said Pettie. \"I just spoke with her early Sunday morning about doing a repair for her and I did not know that this morning I would be hearing this time of information.\" City officials say Gilliland served on the Hampton City Council from July of 2002 to June of 2006. He then served as the city's vice mayor from July of 2006 to June of 2008, then served his second term on the council until June of 2010. Gilliland is listed as the director of philanthropy for a legal nonprofit calledEqual Justice America. Gilliland's biography outlines the various roles he held in the community, including being member of the Hampton Redevelopment and Housing Authority, Hampton Roads Technology Council, VA Peninsula FoodBank, and more. Equal Justice America shared the following statement with News 3 following news of Gilliland's passing: Hampton Mayor Jimmy Gray and City Manager Mary Bunting shared the following joint statement regarding Gilliland's passing: If you or someone you know is struggling with mental health, call the Suicide Crisis Lifeline at 9-8-8. More stories from Hampton Man shoots & kills mother before turning gun on himself: Hampton PDWeb Staff **Man shoots & kills mother before turning gun on himself: Hampton PD** Web Staff **Man shoots & kills mother before turning gun on himself: Hampton PD** Web Staff **Man shoots & kills mother before turning gun on himself: Hampton PD** Web Staff Woman dead, man injured after Hampton Quality Inn double shooting: HPDWeb Staff **Woman dead, man injured after Hampton Quality Inn double shooting: HPD** Web Staff **Woman dead, man injured after Hampton Quality Inn double shooting: HPD** Web Staff **Woman dead, man injured after Hampton Quality Inn double shooting: HPD** Web Staff Sentara CarePlex preparing to graduate latest group of Project SEARCH internsColter Anstaett **Sentara CarePlex preparing to graduate latest group of Project SEARCH interns** Colter Anstaett **Sentara CarePlex preparing to graduate latest group of Project SEARCH interns** Colter Anstaett **Sentara CarePlex preparing to graduate latest group of Project SEARCH interns** Colter Anstaett 2 teens charged after Bethel High student was robbed walking to bus stop: PoliceMaddie Miller **2 teens charged after Bethel High student was robbed walking to bus stop: Police** Maddie Miller **2 teens charged after Bethel High student was robbed walking to bus stop: Police** Maddie Miller **2 teens charged after Bethel High student was robbed walking to bus stop: Police** Maddie Miller Proposed budget cuts expected to significantly change NASA's research, workforceErika Craven **Proposed budget cuts expected to significantly change NASA's research, workforce** Erika Craven **Proposed budget cuts expected to significantly change NASA's research, workforce** Erika Craven **Proposed budget cuts expected to significantly change NASA's research, workforce** Erika Craven Man arrested after barricading himself when HPD tried to serve warrantsWeb Staff **Man arrested after barricading himself when HPD tried to serve warrants** Web Staff **Man arrested after barricading himself when HPD tried to serve warrants** Web Staff **Man arrested after barricading himself when HPD tried to serve warrants** Web Staff The Phish from Vermont make their way back to the 'Mothership'Alex White **The Phish from Vermont make their way back to the 'Mothership'** Alex White **The Phish from Vermont make their way back to the 'Mothership'** Alex White **The Phish from Vermont make their way back to the 'Mothership'** Alex White Renovation of former Deaf and Blind School in Hampton may soon beginColter Anstaett **Renovation of former Deaf and Blind School in Hampton may soon begin** Colter Anstaett **Renovation of former Deaf and Blind School in Hampton may soon begin** Colter Anstaett **Renovation of former Deaf and Blind School in Hampton may soon begin** Colter Anstaett **Sign up for theHeadlines Newsletterand receive up to date information.** **now signed up to receive theHeadlines Newsletter.** **Dream Home Giveaway** **Dream Home Giveaway** News Weather Live Hampton Roads traffic updates Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Terms of Use EEO WTKR FCC Public File WGNT FCC Public File FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact WTKR3 wtkr3 WTKR3"}