{"id": 700, "name": "Institute on Taxation and Economic Policy (ITEP)", "domain": "itep.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://itep.org/georgia-budget-and-policy-institute-the-house-passed-reconciliation-bill-would-significantly-increase-national-debt-primarily-benefitting-top-earners-while-cutting-health-care-and-food-assistance/", "title": "Georgia Budget And Policy Institute The House Passed Reconciliation Bill Would Significantly Increase National Debt Primarily Benefitting Top Earners While Cutting Health Care And Food Assistance", "content": "AboutMission & HistoryStaffTax Microsimulation ModelBoard of DirectorsEmploymentContact Mission & History Staff Tax Microsimulation Model Board of Directors Employment Contact Mission & History Staff Tax Microsimulation Model Board of Directors Employment Contact Federal Policy State Policy Local Policy PublicationsReports & Policy BriefsBlog Reports & Policy Briefs Blog Reports & Policy Briefs Blog Racial Equity Maps Newsroom Blog Donate **Georgia Budget and Policy Institute: The House-Passed Reconciliation Bill Would Significantly Increase National Debt, Primarily Benefitting Top Earners, While Cutting Health Care and Food Assistance** Overall, the budget reconciliation legislation would reduce federal taxes for Georgians by $16.6 billion annually. However, 69% of these savings ($11.5 billion) are directed to the highest-earning 20% of Georgia households, or those making over $153,100 per year. Read more. **Related Content** Montana Budget & Policy Center: Tax Policy Highs and Lows from the 2025 Montana LegislatureThe 2025 Legislature made a number of changes to Montana’s tax system, including an expensive cut to the income tax…ITEP Work in Action Center for American Progress: Governors Should Fight for an Economic Agenda To Improve the Lives of Working-Class ResidentsGovernors are uniquely able to advance an economic agenda that reflects the needs of the working class, giving them the…ITEP Work in Action Idaho Center for Fiscal Policy: What You Need to Know About the National Private School Voucher Proposal in the U.S. House Budget BillNormally, when individuals sell stock, they must pay capital gains taxes on any profit they’ve made. But donors who gift…ITEP Work in Action **ITEP** Washington, DC Office1200 18th Street, NW, Suite 675Washington, DC 20036 Phone: 202-299-1066Fax: 202-299-1065e-mail:[email protected] Donate"}