{"id": 752, "name": "KHOU - Houston News", "domain": "khou.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.khou.com/article/entertainment/television/programs/great-day-houston/sponsored-congratulations-to-ms-macaria-cuevas-2024-2025-randalls-red-apple-teacher-of-the-year/285-6016e97a-c54b-4ae8-a7cb-92e0cbdf9d63", "title": "Sponsored Congratulations To Ms Macaria Cuevas 2024 2025 Randalls Red Apple Teacher Of The Year", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalNear MeTexasPoliticsNation WorldInvestigationsEntertainmentHeartwarmingFeaturesVERIFYHealthLatest News StoriesWhat we've learned about deadly hit-and-run that killed 12-year-old boy on bikeFormer Houston mayor looks to unseat Lina Hidalgo in 2026 Back Local Near Me Texas Politics Nation World Investigations Entertainment Heartwarming Features VERIFY Health What we've learned about deadly hit-and-run that killed 12-year-old boy on bike Former Houston mayor looks to unseat Lina Hidalgo in 2026 Back Local Near Me Texas Politics Nation World Investigations Entertainment Heartwarming Features VERIFY Health What we've learned about deadly hit-and-run that killed 12-year-old boy on bike Former Houston mayor looks to unseat Lina Hidalgo in 2026 WeatherBackForecastRadar10-DayMapsHurricaneTrafficLive WebcamsLatest Weather StoriesWeather Impact Alert: Heavy rain and storms expected Thursday morning2025 Hurricane Preparedness Guide Back Forecast Radar 10-Day Maps Hurricane Traffic Live Webcams Weather Impact Alert: Heavy rain and storms expected Thursday morning 2025 Hurricane Preparedness Guide Back Forecast Radar 10-Day Maps Hurricane Traffic Live Webcams Weather Impact Alert: Heavy rain and storms expected Thursday morning 2025 Hurricane Preparedness Guide SportsBackHigh School SportsTexansRocketsAstrosExtraDynamoJJ WattLocked On Podcast NetworkLatest StoriesNCAA will allow coaches' challenges in men's and women's basketballMen's and women's basketball coaches can now challenge officials' calls, NCAA saysNCAA announces new rule changes for men's and women's basketballCollege basketball coaches will be allowed to challenge officials' calls next seasonFemale athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law Back High School Sports Texans Rockets Astros Extra Dynamo JJ Watt Locked On Podcast Network NCAA will allow coaches' challenges in men's and women's basketballMen's and women's basketball coaches can now challenge officials' calls, NCAA saysNCAA announces new rule changes for men's and women's basketballCollege basketball coaches will be allowed to challenge officials' calls next season Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law Back High School Sports Texans Rockets Astros Extra Dynamo JJ Watt Locked On Podcast Network NCAA will allow coaches' challenges in men's and women's basketballMen's and women's basketball coaches can now challenge officials' calls, NCAA saysNCAA announces new rule changes for men's and women's basketballCollege basketball coaches will be allowed to challenge officials' calls next season Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law SearchSearch:Search Advertise With Us Houston Business Journal Tariffs Immigration Education Station Forecast Texans Helping Texans Our Story, Our History Investigations Contest Great Day Houston Harris County Juneteenth Health Matters KHOU 11 70 years Live Webcams TV Listings **Sponsored: Congratulations to Ms. Macaria Cuevas! 2024-2025 Randalls Red Apple Teacher of the Year** **** To stream KHOU 11 on your phone, you need the KHOU 11 app. **** **Download the KHOU 11 app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Randalls Red Apple winners for the 2024-2025 school year: •Ms. Marissa Hirsch •Mrs. Kellie Preston •Mrs. Sherrian Houston-Motley •Mr. James Parker •Ms. Macaria Cuevas •Ms. Debra Ponce de Leon •Mrs. Emily Williams •Mrs. Renita Johnson-Watts This content sponsored by Randalls **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}