{"id": 659, "name": "Human Rights Campaign", "domain": "hrc.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.hrc.org/press-releases/u-s-house-slashes-health-care-for-millions-of-americans-including-the-lgbtq-community-in-order-to-give-tax-cuts-to-ultra-wealthy", "title": "U S House Slashes Health Care For Millions Of Americans Including The Lgbtq Community In Order To Give Tax Cuts To Ultra Wealthy", "content": "**Cookies in use** Shop Donate Search Menu Our Work Resources Get Involved About In Your Area News Search Manage Your Membership Equality Magazine Careers Press Contact bluesky instagram threads tiktok linkedin facebook youtube Press Releases **U.S. House Slashes Health Care for Millions of Americans – Including the LGBTQ+ Community – In Order to Give Tax Cuts to Ultra Wealthy** byBrandon Wolf•May 22, 2025 Reconciliation bill authored by anti-equality lawmakers would slash programs that millions of Americans rely on–including a disproportionate number of LGBTQ+ people–to pay for handout to the wealthy few House Republicans added last minute provision that strips medically-necessary health care from transgender people of all ages WASHINGTON –This morning, while most Americans were sleeping, the anti-equality majority in the U.S. House passedthe GOP-led reconciliation bill, which slashes programs that millions of people rely on to bankroll tax cuts for the ultra wealthy. The bill’s cuts pose significant threats to critical programs that disproportionately serve LGBTQ+ individuals and families, particularly those who are low-income, living with HIV, or facing food insecurity. Should the bill be signed into law, it would be thelargest transferof wealth from poor and working class Americans to the extremely wealthy in the nation’s history. In addition, late last night, House Republicans changed a previous anti-trans provision so it now cuts off federal Medicaid and Affordable Care Act funding for medically-necessary care for ALL transgender people–no matter their age. People in this country want policies and solutions that make life better and expand access to the American Dream. Instead, anti-equality lawmakers voted to give handouts to billionaires built on the backs of hardworking people – with devastating consequences for the LGBTQ+ community. If the cuts to programs like Medicaid and SNAP or resources like Planned Parenthood clinics weren’t devastating enough, House Republicans added a last minute provision that expands its attacks on access to best practice health care to transgender adults. This cruel addition shows their priorities have never been about lowering costs or expanding health care access–but in targeting people simply for who they are. These lawmakers have abandoned their constituents, and as they head back to their districts, know this: they will hear from us. In the coming days, HRC will mobilize supporters and concerned constituents in key Congressional districts to meet with their lawmakers and demand accountability for these devastating cuts. Key Background on Impact of GOP Reconciliation Bills to LGBTQ+ People Estimates from the Congressional Budget Office find that the Republican proposals could kick 13.7 million people off of Medicaid. Medicaid is a crucial source of health care for LGBTQ+ individuals, covering a disproportionate share of low-income LGBTQ+ people, including 21% of transgender individuals and 40% of people living with HIVMedicaid is the largest payer for HIV care in the U.S., and any cuts would jeopardize access to essential treatment for individuals living with HIV, undermining national efforts to end the epidemicMany LGBTQ+ community health centers rely on federal funding through Medicaid; any reduction would limit services like mental health support, gender-affirming care, and STI testingRoughly 22-25% of LGBTQ+ adults in the US live in poverty, compared to about 16% of nontransgender, straight adults Medicaid is the largest payer for HIV care in the U.S., and any cuts would jeopardize access to essential treatment for individuals living with HIV, undermining national efforts to end the epidemic Many LGBTQ+ community health centers rely on federal funding through Medicaid; any reduction would limit services like mental health support, gender-affirming care, and STI testing Roughly 22-25% of LGBTQ+ adults in the US live in poverty, compared to about 16% of nontransgender, straight adults Medicaid is the largest payer for HIV care in the U.S., and any cuts would jeopardize access to essential treatment for individuals living with HIV, undermining national efforts to end the epidemic Many LGBTQ+ community health centers rely on federal funding through Medicaid; any reduction would limit services like mental health support, gender-affirming care, and STI testing Roughly 22-25% of LGBTQ+ adults in the US live in poverty, compared to about 16% of nontransgender, straight adults NEW: The bill forbids the use of federal Medicaid and CHIP funding for medically-necessary health care for transgender people of ALL agesA second provision would prevent states from offering medically necessary health care to all transgender people through ACA health plans by excluding this care from the definition of \"essential health benefits,\" regardless of age. A second provision would prevent states from offering medically necessary health care to all transgender people through ACA health plans by excluding this care from the definition of \"essential health benefits,\" regardless of age. A second provision would prevent states from offering medically necessary health care to all transgender people through ACA health plans by excluding this care from the definition of \"essential health benefits,\" regardless of age. The cuts to SNAP, including stricter eligibility requirements, work mandates, and benefit reductions, would disproportionately impact LGBTQ+ individuals, especially those with disabilities, caregiving responsibilities, or experiencing homelessnessLGBTQ+ individuals experience higher rates of food insecurity compared to non-LGBTQ+ individualsResearch shows that more than 27% of LGBTQ+ adults have struggled to afford food in the past yearWomen, younger individuals, and LGBTQ+ people of color are particularly vulnerable to food insecurity and would face heightened risks under a weakened SNAP program LGBTQ+ individuals experience higher rates of food insecurity compared to non-LGBTQ+ individuals Research shows that more than 27% of LGBTQ+ adults have struggled to afford food in the past year Women, younger individuals, and LGBTQ+ people of color are particularly vulnerable to food insecurity and would face heightened risks under a weakened SNAP program LGBTQ+ individuals experience higher rates of food insecurity compared to non-LGBTQ+ individuals Research shows that more than 27% of LGBTQ+ adults have struggled to afford food in the past year Women, younger individuals, and LGBTQ+ people of color are particularly vulnerable to food insecurity and would face heightened risks under a weakened SNAP program The bill also includes provisions that would bar funding to Planned Parenthood —targeting an organization that has worked diligently to create welcoming, affirming environments for the LGBTQ+ community and that is committed to reproductive freedom and providing care to all who need it **Contact Us** To make a general inquiry, please visit our contact page. Members of the media can reach our press office at: (202) 572-8968 or email press@hrc.org. **Love conquers hate.** Image: **Love is Love** 100% of every HRC merchandise purchase fuels the fight for equality. **Join millions of supporters by signing up for the HRC newsletter.** bluesky instagram threads tiktok linkedin facebook youtube Privacy Policy Copyright Complaint Notice The Human Rights Campaign, All Rights Reserved **Choose a Location** Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming **Leaving Site** **You are leaving HRC.org** By clicking \"GO\" below, you will be directed to a website operated by the Human Rights Campaign Foundation, an independent 501(c)(3) entity."}