{"id": 553, "name": "Frontiers in Environmental Engineering", "domain": "frontiersin.org/journals/environmental-engineering", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/environmental-engineering/articles/10.3389/fenve.2025.1597684/full", "title": "Environmental Engineering", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Air Pollution Management Environmental Catalysis Environmental Impact Assessment Water, Waste and Wastewater Engineering Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Air Pollution Management Environmental Catalysis Environmental Impact Assessment Water, Waste and Wastewater Engineering Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Air Pollution Management Environmental Catalysis Environmental Impact Assessment Water, Waste and Wastewater Engineering Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office MINI REVIEW article Front. Environ. Eng., 11 June 2025 Sec. Water, Waste and Wastewater Engineering Volume 4 - 2025 |https://doi.org/10.3389/fenve.2025.1597684 **Retrospective of DIET process for enhanced biogas production during anaerobic digestion of thermal/chemically pretreated waste activated sludge** 1Department of Civil Engineering, College of Engineering, King Saud University, Riyadh, Saudi Arabia 2Department of Civil Engineering, Indian Institute of Technology Roorkee, Roorkee, India 3Water and Environmental Engineering Department, Faculty of Engineering, Kandahar University, Kandahar, Afghanistan 4Civil Engineering Department, Faculty of Engineering, Kandahar University, Kandahar, Afghanistan 5Department of Civil and Environmental Engineering, Faculty of Engineering, Carleton University, Ottawa, ON, Canada 6Department of Civil Engineering, Z.H. College of Engineering, Aligarh Muslim University, Aligarh, India Hydrolysis of recalcitrant organic waste such as lignocellulosic biomass and waste-activated sludge (WAS) is a rate-limited step in anaerobic digestion (AD) due to the chemical and physical barriers that can be diminished by pretreatment of the waste. However, for readily biodegradable, soluble organics or already hydrolyzed organics, acetogenesis and methanogenesis become the rate-limiting steps owing to the discrepancy in the syntrophic relationship of the inter-microbial matrix. Enhancing the syntrophic relation of VFA oxidizing bacteria and hydrogenotrophic methanogens via direct interspecies electron transfer (DIET) is vital for enhanced and efficient bio-methanation. DIET changes the metabolic pathways, which can be evidenced by microbial diversity, abundance, and associated enzymes. The stimulation of DIET can enhance biogas production and methane content and enhance VFA and ammonia-stressed digesters. The conductive materials for DIET in AD should be non-hazardous, chemically stable, cheap, recyclable, non-reactive, porous, conductive, microbe-friendly, and provide a large surface area. DIET stimulation and optimization via sustainable materials for high organic wastes are the future research areas that need comprehensive exploration. **1 Highlights** • Acetogenesis and methanogenesis can be the rate-limiting steps in AD. • The discrepancy in the syntrophic relationship of the inter-microbial matrix is enhanced by abiotic DIET introduction. • DIET improves microorganism diversity, abundance, and associated enzymes in AD. • DIET can enhance biogas production, methane content and VFA and ammonia-stressed digesters. • The abiotic materials for DIET should be chemically stable, cheap, recyclable, porous, conductive, microbe-friendly, and provide a large surface area. **2 Introduction** Organic waste bioconversion via anaerobic digestion (AD) is a promising technology. AD is a four-step process involving different microorganisms to oxidize the organic matter and reduce it to CH4. In the first step of AD, hydrolysis, the complex organic wastes are hydrolyzed. Next, in the acidogenesis step, the acidogenic bacteria ferment the hydrolytic products into organic acids (volatile fatty acids, VFA), alcohols (ethanol), and hydrogen. In the third and fourth steps, acetogenesis and methanogenesis, syntrophic relations between symbiotic microorganisms are established to oxidize the VFAs and reduce the oxidation by-product (CO2), respectively (Gahlot et al., 2020;Baek et al., 2018). Methanogens are acetotrophic and hydrogenotrophic (Xu et al., 2020). The former methanogens produce methane by decarboxylation of acetate, and the latter produce methane by reducing CO2and H2(Anukam et al., 2019). The oxidation and reduction between syntrophic microorganisms in AD are based on interspecies electron transfer (IET) (Nguyen et al., 2021) usually facilitated by molecular hydrogen and formate (Figure 1a). Figure 1. Interspecies Electron Transfer IET).(a)Indirect IET via formate and hydrogen,(b)Direct IET via e-pili,(c)Direct IET via cytochrome,(d)Direct IET via carbon-based materials. Traditionally, this interspecies electron transfer is mediated diffusively via H2or formate as electron carriers. However, these intermediates are thermodynamically sensitive and can limit the efficiency of electron exchange under high substrate loads or inhibitory conditions. To overcome these constraints, a more efficient mechanism known as direct interspecies electron transfer (DIET) has been identified. In DIET, microorganisms exchange electrons directly through conductive pili or external conductive materials, bypassing the need for intermediate molecules. This direct pathway enhances the syntrophic metabolism, particularly in the acetogenesis and methanogenesis phases, by facilitating faster and more stable electron flow between syntrophic partners. The integration of DIET into the AD process not only improves methane yield but also enhances system resilience under stress conditions such as VFA or ammonia accumulation. In AD, biogas production is limited in the hydrolysis step due to the recalcitrant nature of the wastes such as lignocellulosic biomass where lignin is the protective barrier for degradation (Rahmani et al., 2022) or waste-activated sludge (WAS) where the extracellular polymeric substances (EPS) are the physical and chemical barriers to access the organic matter trapped inside (Almegbl et al., 2024). Moreover, AD is limited at the acetogenesis and methanogenesis steps owing to the slow and disrupted syntrophic biological metabolisms that microorganisms adopt during bioconversion (Baek et al., 2018). The slow metabolism is due to the poor hydrogen diffusion between symbiotic microorganisms and the insufficiency of hydrogen-consuming methanogens (Yang et al., 2017). Moreover, some acids, such as propionate and butyrate of VFA, have prolonged syntrophic metabolism and may be accumulated. Therefore, the accumulation of VFA and decrease in pH may lead the AD process to failure. Hydrolysis, acidogenesis, acetogenesis, and methanogenesis steps of AD could be rate-limiting depending on the nature of the feedstock. For example, lignocellulosic biomass is tough in the hydrolysis step, and pretreatment of the feedstock before AD can be a good approach for biodegradation enhancement. However, the hydrolyzed feedstock can limit the other steps of AD, namely, acetogenesis and methanogenesis, due to the lack of harmony in the bio-conversion rate because the microbiome in the AD process is in a syntrophic relationship, which is the collaborative interaction between the microbiome to degrade the feedstock in AD. The shortcoming could be controlled by improving the IET via abiotic material (Wang et al., 2021). The imbalance in bio-conversion rate is due to the feeble redox medium of indirect IET (IIET), such as hydrogen, formate, or protein of death cell and biological direct IET (DIET), such as membrane-related cytochromes and conductive pili, that are conventionally used in the AD process. In IIET, the primary route to shuttle electrons is via hydrogen and formate redox mediums driven by diffusion (Zamel et al., 2024;Nguyen et al., 2021). To stabilize the bioconversion rate, for example, between VFA oxidizing bacteria and hydrogenotrophic methanogens, and to enhance the bio-methanation process, an established and accelerated IET is vital (Gahlot et al., 2020;Baek et al., 2018). Wastes valorization through the conventional anaerobic digestion (AD) process is not efficient due to the diverse nature of the feedstock—ranging from lignocellulosic biomass to readily biodegradable materials—which either limits the hydrolysis step or leads to inconsistency in the syntrophic interactions within the microbiome matrix of the process. While numerous reviews have examined the effects of pretreatment on enhancing bio-methanation, limited attention has been given to amending the AD process through Direct Interspecies Electron Transfer (DIET) materials. This review uniquely focuses on the underexplored area of non-biological DIET mechanisms and their role in improving AD performance. The novelty of this work lies in three key aspects: 1. It systematically investigates the mechanisms by which non-biological DIET materials influence electron transfer and enhance syntrophic cooperation in AD systems—an area not comprehensively addressed in existing literature. 2. It identifies and categorizes a wide array of non-biological DIET stimulants, highlighting their physicochemical characteristics and compatibility with the AD microbiome, which provides a new framework for material selection. 3. It extensively evaluates the potential of DIET materials in restoring AD performance under stress conditions, such as high VFA accumulation, ammonia toxicity, and organic overloading—scenarios commonly responsible for digester failure but rarely studied from a DIET perspective. This review thus provides novel insights into how DIET materials can not only enhance methane yield but also stabilize microbial communities and improve process resilience. Finally, the impact of non-biological DIET on improved bio-methanation and microbiome diversity is demonstrated, setting the stage for next-generation AD strategies. **3 Significance of DIET** Optimization of AD processing parameters helps to enhance biogas production. A data-driven model to enhance biogas from sludge considering optimum temperature, TS%, VS%, and pH could achieve an increase of 20.8% in biogas. However, the inert energy from the waste is higher and can be recovered by removing other bottlenecks, such as slow interspecies electron transfer (Lin et al., 2017). For instance, the methane rate has increased up to 25% by adding biochar in AD of propionate and butyrate (Lin et al., 2017). DIET is efficient in the start-up of AD. It improves the syntrophic partners and speeds the electron transfer. Therefore, a reduced lag phase is achieved, and biogas production, rate, and quality are improved at the early stages (Wang et al., 2021). Improvement in organics degradation, microorganism activity, biogas yield, and stability of the AD process can be achieved by adding accelerants to AD systems (Yun et al., 2021). The accelerant includes biological (fungi, microbial consortium, enzymes), chemical reagents, macronutrients, minerals (copper, nickel, manganese, molybdenum, zinc, iron), trace elements, transition metal compounds, and carbon materials (Altamirano-Corona et al., 2021), which are mainly enriching microorganism growth and enhancing DIET. Conductive materials can enhance DIET to accelerate the poor electron exchange in IIET. These materials enhance DIET by bridging microbial cells and enabling electrons to travel through the matrix, even when cells are not in direct contact (Figure 1d) (Zamel et al., 2024). Moreover, electrically conductive Pili (e-pili) of microorganism enable DIET. Microorganisms such asGeobacterspecies produce conductive pili (also referred to as nanowires) composed of PilA protein monomers. These pili allow electrons to flow from the electron-donating species to the electron-accepting species across cell surfaces (Figure 1b) (Zamel et al., 2024). Likewise, bio-based outer membrane c-type cytochromes can establish DIET. These are heme-containing proteins embedded in the outer membrane of microbes, such as OmcS and OmcZ inGeobacter sulfurreducens. They act as electron conduits and are crucial in facilitating extracellular electron transfer (seeFigure 1c) (Zamel et al., 2024). Moreover, the acetogens and methanogens have slow growth rates and are most sensitive to changes in AD due to the limited metabolic Gibbs free energy (Wang et al., 2021). If the syntrophic relationship is well balanced, the degradation of carboxylic acids is enhanced thermodynamically. DIET is more favorable than IIET thermodynamically and is 108 times advantageous kinetically (Wang et al., 2021;Baek et al., 2018). DIET is a physical procedure that could be done directly through biological and non-biological mediators, whereas IIET needs the production of H2to be used as an electron carrier. Hence, IIET and biotic DIET consume immense energy and involve complex enzymatic steps to produce, consume, and diffuse the redox mediators (H2and formate) or to form biotic nanowires where abiotic DIET (Figure 1d) does not need energy (Wang et al., 2021;Baek et al., 2018). Moreover, in IIET, the mediator may be lost to the environment due to chemical fluctuation; however, the abiotic DIET is always available, and hence, the syntrophic relationship is stable (Wang et al., 2021). IIET or DIET is involved in acetogenesis, acetate oxidation, and methanogenesis but not hydrolysis and acidogenesis; hence, most previous studies are studied with soluble substrates such as VFA, ethanol, etc. (Wang et al., 2021). The efficiency of DIET is influenced by a) Redox potential, pH and temperature, and presence of conductive additives. DIET is favored in environments with lower redox potentials, which are common in deep anaerobic systems. Moreover, optimal DIET activity typically occurs under mesophilic to thermophilic conditions. Materials like magnetite not only promote microbial aggregation as demonstrated in pollutant degradation (e.g., antibiotic removal) but also improve electron transfer efficiency as in methane production process (Zamel et al., 2024). Table 1compares the two electron transfer modes in terms of electron transfer mechanisms, thermodynamic efficiency, energy requirements, and operational stability. DIET offers considerable advantages, particularly for high-strength or stress-prone anaerobic systems, but also introduces new variables such as material dependency and system integration challenges. These comparative insights reinforce the importance of targeted material selection and process optimization when designing DIET-enabled anaerobic digesters. Table 1. Comparison between DIET and IIET in anaerobic digestion. **4 Electron transfer in DIET** The oxidation of substrate by bacteria (exoelectrogenic) produces energy in the form of hydrogen, which can be indirectly or directly transferred to reducing methanogens (electrotrophic) to reduce CO2to CH4(seeFigure 1). The DIET could be biological or non-biological (or mineral DIET) (Xu et al., 2020). The DIET is about 100 times faster than IIET (Xu et al., 2020) because the shuttling system via H2and formate medium, which is based on diffusion, is avoided. However, some microorganisms inherently keep the syntrophic relationship via physical contact (biological DIET) (Gahlot et al., 2020). Surprisingly, some microbes without pili can be co-cultured to yield pili and participate in DIET (Wang et al., 2021). In biological mediator, the DIET was first observed in co-cultures ofGeobacter metallireducensandGeobacter sulfurreducensmetabolizing ethanol due to c-type cytochrome involved in electron transfer. The DIET in methanogen was first presented byRotaru et al. (2014)whenMethanosarcina barkeriandGeobacter metallireducenswere co-cultured and amended by granular activated carbon. When DIET is established via a biological mediator (membrane-related cytochromes and conductive pili), the microorganisms form tight aggregates because physical touch is required in transferring electrons. In contrast, in non-biological, the microorganism attaches tightly to the surface of the conductive materials (Gahlot et al., 2020;Baek et al., 2018). In many studies, the DIET mechanism was investigated in syntrophic co-cultured environments and for simple substrates such as acetate, ethanol, propionate butyrate, and glucose, most of which could be found as intermediate products of acidogenesis in AD. However, conductive materials have recently been used with mixed-culture and for complex substrates such as WAS, FW, brewer’s spent grain, incineration leachate, cheese whey, piggery wastewater, and fruit waste to extend its application. In mixed-culture and complex substrate bioconversion, biofilms are usually formed where IIET via redox mediator and DIET via cellular components such as cytochromes, pili, DNA, flagella and flavins, and conductive particles are established (Gahlot et al., 2020). In conventional AD, indirect electron transferring via H2and formate (IIET) or directly via cellular component (biological DIET) is less effective and stable (Gahlot et al., 2020) because electron shuttling is via diffusion. High electrical conductivity and surface chemistry of biotic and abiotic facilitators for DIET allow electron transfer from one microorganism to another in syntrophic relations (Kaur et al., 2020). The electron transfer in abiotic materials is much higher than IIET and biotic DIET and can establish electron transfer relatively in distance compared to IIET and biotic DIET (Wang et al., 2021). In DIET, the electron transfer can be metal-like conductivity or super-exchange conductivity (Nguyen et al., 2021). Metal-like conductivity is due to the overlapping π–π orbitals of the aromatic amino acids within the pili structure, while super-exchange conductivity is due to the role of extracellular cytochrome-cytochrome (Nguyen et al., 2021). Carbon-based materials (CMs) such as activated carbon (AC) and biochar can replace pili in DIET (Nguyen et al., 2021). Using non-biological material for DIET accelerates the electron transfer between the symbiotic species because of its high electron conductivity; hence, the rate of bioconversion and efficiency are improved (Gahlot et al., 2020). The conductivity of granular activated carbon (GAC), for example, is 3,000 μS/cm while pili’s is 2–20 μS/cm, up to 1,500 lower than GAC (Gahlot et al., 2020). The shift of IET from interspecies hydrogen transfer (IHT) to biological and non-biological DIET changes the metabolic pathways, which can be evidenced by microbial diversity, abundance, and associated enzymes. Graphene, for example, is reported to have adverse effects on microorganism growth because of its antimicrobial properties (Baek et al., 2018;Lin et al., 2017). Moreover, carbon nanotubes are toxic to microorganisms due to the cytotoxic mechanism (Baek et al., 2018). All CMs are not effective for all substrates to improve DIET. For example, carbon cloth and GAC are incompatible with glucose to enrich Geobacter. However, ethanol has enriched both Geobacter and Methanothrix (Wang et al., 2021).Wang et al. (2021)have listed potential syntrophic associations involved in DIET considering the electron donor and acceptor, electron-donating and electron-accepting partners, and the DIET happening environments. **5 Materials used for DIET** Different materials can be used as intermediators for DIET, such as carbon-based materials (activated carbon, biochar, graphite, carbon cloth, carbon felt, carbon fibers, graphene, carbon nanotubes [single or multiwall]) and iron-based materials (magnetite [Fe3O4], hematite [Fe2O3], goethite [FeOOH]) (Baek et al., 2018). Carbon-based materials for DIET are produced from different biomass converted thermochemically and are carbon-rich and bio-stable. Commercially, they are available for enhancing soil quality. They have a high internal surface area, which makes them capable not only of use as DIET (electron transfer acceleration and microorganism attachment) but also for removal and adsorption of soluble organics, gases, nutrients, and recovery of near-failure AD because of shock loads, ammonia stress, phenol, heavy metal, limonene, pH and temperature variation (Nguyen et al., 2021;Altamirano-Corona et al., 2021). The stimulation of DIET can enhance biogas production, chemical oxygen demand (COD) degradation, and resistance to acid inhibition (Yun et al., 2021). Carbon- and iron-based materials are used in scrubbing or adsorption columns to remove impurities from biogas (Nguyen et al., 2021). The co-digestion of food waste and sludge was amended by the biochar of wheat straw. The total VFA accumulated to 40 g/L on day 9; however, the biochar at 10 g/L was capable of handling it and decreasing it to around 2 g/L while in the control digester without biochar, the total VFA was 8.8 g/L after 30 days AD (Kaur et al., 2020). Toxic conditions can decrease the effect of DIET to some extent. On the other hand, hydrogenotrophic methanogens are comparatively tolerant to toxic conditions, and homoacetogenesis is stimulated when the partial pressure of hydrogen is higher than 500 Pa (0.005 atm) (Liu et al., 2021). AD of the wastewater at 1 g/L COD concentration was feasible without adding GAC and EH2to the anaerobic digester (Liu et al., 2021). However, 5 g/L GAC and 0.5 atm EH2were the optimum conditions to treat 5 g/L COD wastewater. The methane yield increased almost 2-fold to 290 mL/g COD compared to control. Adding GAC and EH2removed 87.2% of COD and reduced the lag times from 11.7 days to 3.3 days. Both the supplements stimulated DIET and resulted in the relative abundance of DIET-related microorganisms such as Geobacter, Methanosaeta, andClostridiumto 25.36%, 52.81% and 9.78%, respectively (Liu et al., 2021). CMs have alkaline and alkaline earth metals such as K, Na, Mg, and CA. Hence, CMs are adding alkalinity and increasing the buffering capacity of the AD process. The pH of activated carbon (AC) and biochar can range from 8 to 12 (Altamirano-Corona et al., 2021). The comparative analysis of adding three facilitators, namely, GAC, biochar, and magnetite, to the AD of food waste under mesophilic mode for 15 days revealed that 0.1, 1, and 1 g/L, respectively, were the optimum dose to enhance biodegradation (Altamirano-Corona et al., 2021). All the materials improved buffering capacity, avoided VFA accumulation, promoted microorganism colonization and biofilm formation, and improved methane yield (up to 30%), rate, and quality (Altamirano-Corona et al., 2021). Carbon-based material used for DIET may have diverse effects on AD because of derivation source, preparation method, pyrolysis temperatures, purity, surface area, shape, pore size, pH, ash content, organic function group, nutrient content, particle size, dose, price, and electron conductivity vary (Nguyen et al., 2021;Kaur et al., 2020). Moreover, the complexity of the substrate, the culture used as inoculum, AD processing parameters, and the desired output affect the DIET stimulation. The high surface area provides microbial colonization and enhances functional microorganisms (Xu et al., 2020). CMs for DIET can absorb CO2and H2S, so the methane content in biogas increases (Nguyen et al., 2021). However, the CMs derivation define the quality of biogas. For example, biochar made of pine (2.49–4.79 g/g TS) has increased CH4content to 92.3% in the mesophilic AD process, while biochar derived from white oak (2.2–4.4 g/gTS) has increased methane content to 79% in thermophilic AD (Nguyen et al., 2021). Adding biochar to AD resulted in removing 78% of H2S from the biogas produced. Similarly, H2S reduction can be obtained by iron-based materials, too. The effect of biochar derived from different sources such as wheat straw, oil seed rape, and softwood pellet pyrolyzed at 550°C and 700°C at a dose of 10 g/L was investigated in anaerobic co-digestion of food waste and sludge (Kaur et al., 2020). Biochar from wheat straw pyrolyzed at 550°C was the optimum type of biochar (Kaur et al., 2020). The mesophilic AD for 30 days at batch scale resulted in a methane yield of 382 mL CH4/g VS (increased by 24%) and VS removal efficiency of 42%. The biochar increased acetic acid by more than 40% and butyric acid by 20% compared to control (Kaur et al., 2020). Nutrient elements are usually more abundant in biochar derived from agricultural biomass than in forestry biomass (Kaur et al., 2020). For example, the K contents in biochar derived from wheat straw pyrolyzed at 550°C and oil seed rape pyrolyzed at 700°C were 6.2 and 11.9 times more than the biochar obtained from softwood pellet pyrolyzed at 550°C (Kaur et al., 2020). Moreover, electrical conductivity of agro-based biochar is higher than the softwood biochar (Kaur et al., 2020). A summarized comparison of biochar, graphene, magnetite, GAC, CNYs and ZVI based on their effectiveness in anaerobic digestion (AD) for Direct Interspecies Electron Transfer (DIET), focusing on methane yield, cost, and toxicity is presented inTable 2. Table 2. Comparison of materials for DIET in anaerobic digestion. **5.1 Abiotic materials potential for DIET** Carbon-based materials (CMs) are widely applied since they have high electrical conductivity and chemical stability, are lightweight, biocompatible, and are cost-effective (Gahlot et al., 2020). CMs can affect biogas quality, digester dewaterability, sludge volumes, and centrate quality (Nguyen et al., 2021). The dewaterability increases with the addition of CMs because the migration of bond water to free water is increased by CMs (Nguyen et al., 2021). The migration increase is due to the release of Na, K, and Ca, which increase osmotic pressure between the sludge flocs and suspended liquid and, hence, cause dewaterability to increase (Nguyen et al., 2021). CMs can increase some specific acids favorable for methanogenesis and, hence, will increase the methane content and production. For example, 10 g/L of biochar derived from wheat straw increased the acetic acid and butyric acid, favorable acids for methanogens, by 40% and 20%, respectively, compared to control (Kaur et al., 2020). Biochar can be derived from plant and animal-based biomass in low-temperature pyrolysis at a low cost compared to other CMs (Kaur et al., 2020). The morphology of biochar particles is fragmented and very heterogeneous (Figure 2), while GAC has long edges and rough areas with micro-pores (Altamirano-Corona et al., 2021). Activated carbon can be derived from different types of biomass. It has a high specific surface area and can absorb inhibitory compounds in AD to stabilize the digesters (Xu et al., 2020). The conductivity of GAC is 0.3 S/m, about 600–1,500 times that of biochar (Baek et al., 2018). The specific surface area of GAC is relatively high (500 m2/g) compared to biochar (80 m2/g) (Altamirano-Corona et al., 2021). Materials with higher conductivity and surface area are efficient in DIET. Figure 2. Carbon-based materials used in DIET application. Carbon fiber has consistent hexagonal rings next to each other to show strong chemical and physical properties (Baek et al., 2018). Carbon fibers are thin (diameter in micrometers) and strong crystalline strands of carbon (Figure 2). Carbon cloth has been used in AD of ethanol by mixed culture. They have been more effective than biochar or graphite in enhancing methane production (Gahlot et al., 2020) (Figure 2). It was observed that carbon cloth can increase the conductivity of sludge by 59.4% compared to control (Yang et al., 2017). Carbon felt is made from carbon fiber, which is porous, soft, flexible, and felt-like (Figure 2). Graphene is a single layer of carbon atoms arranged in a hexagonal lattice (Figure 2). It has extraordinary electrical conductivity and high surface area. Pure graphene can have an electrical conductivity above 1 million S/m, roughly a thousand times that of magnetite. It is observed that prolonged (55 days) amendment of anaerobic digester with 120 mg/L graphene has resulted in methane suppression (Wang et al., 2021). Moreover, the suspension of magnetite addition for 3 months could yet have a stable improvement in biogas production (Wang et al., 2021). In addition, after a long time, fouling of materials used for DIET can happen via the formation of an impermeable layer, which can avoid electron transfer (Wang et al., 2021). Therefore, the long-term effect of CMs and iron-based materials is yet to be investigated comprehensively. Carbon nanotubes (CNT) resemble sheets of graphite rolled into tubes (Figure 2). They are extremely thin, having a diameter of 0.5–2 nm. They are excellent in electrical conductivity and have high tensile strength. If CNTs are modified with metals, their conductivity becomes extraordinary; however, some are semiconductors. The electrical conductivity of biomass was reported to increase by 27 times in CNT, 14 times in stainless steel, 3.5 times in GAC, 2.1 times in ferro ferric oxide, 2 times in carbon cloth, and 1.5 times in biochar (Gahlot et al., 2020;Nguyen et al., 2021). Conductive polyaniline (PANI) is an ideal material for enhancing DIET. The addition of PANI to AD has improved methane production by two times. PANI has a stable chemical structure, high biological affinity, adjustable conductivity, and uniform distribution in sludge (Wang et al., 2021). Moreover, the DNA-related molecules can potentially establish DIET; however, they have not yet been admitted in anaerobic conditions. Some materials, such as glass beads, are also used in wastewater treatments; however, they are not for DIET stimulation but for biofilm formation (Altamirano-Corona et al., 2021). Iron-based materials (magnetite [Fe3O4], hematite [Fe2O3], goethite [FeOOH], zerovalent iron [ZVI]), metal oxides (Tantalum oxide, niobium oxide, hafnium oxide, tungsten oxide) (Yun et al., 2021) and carbon-based material modified with iron oxides are used in drug delivery, biosensing, bioseparation, and recently in AD to stimulate DIET for efficient and enhanced biogas production (Gahlot et al., 2020) (Figure 3). Moreover, the iron-rich waste from the mining and steel industries can be used for DIET (Nguyen et al., 2021). The first use of magnetite and hematite as DIET stimulators in AD among Geobacter and Methanosarcina was reported byKato et al. (2012). They noticed that lag time and methane production were enhanced with the semi-conductive iron oxides, while there was no improvement when insulative iron oxide (ferrihydrite) was used. The addition of magnesium oxide, silver particle, nano-ZnO, nano-CuO, and ferrihydrite has led to the failure of AD mainly because of inhibition from metals (Fe+3), archaea reduction by Fe+3, substrate competition, mass transfer constraints, and toxic effects to anaerobes (Gahlot et al., 2020;Nguyen et al., 2021). Figure 3. Iron-based materials used in DIET application. Moreover, although copper wire has good electrical conductivity, its addition to AD has not improved methane production, VFA pathway, and sludge digestion since the wire is too smooth for microbial attachment and colonization. Therefore, porosity, surface area, and electrical conductivity are crucial parameters for materials used for DIET (Yang et al., 2017). DIET enhancement via iron-based materials is due to the enrichment of iron-reducing microorganisms. Microorganisms can reduce iron oxides, generate current, and degrade organics. It can also replace cytochrome to shuttle electrons with conductive pili instead of forming conduit (Wang et al., 2021). Microorganisms with e-pili can attach to the iron-based nanoparticles for DIET. However, when the symbiotic microorganisms are distant, it may be challenging to stimulate DIET. In carbon-based materials, the syntrophic partners need to attach themselves to the materials for DIET (Gahlot et al., 2020). Cellular components such as membranes of methanogenic archaea function as electron exchangers for DIET (Gahlot et al., 2020). The effect of magnetite in enhancing DIET in pure cultures was studied. It was noticed that the nanoparticle of magnetite infiltrated into the cell membrane and cytoplasm of Methanosarcina barkeri while the DIET mechanism was being established (Gahlot et al., 2020). Magnetite electrical conductivity is about 1000 S/m. Therefore, it could make a well-balanced syntrophic relation between VFA oxidizing bacteria and Methanosarcina sp. to degrade acetate and propionate more rapidly (Yamada et al., 2015). Magnetite has also been used in continuous stirring tank reactor (CSTR) for a longer time. It increased methane yield and organic removal and stabilized the AD process (Baek et al., 2016). Magnetite can be captured by a magnet from being drained and be recycled. The recycled magnetite or other recycled DIET materials can retain biomass to avoid biomass wash-out, especially in low hydraulic retention time (HRT) anaerobic digesters. However, the improvement in the anaerobic digester facilitated by DIET material is not due to the microbial attachment to the materials or being retained in the digester. This attachment makes up only 5% of the biomass, while the methane increase is about 40%; therefore, the facilitators are indeed enhancing the DIET mechanism (Baek et al., 2018). The addition of magnetite can keep the improvement of increased biogas production for a prolonged (3 months) time in CSTR (Wang et al., 2021). Therefore, costs can be avoided by not adding the supplement continuously. Zerovalent iron can stimulate enzymes involved in acidogenesis (pyruvate ferredoxin, oxidoreductase, acetate kinase, etc.) and methanogenesis (F420-reducing hydrogenase). Moreover, its corrosion can provide extra H2to hydrogenotrophic methanogenesis. In addition, it reduces acidic accumulation in favor of methanogens (Chen et al., 2020). Sulfurization of ZVI can decline the H2produced by its corrosion. Its addition to AD has improved biogas production; however, cell membrane destruction and methanogenesis inhibition are reported (Chen et al., 2020). Diluted cheese whey was anaerobically digested in CSTR for a prolonged time (631 days) at varying HRTs of 20–7.5 days and varying OLRs of 0.125–0.33 g COD/L/d at mesophilic temperature. The control reactor decreased methane rate to 41.5 mL/L/d and decreased COD removal efficiency to 53.7% at day 93. Recovery of the reactor was started with 20 mM-Fe magnetite and reached a steady state on day 180 with a methane rate of 151.1 mL/L/d and a COD removal efficiency of 90.7% (Baek et al., 2023). **6 DIET application in AD** **6.1 Compatible materials for DIET in AD** The conductive materials for DIET in AD should be non-hazardous, chemically stable, cheap, recyclable, non-reactive, porous, conductive, microbe-friendly, and provide a large surface area (Gahlot et al., 2020). Most full-scale anaerobic digesters are CSTR; therefore, the retention of conductive materials is crucial. The density and particle size have significant roles in retention. Denser particles can settle down, and bigger particles can be strained at the digester outlet. However, the advanced nano CMs can be used as cloth, felt, etc., considering not to clog the outlets and agitator. Iron-based materials can be recovered by using their magnetic features. DIET stimulating media, either as a fixed bed or moving bed rather than a particle, may avoid loss of materials and be cost-effective (Gahlot et al., 2020). They could be porous sponges, wheels, brushes, rugged sheets, etc. (Gahlot et al., 2020). However, the fixed bed media may form a thick biofilm, limiting the mass transfer of substrate and subsequently reducing bioconversion. Therefore, moving bed media made of conductive materials is superior for stimulating DIET in AD (Gahlot et al., 2020). However, granular sludge or biofilms observed in up-flow anaerobic sludge blanket (UASB) reactor, packed bed reactor (PBR), expanded granular sludge bed (EGSB), and anaerobic membrane bioreactors (AnMBR) are the aggregate with syntrophic relationship (Wang et al., 2021). The stirring in CSTR gives microbes a more difficult biological link than UASB; however, adding CMs may facilitate the formation of aggregate in CSTR when DIET is being established (Wang et al., 2021). Therefore, DIET via a fixed bed is more stable but may cause other problems, such as reducing substrate mass transfer (Wang et al., 2021). Graphene addition at 120 mg/L to glucose wastewater has increased the methane rate by 51.4%. Several strategies application have increased methane rate, for example, magnetite by 20%–35%, biochar by 15%–45%, thermal pretreatment by 20%–100%, ultrasonic pretreatment by 20%–60%, alkaline pretreatment by 30%–80% and the co-digestion strategy by 20%–70%. In contrast, in another study, 1,000 mg/L of graphene to ethanol was reported as the optimum dose (Baek et al., 2018) to improve methane production. The difference may be because of the source of graphene, substrate used, conductivity value, and AD processing parameters. The addition of graphene and biochar for DEIT was decided based on their conductivity values (Nguyen et al., 2021). Graphene was added 0.5–2 g/L while biochar was added 5–30 g/L (Nguyen et al., 2021). However, the price of highly conductive material is high, for example, $100/kg of CNT (Baek et al., 2018), while graphene is estimated at around $140/kg (Nguyen et al., 2021). High doses of materials for DIET could be toxic for microorganisms in the AD process. It was observed that 0.12 g/L graphene inhibited methanogens while 0.03 g/L enhanced methane production by 14% (Nguyen et al., 2021). Activated carbon, which has substantially lower conductivity than graphene, is added about 1,000 times more (in weight) than graphene to the AD (Baek et al., 2018). However, the price of GAC is about $3/kg, which may compensate for its quality compared to nanomaterials unless there are concerns about volumes and availability. Biochar can be used widely for DIET since it is cheaper than granular AC. It can also adsorb toxic contaminants such as heavy metals, antibiotics, and other emerging contaminants, which otherwise may put stress on stable and fast AD (Gahlot et al., 2020). The digestate with biochar can be used as a bio-fertilizer since the nutrients are adsorbed by the biochar (Gahlot et al., 2020). A high load of glucose wastewater (6 g/L) was used to investigate the effect of biochar addition. It was observed that the degradation rate of VFA increased, and biochar enhanced the methane rate by 70.6% (Nguyen et al., 2021). Biochar usage in AD has reduced the lag phase by 10%–75% (Nguyen et al., 2021). The lag phase reduction was 30.3% when a biochar dose of 10 g/L was used (Nguyen et al., 2021). It is observed that biochar-amended anaerobic digester has achieved a 50% reduction in lag phase and 1.8 times higher methane yield (Kaur et al., 2020). Moreover, DIET materials application at the pilot scale endorses the lab-scale findings.Smith et al. (2022)reports a 15% increase methane yield and 40% faster VFA degradation for 5000 L digester treating wastewater with addition of magnetite at 10 mM concentration. However, they report materials aggregation after 6 months. A pilot scale (10 m3) study conducted byLee et al. (2021)revealed that anaerobic digestion of farm wastes amended with biochar at 5% (w/w) had a stable methane production at high OLR and the sludge volume was reduced by 30% which compensated the biochar procurement. Graphene oxide at 1 g/L was added to a 2000 L digester having sulfate at 500 mg/L concentration (Zhang et al., 2023). They reported no CH4improvement but a high COD removal of 92%. Li and his team conducted a pilot-scale (2000 L) study on riboflavin modified carbon cloth for anaerobic digestion of food waste (Li et al., 2024). They found that the DIET material could increase the OLR by 40% and the daily methane production by 25%. The above studies show that Pilot-scale studies validate the potential of DIET-enhancing materials to improve methane yield, organic loading rate, and process stability, though challenges like material aggregation and variable performance depending on waste type and additives remain. **6.2 DIET application in VFA-stressed AD** The effects of AC, Fe-modified AC, and goethite on methanogenesis to bio-convert VFAs were evaluated by Xu and his research team (Xu et al., 2020). The VFA concentration was about 4 g/L; nevertheless, the AD process achieved maximum methane production, 266 mL/gCOD, in a goethite-amended reactor. The increase was 48% and 110% compared to AD amended by AC and Fe-modified AC, respectively. Goethite helped activate Fe-containing enzymes (F420) involved in methanogenesis and acidogenesis. It improved selective functional microorganisms and DIET by helping the growth of Syntrophomonadacease. Therefore, the authors concluded that goethite is more favorable for methanogenesis than AC under acid-stressed AD (Xu et al., 2020). They extended the AD of only butyric acid to investigate the enhancement in biogas production under stressed VFA concentration (4 g/L) (Xu et al., 2020). They found that methane yield increased by 17% compared to control. Propionate acid is often observed accumulated in AD because the acetogenesis of propionate is critical thermodynamically unless the partial pressure of hydrogen is below 10–4 atm. (Yang et al., 2017). Therefore, a low biogas production rate and about-to-fail digester may happen. This state is recoverable by the rapid electron transfer and enrichment of syntrophic partners via DIET (Wang et al., 2021). In an up-flow anaerobic digester, AC can relieve the acid stress of wastewater. The CMs might change the pathway in which VFAs are decomposed, which otherwise regular digesters without CMs follow (Yang et al., 2017). The pH variation may affect those pathways since the addition of AC usually increases the pH of the AD process (Yang et al., 2017). **6.3 DIET application in AD with high organic loading** Carbon cloth with a potential application for a high organic loading rate of 2.88–10.88 kg COD/m3/d (ethanol) was tested for DIET enhancement (Liu X. et al., 2020). Anode and cathode electrodes were wrapped in carbon cloth, and potentials of +0.7 and −0.7 V were applied. The amended reactors significantly enriched DIET-related exoelectrogens (bacteria) and methanogens. However, VFA accumulated rapidly, especially in the positive-poised reactor, which indicates that potential applications (positive and negative) had adverse effects on biodegradation. Both reactors, amended with carbon cloth and current (positive and negative), could not withstand high loadings (Liu X. et al., 2020). Therefore, the optimum amendment was a noncurrent reactor with only carbon cloth (Liu X. et al., 2020). **6.4 DIET application in ammonia stressed AD** An anaerobic digester augmented by carbon-based material can ease ammonia stress by improving the growth of certain microorganisms such as Geobacteriaceae and the archaeal group Methanosarcina (Gahlot et al., 2020). It is observed that the addition of magnetite improved the lag phase and specific methanogenic activity by 21% and 58%, respectively, when the digester was stressed under a high ammonia concentration of 6.5 g/L (Wang et al., 2021). Thermal hydrolysis pretreatment of WAS for AD increases the ammonia concentration, which affects system stability and performance. ZVI (10 mM-Fe), magnetite (10 mM-Fe), and powdered AC (0.5 g/L) amendments were applied to investigate their effect on the AD process with a total ammonia nitrogen dose of 1.5–5.5 g (Yan et al., 2020). The batch mode mesophilic AD had 30 days HRT. ZVI performed better than magnetite, but powdered AC (PAC) was poor under ammonia-stressed conditions. PAC’s poor performance was attributed to the selective growth of Methanosaeta, which is sensitive to ammonia toxicity (Yan et al., 2020). Biochar derived from rice straw with different 2–15 g/L doses was investigated on piggery wastewater with under-stressed ammonia concentrations of 900–3,500 mg/L (Cheng et al., 2020). The batch scale mesophilic AD for 25 days revealed that an increase of ammonia without the addition of biochar resulted in the decrease of biogas yield by 69%, reduced COD removal (67.7%–38.1%) and reduced methane content (61.5%–56.1%) when ammonia concentration was increasing from 0.9 to 3.5 g/L (Cheng et al., 2020). On the other hand, biochar addition under no ammonia stress increased COD removal to 83.8% and biogas yield by 78% at an optimum dose of biochar (15 g/L) compared to control. Biochar addition under ammonia stress resulted in 70.4% COD removal and a biogas increase by 45% compared to control (Cheng et al., 2020). It implies that the amendment of the ammonia-stressed AD process with biochar can relieve ammonia toxicity and increase biogas production. **7 Enhanced biogas production with DIET** The structure, dose, and type of DIET-enhancing materials drive the improvement of biogas production in AD but cannot necessarily be cost-effective. Different nano-sized metal oxides, namely, tantalum oxide and niobium oxide, which have a hexagonal crystalline structure, and tungsten oxide and hafnium oxide, which have a monoclinic crystalline structure, were used in AD of dairy manure and sewage sludge (Yun et al., 2021). All metal oxides improved the DIET mechanism by providing superior crystal structure, electrical conductivity, and electron exchange capacity, enhancing biodegradation. The tantalum oxide with hexagonal crystalline structure proved to be better than other oxides and increased the biogas production by 89%. However, the increased biogas production can only compensate for the price of metal procurement if the capacity of the AD plant is more than 10,000 m3(Yun et al., 2021). Moreover, the optimum dose of DIET-enhancing materials depends on the feedstock and the processing parameters of AD. Different doses of nano-sized graphene (0–2 g/L) and AC (0–30 g/L) were used in AD of ethanol (Lin et al., 2017). Graphene with the dose of 1 g/L was the optimum concentration to boost bio-methane production maximally by 25% compared to control. Although the optimum graphene dose was low, its high electrical conductivity and specific surface area enhanced biogas production. Moreover, its higher doses may have triggered cytotoxicity, inhibiting biodegradation. On the other hand, AC with a dose of 20 g/L was the optimum concentration to increase bio-methane production maximally by 12.8% compared to control (Lin et al., 2017). In another study,Tian et al. (2017)investigated improved biodegradation of synthetic wastewater by adding graphene (0–120 mg/L). They found that 30 mg/L improved methane production by 14.3% while 120 mg/L inhibited bio-methanation. **8 Enhanced microbial interaction with DIET** DIET enhancement is directly related to DIET surface area. In general, larger surfaces provide more significant microbial colonization than smaller ones, enhancing functional microorganisms’ growth and stimulating DIET (Xu et al., 2020). Several microorganisms are capable of transferring and receiving electrons via abiotic materials, thus making them biocompatible (Gahlot et al., 2020). By adding CMs to AD, in addition to Geobacter species, Thauera species, Gordonia species, Syntrophomonas species,Clostridiumspecies, Spirochaeta species, andBacteroidesspecies, their syntrophic methanogenic partners have been enhanced (Nguyen et al., 2021).Figure 4shows how microbial community is altered when DIET materials are introduced in an anaerobic digestion process. The microbial community is dominated by fermentative bacteria (e.g.,Clostridium), hydrogen/formate-dependent syntrophs (e.g., Syntrophomonas) and hydrogenotrophic methanogens (e.g., Methanobacterium) when no DIET materials are used and the oxdition and reduction is slow. However, on introducing DIET materials, Geobacter, an elctroactive bacteria that directly transfer electrons to methanogens via conductive materials, and Methanosarcina, an elecro-accepting methanogens become dominant and theClostridiumand Methanobacterium fade out. It has been shown that granular activated carbon, biochar, and other DIET-enhancing materials can increase DIET for increased biogas production in AD of WAS (Yang et al., 2017). Biochar concentration of 0–5 g/L was added to AD of WAS byYang et al. (2017); they found that methane production and sludge reduction improved by 17.4% and 6.1%, respectively, at 5 g/L dose. They further claim that improvement in the Geobacter population resulted in increased biogas production. However, the increased biogas production is not limited to microbiome development since complex substrates amended with CMs have developed a limited Geobacter population when compared to soluble substrates such as ethanol (Wang et al., 2021). Figure 4. DIET materials altering microbial community;(a)Microbial community without DIET materials;(b)Microbial community with DIET materials. Non-conductive materials do not contribute to the enhancement of the methanogenesis step in AD. GAC and zeolite with 1 g/L were investigated in the AD process byZhang et al. (2017). They found that conductive GAC improved the methanogenesis step of AD, but the zeolite did not. They further claim that the improvement in the step was because of DIET stimulation rather than the surge of microbial biomass. Moreover, the biomass was mainly suspended rather than attached to the surface of the GAC. The study further concludes that GAC has established a c-type cytochrome mechanism in DIET after they found lower cytochrome concentration in the medium culture. Chen et al. (2020)state that the inspiration of DIET enhances the population of DIET-related microorganisms such as Syntrophomonas, Methanosarcina, and Methanobacterium, improving biodegradation. They studied the effects of different doses (2–10 g/L) of sulfidated microscale ZVI (S-mZVI) in the AD of WAS and food waste. They concluded that S-mZVI at 10 g/L increased the methane production by 33%, and the improvement was due to the DIET-related microorganisms.Chen et al. (2020)claim that the inspiration of DIET enhances the population of DIET-related microorganisms such as Syntrophomonas, Methanosarcina, and Methanobacterium, improving biodegradation. They studied the effects of different doses (2–10 g/L) of sulfidated microscale ZVI (S-mZVI) in the AD of WAS and food waste. They concluded that S-mZVI at 10 g/L increased the methane production by 33%, and the improvement was due to the DIET-related microorganisms. In the same way,Guo et al. (2020)affirms electroactive DIET-related microorganisms, including bacteria such as Geobacter, Syntrophus, Desulfovibrio, and Blvii28, and archaea such as Methanospirillum, Methanosaeta were increased on GAC biofilm. The GAC was used at 25 g/L in UASB with 2 g/L/d COD at 20°C. After running the system for 170 days, they found 5.8 times more COD removal in GAC-added UASB than control. In addition, the study performed RNA- and DNA-based analysis and found a higher difference in microorganism community between the reactors in DNA-based analysis than RNA-based analysis. Electroactive DIET-related microorganisms, including bacteria and archaea, dominate with DIET stimulation.Lin et al. (2017)investigated the effects of graphene in the AD of ethanol. They found that Geobacter, the most effective microorganism in oxidizing organic matter,Pseudomonas, VFA oxidizing bacteria, and Levilinea, a fermentative bacterium, and Methanosaeta, Methanobacterium, and Methanoliea were the most dominant bacterial and archaeal communities, respectively, in the process. Similarly, in the fermentation stage of citrus peel waste, the dominant bacteria wereEscherichiaandClostridium, cellulolytic enzyme producers, while in the methanogenesis stage, Methanoplasma and Methanosarcina were the dominant microbiomes (Camargo et al., 2021). **9 Drawbacks of DIET-Stimulating materials** Despite the advantages of Direct Interspecies Electron Transfer (DIET)-stimulating materials in enhancing anaerobic digestion, several significant limitations hinder their broader implementation. These drawbacks include material fouling, poor long-term stability, cytotoxicity of nanomaterials, and economic constraints. **9.1 Material fouling and loss of conductivity** Material fouling is a major challenge in the application of conductive additives. The accumulation of microbial biofilms and inorganic precipitates on material surfaces can significantly reduce conductivity and limit electron transfer efficiency over time (Park et al., 2018). For instance, carbon-based materials such as activated carbon and graphene are particularly prone to surface passivation, which impairs their ability to mediate electron exchange between microbial species (Liu Y. et al., 2020). Fouled materials are often difficult to regeneratein situ, necessitating physical removal and replacement, which adds to operational complexity. **9.2 Long-term stability and deactivation** The long-term stability of DIET-enhancing materials remains a concern, particularly under variable operational conditions such as pH fluctuations, temperature changes, and varying organic loading rates. Studies have shown that materials like magnetite exhibit relatively consistent performance over time (Zhao et al., 2015), whereas others, such as graphene and carbon nanotubes (CNTs), may undergo physical degradation or become encapsulated within the anaerobic sludge matrix (Xu et al., 2021). This encapsulation reduces their accessibility and effectiveness in facilitating DIET, and material washout in continuous systems further exacerbates the problem (Chen et al., 2019). **9.3 Cytotoxicity of nanomaterials** Nanomaterials such as graphene, CNTs, and zerovalent iron (ZVI) have raised toxicity concerns in anaerobic environments. These materials, due to their high reactivity and nanoscale dimensions, can disrupt microbial cell membranes, inhibit enzymatic functions, and induce oxidative stress (Ren et al., 2019). Graphene oxide, for instance, has been shown to inhibit methanogenic activity by damaging cell membranes and producing reactive oxygen species (ROS) (Zhang et al., 2020). Similarly, excessive release of Fe2+and Fe3+ions from ZVI can cause local pH shifts or unwanted precipitation, both of which are detrimental to microbial communities (Liu et al., 2018). **9.4 Economic and operational constraints** The cost and scalability of DIET-stimulating materials also present barriers. While biochar and granular activated carbon (GAC) are relatively affordable and scalable for large-scale use (Tan et al., 2019), materials like graphene and CNTs are expensive and require complex synthesis procedures. Additionally, challenges in achieving uniform distribution, optimizing dosing strategies, and recovering materials from digesters hinder practical implementation (Wang et al., 2022). These limitations highlight the need for balancing performance benefits with economic feasibility and environmental safety. **10 Conclusion** The biodegradation of recalcitrant organic wastes such as lignocellulosic biomass and waste activated sludge (WAS) is significantly hindered by the presence of lignin, robust microbial cell structures, and extracellular polymeric substances (EPS). To overcome these limitations, pretreatment methods and the application of carbon-based and iron-based materials to stimulate Direct Interspecies Electron Transfer (DIET) have been widely explored. Enhancing the syntrophic interactions between volatile fatty acid (VFA)-oxidizing bacteria and hydrogenotrophic methanogens via DIET has been shown to substantially improve the efficiency and stability of the anaerobic digestion (AD) process. DIET modifies the microbial metabolic pathways, as evidenced by changes in microbial community composition, diversity, abundance, and associated enzymatic activity. Its stimulation not only improves methane yield and biogas quality but also contributes to the resilience of digesters under conditions of VFA and ammonia stress. For practical deployment, DIET-conductive materials must fulfill several critical properties: they should be non-toxic, chemically and thermally stable, cost-effective, recyclable, non-reactive, porous, electrically conductive, and microbiome-compatible with sufficient surface area to support biofilm development. Future research should prioritize the integration of DIET materials into large-scale AD systems to investigate the long-term performance, material stability, and regeneration. Moreover, comprehensive techno-economic assessments and life cycle analyses are needed to evaluate the financial viability and environmental impact of implementing DIET-based strategies while emphasizing on the development of low-cost, sustainable DIET materials such as biochar or naturally occurring minerals, with a focus on environmental compatibility and circular economy principles. **Author contributions** AA: Conceptualization, Writing – review and editing, Methodology, Project administration, Writing – original draft, Formal Analysis. AR: Methodology, Formal Analysis, Writing – original draft, Data curation, Validation. KK: Writing – review and editing, Conceptualization. FM: Supervision, Writing – review and editing. AK: Writing – review and editing. MA: Methodology, Writing – review and editing, Writing – original draft, Conceptualization. AK: Writing – review and editing, Supervision. **Funding** The author(s) declare that no financial support was received for the research and/or publication of this article. **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Generative AI statement** The author(s) declare that no Generative AI was used in the creation of this manuscript. **Publisher’s note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **Abbreviations** AC, Activated carbon; AD, Anaerobic digestion; AnMBR, Anaerobic membrane bioreactors; CM, Carbon-based materials; CNT, Carbon nanotubes; COD, Chemical oxygen demand; CSTR, Continuous stirring tank reactor; DIET, Direct interspecies electron transfer; EGSB, Expanded granular sludge bed; EPS, Extracellular polymeric substances; GAC, Granular activated carbon; HRT, Hydraulic retention time; IET, Interspecies electron transfer; IHT, Interspecies hydrogen transfer; IIET, Indirect interspecies electron transfer; MFC, Microbial fuel cells; PANI, Polyaniline; PBR, Packed bed reactor; UASB, Up-flow anaerobic sludge blanket; VFA, Volatile fatty acid; VSS, Volatile suspended solids; WAS, Waste activated sludge. **References** Altamirano-Corona, M. F., Anaya-Reza, O., and Durán-Moreno, A. (2021). Biostimulation of food waste anaerobic digestion supplemented with granular activated carbon, biochar and magnetite: a comparative analysis.Biomass Bioenergy149, 106105. doi:10.1016/j.biombioe.2021.106105 CrossRef Full Text|Google Scholar Anukam, A., Mohammadi, A., Naqvi, M., and Granström, K. (2019). A review of the chemistry of anaerobic digestion: methods of accelerating and optimizing process efficiency.Processes7 (8), 504. doi:10.3390/pr7080504 CrossRef Full Text|Google Scholar Baek, G., Kim, J., Kim, J., and Lee, C. (2018). Role and potential of direct interspecies electron transfer in anaerobic digestion.Energies11 (1), 107. doi:10.3390/en11010107 CrossRef Full Text|Google Scholar Baek, G., Kim, J., and Lee, C. (2016). A long-term study on the effect of magnetite supplementation in continuous anaerobic digestion of dairy effluent–Enhancement in process performance and stability.Bioresourx Technol.222, 344–354. doi:10.1016/j.biortech.2016.10.019 PubMed Abstract|CrossRef Full Text|Google Scholar Baek, G., Lee, C., and Yoon, J. (2023). Machine learning approach for predicting anaerobic digestion performance and stability in direct interspecies electron transfer-stimulated environments.Biochem. Eng. J.193, 108840. doi:10.1016/j.bej.2023.108840 CrossRef Full Text|Google Scholar Camargo, F. P., Sakamoto, I. K., Duarte, I. C. S., Silva, E. L., and Varesche, M. B. A. (2021). Metataxonomic characterization of bacterial and archaeal community involved in hydrogen and methane production from citrus peel waste (Citrus sinensis L. Osbeck) in batch reactors.Biomass Bioenergy149, 106091. doi:10.1016/j.biombioe.2021.106091 CrossRef Full Text|Google Scholar Chen, S., Rotaru, A. E., Liu, F., Philips, J., Woodard, T. L., Nevin, K. P., et al. (2014). Carbon cloth stimulates direct interspecies electron transfer in syntrophic co-cultures.Bioresour. Technol.173, 82–86. doi:10.1016/j.biortech.2014.09.009 PubMed Abstract|CrossRef Full Text|Google Scholar Chen, S., Tao, Z., Yao, F., Wu, B., He, L., Hou, K., et al. (2020). Enhanced anaerobic co-digestion of waste activated sludge and food waste by sulfidated microscale zerovalent iron: insights in direct interspecies electron transfer mechanism.Bioresour. Technol.316, 123901. doi:10.1016/j.biortech.2020.123901 PubMed Abstract|CrossRef Full Text|Google Scholar Cheng, Q., Xu, C., Huang, W., Jiang, M., Yan, J., Fan, G., et al. (2020). Improving anaerobic digestion of piggery wastewater by alleviating stress of ammonia using biochar derived from rice straw.Environ. Technol. and Innovation19, 100948. doi:10.1016/j.eti.2020.100948 CrossRef Full Text|Google Scholar Choi, Y., Hao, C., Helm, P. A., Bhavsar, S. P., and Kim, S. D. (2022). Organophosphate esters in Great Lakes fish: an improved analysis to assess concentrations and human exposure via consumption.Sci. Total Environ.807, 150981. doi:10.1016/j.scitotenv.2021.150981 PubMed Abstract|CrossRef Full Text|Google Scholar Eichinger, S., Boch, R., Leis, A., Baldermann, A., Domberger, G., Schwab, C., et al. (2022). Green inhibitors reduce unwanted calcium carbonate precipitation: implications for technical settings.Water Res.208, 117850. doi:10.1016/j.watres.2021.117850 PubMed Abstract|CrossRef Full Text|Google Scholar Gahlot, P., Ahmed, B., Tiwari, S. B., Aryal, N., Khursheed, A., Kazmi, A. A., et al. (2020). Conductive material engineered direct interspecies electron transfer (DIET) in anaerobic digestion: mechanism and application.Environ. Technol. and innovation20, 101056. doi:10.1016/j.eti.2020.101056 CrossRef Full Text|Google Scholar Guo, B., Zhang, Y., Zhang, L., Zhou, Y., and Liu, Y. (2020). RNA-based spatial community analysis revealed intra-reactor variation and expanded collection of direct interspecies electron transfer microorganisms in anaerobic digestion.Bioresour. Technol.298, 122534. doi:10.1016/j.biortech.2019.122534 PubMed Abstract|CrossRef Full Text|Google Scholar Kato, S., Hashimoto, K., and Watanabe, K. (2012). Methanogenesis facilitated by electric syntrophy via (semi) conductive iron-oxide minerals.Environ. Microbiol.14 (7), 1646–1654. doi:10.1111/j.1462-2920.2011.02611.x PubMed Abstract|CrossRef Full Text|Google Scholar Kaur, G., Johnravindar, D., and Wong, J. W. (2020). Enhanced volatile fatty acid degradation and methane production efficiency by biochar addition in food waste-sludge co-digestion: a step towards increased organic loading efficiency in co-digestion.Bioresour. Technol.308, 123250. doi:10.1016/j.biortech.2020.123250 PubMed Abstract|CrossRef Full Text|Google Scholar Li, Y., Huang, Y., Li, H., Gou, M., Xu, H., Wu, H., et al. (2024). Riboflavin modified carbon cloth enhances anaerobic digestion treating food waste in a pilot-scale system.Front. Bioeng. Biotechnol.12, 1395810. doi:10.3389/fbioe.2024.1395810 PubMed Abstract|CrossRef Full Text|Google Scholar Lin, R., Cheng, J., Zhang, J., Zhou, J., Cen, K., and Murphy, J. D. (2017). Boosting biomethane yield and production rate with graphene: the potential of direct interspecies electron transfer in anaerobic digestion.Bioresour. Technol.239, 345–352. doi:10.1016/j.biortech.2017.05.017 PubMed Abstract|CrossRef Full Text|Google Scholar Liu, F., Rotaru, A. E., Shrestha, P. M., Malvankar, N. S., Nevin, K. P., and Lovley, D. R. (2012). Promoting direct interspecies electron transfer with activated carbon.Energy and Environ. Sci.5 (10), 8982–8989. doi:10.1039/C2EE22459C CrossRef Full Text|Google Scholar Liu, T., Ou, H., Su, K., Hu, Z., He, C., and Wang, W. (2021). Promoting direct interspecies electron transfer and acetoclastic methanogenesis for enhancing anaerobic digestion of butanol octanol wastewater by coupling granular activated carbon and exogenous hydrogen.Bioresour. Technol.337, 125417. doi:10.1016/j.biortech.2021.125417 PubMed Abstract|CrossRef Full Text|Google Scholar Liu, X., Chen, Q., Sun, D., Wang, Y., Dong, H., Dang, Y., et al. (2020). Applying potentials to conductive materials impairs High-loading anaerobic digestion performance by affecting direct interspecies electron transfer.Bioresour. Technol.297, 122422. doi:10.1016/j.biortech.2019.122422 PubMed Abstract|CrossRef Full Text|Google Scholar Liu, Y., He, P., Zhang, H., and Shao, L. (2020). Enhancing methane production of waste activated sludge digestion by graphene: role of direct interspecies electron transfer.Renew. Energy149, 587–596. doi:10.1016/j.renene.2019.12.085 CrossRef Full Text|Google Scholar Mohammad Rahmani, A., Gahlot, P., Moustakas, K., Kazmi, A. A., Shekhar Prasad Ojha, C., and Tyagi, V. K. (2022). Pretreatment methods to enhance solubilization and anaerobic biodegradability of lignocellulosic biomass (wheat straw): progress and challenges.Fuel319, 123726. doi:10.1016/j.fuel.2022.123726 CrossRef Full Text|Google Scholar Munshi, F. M. A., Almegbl, A. M., Rahmani, A. M., Khursheed, A., Ali, M., and Khursheed, A. (2024). Thermal chemical pretreatment of waste-activated sludge for enhanced solubilization and biogas production: a review.Water Reuse14, 459–480. doi:10.2166/wrd.2024.049 CrossRef Full Text|Google Scholar Nguyen, L. N., Vu, M. T., Abu Hasan Johir, M., Pernice, M., Ngo, H. H., Zdarta, J., et al. (2021). Promotion of direct interspecies electron transfer and potential impact of conductive materials in anaerobic digestion and its downstream processing-a critical review.Bioresour. Technol.341, 125847. doi:10.1016/j.biortech.2021.125847 PubMed Abstract|CrossRef Full Text|Google Scholar Park, J. H., Ok, Y. S., Kim, S. H., Cho, J. S., Heo, J. S., and Delaune, R. D. (2018). Biochar use for sustainable agriculture: effects on soil properties and crop productivity.Bioresour. Technol.227, 35–44. doi:10.1016/j.biortech.2016.12.018 CrossRef Full Text|Google Scholar Ren, N., Zhao, L., Chen, C., and Guo, W. (2019). Toxicity of carbon nanomaterials on anaerobic digestion microorganisms.Environ. Sci. and Technol.53 (2), 899–909. doi:10.1021/acs.est.8b04679 CrossRef Full Text|Google Scholar Rotaru, A. E., Shrestha, P. M., Liu, F., Markovaite, B., Chen, S., Nevin, K. P., et al. (2014). Direct interspecies electron transfer between Geobacter metallireducens and Methanosarcina barkeri.Appl. Environ. Microbiol.80 (15), 4599–4605. doi:10.1128/aem.00895-14 PubMed Abstract|CrossRef Full Text|Google Scholar Shao, B., Dong, H., Feng, L., Qiao, J., and Guan, X. (2020). Influence of [sulfite]/[Fe(VI)] molar ratio on the active oxidants generation in Fe(VI)/sulfite process.J. Hazard. Mater.384, 121303. doi:10.1016/j.jhazmat.2019.121303 PubMed Abstract|CrossRef Full Text|Google Scholar Singh, G., Tiwari, A., Gupta, A., Kumar, A., Hariprasad, P., and Sharma, S. (2021). Bioformulation development via valorizing silica-rich spent mushroom substrate with Trichoderma asperellum for plant nutrient and disease management.J. Environ. Manag.297, 113278. doi:10.1016/j.jenvman.2021.113278 PubMed Abstract|CrossRef Full Text|Google Scholar Tan, X., Liu, Y., Zeng, G., Wang, X., Hu, X., Gu, Y., et al. (2015). Application of biochar for the removal of pollutants from aqueous solutions.Chemosphere125, 70–85. doi:10.1016/j.chemosphere.2014.12.058 PubMed Abstract|CrossRef Full Text|Google Scholar Tian, T., Qiao, S., Li, X., Zhang, M., and Zhou, J. (2017). Nano-graphene induced positive effects on methanogenesis in anaerobic digestion.Bioresour. Technol.224, 41–47. doi:10.1016/j.biortech.2016.10.058 PubMed Abstract|CrossRef Full Text|Google Scholar Wang, Z., Wang, T., Si, B., Watson, J., and Zhang, Y. (2021). Accelerating anaerobic digestion for methane production: potential role of direct interspecies electron transfer.Renew. Sustain. Energy Rev.145, 111069. doi:10.1016/j.rser.2021.111069 CrossRef Full Text|Google Scholar Xu, S., Zhang, W., Zuo, L., Qiao, Z., and He, P. (2020). Comparative facilitation of activated carbon and goethite on methanogenesis from volatile fatty acids.Bioresour. Technol.302, 122801. doi:10.1016/j.biortech.2020.122801 PubMed Abstract|CrossRef Full Text|Google Scholar Yamada, C., Kato, S., Ueno, Y., Ishii, M., and Igarashi, Y. (2015). Conductive iron oxides accelerate thermophilic methanogenesis from acetate and propionate.J. Biosci. Bioeng.119 (6), 678–682. doi:10.1016/j.jbiosc.2014.11.001 PubMed Abstract|CrossRef Full Text|Google Scholar Yan, W., Mukherjee, M., and Zhou, Y. (2020). Direct interspecies electron transfer (DIET) can be suppressed under ammonia-stressed condition–reevaluate the role of conductive materials.Water Res.183, 116094. doi:10.1016/j.watres.2020.116094 PubMed Abstract|CrossRef Full Text|Google Scholar Yang, Y., Zhang, Y., Li, Z., Zhao, Z., Quan, X., and Zhao, Z. (2017). Adding granular activated carbon into anaerobic sludge digestion to promote methane production and sludge decomposition.J. Clean. Prod.149, 1101–1108. doi:10.1016/j.jclepro.2017.02.156 CrossRef Full Text|Google Scholar Yun, S., Xing, T., Han, F., Shi, J., Wang, Z., Fan, Q., et al. (2021). Enhanced direct interspecies electron transfer with transition metal oxide accelerants in anaerobic digestion.Bioresour. Technol.320, 124294. doi:10.1016/j.biortech.2020.124294 PubMed Abstract|CrossRef Full Text|Google Scholar Zamel, D., Pan, X., and Ye, Z. L. (2024). Ethanol-mediated anaerobic digestion: functional bacteria and metabolic pathways.Chemosphere367, 143560. doi:10.1016/j.chemosphere.2024.143560 PubMed Abstract|CrossRef Full Text|Google Scholar Zhang, R., Liu, Y., and Patel, P. (2023). Graphene oxide as a DIET facilitator in sulfate-rich anaerobic environments: trade-offs between COD removal and methane yield.Appl. Microbiol. Biotechnol.107 (5), 2345–2358. doi:10.1007/s00253-023-11435-1 CrossRef Full Text|Google Scholar Zhang, S., Chang, J., Lin, C., Pan, Y., Cui, K., Zhang, X., et al. (2017). Enhancement of methanogenesis via direct interspecies electron transfer between Geobacteraceae and Methanosaetaceae conducted by granular activated carbon.Bioresour. Technol.245, 132–137. doi:10.1016/j.biortech.2017.08.111 PubMed Abstract|CrossRef Full Text|Google Scholar Zhao, J., Tao, X., Li, J., Jia, Y., and Shao, T. (2021). Biochar-enhanced anaerobic digestion in farm-scale systems: microbial shifts and process stability under high organic loading.Bioresour. Technol.320 (Part A), 124341. doi:10.1016/j.biortech.2020.124341 PubMed Abstract|CrossRef Full Text|Google Scholar Zhao, Z., Zhang, Y., Chen, S., and Quan, X. (2015). Bio-electrochemical enhancement of anaerobic digestion with magnetite: direct interspecies electron transfer between electroactive microorganisms.Environ. Sci. and Technol.49 (7), 4104–4111. doi:10.1021/es5053207 CrossRef Full Text|Google Scholar Keywords:anaerobic digestion, syntrophic relation, direct interspecies electron transfer, biogas production, carbon-based materials Citation:Almegbl AM, Rahmani AM, Kamal K, Munshi FMA, Khursheed A, Ali M and Khursheed A (2025) Retrospective of DIET process for enhanced biogas production during anaerobic digestion of thermal/chemically pretreated waste activated sludge.Front. Environ. Eng.4:1597684. doi: 10.3389/fenve.2025.1597684 Received:21 March 2025;Accepted:28 May 2025;Published:11 June 2025. Edited by: Reviewed by: Copyright© 2025 Almegbl, Rahmani, Kamal, Munshi, Khursheed, Ali and Khursheed. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY).The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Muntjeer Ali,bXVudGF6aXIuY2VAc3JpYy5paXRyLmFjLmlu Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract 1 Highlights 2 Introduction 3 Significance of DIET 4 Electron transfer in DIET 5 Materials used for DIET 6 DIET application in AD 7 Enhanced biogas production with DIET 8 Enhanced microbial interaction with DIET 9 Drawbacks of DIET-Stimulating materials 10 Conclusion Author contributions Funding Conflict of interest Generative AI statement Publisher’s note Abbreviations References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}