{"id": 754, "name": "KIII - Corpus Christi News", "domain": "kiiitv.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kiiitv.com/article/news/local/san-antonio-texas-usa-today-10-best-readers-choice-awards-shops-la-cantera-shopping-center-ranked-number-one-nation/273-97318c89-bfca-4edb-9cd5-589423abbd34", "title": "San Antonio Texas Usa Today 10 Best Readers Choice Awards Shops La Cantera Shopping Center Ranked Number One Nation", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalNation WorldNear MeMoneyPoliticsHealthEntertainment3NEWS OriginalsLatest News StoriesThe Shops at La Cantera in SA named No.1 shopping center in the country in this new pollNew Joe David Padron double-murder case stalled by missing documents, prosecutor says Back Local Nation World Near Me Money Politics Health Entertainment 3NEWS Originals The Shops at La Cantera in SA named No.1 shopping center in the country in this new poll New Joe David Padron double-murder case stalled by missing documents, prosecutor says Back Local Nation World Near Me Money Politics Health Entertainment 3NEWS Originals The Shops at La Cantera in SA named No.1 shopping center in the country in this new poll New Joe David Padron double-murder case stalled by missing documents, prosecutor says WeatherBackForecastRadar10-DayHourlyMapsWeather CamsClosings & DelaysHurricane CentralTrafficLatest Weather StoriesTROPICAL UPDATE: Atlantic remains quiet; Pacific is active.Additional showers & storms will be possible in the Coastal Bend Thursday morning. Back Forecast Radar 10-Day Hourly Maps Weather Cams Closings & Delays Hurricane Central Traffic TROPICAL UPDATE: Atlantic remains quiet; Pacific is active. Additional showers & storms will be possible in the Coastal Bend Thursday morning. Back Forecast Radar 10-Day Hourly Maps Weather Cams Closings & Delays Hurricane Central Traffic TROPICAL UPDATE: Atlantic remains quiet; Pacific is active. Additional showers & storms will be possible in the Coastal Bend Thursday morning. SportsBackHigh School SportsIslandersJavelinasHooksIceRaysLocked On Podcast NetworkLatest StoriesCalallen celebrating baseball and softball titles with paradeNCAA will allow coaches' challenges in men's and women's basketballMen's and women's basketball coaches can now challenge officials' calls, NCAA saysNCAA announces new rule changes for men's and women's basketballCollege basketball coaches will be allowed to challenge officials' calls next season Back High School Sports Islanders Javelinas Hooks IceRays Locked On Podcast Network Calallen celebrating baseball and softball titles with parade NCAA will allow coaches' challenges in men's and women's basketballMen's and women's basketball coaches can now challenge officials' calls, NCAA saysNCAA announces new rule changes for men's and women's basketballCollege basketball coaches will be allowed to challenge officials' calls next season Back High School Sports Islanders Javelinas Hooks IceRays Locked On Podcast Network Calallen celebrating baseball and softball titles with parade NCAA will allow coaches' challenges in men's and women's basketballMen's and women's basketball coaches can now challenge officials' calls, NCAA saysNCAA announces new rule changes for men's and women's basketballCollege basketball coaches will be allowed to challenge officials' calls next season SearchSearch:Search Advertise With Us Tell3 Domingo Live Our Home 3Star Contests Around the Bend Y'all-itics **The Shops at La Cantera in SA named No.1 shopping center in the country in this new poll** **** To stream 3NEWS on your phone, you need the 3NEWS app. **** **Download the 3NEWS app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video SAN ANTONIO — San Antonio is home to theNo. 1 shopping center in the country, according to a new poll. The Shops at La Cantera, the only shopping center in Texas to place in its category, debuted on USA Today 10Best Readers' Choice Awards — ranking number one in the nation. Opened in 2005, the open-air mall located in the heart of the La Cantera District of San Antonio, features more than 165 quality retail shops and world class restaurants surrounded by lush greenery and soothing water elements. This recognition comes as the shopping center celebrates it's 20th anniversary. \"We are honored to be recognized by USA TODAY 10Best Readers’ Choice Awards and are grateful for this distinction that comes directly from industry experts, readers and guests who have experienced our truly distinctive shopping center,\" said Brian Schroeder, senior general manager of The Shops at La Cantera. Best Shopping Center in the nation! We are honored to be recognized by USA TODAY 10Best Readers’ Choice Awards and are... **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}