{"id": 54, "name": "Airwars", "domain": "airwars.org", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://airwars.org/dutch-mod-releases-results-of-largest-ever-assessment-of-civilian-harm-allegations-from-the-war-against-isis/", "title": "Dutch Mod Releases Results Of Largest Ever Assessment Of Civilian Harm Allegations From The War Against Isis", "content": "**Dutch MoD releases results of largest ever assessment of civilian harm allegations from the war against ISIS** Release marks unprecedented transparency in military casualty reviews After a year long engagement, the Dutch Ministry of Defencehave released detailed findings to Parliamenton the outcome of 61 allegations of civilian harm identified by Airwars in proximity to Dutch airstrikes in the war against the Islamic State in Iraq and Syria. In a rare and constructive dialogue, Dutch involvement has now been excluded from at least 39 incidents of civilian harm in the war against ISIS, raising renewed questions for allies who have yet to investigate any allegations of harm during the eight year campaign that claimed thousands of civilian lives according to independent monitors and experts. A further 22 cases were deemed to have “insufficient detail” by the Dutch MoD due to a lack of available information contained in the original Airwars reports that allowed the MoD to cross-check these allegations against their own mission data. This is the first time that the criteria for cross-checking allegations has been made publicly available, in a move that will strengthen independent referrals to the MoD in future operations. Airwars hopes to continue to work with the Dutch MoD to improve the methodology further when it comes to reviewing cases such as these in future. In total, Airwars has an archive of2,978 incidents of civilian harmallegedly caused by the US-led coalition in the war against ISIS and estimates that a minimum of 8,000 civilians were killed. More than 300 of these cases have been conceded by the Coalition, but only four member nations, including the Netherlands, have ever acknowledged harm from their individual involvement. Other members, including France and Belgium have used the anonymity of the Coalition to avoid declaring which strikes their militaries conducted, cutting off routes for accountability. “The Dutch Ministry of Defence has shown strong leadership on this issue, once again making concrete steps far in advance of its allies when it comes to the protection of civilians,” said Emily Tripp, Executive Director at Airwars. “There are still questions to answer around the extent to which the approach taken reflects the reality of the information environment – especially in potential future wars of greater scale and intensity. We look forward to engaging with the MoD on this issue, and working together to ensure civilian lives are accounted for and acknowledged in conflicts”. Speaking about the collaboration with Airwars, Dutch Minister of Defence Ruben Brekelmans said: “These steps are intended to communicate as transparently and as completely as possible about possible civilian casualties. The Ministry of Defence will continue to do so. For example, we will now report annually on Verantwoordingsdag [a set day in the Netherlands where government ministries present reports to Parliament] about reports of possible civilian casualties.” Context of engagement Airwars’ review of these cases with the Dutch MoDfollowed a prior exchange between Dutch media outlets NRC and NOS, Airwars and the MoD around potential civilian harm cases in the war against ISIS, in which it was found that the Dutch military were likely responsible for the death of a civilian in Mosul. This case,now under investigation by the Ministry of Defence, also coincided with efforts to release more details on where Dutch airstrikes took place, with the release of the coordinates almost 2200 weapon deployments conducted in the anti-ISIS campaign. Each airstrike might contain one or a series of specific deployments. Each coordinate was also shared within an accuracy of 100m. This dialogue also occurs in the context of a wider process on the part of the Netherlands to review and update its own policies to protect civilians,in coordination and with input from civil society in the so-called Roadmap Process. This effort was prompted bya Dutch airstrike that killed more than 80 civilians in Hawijain Iraq, and the subsequent failings in the Dutch government to acknowledge and account for harm caused. Major shortcomings in the Dutch approach to planning, executing, and reviewing the Hawijah airstrike were revealed earlier this year withthe release of the Sorgdrager Report– an independent inquiry into the events that led to the strike on Hawija. This incident is alsothe subject of a major court case in the Netherlandsto secure compensation for those killed and injured by the strike. Despite a long history of systemic failures in the Netherlands on this issue, recent years have seen major steps forward. This includes the launch ofa civilian harm reporting portalin December 2024, enabling third parties for the first time to submit harm allegations directly to the MoD. Case referral and coordination Airwars referrals to the US-led Coalition account for more than 40 percent of the incidents now admitted by the US Department of Defence. This includesadmissions as recently as December 2024, in which two Airwars incidents were newly conceded by the US in relation to on-going anti-ISIS operations. Following the release of the coordinates of weapons deployed by the Dutch Ministry of Defence in March 2023, Airwars was able to narrow down from an archive of thousands of harm incidents to those that matched the dates and coordinates provided by the MoD. Using a broad inclusion criteria, Airwars isolated 61 new cases for review by the MoD. These cases contain varying degrees of information, and were matched within varying distances and times to the released Dutch coordinates within a radius of max 15km and within a 24 hour time period. Map indicating sample of cases selected for review by the Dutch MoD narrowing down incidents within date and time proximity of weapons deployed. Click to expand. Due to the risk of false positives with Dutch strikes given the intensity of bombardment, the relative lack of transparency on the part of Coalition allies about their own involvement, and due to some uncertainties in the locational information, these cases were presented as a longlist subject to further review with the MoD, and not a definitive or exhaustive caseload. Among the 39 incidents excluded based on location, coordinates and/or weapons deployed wasa December 6th 2018 strike in southern Syria, where at least five civilians were reported killed by alleged Coalition war planes. All five were women and children. UK, Dutch and French strikes were reported in the vicinity. With the Dutch now able to definitively exclude this incident from their involvement, this raises renewed questions for Coalition partners the French and the British, as well as other allies active in the Coalition at the time, who were less transparent about their strike locations. Airwars’ cross-checking process for the December 6th strike (incident CS1866), found in proximity of eight coordinates of weapons deployed by the MoD within 24 hours of the date, as well as another strike on December 18th with an additional date/location match set for seven Dutch coordinates (note individual points are not easily visible where coordinates overlap exactly). Click to expand. Four of these incidents were also excluded due to previous admissions by the international Coalition, where the Dutch MoD determined based on mission details that they were not the national partner responsible. These cases include incidentssuch as a May 13th 2015 strike, admitted by the US-led Coalitionafter referral by Airwars, where at least six members of one family were killed after a strike on a vehicle distributing oil to local populations. At the time the UK Ministry of Defence also denied responsibility for the strike. Airwars’ cross-checking process for the May 13th strike (incident CI067), found in proximity of four coordinates of weapons deployed by the MoD (note individual points are not easily visible where coordinates overlap exactly). Click to expand. “Insufficient detail” Of the 61 incidents that Airwars and the Dutch Ministry of Defence reviewed, 22 incidents were deemed to have insufficient detail on the geographic “reference points”, or the time of the event, that would support the Netherlands in cross-checking the cases against their own records. In two of these cases, the lack of granular information and the intensity of the fighting at the time further complicated the MoD in being able to plausibly assess Dutch involvement. Among these cases are 14 incidents that were reviewed and rejected by the US-led Coalition, includingallegations where the names and details of the victims were known– but where the time and exact location of the incident was unclear in open source reports. Other cases raise some questions about the process used to review these claims, such asthis January 22nd 2015 strikereported by a local Iraqi MP directly to the US at the time. Despitethe description of the village given by the MP, it appears that the US and now the Dutch MoD have been unable to pinpoint enough locational details to support cross-checking against their own mission reports. Airwars’ cross-checking process for the January 22nd strike (incident CI030), found in proximity of five coordinates of weapons deployed by the MoD (note individual points are not easily visible where coordinates overlap exactly). Click to expand. The methods used to cross-check information against mission reports also appears to diverge within the Coalition – with casessuch as this June 4th 2018 incidentrejected by the Coalition on the grounds that the coordinates did not match records of Coalition strikes in the geographical vicinity, instead were assessed by the Dutch MoD as unable to determine the plausibility of Dutch involvement, due to lack of precise locational information contained in the original allegation. Airwars’ cross-checking process for the June 4th strike (incident CS1764), found in proximity of one coordinate of a weapon deployment by the MoD. Click to expand. These inconsistencies reflect concerns revealed in the newly released Sorgdrager report, around a diverging approach among Coalition members and between Coalition members and the United States not only on civilian harm detection processes but also in policies and practices around assessment and response. Looking forward As defence spending increases across Europe and risks of great power conflict increase, Airwars will be looking to other European nations to follow the example of the Netherlands and invest in procedures and processes to meaningfully engage with civil society to detect and respond to incidents of civilian harm. The practices for detecting and responding to civilian harm in cases of large scale combat must also reflect the changing realities of the information environment. Especially in intense battlefields, ensuring that reporting mechanisms reflect the reality of at times contradictory and disparate information is going to be essential – otherwise states will reject potentially thousands of cases that fall below unrealistic thresholds for consideration. Airwars is registered in England and Wales as a not-for profit company limited by guarantee, company no. 10314448. Our registered address is: c/o Thompson Jenner LLP, 1 Colleton Crescent, Exeter, Devon EX2 4DG. Site byRectangle."}