{"id": 1400, "name": "The Local (Italy)", "domain": "thelocal.it", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thelocal.it/20250609/paltry-turnout-dims-italy-citizenship-reform-hopes-as-referendum-enters-second-day/#article-comments", "title": "Paltry Turnout Dims Italy Citizenship Reform Hopes As Referendum Enters Second Day", "content": "**Advertisement** Italian NewsLatest newsTravel newsStrikesRomeMilanNaplesSicilyPolitics Latest news Travel news Strikes Rome Milan Naples Sicily Politics Latest news Travel news Strikes Rome Milan Naples Sicily Politics EssentialsItalian citizenshipVisasResidency permitsTaxesPensionsCost of livingDriving licencesReader questions Italian citizenship Visas Residency permits Taxes Pensions Cost of living Driving licences Reader questions Italian citizenship Visas Residency permits Taxes Pensions Cost of living Driving licences Reader questions Discover ItalyVisit ItalyMoving to ItalyLiving in ItalyItaly explainedItalian traditionsHistoryItalian habitsFood and Drink Visit Italy Moving to Italy Living in Italy Italy explained Italian traditions History Italian habits Food and Drink Visit Italy Moving to Italy Living in Italy Italy explained Italian traditions History Italian habits Food and Drink LanguageLanguage LessonsLearning ItalianItalian word of the day Language Lessons Learning Italian Italian word of the day Language Lessons Learning Italian Italian word of the day HomesPropertyRentingOne-euro homes Property Renting One-euro homes Property Renting One-euro homes JobsWorking in ItalyFind jobs in Italy Working in Italy Find jobs in Italy Working in Italy Find jobs in Italy Italian NewsLatest newsTravel newsStrikesRomeMilanNaplesSicilyPolitics Latest news Travel news Strikes Rome Milan Naples Sicily Politics Latest news Travel news Strikes Rome Milan Naples Sicily Politics EssentialsItalian citizenshipVisasResidency permitsTaxesPensionsCost of livingDriving licencesReader questions Italian citizenship Visas Residency permits Taxes Pensions Cost of living Driving licences Reader questions Italian citizenship Visas Residency permits Taxes Pensions Cost of living Driving licences Reader questions Discover ItalyVisit ItalyMoving to ItalyLiving in ItalyItaly explainedItalian traditionsHistoryItalian habitsFood and Drink Visit Italy Moving to Italy Living in Italy Italy explained Italian traditions History Italian habits Food and Drink Visit Italy Moving to Italy Living in Italy Italy explained Italian traditions History Italian habits Food and Drink LanguageLanguage LessonsLearning ItalianItalian word of the day Language Lessons Learning Italian Italian word of the day Language Lessons Learning Italian Italian word of the day HomesPropertyRentingOne-euro homes Property Renting One-euro homes Property Renting One-euro homes JobsWorking in ItalyFind jobs in Italy Working in Italy Find jobs in Italy Working in Italy Find jobs in Italy italyAll EditionsAustriaDenmarkFranceGermanyItalyNorwaySpainSwedenSwitzerland All Editions Austria Denmark France Germany Italy Norway Spain Sweden Switzerland All Editions Austria Denmark France Germany Italy Norway Spain Sweden Switzerland Become a member Newsletters Help Centre Gift Vouchers Educational Access Corporate Access About Us Contact Us News Archive Search articles All topics Advertise with us Post a job ad The Local Europe ABVästmannagatan 43113 25 StockholmSweden **Low referendum turnout sinks Italy's landmark citizenship reform** 1 comment A landmark proposal to ease Italy’s citizenship rules has failed after voter turnout in a closely-watched referendum fell far short of the required threshold. **Advertisement** The citizenship referendum, which asked Italians to vote on aproposal to cut the current 10-year residency requirementfor naturalisation claims down to five years, needed a voter turnout of over 50 percent for its result to be valid. Final turnout for the citizenship vote stood at 30.59 percent (just over 14 million voters),according toItaly’s interior ministry. This means that the referendum won’t count, whatever its result may be. Tuscany and Emilia-Romagna were the regions with the highest voter turnout, with 39.09 and 38.10 percent respectively. The lowest regional turnout figures were recorded in Trentino Alto Adige (22.70 percent), Sicily (23.10) and Calabria (23.82). The other four referendums, which concerned labour law provisions on unlawful dismissals, severance compensation in small businesses, employment contract conditions and contractors’ liability over workplace injuries, also failed to reach the quorum as turnout stood below 31 percent. Final turnout figures across all five referendums were even lower than projections made in the lead-up to the vote, whichforecastthat around 33 percent of Italians would head to the polls on June 8th-9th. Maurizio Landini, the leader of Italian trade union CGIL, slammed the low turnout as a sign of a \"clear democratic crisis\" in Italy. Riccardo Magi, leader of the centrist +Europa party, which had campaigned for the citizenship reform,saidthat \"organised abstentionism\" had won. He added, however, that his party did not feel defeated. “We have put back at the centre of public discussion a topic that no longer existed: that of a reform of the laws on citizenship,\" he said. **Advertisement** Voter participation in national referendums has historically been low in Italy. Of 77 referendums held over the past 50 years, only 39 met the voter threshold. And only four of those were held in the past 30 years. Political analysts had expressed concerns that the abstention rate may be particularly high in the June referendums after the ruling hard-right coalition, which strongly opposes the proposed labour and citizenship reforms, publiclycalled on its supportersto boycott the vote. READ ALSO: 'Stay home': Italy’s government boycotts 'dangerous' citizenship vote Italian Prime Minister Giorgia Meloni said on Tuesday that she would go to her polling station but not vote in any of the referendums, including the citizenship vote,sparking cries of outrageamong opposition members. Meloni laterdefended her decisionto abstain from voting, saying that abstention was “a right for everyone”. \"I don’t agree with the subjects of the referendums and, as has always been the case in the nation’s history, when you don't agree, abstention is also an option,\" she said. **Advertisement** After all five referendums saw poor voter turnout on Sunday, several politicians and political experts in Italy called for a sweeping reform of the country’s referendum laws. “We’ll need to adopt a different approach\" given that “no referendum has reached the quorum in recent years,” Benevento Mayor Clemente Mastellasaid. The reform should include the “lowering of the quorum, which now seems almost impossible to reach,” he added. In the run-up to the June 8th-9th vote, some suggested lowering the quorum from 50 to 40 percent, while others proposed eliminating it altogether. **More** **Comments (1)** Join the conversation in our comments section below.Share your own views and experience and if you have a question or suggestion for our journalists then email us atnews@thelocal.it.Please keep comments civil, constructive and on topic – and make sure to read ourterms of usebefore getting involved. Please log inhereto leave a comment. **See Also** **Advertisement** The Local Europe ABVästmannagatan 43113 25 StockholmSweden By signing up you agree to ourTerms of UseandPrivacy Policy.We will use your email address to send you newsletters as well as information and offers related to your account. 2025 The Local, All Rights Reserved."}