{"id": 803, "name": "WXXV - Waco News", "domain": "kxxv.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kxxv.com/news/local-news/in-your-neighborhood/limestone-county/mexia/body-found-near-norfolk-naval-base-in-ongoing-search-for-missing-21-year-old-sailor-from-mexia-texas", "title": "Body Found Near Norfolk Naval Base In Ongoing Search For Missing 21 Year Old Sailor From Mexia Texas", "content": "Menu 25 News KXXV In Your NeighborhoodBell CountyBosque CountyBurnet CountyCoryell CountyFalls CountyFreestone CountyHill CountyLampasas CountyLimestone CountyMcLennan CountyMills CountySan Saba CountyWilliamson County Bell County Bosque County Burnet County Coryell County Falls County Freestone County Hill County Lampasas County Limestone County McLennan County Mills County San Saba County Williamson County Bell County Bosque County Burnet County Coryell County Falls County Freestone County Hill County Lampasas County Limestone County McLennan County Mills County San Saba County Williamson County NewsLocal NewsTexas NewsNational NewsCrime & CourtSpecialsLegacy#25Cares Local News Texas News National News Crime & Court Specials Legacy #25Cares Local News Texas News National News Crime & Court Specials Legacy #25Cares WeatherDaily ForecastHourly ForecastAlerts25 News Storm TrackerMore Than A ForecastWeather Cams Daily Forecast Hourly Forecast Alerts 25 News Storm Tracker More Than A Forecast Weather Cams Daily Forecast Hourly Forecast Alerts 25 News Storm Tracker More Than A Forecast Weather Cams SportsRed Zone: High School FootballHigh School SportsCentral Texas College SportsBaylor BearsTexas A&M AggiesNational Sports Red Zone: High School Football High School Sports Central Texas College Sports Baylor Bears Texas A&M Aggies National Sports Red Zone: High School Football High School Sports Central Texas College Sports Baylor Bears Texas A&M Aggies National Sports Traffic Contests Community Calendar Social MediaFacebookInstagramTwitterYouTube Facebook Instagram Twitter YouTube Facebook Instagram Twitter YouTube About 25 News KXXVMeet the TeamContact KXXVTV ListingsAdvertise with KXXVKXXV Job Postings Meet the Team Contact KXXV TV Listings Advertise with KXXV KXXV Job Postings Meet the Team Contact KXXV TV Listings Advertise with KXXV KXXV Job Postings Submit a Tip SPECIAL FEATURES Wellness Experts Good Morning Texas Don't Waste Your Money Give a Child a Book 15ABC KRHD KRHD Local NewsBrazos CountyBurleson CountyGrimes CountyLeon CountyMadison CountyMilam CountyRobertson CountyWashington County Brazos County Burleson County Grimes County Leon County Madison County Milam County Robertson County Washington County Brazos County Burleson County Grimes County Leon County Madison County Milam County Robertson County Washington County About 15ABC KRHDMeet the KRHD TeamContact KRHDTV ListingsKRHD Job Postings Meet the KRHD Team Contact KRHD TV Listings KRHD Job Postings Meet the KRHD Team Contact KRHD TV Listings KRHD Job Postings KRHD Social MediaFacebookInstagramTwitter Facebook Instagram Twitter Facebook Instagram Twitter KRHD Give a Child a Book Sign In Newsletters Sign Out Manage Emails Apps Careers Search Groesbeck Mexia **Actions** Facebook Tweet Email **Body found near Norfolk naval base in ongoing search for missing 21-year-old sailor from Mexia, Texas** Hi! I'm Baileigh, a Digital Content Producer with 25 News KXXV and 15 ABC KRHD. MEXIA, Texas (KXXV) — Officials in Norfolk, Virginia, confirmed that a body was found about 10 miles from the naval base where the missing 21-year-old Navy sailor Angelina Resendiz was stationed. According to 3WTKR, Resendiz, who is from Mexia, Texas, has been missing for more than 10 days. She had been stationed at the Norfolk naval base for the past two years. Investigators were seen carrying a body from a wooded area near an elementary school around 8 p.m. last night. Officials are now conducting an autopsy and working to positively identify the remains. During the investigation, officials discovered that no money had been taken from Resendiz's bank account since May 29, the day she went missing. Resendiz's mother traveled from Texas to Virginia last week to speak with police about her daughter's disappearance. This story was reported on-air by a journalist and has been converted to this platform with the assistance of AI. Our editorial team verifies all reporting on all platforms for fairness and accuracy. **Sign up for theHeadlines Newsletterand receive up to date information.** **now signed up to receive theHeadlines Newsletter.** **In Your Neighborhood** **In Your Neighborhood** Watch ABC News Sports Weather Traffic Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use KXXV & KRHD EEO Careers KXXV FCC Public File KRHD FCC Public File FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact 25NewsKXXV 25newskxxv 25NewsKXXV"}