{"id": 808, "name": "LaGrange Daily News", "domain": "lagrangenews.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.lagrangenews.com/2025/06/07/contributors-view-john-tures-do-we-have-more-police-shootings-and-injuries-as-well-as-police-deaths-since-2020/", "title": "Contributors View John Tures Do We Have More Police Shootings And Injuries As Well As Police Deaths Since 2020", "content": "Home News Sports Obits Features Opinion Business Contests ServicesAbout UsPoliciesSubmit a News TipSubmit a PhotoLetters to Editor About Us Policies Submit a News Tip Submit a Photo Letters to Editor About Us Policies Submit a News Tip Submit a Photo Letters to Editor Classifieds Public Notices E-Edition Tropical Storm **CONTRIBUTOR’S VIEW – John Tures: Do We Have More Police Shootings And Injuries, As Well As Police Deaths, Since 2020?** Published 8:45 am Saturday, June 7, 2025 ByJohn A. Tures Astudent posted something on his Instagram page that seemed to indicate that there are more deaths from police interactions with the public than when George Floyd was killed. Is this the case? I researched the statistics, and this is what I found. Research from Statista on the number of people shot to death by the police in the United States from 2017 through 2024 seems to indicate that the number is increasing, going up every year since 2017 (981) through 2020 (1,048) and the last two years (1,164 in 2023 and an estimated 1,173 in 2024). Race does seem to be a factor. As Statista reports “Additionally, the rate of fatal police shootings among Black Americans was much higher than that for any other ethnicity, standing at 6.1 fatal shootings per million of the population per year between 2015 and 2024.” A study from the University of Illinois-Chicago indicates that not all deaths involving law enforcement interactions involve firearms. George Floyd’s death was not a firearm death, though Breonna Taylor’s death was. There are about 20% to 25% per year that do not involve firearms. Data from Johns Hopkins University indicates that there are even more nonfatal police shootings. If you think this column is a blanket condemnation of law enforcement, you would be mistaken. In many cases, there’s a reason for the police response. “The majority of victims in shootings by police—84 percent overall—were reported as armed with a firearm or other weapon, such as a knife or vehicle, during the six-year study period,” reports the Johns Hopkins University study. The profusion of weapons is a problem for law enforcement deaths too. I researched the “Officer Down Memorial Page” and found that gunfire is the leading cause of death for law enforcement this year. It’s what took the life of Walton County Deputy Sheriff William May in Florida, as well as Columbia County Deputy Sheriff Brandon Ray Sikes in Georgia, with both deaths occurring in April of this year. No other means of death is even close for an officer. Gunfire makes up nearly 50% of all deaths for law enforcement. That’s also the case for K9s too. One thing you also learn is that there’s a desperate need for more data. As Johns Hopkins University reports “Firearm research often focuses on fatalities, as they are listed as the cause of death and reported to the Centers for Disease Control and Prevention. Currently, there is no database that consistently and reliably tracks nonfatal firearm injuries for the general population. As for shootings by police, reporting by law enforcement agencies to the federal government’s data systems is voluntary, and death certificate inclusion of law enforcement involvement is inconsistent. Researchers say this makes official reporting unreliable. The researchers undertook this study to get a fuller picture of shootings by police. For their study, researchers manually reviewed publicly available records on police shootings maintained by the Gun Violence Archive that resulted in a fatal or nonfatal injury from 2015 to 2020. The Gun Violence Archive, a nonpartisan nonprofit founded in 2013, maintains a database of fatal and nonfatal gun violence using thousands of sources, including media, law enforcement, government, and commercial.” Instead of gutting research done by the CDC and universities, we should be expanding this to look at what’s happening in incidents involving the police, and what’s happening to law enforcement as well. **Featured Local Savings** **Deadly shooting on Seminary Street** **Wellstar hosts annual Cancer Survivor Day** **High School Seniors receive Hatton Lovejoy Scholarships** **CONTRIBUTOR’S VIEW – Hal Brady: A Thought on Violence** LaGrange Living Magazine **LaGrange Living Magazine** **LaGrange Living Magazine** Special Section **Special Section** **Special Section** Home News Sports Opinion Classifieds Small Business Weather Alerts About Us Policies Submit a News Tip Submit a Photo © 2025, LaGrange Daily News"}