{"id": 1219, "name": "San Bernadino Sun", "domain": "sbsun.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.sbsun.com/2025/06/11/4-men-charged-on-suspicion-of-having-destructive-devices-assaulting-officers-during-anti-ice-protests/", "title": "4 Men Charged On Suspicion Of Having Destructive Devices Assaulting Officers During Anti Ice Protests", "content": "e-Edition e-Edition NewsNewsCrime and Public SafetyInvestigative ReportingElectionPoliticsHealthEnvironmentBusinessBest ReviewsHousingJobsWeather News Crime and Public Safety Investigative Reporting Election Politics Health Environment Business Best Reviews Housing Jobs Weather News Crime and Public Safety Investigative Reporting Election Politics Health Environment Business Best Reviews Housing Jobs Weather Local NewsLocal NewsSan BernardinoInland EmpireHigh DesertSan Bernardino CountyLos Angeles County Local News San Bernardino Inland Empire High Desert San Bernardino County Los Angeles County Local News San Bernardino Inland Empire High Desert San Bernardino County Los Angeles County SportsSportsIE VarsityChargersRamsLakersClippersDodgersAngelsCollege SportsUCLA SportsUSC SportsKingsDucksOlympicsBoxing/MMASoccerHorse Racing Sports IE Varsity Chargers Rams Lakers Clippers Dodgers Angels College Sports UCLA Sports USC Sports Kings Ducks Olympics Boxing/MMA Soccer Horse Racing Sports IE Varsity Chargers Rams Lakers Clippers Dodgers Angels College Sports UCLA Sports USC Sports Kings Ducks Olympics Boxing/MMA Soccer Horse Racing Things To DoThings To DoRestaurants Food and DrinkCasinosAmusement ParksMoviesMusic + ConcertsTheaterTV and StreamingHome + GardenTravelComicsEvents Things To Do Restaurants Food and Drink Casinos Amusement Parks Movies Music + Concerts Theater TV and Streaming Home + Garden Travel Comics Events Things To Do Restaurants Food and Drink Casinos Amusement Parks Movies Music + Concerts Theater TV and Streaming Home + Garden Travel Comics Events ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary OpinionOpinionEditorialsOpinion ColumnsCommentaryLetters to the EditorEditorial BoardEndorsements Opinion Editorials Opinion Columns Commentary Letters to the Editor Editorial Board Endorsements Opinion Editorials Opinion Columns Commentary Letters to the Editor Editorial Board Endorsements SCNG Premium Sponsored Content The T.E.A. Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Subscribe Sun Store Log In Logout Get the latest news delivered daily! **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print Subscribe Log In Get the latest news delivered daily! Subscribe Log In e-Edition e-Edition Crime Investigative Reporting Election Politics Environment Business Housing Jobs Weather Trending: ICE protests 🎓 2025 Graduations Crime news Rooftop dining in the IE Top Workplaces 2025 🏢 Trump news **4 men charged on suspicion of having destructive devices, assaulting officers during anti-ICE protests** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print Two Los Angeles County men face federal charges for possessing Molotov cocktails during anti-immigration-enforcement protests in Los Angeles and Paramount, while two Orange County men face charges of assaulting a federal officer during a rally in Santa Ana, authorities said Wednesday, June 11. Emiliano Garduno Galvez, 23, of Paramount and Wrackkie Quiogue, 27, of Long Beach each face one charge of possession of an unregistered destructive device, federal authorities said. The defendants face a sentence of up to 10 years in federal prison if convicted. Galvez was accused of lighting a Molotov cocktail during aSaturday, June 7, protest in Paramountand tossing it over a wall where Los Angeles County sheriff’s deputies were attempting to control a crowd, then running away, said Ciaran McEvoy, a spokesman for the U.S. Attorney’s Office. RELATED:Can President Trump ban masks at protests? The following day, Quiogue was accused of possessing a Molotov cocktail while holding a lighter near federal buildings in downtown Los Angeles. Quiogue was spotted by police with the device and arrested, but not before throwing the device while attempting to flee, McEvoy said. Quiogue was ordered to remain detained after his initial court appearance Tuesday, while Galvez was expected to make his first court appearance in the coming days. In Orange County, Christian Andres Garcia, 32, of Anaheim and Rene Luna, 43, of Orange each face a charge of misdemeanor assault on a federal officer stemming from aMonday protest in Santa Ana. Both men face up to one year in federal prison if convicted, McEvoy said. Garcia was accused of throwing objects at law enforcement stationed outside a Homeland Security Investigations office, while Luna allegedly threw water bottles and beer cans at officers elsewhere during the same protest, McEvoy said. Both men were arrested Monday night, June 9, and were expected to make their initial court appearances in the coming days, the spokesman said. **Related Articles** Man arrested in San Bernardino homicide, also wanted in armed robbery This map shows where the Ranch fire is burning near Apple Valley Ranch fire near Apple Valley grows to 4,205 acres, evacuations ordered 3 dead after motorcyclist fleeing deputies crashes in Redlands Pedestrian fatally struck by Riverside County sheriff’s patrol car in Jurupa Valley **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print Newsroom Guidelines News Tips Contact Us Report an Error **RevContent Feed** **Most Popular** 3 dead after motorcyclist fleeing deputies crashes in Redlands3 dead after motorcyclist fleeing deputies crashes in Redlands **3 dead after motorcyclist fleeing deputies crashes in Redlands** **3 dead after motorcyclist fleeing deputies crashes in Redlands** This map shows where the Ranch fire is burning near Apple ValleyThis map shows where the Ranch fire is burning near Apple Valley **This map shows where the Ranch fire is burning near Apple Valley** **This map shows where the Ranch fire is burning near Apple Valley** 200 peacefully protest ICE at agency’s San Bernardino office200 peacefully protest ICE at agency’s San Bernardino office **200 peacefully protest ICE at agency’s San Bernardino office** **200 peacefully protest ICE at agency’s San Bernardino office** Ranch fire near Apple Valley grows to 4,205 acres, evacuations orderedRanch fire near Apple Valley grows to 4,205 acres, evacuations ordered **Ranch fire near Apple Valley grows to 4,205 acres, evacuations ordered** **Ranch fire near Apple Valley grows to 4,205 acres, evacuations ordered** Frito-Lay production plant, birthplace of Flamin’ Hot Cheetos, closes in Rancho CucamongaFrito-Lay production plant, birthplace of Flamin’ Hot Cheetos, closes in Rancho Cucamonga **Frito-Lay production plant, birthplace of Flamin’ Hot Cheetos, closes in Rancho Cucamonga** **Frito-Lay production plant, birthplace of Flamin’ Hot Cheetos, closes in Rancho Cucamonga** Pedestrian fatally struck by Riverside County sheriff’s patrol car in Jurupa ValleyPedestrian fatally struck by Riverside County sheriff’s patrol car in Jurupa Valley **Pedestrian fatally struck by Riverside County sheriff’s patrol car in Jurupa Valley** **Pedestrian fatally struck by Riverside County sheriff’s patrol car in Jurupa Valley** Firecracker prank in Hermosa Beach was no jokeFirecracker prank in Hermosa Beach was no joke **Firecracker prank in Hermosa Beach was no joke** **Firecracker prank in Hermosa Beach was no joke** California judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearingCalifornia judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearing **California judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearing** **California judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearing** Celebrities owned many Inland Empire businesses during Hollywood’s ‘Golden Age’Celebrities owned many Inland Empire businesses during Hollywood’s ‘Golden Age’ **Celebrities owned many Inland Empire businesses during Hollywood’s ‘Golden Age’** **Celebrities owned many Inland Empire businesses during Hollywood’s ‘Golden Age’** FBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protestFBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protest **FBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protest** **FBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protest** **More in Crime and Public Safety** Man arrested in San Bernardino homicide, also wanted in armed robbery **Man arrested in San Bernardino homicide, also wanted in armed robbery** **Man arrested in San Bernardino homicide, also wanted in armed robbery** This map shows where the Ranch fire is burning near Apple Valley **This map shows where the Ranch fire is burning near Apple Valley** **This map shows where the Ranch fire is burning near Apple Valley** Ranch fire near Apple Valley grows to 4,205 acres, evacuations ordered **Ranch fire near Apple Valley grows to 4,205 acres, evacuations ordered** **Ranch fire near Apple Valley grows to 4,205 acres, evacuations ordered** 3 dead after motorcyclist fleeing deputies crashes in Redlands **3 dead after motorcyclist fleeing deputies crashes in Redlands** **3 dead after motorcyclist fleeing deputies crashes in Redlands** 2025 June 11 SubscribeSign Up For Newsletterse-EditionBreaking News Sign Up For Newsletters e-Edition Breaking News Sign Up For Newsletters e-Edition Breaking News Contact UsCorrectionsWork With UsNewspapers in EducationLocal Job BoardSun Store Corrections Work With Us Newspapers in Education Local Job Board Sun Store Corrections Work With Us Newspapers in Education Local Job Board Sun Store About San Bernardino SunAbout Southern California News GroupMediaNews GroupPartnersLive Traffic MapPrivacy PolicyAccessibilityNews ArchiveReader’s Choice About Southern California News Group MediaNews Group Partners Live Traffic Map Privacy Policy Accessibility News Archive Reader’s Choice About Southern California News Group MediaNews Group Partners Live Traffic Map Privacy Policy Accessibility News Archive Reader’s Choice MarketplaceClassifiedLegalsObituary Classified Legals Obituary Classified Legals Obituary Advertising SolutionsGet in Touch with a Marketing StrategistRequest Media KitCreative ServicesContent Marketing Get in Touch with a Marketing Strategist Request Media Kit Creative Services Content Marketing Get in Touch with a Marketing Strategist Request Media Kit Creative Services Content Marketing Reader RewardsPhoto reprintsSponsored AccessSponsor a Student Photo reprints Sponsored Access Sponsor a Student Photo reprints Sponsored Access Sponsor a Student Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}