{"id": 1314, "name": "South Florida Sun-Sentinel", "domain": "sun-sentinel.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.sun-sentinel.com/2025/06/03/hey-panthers-fans-wheres-your-watch-party-catch-all-the-stanley-cup-final-action-at-these-south-florida-events/", "title": "Hey Panthers Fans Wheres Your Watch Party Catch All The Stanley Cup Final Action At These South Florida Events", "content": "Daily e-Edition Daily e-Edition Evening e-Edition Evening e-Edition Daily e-Edition Evening e-Edition Sign Up for Newsletters Local NewsLocal NewsBroward CountyPalm Beach CountyMiami-Dade County Local News Broward County Palm Beach County Miami-Dade County Local News Broward County Palm Beach County Miami-Dade County Weather NewsWeather NewsForecasts and ConditionsHurricane TracksStorms & Hurricanes Weather News Forecasts and Conditions Hurricane Tracks Storms & Hurricanes Weather News Forecasts and Conditions Hurricane Tracks Storms & Hurricanes PoliticsPoliticsElections Politics Elections Politics Elections HealthHealthMedicare Health Medicare Health Medicare Things To DoThings To DoRestaurantsHoroscopesEventsArtsTheater Things To Do Restaurants Horoscopes Events Arts Theater Things To Do Restaurants Horoscopes Events Arts Theater SportsSportsMiami DolphinsMiami HeatFlorida PanthersMiami MarlinsInter MiamiUM HurricanesFAU OwlsHigh School Sports Sports Miami Dolphins Miami Heat Florida Panthers Miami Marlins Inter Miami UM Hurricanes FAU Owls High School Sports Sports Miami Dolphins Miami Heat Florida Panthers Miami Marlins Inter Miami UM Hurricanes FAU Owls High School Sports BusinessBusinessConsumer ReviewsRetail Business Consumer Reviews Retail Business Consumer Reviews Retail Real EstateReal EstateFeatured HomesAgentsBrokersOpen Houses Real Estate Featured Homes Agents Brokers Open Houses Real Estate Featured Homes Agents Brokers Open Houses OpinionOpinionElection EndorsementsEditorialsLetters to the EditorCommentary Opinion Election Endorsements Editorials Letters to the Editor Commentary Opinion Election Endorsements Editorials Letters to the Editor Commentary Education TravelTravelFlorida Cruise GuideExplore FloridaFlorida & Caribbean Experiences Travel Florida Cruise Guide Explore Florida Florida & Caribbean Experiences Travel Florida Cruise Guide Explore Florida Florida & Caribbean Experiences Florida Jewish JournalFlorida Jewish JournalJewish Journal OpinionBroward Jewish NewsMiami-Dade Jewish NewsPalm Beach Jewish NewsE-Newspaper Florida Jewish Journal Jewish Journal Opinion Broward Jewish News Miami-Dade Jewish News Palm Beach Jewish News E-Newspaper Florida Jewish Journal Jewish Journal Opinion Broward Jewish News Miami-Dade Jewish News Palm Beach Jewish News E-Newspaper City & Shore Magazine ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary Branded ContentPaid Partner ContentAdvertising by AscendPaid Content by Brandpoint Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Classified About our AdsAdvertiseAdvertise Advertise Advertise Advertise Advertise Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Bluesky (Opens in new window)Bluesky Subscribe Log in Sign up for email newsletters Subscribe Log in Daily e-Edition Daily e-Edition Evening e-Edition Evening e-Edition Miami Dolphins Miami Heat Florida Panthers Miami Marlins Inter Miami UM Hurricanes FAU Owls High School Sports Trending: 🗓️ Juneteenth in South Florida 🏒 Panthers watch parties 🚌 Student absences: See the data 🐍 6,300 pounds of pythons 🦋 Summer of savings 🏳️‍🌈 South Florida Pride events **Florida Panthers watch parties: Catch all the Stanley Cup Final action at these South Florida events** **Events invite you to watch on a theater screen or skate on the same ice where the Florida Panthers practice.** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Bluesky (Opens in new window)Bluesky Where will you watch as the Florida Panthers defend their championship? The NHL’s East vs. West rematch on the ice has begun as the Florida Panthers take on the Edmonton Oilers for Stanley Cup Final games in pursuit of hockey’s holy grail. Yes, thefight to keep the Stanley Cupin the Sunshine State began in rival territory some 2,500 miles away at Rogers Place in Edmonton, but that won’t deter fans from supporting their team right here in South Florida. Bars and restaurants will flip their big-screen TVs to the games as patrons toast to the Florida Panthers’ third consecutive visit to the fourth-round playoff battleground. But if you’re looking for a different type of watch party, now’s the time to put your plans in place — whether you’ll be heading to the epicenter of it all at Sunrise’s Amerant Bank Arena during away games, or gathering at other spots opening up throughout the entire series this year. So get your fan gear ready, wear red, practice the “Let’s Go, Panthers!” chant, and bring the plastic rats, noisemakers and, most importantly, an unwavering team spirit to these game-night watch parties. Here are all the details you need to know. Six-year-old Gavin McKee brings the energy atop Chris McKee’s shoulders for a Game 6 Stanley Cup Final watch party at Amerant Bank Arena in Sunrise on Friday, June 21, 2024. (John McCall/South Florida Sun Sentinel) Aaron Miller shows his support for a Game 6 Stanley Cup Final watch party at Amerant Bank Arena in Sunrise on Friday, June 21, 2024. (John McCall/South Florida Sun Sentinel) A chocolate Labrador Retriever named Twix wears a Florida Panthers jersey for a Game 6 Stanley Cup Final watch party at Amerant Bank Arena in Sunrise on Friday, June 21, 2024. (John McCall/South Florida Sun Sentinel) Monty Pike brings his good luck charm for a Game 6 Stanley Cup Final watch party at Amerant Bank Arena in Sunrise on Friday, June 21, 2024. (John McCall/South Florida Sun Sentinel) Fans react during a Game 6 Stanley Cup Final watch party at Amerant Bank Arena in Sunrise on Friday, June 21, 2024. (John McCall/South Florida Sun Sentinel) Fans react during a Game 6 Stanley Cup Final watch party at Amerant Bank Arena in Sunrise on Friday, June 21, 2024. (John McCall/South Florida Sun Sentinel) Fans react during a Game 6 Stanley Cup Final watch party at Amerant Bank Arena in Sunrise on Friday, June 21, 2024. (John McCall/South Florida Sun Sentinel) Fans react during a Game 6 Stanley Cup Final watch party at Amerant Bank Arena in Sunrise on Friday, June 21, 2024. (John McCall/South Florida Sun Sentinel) Fans react during a Game 6 Stanley Cup Final watch party at Amerant Bank Arena in Sunrise on Friday, June 21, 2024. (John McCall/South Florida Sun Sentinel) Fans react during a Game 6 Stanley Cup Final watch party at Amerant Bank Arena in Sunrise on Friday, June 21, 2024. (John McCall/South Florida Sun Sentinel) Fans react during a Game 6 Stanley Cup Final watch party at Amerant Bank Arena in Sunrise on Friday, June 21, 2024. (John McCall/South Florida Sun Sentinel) Devon Arnold reacts during a Game 6 Stanley Cup Final watch party at Amerant Bank Arena in Sunrise on Friday, June 21, 2024. (John McCall/South Florida Sun Sentinel) Fans react during a Game 6 Stanley Cup Final watch party at Amerant Bank Arena in Sunrise on Friday, June 21, 2024. (John McCall/South Florida Sun Sentinel) Fans react during a Game 6 Stanley Cup Final watch party at Amerant Bank Arena in Sunrise on Friday, June 21, 2024. (John McCall/South Florida Sun Sentinel) Fans react during a Game 6 Stanley Cup Final watch party at Amerant Bank Arena in Sunrise on Friday, June 21, 2024. (John McCall/South Florida Sun Sentinel) If scoring tickets to home games just isn’t in your budget, there’s still a way to experience the Stanley Cup Final without breaking the bank. A $15 ticket (fees included) gets you a seat inside Amerant Bank Arena (1 Panther Parkway, Sunrise) to watch the away game on the giant center-ice video board surrounded by thousands of your fellow enthusiastic fans. Doors open at 7 p.m. for the 8 p.m. puck drop for Game 5 on Saturday (and Game 7 on June 20, if necessary.) **Related Articles** Five keys for Panthers to beat Oilers and repeat as Stanley Cup champions Panthers’ Aleksander Barkov repeats as Selke Trophy winner, also gets King Clancy Trophy New to the Florida Panthers bandwagon? How to sound like you’ve been a fan forever So what’s it like? It’s the closest thing to attending a live game but without any teams on the ice (and free of those pesky Oilers fans). Stanley C. Panther and crew are there to entertain, and there are state-of-the-art projection displays on the ice. Pantherland also is open for your souvenir shopping needs (cause everyone needs a giant plastic rat on a gold chain, right?). Enjoy discounted pricing on concessions and free parking to make the night out more affordable for everyone. Plus, you’ll be giving back to the community. Ticket proceeds benefit theFlorida Panthers Foundation’sefforts to “build the game of hockey for children and youth, support health and education initiatives for children, advocate for and support veterans’ issues, and raise awareness about the endangered Florida panther.” Tickets are available atseatgeek.com. Have a meta experience skating on the same ice where the Florida Panthers practice while watching the Stanley Cup Final games on the big screen. The Baptist Health IcePlex (800 NE Eighth St., Fort Lauderdale) continues its Skate & Watch parties for Game 4 on Thursday. Lace up your skates or grab a seat before the 8 p.m. puck drop. The Federal will be open for food and drinks, as will Pantherland for your fan gear needs. Parking is free. Check back for more watch parties, if additional games become necessary. Cost to skate is $17. Register in advance atftlwarmemorial.com.There’s no ticket or admission fee required to watch. We know the Florida Panthers playoff run has been absolute cinema so far, but Paragon Theaters is taking that literally. The South Florida-based theater chain will have it own series of watch parties at four locations: 770 Riverside Drive, Coral Springs 3984 W. Hillsboro Blvd., Deerfield Beach 9200 W. State Road 84, Davie 833 Vanderbilt Beach Road, Naples AFacebook postinvites all: “Join us in our private Director’s Room for an exclusive, intimate viewing of every matchup between the Florida Panthers and the Edmonton Oilers. Whether you’re a die-hard hockey fan or just love a good watch party, this is the ultimate way to catch the action.” On itswebsite, Paragon describes the Director’s Room as “an exclusive private, soundproof screening room featuring giant, leather plush loungers and rocker chairs with the latest Dolby sound technology and your own personal 20-foot screen.” Doors open 30 minutes before the game starts at 8 p.m. Tickets are $5 atparagontheaters.com.Of course, food and drinks will be available for purchase. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Bluesky (Opens in new window)Bluesky **RevContent Feed** **Most Popular** Anti-Trump protests will unfold across South Florida this weekend. Here’s what to expectAnti-Trump protests will unfold across South Florida this weekend. Here's what to expect **Anti-Trump protests will unfold across South Florida this weekend. Here’s what to expect** **Anti-Trump protests will unfold across South Florida this weekend. Here’s what to expect** South Florida-based Silver Airways shuts down, stranding travelersSouth Florida-based Silver Airways shuts down, stranding travelers **South Florida-based Silver Airways shuts down, stranding travelers** **South Florida-based Silver Airways shuts down, stranding travelers** Florida attorney general warns Broward sheriff to help ICE enforce immigration lawsFlorida attorney general warns Broward sheriff to help ICE enforce immigration laws **Florida attorney general warns Broward sheriff to help ICE enforce immigration laws** **Florida attorney general warns Broward sheriff to help ICE enforce immigration laws** Asking Eric: I sent a text about my excellent son, and I was stunned by his uncle’s responseAsking Eric: I sent a text about my excellent son, and I was stunned by his uncle’s response **Asking Eric: I sent a text about my excellent son, and I was stunned by his uncle’s response** **Asking Eric: I sent a text about my excellent son, and I was stunned by his uncle’s response** Restaurant news: Award-winning Poblano South opens 1st brick-and-mortar; Bokamper’s, Even Keel closeRestaurant news: Award-winning Poblano South opens 1st brick-and-mortar; Bokamper’s, Even Keel close **Restaurant news: Award-winning Poblano South opens 1st brick-and-mortar; Bokamper’s, Even Keel close** **Restaurant news: Award-winning Poblano South opens 1st brick-and-mortar; Bokamper’s, Even Keel close** Hurricane Barbara plows forward along western coast of MexicoHurricane Barbara plows forward along western coast of Mexico **Hurricane Barbara plows forward along western coast of Mexico** **Hurricane Barbara plows forward along western coast of Mexico** Did someone really throw a bloody rat on the ice after Panthers’ Game 3 win?Did someone really throw a bloody rat on the ice after Panthers' Game 3 win? **Did someone really throw a bloody rat on the ice after Panthers’ Game 3 win?** **Did someone really throw a bloody rat on the ice after Panthers’ Game 3 win?** South Florida Michelin-star chef charged with witness tampering after jailhouse phone callsSouth Florida Michelin-star chef charged with witness tampering after jailhouse phone calls **South Florida Michelin-star chef charged with witness tampering after jailhouse phone calls** **South Florida Michelin-star chef charged with witness tampering after jailhouse phone calls** Florida executes man convicted of raping and killing a woman 3 decades agoFlorida executes man convicted of raping and killing a woman 3 decades ago **Florida executes man convicted of raping and killing a woman 3 decades ago** **Florida executes man convicted of raping and killing a woman 3 decades ago** Hidden charges? Patients often face massive bills when Florida hospitals don’t provide costs upfrontHidden charges? Patients often face massive bills when Florida hospitals don’t provide costs upfront **Hidden charges? Patients often face massive bills when Florida hospitals don’t provide costs upfront** **Hidden charges? Patients often face massive bills when Florida hospitals don’t provide costs upfront** **More in Florida Panthers** ‘He never wavered’: Goalie Sergei Bobrovsky revitalized his career in Panthers’ playoff runs **‘He never wavered’: Goalie Sergei Bobrovsky revitalized his career in Panthers’ playoff runs** **‘He never wavered’: Goalie Sergei Bobrovsky revitalized his career in Panthers’ playoff runs** Dave Hyde: Is anyone better than Playoff Sam Bennett right now? **Dave Hyde: Is anyone better than Playoff Sam Bennett right now?** **Dave Hyde: Is anyone better than Playoff Sam Bennett right now?** Panthers’ Reinhart back on track? Maurice roasts Bennett and Oilers’ Walman fined **Panthers’ Reinhart back on track? Maurice roasts Bennett and Oilers’ Walman fined** **Panthers’ Reinhart back on track? Maurice roasts Bennett and Oilers’ Walman fined** Did someone really throw a bloody rat on the ice after Panthers’ Game 3 win? **Did someone really throw a bloody rat on the ice after Panthers’ Game 3 win?** **Did someone really throw a bloody rat on the ice after Panthers’ Game 3 win?** 2025 June 3 Tribune PublishingChicago TribuneThe Morning Call of Pa.Daily Press of Va.New York Daily NewsOrlando SentinelHartford CourantThe Virginian-PilotStudio 1847 Chicago Tribune The Morning Call of Pa. Daily Press of Va. New York Daily News Orlando Sentinel Hartford Courant The Virginian-Pilot Studio 1847 Chicago Tribune The Morning Call of Pa. Daily Press of Va. New York Daily News Orlando Sentinel Hartford Courant The Virginian-Pilot Studio 1847 Company InfoAbout usCareersArchivesSun Sentinel Store About us Careers Archives Sun Sentinel Store About us Careers Archives Sun Sentinel Store Contact UsPhoto RequestsSubmit a News TipsNewspaper Archives Photo Requests Submit a News Tips Newspaper Archives Photo Requests Submit a News Tips Newspaper Archives Manage Subscriptione-EditionSign up for NewslettersHelp CenterSite Map e-Edition Sign up for Newsletters Help Center Site Map e-Edition Sign up for Newsletters Help Center Site Map Advertise with UsPlace an adAd PolicyHomes for SalePlace an Auto Ad Place an ad Ad Policy Homes for Sale Place an Auto Ad Place an ad Ad Policy Homes for Sale Place an Auto Ad ClassifiedFind a JobLegal Notices Find a Job Legal Notices Find a Job Legal Notices Subscribe Now Subscriber Terms and Conditions Terms of Service Privacy Policy Cookie Preferences Cookie Policy CA Notice at Collection CA Notice of Financial Incentive Do Not Sell/Share My Personal Information Copyright © 2025 Sun Sentinel"}