{"id": 89, "name": "American Psychoanalytic Association", "domain": "apsa.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://apsa.org/about-psychoanalysis/psychoanalytic-psychotherapy/", "title": "Psychoanalytic Psychotherapy", "content": "Twitter Instagram LinkedIn Facebook Youtube Ways to Give Find a Clinician Member Login 0Shopping Cart About APsA About Psychoanalysis Membership Meetings & Events Education Fellowships & Awards Publications & Podcasts News Search MenuMenu Member Login Ways to Give Find a Clinician About APsA About Psychoanalysis Membership Meetings & Events Education Fellowships & Awards Publications & Podcasts News Psychoanalytic or Psychodynamic Psychotherapyis a form of clinical practice that is based on psychoanalytic theory and principles. Psychoanalytic psychotherapy uses psychoanalytic theories as the frame for formulation and understanding of the therapy process. These multiple theories apply to the psychotherapy situation, with a focus on increasing self understanding and deepening insight into emotional issues and conflicts which underlie the presenting difficulties. Typically therapists make use of exploration of unconscious thoughts and feelings, understanding aspects of the relationship between therapist and patient, which may relate to underlying emotional conflicts, interpretation of defensive processes which obstruct emotional awareness, and consideration of issues related to sense of self and self esteem. Most often therapy sessions occur between one and four times weekly. The focus is on exploration of the patient’s inner experience, emphasizing this as it occurs in current daily life, as it carries over from significant and influential events and relationships of the past, and as it is manifest in the context of the therapeutic relationship. The efficacy of psychoanalytic psychotherapy, often referred to as psychodynamic psychotherapy, has been well documented. Current research indicates this as a powerfully curative treatment. Who is a Psychoanalytic Psychotherapist? Clinicians who practice psychoanalytic or psychodynamic psychotherapy all share a common orientation about how to assess and treat emotional problems. Most psychodynamic therapists have extensive training. The formats and contexts of this training are wide ranging – from graduate or medical school instruction and case supervision torigorous and formaladvanced psychotherapy training programs or psychoanalytic training. Most psychoanalytic psychotherapists elect to pursue ongoing additional training beyond their graduate or medical school instruction in order to deepen and extend their skills. Psychoanalytic psychotherapists can be found in a variety of professional disciplines, including social work, psychology, psychiatry, and psychiatric nursing. Psychoanalytic Psychotherapy Training Learn more about training to become a psychoanalytic psychotherapist. Who Can Benefit from Psychoanalytic Psychotherapy? While there is no simple answer to this question, it is important to emphasize that psychodynamic psychotherapy can be an effective treatment or component of a combined treatment for a very wide range of emotional and psychological difficulties. This includes, in one form or another all ages, and many diagnostic categories. The range of indications is significantly wider than that for psychoanalysis. In order to address this question for any individual, a careful evaluation with a well qualified therapist is an important first step. How Can You Find a Psychoanalytic Psychotherapist? Psychoanalytic psychotherapists who are APsA Psychotherapist Members are listed in theFind a Psychoanalytic Clinician Online Directory. Many psychoanalysts also practice psychotherapy and can be found in theFind a Psychoanalytic Clinician Online Directory. There are resources at most local psychoanalytic training centers for finding a psychodynamic psychotherapist. Click on the links to find anapproved training Instituteor anaffiliated Societynear you. Literature Addressing the Evidence Base for the Effectiveness of Psychoanalytic Psychotherapy Lazar, S. (2010).Psychotherapy is Worth It; A Comprehensive Review of Cost Effectiveness, American Psychiatric Publishing.Shedler, J. (2010).The Efficacy of Psychodynamic Psychotherapy, American Psychologist, 65, 98-109.Summers, R., Barber, J. (2009).Psychodynamic Psychotherapy: A Guide to Evidence Based Practice.The Guilford Press.Let the Evidence Show: Psychodynamic Therapy Provides Effective and Lasting BenefitsPsychodynamic Psychotherapy Brings Lasting Benefits through Self-Knowledge Lazar, S. (2010).Psychotherapy is Worth It; A Comprehensive Review of Cost Effectiveness, American Psychiatric Publishing. Shedler, J. (2010).The Efficacy of Psychodynamic Psychotherapy, American Psychologist, 65, 98-109. Summers, R., Barber, J. (2009).Psychodynamic Psychotherapy: A Guide to Evidence Based Practice.The Guilford Press. Let the Evidence Show: Psychodynamic Therapy Provides Effective and Lasting Benefits Psychodynamic Psychotherapy Brings Lasting Benefits through Self-Knowledge Lazar, S. (2010).Psychotherapy is Worth It; A Comprehensive Review of Cost Effectiveness, American Psychiatric Publishing. Shedler, J. (2010).The Efficacy of Psychodynamic Psychotherapy, American Psychologist, 65, 98-109. Summers, R., Barber, J. (2009).Psychodynamic Psychotherapy: A Guide to Evidence Based Practice.The Guilford Press. Let the Evidence Show: Psychodynamic Therapy Provides Effective and Lasting Benefits Psychodynamic Psychotherapy Brings Lasting Benefits through Self-Knowledge About Psychoanalysis Child & Adolescent Psychoanalysis When to Seek a Professional Psychoanalytic Training: Paths & Programs Careers in Psychoanalysis Psychoanalytic Psychotherapy Psychoanalytic Terms & Concepts Defined **APsA Publications** **View All** **The Journal of the American Psychoanalytic Association (JAPA)** **The American Psychoanalyst (TAP)** **Psychotherapist Newsletter** **Find a Psychoanalytic Clinician** About APsA Membership Donate Store Contact Us © 2009-2023 American Psychoanalytic Association | 122 East 42nd Street, Suite 2310, New York, NY 10168 | Phone: (212) 752-0450 |[email protected]"}