{"id": 380, "name": "East Bay Times", "domain": "eastbaytimes.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.eastbaytimes.com/2025/06/11/oversight-commission-says-mt-diablo-district-dismissal-is-retaliatory-as-grand-jury-report-criticizes-officials/", "title": "Oversight Commission Says Mt Diablo District Dismissal Is Retaliatory As Grand Jury Report Criticizes Officials", "content": "Today's e-Edition Today's e-Edition NewsNewsLatest HeadlinesCrime and Public SafetyCalifornia NewsNational NewsWorld NewsPoliticsEducationHealthEnvironmentTransportationSiliconValley.comWeather News Latest Headlines Crime and Public Safety California News National News World News Politics Education Health Environment Transportation SiliconValley.com Weather News Latest Headlines Crime and Public Safety California News National News World News Politics Education Health Environment Transportation SiliconValley.com Weather LocalBay AreaOaklandAlameda CountyContra Costa CountyEast Contra CostaWest Contra CostaCentral Contra Costa Bay Area Oakland Alameda County Contra Costa County East Contra Costa West Contra Costa Central Contra Costa Bay Area Oakland Alameda County Contra Costa County East Contra Costa West Contra Costa Central Contra Costa ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary OpinionOpinionEditorialsOpinion ColumnistsLetters to the EditorCommentaryCartoonsElection Endorsements Opinion Editorials Opinion Columnists Letters to the Editor Commentary Cartoons Election Endorsements Opinion Editorials Opinion Columnists Letters to the Editor Commentary Cartoons Election Endorsements SportsSportsAthleticsGolden State WarriorsRaidersSan Francisco 49ersSan Francisco GiantsSan Jose SharksSan Jose EarthquakesBay FCCollege SportsWilner HotlineHigh School SportsSports BlogsSports ColumnistsGolden State Valkyrie Sports Athletics Golden State Warriors Raiders San Francisco 49ers San Francisco Giants San Jose Sharks San Jose Earthquakes Bay FC College Sports Wilner Hotline High School Sports Sports Blogs Sports Columnists Golden State Valkyrie Sports Athletics Golden State Warriors Raiders San Francisco 49ers San Francisco Giants San Jose Sharks San Jose Earthquakes Bay FC College Sports Wilner Hotline High School Sports Sports Blogs Sports Columnists Golden State Valkyrie Things To DoThings To DoEntertainmentRestaurants, Food and DrinkCelebritiesTV StreamingMoviesMusicTheaterLifestyleCannabisAdviceTravelPets and AnimalsComicsPuzzles and GamesHoroscopesEvent Calendar Things To Do Entertainment Restaurants, Food and Drink Celebrities TV Streaming Movies Music Theater Lifestyle Cannabis Advice Travel Pets and Animals Comics Puzzles and Games Horoscopes Event Calendar Things To Do Entertainment Restaurants, Food and Drink Celebrities TV Streaming Movies Music Theater Lifestyle Cannabis Advice Travel Pets and Animals Comics Puzzles and Games Horoscopes Event Calendar BusinessBusinessHousingEconomyTechnologyBest Reviews Business Housing Economy Technology Best Reviews Business Housing Economy Technology Best Reviews Real Estate MarketplaceBranded ContentBayArea.comPartner Content Branded Content BayArea.com Partner Content Branded Content BayArea.com Partner Content Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Advertise Subscribe Log In Logout Get Morning Report and other email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email Click to share on X (Opens in new window)X Subscribe Log In Get Morning Report and other email newsletters Subscribe Log In Today's e-Edition Today's e-Edition Latest News Crime Politics Environment Science Education Transportation Health California Nation Trending: Finding the missing 2 hotel bankruptcies Clara Adams' disqualification Hayward hospital saved Jail drug smuggling Reinvented SF Jazz Fest. **Oversight commission says Mt. Diablo district dismissal is retaliatory, as grand jury report criticizes officials** **Mt. Diablo Unified School District says commissioners have served too long** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email Click to share on X (Opens in new window)X CONCORD — The Mt. Diablo Unified School District is dismissing the majority of an oversight committee appointed to supervise the spending of its $150 million taxpayer-funded construction bond program, even as anew grand jury reportcriticizes officials for failing to ensure the panel is truly independent — undermining California law. **Related Articles** It’s expensive to become a teacher in California. This bill would pay those who try AUSD Notes: Naming Alameda High scoreboard for Bullock proposed Sunnyvale School District sees new superintendent as ‘transformative’ leader Cheryl Cotton welcomed as new West Contra Costa Unified superintendent Former Berkeley teacher charged in sexual encounters with underage student Unless the district abruptly pivots duringWednesday’s board meeting, commissioners say the eight-member Measure J oversight body will effectively be defunct, jeopardizing reimbursement of a controversial contract with Schneider Electric for an air-conditioning modernization project commission members hadcriticized for years. District officials brushed off those concerns, saying that most of the founding volunteers on theMeasure J Citizens’ Bond Oversight Committeehad completed three full, two-year terms, which is the maximum service allowed under its bylaws. The six commissioners being dismissed have served since 2019. Melanie Koslow, executive director of maintenance, operations and facilities for school district, first broke the news in an 8 a.m. email to six commissioners on Friday, according to records reviewed by the Bay Area News Group. Not everyone being ousted is going quietly, including one commissioner who said his prediction of retaliatory dismissals is becoming a reality. Gina Haynes, a founding member of the oversight commission and its current chair, said Koslow and other district officials have told her to “bury this thing,” because their ongoing scrutiny of Measure J will negatively impact the school district’s ability to seek voter approval for another bond. “I don’t think we should let things go,” Haynes said on the phone Friday. “It doesn’t sit well with me, because I want to do the right thing, not bury it.” Haynes provided Koslow and Adrian Vargas, the district’s chief business officer, records of her re-appointment in 2022, which aimed to stagger membership. By Tuesday, she said she’s received the same answer about rules that effectively bind the district’s decision. But Haynes said past bond oversight committees for the district have kept commissioners on the roster for years and even decades — a response to the challenge the body has had finding volunteers. “Even the Board of Education, they’re not familiar with all the past history — it takes people to know and pass that institutional knowledge on,” Haynes said. “If we’ve got people lined up to do this job, certainly I would step down after my term and let somebody else jump in, but we’ve struggled to keep membership up. Mt. Diablo has struggled with transparency, and this is just another way to silence people.” Superintendent Adam Clark was quick to defend his district in an interview Tuesday afternoon, saying staff are simply following the rules outlined the bylaws for the Measure J oversight commission, which were established during its first meeting in August of 2019. He said the oversight commission hadraised legitimate concerns with the Schneider Electric contract, but that as those issues have been addressed, their continued scrutiny is counter-productive and the criticism has “taken a lot away from the purpose of the work.” Welcoming “fresh eyes” on the incoming roster, Clark said applications for new commissioners will be accepted in the coming months — likely after the district goes dark in July and Schneider’s reps close the project out over summer break. AContra Costa County Civil Grand Jury reportreleased Tuesday morning found that the volunteer commission tasked with overseeing spending of the district’s Measure J money is insufficiently independent. “The current CBOC is not independent as its bylaws are written and controlled by MDUSD. These bylaws give MDUSD the authority to control who is appointed as a member of the CBOC,” the jury said in its report, which was filed May 30 and approved by the foreperson on June 4 – roughly 48 hours before the district’s top maintenance and legal officials sent out notices that the board would soon have only two members. Jim Walsh, a founding commissioner, has for months criticized the district’s failure to provide financial and legal resources the commission had requested to assist its investigation – saying the oversight body had been diminished to “an afterthought committee” without any actual power to fulfill their legal duties. In October, he said he was concerned that the board may retaliate and remove oversight officials who voiced their opposition, which motivated him to raise thepossibility of a recall effort against the school district’s trustees. The district’s board will recognize the commission’s six outgoing members at a meetingWednesdayfor their help in “ensuring transparency, fiscal accountability, and community trust in the District’s bond program. The purge leaves only twomembers remaining on the CBOC: Justin Pickering, who was appointed in December of 2022 to represent parents and guardians active in the PTO, and Erin Adrian, a parent/guardian of a student enrolled at MDUSD who was appointed in June 2024. Reflecting on his nearly six years volunteering to oversee spending of Measure J, Walsh said he believes district officials have been arrogant in their handling of the controversy around the Schneider Electric contract. “At the end of the day, I don’t think it’s about money, because they have the opportunity here to reclaim a large amount of this contract (with Schneider Electric),” Walsh said. “I think it’s that they don’t want the public to know about it. … They’re unwilling to look at the facts and reality that these people put this over on them, and they want to cover it up.” **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email Click to share on X (Opens in new window)X Report an error Policies and Standards Contact Us **RevContent Feed** **Most Popular** Federal agents take four into custody inside immigration court in Concord, witnesses sayFederal agents take four into custody inside immigration court in Concord, witnesses say **Federal agents take four into custody inside immigration court in Concord, witnesses say** **Federal agents take four into custody inside immigration court in Concord, witnesses say** State court upholds conviction of Moraga P.E. teacher who sexually abused student in 1990sState court upholds conviction of Moraga P.E. teacher who sexually abused student in 1990s **State court upholds conviction of Moraga P.E. teacher who sexually abused student in 1990s** **State court upholds conviction of Moraga P.E. teacher who sexually abused student in 1990s** After facing closure, East Bay hospitals revived with $77 million in state fundingAfter facing closure, East Bay hospitals revived with $77 million in state funding **After facing closure, East Bay hospitals revived with $77 million in state funding** **After facing closure, East Bay hospitals revived with $77 million in state funding** One killed, one injured in head-on Oakland traffic crashOne killed, one injured in head-on Oakland traffic crash **One killed, one injured in head-on Oakland traffic crash** **One killed, one injured in head-on Oakland traffic crash** Hundreds gather in San Jose, Oakland and San Francisco to protest ICEHundreds gather in San Jose, Oakland and San Francisco to protest ICE **Hundreds gather in San Jose, Oakland and San Francisco to protest ICE** **Hundreds gather in San Jose, Oakland and San Francisco to protest ICE** Gov. Newsom: ‘Democracy is under assault’ after Trump deploys troopsGov. Newsom: ‘Democracy is under assault’ after Trump deploys troops **Gov. Newsom: ‘Democracy is under assault’ after Trump deploys troops** **Gov. Newsom: ‘Democracy is under assault’ after Trump deploys troops** Two East Bay hotels file for bankruptcyTwo East Bay hotels file for bankruptcy **Two East Bay hotels file for bankruptcy** **Two East Bay hotels file for bankruptcy** Oversight commission says Mt. Diablo district dismissal is retaliatory, as grand jury report criticizes officialsOversight commission says Mt. Diablo district dismissal is retaliatory, as grand jury report criticizes officials **Oversight commission says Mt. Diablo district dismissal is retaliatory, as grand jury report criticizes officials** **Oversight commission says Mt. Diablo district dismissal is retaliatory, as grand jury report criticizes officials** Life was going fine for San Leandro man until a bully from high school turned up, police sayLife was going fine for San Leandro man until a bully from high school turned up, police say **Life was going fine for San Leandro man until a bully from high school turned up, police say** **Life was going fine for San Leandro man until a bully from high school turned up, police say** Why California runner’s disqualification at state championships touched a national nerveWhy California runner’s disqualification at state championships touched a national nerve **Why California runner’s disqualification at state championships touched a national nerve** **Why California runner’s disqualification at state championships touched a national nerve** **More in Education** As feds resume student loan collections, states try to catch borrowers before they sink **As feds resume student loan collections, states try to catch borrowers before they sink** **As feds resume student loan collections, states try to catch borrowers before they sink** South Bay nonprofit provides free vegetarian meals to local students **South Bay nonprofit provides free vegetarian meals to local students** **South Bay nonprofit provides free vegetarian meals to local students** It’s expensive to become a teacher in California. This bill would pay those who try **It’s expensive to become a teacher in California. This bill would pay those who try** **It’s expensive to become a teacher in California. This bill would pay those who try** Trump administration weighs withholding education funding to California over transgender athletes **Trump administration weighs withholding education funding to California over transgender athletes** **Trump administration weighs withholding education funding to California over transgender athletes** 2025 June 11 News AlertsEmail NewslettersToday’s e-EditionMobile Apps Email Newsletters Today’s e-Edition Mobile Apps Email Newsletters Today’s e-Edition Mobile Apps MarketplacePlace an ObituaryPlace a Real Estate AdLottery Place an Obituary Place a Real Estate Ad Lottery Place an Obituary Place a Real Estate Ad Lottery SubscribeMember ServicesManage SubscriptionsEast Bay Times StoreArchive SearchReprintsSitemap Member Services Manage Subscriptions East Bay Times Store Archive Search Reprints Sitemap Member Services Manage Subscriptions East Bay Times Store Archive Search Reprints Sitemap Contact UsDigital Access FAQJoin our TeamSponsor a GroupGet Sponsored AccessPrivacy PolicyAccessibility Digital Access FAQ Join our Team Sponsor a Group Get Sponsored Access Privacy Policy Accessibility Digital Access FAQ Join our Team Sponsor a Group Get Sponsored Access Privacy Policy Accessibility Advertise With UsSpecial SectionsNetwork AdvertisingDaily AdsPublic NoticesPlace a Legal Notice Special Sections Network Advertising Daily Ads Public Notices Place a Legal Notice Special Sections Network Advertising Daily Ads Public Notices Place a Legal Notice Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}