{"id": 1054, "name": "Oceana", "domain": "oceana.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://oceana.org/press-releases/new-analysis-exposes-destruction-in-frances-most-iconic-marine-protected-areas-as-nation-prepares-to-host-3rd-united-nations-ocean-conference/", "title": "New Analysis Exposes Destruction In Frances Most Iconic Marine Protected Areas As Nation Prepares To Host 3rd United Nations Ocean Conference", "content": "InternationalUnited StatesEuropeChileCanadaBelizePhilippinesBrazilPeruMexicoUnited Kingdom United States Europe Chile Canada Belize Philippines Brazil Peru Mexico United Kingdom United States Europe Chile Canada Belize Philippines Brazil Peru Mexico United Kingdom Your Country AboutAbout UsPeople and PartnersBoard of DirectorsCEOExecutive CommitteeOceana StaffSailors for the SeaOcean CouncilScience AdvisorsCelebrity SupportersFoundation DonorsMajor DonorsCorporate PartnersCulture and CareersEmployment OpportunitiesBenefits and CultureDiversity, Equity, Inclusion, and JusticeEthics and AccountabilityFinancials About Us People and PartnersBoard of DirectorsCEOExecutive CommitteeOceana StaffSailors for the SeaOcean CouncilScience AdvisorsCelebrity SupportersFoundation DonorsMajor DonorsCorporate Partners Board of Directors CEO Executive Committee Oceana Staff Sailors for the Sea Ocean Council Science Advisors Celebrity Supporters Foundation Donors Major Donors Corporate Partners Culture and CareersEmployment OpportunitiesBenefits and CultureDiversity, Equity, Inclusion, and JusticeEthics and Accountability Employment Opportunities Benefits and Culture Diversity, Equity, Inclusion, and Justice Ethics and Accountability Financials About Us People and PartnersBoard of DirectorsCEOExecutive CommitteeOceana StaffSailors for the SeaOcean CouncilScience AdvisorsCelebrity SupportersFoundation DonorsMajor DonorsCorporate Partners Board of Directors CEO Executive Committee Oceana Staff Sailors for the Sea Ocean Council Science Advisors Celebrity Supporters Foundation Donors Major Donors Corporate Partners Board of Directors CEO Executive Committee Oceana Staff Sailors for the Sea Ocean Council Science Advisors Celebrity Supporters Foundation Donors Major Donors Corporate Partners Culture and CareersEmployment OpportunitiesBenefits and CultureDiversity, Equity, Inclusion, and JusticeEthics and Accountability Employment Opportunities Benefits and Culture Diversity, Equity, Inclusion, and Justice Ethics and Accountability Employment Opportunities Benefits and Culture Diversity, Equity, Inclusion, and Justice Ethics and Accountability Financials Our WorkVictoriesCampaignsSave the Oceans, Feed the WorldClimate And EnergyResponsible FishingProtect HabitatPlasticsAquacultureProtect SpeciesTransparencyDEEP-SEA MININGExpeditions Victories CampaignsSave the Oceans, Feed the WorldClimate And EnergyResponsible FishingProtect HabitatPlasticsAquacultureProtect SpeciesTransparencyDEEP-SEA MINING Save the Oceans, Feed the World Climate And Energy Responsible Fishing Protect Habitat Plastics Aquaculture Protect Species Transparency DEEP-SEA MINING Expeditions Victories CampaignsSave the Oceans, Feed the WorldClimate And EnergyResponsible FishingProtect HabitatPlasticsAquacultureProtect SpeciesTransparencyDEEP-SEA MINING Save the Oceans, Feed the World Climate And Energy Responsible Fishing Protect Habitat Plastics Aquaculture Protect Species Transparency DEEP-SEA MINING Save the Oceans, Feed the World Climate And Energy Responsible Fishing Protect Habitat Plastics Aquaculture Protect Species Transparency DEEP-SEA MINING Expeditions NewsroomPress ReleasesBlogReportsMagazineIn the NewsPSAs and VideosAnnual ReportsMedia Contacts Press Releases Blog Reports Magazine In the News PSAs and Videos Annual Reports Media Contacts Press Releases Blog Reports Magazine In the News PSAs and Videos Annual Reports Media Contacts Ways to GiveDonor Advised FundsDonate MonthlyBecome a MemberStart a FundraiserMemorial DonationGift DonationWeddingsGroup DonationsDonate by MailPlanned GivingGifts of StockWorkplace GivingCorporate PartnersOnline StoreEventsManage your Gift Donor Advised Funds Donate Monthly Become a Member Start a Fundraiser Memorial Donation Gift Donation Weddings Group Donations Donate by Mail Planned Giving Gifts of Stock Workplace Giving Corporate Partners Online Store Events Manage your Gift Donor Advised Funds Donate Monthly Become a Member Start a Fundraiser Memorial Donation Gift Donation Weddings Group Donations Donate by Mail Planned Giving Gifts of Stock Workplace Giving Corporate Partners Online Store Events Manage your Gift ResourcesMarine Life EncyclopediaParents and Teachers Marine Life Encyclopedia Parents and Teachers Marine Life Encyclopedia Parents and Teachers Contact Give Join Act Shop New Analysis Exposes Destruction in France’s Most Iconic Marine Protected Areas as Nation Prepares to Host 3rd United Nations Ocean Conference Oceana uncovers over 17,000 hours of destructive fishing inside France’s Marine Nature Parks, Calls on President Macron to ban bottom trawling in protected areas Press Release Date:May 28, 2025 Location:Nice, France Contact: Anna Baxter, Lucie Lelong | email:abaxter@oceana.org, lucie.lelong@clai2.comAnna Baxter, Lucie Lelong Nice, France.Just before France is set to welcome world leaders to Nice for the third United Nations Ocean Conference, Oceana released a newanalysisrevealing destructive fishing in the country’s most iconic marine protected areas. Oceana analysed fishing activity in France’s six Marine Nature Parks (MNPs) in European waters in 2024 and found that more than 100 bottom trawling vessels appeared to spend over 17,000 hours fishing in these special and unique places, which have received “protected” status. That is equivalent to one vessel fishing non-stop, 24/7, for nearly two years straight. “Bottom trawling is one of the most destructive and wasteful practices taking place in our ocean today,” said Dr. Daniel Pauly, Oceana Board Member and Founder of the Sea Around Us Project. “These massive, weighted nets bulldoze the ocean floor, destroying everything in their path and remobilizing carbon stored in the seabed. You cannot destroy areas and call them protected. We don’t need more bulldozed tracks on the seafloor. We need protected areas that benefit people and nature.” The analysis highlights three case studies of apparent bottom trawling inside French MNPs, special and iconic marine protected areas that were established because of their unique biodiversity. Using the Global Fishing Watch* mapping platform, a public tool that uses data from Automatic Identification Systems on vessels to track apparent fishing** effort, Oceana found that 70% of the trawlers identified in the analysis were French, while the other 30% came from countries including Belgium, Spain, the Netherlands, Germany, Ireland, and Italy. Some of these vessels use particularly heavy trawls called “beam trawls” that are especially damaging to the seafloor and marine life. As world leaders rush to deliver on their commitment to protect at least 30% of the ocean by 2030, Oceana is calling on governments to ensure that destructive activities like bottom trawling are not allowed in marine protected areas. France, which has the second largest Exclusive Economic Zone in the world, claims to have already protected more than 30% of its waters. But these findings show that most of these protections are on paper only. In France’s European waters, bottom trawling is widespread, and most protected areas are classified as “not regulated” or “unprotected.” In fact,98%of France’s marine protected areas allow destructive activities and only 0.03% are strictly protected, meaning they’re free from all extractive uses. “We found bottom trawling in nearly half of France’s marine protected areas in European waters, including in its iconic Marine Nature Parks,” said Nicolas Fournier, Oceana Campaign Director for marine protection in Europe. “This is a problem President Macron can no longer ignore. France needs to go from words to action – and substantiate its claim of achieving 30×30 by actually protecting its marine treasures from destructive fishing. Doing so would secure a thriving ocean, mitigate climate change impacts, and support the jobs and livelihoods of fishers who rely on a healthy ocean.” Well-protected areascan have long-term economic benefits, especially for coastal communities and small-scale fishers. Low-impact sustainable fishing practices typically thrive in well-managed marine protected areas, but bottom trawling and other destructive activities jeopardize these important areas, marine life, and those who rely on a healthy ocean. For example, in the Gulf of Lion MNP, large trawlers could threaten the livelihoods of small-scale fishers by destroying important fish habitats, while also targeting the same fish but in much larger quantities. “The UN Ocean Conference is an opportunity for governments to turn commitments into action,” said Alexandra Cousteau, Oceana Senior Advisor and Co-Founder of Oceans 2050. “Allowing bottom trawling in marine protected areas makes a mockery of the very concept of protection. If countries are serious about achieving 30×30, they must start with banning bottom trawling in protected areas once and for all. President Macron and France have an opportunity to lead. The time to act is now.” Oceana is calling on President Emmanuel Macron and France to lead by example and ban bottom trawling in all French marine protected areas. This is a critical step to ensure genuine protection for ocean ecosystems and align with international standards. This release is available in Frenchhere. # # # Oceana is the largest international advocacy organisation dedicated solely to ocean conservation. Oceana is rebuilding abundant and biodiverse oceans by winning science-based policies in countries that control one-quarter of the world’s wild fish catch. With more than 325 victories that stop overfishing, habitat destruction, oil and plastic pollution, and the killing of threatened species like turtles, whales, and sharks, Oceana’s campaigns are delivering results. A restored ocean means that 1 billion people can enjoy a healthy seafood meal every day, forever. Together, we can save the oceans and help feed the world. Visiteurope.oceana.orgto learn more. *Global Fishing Watch, a provider of open data for use in this release, is an international nonprofit organisation dedicated to advancing ocean governance through increased transparency of human activity at sea. The views and opinions expressed in this article are those of the authors, which are not connected with or sponsored, endorsed, or granted official status by Global Fishing Watch. By creating and publicly sharing map visualisations, data and analysis tools, Global Fishing Watch aims to enable scientific research and transform the way our ocean is managed. Global Fishing Watch’s public data was used in the production of this publication. **Any and all references to “fishing” should be understood in the context of Global Fishing Watch’s fishing detection algorithm, which is a best effort to determine “apparent fishing effort” based on vessel speed and direction data from the Automatic Identification System (AIS) collected via satellites and terrestrial receivers. As AIS data varies in completeness, accuracy and quality, and the fishing detection algorithm is a statistical estimate of apparent fishing activity, therefore it is possible that some fishing effort is not identified and conversely, that some fishing effort identified is not fishing. For these reasons, GFW qualifies all designations of vessel fishing effort, including synonyms of the term “fishing effort,” such as “fishing” or “fishing activity,” as “apparent,” rather than certain. Any/all GFW information about “apparent fishing effort” should be considered an estimate and must be relied upon solely at your own risk. GFW is taking steps to make sure fishing effort designations are as accurate as possible. Press Releases Blog Reports Magazine In the News PSAs and Videos Annual Reports Media Contacts **BECOME A WAVEMAKER** **** **FEATURED CAMPAIGN** **Save the Oceans, Feed the World** We are restoring the world’s wild fish populations toserve as a sustainable sourceof protein for people. **More Campaigns** Protect Habitat Bycatch Plastics View All **CONTACT** Oceana International Headquarters1025 Connecticut Avenue, Suite 200Washington, DC 20036 USA General Inquiries+1(202)-833-3900info@oceana.org Donation Inquiries+1(202)-833-3900wavemaker@oceana.org Press Inquiries+1(202)-833-3900press@oceana.org **OCEANA'S EFFICIENCY** **BECOME A WAVEMAKER** Sign up today to get weekly updates and action alerts from Oceana. **SHOW YOUR SUPPORT WITH A DONATION** We have already protected over 4 million square miles of ocean and innumerable sea life - but there is still more to be done. **QUICK LINKS:** PressOceana StoreMarine LifeBlogCareersFinancialsPrivacy PolicyRevisit ConsentTerms of UseContact **** Press Releases Blog Reports Magazine In the News PSAs and Videos Annual Reports Media Contacts InternationalUnited StatesEuropeChileCanadaBelizePhilippinesBrazilPeruMexicoUnited Kingdom United States Europe Chile Canada Belize Philippines Brazil Peru Mexico United Kingdom United States Europe Chile Canada Belize Philippines Brazil Peru Mexico United Kingdom Your Country AboutAbout UsPeople and PartnersBoard of DirectorsCEOExecutive CommitteeOceana StaffSailors for the SeaOcean CouncilScience AdvisorsCelebrity SupportersFoundation DonorsMajor DonorsCorporate PartnersCulture and CareersEmployment OpportunitiesBenefits and CultureDiversity, Equity, Inclusion, and JusticeEthics and AccountabilityFinancials About Us People and PartnersBoard of DirectorsCEOExecutive CommitteeOceana StaffSailors for the SeaOcean CouncilScience AdvisorsCelebrity SupportersFoundation DonorsMajor DonorsCorporate Partners Board of Directors CEO Executive Committee Oceana Staff Sailors for the Sea Ocean Council Science Advisors Celebrity Supporters Foundation Donors Major Donors Corporate Partners Culture and CareersEmployment OpportunitiesBenefits and CultureDiversity, Equity, Inclusion, and JusticeEthics and Accountability Employment Opportunities Benefits and Culture Diversity, Equity, Inclusion, and Justice Ethics and Accountability Financials About Us People and PartnersBoard of DirectorsCEOExecutive CommitteeOceana StaffSailors for the SeaOcean CouncilScience AdvisorsCelebrity SupportersFoundation DonorsMajor DonorsCorporate Partners Board of Directors CEO Executive Committee Oceana Staff Sailors for the Sea Ocean Council Science Advisors Celebrity Supporters Foundation Donors Major Donors Corporate Partners Board of Directors CEO Executive Committee Oceana Staff Sailors for the Sea Ocean Council Science Advisors Celebrity Supporters Foundation Donors Major Donors Corporate Partners Culture and CareersEmployment OpportunitiesBenefits and CultureDiversity, Equity, Inclusion, and JusticeEthics and Accountability Employment Opportunities Benefits and Culture Diversity, Equity, Inclusion, and Justice Ethics and Accountability Employment Opportunities Benefits and Culture Diversity, Equity, Inclusion, and Justice Ethics and Accountability Financials Our WorkVictoriesCampaignsSave the Oceans, Feed the WorldClimate And EnergyResponsible FishingProtect HabitatPlasticsAquacultureProtect SpeciesTransparencyDEEP-SEA MININGExpeditions Victories CampaignsSave the Oceans, Feed the WorldClimate And EnergyResponsible FishingProtect HabitatPlasticsAquacultureProtect SpeciesTransparencyDEEP-SEA MINING Save the Oceans, Feed the World Climate And Energy Responsible Fishing Protect Habitat Plastics Aquaculture Protect Species Transparency DEEP-SEA MINING Expeditions Victories CampaignsSave the Oceans, Feed the WorldClimate And EnergyResponsible FishingProtect HabitatPlasticsAquacultureProtect SpeciesTransparencyDEEP-SEA MINING Save the Oceans, Feed the World Climate And Energy Responsible Fishing Protect Habitat Plastics Aquaculture Protect Species Transparency DEEP-SEA MINING Save the Oceans, Feed the World Climate And Energy Responsible Fishing Protect Habitat Plastics Aquaculture Protect Species Transparency DEEP-SEA MINING Expeditions NewsroomPress ReleasesBlogReportsMagazineIn the NewsPSAs and VideosAnnual ReportsMedia Contacts Press Releases Blog Reports Magazine In the News PSAs and Videos Annual Reports Media Contacts Press Releases Blog Reports Magazine In the News PSAs and Videos Annual Reports Media Contacts Ways to GiveDonor Advised FundsDonate MonthlyBecome a MemberStart a FundraiserMemorial DonationGift DonationWeddingsGroup DonationsDonate by MailPlanned GivingGifts of StockWorkplace GivingCorporate PartnersOnline StoreEventsManage your Gift Donor Advised Funds Donate Monthly Become a Member Start a Fundraiser Memorial Donation Gift Donation Weddings Group Donations Donate by Mail Planned Giving Gifts of Stock Workplace Giving Corporate Partners Online Store Events Manage your Gift Donor Advised Funds Donate Monthly Become a Member Start a Fundraiser Memorial Donation Gift Donation Weddings Group Donations Donate by Mail Planned Giving Gifts of Stock Workplace Giving Corporate Partners Online Store Events Manage your Gift ResourcesMarine Life EncyclopediaParents and Teachers Marine Life Encyclopedia Parents and Teachers Marine Life Encyclopedia Parents and Teachers Contact"}