{"id": 139, "name": "Black America Web", "domain": "blackamericaweb.com", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://blackamericaweb.com/playlist/demarcus-cousins-tries-to-fight-drink-throwing-fans-after-ejection-social-media-supports-the-squabble/", "title": "Demarcus Cousins Tries To Fight Drink Throwing Fans After Ejection Social Media Supports The Squabble", "content": "Home NewsTop NewsNational NewsUplifting NewsLittle Known Black History FactsBlack History Month Top News National News Uplifting News Little Known Black History Facts Black History Month Top News National News Uplifting News Little Known Black History Facts Black History Month EntertainmentUrban One Podcast NetworkEntertainment NewsGossipTV & FilmMusicGone Viral! Urban One Podcast Network Entertainment News Gossip TV & Film Music Gone Viral! Urban One Podcast Network Entertainment News Gossip TV & Film Music Gone Viral! Video Photos MoreBlack Owned BusinessesSybil WilkesFantastic VoyageTom Joyner ArchivesSyndicated Websites Black Owned Businesses Sybil Wilkes Fantastic Voyage Tom Joyner Archives Syndicated Websites Black Owned Businesses Sybil Wilkes Fantastic Voyage Tom Joyner Archives Syndicated Websites **DeMarcus Cousins Tries To Fight Drink-Throwing Fans After Ejection, Social Media Supports The Squabble** **Share this** **Share this link via** **Or copy link** Source: Gene Wang / Getty DeMarcus Cousinsmight not be in theNBAanymore, but his role as an enforcer hasn’t changed. He’s currently playing in the Baloncesto Superior Nacional league in Puerto Ricoas a member of the Guaynabo Mets, and he got ejected. It’s not something he’s foreign to, having been kicked out of 14 NBA games, tying him for the sixth most in league history. It started with Cousins hanging by the sideline when a courtside fan gave him the middle finger, and Cousins responded by grabbing his crotch and then swatting at the man. His teammates jumped in before anything could escalate and tried to separate them. Still, they kept jawing at each other as referees blew whistles, eventually ejecting Cousins. Then, as he’s walking through the tunnel to the locker room, he’s grilling fans in the crowd when one gives him the middle finger. He responds by lunging at him, so the man throws a drink on him, while others follow suit.In protest, Cousins immediately turned around and tried to confront the attendees. Still, several security guards held him back, even as he tried to get up from the ground after falling. It’s unclear what further kind of punishment Cousins will receive. The four-timeNBA All-Starhasn’t played in the NBA since his 2022 stint with theDenver Nuggets. The following year, he’d join the Mets before playing in Mongolia and Taiwan, but ultimately returned to the island of Puerto Rico. He was a dominating force with theSacramento Kingsuntil 2017, when he was traded to the New Orleans Pelicans. But a year after arriving, he tore his left Achilles in a game against the Houston Rockets. That ended his NOLA stint, and then he’d tear his quad during the playoffs as a member of theGolden State Warriorsin 2019.Injuries sidelined him again in 2020 when he tore his ACL during an offseason pickup game. He was a member of theLos Angeles Lakers’ championshipteam that season but never actually played. But as he finds his way outside of the NBA, see how social media is reacting to his fiery on-court attitude below. DeMarcus Cousins Tries To Fight Drink-Throwing Fans After Ejection, Social Media Supports The Squabblewas originally published oncassiuslife.com **1.** **2.** **3.** **4.** **5.** **6.** **7.** **8.** **9.** **10.** **11.** **12.** Rest In Power: Notable Black Folks Who We’ve Lost In 2025 Rest In Power: Notable Black Folks Who We’ve Lost In 2025 Rest In Power: Notable Black Folks Who We’ve Lost In 2025 Rest In Power: Notable Black Folks Who We’ve Lost In 2025 President Donald Trump TACO Memes Gain Traction Online President Donald Trump TACO Memes Gain Traction Online President Donald Trump TACO Memes Gain Traction Online President Donald Trump TACO Memes Gain Traction Online Chris Brown Breezy Bowl: Setlist Chris Brown Breezy Bowl: Setlist Chris Brown Breezy Bowl: Setlist Chris Brown Breezy Bowl: Setlist SCOTUS Refuses To Review Discrimination Case By Black Dancer Allegedly Told By Club Owners There Were ‘Too Many Black Girls’ SCOTUS Refuses To Review Discrimination Case By Black Dancer Allegedly Told By Club Owners There Were ‘Too Many Black Girls’ SCOTUS Refuses To Review Discrimination Case By Black Dancer Allegedly Told By Club Owners There Were ‘Too Many Black Girls’ SCOTUS Refuses To Review Discrimination Case By Black Dancer Allegedly Told By Club Owners There Were ‘Too Many Black Girls’ Gone Too Soon: 16 R&B Stars Who Died Under 35 Gone Too Soon: 16 R&B Stars Who Died Under 35 Gone Too Soon: 16 R&B Stars Who Died Under 35 Gone Too Soon: 16 R&B Stars Who Died Under 35 Suge Knight Addresses Diddy’s Sex Trafficking Trial: “Tell The Real Truth, And Bring Everybody Accountable” Suge Knight Addresses Diddy’s Sex Trafficking Trial: “Tell The Real Truth, And Bring Everybody Accountable” Suge Knight Addresses Diddy’s Sex Trafficking Trial: “Tell The Real Truth, And Bring Everybody Accountable” Suge Knight Addresses Diddy’s Sex Trafficking Trial: “Tell The Real Truth, And Bring Everybody Accountable” The 30 Hottest Black Men In Hollywood The 30 Hottest Black Men In Hollywood The 30 Hottest Black Men In Hollywood The 30 Hottest Black Men In Hollywood BET 2025 Awards Pink Carpet Fashion Set the Bar for Black Tie Glam BET 2025 Awards Pink Carpet Fashion Set the Bar for Black Tie Glam BET 2025 Awards Pink Carpet Fashion Set the Bar for Black Tie Glam BET 2025 Awards Pink Carpet Fashion Set the Bar for Black Tie Glam **30 Great Last Minute Father’s Day Gifts for Under $50** **Black America Web Celebrates Black Music Month** **The Top Moments From The 2025 BET Awards We’re Still Talking About** **Rest In Power: Notable Black Folks Who We’ve Lost In 2025** **TS Madison Explains Why She Doesn’t Date Gay Men** **Bark & The Bite: Leon Thomas Announces ‘Mutts Don’t Heel’ World Tour** **It’s About Time We Give Jasmine Crockett Her Flowers [Op-Ed]** **Sign Up ForThe Black America Web Newsletter** We care about your data. See ourprivay policy. **Black America Web** Home NewsTop NewsNational NewsUplifting NewsLittle Known Black History FactsBlack History Month Top News National News Uplifting News Little Known Black History Facts Black History Month Top News National News Uplifting News Little Known Black History Facts Black History Month EntertainmentUrban One Podcast NetworkEntertainment NewsGossipTV & FilmMusicGone Viral! Urban One Podcast Network Entertainment News Gossip TV & Film Music Gone Viral! Urban One Podcast Network Entertainment News Gossip TV & Film Music Gone Viral! Video Photos MoreBlack Owned BusinessesSybil WilkesFantastic VoyageTom Joyner ArchivesSyndicated Websites Black Owned Businesses Sybil Wilkes Fantastic Voyage Tom Joyner Archives Syndicated Websites Black Owned Businesses Sybil Wilkes Fantastic Voyage Tom Joyner Archives Syndicated Websites **Quick Links** Advertise Careers **Legal** Privacy Policy Terms of Service Do Not Sell My Personal Information Ad Choice Facebook X Instagram YouTube An Urban One Brand Copyright © 2025Interactive One, LLC. All Rights Reserved. Facebook X Instagram YouTube About Us Advertise Privacy Policy COOKIE SETTINGS Terms of Service Newsletter R1 Digital"}