{"id": 356, "name": "Deseret News", "domain": "deseret.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.deseret.com/utah/2025/06/11/amazons-marriott-slaterville-facility-is-finally-operating-ramping-up-to-336000-deliveries-a-week/", "title": "Amazons Marriott Slaterville Facility Is Finally Operating Ramping Up To 336000 Deliveries A Week", "content": "Deseret News Deseret Magazine Church News Deseret News Deseret Magazine Print Subscriptions LatestLatest PoliticsPolitics UtahUtah SportsSports OpinionOpinion MagazineMagazine MoreMore Sign InRegisterSign In Register Sign In Register Sign In **Amazon’s Marriott-Slaterville facility is finally operating, ramping up to 336,000 deliveries a week** Amazon’s new Weber County facility, completed in 2022 but used largely for storage since then, is now fully operating as a delivery center, serving northern Utah and adjacent parts of Wyoming and Idaho. “We are actually ramping up to our overall goal, which is about 336,000 packages in a week,” said Christopher Young, manager of the 181,500-square-foot facility in Marriott-Slaterville. “We have had a really solid launch and kind of a successful launch.” The gleaming new facility off I-15 at 1748 W. 700 North sat largely vacant since it was finished in 2022, prompting plenty of debate and deliberation in and around Marriott-Slaterville. But Amazon spokeswoman Nissa LaPoint said it had been used to store equipment and that the time allowed for installation of state-of-the-art sorting equipment. Local leaders and Amazon officials held a ceremonial unveiling of the building on Tuesday, though it’s been operating since April 2. “The site features the latest high-tech conveyance — currently the first site in North America to use this new operations equipment that prevents package jams on conveyors and increases safety for employees,” LaPoint said. The new facility employs around 160 Amazon employees plus around 500 drivers, who are private contractors for the retail giant. Significantly for Amazon users, the new facility will speed delivery of shipments in its coverage area, which extends north from Marriott-Slaterville to Logan and Downey, Idaho, and south to Syracuse. Sylvia Kapsandoy, operator of a Layton-based business that ships a range of food seasoning via Amazon, USimplySeason, addressed Tuesday’s gathering, saying the new facility results in quicker delivery to customers. More than 60% of sales on Amazon.com are by independent sellers, according to company data. “It makes faster fulfillment, better inventory flow and the ability to scale locally while still reaching customers nationwide,” she said. Marriott-Slaterville officials had worried about potential congestion around the Amazon facility from entry and exit of delivery vehicles, but the issues haven’t been as bad as feared, said Bill Morris, the Marriott-Slaterville city attorney. Amazon times truck departures to avoid peak travel times at nearby schools and offices, he said. Amazon operates out of 14 facilities in Utah, including six fulfillment and sorting centers, four delivery stations and four Whole Foods Market locations. It had created 7,500 full- and part-time jobs as of January 2024, according to company data, and 16,900 more indirect jobs. 1117Newsom files lawsuit against Trump over National Guard deployment 478Gov. Cox supports Trump sending National Guard troops to quell riots in LA 289LA protests bumped up Trump’s ratings on immigration 232RFK Jr. fires CDC expert panel on vaccines to ‘restore trust’ 109Gov. Cox shares his thoughts on the flag ban and Salt Lake City’s new flags Terms of Use Privacy Notice CA Notice of Collection Cookie Policy Cookie Settings"}