{"id": 2211, "name": "The Halfway Post", "domain": "halfwaypost.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://halfwaypost.com/2025/05/25/trump-is-cold-calling-nations-asking-if-they-want-to-grease-the-wheels-on-lowering-their-tariffs/", "title": "Trump Is Cold Calling Nations Asking If They Want To Grease The Wheels On Lowering Their Tariffs", "content": "**The Halfway Post** **Dada News & Satire By Dash MacIntyre** Home About Classics Essays Books Contact Posted onMay 25, 2025May 25, 2025 byDash MacIntyre **Trump Is Cold-Calling Nations Asking If They Want To “Grease The Wheels” On Lowering Their Tariffs** White House whistleblowers say Trump works “like 45 minutes a day,” and 25 of those are cold-calling random countries asking for bribes, with the other 20 minutes brainstorming ways to scam his supporters with new crypto schemes. Trump just set up a gift registry for all foreign countries who want to bribe him to change his tariff policy. Trump is reportedly pissed Greenland just signed a major minerals deal with Europe, and was overheard shouting, “That was supposed to be MY deal!” Saudi Arabia reportedly gave Donald Trump a golf trophy that said “#1 President Golfer,” and shortly after Trump decided Saudi Arabia would not have to pay any tariffs anymore. A White House staffer claims Donald Trump was bluffing all along about the tariffs to convince a bunch of countries to give him easy concessions to take credit for in splashy photo opportunities, but the whole world essentially called his bluff. Trump is demanding people stop calling his plane “Qatair Force One” on social media. RFK Jr. has gone swimming in 3 different, toxic EPA Superfund sites this month. Two dozen foreign languages have adopted the cognate “Trump” into their lexicon used as negatively connotated nouns or adjectives to describe concepts relating to stupidity, hubris, ignorance, greed, and horrific body odor. Trump is reportedly flip-flopping on Russia, and is now surging arms to the Ukrainian military after Zelensky gifted Trump a gold-plated limo tank to replace the Presidential limo. FREE IDEA FOR ELON MUSK: Put four wheels on old dumpsters, convince his Red Pill Community that it’s awesome and hilarious, and grow profits by selling the second generation of Cybertrucks for $500. A Republican senator said off-the-record that Mike Johnson’s House budget bill “smells worse than Trump.” To reverse Tesla’s plummeting profits, the company’s board members are reportedly making Elon Musk write a daily list of 5 things he DIDN’T do that would have hurt the brand. Trump has reportedly been talked out of starting a Twitter feud with Pope Leo multiple times. Trump is reportedly threatening Congressional Republicans that if they investigate his $400 million private plane deal with Qatar he will tell all his voters to boycott the 2026 midterm elections. BREAKING: Jeffrey Epstein reportedly revealed himself alive at Donald Trump’s crypto grift dinner tonight. Kim Jong Un reportedly attended Donald Trump’s crypto grift dinner last night. Top Trump Administration officials are reportedly worried that if RFK Jr. gets infected by brain-eating amoebas in the toxic creeks and lakes he keeps swimming in they won’t be able to tell the difference. Trump is pissed after finding out the Nobel Peace Prize Committee was seriously willing to give him the peace prize if he actually ended the Ukraine War on his first day. An anonymous GOP House member says everyone in Congress knows Trump’s trade war is a disaster, but 1/3 of Republicans are cashing in on the grift, 1/3 are afraid of Trump wrecking their careers, and 1/3 are afraid of Trump’s cult members threatening violence. A new poll found that 89% of Twitter users are glad Elon Musk has stopped tweeting all day long since he got fired from D.O.G.E. Tomorrow Representative Nancy Mace is reportedly going to, for some reason, reenact in her Congressional office the infamous 1974 Marina Abramović performance art piece where she’ll set 72 objects on a table and let anyone do anything to her body she wants. Greenlanders are throwing a third, consecutive, now monthly “Go Home, JD Vance” themed festival this weekend. 🥃 ☕️I’m trying to be the most relentless satirist of Donald Trump and the MAGA movement on the Internet, so if you like my graffiti news comedy here’s a50% discount on paid subscriptionsto help support me, for just $2.50 a month, write full-time and tirelessly mock Trump’s fascism with comedy. And help me grow by sharing my comedy with your liberal friends and family, and your conservative enemies! If you think Donald Trump is a joke, I published two books for you: “Satire In The Trump Years” and “Satire In The Biden Years,” available onBarnes & Noble,Amazon, andKobo. Or request your library order a copy! I’ve also published three existentialist poetry books,Cabaret No Stare,Moon Goon, andHotel Golden Hoursavailable in print and on Kindle. Because our social media platforms are being scrambled up by oligarchs, if you like my humor, diversify where you follow me so you never miss my jokes to interrupt your doomscrolling:Twitter,Bluesky,Threads,Facebook,Instagram,Spoutible,Medium, andSubstack. Browse mycomedy portfolio, mygraffiti news portfolio, and mypoetry portfolio. Orbuy me a coffeeif you want to help keep me caffeinated and amped to think up jokes about MAGA world! **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook **Related** **Post navigation** **One thought** Pingback:Trump Is Cold-Calling Nations Asking If They Want To “Grease The Wheels” On Lowering Their Tariffs – Robert **Leave a ReplyCancel reply** Δ **Social Media** Facebook Twitter Tumblr **Like us on Facebook** **TRENDING** What To Expect From Trump’s Birthday Military Parade Lots Of Protesters Want To Crash Trump’s Birthday Parade And Ruin It Joel Osteen: \"If Jesus Wanted Me To Share My Wealth, He Wouldn't Have Let Me Accumulate $40 Million!\" Donald Trump Installs Stair Chair Lifts Throughout The White House Chinese Officials Are Putting Trump On Hold When He Calls Comment Reblog SubscribeSubscribedThe Halfway PostJoin 92 other subscribersSign me upAlready have a WordPress.com account?Log in now. The Halfway Post Already have a WordPress.com account?Log in now. The Halfway Post Already have a WordPress.com account?Log in now. The Halfway PostSubscribeSubscribedSign upLog inCopy shortlinkReport this contentView post in ReaderManage subscriptionsCollapse this bar The Halfway Post SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar The Halfway Post SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar"}