{"id": 2009, "name": "Issues & Insights", "domain": "issuesinsights.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://issuesinsights.com/2025/06/09/what-were-reading-la-riots-again-democrat-and-media-credibility-gets-burned-fauci-phones-found-and-more/#respond", "title": "What Were Reading La Riots Again Democrat And Media Credibility Gets Burned Fauci Phones Found And More", "content": "Home All Articles Articles by Category Popular Articles About Us Donate to I&I Subscribe to I&I Search Search Search Search Search Search **What We’re Reading: LA Riots Again, Democrat and Media Credibility Gets Burned, Fauci Phones Found… And More** L.A. Burns For The Second Time In Six Months, Trump Sends Troops, And Local Wokester Pols Bleat Tin-Earred Responses— American Thinker LA Rioters Call Waymo Cars To … Set Them On Fire … As Part Of Protest Against … Deportations?— Not the Bee LAPD Officers In Riot Gear Clash With Protesters In Downtown L.A.— Los Angeles Times Border Czar’ Tom Homan: Gavin Newsom And Karen Bass Could Be Arrested If They Get In ICE’s Way— RealClearPolitics California Sheriff Calls Harris’ Statement On Anti-ICE Riots An ‘Embarrassment’— Fox News ‘You’re A Criminal Too’: LA Mayor Called Out For Fueling The Fire— Off the Press Ain’t that the truth.https://t.co/oDOzpsDP16 As Rioters Burn Cars and Clash With Cops, CNN Cites ‘Lawful Protests’ and Broadcasts Broadway Play— Washington Free Beacon ‘Mostly Peaceful’ 2.0: Another Great Corrupt Media Moment— Hot Air What the Media Won’t Dare Show You About the Anti-ICE Riots— Townhall ICE Raids Targeted Gang Members; Violent Gun, Drug & Sex Offenders— X Majority Of Americans Approve Of Trump’s Deportation Program: CBS News Poll— Just the News Can Trump Finally Bring Consequences Down on That Corrupt Biden Crowd?— Andrew Malcolm, RedState Kash Patel Claims ‘Breakthrough’ In Fauci COVID Origins Probe— Straight Arrow News ABC News Suspends Terry Moran Over Post Calling Trump A ‘World-Class Hater’— The Hill Zelenskyy Singles Out ‘Hard Pressure’ From U.S. As Pivotal To Ending Russia’s War With Ukraine— Washington Times Mountain Runner Facing Prison For Using Trail Secretly Banned By Bureaucrats— Fox News Conservative Colombian Presidential Candidate Shot in the Head— Townhall Trump Is Racking Up Court Victories— American Spectator How Tariffs Are Breaking the Manufacturing Industries Trump Says He Wants To Protect— Reason Leftists Scramble to Put Out Fires They Started on Their Teslas Now That Elon Is Feuding with Trump— Genesius Times Concerns Raised As ChatGPT Begins Replying To All Prompts With ‘Are You Sarah Connor?’— Babylon Bee The Week In Pictures: Divorce Republican Style Edition— Powerline Issues & Insightswas founded by seasoned journalists of the IBD Editorials page. Our mission is to provide timely, fact-based reporting and deeply informed analysis on the news of the day -- without fear or favor. We’re doing this on a voluntary basis because we believe in a free press, and because we aren't afraid to tell the truth, even if it means being targeted by the left. Revenue from ads on the site help, but your support will truly make a difference in keeping our mission going. If you like what you see, feel free to visit ourDonations Page by clicking here. And be sure to tell your friends! **You can also subscribe to I&I: It's free!** Just enter your email address below to get started. Email Address Yes, I Want To Subscribe to I&I **Like this:** **Related Articles** The Issues and Insights Editorial Board has decades of experience in journalism, commentary and public policy. **Rules for Comments: Getting comments posted on this site is a privilege, not a right. We review every one before posting. Comments must adhere to these simple rules: Keep them civil and on topic. And please do not use ALL CAPS to emphasize words. Obvious attempts to troll us won’t get posted.Cancel reply** This site uses Akismet to reduce spam.Learn how your comment data is processed. **What We’re Reading: Who Backs L.A. Riots?, News Bias (Again), Trump’s Tax Cuts . . . And More** **What We’re Reading: Biden Doctor Subpoenaed, EV Interest Falls, Wind And Solar Sink … And More** **What We’re Reading: ‘Rubio Doctrine,’ ICE Man Cometh, Dems’ Poll Problems … And More** Issues & Insightsis run by seasoned journalists who were behind the Pulitzer Prize-winning IBD Editorials page (before it was summarily shut down). Our goal then and now is to bring our decades of combined journalism experience to help readers understand the top issues of the day. I&I is a completely independent operation, beholden to none, but committed to providing cogent, rational, data-driven, fact-based commentary that the nation so desperately needs. contact@issuesinsights.com ALEC American Thinker Babylon Bee Cafe Hayek Carpe Diem Cato @ Liberty Citizen Free Press City Journal Daily Signal Discern Report Foundation for Economic Education Henry Miller Hot Air Instapundit Just Facts Daily Just the News Las Vegas Review Journal Opinion (home of Michael Ramirez) Lew Rockwell Lucianne Maggie's Farm Michael Fumento Michael Ramirez Cartoons National Review Off the Press Pacific Research Institute | Right by the Bay PJ Media Powerline Press California Real Clear Markets Real Clear Politics Reason RedState Revolver News The Daily Caller The Federalist The Liberty Daily TIPP Poll — America's Most Accurate Pollster Twitchy Weaselzippers Whatfinger News Zero Hedge Copyright © 2025, Issues & Insights LLC. Created byMeks.Powered by WordPress.com. Home All Articles Articles by Category Popular Articles About Us Donate to I&I Subscribe to I&I **‘Dangerous, Derogatory, Harmful, Unreliable’** These are the labels Google slaps on our content to justify stripping its ads off our pages. It’s a blatant attempt by a monopolist to silence one side of the political debate. We’d also call it election interference. Don’t let the mini-Goebbels at Google get away with it. We are the team that ran the Pulitzer-prize-winning editorial page at Investor’s Business Daily. We know what we’re doing. Our editorials are hard-hitting, fact-based, and honest. We even review comments before posting them. Tell Google censors where they can stick their attempts to shut our voice down.Any amount you can spare to support us directly will help! You can donate by clickinghere. **Discover more from Issues & Insights** Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading"}