{"id": 73, "name": "Lake Charles American Press", "domain": "americanpress.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://americanpress.com/2025/06/07/ethical-dilemma-for-landry-governor-faces-charges-while-his-lawyer-seeks-changes-for-future-claims/", "title": "Ethical Dilemma For Landry Governor Faces Charges While His Lawyer Seeks Changes For Future Claims", "content": "Home News ObituariesMemorials Memorials Memorials Sports Opinion ServicesAbout UsBuy Photos About Us Buy Photos About Us Buy Photos Classifieds Jobs/Recruiting E-Edition Subscriptions Contests Celebrations Home News ObituariesMemorials Memorials Memorials Sports OpinionJim Beam ColumnsScooter Hobbs ColumnsJim Gazzolo Columns Jim Beam Columns Scooter Hobbs Columns Jim Gazzolo Columns Jim Beam Columns Scooter Hobbs Columns Jim Gazzolo Columns Health ServicesAbout UsBuy Photos About Us Buy Photos About Us Buy Photos Classifieds Jobs/Recruiting E-Edition706 — Explore Your SurroundingsSpecial Sections 706 — Explore Your Surroundings Special Sections 706 — Explore Your Surroundings Special Sections Contests CelebrationsEngagementsWeddingsAnniversariesGraduationsSubmit Announcement Engagements Weddings Anniversaries Graduations Submit Announcement Engagements Weddings Anniversaries Graduations Submit Announcement **Ethical dilemma for Landry: Governor faces charges while his lawyer seeks changes for future claims** Published 11:49 am Saturday, June 7, 2025 ByAssociated Press Louisiana is poised to adopt new measures that watchdogs warn raise barriers to holding public officials accountable via the state’s ethics board. The legislation was drafted by the personal attorney of Republican Gov. Jeff Landry, who faces charges brought by the board for violating state ethics laws. Proponents say the measures give those accused of ethics violations more opportunities to respond to allegations, increases transparency and limits abuses of a process they claim is often unjust. But watchdog groups — and the Board of Ethics — warn the changes will undermine the board’s ability to hold public officials accountable. While the changes would not apply to Landry’s current charges, the legislation further bolsters the governor’s power over a state board largely made up of his own appointees. Having overwhelmingly passed in the House and Senate this week — only three lawmakers voted against it — the bill awaits Landry’s signature. **Email newsletter signup** Republican Rep. Gerald “Beau” Beaullieu, who sponsored the bill, said it was brought forth after officials complained that the board’s investigation process was “more like being investigated by the Gestapo.” Landry’s office declined to comment. Another bill would share the names of complainants with officials they are accusing of wrongdoing, as well as limit the board’s ability to launch investigations. Governor’s lawyer behind legislation Landry’s private attorney, Stephen Gelé, drafted the legislation, which the governor supports. Gelé is defending Landry against ethics charges brought in 2023 for undisclosed free plane rides to Hawaii when he served as the state’s attorney general. Gelé said negotiations are progressing to “amicably resolve the charges.” Last year, Gelé warned lawmakers that the ethics board’s investigatory powers are “dangerous, unwarranted, and threaten well-established fundamental constitutional rights” and he has sought to rein them in with new legislation. The bill’s supporters say it gives the board more discretion about whether to pursue investigations and bring charges, cuts down on waste of taxpayer dollars and strengthens due process rights for the accused. Yet these changes are raising red flags. In a letter to lawmakers, the Board of Ethics warned that the bill’s requirement to share copies of all subpoenas with officials under investigation allows them to “influence a witness’s documents or responses.” Critics say the bill undercuts the board’s authority by granting local courts the power to quash investigations, gives officials opportunities to run out the clock on the board’s one-year timeline to bring charges and prevents the board from investigating violations that were disclosed by public officials seeking the board’s advisory opinion. The bill also requires a two-thirds board vote to approve an investigation into a sworn complaint and another two-thirds vote on whether to file charges. Current policy requires only majority votes. Barry Erwin, president of the Council for a Better Louisiana, a nonpartisan government accountability group, said the bill’s two-thirds vote requirements constitute a “high bar to overcome” for a board of political appointees. “I just think in real life, in very political situations, it’s hard for some of these board members to act with the independence in the system we had before,” Erwin said. A bill that will reduce complaints The other bill under consideration — which Gelé said he did not craft and Landry has not publicly supported — would require anyone bringing an ethics complaint to disclose their name and file the complaint in person at the ethics board offices in Baton Rouge. The bill passed in the House with only seven lawmakers opposed and is pending final passage in the Senate. In a legislative committee hearing, David Bordelon, general counsel for the ethics board, warned that the bill would enable officials “to intimidate a witness or potentially alter information that’s requested.” Bordelon said the measure would “drastically reduce the number of complaints.” The legislation’s sponsor, Republican Rep. Kellee Hennessey Dickerson, said her bill is part of a fight for “truth” and “justice.” “For those of us who have been through it, it helps develop peace of mind, knowing who your accuser is, especially when you are spending thousands upon thousands of dollars to try and clear your good name,” said Dickerson, who was fined $1,500 for an ethics violation in 2023. She argued people frequently file complaints to harass their political opponents. Bordelon countered that the board dispassionately evaluates complaints and provides the accused with the opportunity to defend themselves if charges are brought. The bill also prevents the ethics board from launching investigations based on non-governmental sources such as media reports. Governor dominates state ethics board Following legislation passed last year, the governor directly appoints nine of the board’s 15 members, with the Legislature appointing the rest. Officials with the legislative and executive branches now have more control over those who may be tasked with investigating them, watchdogs note. “It’s gone from a process that was as much arm’s length away from politics as we could make it, and we had it that way for many years, to a process now that is very much more political than we’ve ever seen it,” Erwin said. “It’s going to be very difficult for the board to act in a way that guarantees that kind of oversight we want to have.” **Featured Local Savings** **You Might Like** **Poncho back with Cowgirls | American Press** **Poncho back with Cowgirls | American Press** **Recently paroled local man charged with rape | American Press** **Recently paroled local man charged with rape | American Press** **NCAA settlement fallout: McNeese has NIL plan as it enters new economic era | American Press** **NCAA settlement fallout: McNeese has NIL plan as it enters new economic era | American Press** **At 100, Emma Frazier still helps at church and visits residents in nursing homes | American Press** **At 100, Emma Frazier still helps at church and visits residents in nursing homes | American Press** Special Sections **Special Sections** **Special Sections** Home News ObituariesMemorials Memorials Memorials Sports Opinion Health Small Business Celebrations E-Edition Subscriptions Jobs/Recruiting About Us"}