{"id": 234, "name": "The Citizen (South Africa)", "domain": "citizen.co.za", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.citizen.co.za/news/south-africa/you-cant-save-eastern-cape-with-one-helicopter-mabuyane-admits-province-struggles-with-disaster-management-amid-weather-crisis/", "title": "You Cant Save Eastern Cape With One Helicopter Mabuyane Admits Province Struggles With Disaster Management Amid Weather Crisis", "content": "News E-Paper Lotto Business Sport Phakaaathi Lifestyle Entertainment Motoring Auctions Multimedia Local News Legal Notices Best Bets Competitions E-Paper Subscriptions My Account Newsletters E-Paper My Account Subscribe NewsSouth AfricaEducationAfricaWorldLottoOpinion South Africa Education Africa World Lotto Opinion South Africa Education Africa World Lotto Opinion E-Paper BusinessPersonal Finance Personal Finance Personal Finance SportCricketSoccerRugbyHorsesBest Bets Cricket Soccer Rugby Horses Best Bets Cricket Soccer Rugby Horses Best Bets PhakaaathiBetway PSLMgosiWorld Soccer Betway PSL Mgosi World Soccer Betway PSL Mgosi World Soccer LifestyleFood And DrinkHealthFashion And BeautyTechnology and ScienceTravel Food And Drink Health Fashion And Beauty Technology and Science Travel Food And Drink Health Fashion And Beauty Technology and Science Travel EntertainmentCelebs And ViralTV Celebs And Viral TV Celebs And Viral TV Motoring Multimedia Local NewsFree StateGautengGarden RouteKwaZulu-NatalMpumalangaLimpopoNorthern CapeNorth WestNational Free State Gauteng Garden Route KwaZulu-Natal Mpumalanga Limpopo Northern Cape North West National Free State Gauteng Garden Route KwaZulu-Natal Mpumalanga Limpopo Northern Cape North West National Legal Notices MoreAuctionsBest BetsNewslettersCompetitionsAboutOur teamAdvertise with usJobs at The CitizenContact us Auctions Best Bets Newsletters Competitions About Our team Advertise with us Jobs at The Citizen Contact us Auctions Best Bets Newsletters Competitions About Our team Advertise with us Jobs at The Citizen Contact us News E-Paper Lotto Business Sport Phakaaathi Lifestyle Entertainment Motoring Multimedia Local News Legal Notices Auctions Competitions Home»News»South Africa **‘You can’t save Eastern Cape with 1 helicopter’: Mabuyane admits province struggles with disaster management amid weather crisis** ByEnkosi Selane Journalist 7 minute read 11 June 2025 02:21 pm **The Eastern Cape government has coordinated closely with local municipalities and emergency services to manage the weather crisis.** Eatern Cape Premier Oscar Mabuyane. Picture: Gallo Images The Eastern Cape Provincial Government has established disaster management teams across the province in response to a devastating cold front that has claimed lives and left thousands without power since Monday, 9 June 2025. Premier Oscar Mabuyane recently acknowledged critical resource shortages that continue to compromise emergency response capabilities in the disaster-prone region. The severe weather system, which prompted the South African Weather Service (Saws) to issue an Orange Alert Level 6, has brought disruptive snowfall to high-lying areas, widespread flooding, and strong winds that have affected multiple districts, including OR Tambo, Joe Gqabi, Sarah Baartman, and Nelson Mandela Bay Municipality. **Resource shortages hamper emergency response** Speaking to theSABCon Wednesday, Mabuyane addressed the province’s emergency response limitations, highlighting the lack of specialised resources in the eastern regions. “It’s a question that we’ve been reporting every time we experience disasters, and we now know, at least for the last two years or so, that we are a disaster-prone province. The area that is under-resourced is the eastern part of the province,” Mabuyane said. **Weather alert: Fine, cool and cold weather across SA, with morning rain in KZN** **Weather alert: Fine, cool and cold weather across SA, with morning rain in KZN** The premier emphasised the critical need for localised emergency services, particularly diving units and helicopter stations. “We said you can’t save Eastern Cape with one helicopter that is in Port Elizabeth or Kabeha. Because when the weather is bad, that helicopter cannot move out of Kabeha. So you need a helicopter station in Mtata. You need more resources. You need K9 Unit station in Mtata because this area covers the bigger part of the population of the province,” he explained.The resource constraints have created dangerous delays in emergency response times. “Because when things like this happen, we are always found wanting, we are paralysed… We are calling everybody around and resources where they reside cannot easily move into this side,” Mabuyane said. ALSO READ:Freezing winds and snowfall deepen South Africa’s winter chill **Unprecedented winter flooding devastates communities** The current disaster has brought unprecedented winter flooding to areas typically accustomed to summer rainfall patterns. Mabuyane described the severity of the flooding, stating: “So it’s a terrible situation indeed, and it happened at a wrong time at night when people were sleeping, so I’ve never seen this thing, and now you talk about almost more than 500 meters moving from the river bank into community or houses here that is water was flowing all over almost at about three to four meters high so it’s a bad situation terrible.” The premier attributed the unusual weather patterns to climate change. “But now we know that the climate change or global warming is inevitable. We have never seen such amounts of water floods during winter in this part of the province. So now we are used to this in summer. We are always anticipating.” ALSO READ:Ramaphosa urges caution as floods claims lives in Eastern Cape **Infrastructure damage and rescue operations** According to the Eastern Cape government, emergency response teams have been working around the clock to address widespread infrastructure damage and conduct rescue operations. Several major roads have been severely affected, including the R61 from Umthatha to Ngcobo and sections of the N2 near Kokstad. The Wapadsberg Pass along the R61 between Nxuba and Graaff-Reinet has been completely snow-covered. Rescue teams successfully evacuated three children who had become stranded in a tree along the R61 outside Mthatha, demonstrating the dangerous conditions residents have faced during the disaster. ALSO READ:Where are the kids? Eastern Cape scholar transport recovered, but children still missing [VIDEO] **Power restoration efforts underway** Eskom has made significant progress in restoring electricity to affected areas, with substantial achievements recorded by Tuesday evening. The utility company restored power to over 50,000 customers in Umzimvubu and Elundini Local Municipalities, 15,000 customers within Port St. Johns Local Municipality, and 20,000 customers in Tsolo within King Mhlontlo Local Municipality. However, significant challenges remain, with 164,000 customers still without power across multiple areas, including Qumbu, Matatiele, Mthatha, Ntabankulu, Bizana, Mqanduli, and Willowvale. Eskom has urged patience from affected customers while restoration efforts continue. “We continue to urge the remaining customers to be patient and to continue treating all electricity appliances as live during this period. As the weather is starting to clear, we trust that there will be access to some of the sites to speed up electricity supply restoration,” Eskom said. **Government response and public safety measures** The provincial government has coordinated closely with local municipalities and emergency services to manage the crisis. The premier issued urgent safety advisories to residents, urging extreme caution and avoiding non-essential travel, particularly through flood-prone and mountainous areas. “Our disaster teams are on high alert and ready to respond wherever assistance is needed. We urge the public to stay cautious and prioritise safety above all else. Government is fully mobilised, coordinating closely with local municipalities and emergency services to manage the impact of the weather system and support those affected,” Mabuyane said. The premier also called on citizens to report hazards immediately, including downed power lines and road accidents, to the nearest authorities. ALSO READ:Snow hits parts of South Africa: Road closures, travel restrictions in place [PICS] **Condolences and ongoing support** As recovery efforts continue, Mabuyane expressed condolences to families affected by the disaster. “I want to take the opportunity to convey our very heartfelt condolences to families. Now we have identified bodies, families have lost their loved ones, families have lost their kids; it’s a fact. So we want to reach out, and we’re here to pledge solidarity, we’re here to comfort, we’re here to support rescue teams, we’re here to identify more and assist where we can assist. Government will do everything in our power to make sure that we mitigate these disastrous effects,” he said. The provincial government emphasised that its primary objective is to safeguard lives and infrastructure during this extreme weather event. “Community members are advised to remain alert, monitor official updates, and strictly follow safety directives,” it warned. NOW READ:Nine dead as the Eastern Cape battles devastating floods **Read more on these topics** **EDITOR'S CHOICE** Download our app Get the latest news and updates on Whatsapp Get the latest news and updates on Whatsapp The latest news directly in your inbox The latest news directly in your inbox About us Contact us Our team Newsletters Code of conduct Jobs at The Citizen Advertising rate card FAQs Privacy policy Terms and conditions NEWS BUSINESS SPORT PHAKAAATHI LIFESTYLE ENTERTAINMENT TRAVEL MULTIMEDIA MOTORING HORSES COMPETITIONS 2025 The Citizen. All Rights Reserved."}