{"id": 554, "name": "Frontiers in Environmental Health", "domain": "frontiersin.org/journals/environmental-health", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/environmental-health/articles/10.3389/fenvh.2025.1534012/full", "title": "Environmental Health", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Air Quality and Health Environmental Epidemiology Housing Conditions and Public Health Occupational Safety and Health Interventions Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Air Quality and Health Environmental Epidemiology Housing Conditions and Public Health Occupational Safety and Health Interventions Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Air Quality and Health Environmental Epidemiology Housing Conditions and Public Health Occupational Safety and Health Interventions Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Environ. Health, 05 June 2025 Sec. Occupational Safety and Health Interventions Volume 4 - 2025 |https://doi.org/10.3389/fenvh.2025.1534012 **Utilization of personal protective equipment among sanitation workers in faecal-waste management plants in cities in Uganda** Department of Disease Control and Environmental Health, School of Public Health, College of Health Sciences, Makerere University, Kampala, Uganda Introduction:Increased urbanization in Uganda has exerted pressure on the existing sanitation facilities including sewer systems and fecal-waste treatment plants increasing health, and environmental risks to sanitation workers and the public. Sanitation workers are also exposed to biohazards while working, which poses a great threat to their health. This study assessed utilization of personal protective equipment (PPE) and associated factors among sanitation workers in fecal-waste management plants in Uganda's regional cities. Methods:A cross-sectional study was conducted among 417 sanitation workers in fecal waste treatment plants in nine cities in Uganda. Data were collected using a semi-structured questionnaire uploaded on Kobo collect software and analyzed in Stata version 14 software. Results:The majority (95.0%) of the study participants were males, 46.5% were above 30 years and 60.7% consistently utilized PPE in the 30 days prior to the study. Experiencing work-related illness (APR = 0.39,95% CI:0.23–0.66), presence of an occupational health and safety officer (APR = 2.32, 95%CI:1.34–4.02), presence of PPE regulations (APR = 2.85,95%CI:1.50–5.39), and mandatory PPE use at work were significantly associated with consistent PPE use. Discussion/Conclusion:Consistent PPE use among sanitation workers at fecal-waste management plants was suboptimal. Hence, fecal-waste management plants should conduct routine training, provide PPE, and employ occupational health officers to enforce and supervise PPE use. **1 Introduction** Over 50% of the global population lives in urban areas and it is projected to increase by 1.5 times to 6 billion by 2045 (1). Moreover, most sub-Saharan African (SSA) countries are regarded as the world's fastest urbanizing countries, with approximately 1.14 billion inhabitants and 41.2% of them living in urban areas and cities (1,2). Uganda has had rapid urban growth of over 24% in the previous 10 years (1). That notwithstanding, the Government of Uganda (GoU) approved 15 new cities (3), many of which are characterized by trading activities, increased industrialization, and high population densities (4). These activities majorly depend on the public sewer system (5) and on-site sanitation technologies which require functioning fecal waste management systems and institutions to operate (6). However, this situation poses an enormous pressure on sanitation facilities, sewer systems, and fecal treatment plants thus increasing health, environmental, and socioeconomic risks to people (7). In addition, these sanitation facilities are often mismanaged (6,8) and abused by dumping of non-degradable materials which in the long run exposes sanitation workers to disease risk. In a bid to protect public health and improve the overall livability of cities, sanitation workers are required to address the various challenges along the sanitation chain including ensuring the safe containment, collection, transport, treatment, and reuse or disposal of fecal matter (9,10). However, during excreta management along the chain, these sanitation workers are exposed to bacteria, endotoxins, allergens, particulate matter, and poisonous gases, in septic tanks, sewers, pumping stations, and treatment plants (11). These risks are exacerbated by improperly constructed sanitation facilities, inadequate, poor design and material of personal protective equipment (PPE) for adequate protection of the workers (9), limited occupational safety and health training, and low education levels of sanitation workers (12,13). This creates unfavorable working conditions for sanitation workers thus failing to contribute to four of the 17 Sustainable Development Goals (SDGs) including SDG 1, SDG 3, SDG 6, and SDG 8 (10). It is thus paramount to examine the OSH of sanitation workers (10) due to the high risk of hazards they are exposed to (14). To address these gaps, the World Health Organization (WHO) set guidelines in 2018 on Sanitation and Health (11). These guidelines highly recommend that sanitation workers implement safe excreta management across the sanitation chain, and be provided with detailed guidance on safety measures at each step of the chain (11). Following this, several cities in Uganda have adopted these guidelines for instance Kampala city (15) passed the Kampala Capital City (Sewage and Fecal Sludge Management) Ordinance in 2019 as a legal tool for effective management of fecal sludge in the area (15). This ordinance recommends training all sanitation workers and following standard operating procedures such as consistent and correct PPE use and regular health checks during their work (15). This notwithstanding, implementation of occupational health measures among sanitation workers remains low (9,10). However, improving the occupational health of sanitation workers requires an understanding of their knowledge of and utilization of PPE. Therefore, this study assessed PPE utilization and associated factors among sanitation workers in fecal waste management plants in cities in Uganda. **2 Materials and methods** **2.1 Study design and setting** A cross-sectional study design was employed to assess awareness of occupational biohazard risks, and utilization of PPE among sanitation workers in fecal waste treatment plants. The study was conducted in fecal treatment plants in Ugandan cities which were: Arua, Lira, Gulu, Mbale, Jinja, Masaka, Kampala, Fort Portal, and Mbarara city (3). These cities are highly populated with an urban population growth rate of 5.2% (5) and highly depend on public sewer systems for fecal waste disposal. **2.2 Study population and sampling** The study was conducted among sanitation workers in fecal treatment plants in regional cities in Uganda. These sanitation workers often come into contact with various occupational biohazards, physical injuries, and various illnesses while at work (16,17). The sample size was determined using the formula by Kish Leslie (1965) (18), considering a conservative prevalence of 50%, sampling error of 5%, and non-response rate of 10% giving a sample size of 427 participants. Both stratified and random sampling techniques were employed. Each fecal treatment plant was treated as a stratum, and the number of respondents per stratum was determined proportionally based on the total number of sanitation workers at that plant. A complete list of sanitation workers at each plant was requested from the respective occupational health and safety officer, and efforts were made to verify its comprehensiveness through cross-checking with administrative records where feasible. From these lists, participants were randomly selected. Of the 427 workers approached, 417 consented and completed the survey, yielding a response rate of 97.7%. **2.3 Data collection** Data collection was conducted from 26th July – 10th September 2022. Data were collected by trained research assistants a using structured questionnaire uploaded on Kobo Collect software. Data collection was conducted during working hours at the fecal management plants. The questionnaire was adapted from a similar study (19,20). It was translated into local languages such asLugandain Kampala,Runyankolein Mbarara,Rutooroin Fortportal,Lumasabain Mbale,Lusogain Jinja,AlurandLugbarin Arua,Acholiin Gulu andLangiin Lira. The questionnaire contained four sections namely: socio-demographic characteristics; awareness and attitudes toward occupational biohazard risk; knowledge of PPE use, utilization of PPE, and institutional factors. The data collection tool was evaluated for face and internal validity by a team of experts at Makerere University School of Public Health. **2.4 Measurement of PPE utilization** PPE utilization was based on respondents' self-reports. PPE utilization among respondents was measured by asking whether they often wore any PPE in the previous 30 days. Respondents with a “Yes” response on consistent PPE utilization (Those who used PPE every work day for the previous 30 days) were considered as those who utilized PPE and coded (1), while those with a “No” response were considered otherwise and coded (0). **2.5 Data management and analysis** Data were entered using android-enabled mobile phones loaded with the Kobo Collect application, and the data were synchronized onto the server daily. This allowed real-time data capture and entry, minimized errors at entry, and eased data cleaning. The data entered were cleaned and analyzed using Excel 2016 and STATA version 14.0 statistical software respectively. Descriptive analyses were performed for demographic characteristics, awareness of biohazards, availability of PPE, and utilization of PPE. These results are presented as frequencies, proportions, and means where appropriate. To assess the association between the outcome variable and the explanatory variables, we used logistic regression at bivariate and multivariable analysis. This resulted in Crude Odds Ratios (COR) at 95% confidence intervals. Thereafter, variables with a thresholdp-value less than 0.05at bivariate analyses were subjected to the multivariable regression analyses, giving the Adjusted Odds Ratios (AOR). In multivariable analysis, only variables with ap-value less than 0.05 were considered significant. **3 Results** **3.1 Socio-demographic and background characteristics** Out of the 417 respondents, 95.0% (396/417) were males, 36.9% (154/417) were Roman Catholics, and 71.9% (300/417) were married or cohabiting. Among the respondents, 46.5% (194/417) were aged 30 years and below, 91.1% (380/417) had dependents, and 44.8% (187/417) had attained secondary level education. The roles played by the respondents at the treatment plant were collection 50.6% (211/417), emptying 61.6% (257/417), transportation 44.6% (186/417), treatment 21.6% (90/417), and disposal 32.4% (135/417). Given the diversity in job roles among the sanitation workers, it is important to note that these different functions expose them to varying types and levels of occupational hazards. Close to three quarters of the respondents, 72.9% (304/417) were working in the day shift, and 54.4% (227/417) worked 8 and less hours daily (Table 1). Table 1.Socio-demographic and background characteristics of respondents. **3.2 Awareness of PPE among sanitation workers** Almost all the respondents, 99.5% (415/417) were aware of at least one PPE needed for working in the fecal sludge establishment and 97.6% (405/417) knew that PPE can reduce the risk of exposure to biohazards. The majority of respondents, 95.7% (397/415) mentioned durable gloves as the most commonly known PPE in the fecal sludge establishment. Nearly half of the respondents, 44.4% (185/417) received PPE use related instructions before and/or during the assigned work, while 56.9% (236/417) had undertaken some PPE-related training. The majority of respondents, 73.65% (307/417) mentioned that it was mandatory to use PPE at their work places, and 54.4% (227/417) affirmed that some regulations or policies supported PPE use at their workplace (Table 2). Table 2.Awareness of PPE. **3.3 Availability of PPE among sanitation workers** Most respondents, 83.2% (347/417) reported that the PPE was available at their workplaces. These included durable gloves 90.8% (315/347), water proof boots 85.9% (298/347), and overalls 82.4% (286/347). The majority of respondents, 61.3% (213/347) mentioned that they bought the PPE themselves, while the others mentioned that PPE was provided by the fecal management plant/employer. **3.4 Utilization of PPE among sanitation workers** Most respondents, 92.6% (386/417) reported having ever worn PPE while working. The reported prevalence of consistent PPE use in the previous 30 days was 60.7% (253/417), while 89.2% (372/417) utilized PPE at least once in the previous 30 days. The respondents who utilized PPE at least once a month wore PPE because it offered protection from occupational hazards (93.3%, 348/372), and the most preferred PPE to wear in the previous 30 days was waterproof durable gloves, 82.5% (308.372). However, for the respondents that were not using PPE, 61.3% (19/31) mainly highlighted that the PPE was not provided to them, and 54.8% (17/31) said that PPE was hard to get and expensive (Table 3). Table 3.Utilization of PPE. Additionally,Table 4presents the distribution of consistent personal protective equipment (PPE) use among sanitation workers by job role. Workers involved in transportation of fecal waste reported the highest proportion of consistent PPE use (63.4%,n= 118), followed by those in treatment roles (60.0%,n= 54). Conversely, workers involved in disposal activities reported the lowest level of consistent PPE use (47.4%,n= 64). Table 4.PPE utilization by job. At multivariable analysis, respondents who experienced work-related illness in the previous six months were less likely to use PPE compared to their counterparts (AOR = 0.39, 95% CI: 0.23–0.66). The odds of PPE use among respondents who reported the presence of occupational health and safety officer or personnel at the fecal waste management plant were 2.32 times higher than those of their counterparts (AOR = 2.32, 95% CI: 1.34–4.02). The odds of PPE use among respondents who mentioned that some regulations or policies support PPE use at the workplace were 2.85 times that of their counterparts (AOR = 2.85, 95% CI:1.50–5.39). The odds of PPE use among respondents who reported that it was mandatory to use PPE at their workplace were 2.22 times more than their counterparts (AOR = 2.22, 95% CI: 1.17–5.38) (Table 5). Table 5.Factors associated with utilization of personal protective equipment among sanitation workers in fecal waste management plants. **4 Discussion** This study assessed the utilization of PPE among sanitation workers in fecal waste management plants in nine regional cities in Uganda. Majority (60.7) of the sanitation workers consistently utilized PPE in the previous 30 days. Consistent PPE utilization was associated with the presence of occupational health and safety officers, regulations that support PPE use, and mandatory PPE use at fecal waste management plants. Additionally, the odds of consistent PPE use were lower among those experienced work-related illness in the previous 6 months compared to those their counterparts. These findings could be used by public health policymakers, administrators of fecal waste management plants, local authorities, sanitation worker associations, and other stakeholders to strengthen policies aimed at improving utilization of PPE among sanitation workers. According to the study findings, over 60.7% of sanitation workers consistently used PPE in the previous 30 days. This level of PPE use is suboptimal as about only 6 in 10 of the sanitation workers consistently used PPE because PPE serves as an important barrier between workers and biohazards. This could even be an over estimate since the results PPE use was determined using self-reports, which are prone to social desirability bias. However, these findings, are similar to those of an Ethiopian study, which found that only 55% of sanitation workers reported using PPE while working (21). Despite the suboptimal use of PPE, more than 83.2% of sanitation workers reported having access to PPE at fecal waste management plants. This implied that the mere presence of PPE did not guarantee high levels of PPE utilization. Therefore, continuous training of sanitation workers on occupational health should be conducted routinely to equip them with knowledge of the importance of PPE use. In addition, Fecal waste management plants and other stakeholders should establish interventions aimed at increasing knowledge and awareness among sanitation workers on PPE use which may translate into improved practices. The study also revealed that individuals who experienced work-related illness had significantly lower odds of (AOR = 0.39) of consistent PPE use compared to those who did not experience work-related illness. This suggests a strong protective effect of PPE in the workplace, indicating that regular use can substantially reduce the risk of health issues. Similar findings have been reported in several studies among sanitation workers and other professions including construction workers, industrial workers, and agricultural workers (22–24). Additionally, a study conducted by Smith et al. (2021) found that consistent PPE use among healthcare workers reduced the incidence of respiratory infections by 45% (22). This finding underscores the significance of promoting and enforcing the consistent adoption of PPE across various fecal waste management plants to mitigate the risk of health issues arising from exposure to workplace hazards. The study revealed that the odds of consistent PPE use were 2.32 times higher among respondents who reported the presence of occupational health and safety personnel at the fecal waste management plant compared to their counterparts. These occupational health officers are responsible for educating and supervising workers regarding PPE use (25). These findings are similar to a study conducted in Ethiopia among sanitation workers which revealed presence of and supervision by a safety officer at the plant was attributed to good occupational health practices such as PPE utilization (21). This underscores the importance of having dedicated safety personnel to oversee and enforce PPE use. Therefore, fecal waste management plants should establish and prioritize supervisory and enforcement structures that favor PPE use. Implementing such structures not only promotes worker safety but also ensures compliance with health regulations. Although this study highlights PPE use among sanitation workers, it does not specifically examine the different risks faced across various job roles. Given the range of tasks involved, from handling fecal sludge to transporting, waste exposures are likely vary. Therefore, further research is needed to understand these role-specific hazards and inform more targeted protective measures. This study revealed that presence of rules and regulations that support PPE use was significantly associated with PPE use. The findings of this study underscore the critical role of rules and regulations in promoting personal protective equipment (PPE) use among sanitation workers. These findings are similar to those in a study conducted in Kampala that revealed that presence of sustained availability of guidelines and policies was highly attributed to PPE use among workers (26). However, presence of the guidelines should be coupled with guideline adherence by the workers or enforcement by the management for efficiency (27). Still in our study, sanitation workers who reported that these guidelines mandatory use of PPE at the workplace had higher odds (AOR: 2.22) of consistent PPE use compared to where guidelines were not mandatory. This implies that when PPE utilization policies are enforced as a workplace requirement, workers were more likely to consistently utilize it (27). Therefore, there should be development, adoption and enforcement operational guidelines to assess and mitigate the occupational risks of all types of sanitation work, including national and local level standard operating procedures (28). Additionally, there should be municipal-level oversight and enforcement of laws regarding sanitation workers at fecal waste treatment plants and other private sanitation service providers (28). **4.1 Limitations** Our study had several limitations. First, there was potential for recall bias, as participants were required to remember PPE use and occupational events that occurred over the past 30 days. Second, self-reported PPE utilization may have introduced social desirability bias, where participants might have over-reported PPE use to align with perceived expectations. However, we took several measures to minimize bias. These included establishing rapport with participants, conducting interviews in privacy, and assuring confidentiality and emphasizing that the data collected was for research purposes. Additionally, proportionate sampling may have led to overrepresentation of larger fecal waste treatment facilities, which are more likely to have structured occupational safety and health (OSH) programs. This could have biased results toward higher PPE utilization rates. Despite these limitations, the study results give a current assessment of the state of PPE utilization among sanitation workers in Ugandan cities. These findings could be used to inform policy and interventions to improve occupational health among sanitation workers in Uganda and other LMICs. **5 Conclusions** This study revealed suboptimal PPE utilization among sanitation workers in fecal-waste management plants in Uganda. Consistent PPE utilization was associated with the presence of occupational health and safety officers, regulations that support PPE use, and mandatory PPE use at the fecal waste management plants. The study findings also showed that those who experienced occupational related illnesses had lower odds of using PPE compared to their counterparts. Therefore, fecal waste management plants should establish and prioritize supervisory and enforcement structures that favor PPE use which in turn reduces exposure to hazards and occupational related illnesses. **Data availability statement** The datasets presented in this study can be found in online repositories. The names of the repository/repositories and accession number(s) can be found below:https://figshare.com/s/019a0faaf8017674dcbe. **Ethics statement** The studies involving humans were approved by Makerere University School of Public Health Research Ethics Committee. The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. **Author contributions** DB: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing – original draft, Writing – review & editing. LRN: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Resources, Supervision, Writing – original draft, Writing – review & editing. BT: Conceptualization, Data curation, Formal analysis, Investigation, Methodology, Resources, Validation, Visualization, Writing – original draft, Writing – review & editing. JB: Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Supervision, Writing – original draft, Writing – review & editing. LNN: Methodology, Writing – original draft, Writing – review & editing. FN: Conceptualization, Data curation, Formal analysis, Investigation, Methodology, Project administration, Writing – original draft, Writing – review & editing. RN: Software, Supervision, Validation, Visualization, Writing – original draft, Writing – review & editing, Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources. DM: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing – original draft, Writing – review & editing. **Funding** The author(s) declare that financial support was received for the research and/or publication of this article. This research was funded by Initiative for Sanitation Workers through Water Aid under the Water Aid-Sanitation workers grant – 2022. **Acknowledgments** We acknowledge the Uganda Ministry of Health, Ministry of Labor, Gender and Social Development, and the National Water and Sewerage Corporation for the support during the study. **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Generative AI statement** The author(s) declare that no Generative AI was used in the creation of this manuscript. **Publisher's note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **References** 1. World Bank. Urban development (2020). Available at:https://www.worldbank.org/en/topic/urbandevelopment/overview#1(Accessed October 28, 2024). Google Scholar 2. Tumwesigye S, Vanmaercke M, Hemerijckx LM, Opio A, Poesen J, Twongyirwe R, et al. Spatial patterns of urbanisation in Sub-Saharan Africa: a case study of Uganda.Dev South Afr. (2023) 40(1):1–21. doi: 10.1080/0376835X.2021.1932426 Crossref Full Text|Google Scholar 3. Parliament U. Parliament approves creation of 15 cities. 2020 29 April 2020; Available at:https://www.parliament.go.ug/news/4614/parliament-approves-creation-15-cities(Accessed August 18, 2021). Google Scholar 4. UBOS. World Population Day Celebrations 2020. 2020 Saturday, July 11, 2020. Available at:https://www.ubos.org/world-population-day-celebrations-2020/(Accessed August 18, 2021). Google Scholar 5. McConville JR, Kvarnström E, Maiteki JM, Niwagaba CB. Infrastructure investments and operating costs for fecal sludge and sewage treatment systems in Kampala, Uganda.Urban Water J. (2019) 16(8):584–93. doi: 10.1080/1573062X.2019.1700290 Crossref Full Text|Google Scholar 6. BMGF, Bill & Melinda Gates Foundation (BMGF), 2010. Water, sanitation & hygiene fact sheet [pdf]. (2010). Google Scholar 7. UN. Faecal sludge management in Africa: Socioeconomic aspects and human and environmental health implications. (2020). Google Scholar 8. Andersson K, Dickin S, Rosemarin A. Towards “sustainable” sanitation: challenges and opportunities in urban areas.Sustainability. (2016) 8(12):1289. doi: 10.3390/su8121289 Crossref Full Text|Google Scholar 9. KCCA. Public health guidelines for faecal sludge management: minimum standards for sanitation, and occupational health and safety in Kampala City, Uganda. (2020). Google Scholar 10. World Bank, ILO, Water Aid, WHO.Health, Safety and Dignity of Sanitation Workers. Washington, DC: World Bank (2019). doi: 10.1596/32640 Crossref Full Text|Google Scholar 11. World Health Organization.Guidelines on Sanitation and Health. Geneva: World Health Organization (2018). Available at:https://iris.who.int/handle/10665/274939 Google Scholar 12. SNV. Urban Sanitation in Bangladesh—Component 2: Safe and affordable sanitation services. (2017). Google Scholar 13. WaterAid. Assessing the usability of personal protective equipment for sanitation workers in tropical countries. (2020). Google Scholar 14. Velasco Garrido M, Bittner C, Harth V, Preisser AM. Health status and health-related quality of life of municipal waste collection workers—a cross-sectional survey.J Occup Med Toxicol. (2015) 10(1):22. doi: 10.1186/s12995-015-0065-6 PubMed Abstract|Crossref Full Text|Google Scholar 15. KCCA, KCCA Sewerage and FSM Ordinance 2019.pdf. (2019). Google Scholar 16. Rangamani S, Obalesha KB, Gaitonde R. Health issues of sanitation workers in a town in Karnataka: findings from a lay health-monitoring study.Natl Med J India. (2015) 28(2):70–3. Available at:https://www.cabidigitallibrary.org/doi/full/10.5555/2015343560626612148 PubMed Abstract|Google Scholar 17. Lundholm M, Rylander R. Work related symptoms among sewage workers.Occup Environ Med. (1983) 40(3):325–9. doi: 10.1136/oem.40.3.325 PubMed Abstract|Crossref Full Text|Google Scholar 18. Kish L, Kalton G, Heeringa S.Leslie Kish: Selected Papers. Hoboken, NJ: John Wiley (2003). p. 356. Google Scholar 19. Kuffour RA. Occupational health and safety challenges facing sanitary workers in sekyere central district in Ghana.J Environ Occup Health. (2020) 10(2):17–26. doi: 10.5455/jeoh.20190306031559 Crossref Full Text|Google Scholar 20. Tessema M, Sema W. Utilization of personal protective equipment and associated factors among large-scale factory workers in Debre-Berhan Town, Amhara Region, Ethiopia, 2021.J Environ Public Health. (2022) 2022:8439076. doi: 10.1155/2022/8439076 PubMed Abstract|Crossref Full Text|Google Scholar 21. Degavi G, Dereso CW, Shinde S, Adola SG, Kasimayan P. Prevention of occupational hazards among sanitary workers: knowledge, attitude, and practice survey in Bulehora, West Guji Zone, Oromia, Ethiopia.Risk Manag Healthc Policy. (2021) 14:2245–52. doi: 10.2147/RMHP.S308323 PubMed Abstract|Crossref Full Text|Google Scholar 22. Soleman SR, Lyu Z, Okada T, Sassa MH, Fujii Y, Mahmoud MA, et al. Efficacy of personal protective equipment to prevent environmental infection of COVID-19 among healthcare workers: a systematic review.Environ Health Prev Med. (2023) 28:1. doi: 10.1265/ehpm.22-00131 PubMed Abstract|Crossref Full Text|Google Scholar 23. Sehsah R, El-Gilany A-H, Megahed Ibrahim A. Personal protective equipment (PPE) use and its relation to accidents among construction workers.Med Lav. (2020) 111:285–95. doi: 10.23749/mdl.v111i4.9398 PubMed Abstract|Crossref Full Text|Google Scholar 24. Garrigou A, Laurent C, Berthet A, Colosio C, Jas N, Daubas-Letourneux V, et al. Critical review of the role of PPE in the prevention of risks related to agricultural pesticide use.Saf Sci. (2020) 123:104527. doi: 10.1016/j.ssci.2019.104527 Crossref Full Text|Google Scholar 25. Sharior F, Alam MU, Zaqout M, Cawood S, Ferdous S, Shoaib DM, et al. Occupational health and safety status of waste and sanitation workers: a qualitative exploration during the COVID-19 pandemic across Bangladesh.PLOS Water. (2023) 2(1):e0000041. doi: 10.1371/journal.pwat.0000041 Crossref Full Text|Google Scholar 26. Ayikoru M, Ddamulira C, Mutekanga DR. Determinants of employee use of personal protective equipment, the case of Spedag Interfreight Uganda limited, Kampala.J Environ Sci Public Health. (2019) 3(3):419–34. doi: 10.26502/jesph.96120073 Crossref Full Text|Google Scholar 27. Alam MU, Sharior F, Shoaib DM, Hasan M, Tabassum KF, Ferdous S, et al. Hygiene knowledge and practices and determinants of occupational safety among waste and sanitation workers in Bangladesh during the COVID-19 pandemic.Hyg Environ Health Adv. (2022) 4:100022. doi: 10.1016/j.heha.2022.100022 PubMed Abstract|Crossref Full Text|Google Scholar 28. ILO Health. Safety and Dignity of Sanitation Workers: An Initial Assessment 2022. Google Scholar Keywords:sanitation workers, PPE, utilization, fecal waste management plants, Uganda Citation:Bulafu D, Ninsiima LR, Tamale BN, Baguma JN, Namakula LN, Niyongabo F, Ndejjo R and Musoke D (2025) Utilization of personal protective equipment among sanitation workers in faecal-waste management plants in cities in Uganda.Front. Environ. Health4:1534012. doi: 10.3389/fenvh.2025.1534012 Received:25 November 2024;Accepted:19 May 2025;Published:5 June 2025. Edited by: Reviewed by: Copyright:© 2025 Bulafu, Ninsiima, Tamale, Baguma, Namakula, Niyongabo, Ndejjo and Musoke. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Douglas Bulafu,ZGJ1bGFmdUBtdXNwaC5hYy51Zw== Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract 1 Introduction 2 Materials and methods 3 Results 4 Discussion 5 Conclusions Data availability statement Ethics statement Author contributions Funding Acknowledgments Conflict of interest Generative AI statement Publisher's note References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}