{"id": 1680, "name": "Blckbx.tv", "domain": "blckbx.tv", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "very-low", "questionable": null, "url": "https://www.blckbx.tv/binnenland/bij-covid-zag-je-hetzelfde-patroon-zegt-maurice-de-hond-n-a-v-de-film-de-veroordeling", "title": "Bij Covid Zag Je Hetzelfde Patroon Zegt Maurice De Hond N A V De Film De Veroordeling", "content": "**Steun blckbx.tv** Blijf ons steunen, zodat we met elkaar nóg meer impact kunnen maken Duizenden donateurs gingen je voor **'Bij Covid zag je hetzelfde patroon!' zegt Maurice de Hond n.a.v. de film 'De Veroordeling'.** De film \"De Veroordeling\" belicht het leven van Michael de Jong alias 'de Klusjesman', die - volgens de makers - ten onrechte werd beschuldigd van moord na een mediahetze door Maurice de Hond. De film won 4 Gouden Kalveren en predikte de onschuld van De Jong. Bevindingen van een klokkenluider werpen echter een ander en misschien wel duister licht op de zaak. Is de verkeerde man veroordeeld? Stond de dader op het podium bij de uitreiking van het Gouden Kalf? Wat onthulde de klokkenluider aan Maurice de Hond? En waarom werd cruciaal bewijs genegeerd? Deel 1 van dit tweeluik focust op Ernest Louwes, terwijl deel 2 dieper ingaat op Michael de Jong, de klusjesman die wel eens anders de geschiedenisboeken in zou kunnen gaan als verwacht. **Maurice de Hond kreeg hulp van een anonieme klokkenluider** Het onderzoek naar Michael de Jong werd een maand na de moord abrupt gestopt, zonder dat daar enige aanleiding voor was. Maurice de Hond kreeg hulp van een anonieme klokkenluider, die zijn bevindingen met de Hoge Raad deelde. De klokkenluider beweert dat Michael de Jong een politie-informant was en dat diverse documenten die tegen hem pleitten zijn aangepast. De film \"De Veroordeling\" is goed gemaakt en ik was er altijd van overtuigd dat Maurice de Hond ten onrechte het leven van Michael de Jong had verwoest. Programmamaker Flavio Pasquino sprak Maurice de Hond er onlangs op aan. \"Toen hij mij vertelde wat hij allemaal wist, viel ik bijna van mijn stoel\", aldus Pasquino. \"Hoe kon zoveel belangrijk bewijs, dat voor het oprapen lag, genegeerd worden door de politie, door het OM en door de media?\"De bevindingen van de klokkenluider werpen een nieuw licht op de zaak en roepen om nadere belichting. Wie is de klokkenluider? Wat heeft Maurice de Hond precies onthuld? En wat voor bewijs is er genegeerd?Je gaat kijken naar deel 1 van een tweeluik waarin in deze episode wordt ingezoomd op Ernest Louwes.In deel 2 wordt er ingezoomd op Michael de Jong, beter bekend als ‘de klusjesman’. Bekijk direct deel 2hier. **Bekijk het interview via Rumble** Jammer dat FvD aan Vlees propaganda doet.Desondanks stem ik vandaag Lijst 4 No. 6 Jelena Postuma en hoop dat FvD spoedig tot innekeer zal komen en zich TEGEN de vleesindustrie zal keren. Dieren hebben een ziel en een hoog bewustzijn en hun lichaam is alleen maar van HEN, net zoals dat van ons alleen maar van ons is. Wat een jakhalsen, die rechters die Ernest alsnog veroordeeld hebben zonder sluitend bewijs.Ze ruiken iemands onschuld en zetten dan vol in op een veroordeling. Walgelijk.Super goed werk van Maurice !!! Wij plaatsen cookies om deze website goed te laten functioneren, campagnes op jouw voorkeuren af te stemmen en de website te analyseren. We nemen de bescherming van jouw privacy zeer serieus. We verzamelen alleen anonieme gegevens, tenzij jij ons expliciet toestemming geeft om andere gegevens te verzamelen. Lees in onsprivacy statementhoe we met je persoonsgegevens omgaan."}