{"id": 1560, "name": "We are the Mighty", "domain": "wearethemighty.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wearethemighty.com/entertainment/interview-country-pop-music-star-jessie-james-decker-on-growing-up-in-a-military-family-songwriting-and-patriotism/", "title": "Interview Country Pop Music Star Jessie James Decker On Growing Up In A Military Family Songwriting And Patriotism", "content": "NewsMilitary BranchesSpecial OperationsTechnology Military Branches Special Operations Technology Military Branches Special Operations Technology HistoryMighty HeroesToday in Military HistoryWars Mighty Heroes Today in Military History Wars Mighty Heroes Today in Military History Wars EntertainmentGamingHumor HubMoviesSports Gaming Humor Hub Movies Sports Gaming Humor Hub Movies Sports TacticalAviationCombat StoriesShipsSurvivalVehiclesWeapons Aviation Combat Stories Ships Survival Vehicles Weapons Aviation Combat Stories Ships Survival Vehicles Weapons Mighty MilSpouseCareerDeploymentKids & FamilyLatin MilSpouseMemoirsPCSTravelWellness Career Deployment Kids & Family Latin MilSpouse Memoirs PCS Travel Wellness Career Deployment Kids & Family Latin MilSpouse Memoirs PCS Travel Wellness MoreWe Are The Mighty Editorial GuidelinesRecurrent MilitaryMighty 25 We Are The Mighty Editorial Guidelines Recurrent Military Mighty 25 We Are The Mighty Editorial Guidelines Recurrent Military Mighty 25 Get a weekly roundup of our favorite features and stories from wearethemighty.com By signing up you agree to ourWe Are The Mighty’s Terms of UseandWe Are The Mighty’s Privacy Policy. 1.4M 104K 10.6K **Interview: Country pop music star Jessie James Decker on growing up in a military family, songwriting and patriotism** ByJoel Searls PublishedJun 1, 2025 9:37 AM PDT Reviewed ByTessa Robinson Jessie James Decker is a country music star known for her lovely songs, strong stage presence and a distinctly likable persona. She is a world-renowned artist known for her music with albums and EPs such asJessie James,Comin Home,Gold,Southern Girl City Lights,Blackbird Sessions,On This Holiday,The Woman I’ve BecomeandDecker the Halls. She has over six million combined social media followers across Instagram, Facebook, TikTok and YouTube. Decker even starred in her ownE!reality show with her husband Eric,Eric & Jessie: Game On, which ran for three seasons. Decker is a patriotic American country music star who has deep familial roots and loyalty to the military. Decker grew up around military service and enjoyed the experiences. She was born in Italy close to a U.S. military base where her father was stationed. Her mother, Karen Johnson, married her stepfather, Steve Parker, in the early 2000s who also served in the USAF, which led their family to move around to places such as Iowa, Kentucky, Texas, Louisiana and Georgia. She began to sing when she was 2 and won her first music contest at age 9, belting outI Want to Be a Cowboy’s Sweetheart. Through her teen years, she made weekly trips to Nashville to constantly improve her songwriting abilities. She made her big push into singing stardom at age 17 by signing with Mercury Records, which at that point, she was well on her way to a bright future. Decker is partnering withRocketand the USO for theirHomefront Heroesactivation, honoring the 500,000 military spouses who hold down the home front while their loved ones serve our country. She and her mother, Karen, sat down with We Are The Mighty to discuss their passions for military veterans. **WATM:Tell us about being a military spouse and having a husband in the USAF.** Karen:It was a privilege to support my husband and to serve alongside him because he is doing the most important job of protecting our country and keeping America free, no matter where we live. We try to put roots down no matter where we move; that’s one of the things. Putting roots down is just so incredibly important, especially when you’re moving around so much as a military family. **WATM:What was it like growing up in a military family?** Jessie:It’s just all I knew. I get asked that all the time. I think when you are born into it, it’s just a way of life. I remember always getting ready for a new adventure. Going to a new city, a new school, a new place and embracing where we were and our surroundings. It was even better when we would move to towns where no one was really military and they didn’t quite understand that the military is its own community. It’s all I knew, and I wouldn’t change it for the world. **WATM:What do your experiences mean to you today?** Karen:I want to take this opportunity to thank all of the military spouses out there. They are the unsung heroes and Steve is retired now with 37 1/2 years of service, including his Air Force Academy time. It was a privilege and a lot of hard work. All of those spouses out there who continue to support their husbands while they are deployed or who are serving and moving around so much, I just want to thank them for their service, too. Jessie:I have so many memories of Memorial Day weekend being out on the boat with my family in Florida. My dad’s making hot dogs on the boat with the American Flag waving in the wind and havingThe Eagleson the radio. We just had an incredible time together as a family in Destin, FL. Karen:We still do that today. The flag is flying on the boat, and we are waiting for Jessie and family to come down to make the hot dogs. Being around a military community, it feels so good. We can hear the national anthem played from our home. It’s just wonderful to continue to have that love of country. **Joel Searls** **Senior Contributor, Marine Corps Veteran** Joel Searls is a journalist, writer, and creative who serves as a major in the Marine Corps Reserve as a civil affairs officer and COMMSTRAT officer. He works in entertainment while writing for We Are The Mighty, Military.com, and The Leatherneck. Joel has completed the Writer’s Guild Foundation Veterans Writing Project, is a produced playwright (Antioch), a commission screenwriter, and Entertainment consultant. His most recent feature film-producing project is “Running with the Devil,” a top 10 film on Netflix written and directed by Jason Cabell, a retired Navy SEAL. He is a graduate of The Ohio State University. You can check out more of his work onhis blogand onThe Samurai Pulse. Learn more about WeAreTheMighty.comEditorial Standards Summary **Latest** **‘The Pursuit of Happyness’ was Navy veteran Christopher Gardner’s incredible real-life underdog story‘The Pursuit of Happyness’ was Navy veteran Christopher Gardner’s incredible real-life underdog story** **‘The Pursuit of Happyness’ was Navy veteran Christopher Gardner’s incredible real-life underdog story‘The Pursuit of Happyness’ was Navy veteran Christopher Gardner’s incredible real-life underdog story** ByJoel Searls **4 secret skills milspouses have but don’t realize4 secret skills milspouses have but don’t realize** **4 secret skills milspouses have but don’t realize4 secret skills milspouses have but don’t realize** ByJessica Evans **More in Entertainment** **Jessie G releases new single, ‘Dress Blues,’ in honor of US service membersJessie G releases new single, ‘Dress Blues,’ in honor of US service members** **Jessie G releases new single, ‘Dress Blues,’ in honor of US service membersJessie G releases new single, ‘Dress Blues,’ in honor of US service members** ByTeam Mighty **Loretta Swit, popular M*A*S*H star, passes away at 87Loretta Swit, popular M*A*S*H star, passes away at 87** **Loretta Swit, popular M*A*S*H star, passes away at 87Loretta Swit, popular M*A*S*H star, passes away at 87** ByJoel Searls **Dolly Parton’s husband of nearly 60 years and US Army veteran, Carl Dean, dies at 82Dolly Parton’s husband of nearly 60 years and US Army veteran, Carl Dean, dies at 82** **Dolly Parton’s husband of nearly 60 years and US Army veteran, Carl Dean, dies at 82Dolly Parton’s husband of nearly 60 years and US Army veteran, Carl Dean, dies at 82** ByJoel Searls **‘WARFARE’ hit me like a gut punch‘WARFARE’ hit me like a gut punch** **‘WARFARE’ hit me like a gut punch‘WARFARE’ hit me like a gut punch** ByTessa Robinson **WATM reviews military film, ‘Valiant One’ and interviews stars of movieWATM reviews military film, ‘Valiant One’ and interviews stars of movie** **WATM reviews military film, ‘Valiant One’ and interviews stars of movieWATM reviews military film, ‘Valiant One’ and interviews stars of movie** ByJoel Searls **U.S. Army family celebrates surprise trip to Walt Disney World from Operation GratitudeU.S. Army family celebrates surprise trip to Walt Disney World from Operation Gratitude** **U.S. Army family celebrates surprise trip to Walt Disney World from Operation GratitudeU.S. Army family celebrates surprise trip to Walt Disney World from Operation Gratitude** ByTessa Robinson **New book explores faith on the battlefieldNew book explores faith on the battlefield** **New book explores faith on the battlefieldNew book explores faith on the battlefield** ByEmily Compagno **Country superstar and Army Ranger Kris Kristofferson dies at 88Country superstar and Army Ranger Kris Kristofferson dies at 88** **Country superstar and Army Ranger Kris Kristofferson dies at 88Country superstar and Army Ranger Kris Kristofferson dies at 88** ByKait Hanson **NEWSLETTER SIGNUP** Get a weekly roundup of our favorite features and stories from wearethemighty.com By signing up you agree to ourWe Are The Mighty’s Terms of UseandWe Are The Mighty’s Privacy Policy. Military NewsMilitary BranchesAir ForceArmyNavyMarine CorpsCoast GuardSpace ForceSpecial Operations **Military News** Military Branches **Military Branches** Air Force **Air Force** Army **Army** Navy **Navy** Marine Corps **Marine Corps** Coast Guard **Coast Guard** Space Force **Space Force** Special Operations **Special Operations** **Military News** **Military News** Military Branches **Military Branches** **Military Branches** **Military Branches** Air Force **Air Force** **Air Force** **Air Force** Army **Army** **Army** **Army** Navy **Navy** **Navy** **Navy** Marine Corps **Marine Corps** **Marine Corps** **Marine Corps** Coast Guard **Coast Guard** **Coast Guard** **Coast Guard** Space Force **Space Force** **Space Force** **Space Force** Special Operations **Special Operations** **Special Operations** **Special Operations** HistoryToday in Military HistoryWarsMighty Heroes **History** Today in Military History **Today in Military History** Wars **Wars** Mighty Heroes **Mighty Heroes** **History** **History** Today in Military History **Today in Military History** **Today in Military History** **Today in Military History** Wars **Wars** **Wars** **Wars** Mighty Heroes **Mighty Heroes** **Mighty Heroes** **Mighty Heroes** EntertainmentGamingMoviesSportsHumor Hub **Entertainment** Gaming **Gaming** Movies **Movies** Sports **Sports** Humor Hub **Humor Hub** **Entertainment** **Entertainment** Gaming **Gaming** **Gaming** **Gaming** Movies **Movies** **Movies** **Movies** Sports **Sports** **Sports** **Sports** Humor Hub **Humor Hub** **Humor Hub** **Humor Hub** TacticalAviationCombat StoriesShipsTechnologyVehiclesWeapons **Tactical** Aviation **Aviation** Combat Stories **Combat Stories** Ships **Ships** Technology **Technology** Vehicles **Vehicles** Weapons **Weapons** **Tactical** **Tactical** Aviation **Aviation** **Aviation** **Aviation** Combat Stories **Combat Stories** **Combat Stories** **Combat Stories** Ships **Ships** **Ships** **Ships** Technology **Technology** **Technology** **Technology** Vehicles **Vehicles** **Vehicles** **Vehicles** Weapons **Weapons** **Weapons** **Weapons** Mighty MilSpouseCareerDeploymentKids & FamilyLatin MilSpouseMemoirsPCSTravelWellness **Mighty MilSpouse** Career **Career** Deployment **Deployment** Kids & Family **Kids & Family** Latin MilSpouse **Latin MilSpouse** Memoirs **Memoirs** PCS **PCS** Travel **Travel** Wellness **Wellness** **Mighty MilSpouse** **Mighty MilSpouse** Career **Career** **Career** **Career** Deployment **Deployment** **Deployment** **Deployment** Kids & Family **Kids & Family** **Kids & Family** **Kids & Family** Latin MilSpouse **Latin MilSpouse** **Latin MilSpouse** **Latin MilSpouse** Memoirs **Memoirs** **Memoirs** **Memoirs** PCS **PCS** **PCS** **PCS** Travel **Travel** **Travel** **Travel** Wellness **Wellness** **Wellness** **Wellness** MoreAbout UsContactEditorial GuidelinesSitemap **More** About Us **About Us** Contact **Contact** Editorial Guidelines **Editorial Guidelines** Sitemap **Sitemap** **More** **More** About Us **About Us** **About Us** **About Us** Contact **Contact** **Contact** **Contact** Editorial Guidelines **Editorial Guidelines** **Editorial Guidelines** **Editorial Guidelines** Sitemap **Sitemap** **Sitemap** **Sitemap** **FOLLOW US** **DISCLAIMER(S)** ©RECURRENT VENTURES, 2025 ALL RIGHTS RESERVED"}