{"id": 2045, "name": "Milliyet", "domain": "milliyet.com.tr", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://secim.milliyet.com.tr/31-mart-2024-yerel-secimleri/antalya-ili-yerel-secim-sonuclari/", "title": "Antalya Ili Yerel Secim Sonuclari", "content": "Ana Sayfa Tüm Belediye Başkanı Adayları Tüm Partiler Seçim Haberleri Yerel Seçim31 Mart 2024 Yerel Seçimleri23 Haziran 2019 İstanbul Tekrar Seçimi31 Mart 2019 Yerel Seçimi30 Mart 2014 Yerel Seçimler Genel Seçim28 Mayıs 2023 Cumhurbaşkanlığı 2.Tur Seçimi14 Mayıs 2023 Cumhurbaşkanlığı 1.Tur Seçimi14 Mayıs 2023 Milletvekili Seçimi24 Haziran 2018 Milletvekili Seçimi24 Haziran 2018 Cumhurbaşkanlığı Seçimi Tüm Seçim Sonuçları **ANTALYA Belediye Başkanlığı Seçim Sonuçları** Milliyet 31 Mart 2024 yerel seçimleri verileri içerisinde Antalya seçim sonuçları 2024 sayfasında Antalya ilinde hangi parti kaç oy aldı, belediye başkanlığını kim kazandı, kazanan parti ve oy oranları yer almaktadır. Antalya yerel seçim sonuçları sayfasında Antalya ilinde seçime katılan toplam seçmen sayısı, katılım oranı verilerine ulaşabilirsiniz. Seçim yayın yasağının sona ermesi ve akabinde açılan sandık oranına bağlı olarak sandıklardan çıkan geçerli ve geçersiz oy sayıları canlı sonuçlar açıklanmaya başlandığı andan itibaren takip edilebilmektedir. Sayfada bulunan il ve ilçe değiştirme menüleri sayesinde diğer illere geçiş yapılabilir. Bunun haricinde Antalya seçim haritası üzerinden Antalya ilinin ilçelerinin sonuçlarına ulaşabilirsiniz. Ek olarak partilere göre kazanılan toplam ilçe belediye başkanlığı sayıları, ilçe tablosunda ilçe oy oranları ve sonuçları ve il genel meclisi son durum bilgileri yer almaktadır. © 2025 Milliyet.com.tr 2024 Seçim Sonuçları Tüm Belediye Başkanı Adayları Tüm Partiler Seçim Haberleri 2019 Yerel Seçim Sonuçları 2014 Yerel Seçim Sonuçları Tüm Seçim Sonuçları İstanbul Seçim Sonuçları Ankara Seçim Sonuçları İzmir Seçim Sonuçları Bursa Seçim Sonuçları Konya Seçim Sonuçları Adana Seçim Sonuçları Şanlıurfa Seçim Sonuçları AK Parti CHP MHP İYİ Parti Dem Parti Memleket Partisi Zafer Partisi İstanbul Belediye Başkanı Adayları Ankara Belediye Başkanı Adayları İzmir Belediye Başkanı Adayları Bursa Belediye Başkanı Adayları Konya Belediye Başkanı Adayları Adana Belediye Başkanı Adayları Şanlıurfa Belediye Başkanı Adayları Sayfamızda yer alan seçim verileri Anadolu Ajansı tarafından sağlanmaktadır. Bu verilerdeki gecikme veya hatalardan milliyet.com.tr sorumlu tutulamaz. Sadece Anadolu Ajansı tarafından sağlanan verileri kullanarak güncel sonuçları sizlere sunmaktayız."}