{"id": 112, "name": "Avery Journal Times", "domain": "averyjournal.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.averyjournal.com/classifieds/service/home/construction/remodel/vfs-home/pdfdisplayad_4497c559-9d5a-565b-969d-2ab533b1eec4.html", "title": "Vfs Home", "content": "Facebook Twitter YouTube Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout e-Edition How-To Circulars Subscribe Manage Subscription (Pay Your Bill, Vacation Request, Update Account Info) Subscriber Savings Newsletters Contact Customer Service Government Community History NC News Promote Your Event Place An Ad Arrest Reports Land Transfers Read Today's Paper e-Edition How To 71°Partly Cloudy Search Search Search Open user controlsLog In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Site searchSearch Site searchSearch Site searchSearch Home News Sports Obits Classifieds Public Notices Arrests/Land Archives Best of the Best Shop Local Circulars Subscriber Savings **VF's Home** Facebook Twitter WhatsApp SMS Email Print Copy article link **Details forVF's Home** Updated10 hrs ago Ad 276732 Remodel [smile] [beam] [wink] [sad] [cool] [innocent] [rolleyes] [whistling] [lol] [huh] [tongue] [love] [sleeping] [yawn] [unsure] [angry] [blink] [crying] [ohmy] [scared] [sleep] [sneaky] [tongue_smile] [thumbdown] [thumbup] [censored] [happybirthday] [ban] [spam] [offtopic] [batman] [ninja] [pirate] [alien] Your comment has been submitted. Reported There was a problem reporting this. **Welcome to the discussion.** Log In Keep it Clean.Please avoid obscene, vulgar, lewd, racist or sexually-oriented language.PLEASE TURN OFF YOUR CAPS LOCK.Don't Threaten.Threats of harming another person will not be tolerated.Be Truthful.Don't knowingly lie about anyone or anything.Be Nice.No racism, sexism or any sort of -ism that is degrading to another person.Be Proactive.Use the 'Report' link on each comment to let us know of abusive posts.Share with Us.We'd love to hear eyewitness accounts, the history behind an article. Success!An email has been sent towith a link to confirm list signup. Error!There was an error processing your request. We'll send breaking news and news alerts to you as they happen! **Trending Now** Kickoff times, TV designations announced for start of App State football’s 2025 season Avery County Arrest Report Ordinary people, extraordinary acts: Lavonia Crest honors heroes this Independence Day Avery County Rodeo Showdown comes to Avery in August Longtime Foscoe restaurant closing its doors **Avery Journal Newsletters** Success!An email has been sent towith a link to confirm list signup. Error!There was an error processing your request. We'll send breaking news and news alerts to you as they happen! Facebook Twitter YouTube averyjournal.com wataugademocrat.com mountaintimes.com blowingrocket.com ashepostandtimes.com highcountrync.com News Sports Obits Local-events Arrests / Land Online Features About Us Contact Us Promote Your Event Subscription Services Submission Forms Classifieds Customer Service/Advertising Circulation / Subscribe Archives Subscriber Savings Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}