{"id": 1612, "name": "WRTV - Indianapolis News", "domain": "wrtv.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wrtv.com/news/local-news/bridging-the-math-opportunity-gap-exponentia-prime-academys-summer-camp-empowers-black-and-brown-students", "title": "Bridging The Math Opportunity Gap Exponentia Prime Academys Summer Camp Empowers Black And Brown Students", "content": "Menu WeatherIndianapolis, IN Interactive Weather Radar7-Day ForecastHourly ForecastIndianapolis School Closings and DelaysWeather AlertsWeather Blogs Indianapolis, IN Interactive Weather Radar 7-Day Forecast Hourly Forecast Indianapolis School Closings and Delays Weather Alerts Weather Blogs Indianapolis, IN Interactive Weather Radar 7-Day Forecast Hourly Forecast Indianapolis School Closings and Delays Weather Alerts Weather Blogs Local NewsCrimeHiring HoosiersInside IndyLocal History Crime Hiring Hoosiers Inside Indy Local History Crime Hiring Hoosiers Inside Indy Local History National NewsNational Politics National Politics National Politics World News WRTV InvestigatesAttorney Shortage Attorney Shortage Attorney Shortage SportsAuto RacingCollege SportsColtsFeverIndianapolis 500Pacers Auto Racing College Sports Colts Fever Indianapolis 500 Pacers Auto Racing College Sports Colts Fever Indianapolis 500 Pacers TrafficTraffic MapIndianapolis Gas Prices Traffic Map Indianapolis Gas Prices Traffic Map Indianapolis Gas Prices EntertainmentInside IndyFoodTV Listings Inside Indy Food TV Listings Inside Indy Food TV Listings Our WorldU.S. & World NewsSolar Eclipse U.S. & World News Solar Eclipse U.S. & World News Solar Eclipse Hiring HoosiersCareer ResourcesHiring Hoosiers ReportHiring Hoosiers Newsletter Career Resources Hiring Hoosiers Report Hiring Hoosiers Newsletter Career Resources Hiring Hoosiers Report Hiring Hoosiers Newsletter LifestyleLiving Well IndianaHome TourPets Living Well Indiana Home Tour Pets Living Well Indiana Home Tour Pets Multiplying Good MarketplaceContestsCircle City SpotlightHome ProsLiving Well Indiana Contests Circle City Spotlight Home Pros Living Well Indiana Contests Circle City Spotlight Home Pros Living Well Indiana Money MattersTax TipsDon't Waste Your Money Tax Tips Don't Waste Your Money Tax Tips Don't Waste Your Money Technology VideosLive VideoYouTube Channel Live Video YouTube Channel Live Video YouTube Channel About WRTVContact UsWRTV News TeamMobile AppsSupportMugshot Policy Contact Us WRTV News Team Mobile Apps Support Mugshot Policy Contact Us WRTV News Team Mobile Apps Support Mugshot Policy Advertise With Us Sign In Newsletters Sign Out Manage Emails Apps Careers Search Local News National News Investigations Traffic Weather Sports Contests Contact Us **Actions** Facebook Tweet Email **Bridging the math opportunity gap: Exponentia Prime Academy's summer camp empowers black and brown students** INDIANAPOLIS — Step inside Exponentia Prime Academy, where it certainly doesn’t seem like school’s out for summer. These students are hard at work. “We do tests, but they don't get graded,” 3rd grader Sean Johnson said. Indeed, it’s math camp—of course, there are no real grades. But there is real learning happening here. \"We've been learning about the power of twos, fractions, multiplication, and long division,\" 5th grader Carine Mugwaneza said. This camp offers students the opportunity to challenge themselves in the STEM field. “I am learning a lot of new math I didn’t learn in second grade,” said Johnson. That’s what this is all about—to show these students they can do these types of things. Frederick Jenkins, a fifth-grade math teacher and camp instructor, emphasized the importance of the program. “It's an opportunity for them to push past the norm. A lot of lower-income families don’t have access to robotics programs, engineering programs, or advanced math programs that encourage our students to strive for more,” Jenkins said. Priya Jones, a rising sophomore at Brebeuf Jesuit Preparatory School and a camp volunteer, is happy to help instill confidence in the campers. “It’s really important to get communities such as these into math and just getting them situated within this subject,” she said. Exponentia Prime's whole mission is to bridge the gap for Black and Brown students so they can have equal opportunities in education. “It's really amazing to see them grow—from maybe even crying about one problem to feeling super confident and saying, ‘I got it,’” Jones said. The hope is that offering rigorous math instruction will give these students an upper hand when they face standardized tests. “If we don't put that in front of them early, they won't have the opportunity to learn and grow in college,” Jenkins reiterated. Exponentia recognizes the systemic barriers and biases that prevent too many Black and Brown students from pursuing advanced coursework and careers in STEM fields. The initiative aims to show kids like these that it’s possible. “I kinda want to be a teacher,” shared Carine Mugwaneza, a fourth grader, while Sean Johnson added, “I want to be an astronaut.” At the camp, the engaging and educational activities are not just fun but meaningful, reinforcing essential skills. “Because it’s fun and you learn new stuff,” Sean summed up. In addition to rigorous math instruction, the camp also enriches students' understanding of their history. Educators are teaching young scholars about notable historical minority figures who made significant contributions to STEM fields, like Willa Brown and the Tuskegee Airmen. This connection helps students see the potential for their own futures and the legacy of excellence they can carry forward. **Sign up for theBreaking News Newsletterand receive up to date information.** **now signed up to receive theBreaking News Newsletter.** **Click here for Pacers coverage!** **Click here for Pacers coverage!** Indianapolis Local News Weather Indianapolis Interactive Traffic Map Sports Entertainment Life Marketplace Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public Files FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact WRTV6 wrtvnews wrtv UCfLYcp8eh4VAC8_BBRsHhFg"}