{"id": 1395, "name": "The Local (Switzerland)", "domain": "thelocal.ch", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thelocal.ch/20220202/why-your-swiss-citizenship-application-might-be-rejected-and-how-to-avoid-it/#article-comments", "title": "Why Your Swiss Citizenship Application Might Be Rejected And How To Avoid It", "content": "**Advertisement** NewsLatest newsZurichGenevaBasellausanneCost of livingTravel news Latest news Zurich Geneva Basel lausanne Cost of living Travel news Latest news Zurich Geneva Basel lausanne Cost of living Travel news EssentialsLiving in SwitzerlandMoving to SwitzerlandStudying in SwitzerlandMoneyVisasSwiss citizenshipResidency permitsTaxesReader questions Living in Switzerland Moving to Switzerland Studying in Switzerland Money Visas Swiss citizenship Residency permits Taxes Reader questions Living in Switzerland Moving to Switzerland Studying in Switzerland Money Visas Swiss citizenship Residency permits Taxes Reader questions Learn about SwitzerlandLanguage LessonsSwitzerland ExplainedDiscover SwitzerlandFood and Drink Language Lessons Switzerland Explained Discover Switzerland Food and Drink Language Lessons Switzerland Explained Discover Switzerland Food and Drink HomesPropertyRentingFind rentals Property Renting Find rentals Property Renting Find rentals JobsWorking in SwitzerlandWork permitsFind jobs in Switzerland Working in Switzerland Work permits Find jobs in Switzerland Working in Switzerland Work permits Find jobs in Switzerland Local directory NewsLatest newsZurichGenevaBasellausanneCost of livingTravel news Latest news Zurich Geneva Basel lausanne Cost of living Travel news Latest news Zurich Geneva Basel lausanne Cost of living Travel news EssentialsLiving in SwitzerlandMoving to SwitzerlandStudying in SwitzerlandMoneyVisasSwiss citizenshipResidency permitsTaxesReader questions Living in Switzerland Moving to Switzerland Studying in Switzerland Money Visas Swiss citizenship Residency permits Taxes Reader questions Living in Switzerland Moving to Switzerland Studying in Switzerland Money Visas Swiss citizenship Residency permits Taxes Reader questions Learn about SwitzerlandLanguage LessonsSwitzerland ExplainedDiscover SwitzerlandFood and Drink Language Lessons Switzerland Explained Discover Switzerland Food and Drink Language Lessons Switzerland Explained Discover Switzerland Food and Drink HomesPropertyRentingFind rentals Property Renting Find rentals Property Renting Find rentals JobsWorking in SwitzerlandWork permitsFind jobs in Switzerland Working in Switzerland Work permits Find jobs in Switzerland Working in Switzerland Work permits Find jobs in Switzerland switzerlandAll EditionsAustriaDenmarkFranceGermanyItalyNorwaySpainSwedenSwitzerland All Editions Austria Denmark France Germany Italy Norway Spain Sweden Switzerland All Editions Austria Denmark France Germany Italy Norway Spain Sweden Switzerland Become a member Newsletters Help Centre Gift Vouchers Educational Access Corporate Access About Us Contact Us News Archive Search articles All topics Advertise with us Local directory Post a job ad The Local Europe ABVästmannagatan 43113 25 StockholmSweden **How to avoid your Swiss citizenship application being rejected** 1 comment The strict criteria for obtaining a Swiss passport means that as many as one fifth of applications to become Swiss are rejected. Here’s what you should know about increasing your chances of being naturalised. **Advertisement** In 2021 some19 percent of applications to become Swisswere rejected whilst another 15 percent were either withdrawn or deferred - a sign that the process is far from straightforward. How quick and easy (or slow and painstaking) the process of obtaining Swiss citizenship is depends on many factors, including whether you are going through a simplified or regular naturalisation. But in either case, the surest way for your application to be rejected is because you are not eligible for citizenship in the first place, or you don’t provide all the required paperwork. For the ordinary naturalisation, the tougher of the two types of procedures, eligibility rules are stricter and you typically need to provide more documentation. These are some grounds for rejecting your application for ordinary naturalisation: **Advertisement** You don’t have a permanent residence C permit and / or have not lived in Switzerland continually for at least 10 years. “The years you have spent in Switzerland between the ages of 8 and 18 count double, but you must have actually lived in Switzerland for at least six years”,accordingto to the State Secretariat for Migration (SEM). **Advertisement** This includes time spent in the country with a B or Ci permit, as well as a legitimation card issued by the Federal Department of Foreign Affairs. READ MORE:I thought I was Swiss? How being mistaken as a national can put you on the road to citizenship Your application will not be accepted, however, if you have lived in Switzerland only as an asylum seeker (N permit) or on a short stay L permit. Additionally, cantons require a minimum residence period of between two and five years in the commune and in the canton. You are not sufficiently integrated Social integration plays a very important part in the citizenship process. This includes the ability to communicate in the national language of your region, with candidates having to demonstrate an A2 level writing ability and B1 spoken skills under theCommon European Framework of Reference for Languages. Just as essential is acceptance of the Swiss way of life and local customs, as well as good knowledge of your commune and general geographical area where you live. Not paying your taxes on time, being the subject of debt collection proceedings, having unpaid debts and a criminal record are also sure signs that your application will be refused. READ MORE:Reader question: What does being ‘successfully integrated’ in Switzerland mean? Some of these requirements may be difficult to assess until the candidate is invited for a face-to-face meeting, but if it becomes obvious from your application form that you fall short in any of these categories, then your candidacy will be refused. You receive social assistance Depending on public money to support yourself is not well seen in Switzerland if you are a foreigner seeking to be naturalised. In fact, your application for Swiss citizenship will be turned down if you have been on welfare in the three years prior to applying. An exception is made if the benefits are paid back in full before your application is received. READ MORE:How applying for social benefits could see your Swiss work permit cancelled Simplified naturalisation As the name suggests, this is a fast(er) track to obtaining citizenship — for instance, if you are married to a Swiss national or were born in Switzerland to foreign parents. But don’t let the word ‘simplified’ fool you: your application will be denied if you don’t meet certain criteria. EXPLAINED: Why ‘simplified’ Swiss naturalisation is actually not that simple Residence requirements If your spouse is Swiss, you must live in Switzerland for at least five years, spend the year prior to submitting the application in Switzerland, be married to and living with the Swiss citizen for at least three years. If you don’t fulfil these requirements, your application will not be accepted. READ MORE:Naturalisation through marriage: How your partner can obtain Swiss citizenship Third-generation foreign national You’d think that if you were born and grew up in Switzerland, your naturalisation would be easy and your candidacy would be approved without further ado. But even if you consider yourself Swiss and have never lived in another country, you are still on shaky ground if you fail to meet certain conditions: At least one of your grandparents was born in Switzerland and can be proven to have acquired a right of residence here. At least one parent has acquired a permanent residence permit, lived for at least 10 years in Switzerland and attended compulsory schooling in this country for at least five years. You were born in Switzerland and hold a permanent residence permit. You have attended compulsory schooling for at least five years in Switzerland. You are successfully integrated. You submit your application before your 25th birthday. If you submit the application after your 25th birthday but otherwise meet all the requirements, you can apply for simplified naturalisation until February 55, 2023 provided you will still be under the age of 40 on that date. If any of these criteria is not met, your application will be — you guessed it — denied. READ MORE: Would you pass a Swiss citizenship test? **Advertisement** Here’s how to avoid being a “reject” Before you get all your required paperwork together and send it to appropriate cantonal authorities, familiarise yourself with all the requirements for your particular case and category. How to apply for Swiss citizenship: An essential guide Don’t just send out your applications hoping nobody will notice that you don’t qualify — they will. If you do meet all the criteria for naturalisation, make sure you have the documents needed to prove your eligibility. More information (in German, French, and Italian) can be foundhere. **More** **Comments (1)** Join the conversation in our comments section below.Share your own views and experience and if you have a question or suggestion for our journalists then email us atnews@thelocal.ch.Please keep comments civil, constructive and on topic – and make sure to read ourterms of usebefore getting involved. Please log inhereto leave a comment. **See Also** **Advertisement** The Local Europe ABVästmannagatan 43113 25 StockholmSweden By signing up you agree to ourTerms of UseandPrivacy Policy.We will use your email address to send you newsletters as well as information and offers related to your account. 2025 The Local, All Rights Reserved."}