{"id": 561, "name": "Frontiers in Food Science and Technology", "domain": "frontiersin.org/journals/food-science-and-technology", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/food-science-and-technology/articles/10.3389/frfst.2025.1631439/full", "title": "Food Science And Technology", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Food Biotechnology Food Characterization Food Modeling Food Packaging and Preservation Food Process Design and Engineering Food Product Design Food Safety and Quality Control Food and Soft Materials Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Food Biotechnology Food Characterization Food Modeling Food Packaging and Preservation Food Process Design and Engineering Food Product Design Food Safety and Quality Control Food and Soft Materials Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Food Biotechnology Food Characterization Food Modeling Food Packaging and Preservation Food Process Design and Engineering Food Product Design Food Safety and Quality Control Food and Soft Materials Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office EDITORIAL article Front. Food. Sci. Technol. Sec. Food Modeling Volume 5 - 2025 |doi: 10.3389/frfst.2025.1631439 This article is part of the Research TopicAdvancing Food Processing: Novel Technologies and Modeling TechniquesView all 6 articles **Editorial: Advancing Food Processing: Novel Technologies and Modeling Techniques** 1National Centre of Excellence for Food Engineering, Industry and Innovation Research Institute, Sheffield Hallam University, Sheffield, United Kingdom 2School of Computing, Engineering and Digital Technologies, Teesside University, Middlesbrough, England, United Kingdom The final, formatted version of the article will be published soon. Select one of your emails You have multiple emails registered with Frontiers: Notify me on publication Please enter your email address: If you already have an account, pleaselogin You don't have a Frontiers account ? You canregister here Abdurrahman and Ferrari's review, Digital Twin applications in the food industry: a review, presents a comprehensive synthesis of the state-of-the-art in Digital Twin (DT) adoption. The authors evaluate how DTs have evolved from static digital models to dynamic, real-time systems capable of monitoring, predicting, and optimizing food processing operations. They examine use cases and implementation challenges, with a particular focus on sustainability. By categorizing DTs based on application level, modeling technique, and functionality, this article provides a practical taxonomy and roadmap for future adopters. A key insight is the relative lack of DT deployment in food manufacturing compared to agriculture-a research gap they urge the community to address.In Simulation of granular flows and machine learning in food processing, Cui et al. investigate granular material behavior-an area of increasing relevance in food processing and transport operations. Using Discrete Element Method (DEM) simulations, combined with supervised machine learning approaches such as Random Forest and Ridge Regression, the study offers a dual pathway to predict granular flow behaviors. Their findings show that integrating DEM datasets with machine learning improves predictive accuracy while reducing computational costs. This combined approach holds strong potential for optimizing equipment design and operations involving powders and grains.Chen et al., in Maximizing the disinfection effectiveness of 254 nm UV-C light with a special design unit: simulation and experimental approaches, explore the combined use of simulation and experimentation to enhance UV-C disinfection efficiency for complex surfaces. The study presents a specially designed UV-C unit that achieves isotropic germicidal light distribution-essential for irregular, hard-to-sanitize surfaces found in food processing and healthcare environments. By integrating ray-tracing simulations with microbial inactivation tests using E. coli and Listeria innocua, the authors demonstrate up to 6.9 log CFU reductions. They also highlight how surface properties like roughness and hydrophobicity affect disinfection efficacy. The validated use of optical ray tracing for predicting fluence distribution, paired with microbial kinetics, presents a strong framework for developing future UV-C systems.Jha and Tripathy, in Performance evaluation and finite element modeling of heat, mass, and fluid flow inside a hybrid solar dryer during drying of paddy grains, present a rigorous computational and experimental study of a photovoltaic-assisted hybrid solar dryer (HSD) for paddy grain drying. They simulate heat and mass transfer within the dryer using finite element methods, validated by experimental results. The study evaluates system performance under varying thermal and airflow conditions, benchmarking the HSD against conventional tray and mixed-mode dryers. The model accurately predicts spatial distributions of temperature, air velocity, and moisture content. Results show up to 81% collector efficiency and 25-33% reductions in drying time. This work supports the development of energy-efficient drying solutions in low-resource settings, underscoring the value of simulation-driven dryer design.A shared theme across these contributions is the integration of novel food processing technologies with advanced computational modeling. From finite volume, finite element, and discrete element method simulations to artificial intelligence and Digital Twins, the breadth of approaches illustrates the field's shift toward data-driven, predictive manufacturing.Nonetheless, challenges remain. While modeling capabilities are growing, integration with real-time industrial operations-particularly for small and medium enterprisesremains nascent. More work is needed to standardize data collection and preprocessing for ML and simulation-based studies to enhance reproducibility. Moreover, multi-scale modeling-linking molecular transformations to macroscopic quality outcomes-remains underdeveloped, especially for complex materials like granular or fibrous foods.The Digital Twin paradigm stands out as a promising avenue. As Abdurrahman and Ferrari highlight, DTs enable real-time decision-making and resource optimization. Yet, their deployment in food manufacturing remains limited. Future research should focus on scalable, modular DT frameworks that can integrate with existing equipment and data infrastructures.Additionally, while many studies in this Research Topic focus on single technologies or processes, integrated models simulating full production chains would be valuable. These models should account for variability in raw materials, environmental conditions, and dynamic processing scenarios-key for building resilient, low-carbon food systems.In summary, this Research Topic demonstrates the transformative potential of combining physical food processing innovations with advanced modeling and simulation tools. The featured studies offer robust examples of how interdisciplinary research can push the boundaries of sustainable, intelligent, and high-quality food production.We thank all contributing authors for their outstanding work and hope this collection serves as a valuable reference for researchers, practitioners, and policy-makers in food engineering and related fields. Keywords:Novel food processing technologies, Computational modelling, Digital Twin, machine learning, Granular flow simulation, High-moisture extrusion, UV-C disinfection Received:19 May 2025;Accepted:02 Jun 2025. Copyright:© 2025Zhang and Cui. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) or licensor are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. * Correspondence:Hongwei Zhang, National Centre of Excellence for Food Engineering, Industry and Innovation Research Institute, Sheffield Hallam University, Sheffield, United Kingdom Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Share on Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}