{"id": 1266, "name": "Australian Skeptics Inc.", "domain": "skeptics.com.au", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.skeptics.com.au/events/skeptics-cafe-vic-skeptics-in-the-pub-2025-07-21/", "title": null, "content": "About Us Support Us Events Magazine Shop News Resources About Us Support Us Events Magazine Shop News Resources Menu **Skeptics Cafe – Vic Skeptics in the Pub** **When** **Where** About Us The SkepticMagazine $100,000 Challenge The Bent Spoon Merit Awards Support Us Contact Us Articles Educational Resources Links of Interest Videos Convention Videos Australian Skeptical Podcasts The SkepticPrint Issues The SkepticDigital Issues Login Victoria Queensland Queensland (Gold Coast) Australian Capital Territory South Australia Tasmania Western Australia Privacy Policy Comments Policy Cart Account **Contact Us** Resources News Shop About The Skeptic Support Us About Us Resources News Shop About The Skeptic Support Us About Us **About Us** **Our Goals** **Our History** **Inclusivity and Diversity** **Contact Us** **Our Activities** $100,000 Challenge The SkepticMagazine Skepticon The Bent Spoon Award Merit Awards Grants **Other Groups** Victoria Queensland Queensland (Gold Coast) Australian Capital Territory Tasmania South Australia Western Australia **Support Us** **Donations & Bequests** **Coming Soon! Supporter Packages** **Show your support for the Skeptics, and we’ll give you something in return.** **Subscribe toThe Skepticmagazine** **Subscribe to the second oldest skeptical magazine in the known universe!** **Resources** Articles Videos Skepticon Videos Podcasts Links of Interest Educational Resources All **Latest News** **Restoring Randi – historic Skeptic artefact resurrected** **Changes – EO to retire, Skeptic mag moves online** **Lifetime achievement award to Richard Saunders** **Archive** All **The Skeptic** **Back Copies** **History** **Issues published more than one year ago, plus special publications and compendiums, are available to read online in full, for free.** **Subscribe toThe Skepticmagazine** **Subscribe to the second oldest skeptical magazine in the known universe!** **Events by State** New South Wales Victoria Queensland Australian Capital Territory Tasmania South Australia Western Australia Northern Territory **Events Code of Conduct** **Upcoming Events** **Skepticon** **Australian Skeptics Inc and NZ Skeptics Society are teaming up in 2021 to co-produce a one-of-a-kind Skepticon. November 20-21.** **Shop** View Cart Checkout Manage Account **Subscribe toThe Skepticmagazine** **Subscribe to the second oldest skeptical magazine in the known universe!** **COMING SOON! Supporter Packages** **Show your support for the Skeptics, and we’ll give you something in return.**"}