{"id": 528, "name": "Frontiers in Complex Systems", "domain": "frontiersin.org/journals/complex-systems", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/complex-systems/articles/10.3389/fcpxs.2025.1563687/full", "title": "Complex Systems", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Complex Networks Complex Physical Systems Complex Systems Theory Control and Engineering of Complex Systems Multi- and Cross-Disciplinary Complexity Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Complex Networks Complex Physical Systems Complex Systems Theory Control and Engineering of Complex Systems Multi- and Cross-Disciplinary Complexity Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Complex Networks Complex Physical Systems Complex Systems Theory Control and Engineering of Complex Systems Multi- and Cross-Disciplinary Complexity Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Complex Syst., 22 April 2025 Sec. Multi- and Cross-Disciplinary Complexity Volume 3 - 2025 |https://doi.org/10.3389/fcpxs.2025.1563687 **On cyclostationary linear inverse models: a mathematical insight and implication** 1Mathematical Institute, Tohoku University, Sendai, Japan 2Department of Earth and Atmospheric Sciences, Cornell University, Ithaca, NY, United States 3Advanced Institute for Materials Research, Tohoku University, Sendai, Japan 4Application Laboratory, Research Institute for Value-Added-Information Generation, Japan Agency for Marine-Earth Science and Technology, Yokohama, Japan Cyclostationary linear inverse models (CS-LIMs) are advanced data-driven techniques for extracting first-order time-dependent dynamics and random forcing information from cyclostationary observational data. This study focuses on the mathematical perspective of CS-LIMs and presents two variants, namely,e-CS-LIM andl-CS-LIM. Thee-CS-LIM, improved from the original CS-LIM, constructs the first-order dynamics through the interval-wise application of the stationary LIM (ST-LIM), capturing the integrated effect of each interval where similar cyclostationary dependencies are present. This approach provides robustness against noise but is affected by the Nyquist issue, similar to the ST-LIM. Thel-CS-LIM, on the other hand, estimates the time-dependent Jacobian of the underlying system. Although more sensitive to noise, this method is free from the Nyquist issue. Numerical experiments demonstrate that both CS-LIM variants effectively capture the temporal structure of the underlying system using synthetic observational data. Moreover, when applied to real-world ENSO data, CS-LIMs yield consistent results that align well with the observations and current El Niño–Southern Oscillation (ENSO) understanding. **1 Introduction** The stochastic differential equation (SDE) is a mathematical framework employed to study dynamical systems subjected to both deterministic and stochastic influences. It combines the deterministic part expressed through ordinary differential equations with the random forcing term formulated by Gaussian white noise, making itself invaluable across diverse disciplines (Øksendal, 1987;Särkkä and Solin, 2019). For example, SDEs are used to capture the unpredictable nature of stock prices in financial mathematics and describe the erratic movement of particles in fluids, as studied in physics (Øksendal, 1987;Rüschendorf, 2023;Seifert, 2012). Furthermore, beyond modeling, SDEs also find applications in inverse problems, including linear inverse models (LIMs) (Kwasniok, 2022;Penland, 1989;Penland and Magorian, 1993;Penland and Matrosova, 1994). LIMs serve as mathematical tools that extract the linear dynamics and random forcing behavior of the underlying complex non-linear stochastic process based on finite sampling data. This approach allows researchers to study the time evolution of deviations from a stable equilibrium point, infer system dynamics, and quantify uncertainties that are difficult to measure directly (Penland and Magorian, 1993;Penland and Matrosova, 1994;Penland and Sardeshmukh, 1995). More precisely, consider a dynamical system of the following form: wherex(t)is the system state at timet,fis the unknown system, andξrepresents the normalized Gaussian vector. The stationary LIM (ST-LIM) approximatesEquation 1using a Markov system, given by whereAandQdescribe the constant first-order deterministic dynamics and the covariance of noise, respectively (Penland, 1989;Penland and Matrosova, 1994). This is referred to as the Markov approximation or assumption. In the stationary state, the correlation functionKofEquation 2follows an exponential form, where the exponent corresponds toA. The value ofAcan be obtained if the values ofKare known at the origin and at some lagτ. Subsequently, the constant diffusion matrixQcan be obtained through the fluctuation–dissipation relation (FDR). Therefore, for stationary finite observations, first-order dynamics and diffusion for the underlying stochastic process can be estimated with the Markov approximation. Moreover, to verify the effectiveness of the linear model, the tau-test has been widely applied (Penland and Sardeshmukh, 1995;Penland, 2019). This test estimates the dynamics over a range of lagsτand is considered successful if the estimated dynamics remain independent ofτ. Due to its mathematical simplicity and applicability, the ST-LIM has been widely applied to climate science to study large-scale climate events, including El Niño–Southern Oscillation (ENSO) (Alexander et al., 2008;Johnson et al., 2000a;Newman et al., 2011b;Penland and Magorian, 1993;Penland and Matrosova, 1994;Penland and Matrosova, 2006;Perkins and Hakim 2020). However, it can fail drastically in reconstructing the Markov system, even if the observational dataset is sampled directly from the system itself, due to the Nyquist issue (Johnson et al., 2000b;Penland and Sardeshmukh, 1995;Penland, 2019). This occurs when the lagτis close to the multiples of the Nyquist lags, which are half the imaginary parts of the eigenvalues of the first-order dynamics. Moreover, its assumption of stationarity can lead to significant limitations in practice. For example, ST-LIM cannot resolve the periodic feature of cyclostationary observations or analyze the seasonality of global-scale physical phenomena (Penland and Sardeshmukh, 1995). The interactions between seasonal cycles and climate modes have been increasingly recognized as a central aspect of climate variability research in recent years (Stuecker et al., 2015;Stuecker et al., 2013;Zhao et al., 2024). Previous studies have addressed seasonality in climate science through different strategies (Stuecker, 2023). One approach imposes periodicity on the data analysis, including the cyclostationary empirical orthogonal function, analyzing the time-dependent physically meaningful modes (Hamlington et al., 2011;Kim, 2002;Kim et al., 2015). Another example involves dividing observational data by the calendar month and analyzing each segment separately—for instance, by applying the Markov approximation (Xue et al., 2000). On the other hand, mathematical modeling with periodicity offers an alternative, but the periodicity is often simplified as a sinusoidal fluctuation to reduce parameter estimation demands and overall model complexity (Johnson et al., 2000b;OrtizBeviá, 1997). Meanwhile, some studies assume that cyclostationary dependence is primarily driven by stochastic random forcing rather than by deterministic dynamics (Alexander et al., 2008;Newman et al., 2011a;Penland, 1996). However, none of these approaches fully integrate deterministic dynamics with external random forcing, motivating the development of cyclostationary LIMs (CS-LIMs) (Shin et al., 2021). The original CS-LIM, a variant of LIMs, was introduced recently in the climate science community, bridging a critical gap in analyzing and modeling the seasonal cycle of a climate phenomenon (Shin et al., 2021). This method is designed to capture the first-order temporal structure of the deterministic and stochastic components of a cyclostationary process (i.e., the unknown systemfinEquation 1is periodic), and it has been applied to study the seasonal variation in ENSO using geophysical fields such as monthly sea surface temperature (SST) time-series data (Shin et al., 2021). Compared to the analyses based on the ST-LIM framework, the original CS-LIM has shown an improved forecast skill and a more accurate ENSO characterization (Kido et al., 2023;Shin et al., 2021;Vimont et al., 2022). In recent years, CS-LIM has been increasingly recognized as an important mathematical tool in climate science. However, its mathematical basis is worth further exploration. Enhancing the theoretical rigor of CS-LIM would not only solidify its mathematical foundation but also extend its applicability to broader areas in climate research or other applied fields of science. From a mathematical perspective, under the cyclostationary condition, the original CS-LIM first approximates the complex non-linear stochastic system with a periodic Markov system of the following form: whereA(t)andQ(t)are periodic families of dynamical and diffusion matrices, respectively. To estimateA(t)andQ(t), the original CS-LIM divides the full period into several intervals, applies the ST-LIM interval-wise to extract the first-order dynamics, and then estimates diffusion by enforcing the cyclostationary version of FDR (Shin et al., 2021). Therefore, unlike the ST-LIM, which reconstructs the linear dynamics and diffusion of a Markov system, the original CS-LIM does not reconstruct the periodic linear dynamics and diffusion for a process satisfyingEquation 3; rather, it estimates them. Even so, this estimation is sufficient for most applications. The detailed formulations ofEquations 2,3will be provided in the later sections. In this article, we study CS-LIMs from a mathematical perspective by providing a theoretical background and examining the validity of approximation used in the models. In particular, we refine the original CS-LIM to thee-CS-LIM by improving the finite difference stencils to remove an artificial phase shift. However, because of the interval-wise application of ST-LIM, it is still vulnerable to the Nyquist issue. As an alternative, we presentl-CS-LIM, an analytic inverse model corresponding toEquation 3. The time-dependent dynamics are estimated using the first-order right-derivative of the correlation function at 0-lag, and hence,l-CS-LIM is unaffected by the Nyquist issue. We also note that it corresponds to the pointwise Markov approximation, in contrast to the interval-wise version. Notably, thee-CS-LIM andl-CS-LIM are closely related. In practical implementation, the former utilizes anexponential fitting, while the latter uses alinear fittingto the observed correlation function to estimate the first-order dynamics of the underlying system using finite cyclostationary data. The exponential fitting approaches the linear fitting when the sampling intervalΔtand the lagτare sufficiently small and the number of intervals and the sampling size are sufficiently large. Therefore, in such a limit,e-CS-LIM converges tol-CS-LIM, in the sense that the difference between their estimated results can be arbitrarily small. On the other hand, forτ>Δt, they can be designed to serve different purposes. Thee-CS-LIM constructs dynamical matrices, each of which best represents the integrated effect of the underlying dynamics within each interval, leading to its robustness against noise. In addition, the tau-test provides a quantitative measure of the validity of the linearity assumption within each interval. On the other hand, as a derivative-based method, thel-CS-LIM estimates the Jacobian of the underlying system, representing the instantaneous dynamical information. The remainder of this study is structured as follows: inSection 2, we review the mathematical background of the ST-LIM and discuss the Nyquist issue based onPenland (2019), extending the analysis by examining it from the perspective of perturbation theory. InSection 3, we present the formulation of CS-LIMs, including the original CS-LIM byShin et al. (2021),e-CS-LIM, andl-CS-LIM, along with their numerical issues and the relationships among various LIMs. The proofs of the key equations are presented in theSupplementary Material. Then, the numerical experiments are presented inSection 4to demonstrate the effectiveness ofe-CS-LIM andl-CS-LIM. Finally, inSection 5, we apply the CS-LIMs to real-world cyclostationary data to discuss the ENSO mechanism. Before proceeding to the next section, we briefly explain the convention of our notation. Vectors are assumed to be column vectors unless stated otherwise. We use bold font for continuous-time forward formulations and regular font for inverse problems. Moreover, true values are denoted in bold, while model outputs are in regular font in the numerical experiments or applications. When referring to time-series data, we mean a discrete-time sequence ofn-dimensional vectors indexed bykwith an equal sampling interval represented byΔt(i.e.,{x(t)|t=kΔt}⊂Rn). Furthermore, we assume either stationarity or cyclostationarity throughout this article. **2 Review of the ST-LIM** To represent the underlying unknown system from finite observations, the ST-LIM framework constructs a best-fit linear system within the class of Ornstein–Uhlenbeck (OU) processes given by the following equation: whereAis the real-valued dynamical matrix andQis the positive definite diffusion matrix (Penland, 1989;Penland and Magorian, 1993). The noise termξis a normalized Gaussian random vector with zero mean, and where the bracket andδdenote the expectation and Dirac delta function, respectively. Given this setup, the evolution of probability distributionPis described by the well-known Fokker–Planck equation as follows: whereLFPis the Fokker–Planck operator (Øksendal, 1987;Särkkä and Solin, 2019). To ensure a stationary distribution, each eigenvalue ofAmust have a negative real part, thereby making it a damping operator. The balance between the dissipative dynamics and the external excitation random forcing is given by the fluctuation-dissipation relation (FDR) as follows: Here,Cdenotes covariance. The correlation functionK(τ):=⟨x(⋅+τ)xT(⋅)⟩admits an explicit form forτ≥0, allowing us to formally express the dynamical matrix in terms of the matrix logarithm of the Green functionG, given byG(τ)=K(τ)C−1; thus, for any lagτ>0, we obtain In practical applications, given a finite set of observational data{x(t)}⊂Rn, wherex(t)follows a continuous distribution and is governed by an unknown complex system, the ST-LIM uses the observed correlation functionKobs, computed as andEquations 6,8to determine the estimated first-order dynamicsASTand diffusion matrixQST. Consequently, it yields the approximate system of the form to represent the underlying system. This approach is referred to as the Markov assumption or Markov approximation. Though the ST-LIM algorithm appears straightforward, the choice ofτis critical. It cannot be arbitrary due to the multi-valued nature of the matrix logarithm and the potential numerical instabilities arising from the eigenstructure of the Green function at multiples of Nyquist lags. This issue becomes especially critical for largerτvalues, particularly in the tau-test, whereτis varied over a broader range (Penland, 2019). **2.1 Multi-valued logarithm** In theory, to ensure that the logarithm (Equation 8) correctly estimatesA, it is essential to select the appropriate branch cut rather than always using the principal logarithm. LetUandV, respectively, be the matrices consisting of the left eigenvectorsujand right eigenvectorsvjcorresponding to the eigenvalueγjofAsuch thatUVT=UTV=I(Penland and Matrosova, 1994;Risken, 1989). AsG(τ)=eτA, we have the spectral decomposition as follows: and wheregj(τ)=eτγj. Suppose thatAhas a conjugate eigenpairγ±=α±βi; for clarity, we drop the subscriptj. Then, the computation of the matrix logarithm reduces to the complex logarithm of eigenvalueslog(eτγ±)/τ, which can take values from the set{α+i(±β+2kπ/τ)|k = 0, 1, 2,...}. If the principal logarithm, whose branch cut is the negative real line, is used, a jump discontinuity will appear whenτfirst crossesτ0=π/β, andEquations 9a,bwill not return the correct phase argument forτ>τ0. Furthermore, as the eigenpairg±=eτγ±ofG(τ)merges into repeated eigenvalues atτ0, an ambiguity arises in choosing and numbering the eigenvectors. This critical valueτ0is known as the Nyquist lag (Penland, 2019). To ensure thatEquations 9a,bhold for allτ>0, with an initialτ<τ0, one must track the phase of each eigenvaluelog(g±)and the corresponding eigenvectors. This is particularly important whenτapproacheskτ0, where k > 0, as the discontinuities in the logarithm or repeated eigenvalues may occur. In such cases, it is necessary to adjust the branch cut or appropriately select the eigenvectors. With an appropriate eigen-adjustment,Equations 9a,bhold for eachτ>0, allowingAto be consistently constructed fromG(τ). The number of Nyquist lags corresponds to the number of complex eigenpairs, so the initial point should be selected to be less than the smallest Nyquist lag. **2.2 Nyquist issue** The Nyquist issue arises from the multivalued nature of the complex logarithm and the instability of eigenvectors ofGat the Nyquist lag (Penland, 2019;Penland and Sardeshmukh, 1995). LetGobsdenote an observed Green function computed from finite observations{x(t)}of a Markov system, and letuobs,vobs, andg±obs, be defined in the same manner as before. We can express this as follows: whererdenotes the residual matrix. As the eigenvalue varies continuously with respect tor, the repeated eigenvaluesg±=−eατ0can split into two distinct real eigenvaluesg±obs,at a Nyquist lagτ0whenever0<r≪1. This typically does not create significant issues ifris sufficiently small, which is expected when the observation time is sufficiently long. In such cases, we can track the eigenvalues ofGobsas a function of discrete-valuedτand number them so that each eigenvalue is “numerically” continuous inτ. However, at the Nyquist lag, the eigenvectors become discontinuous atr=0due to the repeated eigenvalues and undergo a drastic change once perturbed. In particular, the eigenvectorsu±,v±,uobs(τ<τ0), andvobs(τ<τ0)may have complex entries, whileuobs(τ0)is real-valued. Therefore,Equations 9a,bare not stable at the Nyquist lags and their multiples, where repeated eigenvalues should ideally be present. More concerningly, at odd multiples of the Nyquist lags, the perturbationrfurther introduces complex entries intolog(Gobs), contradicting the real-valued observations (Culver, 1966). In practice,Gobsis inevitably noisy due to finite observation, causing potential failures in the tau-test wheneverτapproaches one of the multiples of the Nyquist lags. This issue becomes increasingly unavoidable asnincreases (Penland, 2019). To demonstrate the Nyquist issue, we consider the linear system (Equation 4), where C=I, andQ=−(A+AT). This linear system, similar to example 1 inPenland (2019), consists of two non-interacting rotation submatrices, with the corresponding Nyquist lags being 0.1 and 0.14. We compute the dynamical matrices over different values ofτusingEquations 9a,bunder four different conditions: whether the Green function is subjected to residual noise or not and whether the eigen-adjustment is applied or not. Then, the resulting output matricesAoutputare compared with the ground truth matrixAusing the relative error measured by theL2-norm, defined as follows: Figure 1shows the relative errors as a function ofτ. Without eigen-adjustment, the relative errors of the estimated dynamical matrices diverge after the smallest Nyquist lag of 0.1, regardless of the presence of residual noise, and do not recover asτincreases. With eigen-adjustment, the ground truth can be estimated if the Green function is free from noise, which is equivalent to an ideal scenario of flawless and infinite observations. On the other hand, when the noisy Green function is noisy, the Nyquist issue persists at multiples of the Nyquist lags. Figure 1. Nyquist issue of the ST-LIM. The plot shows the relative errorseAof the estimated dynamical matrices as a function of lagτ, calculated under four different conditions.Gdenotes the theoretical Green function (assumed to be noise-free), andGobsrepresents the noisy Green function. In particular, the residual term is set asr(τ)=0.01×e−10τN, whereNis a random matrix with entries sampled from the standard Gaussian distribution. The adjusted and non-adjusted conditions show how eigen-adjustment impacts the stability of the estimated dynamics, with peaks indicating instability at the multiples of Nyquist lags. **3 CS-LIM** Although the ST-LIM is effective for stationary observational data, its stationary assumption renders it incapable of capturing the periodic characteristics of cyclostationary data. In the CS-LIM framework, we model the underlying unknown periodic system using the periodic OU process as follows: whereAandQare periodic dynamical and (positive definite) diffusion matrices, respectively, with the same period. Without loss of generality, we may assume that the period equals 1. The time evolution of the probability distribution is given byEquation 5, withAandQbeing time-dependent. To achieve a cyclostationary steady state, all Floquet multipliers (i.e., the eigenvalues of the monodromy matrixM) ofEquation 13must have modulus less than 1 (Chicone, 2006;OrtizBeviá, 1997). In the cyclostationary steady state, the covariance functionCcan be viewed as a function on the circleSof perimeter 1, called the phase space, which is parametrized byθ. By naturally identifyingAandQwith functions onSthrough the projection mapω:R→S, the balance equation is now described by the cyclostationary FDR (CS-FDR) as follows: For convenience, we identify the phase variableθwith the time variabletviaθ=ω(t)without explicitly stating it when there is no confusion. In general, sinceA(t)A(s)≠A(s)A(t)for sometands, the monodromy matrixMand the correlation functionK(τ,θ)=⟨x(t+τ)xT(t)⟩do not admit an explicit expression. To better understand the periodic system, as a heuristic example, let us considerA(t)=1+f(t)Ā, whereĀis the mean state andf(t)satisfying∫01f(t)dt=0describes the variation. In this special case, the monodromy matrix can be explicitly written asM=eĀ, meaning that stability requires all eigenvalues ofĀto have negative real parts and that temporary instability is possible asf(t)may take values less than−1at certain times. Moreover, the correlation function can be expressed asK(τ,θ)=e∫tt+τA(τ′)dτ′C(t), implying that the integrated effect of the dynamical matrices over the current timetand itsτ-lag later is considered. Following the workflow of the ST-LIM, our goal is to expressAin terms of the correlation functionK. However,Kis, in general, mathematically intractable, making it difficult to derive a logarithmic-like equation similar toEquation 8. Therefore, an alternative approach is necessary. **3.1e-CS-LIM** To determine the first-order dynamics,Shin et al. (2021)proposed what we now call the interval-wise Markov approximation, forming the basis of the original CS-LIM and the proposede-CS-LIM. For clarity, we briefly outline this method using an example. Consider a set of observations{x(t)}of a physical phenomenon with a diurnal period (1 day), with a sampling intervalΔtof 15 min overLdays. First, by equi-partitioning the phase space intoM=24intervalsIj(j=1,…,24), the data are divided into 24 subsets given bySj:={x(t)|ω(t)∈Ij}, where thejth subset contains data sampled during thejth hour of a day. EachSjpresents a similar stage of cyclostationary dependence. For eachj, we compute the observed correlation functionKjobs(τ)forτ=0andτ=mΔtusing data sampled in thej-th hour of a day andτminutes later; that is, we compute whereSjdenotes the number of observations inSj. The interval-wise Markov approximation plays a crucial role in estimating the dynamics. Thee-CS-LIM makes the stationary assumption for each hour and attempts to applyEquation 8to estimate the dynamics. This extends the Markov approximation across all hours, justifying the term interval-wise Markov approximation. However, in contrast to ST-LIM, which uses all available observations to estimate a single dynamical matrix, thee-CS-LIM approach may suffer from insufficient sampling due to equi-partitioning. This may further result in noisyKobsin the phase directionj, potentially requiring a filter to smoothKobsinjbefore solving the dynamics. This procedure is known as phase averaging (Shin et al., 2021). Once a suitableKobsis obtained,Equation 8is applied for eachjto compute the estimated dynamicsAje−CS, followed by the CS-FDR (Equation 14) to compute the estimated diffusion matrixQje−CSfor thejth hour. As a result,e-CS-LIM formally produces an approximate system of the following form: whose cyclostationary probability distributionPste−CSis Gaussian at eacht. The original CS-LIM follows the same procedure but differs in the numerical implementation, with its output matrices denoted byAo−CSandQo−CS. Although the interval-wise Markov approximation works in practice, its validity requires further clarification. ThoughKdoes not have an explicit form in general, its first-order right derivative with respect to the lag variableτat the origin satisfies the following equation: Therefore, by integrating with respect toτ, we obtain which indicates that for each phaseθ, the correlation function behaves approximately as an exponential function in the lag variableτ. As a result, applyingEquation 8to eachjine-CS-LIM provides a reasonable approximation of the underlying deterministic dynamics as long as there are no abrupt phase-dependent variations in the dynamics of the sampling data{x(t)}used inEquation 15. This suggests thate-CS-LIM is a hybrid-type model: the dynamics are approximated, while the diffusion process follows an analytic formula. Consequently, it does not analytically reconstruct the periodic linear dynamics and diffusion of the linear stochastic process (Equation 3), as mentioned inSection 1. From a numerical aspect, the scheme of computing the derivative of observed covariancedCobsand the assignment of time coordinates forCjobs=Kjobs(0),Aje−CS, andQje−CSremain unspecified at this point. For instance, it is unclear whetherjth covarianceCjobscorresponds tojo’clock,j:30 or another reference time. In thee-CS-LIM framework, the time coordinatetjCforCjobsis assigned to the midpoint of thejth interval. In contrast, the time coordinatetjAforAje−CSis shifted by half the lag, i.e.,tjA=tjC+0.5τ, since the data at 0-lag andτ-lag are used to computeKjobsinEquation 15. In general, after sorting, the distance betweentjCandtjAand the distance betweentjAandtj+1Ccan differ. In this case, the computation ofQe−CSrequires careful treatment. To address this, for simplicity, we assumeτto be a multiple of1/Mwhenever discussing diffusion. This ensures that the time coordinatestC={tjC}andtA={tjA}(after appropriate rearrangement) either coincide or alternate at uniform intervals of distance1/2M. Then, we assign the time coordinatetjQforQje−CSastjQ=tjA, and we use the center difference scheme to computedCobswhentCandtAcoincide and the forward difference scheme when they alternate. Contrary to thee-CS-LIM, the original CS-LIM framework always adopts centered differencing to computedCobsand a commonjth time coordinatetjat the midpoint of thejth interval forCjobs,Ajo−CS, andQjo−CS. This stencil configuration, however, introduces an artificial phase shift in the estimated dynamics. A schematic illustration and the pseudocode for the original CS-LIM ande-CS-LIM are presented inFigure 2andAlgorithm 1, respectively. Figure 2. Schematic illustration for thee-CS-LIM and the original CS-LIM. The circles mark the sampling time of the observational data{x(t)}and phase coordinates for covarianceCobsand the dynamical matricesAo−CSfor the original CS-LIM andAe−CSfor thee-CS-LIM. The blue shaded areas represent the intervalsIjin the phase space, and the yellow block specifies the sampling used forx(t+τ)inEquation 15. To demonstrate the phase shift, we consider an ideal case in which the observational data{x(t)}are sampled using the following equation: wheref(t)=0.5⁡sin(2πt),g(t)=0.3⁡sin(2πt),Ā=−1, andQ̄=1, over an infinitely long window with a sampling intervalΔt=0.01. We apply the original CS-LIM ande-CS-LIM withM=100(i.e.,Kobs=Kon the sample points) andM=10. The results are shown inFigure 3. Figure 3. Phase shift analysis in the original CS-LIM. The upper two subplots show the covarianceCand its derivativeddtCofEquation 19. The remaining subplots show the dynamicsAand diffusionQ(gray) ofEquation 19, and the model results obtained using the original CS-LIM (blue) ande-CS-LIM (orange) forM∈{10,100}with different lagsτ∈{0.1,0.2,0.3}. The double-headed arrow in each subplot is the phase difference between the original CS-LIM result and the ground truth, computed by sine wave curve fitting. Regardless ofM, the dynamicsAo−CSfrom the original CS-LIM exhibit a notable phase shift of approximately0.5Δτ, which further compromises the accuracy ofQo−CS. In contrast,e-CS-LIM significantly mitigates the phase shift, even when{x(t)}is partitioned into 10 subsets. However, it is worth noting that for a largerτvalue, variations in the dynamics are smoothed out as a consequence of interval-wise Markov approximation andEquation 18. In addition, the Nyquist issue does not arise in the one-dimensional case. Algorithm 1.e-CS-LIM (and the original CS-LIM). Due to the interval-wise application of the ST-LIM, the CS-LIM is also subject to the Nyquist issue. Contrary to the ST-LIM, in which the Nyquist issue does not appear in the theoretical computation when the eigen-adjustment is applied (i.e.,G(adjusted) inFigure 1), the small-o term inEquation 18introduces a non-trivial residual inEquation 10, causing the Nyquist issue even if flawless infinite observation is possible. To demonstrate the Nyquist issue, we suppose that the data are sampled infinitely from the periodic linear system (Equation 19), wheref(t)=g(t)=0.5⁡sin(2πt),Āis given byEquation 11, andQ̄=−(Ā+ĀT). To examine the dependence on the partitioning of the phase space, we considerM∈{10,100}and apply thee-CS-LIM over different values ofτ. Figure 4shows the relative errors betweenAje−CSandA(tjA)for certain values ofjas a function ofτ. Since the dynamical matrix varies in time, the Nyquist issue does not necessarily appear at the multiples of the Nyquist lags of the mean stateĀ, but rather near them. In addition, even outside the Nyquist lags, the relative error remains non-zero, which again indicates that thee-CS-LIM is not an analytic inverse model forEquation 13. Nevertheless, the relative error is acceptable for application purposes, provided thatτis not overly large. Figure 4. Nyquist issue for thee-CS-LIM. The relative errors of the output dynamical matrices calculated usingEquations 9a,bas a function of the lag variable for distinctM. In each subplot, the upper left shows the phase coordinatetjAassigned toAje−CS. The orange circles specify the multiples of Nyquist lags of the mean dynamics. **3.2l-CS-LIM** As thee-CS-LIMinterval-wise approximatesthe underlying stochastic process using a Markov system and appliesEquation 8, we aim to build an (analytic) inverse model for the periodic Markov system (Equation 3). Instead of using the global information ofKas in the ST-LIM, thel-CS-LIM extracts the dynamics by applyingEquation 17, the local information ofK, followed by computing the diffusion matrix using CS-FDR. This suggests that given the observational data, thel-CS-LIM outputs the best-fit periodic Markov system for the unknown complex periodic system, provided that the sampling intervalΔt≪1and the observation windowL≫1. In practice, the observed correlation functionKobsis obtained using the following equation: and the partial derivatives of correlation function∂τKobsand∂θKobsare estimated by forward finite difference. The corresponding time coordinates for the estimated time-dependent dynamicsAl−CSand diffusionQl−CSare shifted to the right by0.5Δt. In other words,tA=tQ=tC+0.5Δt, wheretA,tQ, andtCdenote the general reference of the time coordinates forAl−CS,Ql−CS, andCobs, respectively, as previously stated. As a result, thel-CS-LIM formally determines a periodic linear system as follows: whose cyclostationary distributionPstl−CSis also Gaussian for eacht. The algorithm ofl-CS-LIM is summarized inAlgorithm 2. This derivative-based method avoids the multi-valued matrix logarithm and is, therefore, not affected by the Nyquist issue. However, it is more sensitive to noise, and phase averaging is applied toKobswhenever necessary. **3.3 Relationship among LIMs** All LIMs discussed in this article are related. First, we note that thel-CS-LIM is indeed an extension of the ST-LIM. If the linear dynamics and diffusion matrix are constant in time, the correlation function is independent of phase variableθ, andEquation 17can be written in the following form. Algorithm 2.l-CS-LIM. which is equivalent to the right derivative ofEquation 7. At the same time, for a general periodic stochastic process, we can viewl-CS-LIM as approximating the underlying system using a Markov system at each instant asEquations 17,22share the same form. Therefore, we may say thatl-CS-LIM utilizes the pointwise Markov approximation contrary to the interval-wise version adopted in thee-CS-LIM. A natural question is whether the ST-LIM accurately estimates the mean stateĀ=∫01A(t)dtfrom the infinite cyclostationary observational data sampled from the periodic Markov system (Equation 3). As the correlation function used in the ST-LIM is the integral ofK(τ,θ)overθ, it is clear that it does not equaleτĀC̄, whereC̄=∫01C(t)dtis the mean covariance. Nevertheless, ifAdoes not vary drastically, the estimated linear dynamics from ST-LIM remain close to the mean state, preserving the dynamics-relevant information of the underlying system. From a numerical viewpoint, at a given phaseθ, thel-CS-LIM applies the forward difference method to the observed correlation functionKobsat two consecutive pointsτ=0,Δt, which amounts to alinearfit of these two points. On the other hand, thee-CS-LIM calculatesKobsat the origin and the point atmΔtand appliesEquation 8, which corresponds to anexponentialcurve fitting whenever the Nyquist issue does not persist. This justifies the prefixese-CS-LIM andl-CS-LIM. As a result ofEquation 18, thee-CS-LIM converges to thel-CS-LIM under the conditions ofm=1,M=1Δt,Δt≪1, andL≫1. Consequently, thel-CS-LIM can be viewed as an instantaneous version of thee-CS-LIM. In practical applications, the difference between thel-CS-LIM ande-CS-LIM goes beyond the estimation of dynamics. Thel-CS-LIM, as a derivative-based method, pointwise estimates the Jacobian, which is the first-order approximation of the unknown dynamics. As the state variable moves away from the steady state or as time marches, the higher-order terms in the function’s expansion may become more significant, and the accuracy of linear approximation decreases, lowering the effectiveness of approximating the unknown system usingEquation 13. Nevertheless, the Jacobian can still be important in certain practical applications. Thee-CS-LIM, on the other hand, finds the best-fit linear system within each subinterval in the phase space. Though thee-CS-LIM is not an analytic inverse model for a general periodic OU process, it remains effective because for each phase, more sampling can be used inEquation 15than inEquation 20, and the lagτcan exceedΔt. As a result, thee-CS-LIM is more robust to noise thanl-CS-LIM. The intercomparison among LIMs is summarized inTable 1. Table 1. Intercomparison of linear inverse models. **4 Numerical experiments** As the CS-LIMs compute the dynamical and diffusion matrices using the observed correlation functionKobs, they can be regarded as functions that takeKobsas input and produce the estimated dynamics and diffusion. As an inverse method, the accuracy of these estimates depends on the quality ofKobs(Lien et al., 2024). IfKobscomputed from observations accurately captures the true correlation function, then both CS-LIMs are expected to effectively estimate both dynamics and diffusion. However, due to the finite number of observations,Kobsis inevitably affected by noise, raising concerns about the stability of the algorithms as numerical derivatives are required. Therefore, in this section, we evaluate the performance and sensitivity of bothe-CS-LIM andl-CS-LIM using the synthetic time-series data{x(t)}ofEquation 3under various conditions. For notational convenience, we writeACSandQCSas general references forAe−CSandAl−CSas well asQe−CSandQl−CS, respectively. More precisely, for the givenA(t)andQ(t), we use the Euler approach with a timestep ofdt=0.002fromT0=0toTf=Lto generate auxiliary time-series data; we then subsample it with a sampling step ofΔtto obtain the observational data{x(t)}, and we use CS-LIMs to obtain the estimatesACSandQCS. As the accuracy of models depends on the stochastic nature of the dataset, the abovementioned process will be repeated 128 times in each scenario, and the resulting statistics (e.g., median) of relative errors, defined similarly toEquation 12, will be used to evaluate the models. This evaluation process will be applied to each case presented in this section. **4.1 One-dimensional case** To visualize the CS-LIM results, we start with a one-dimensional case represented byEquation 19, wheref(t)=0.3π⁡sin(2πt)+0.1π⁡cos(4πt),g(t)=0.1π⁡sin(2πt),Ā=−1, andQ̄=1. For thee-CS-LIM, no filter is applied to the observed correlation functionKobs, while for thel-CS-LIM, a sliding average with a window of lengthwis applied toKobsandCobs. Figure 5ashows an example of thee-CS-LIM results forTf=1000,τ=0.1, andΔt=0.01under a distinct number of intervalsM∈{10,20,50,100}. Although a smallerMreduces the resolution of the reconstruction, it does not significantly affect the reconstructed dynamicsAe−CSas long as the variation can be effectively captured bytA. Moreover, a smallerMenhances robustness against noise, leading to a more stable estimate ofQe−CS. ForM=100, the stochastic influences in estimated dynamicsAe−CSremain limited since the lagτ=10Δt=0.1can be chosen to be larger thanΔt, thereby mitigating numerical instability associated with dividing noisy data by a small number. This is consistent with the theoretical case illustrated inFigure 3. However, in the computation ofQe−CS, the numerical differentiation of noisyCobsresults in unfavorable noise amplification inQe−CS. Although phase averaging ofCobscould mitigate this issue, we do not pursue this further fore-CS-LIM in our analysis. Figure 5. Examples of CS-LIMs applied to synthetic observational data withTf=1000,Δt=0.01, andτ=0.1.(a)Upper panels of each subfigure show true (gray) and numerical (color) covariance and its derivative used in the computation of e-CS-LIM for a distinct number of intervalsM∈{10,20,50,100}. The trueAandQ(gray) and the model outputsAe−CSandQe−CS(color) are shown in the lower panels.(b)This is analogous to(a)but shows thel-CS-LIM result under distinct sampling intervalΔtand window lengthw. Figure 5bshows an example of thel-CS-LIM results forTf=1000under different parameter settings: sampling intervalsΔt∈{0.01,0.02}and a window width of moving averagingw∈{1,10}. Without phase averaging(w=1), noisyKobscauses amplified noisy variations inAl−CS, especially for the small sampling intervalΔt=0.01, raising concerns over whetherAl−CScontains excessive stochastic influences. This issue can be effectively addressed by applying phase averaging toKobs; whenw=10, the estimatedAl−CSprovides a clean representation of the underlying dynamics. In contrast, the estimatedQl−CSforw=1appears more robust to the noisy numerical derivatives, though this may be attributed to the idealized nature of synthetic data and the choice of finite difference schemes. To further examine the sensitivity, we introduce artificial perturbations toKobsby adding a small noise matrixrand apply the resulting correlation function to lines 12 and 13 in Algorithm 2. The corresponding estimated diffusion then exhibits noisy variation, confirming the sensitivity ofQl−CSto noisyKobs. Nevertheless, applying phase averaging to the noisy correlation function again effectively removes the undesired noisy variations in the estimates. Finally, it is noted that the CS-FDR is maintained since the filtering is applied toKobsrather thanAl−CSorQl−CS. Next, we examine the sensitivity of CS-LIMs to various parameters.Figure 6ashows the results of thee-CS-LIM for a fixedM=10. As the observation timeTfincreases,Kobsmore accurately reflects the underlying system, and hence, the performance consistently improves. However, the accuracy decreases with increasingτdue to its smoothing effect onAe−CS, which is consistent with the analytic case shown inFigure 3. In addition, reducingΔtleads to a modest performance enhancement for thee-CS-LIM since more data points are used inEquation 15, but the improvement is limited. Figure 6. Performance ofe-CS-LIM.(a)Each subplot shows the errors with respect toτunder a fixed M=10 and different values ofΔtandTf.(b)Each panel shows the errors with respect toτunder a fixed Δt= 0.01 and different values ofMandTf. In addition, although the numbers of the observational data for cases(Δt,Tf)=(0.01,500)and(0.1,5000)are the same, their performance differs. This discrepancy arises because in the former case, all observational data corresponding to the subintervalIjcontribute to the computation ofKjobsandCjobs, which is equivalent to capturing the integrated effectneartjAandtjC. In contrast,KjobsandCjobsin the latter are directlyattjAandtjCsinceM=1/Δt. Figure 6bshows the results for a fixedΔt=0.01with varyingM∈{10,20,50,100}. As previously discussed, the noisy variations inAe−CSassociated with largerMare limited due to a suitableτ. However, theQe−CSremains more sensitive to the noisy numerical derivative of covariance, implying the need for phase averaging. As a result, to optimize the performance of thee-CS-LIM, a balance must be struck:Mshould be kept as small as possible to minimize noise amplification inQe−CS, whileτ, optimally chosen as1/M, should remain small enough to prevent excessive smoothing or insufficient resolution that could obscure meaningful variations inAe−CSandQe−CS. Moreover, we analyze the impact of sampling interval and filtering on thel-CS-LIM, as shown inFigure 7. First, we see that if no filter is applied, a largerΔtin the calculation of the numerical derivative, though less accurate in the finite difference approximation, is less sensitive to noise, leading to a lower relative error in the noise-dominant cases. Then, we observe that applying phase averaging toKobseffectively reduces the noisy variations inAl−CS, stabilizing the dynamics estimation, particularly at smallTfor smallΔt, with a clear decrease as window sizewincreases. However, in cases with limited noisy variations, particularly at largeTfand largerΔt, excessive filtering can lead to additional error by overly dampening meaningful fluctuations, which is noticeable in the case ofTf=5000andΔt=0.02. Thus, optimal phase averaging requires balancing noise reduction and the preservation of essential variations to prevent over-smoothing, particularly when the noise level is low. Figure 7. Relative errors of thel-CS-LIM. Each panel shows the errors with respect to the window sizewfor filtering under different values ofΔtandTf. **4.2 Higher-dimensional cases** From the previous section, we observed that the lag variableτand the number of divisionMof the phase space play critical roles in thee-CS-LIM performance, and filtering with the optimal window sizeweffectively removes the noisy component and retains the meaningful fluctuation in thel-CS-LIM. In this section, we extend the analysis to multi-dimensional cases, settingτ=0.1andM=10for thee-CS-LIM andw=10for thel-CS-LIM with a sampling intervalΔt=0.01. The underlying equation is still represented byEquation 19, withf(t)andg(t)being the same as in the previous section. Each entry ofĀandQ̄is initially drawn from the standard normal distribution and then adjusted so thatĀis a damping operator andQ̄is positive definite. The Nyquist lag in this setup is significantly larger thanτ=0.1, eliminating concerns about the Nyquist issue. The performance of CS-LIMs across dimensionnfrom 1 to 10 is summarized inFigure 8. In general, if the observation timespanTfis sufficiently long so thatKobswell-estimates the underlying true correlation functionK, both CS-LIMs can effectively capture dynamics and diffusion. Otherwise, the estimation can fail drastically, especially forQCSin higher-dimensional cases, since it is the sum of multiple noisy time series. It should be noted that this study does not aim to compare the two CS-LIM variants directly because the accuracy of CS-LIMs is influenced by numerous factors. For example, thee-CS-LIM may struggle to capture fine variations or locate peaks due to its relatively sparse resolution on the phase space, while thel-CS-LIM depends on the choice of filtering, and the optimal support or window size of filtering may vary by applications. Figure 8. Box plots of the relative errors between CS-LIM outputs and the ground truth. Each subplot shows the distribution of relative errors across different dimensionsnand observation time spansTf. The box plots show the maximum, minimum, median, and quantiles of the relative errors, with outliers removed. The left half of each subplot corresponds to the relative errors in dynamics while the right half is in diffusion. Finally, we revisit the Nyquist issue. We keep the underlying system the same (i.e.,fandgremains unchanged) but withĀgiven byEquation 11andQ̄=−(Ā+ĀT).Figure 9shows the relative errors in the dynamics for an observation timeTf=1000, with parametersM=10andτ=0.1for thee-CS-LIM andw=10whenΔt=0.01andw=50whenΔt=0.002for thel-CS-LIM. The window sizewis chosen such that the sliding average filter has a support of 0.1, which is equal to the lagτin thede-CS-LIM. At a timestep ofΔt=0.01,e-CS-LIM performance appears stable and reliable, but closer examination reveals that extreme spikes in the estimated dynamics occur randomly but frequently. Unlike the case of the stationary LIM, this error is relatively limited, as only certain points are affected by the Nyquist issue, while others remain accurate. Thel-CS-LIM result, in contrast, exhibits a narrower error range but overall higher relative errors. WhenΔtis reduced to 0.002, the sensitivity of thee-CS-LIM to the Nyquist issue increases, with relative errors now ranging from 8% to 81%, even exceeding the error range inFigure 8forTf=1000andn=4, whereĀandQ̄are randomly generated. Meanwhile, thel-CS-LIM exhibits a stable and narrow error range with significant improvement, implying that the large relative error for thel-CS-LIM withΔt=0.01mainly arises from the finite difference scheme used in the computation. Figure 9. Impact of the Nyquist issue on the numerical computation. Each subplot shows the statistics of the relative errors for dynamics under two different sampling intervalsΔt. The synthetic sampling datasets are generated withTf=1000. Thee-CS-LIM estimates dynamics usingM=10andτ=0.1, while thel-CS-LIM computes dynamics withw=10forΔt=0.01andw=50forΔt=0.002. Outliers have been removed. **5 Real-world example: the ENSO recharge oscillator** The El Niño-Southern Oscillation is a dominant interannual climate mode driven by interactions between the ocean and the atmosphere over the tropical Pacific Ocean (Di Lorenzo et al., 2015). The ENSO oscillates between two primary phases, namely, El Niño and La Niña, characterized by unusual warming and cooling of SSTs in the central and eastern Pacific, respectively (Capotondi et al., 2015;Okumura et al., 2011). The Niño 3.4 SST index, defined as the anomaly of the average SST over the region 5S–5N and 170W–120W, serves as a widely used indicator to monitor and predict El Niño and La Niña events (Capotondi et al., 2015;Okumura, 2019). In climate modeling, the variability in oceanic variables can be viewed as the superposition of atmospheric variability and subsurface processes, modeled by external stochastic forcing and deterministic dynamics, respectively (Deser et al., 2010;Lou et al., 2020). Consequently, ENSO can be viewed as a periodically driven stochastic process. Previous studies have emphasized the seasonal variations in the ENSO (Cane et al., 1986;Chen and Jin, 2021;Chen and Jin, 2022;Levine and McPhaden 2015;Shin et al., 2021;Webster and Yang 1992), but only a few have quantified the relative roles of the seasonal variations in the predictable SST dynamics and unpredictable stochastic forcing (Shin et al., 2021). In this study, we revisit one of the simplest low-dimensional linear models of the ENSO, which represents the system using the anomalies of area-averaged SSTs and the depth of the 20°C isotherm (D20) over the equatorial Pacific (Burgers et al., 2005;Jin et al., 2007). Under the stationary assumption, previous research has interpreted the ENSO mechanism as a recharge oscillator, where the SST anomaly and D20 anomaly play the roles of momentum and position, respectively (Burgers et al., 2005). For our analysis, we obtained monthly SST and D20 data from ORAS5 reanalysis for the period 1979–2021 (Zuo et al., 2019). These data were then averaged over 5S–5N and 170W–120W for SSTs and 5S–5N and 120E–80W for D20. Given that the data may exhibit quasi-stationary behavior due to low-frequency signals such as Pacific decadal variability, we applied a linear detrending procedure as a preprocessing step (Kuo et al., 2023). To study the seasonal dependence of the ENSO, we utilized thel-CS-LIM ande-CS-LIM, applying them to the z-scores of the preprocessed averaged SST and D20 anomalies. To reduce sampling uncertainties, we also applied a three-month sliding average toKobsfor both CS-LIMs rather than directly smoothing the input data. This approach follows the methodology proposed byShin et al. (2021). The input data and their distributions are shown inFigure 10. Figure 10. Observed SST and D20 anomalies in the z-score. The left panels show the time-series of SSTs and D20 from 1979 to 2021, and the right panels show the corresponding probability density functions using histograms. Using the CS-LIMs, we obtain the time-dependent dynamicsACSand diffusion matricesQCS. As they are defined at discrete points, we apply linear interpolation entry-wise to construct the approximate systems, as described inEquations 16,21. The covariance matrices reconstructed by the CS-LIM are calculated from the synthetic data generated from the approximate systems over 5,500 years and are used to estimate the cyclostationary distributionsPstl−CSandPste−CS(collectively referred to asPstCS). To comparePstCSwith observations, we apply the bivariate Gaussian kernel density estimator to calculate the observed joint probability density function (PDF)Pstobsfor each calendar month.Figures 11,12show the cyclostationary distributionsPstCS, the vector fields associated with the dynamicsACS, and eigenvectors ofQCSscaled by the square root of the corresponding eigenvalues to represent the approximate periodic Markov systems. Figure 11.l-CS-LIM result on the normalized coordinate. Thex-andy-axes represent the z-scores of SST and D20 anomalies, respectively. The cyclostationary distributionPstl−CSis represented by the black contour lines, with the black arrows indicating the eigenvectors of the covariance matrix scaled by the square root of the corresponding eigenvalues. The quiver plot shows the vector fields of the estimated first-order dynamics, while the thick orange arrows are the eigenvectors of the diffusion matrix scaled by the square root of the corresponding eigenvalues. The filled contours show the difference between the theoreticalPstl−CSand the observedPstobs, with colors ranging from−0.10to 0.10. Figure 12.e-CS-LIM result on the normalized coordinate plane. This figure is analogous toFigure 11, but the results are based on thee-CS-LIM. SeeFigure 11for a detailed description of the elements displayed. The results reveal that the estimated dynamics exhibit a clockwise spiral sink for most calendar months, contributing to a rotational pattern in the cyclostationary distribution, except in late August and September. In addition, the principal direction of the diffusion matrices consistently remains in the first quadrant throughout the year, indicating that atmospheric stochastic forcing mainly acts to warm or cool both the surface and sublayer at the same time. The discrepancyΔP:=Pstobs−PstCS, shown by the filled contours inFigures 11,12, predominantly appears negative on the upper plane but positive on the lower plane throughout the year. This tendency can be mainly attributed to the negative skewness in the z-score of the D20 anomaly shown inFigure 10as the approximate systems yield a time-dependent Gaussian distributionPstCS. Figure 13shows the seasonal variation in the eigenvalues ofACSandQCS. The results for the deterministic dynamics from both CS-LIMs are consistent, showing a notable seasonal dependence; although the dynamics overall act as a damping force, they become temporarily unstable in boreal fall. The imaginary part is especially prominent in boreal late spring and summer, contributing to a phase transition in the SST–D20 correlation that shifts from negative to positive. However, in boreal autumn, the dynamics slow down significantly, and two real eigenvalues even appear in October, indicating a non-rotating regime. The Floquet exponents (i.e., the principal logarithms of the Floquet multipliers) of the approximate system determined by thel-CS-LIM ande-CS-LIM reveal decay rates of 2.01 and 2.41 years with periods of 4.05 and 3.83 years, respectively. These are slightly different from, but consistent with, the ST-LIM result with a decay rate of 2.00 years and a period of 3.08 years (Burgers et al., 2005). Figure 13. CS-LIM results for the ENSO study.(A, B)The unfiltered observed SST covariance (black), the median (solid), and the 90% confidence levels (shaded area) in the z-score determined by the CS-LIM ensembles.(C)Real (circle) and imaginary (star) parts of the seasonal-dependent eigenvalues ofACS.(D)Two positive seasonal-dependent eigenvalues ofQCS. Thex-ticks represent the 15th of each calendar month. Notably, in(C, D), the markers andx-ticks alternate. The diffusion terms reveal distinct seasonal patterns between the two methods. Thee-CS-LIM shows a minimal seasonal variation in diffusion, whereas thel-CS-LIM suggests that the random forcing intensifies in two main periods, namely, April to June and October to November. These contrasting seasonal patterns in diffusion may lead to different interpretations of the ENSO mechanism. Thel-CS-LIM result suggests a recurring annual cycle in both oceanic deterministic dynamics and atmospheric stochastic forcing. In March and April, while the background oceanic system pulls the SST and D20 back to equilibrium, the unpredictable atmospheric system intends to determine the ENSO phase (either positive, negative, or neutral) of the upcoming year. Once the phase is established in boreal summer, the oceanic system then acts as a driving force to build up the SST anomaly from August to late October. As the atmospheric forcing intensifies in the following months, the SST anomaly can reach extreme levels—either high or low—from November to January, potentially causing the El Niño and La Niña events. As the cycle progresses, weaker atmospheric excitation and stronger oceanic damping from February and April work help store the SST anomaly, gradually returning the system to its equilibrium state. It is also noteworthy that the time-dependent stochastic forcing also affects the transition of the SST–D20 correlation. Compared with the case whereQl−CSis replaced by the time-independentQl−CS̄, the seasonality further speeds up the rotation inPstl−CSfrom April to June since the principal direction of the covariance matrix rotates toward that of the diffusion matrix, whose intensity reaches the maximum over these months. Though the dynamics play a major role in the transition, the seasonal feature of diffusion is not negligible. Overall, this recurring annual pattern demonstrates how random forcing drives the system away from its mean state, contributing to the inter-annual variability observed in the ENSO. The combination of lower SST anomalies in March and April, along with stronger atmospheric forcing, makes it challenging to predict whether SST anomalies will increase or decrease in the subsequent months, which is a factor potentially linked to the well-known ENSO prediction barrier (Cane et al., 1986;Levine and McPhaden, 2015;Webster and Yang, 1992). Moreover, the unstable deterministic dynamics and enhanced random forcing in boreal autumn may help explain the increased SST variability in boreal winter, contributing to the observed ENSO phase locking (Chen and Jin, 2021;Chen and Jin, 2022). In contrast, the nearly constant random forcing in thee-CS-LIM results may imply that the seasonal variability of the SST anomaly is mainly driven by the seasonal variation in deterministic oceanic dynamics rather than that in the atmospheric excitation force. Compared with thel-CS-LIM, we can say that the seasonal feature ofQe−CS(if any) is transferred to that ofAe−CSbecause the CS-FDR holds in both the methods. For each model, we generate a 128-member ensemble of 43 years for SST and D20 anomalies by numerically integrating the system (Equation 13) determined by CS-LIMs with a timestep ofdt=0.001years. The 90% confidence interval levels of the SST covariance derived from the ensembles are shown inFigure 13. Thel-CS-LIM result shows wider confidence intervals than thee-CS-LIM results from April to June and October to November due to stronger random forcing during these periods. Despite different interpretations of the seasonality of stochastic forcing, both models capture the seasonal variation in observed SST covariance (without smoothing). Moreover, the reconstructed monthly SST–D20 cross-covariances, D20–D20 auto-covariances, and annual correlation functions, shown inSupplementary Material, are consistent with observations, demonstrating their effectiveness in capturing the dominant modes of a non-linear system. Although this is a simplified model for ENSO studies, we emphasize that CS-LIMs can be applied to higher-dimensional climate variables, offering spatial–temporal coherence in complex systems (Kido et al., 2023;Shin et al., 2021). **6 Conclusion** In this article, we examine the mathematical background of CS-LIMs, a class of data-driven methods that construct periodic OU processes from finite cyclostationary data and present thee-CS-LIM andl-CS-LIM. Thee-CS-LIM is developed based on interval-wise approximation, dividing the phase space into intervals where data exhibit similar cyclostationary dependencies. This approach enables the ST-LIM to estimate the linear dynamics by capturing the integrated effect over each interval, making it effective for most applications. In addition, the improved stencil design in thee-CS-LIM eliminates the phase shift observed in the original CS-LIM. However, despite these improvements, it remains vulnerable to the Nyquist issue, which also affects the ST-LIM. In contrast, thel-CS-LIM serves as an analytic inverse model to the periodic OU process and estimates the time-dependent Jacobian of a complex system in general. As a derivative-based method, it inherently avoids the Nyquist issue, offering an alternative for studying periodic systems. Numerical experiments on synthetic data show that both CS-LIM variants effectively capture the temporal structure of the underlying periodic systems. With an optimally chosen interval division, thee-CS-LIM uses a relatively sufficient amount of data to estimate the dynamics and preserves meaningful variations without amplifying noise or excessive smoothing. On the other hand, although thel-CS-LIM is sensitive to noise, its performance significantly improves when optimal phase averaging is applied to the observed correlation function. In cases where the Nyquist lag of the mean dynamics is close to the optimal range ofτ, thee-CS-LIM estimation may fail at certain intervals, leading to significant and abrupt derivations from the underlying system. In contrast, thel-CS-LIM remains robust, provided that the sampling interval is sufficiently small to ensure accurate finite difference calculations. We have applied the CS-LIMs to the real-world Niño SST 3.4 index and the area-averaged depth of20°C isotherm, two oceanic variables commonly used to study the ENSO. Our findings show that in the boreal spring, the strong damping dynamics and stochastic forcing associated with the ENSO make deterministic forecasting challenging, which is related to the ENSO prediction barrier. In autumn, the unstable dynamics amplify the SST anomaly established in summer, increasing the SST variability and covariance in winter and potentially contributing to ENSO phase locking. Moreover, the estimated decay rates and periods obtained by both methods align with the current understanding of the ENSO, and the reproduced SST covariance captures observed seasonal dependency. This ENSO study demonstrates the capabilities of CS-LIMs and highlights their potential to provide a deeper insight into complex climate systems. In addition to time-series analysis, CS-LIMs can also serve as predictive tools for periodic systems (Shin et al., 2021;Vimont et al., 2022). While the ST-LIM has been used for forecasting, particularly in climate science, recent studies have recognized the importance of accounting for seasonality in predictive models (Alexander et al., 2008;Vimont et al., 2022;Zhao et al., 2024). A valuable direction for future research would be a comparative study evaluating how different assumptions in LIMs affect model prediction skills and how they perform relative to AI-based forecasting methods and full dynamical models. Such a comparison would provide key insights into the strengths and limitations of CS-LIMs and help identify the fundamental elements of model predictability. Moreover, the CS-LIM framework has broad applicability beyond analysis and prediction. Dynamical mode decomposition, the deterministic counterpart of the ST-LIM, has been widely applied to study chaotic and quasi-cyclostationary systems, integrated with wavelet decomposition, and applied to enhance machine learning techniques (Donge et al., 2023;Hou et al., 2025;Krishnan et al., 2023;Kutz et al., 2016;Naderi et al., 2019;Tu et al., 2014). By building on these ideas, CS-LIMs, as periodic extensions of the ST-LIM, have the potential to improve these applications by explicitly incorporating periodic features into system dynamics. We believe that bothe-CS-LIM andl-CS-LIM will offer new perspectives and advancements in climate sciences and other fields of study. **Data availability statement** The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. **Author contributions** JL: conceptualization, formal analysis, methodology, software, and writing–original draft. Y-NK: conceptualization and writing–review and editing. HA: funding acquisition, supervision, and writing–review and editing. SK: investigation and writing–review and editing. **Funding** The author(s) declare that financial support was received for the research and/or publication of this article. This work was supported by the (1) Council for Science, Technology, and Innovation (CSTI), the Cross-ministerial Strategic Innovation Promotion Program (SIP), and the 3rd period of SIP “Smart energy management system” grant number JPJ012207 (funding agency: JST) and (2) Grant-in-Aid for Scientific Research (B), 23K25946. **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Generative AI statement** The author(s) declare that Generative AI was used in the creation of this manuscript. During the preparation of this manuscript, the authors used ChatGPT-4o in order to improve readability. After using this tool, the authors reviewed and edited the content as needed and took full responsibility for the content of the publication. **Publisher’s note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **Supplementary Material** The Supplementary Material for this article can be found online at:https://www.frontiersin.org/articles/10.3389/fcpxs.2025.1563687/full#supplementary-material **References** Alexander, M. A., Matrosova, L., Penland, C., Scott, J. D., and Chang, P. (2008). Forecasting pacific SSTs: linear inverse model predictions of the PDO.J. Clim.21, 385–402. doi:10.1175/2007JCLI1849.1 CrossRef Full Text|Google Scholar Burgers, G., Jin, F.-F., and van Oldenborgh, G. J. (2005). The simplest ENSO recharge oscillator.Geophys. Res. Lett.32. doi:10.1029/2005GL022951 CrossRef Full Text|Google Scholar Cane, M. A., Zebiak, S. E., and Dolan, S. C. (1986). Experimental forecasts of El Niño.Nature321, 827–832. doi:10.1038/321827a0 CrossRef Full Text|Google Scholar Capotondi, A., Wittenberg, A. T., Newman, M., Di Lorenzo, E., Yu, J.-Y., Braconnot, P., et al. (2015). Understanding ENSO diversity.Bull. Am. Meteorological Soc.96, 921–938. doi:10.1175/bams-d-13-00117.1 CrossRef Full Text|Google Scholar Chen, H.-C., and Jin, F.-F. (2021). Simulations of ENSO phase-locking in CMIP5 and CMIP6.J. Clim.34, 5135–5149. doi:10.1175/JCLI-D-20-0874.1 CrossRef Full Text|Google Scholar Chen, H.-C., and Jin, F.-F. (2022). Dynamics of ENSO phase-locking and its biases in climate models.Geophys. Res. Lett.49, e2021GL097603. doi:10.1029/2021GL097603 CrossRef Full Text|Google Scholar Chicone, C. (2006). “Ordinary differential equations with applications,” inTexts in applied mathematics. New York:Springer. Google Scholar Culver, W. J. (1966). On the existence and uniqueness of the real logarithm of a matrix.Proc. Am. Math. Soc.17, 1146–1151. doi:10.1090/s0002-9939-1966-0202740-6 CrossRef Full Text|Google Scholar Deser, C., Alexander, M. A., Xie, S.-P., and Phillips, A. S. (2010). Sea surface temperature variability: patterns and mechanisms.Annu. Rev. Mar. Sci.2, 115–143. doi:10.1146/annurev-marine-120408-151453 PubMed Abstract|CrossRef Full Text|Google Scholar Di Lorenzo, E., Liguori, G., Schneider, N., Furtado, J. C., Anderson, B. T., and Alexander, M. A. (2015). ENSO and meridional modes: a null hypothesis for pacific climate variability.Geophys. Res. Lett.42, 9440–9448. doi:10.1002/2015GL066281 CrossRef Full Text|Google Scholar Donge, V. S., Lian, B., Lewis, F. L., and Davoudi, A. (2023). Accelerated reinforcement learning via dynamic mode decomposition.IEEE Trans. Control Netw. Syst.10, 2022–2034. doi:10.1109/TCNS.2023.3259060 CrossRef Full Text|Google Scholar Hamlington, B. D., Leben, R. R., Nerem, R. S., Han, W., and Kim, K.-Y. (2011). Reconstructing sea level using cyclostationary empirical orthogonal functions.J. Geophys. Res.116, C12015. doi:10.102910.1029/2011jc0075292011JC007529 CrossRef Full Text|Google Scholar Hou, Y., Chen, J., Ma, D., and Chan, P. W. (2025).Steady-state linear response matrix of the lorenz-63 system.Authorea Preprints. Google Scholar H Tu, J., W Rowley, C., M Luchtenburg, D., L Brunton, S., and Nathan Kutz, J. (2014). On dynamic mode decomposition: theory and applications.J. Comput. Dyn.1, 391–421. doi:10.3934/jcd.2014.1.391 CrossRef Full Text|Google Scholar Jacka, S. D., and Oksendal, B. (1987). Stochastic differential equations: an introduction with applications.J. Am. Stat. Assoc.82, 948. doi:10.2307/2288814 CrossRef Full Text|Google Scholar Jin, F.-F., Lin, L., Timmermann, A., and Zhao, J. (2007). Ensemble-mean dynamics of the ENSO recharge oscillator under state-dependent stochastic forcing.Geophys. Res. Lett.34. doi:10.1029/2006GL027372 CrossRef Full Text|Google Scholar Johnson, S. D., Battisti, D. S., and Sarachik, E. S. (2000a). Empirically derived markov models and prediction of tropical pacific sea surface temperature anomalies.J. Clim.13, 3–17. doi:10.1175/1520-0442(2000)013<0003:edmmap>2.0.co;2 CrossRef Full Text|Google Scholar Johnson, S. D., Battisti, D. S., and Sarachik, E. S. (2000b). Seasonality in an empirically derived markov model of tropical pacific sea surface temperature anomalies.J. Clim.13, 3327–3335. doi:10.1175/1520-0442(2000)013<3327:siaedm>2.0.co;2 CrossRef Full Text|Google Scholar Kido, S., Richter, I., Tozuka, T., and Chang, P. (2023). Understanding the interplay between ENSO and related tropical SST variability using linear inverse models.Clim. Dyn.61, 1029–1048. doi:10.1007/s00382-022-06484-x CrossRef Full Text|Google Scholar Kim, K.-Y. (2002). Investigation of ENSO variability using cyclostationary EOFs of observational data.Meteorology Atmos. Phys.81, 149–168. doi:10.1007/s00703-002-0549-7 CrossRef Full Text|Google Scholar Kim, K.-Y., Hamlington, B., and Na, H. (2015). Theoretical foundation of cyclostationary EOF analysis for geophysical and climatic variables: concepts and examples.Earth-Science Rev.150, 201–218. doi:10.1016/j.earscirev.2015.06.003 CrossRef Full Text|Google Scholar Krishnan, M., Gugercin, S., and Tarazaga, P. A. (2023). A wavelet-based dynamic mode decomposition for modeling mechanical systems from partial observations.Mech. Syst. Signal Process.187, 109919. doi:10.1016/j.ymssp.2022.109919 CrossRef Full Text|Google Scholar Kuo, Y.-N., Kim, H., and Lehner, F. (2023). Anthropogenic aerosols contribute to the recent decline in precipitation over the u.s. southwest.Geophys. Res. Lett.50, e2023GL105389. doi:10.1029/2023gl105389 CrossRef Full Text|Google Scholar Kutz, J. N., Brunton, S. L., Brunton, B. W., and Proctor, J. L. (2016).Dynamic mode decomposition. Philadelphia, PA:Society for Industrial and Applied Mathematics. Google Scholar Kwasniok, F. (2022). Linear inverse modeling of large-scale atmospheric flow using optimal mode decomposition.J. Atmos. Sci.79, 2181–2204. doi:10.1175/JAS-D-21-0193.1 CrossRef Full Text|Google Scholar Levine, A. F. Z., and McPhaden, M. J. (2015). The annual cycle in ENSO growth rate as a cause of the spring predictability barrier.Geophys. Res. Lett.42, 5034–5041. doi:10.1002/2015GL064309 CrossRef Full Text|Google Scholar Lien, J., Kuo, Y.-N., Ando, H., and Kido, S. (2025). Colored linear inverse model: A data-driven method for studying dynamical systems with temporally correlated stochasticity.Physical Review Research. Google Scholar Lou, J., Holbrook, N. J., and Oâ€™Kane, T. J. (2020). A linear inverse model of tropical and south pacific seasonal predictability Url: Available online at:https://presentations.copernicus.org/EGU2020/EGU2020-2235_presentation.pdf. Google Scholar Naderi, M. H., Eivazi, H., and Esfahanian, V. (2019). New method for dynamic mode decomposition of flows over moving structures based on machine learning (hybrid dynamic mode decomposition).Phys. Fluids31, 127102. doi:10.1063/1.5128341 CrossRef Full Text|Google Scholar Newman, M., Alexander, M. A., and Scott, J. D. (2011a). An empirical model of tropical ocean dynamics.Clim. Dyn.37, 1823–1841. doi:10.1007/s00382-011-1034-0 CrossRef Full Text|Google Scholar Newman, M., Shin, S.-I., and Alexander, M. A. (2011b). Natural variation in ENSO flavors.Geophys. Res. Lett.38. doi:10.1029/2011GL047658 CrossRef Full Text|Google Scholar Okumura, Y. M. (2019). ENSO diversity from an atmospheric perspective.Curr. Clim. Change Rep.5, 245–257. doi:10.1007/s40641-019-00138-7 CrossRef Full Text|Google Scholar Okumura, Y. M., Ohba, M., Deser, C., and Ueda, H. (2011). A proposed mechanism for the asymmetric duration of El Niño and La Niña.J. Clim.24, 3822–3829. doi:10.1175/2011JCLI3999.1 CrossRef Full Text|Google Scholar OrtizBeviá, M. J. (1997). Estimation of the cyclostationary dependence in geophysical data fields.J. Geophys. Res. Atmos.102, 13473–13486. doi:10.1029/97JD00243 CrossRef Full Text|Google Scholar Penland, C. (1989). Random forcing and forecasting using principal oscillation pattern analysis.Mon. Weather Rev.117, 2165–2185. doi:10.1175/1520-0493(1989)117<2165:rfafup>2.0.co;2 CrossRef Full Text|Google Scholar Penland, C. (1996). A stochastic model of IndoPacific sea surface temperature anomalies.Phys. D. Nonlinear Phenom.98, 534–558. doi:10.1016/0167-2789(96)00124-8 CrossRef Full Text|Google Scholar Penland, C. (2019). The Nyquist issue in linear inverse modeling.Mon. Weather Rev.147, 1341–1349. doi:10.1175/.MWR-D-18-0104.1 CrossRef Full Text|Google Scholar Penland, C., and Magorian, T. (1993). Prediction of Niño 3 sea surface temperatures using linear inverse modeling.J. Clim.6, 1067–1076. doi:10.1175/1520-0442(1993)006<1067:ponsst>2.0.co;2 CrossRef Full Text|Google Scholar Penland, C., and Matrosova, L. (1994). A balance condition for stochastic numerical models with application to the El niño-southern oscillation.J. Clim.7, 1352–1372. doi:10.1175/1520-0442(1994)007<1352:abcfsn>2.0.co;2 CrossRef Full Text|Google Scholar Penland, C., and Matrosova, L. (2006). Studies of El Niño and interdecadal variability in tropical sea surface temperatures using a nonnormal filter.J. Clim.19, 5796–5815. doi:10.1175/JCLI3951.1 CrossRef Full Text|Google Scholar Penland, C., and Sardeshmukh, P. D. (1995). The optimal growth of tropical sea surface temperature anomalies.J. Clim.8, 1999–2024. doi:10.1175/1520-0442(1995)008<1999:togots>2.0.co;2 CrossRef Full Text|Google Scholar Perkins, W. A., and Hakim, G. (2020). Linear inverse modeling for coupled atmosphere-ocean ensemble climate prediction.J. Adv. Model. Earth Syst.12, e2019MS001778. doi:10.1029/2019MS001778 CrossRef Full Text|Google Scholar Risken, H. (1989). “The Fokker-Planck equation,” inMethods of solution and applications, vol. 18 (Springer-Verlag,Berlin). Google Scholar Rüschendorf, L. (2023). “Stochastic processes and financial mathematics,” inMathematics study resources.Springer Berlin Heidelberg. Google Scholar Särkkä, S., and Solin, A. (2019). “Applied stochastic differential equations,” inInstitute of mathematical statistics textbooks.Cambridge University Press. Google Scholar Seifert, U. (2012). Stochastic thermodynamics, fluctuation theorems and molecular machines.Rep. Prog. Phys.75, 126001. doi:10.1088/0034-4885/75/12/126001 PubMed Abstract|CrossRef Full Text|Google Scholar Shin, S.-I., Sardeshmukh, P. D., Newman, M., Penland, C., and Alexander, M. A. (2021). Impact of annual cycle on ENSO variability and predictability.J. Clim.34, 171–193. doi:10.1175/JCLI-D-20-0291.1 CrossRef Full Text|Google Scholar Stuecker, M. F. (2023). The climate variability trio: stochastic fluctuations, El Niño, and the seasonal cycle.Geosci. Lett.10, 51. doi:10.1186/s40562-023-00305-7 CrossRef Full Text|Google Scholar Stuecker, M. F., Jin, F.-F., Timmermann, A., and McGregor, S. (2015). Combination mode dynamics of the anomalous northwest pacific anticyclone.J. Clim.28, 1093–1111. doi:10.1175/JCLI-D-14-00225.1 CrossRef Full Text|Google Scholar Stuecker, M. F., Timmermann, A., Jin, F.-F., McGregor, S., and Ren, H.-L. (2013). A combination mode of the annual cycle and the El Niño/Southern Oscillation.Nat. Geosci.6, 540–544. doi:10.1038/ngeo1826 CrossRef Full Text|Google Scholar Vimont, D. J., Newman, M., Battisti, D. S., and Shin, S.-I. (2022). The role of seasonality and the ENSO mode in central and east pacific ENSO growth and evolution.J. Clim.35, 3195–3209. doi:10.1175/JCLI-D-21-0599.1 CrossRef Full Text|Google Scholar Webster, P. J., and Yang, S. (1992). Monsoon and ENSO: selectively interactive systems.Q. J. R. Meteorological Soc.118, 877–926. doi:10.1002/qj.49711850705 CrossRef Full Text|Google Scholar Xue, Y., Leetmaa, A., and Ji, M. (2000). ENSO prediction with markov models: the impact of sea level.J. Clim.13, 849–871. doi:10.1175/1520-0442(2000)013<0849:epwmmt>2.0.co;2 CrossRef Full Text|Google Scholar Zhao, S., Jin, F.-F., Stuecker, M. F., Thompson, P. R., Kug, J.-S., McPhaden, M. J., et al. (2024). Explainable El Niño predictability from climate mode interactions.Nature630, 891–898. doi:10.1038/s41586-024-07534-6 PubMed Abstract|CrossRef Full Text|Google Scholar Zuo, H., Balmaseda, M. A., Tietsche, S., Mogensen, K., and Mayer, M. (2019). The ECMWF operational ensemble reanalysis–analysis system for ocean and sea ice: a description of the system and assessment.Ocean Sci.15, 779–808. doi:10.5194/os-15-779-2019 CrossRef Full Text|Google Scholar Keywords:data-driven, linear inverse model, stochastic processes, inverse problem, cyclostationarity Citation:Lien J, Kuo Y-N, Ando H and Kido S (2025) On cyclostationary linear inverse models: a mathematical insight and implication.Front. Complex Syst.3:1563687. doi: 10.3389/fcpxs.2025.1563687 Received:20 January 2025;Accepted:04 March 2025;Published:22 April 2025. Edited by: Reviewed by: Copyright© 2025 Lien, Kuo, Ando and Kido. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY).The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Justin Lien,bGllbi5qdXN0aW4udDhAZGMudG9ob2t1LmFjLmpw Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract 1 Introduction 2 Review of the ST-LIM 3 CS-LIM 4 Numerical experiments 5 Real-world example: the ENSO recharge oscillator 6 Conclusion Data availability statement Author contributions Funding Conflict of interest Generative AI statement Publisher’s note Supplementary Material References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}