{"id": 1751, "name": "Les Moutons Rebelles", "domain": "lesmoutonsrebelles.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "very-low", "questionable": null, "url": "https://lesmoutonsrebelles.com/trump-critique-zelensky-pour-avoir-demande-plus-darmes-americaines-pour-repousser-la-russie-on-ne-commence-pas-une-guerre-avec-un-pays-plus-grand/", "title": "Trump Critique Zelensky Pour Avoir Demande Plus Darmes Americaines Pour Repousser La Russie On Ne Commence Pas Une Guerre Avec Un Pays Plus Grand", "content": "France Santé Science & Tech Société Economie Contact France Santé Science & Tech Société Economie Contact **Trump critique Zelensky pour avoir demandé plus d’armes américaines pour repousser la Russie : « On ne commence pas une guerre » avec un pays plus grand.** Le président Donald Trump a critiqué le président ukrainien Volodymyr Zelensky lors d’une réunion dans le Bureau ovale lundi, l’accusant d’avoir provoqué un conflit avec la Russie. Trump a également déclaré aux journalistes que l’Ukraine portait une part de responsabilité dans la guerre qui a ravagé une grande partie de son territoire depuis 2022 – et causé la mort de nombreux soldats et civils. Dans un échange avec un journaliste alors qu’il était assis aux côtés du président salvadorien Nayib Bukele, Trump a comparé les combats en cours en Ukraine à un « champ de bataille sanglant » et qualifié le conflit de guerre « qui n’aurait jamais dû commencer ». « C’est un champ de massacre », a déclaré Trump. « C’est comme la guerre de Sécession. Regardez les images satellites. Cela ne devrait pas arriver à notre époque. Bien sûr, notre époque peut être assez violente, comme on le sait. » Trump a ajouté : « Mais c’est une guerre qui n’aurait jamais dû commencer. Biden aurait pu l’empêcher, Zelensky aurait pu l’empêcher, et Poutine n’aurait pas dû la déclencher. Tout le monde est responsable. » Un journaliste lui a demandé : « Avez-vous parlé au président Zelensky, monsieur, au sujet de son offre d’achat de nouvelles batteries de missiles Patriot ? » Trump s’en est pris à Zelensky, l’accusant de chercher délibérément le conflit avec la Russie : « Il cherche toujours à acheter des missiles, vous savez. Il est contre – écoutez, quand on commence une guerre, il faut savoir qu’on peut la gagner, non ? On ne lance pas une guerre contre quelqu’un qui est vingt fois plus puissant que vous en espérant ensuite que les autres vous fourniront des missiles. » 🚨🇺🇸🇺🇦🇷🇺 ALERTE INFO | « Vous ne COMMENCEZ PAS une guerre contre quelqu’un qui est 20 FOIS PLUS GRAND QUE VOUS et ESPÉREZ ensuite que LES GENS vous DONNERONT des MISSILES », a lancé Donald Trump à Volodymyr Zelensky. pic.twitter.com/eeMRFDGguf — Cerfia (@CerfiaFR)April 14, 2025 Trump a promis, pendant sa campagne, de mettre rapidement fin au conflit, mais il peine jusqu’à présent à faire asseoir la Russie et l’Ukraine à la table des négociations. Il a régulièrement critiqué le rôle défensif de l’Ukraine dans la guerre, tout en s’abstenant dans l’ensemble de critiquer Moscou. ABONNEZ-VOUS À NOTRE NEWSLETTER Lire aussi **Rima Hassan ainsi que tous les membres d’équipage du navire humanitaire vont être emprisonnés à la prison de Givon** **Elon Musk affirme que Trump figure dans les dossiers Epstein, gardés secrets** **Le Kremlin est prêt pour un conflit généralisé avec l’OTAN, selon l’Institut pour l’étude de la guerre** **L’odeur de faillite est maintenant impossible à masquer** **Guerre en Ukraine : « Poutine joue avec le feu », référence à une Troisième Guerre Mondiale…** **Rima Hassan ainsi que tous les membres d’équipage du navire humanitaire vont être emprisonnés à la prison de Givon** **Elon Musk affirme que Trump figure dans les dossiers Epstein, gardés secrets** **Le Kremlin est prêt pour un conflit généralisé avec l’OTAN, selon l’Institut pour l’étude de la guerre** **L’odeur de faillite est maintenant impossible à masquer** Les Moutons Rebelles : Votre source indépendante de réflexion et de réinformation, un site internet lancé en janvier 2016. Contact France Santé Science & Tech Société Economie Contact"}