{"id": 2142, "name": "Hindu Business Line", "domain": "thehindubusinessline.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.thehindubusinessline.com/money-and-banking/rbi-monetary-policy-committee-rbi-mpc-meeting-april-2025-live-updates-sanjay-malhotra-repo-rate-cut-news/article69426449.ece", "title": "Rbi Monetary Policy Committee Rbi Mpc Meeting April 2025 Live Updates Sanjay Malhotra Repo Rate Cut News", "content": "-35.33 + 3.95 -33.00 + 811.00 + 407.00 -35.33 + 3.95 + 3.95 -33.00 -33.00 + 811.00 Companies Markets Portfolio Opinion Economy Premium MSME Commodities Forex Gold & Silver Stocks Gold rate today Silver rate today Top gainers today Top losers today Nifty 50 BSE Sensex Personal Finance Big Story Derivatives Stock Fundamentals Mutual Funds Day Trading Guide Budget 2025 Macro Economy Policy Agri Business Logistics World Economic Forum Editorial Columns Quick Take Letters Blogs Business Laws Science and Technology Corporate File Auto focus Clean Tech Current Account Flight Plan Pulse Technophile Marketing News Money & Banking BL Explainer Info-tech BL On Campus Data Stories Marketing Video Podcast Package Books Latest News Cartoons Resources Contacts Webinar ePaper Get businessline apps on Connect with us Companies Markets Portfolio Opinion Economy Premium TO ENJOY ADDITIONAL BENEFITS Home NewsNationalScienceSportsWorldVarietyEducationReal Estate National Science Sports World Variety Education Real Estate National Science Sports World Variety Education Real Estate MarketsStocksForexCommoditiesGold & SilverGold rate todaySilver rate todayTop gainers todayTop losers todayNifty 50BSE Sensex Stocks Forex Commodities Gold & Silver Gold rate today Silver rate today Top gainers today Top losers today Nifty 50 BSE Sensex Stocks Forex Commodities Gold & Silver Gold rate today Silver rate today Top gainers today Top losers today Nifty 50 BSE Sensex CompaniesMSMECompanies Index MSME Companies Index MSME Companies Index Info-techComputers & LaptopsHow-ToMobiles & TabletsOther GadgetsSocial Media Computers & Laptops How-To Mobiles & Tablets Other Gadgets Social Media Computers & Laptops How-To Mobiles & Tablets Other Gadgets Social Media OpinionEditorialColumnsQuick TakeLettersBlogs Editorial Columns Quick Take Letters Blogs Editorial Columns Quick Take Letters Blogs Economy Portfolio Specials Logistics Data Stories See All Money & Banking Marketing Video Podcast Today's Paper On Campus Package Books ePaper Subscription Resources Connect With Us Get BusinessLine apps on Home Money & Banking **RBI MPC Meeting 2025 Highlights: RBI cuts repo rate by 25 basis points to 6%, changes stance to ‘accommodative’** **RBI MPC Meeting Highlights, RBI Monetary Policy Meeting Outcomes, RBI MPC Meeting April 2025 News & Highlights: The Reserve Bank of India (RBI) announced a 25-basis point (bps) cut to the repo rate, bringing it down to 6 per cent from 6.25 per cent after the Monetary Policy Committee (MPC) meeting on Wednesday.** **By Team BL** RBI MPC Meeting Highlights, RBI Monetary Policy Meeting Outcomes, RBI MPC Meeting April 2025 News & Highlights: Follow here for all the latest updates regarding expectations fromReserve Bank of India’s (RBI)Monetary Policy Committee meeting. The Reserve Bank of India (RBI) announced a 25-basis point (bps) cut to the repo rate, bringing it down to 6 per cent from 6.25 per cent after the Monetary Policy Committee (MPC) meeting on Wednesday. RBI Governor Sanjay Malhotra announced the decision in his address two days after the MPC meet commenced on April 7. This follows a similar rate cut in February. This decision is in line with the market expectations, which speculated a rate cut anywhere between 25 bps to 50 bps. Given that the inflation rate in February was 3.61 per cent coupled with rising concerns of the Trump trade war, analysts anticipate that the rate cut would spur economic growth. The Indian economy recorded growth of 6.2 per cent in Q3 (Oct-Dec) of FY2024-25 which followed a seven-quarter low of 5.4 per cent in Q2. Here are the highlights from the Reserve Bank of India’s Monetary Policy Committee (MPC) meetings fromFebruary ‘25,December ’24,October ’24,August ’24,June ’24&April ’24 When do MPC meetings happen? The RBI typically conducts six bimonthly meetings in a financial year, where it deliberates interest rates, money supply, inflation outlook, and various macroeconomic indicators. The current MPC meeting runs from April 7-9. The other five meetings are scheduled for June 4-6, August 5-7, September 29-October 1, December 3-5, and February 4-6. Who are the members in MPC? TheRBImonetary policy committee (MPC) consists of six members — three from the RBI, including the Governor, and three external members appointed by the Central Government. What is the objective of MPC? The main objective of the MPC is to maintain price stability while supporting economic growth. The RBI’s target is to keep inflation within the range of 2-6 per cent, with a medium-term goal of 4 per cent. What is Repo Rate? The repo rate is the rate of interest at which the RBI lends to other banks. It is currently at 6.25%. It was changed in the previous MPC in February when it was brought down from 6.5% to 6.25% after 5 years. **RBI MPC Meeting April 2025 Key Highlights & Outcomes:** Following are the highlights of the bi-monthly monetary policy announced by the Reserve Bank of India Governor Sanjay Malhotra on 9th April 2025: Repo Rate cut of 25 bps to 6%, changes stance to ‘accommodative’ CPI inflation for FY26 is projected at 4% Real GDP growth for FY26 is projected at 6.5 per cent FY26: GDP growth for Q1 6.5%, Q2 6.7%, Q3 6.6% & Q4 6.3% System liquidity was in deficit in January at over Rs 3.1 lakh crore P2P transaction limit will remain unchanged at Rs 1 lakh NPCI to decide transaction limits in UPI from person to merchant Co-lending to be allowed to all regulated entities to all loans 13:51 | April 9, 2025RBI MPC Meet Live Updates: CS Setty, Chairman, SBI, on monetary policy:“The RBI rate cut coupled with the revision in stance to accommodative was a swift, timely move and a forward guidance to the market to stay supportive against evolving global uncertainties. The revision of stance to accommodation will cushion the secondary impact of tariffs on domestic economy. With inflation under check, growth imperatives will take precedence in FY26.On the regulation side market-based securitization framework for stressed assets, review of policy on gold lending and non-fund-based facility are timely. Widening of co-lending framework gives wider choices to all parties concerned” **RBI MPC Meet Live Updates: CS Setty, Chairman, SBI, on monetary policy:** “The RBI rate cut coupled with the revision in stance to accommodative was a swift, timely move and a forward guidance to the market to stay supportive against evolving global uncertainties. The revision of stance to accommodation will cushion the secondary impact of tariffs on domestic economy. With inflation under check, growth imperatives will take precedence in FY26. On the regulation side market-based securitization framework for stressed assets, review of policy on gold lending and non-fund-based facility are timely. Widening of co-lending framework gives wider choices to all parties concerned” **RBI MPC Meet Live Updates: CS Setty, Chairman, SBI, on monetary policy:** “The RBI rate cut coupled with the revision in stance to accommodative was a swift, timely move and a forward guidance to the market to stay supportive against evolving global uncertainties. The revision of stance to accommodation will cushion the secondary impact of tariffs on domestic economy. With inflation under check, growth imperatives will take precedence in FY26. On the regulation side market-based securitization framework for stressed assets, review of policy on gold lending and non-fund-based facility are timely. Widening of co-lending framework gives wider choices to all parties concerned” 13:51 | April 9, 2025RBI MPC Live Updates: Mr Siddarth Bhamre, Head of Research at Asit C Mehta Investment IntermediatesWith inflation forecast for FY26 at 4% the focus of RBI has completely shifted on the GDP growth as numbers got revised downwards to 6.5% from earlier 6.7%. RBI not only reduced interest rates by 25 bps but also changed its stance to accommodative from neutral. Inflation to remain under control as forecast of normal monsoon, record production of wheat and higher production of key pulses will ensure durable softening of food inflation. Also fall in crude oil price will keep inflation under check.If inflation remains under/around 4% for FY26 then the real rate at 200 bps is on the higher side and mostly will be reduced by cutting interest rates further. However, RBI would want to keep its arsenal intact if there is any disruption in the world order due to a tariff war. We believe RBI will watchfully go for couple of more cuts in little over as many policy meets. 10-year bond yield may not show immediate correction, but this policy has defined the near-term ceiling for it. **RBI MPC Live Updates: Mr Siddarth Bhamre, Head of Research at Asit C Mehta Investment Intermediates** With inflation forecast for FY26 at 4% the focus of RBI has completely shifted on the GDP growth as numbers got revised downwards to 6.5% from earlier 6.7%. RBI not only reduced interest rates by 25 bps but also changed its stance to accommodative from neutral. Inflation to remain under control as forecast of normal monsoon, record production of wheat and higher production of key pulses will ensure durable softening of food inflation. Also fall in crude oil price will keep inflation under check. If inflation remains under/around 4% for FY26 then the real rate at 200 bps is on the higher side and mostly will be reduced by cutting interest rates further. However, RBI would want to keep its arsenal intact if there is any disruption in the world order due to a tariff war. We believe RBI will watchfully go for couple of more cuts in little over as many policy meets. 10-year bond yield may not show immediate correction, but this policy has defined the near-term ceiling for it. **RBI MPC Live Updates: Mr Siddarth Bhamre, Head of Research at Asit C Mehta Investment Intermediates** With inflation forecast for FY26 at 4% the focus of RBI has completely shifted on the GDP growth as numbers got revised downwards to 6.5% from earlier 6.7%. RBI not only reduced interest rates by 25 bps but also changed its stance to accommodative from neutral. Inflation to remain under control as forecast of normal monsoon, record production of wheat and higher production of key pulses will ensure durable softening of food inflation. Also fall in crude oil price will keep inflation under check. If inflation remains under/around 4% for FY26 then the real rate at 200 bps is on the higher side and mostly will be reduced by cutting interest rates further. However, RBI would want to keep its arsenal intact if there is any disruption in the world order due to a tariff war. We believe RBI will watchfully go for couple of more cuts in little over as many policy meets. 10-year bond yield may not show immediate correction, but this policy has defined the near-term ceiling for it. 13:50 | April 9, 2025RBI MPC 2025 Meet Live: Mr. Avnish Jain, Head - Fixed Income, Canara Robeco Mutual Fund“The RBI’s policy stance is clearly supportive of the fixed income markets. The continued focus on maintaining liquidity surplus—through both operational tools such as ₹80,000 crore in OMOs—underscores its accommodative approach. The money market rates should come down. While some seasonal tightness in liquidity is expected post-April, we believe the RBI’s proactive management will ensure that the overall environment remains conducive to credit flow and financial stability. There is a risk of tariff war, which we need to watch out. However, since oil prices are down and commodity prices are in control, inflation risk is lower. There could be another 50 basis point rate cut during the rest of the year **RBI MPC 2025 Meet Live: Mr. Avnish Jain, Head - Fixed Income, Canara Robeco Mutual Fund** “The RBI’s policy stance is clearly supportive of the fixed income markets. The continued focus on maintaining liquidity surplus—through both operational tools such as ₹80,000 crore in OMOs—underscores its accommodative approach. The money market rates should come down. While some seasonal tightness in liquidity is expected post-April, we believe the RBI’s proactive management will ensure that the overall environment remains conducive to credit flow and financial stability. There is a risk of tariff war, which we need to watch out. However, since oil prices are down and commodity prices are in control, inflation risk is lower. There could be another 50 basis point rate cut during the rest of the year **RBI MPC 2025 Meet Live: Mr. Avnish Jain, Head - Fixed Income, Canara Robeco Mutual Fund** “The RBI’s policy stance is clearly supportive of the fixed income markets. The continued focus on maintaining liquidity surplus—through both operational tools such as ₹80,000 crore in OMOs—underscores its accommodative approach. The money market rates should come down. While some seasonal tightness in liquidity is expected post-April, we believe the RBI’s proactive management will ensure that the overall environment remains conducive to credit flow and financial stability. There is a risk of tariff war, which we need to watch out. However, since oil prices are down and commodity prices are in control, inflation risk is lower. There could be another 50 basis point rate cut during the rest of the year 13:49 | April 9, 2025RBI MPC Live Updates: Mr. Rishi Anand, MD & CEO, Aadhar Housing Finance Ltd“The additional 25-basis points rate cut to 6% by the Reserve Bank of India is a significant step in supporting growth and completely in line with the industry’s expectations. As I had mentioned earlier, since nearly 80% of Aadhar Housing Finance’s existing borrowers are on floating rates this reduction will benefit them. At some stage soon this will lead to reduction in Aadhar RPLR thereby reducing EMI burden. The only wait now is for the banks to pass on this benefit to us.Furthermore, many first-time buyers in the Economically Weaker Section (EWS) and Lower Income Group (LIG) segments will now find it easier to take that crucial step towards home ownership as this move directly translates into lower EMIs and improved affordability. This proactive liquidity support from the central bank clubbed with government initiatives like PMAY 2.0, (SWAMIH) 2.0 fund, income tax exemptions, the introduction of a mortgage guarantee fund will positively accelerate housing demand and aid to government’s vision of housing for all.” **RBI MPC Live Updates: Mr. Rishi Anand, MD & CEO, Aadhar Housing Finance Ltd** “The additional 25-basis points rate cut to 6% by the Reserve Bank of India is a significant step in supporting growth and completely in line with the industry’s expectations. As I had mentioned earlier, since nearly 80% of Aadhar Housing Finance’s existing borrowers are on floating rates this reduction will benefit them. At some stage soon this will lead to reduction in Aadhar RPLR thereby reducing EMI burden. The only wait now is for the banks to pass on this benefit to us. Furthermore, many first-time buyers in the Economically Weaker Section (EWS) and Lower Income Group (LIG) segments will now find it easier to take that crucial step towards home ownership as this move directly translates into lower EMIs and improved affordability. This proactive liquidity support from the central bank clubbed with government initiatives like PMAY 2.0, (SWAMIH) 2.0 fund, income tax exemptions, the introduction of a mortgage guarantee fund will positively accelerate housing demand and aid to government’s vision of housing for all.” **RBI MPC Live Updates: Mr. Rishi Anand, MD & CEO, Aadhar Housing Finance Ltd** “The additional 25-basis points rate cut to 6% by the Reserve Bank of India is a significant step in supporting growth and completely in line with the industry’s expectations. As I had mentioned earlier, since nearly 80% of Aadhar Housing Finance’s existing borrowers are on floating rates this reduction will benefit them. At some stage soon this will lead to reduction in Aadhar RPLR thereby reducing EMI burden. The only wait now is for the banks to pass on this benefit to us. Furthermore, many first-time buyers in the Economically Weaker Section (EWS) and Lower Income Group (LIG) segments will now find it easier to take that crucial step towards home ownership as this move directly translates into lower EMIs and improved affordability. This proactive liquidity support from the central bank clubbed with government initiatives like PMAY 2.0, (SWAMIH) 2.0 fund, income tax exemptions, the introduction of a mortgage guarantee fund will positively accelerate housing demand and aid to government’s vision of housing for all.” 13:48 | April 9, 2025RBI MPC Live Update: Deepak Ramaraju, Senior Fund Manager, Shriram AMC.The Reserve Bank of India’s (RBI) decision to shift to an accommodative stance and cut the repo rate by 25 basis points is a welcome move amid global economic uncertainties. This signals the central bank’s proactive approach to support growth and liquidity in the economy, especially in light of potential headwinds such as escalating trade tensions and counter tariffs.The reduction in borrowing costs along with tax cuts announced in budget is expected to boost consumption demand, especially in interest-rate sensitive segments. This can also support discretionary spending, which could aid sectors like auto, consumer durables, and housing. This move can also help India’s relative economic outperformance versus global peers, given the backdrop of a slowing global economy.However, market sentiment was dented by the RBI’s mention of revised gold loan guidelines, which has triggered uncertainty. NBFCs and banks with a strong gold loan portfolio witnessed sharp corrections. The “risk-off” mood among investors, driven by regulatory overhang, contributed to the sell-off. The fact that the guidelines are open for comments and review adds a layer of unpredictability to earnings visibility for these companies.While the policy stance is supportive of growth and liquidity, sector-specific regulatory risks—especially in the gold loan segment—are creating near-term volatility. Investors and stakeholders will be closely watching for clarity on gold loan norms, which could help in reassessing valuations and risk appetite for financials exposed to this segment. **RBI MPC Live Update: Deepak Ramaraju, Senior Fund Manager, Shriram AMC.** The Reserve Bank of India’s (RBI) decision to shift to an accommodative stance and cut the repo rate by 25 basis points is a welcome move amid global economic uncertainties. This signals the central bank’s proactive approach to support growth and liquidity in the economy, especially in light of potential headwinds such as escalating trade tensions and counter tariffs. The reduction in borrowing costs along with tax cuts announced in budget is expected to boost consumption demand, especially in interest-rate sensitive segments. This can also support discretionary spending, which could aid sectors like auto, consumer durables, and housing. This move can also help India’s relative economic outperformance versus global peers, given the backdrop of a slowing global economy. However, market sentiment was dented by the RBI’s mention of revised gold loan guidelines, which has triggered uncertainty. NBFCs and banks with a strong gold loan portfolio witnessed sharp corrections. The “risk-off” mood among investors, driven by regulatory overhang, contributed to the sell-off. The fact that the guidelines are open for comments and review adds a layer of unpredictability to earnings visibility for these companies. While the policy stance is supportive of growth and liquidity, sector-specific regulatory risks—especially in the gold loan segment—are creating near-term volatility. Investors and stakeholders will be closely watching for clarity on gold loan norms, which could help in reassessing valuations and risk appetite for financials exposed to this segment. **RBI MPC Live Update: Deepak Ramaraju, Senior Fund Manager, Shriram AMC.** The Reserve Bank of India’s (RBI) decision to shift to an accommodative stance and cut the repo rate by 25 basis points is a welcome move amid global economic uncertainties. This signals the central bank’s proactive approach to support growth and liquidity in the economy, especially in light of potential headwinds such as escalating trade tensions and counter tariffs. The reduction in borrowing costs along with tax cuts announced in budget is expected to boost consumption demand, especially in interest-rate sensitive segments. This can also support discretionary spending, which could aid sectors like auto, consumer durables, and housing. This move can also help India’s relative economic outperformance versus global peers, given the backdrop of a slowing global economy. However, market sentiment was dented by the RBI’s mention of revised gold loan guidelines, which has triggered uncertainty. NBFCs and banks with a strong gold loan portfolio witnessed sharp corrections. The “risk-off” mood among investors, driven by regulatory overhang, contributed to the sell-off. The fact that the guidelines are open for comments and review adds a layer of unpredictability to earnings visibility for these companies. While the policy stance is supportive of growth and liquidity, sector-specific regulatory risks—especially in the gold loan segment—are creating near-term volatility. Investors and stakeholders will be closely watching for clarity on gold loan norms, which could help in reassessing valuations and risk appetite for financials exposed to this segment. 13:48 | April 9, 2025RBI MPC Live News Updates: Aamar Deo Singh, Senior Vice President – Research at Angel OneThe RBI’s decision to cut the repo rate by 25 basis points to 6% and shift its policy stance to ‘accommodative’ signals a clear intent to support growth amid rising global uncertainties. With inflationary pressures easing—largely due to lower crude and food prices—and downside risks to growth becoming more pronounced post the recent US tariff hikes, this policy move was timely and expected.The change in stance strengthens the case for a continued easing cycle. We expect this to translate into lower borrowing costs, particularly benefiting rate-sensitive sectors such as housing, automobiles, and MSMEs. Real estate, in particular, stands to gain as improved affordability may drive homebuyer sentiment and spur new demand.While the RBI has revised its GDP growth forecast for FY26 to 6.5%, external challenges, including trade disruptions and climate-related volatility, may exert further pressure. The outlook for inflation remains manageable at 4%, supported by expectations of a normal monsoon, though risks from extreme weather events must be closely watched.Overall, the policy action reflects a calibrated approach—balancing growth support with macroeconomic stability—and sets the tone for a data-driven, accommodative monetary trajectory in the months ahead. **RBI MPC Live News Updates: Aamar Deo Singh, Senior Vice President – Research at Angel One** The RBI’s decision to cut the repo rate by 25 basis points to 6% and shift its policy stance to ‘accommodative’ signals a clear intent to support growth amid rising global uncertainties. With inflationary pressures easing—largely due to lower crude and food prices—and downside risks to growth becoming more pronounced post the recent US tariff hikes, this policy move was timely and expected. The change in stance strengthens the case for a continued easing cycle. We expect this to translate into lower borrowing costs, particularly benefiting rate-sensitive sectors such as housing, automobiles, and MSMEs. Real estate, in particular, stands to gain as improved affordability may drive homebuyer sentiment and spur new demand. While the RBI has revised its GDP growth forecast for FY26 to 6.5%, external challenges, including trade disruptions and climate-related volatility, may exert further pressure. The outlook for inflation remains manageable at 4%, supported by expectations of a normal monsoon, though risks from extreme weather events must be closely watched. Overall, the policy action reflects a calibrated approach—balancing growth support with macroeconomic stability—and sets the tone for a data-driven, accommodative monetary trajectory in the months ahead. **RBI MPC Live News Updates: Aamar Deo Singh, Senior Vice President – Research at Angel One** The RBI’s decision to cut the repo rate by 25 basis points to 6% and shift its policy stance to ‘accommodative’ signals a clear intent to support growth amid rising global uncertainties. With inflationary pressures easing—largely due to lower crude and food prices—and downside risks to growth becoming more pronounced post the recent US tariff hikes, this policy move was timely and expected. The change in stance strengthens the case for a continued easing cycle. We expect this to translate into lower borrowing costs, particularly benefiting rate-sensitive sectors such as housing, automobiles, and MSMEs. Real estate, in particular, stands to gain as improved affordability may drive homebuyer sentiment and spur new demand. While the RBI has revised its GDP growth forecast for FY26 to 6.5%, external challenges, including trade disruptions and climate-related volatility, may exert further pressure. The outlook for inflation remains manageable at 4%, supported by expectations of a normal monsoon, though risks from extreme weather events must be closely watched. Overall, the policy action reflects a calibrated approach—balancing growth support with macroeconomic stability—and sets the tone for a data-driven, accommodative monetary trajectory in the months ahead. 13:47 | April 9, 2025RBI MPC Live News Updates: Credit enhancements guidelines and its impact by Anil Gupta, SVP & Co-Group Head - Financial Sector RatingsWhile we await the revised draft, it is good that the RBI is revisiting the partial credit enhancement guidelines as the segment did not scale up given the restrictions in existing guidelines. Some of the challenges included the capping of the partial credit enhancement only 20% of bond issue though capital requirements were significantly higher in relation to the guarantee provided and limited / back-ended amortization of credit enhancement resulting in guarantee fees outweighing the benefits of cost reduction upon rating enhancement. **RBI MPC Live News Updates: Credit enhancements guidelines and its impact by Anil Gupta, SVP & Co-Group Head - Financial Sector Ratings** While we await the revised draft, it is good that the RBI is revisiting the partial credit enhancement guidelines as the segment did not scale up given the restrictions in existing guidelines. Some of the challenges included the capping of the partial credit enhancement only 20% of bond issue though capital requirements were significantly higher in relation to the guarantee provided and limited / back-ended amortization of credit enhancement resulting in guarantee fees outweighing the benefits of cost reduction upon rating enhancement. **RBI MPC Live News Updates: Credit enhancements guidelines and its impact by Anil Gupta, SVP & Co-Group Head - Financial Sector Ratings** While we await the revised draft, it is good that the RBI is revisiting the partial credit enhancement guidelines as the segment did not scale up given the restrictions in existing guidelines. Some of the challenges included the capping of the partial credit enhancement only 20% of bond issue though capital requirements were significantly higher in relation to the guarantee provided and limited / back-ended amortization of credit enhancement resulting in guarantee fees outweighing the benefits of cost reduction upon rating enhancement. 13:46 | April 9, 2025RBI MPC 2025 Live Updates: AM Karthik, SVP & Co- Group Head, ICRA LtdWhile we await the details, guidelines to harmonise gold loan practices across lenders augurs well for the segment, given the sharp growth in loan book driven by the gold prices and favourable demand dynamics, as unsecured and personal credit slowed since H2FY2024. With the elevated gold prices at present and the currently favourable risk profiles of the NBFCs in this space, considering the liquid nature of the security, the near-term impact on account of regulatory tightening should be manageable. However, competitive pressures for NBFCs could increase going forward, which remains monitorable. **RBI MPC 2025 Live Updates: AM Karthik, SVP & Co- Group Head, ICRA Ltd** While we await the details, guidelines to harmonise gold loan practices across lenders augurs well for the segment, given the sharp growth in loan book driven by the gold prices and favourable demand dynamics, as unsecured and personal credit slowed since H2FY2024. With the elevated gold prices at present and the currently favourable risk profiles of the NBFCs in this space, considering the liquid nature of the security, the near-term impact on account of regulatory tightening should be manageable. However, competitive pressures for NBFCs could increase going forward, which remains monitorable. **RBI MPC 2025 Live Updates: AM Karthik, SVP & Co- Group Head, ICRA Ltd** While we await the details, guidelines to harmonise gold loan practices across lenders augurs well for the segment, given the sharp growth in loan book driven by the gold prices and favourable demand dynamics, as unsecured and personal credit slowed since H2FY2024. With the elevated gold prices at present and the currently favourable risk profiles of the NBFCs in this space, considering the liquid nature of the security, the near-term impact on account of regulatory tightening should be manageable. However, competitive pressures for NBFCs could increase going forward, which remains monitorable. 13:46 | April 9, 2025RBI MPC 2025 Live: Perspective on RBI Monetary Policy by Mr. Nitin Bavisi, CFO, Ajmera Realty & Infra India Ltd“The RBI has reduced the repo rate by 25 bps and at 6% now indeed delivered on the relief front, and the central bank is ahead of the curve with its policy measures to combat the uncertainties post due to global tariff war.The central bank has provided relief on the rate front for the second consecutive time. The rate cut is complemented well by the change in policy stance from neutral to accommodative. The change in stance indicates the readiness of the central bank to act as per the prevailing situation. Other than the rate cut and policy stance change, the commentary on inflation indicating further softening of inflation due to better crop production and above normal monsoon expectations.The RBI has now cut rates by 50 bps in the current calendar year, a move which is expected to further boost demand for real estate. Lower interest rates are anticipated to propagate better home loan affordability, eventually accelerating housing demandin varied ticket segments.The other measures like RBI allowing securitisation of stressed assets and co-lending between regulated entities and beyond priority sector, along with ample system liquidity will help boost the credit growth in the system. Barring the tariff war, geopolitical tensions, most economic indicators are positive, including inflation, GDP growth and a normal monsoon year.” **RBI MPC 2025 Live: Perspective on RBI Monetary Policy by Mr. Nitin Bavisi, CFO, Ajmera Realty & Infra India Ltd** “The RBI has reduced the repo rate by 25 bps and at 6% now indeed delivered on the relief front, and the central bank is ahead of the curve with its policy measures to combat the uncertainties post due to global tariff war. The central bank has provided relief on the rate front for the second consecutive time. The rate cut is complemented well by the change in policy stance from neutral to accommodative. The change in stance indicates the readiness of the central bank to act as per the prevailing situation. Other than the rate cut and policy stance change, the commentary on inflation indicating further softening of inflation due to better crop production and above normal monsoon expectations. The RBI has now cut rates by 50 bps in the current calendar year, a move which is expected to further boost demand for real estate. Lower interest rates are anticipated to propagate better home loan affordability, eventually accelerating housing demand in varied ticket segments. The other measures like RBI allowing securitisation of stressed assets and co-lending between regulated entities and beyond priority sector, along with ample system liquidity will help boost the credit growth in the system. Barring the tariff war, geopolitical tensions, most economic indicators are positive, including inflation, GDP growth and a normal monsoon year.” **RBI MPC 2025 Live: Perspective on RBI Monetary Policy by Mr. Nitin Bavisi, CFO, Ajmera Realty & Infra India Ltd** “The RBI has reduced the repo rate by 25 bps and at 6% now indeed delivered on the relief front, and the central bank is ahead of the curve with its policy measures to combat the uncertainties post due to global tariff war. The central bank has provided relief on the rate front for the second consecutive time. The rate cut is complemented well by the change in policy stance from neutral to accommodative. The change in stance indicates the readiness of the central bank to act as per the prevailing situation. Other than the rate cut and policy stance change, the commentary on inflation indicating further softening of inflation due to better crop production and above normal monsoon expectations. The RBI has now cut rates by 50 bps in the current calendar year, a move which is expected to further boost demand for real estate. Lower interest rates are anticipated to propagate better home loan affordability, eventually accelerating housing demand in varied ticket segments. The other measures like RBI allowing securitisation of stressed assets and co-lending between regulated entities and beyond priority sector, along with ample system liquidity will help boost the credit growth in the system. Barring the tariff war, geopolitical tensions, most economic indicators are positive, including inflation, GDP growth and a normal monsoon year.” 13:45 | April 9, 2025RBI MPC Live Updates: Killol Pandya, Senior Fund Manager – Debt, JM Financial Asset Management Ltd.RBI delivers on expectations: RBI cuts rates, changes stance, and provides comfort on inflation projection.Takeaways:1. As expected by market participants, Reserve Bank of India (RBI) cut Repo rate by 25 bps, bringing the Repo rate to 6.00%, Standing Deposit Facility (SDF) at 5.75% and Marginal Standing Facility (MSF) at 6.25%.2. The Monetary Policy Committee (MPC) also changed its stance to ‘Accommodative’ (from ‘Neutral’).3. The principal driver for the rate cut and change in stance were RBI’s expectations of a benign inflation trajectory and the need to support moderating economic growth.4. RBI lowered its Gross Domestic Production (GDP) projection for FY 25-26 to 6.50% (Vs 6.70% earlier). RBI also lowered its FY25-26 Consumer Price Index (CPI) inflation forecast to 4.00% (Vs its earlier forecast of 4.20%)5. RBI expressed its view of a moderating growth and softening of inflation of the coming months, which bodes well for bond markets. However, it also reiterated the need for vigilance at this juncture, given the risks posed by the rising uncertainties regarding global macro-economic conditions and its potential impact on domestic conditions.6. As opposed to expectations of some market participants, RBI did not give any express guidance on market liquidity, but noted the present positive systemic liquidity conditions and reiterated its commitment to proactively **RBI MPC Live Updates: Killol Pandya, Senior Fund Manager – Debt, JM Financial Asset Management Ltd.** RBI delivers on expectations: RBI cuts rates, changes stance, and provides comfort on inflation projection. Takeaways: 1. As expected by market participants, Reserve Bank of India (RBI) cut Repo rate by 25 bps, bringing the Repo rate to 6.00%, Standing Deposit Facility (SDF) at 5.75% and Marginal Standing Facility (MSF) at 6.25%. 2. The Monetary Policy Committee (MPC) also changed its stance to ‘Accommodative’ (from ‘Neutral’). 3. The principal driver for the rate cut and change in stance were RBI’s expectations of a benign inflation trajectory and the need to support moderating economic growth. 4. RBI lowered its Gross Domestic Production (GDP) projection for FY 25-26 to 6.50% (Vs 6.70% earlier). RBI also lowered its FY25-26 Consumer Price Index (CPI) inflation forecast to 4.00% (Vs its earlier forecast of 4.20%) 5. RBI expressed its view of a moderating growth and softening of inflation of the coming months, which bodes well for bond markets. However, it also reiterated the need for vigilance at this juncture, given the risks posed by the rising uncertainties regarding global macro-economic conditions and its potential impact on domestic conditions. 6. As opposed to expectations of some market participants, RBI did not give any express guidance on market liquidity, but noted the present positive systemic liquidity conditions and reiterated its commitment to proactively **RBI MPC Live Updates: Killol Pandya, Senior Fund Manager – Debt, JM Financial Asset Management Ltd.** RBI delivers on expectations: RBI cuts rates, changes stance, and provides comfort on inflation projection. Takeaways: 1. As expected by market participants, Reserve Bank of India (RBI) cut Repo rate by 25 bps, bringing the Repo rate to 6.00%, Standing Deposit Facility (SDF) at 5.75% and Marginal Standing Facility (MSF) at 6.25%. 2. The Monetary Policy Committee (MPC) also changed its stance to ‘Accommodative’ (from ‘Neutral’). 3. The principal driver for the rate cut and change in stance were RBI’s expectations of a benign inflation trajectory and the need to support moderating economic growth. 4. RBI lowered its Gross Domestic Production (GDP) projection for FY 25-26 to 6.50% (Vs 6.70% earlier). RBI also lowered its FY25-26 Consumer Price Index (CPI) inflation forecast to 4.00% (Vs its earlier forecast of 4.20%) 5. RBI expressed its view of a moderating growth and softening of inflation of the coming months, which bodes well for bond markets. However, it also reiterated the need for vigilance at this juncture, given the risks posed by the rising uncertainties regarding global macro-economic conditions and its potential impact on domestic conditions. 6. As opposed to expectations of some market participants, RBI did not give any express guidance on market liquidity, but noted the present positive systemic liquidity conditions and reiterated its commitment to proactively 13:45 | April 9, 2025RBI MPC Live Updates: Marzban Irani, CIO of Fixed Income at LIC Mutual FundThe Reserve Bank of India announced a 25-basis point rate cut, bringing the repo rate down to 6% from 6.25% which is in line with market expectations. The policy stance has shifted from neutral to accommodative; indicating the possibility of further rate hikes.The RBI assured that liquidity will be infused as required, offering comfort to the markets. Forward projections may remain optimistic, with inflation expected to stay around 4% and GDP (Gross Domestic Product) growth projected at 6.5%. Given the benign inflation outlook, the RBI is likely to focus on growth through monetary stimulus measures. Overall, the policy is viewed as positive for fixed income markets. **RBI MPC Live Updates: Marzban Irani, CIO of Fixed Income at LIC Mutual Fund** The Reserve Bank of India announced a 25-basis point rate cut, bringing the repo rate down to 6% from 6.25% which is in line with market expectations. The policy stance has shifted from neutral to accommodative; indicating the possibility of further rate hikes. The RBI assured that liquidity will be infused as required, offering comfort to the markets. Forward projections may remain optimistic, with inflation expected to stay around 4% and GDP (Gross Domestic Product) growth projected at 6.5%. Given the benign inflation outlook, the RBI is likely to focus on growth through monetary stimulus measures. Overall, the policy is viewed as positive for fixed income markets. **RBI MPC Live Updates: Marzban Irani, CIO of Fixed Income at LIC Mutual Fund** The Reserve Bank of India announced a 25-basis point rate cut, bringing the repo rate down to 6% from 6.25% which is in line with market expectations. The policy stance has shifted from neutral to accommodative; indicating the possibility of further rate hikes. The RBI assured that liquidity will be infused as required, offering comfort to the markets. Forward projections may remain optimistic, with inflation expected to stay around 4% and GDP (Gross Domestic Product) growth projected at 6.5%. Given the benign inflation outlook, the RBI is likely to focus on growth through monetary stimulus measures. Overall, the policy is viewed as positive for fixed income markets. 13:02 | April 9, 2025RBI MPC 2025 Live Updates: Suvodeep Rakshit, Chief Economist, Kotak Institutional Equities“We see RBI’s change in stance to ‘accommodative’ as an intent for a deeper rate cut cycle. This is in line with our view of another 75-100 bps of rate cuts in FY2026E, implying repo rate at 5-5.25% by end-FY2026E. The benign outlook on inflation (favorable monsoon, lower crude oil prices to offset INR depreciation) and downside risks to growth will provide room for this deeper rate cut cycle. The RBI’s focus remains on addressing growth concerns as inflation is expected to remain around the 4% handle. We also expect the RBI to keep liquidity conditions ample to ensure smooth monetary policy transmission.” **RBI MPC 2025 Live Updates: Suvodeep Rakshit, Chief Economist, Kotak Institutional Equities** “We see RBI’s change in stance to ‘accommodative’ as an intent for a deeper rate cut cycle. This is in line with our view of another 75-100 bps of rate cuts in FY2026E, implying repo rate at 5-5.25% by end-FY2026E. The benign outlook on inflation (favorable monsoon, lower crude oil prices to offset INR depreciation) and downside risks to growth will provide room for this deeper rate cut cycle. The RBI’s focus remains on addressing growth concerns as inflation is expected to remain around the 4% handle. We also expect the RBI to keep liquidity conditions ample to ensure smooth monetary policy transmission.” **RBI MPC 2025 Live Updates: Suvodeep Rakshit, Chief Economist, Kotak Institutional Equities** “We see RBI’s change in stance to ‘accommodative’ as an intent for a deeper rate cut cycle. This is in line with our view of another 75-100 bps of rate cuts in FY2026E, implying repo rate at 5-5.25% by end-FY2026E. The benign outlook on inflation (favorable monsoon, lower crude oil prices to offset INR depreciation) and downside risks to growth will provide room for this deeper rate cut cycle. The RBI’s focus remains on addressing growth concerns as inflation is expected to remain around the 4% handle. We also expect the RBI to keep liquidity conditions ample to ensure smooth monetary policy transmission.” 13:01 | April 9, 2025RBI MPC Meet Live: Repo rate reaction quote from WOL3D, India’s only listed 3D printing & prototyping company, from a manufacturing and SME standpointRBI to reduce the repo rate by 25 basis points to 6% and shift to an accommodative stance is a welcome move for SMEs . As a company operating in the 3D printing sector, this decision will not only reduce borrowing costs but also improve liquidity in the market, enabling businesses to invest in innovation and expansion. With inflation under control and a focus on stimulating economic growth, we are optimistic about leveraging these favorable conditions to drive technological advancements and contribute to the broader economy. - Mr. Rahul Chandalia, Founder & Director, WOL3D **RBI MPC Meet Live: Repo rate reaction quote from WOL3D, India’s only listed 3D printing & prototyping company, from a manufacturing and SME standpoint** RBI to reduce the repo rate by 25 basis points to 6% and shift to an accommodative stance is a welcome move for SMEs . As a company operating in the 3D printing sector, this decision will not only reduce borrowing costs but also improve liquidity in the market, enabling businesses to invest in innovation and expansion. With inflation under control and a focus on stimulating economic growth, we are optimistic about leveraging these favorable conditions to drive technological advancements and contribute to the broader economy. - Mr. Rahul Chandalia, Founder & Director, WOL3D **RBI MPC Meet Live: Repo rate reaction quote from WOL3D, India’s only listed 3D printing & prototyping company, from a manufacturing and SME standpoint** RBI to reduce the repo rate by 25 basis points to 6% and shift to an accommodative stance is a welcome move for SMEs . As a company operating in the 3D printing sector, this decision will not only reduce borrowing costs but also improve liquidity in the market, enabling businesses to invest in innovation and expansion. With inflation under control and a focus on stimulating economic growth, we are optimistic about leveraging these favorable conditions to drive technological advancements and contribute to the broader economy. - Mr. Rahul Chandalia, Founder & Director, WOL3D 13:00 | April 9, 2025RBI MPC Live Updates: Amit Somani, Deputy Head-Fixed Income, Tata Asset ManagementRBI delivered a 25bps rate cut, in line with market expectation. The policy stance has been changed to accommodative. The policy and stance continue to remain Growth supportive, as inflation is expected to remain benign. Both Inflation and GDP growth rates have been revised lower.We expect the monetary policy to support greater transmission to help Economic grow in the current uncertain global environment. We expect market rates to remain well supported with 10-yr continue to trade in 6.40%-6.60% range, with positive bias. Short-term yields upto 1 year are also likely to trade in the current range after a sharp rally of 75-100 bps over the last one month.Beyond domestic monetary policy, markets will take further cues from current Global Tariff Wars and its impact on macro-economic parameters and financial stability. **RBI MPC Live Updates: Amit Somani, Deputy Head-Fixed Income, Tata Asset Management** RBI delivered a 25bps rate cut, in line with market expectation. The policy stance has been changed to accommodative. The policy and stance continue to remain Growth supportive, as inflation is expected to remain benign. Both Inflation and GDP growth rates have been revised lower. We expect the monetary policy to support greater transmission to help Economic grow in the current uncertain global environment. We expect market rates to remain well supported with 10-yr continue to trade in 6.40%-6.60% range, with positive bias. Short-term yields upto 1 year are also likely to trade in the current range after a sharp rally of 75-100 bps over the last one month. Beyond domestic monetary policy, markets will take further cues from current Global Tariff Wars and its impact on macro-economic parameters and financial stability. **RBI MPC Live Updates: Amit Somani, Deputy Head-Fixed Income, Tata Asset Management** RBI delivered a 25bps rate cut, in line with market expectation. The policy stance has been changed to accommodative. The policy and stance continue to remain Growth supportive, as inflation is expected to remain benign. Both Inflation and GDP growth rates have been revised lower. We expect the monetary policy to support greater transmission to help Economic grow in the current uncertain global environment. We expect market rates to remain well supported with 10-yr continue to trade in 6.40%-6.60% range, with positive bias. Short-term yields upto 1 year are also likely to trade in the current range after a sharp rally of 75-100 bps over the last one month. Beyond domestic monetary policy, markets will take further cues from current Global Tariff Wars and its impact on macro-economic parameters and financial stability. 13:00 | April 9, 2025RBI MPC Meet Live: K V Srinivasan, Executive Director and CEO, Profectus Capital Private Limited“The RBI’s reduction in the policy rate by 25 bps is in line with market expectations and, coupled with the measures taken by them to infuse more liquidity, should signal good times for MSMEs. With much greater competition and global uncertainties, investment in up-to-date machinery is critical to maintaining our competitive edge. The cost of debt has been high in the past couple of years, and the signal towards a benign rate scenario should encourage MSMEs to plan capital investment.” **RBI MPC Meet Live: K V Srinivasan, Executive Director and CEO, Profectus Capital Private Limited** “The RBI’s reduction in the policy rate by 25 bps is in line with market expectations and, coupled with the measures taken by them to infuse more liquidity, should signal good times for MSMEs. With much greater competition and global uncertainties, investment in up-to-date machinery is critical to maintaining our competitive edge. The cost of debt has been high in the past couple of years, and the signal towards a benign rate scenario should encourage MSMEs to plan capital investment.” **RBI MPC Meet Live: K V Srinivasan, Executive Director and CEO, Profectus Capital Private Limited** “The RBI’s reduction in the policy rate by 25 bps is in line with market expectations and, coupled with the measures taken by them to infuse more liquidity, should signal good times for MSMEs. With much greater competition and global uncertainties, investment in up-to-date machinery is critical to maintaining our competitive edge. The cost of debt has been high in the past couple of years, and the signal towards a benign rate scenario should encourage MSMEs to plan capital investment.” 12:59 | April 9, 2025RBI MPC Live News Updates: Vinod Kumar Goenka, Chairman & Managing Director, Valor Estate“The RBI’s decision to cut the repo rate by 25 basis points and adopt an accommodative stance is poised to positively impact the real estate sector. Lower interest rates are expected to enhance home loan affordability, which can significantly boost housing demand, especially in the affordable and mid-income categories. For developers, improved liquidity conditions may ease financing pressures, enabling faster execution and delivery of ongoing projects. The move also bodes well for commercial real estate, as lower borrowing costs could encourage business expansion and increase demand for office and retail spaces. While the GDP outlook has softened, the real estate market stands to benefit from the policy’s clear intent to support growth and investment. Overall, the industry is likely to witness renewed interest and improved sentiment, setting the stage for a more active and stable period ahead.” **RBI MPC Live News Updates: Vinod Kumar Goenka, Chairman & Managing Director, Valor Estate** “The RBI’s decision to cut the repo rate by 25 basis points and adopt an accommodative stance is poised to positively impact the real estate sector. Lower interest rates are expected to enhance home loan affordability, which can significantly boost housing demand, especially in the affordable and mid-income categories. For developers, improved liquidity conditions may ease financing pressures, enabling faster execution and delivery of ongoing projects. The move also bodes well for commercial real estate, as lower borrowing costs could encourage business expansion and increase demand for office and retail spaces. While the GDP outlook has softened, the real estate market stands to benefit from the policy’s clear intent to support growth and investment. Overall, the industry is likely to witness renewed interest and improved sentiment, setting the stage for a more active and stable period ahead.” **RBI MPC Live News Updates: Vinod Kumar Goenka, Chairman & Managing Director, Valor Estate** “The RBI’s decision to cut the repo rate by 25 basis points and adopt an accommodative stance is poised to positively impact the real estate sector. Lower interest rates are expected to enhance home loan affordability, which can significantly boost housing demand, especially in the affordable and mid-income categories. For developers, improved liquidity conditions may ease financing pressures, enabling faster execution and delivery of ongoing projects. The move also bodes well for commercial real estate, as lower borrowing costs could encourage business expansion and increase demand for office and retail spaces. While the GDP outlook has softened, the real estate market stands to benefit from the policy’s clear intent to support growth and investment. Overall, the industry is likely to witness renewed interest and improved sentiment, setting the stage for a more active and stable period ahead.” 12:59 | April 9, 2025RBI MPC Live Updates: Sandeep Ahuja Global CEO of Atmosphere Living on RBI MPC Announcement. Request to consider the same.“A cut in the repo rate can be a strong catalyst for the real estate sector. Lower interest rates translate into more affordable home loans, encouraging first-time buyers and investors alike to explore bigger and premium homes. Mid-range and high-end segments will also benefit as buyers feel more confident making long-term commitments. At the same time, the change in stance to being ‘accommodative,’ supports steady decision-making for both developers and homebuyers, reigniting buyer sentiment and boosting overall housing demand.Additionally, with ongoing economic uncertainties in the US and other global markets, many NRIs are turning their attention to their home land . A repo rate cut is likely to further strengthen this trend, as more NRIs see real estate in India as a stable and attractive investment opportunity. This could lead to a significant uptick in NRI-driven investments across the Indian real estate sector.” **RBI MPC Live Updates: Sandeep Ahuja Global CEO of Atmosphere Living on RBI MPC Announcement. Request to consider the same.** “A cut in the repo rate can be a strong catalyst for the real estate sector. Lower interest rates translate into more affordable home loans, encouraging first-time buyers and investors alike to explore bigger and premium homes. Mid-range and high-end segments will also benefit as buyers feel more confident making long-term commitments. At the same time, the change in stance to being ‘accommodative,’ supports steady decision-making for both developers and homebuyers, reigniting buyer sentiment and boosting overall housing demand. Additionally, with ongoing economic uncertainties in the US and other global markets, many NRIs are turning their attention to their home land . A repo rate cut is likely to further strengthen this trend, as more NRIs see real estate in India as a stable and attractive investment opportunity. This could lead to a significant uptick in NRI-driven investments across the Indian real estate sector.” **RBI MPC Live Updates: Sandeep Ahuja Global CEO of Atmosphere Living on RBI MPC Announcement. Request to consider the same.** “A cut in the repo rate can be a strong catalyst for the real estate sector. Lower interest rates translate into more affordable home loans, encouraging first-time buyers and investors alike to explore bigger and premium homes. Mid-range and high-end segments will also benefit as buyers feel more confident making long-term commitments. At the same time, the change in stance to being ‘accommodative,’ supports steady decision-making for both developers and homebuyers, reigniting buyer sentiment and boosting overall housing demand. Additionally, with ongoing economic uncertainties in the US and other global markets, many NRIs are turning their attention to their home land . A repo rate cut is likely to further strengthen this trend, as more NRIs see real estate in India as a stable and attractive investment opportunity. This could lead to a significant uptick in NRI-driven investments across the Indian real estate sector.” 12:58 | April 9, 2025RBI MPC 2025 Live: Madhavi Arora, Chief Economist, Emkay Global Financial Services.RBI MPC: Keeping the guards ready✓RBI’s unanimous 25bps rate cut and stance change to “accommodative” reflect the uncertain global environment and benign inflation environment; the change in stance provides a directional easing bias going forward.Given global volatility and uncertainty, the MPC chose not to frontload all its actions and thus kept its powder dry for rainier days.The fluid global dynamics will require RBI to be nimble in managing any risk of tighter financial conditions, especially as the shock to sentiment/capital flows will likely require higher risk premia from EMs.The RBI may want to keep ammunitions ready, given fluid global markets, apart from conventional easing.Options like (i) non-conventional easing in the form of easier regulatory (lending) norms, (ii) lower daily CRR maintainance requirement for banks to sub 90%, (ii) sterilised INR management, etc. may be used, if needed.✓ One does not know the extent to which this global trade war could stretch. Monetary policy may have to do the heavy lifting in India by being more counter-cyclical than fiscal this year.While June 25bps cut is a given, we no longer rule out another 25-50bp cut from there, which could take the terminal rate to 5.25% in this cycle – of course contingent on the extent of the global slowdown/recession✓ While the 20bp growth downgrade by the RBI to 6.5% for FY26 reflects the uncertain global environment, we think there would be material downward risk to their growth forecast – to the tune of ~50-70bps. This would emanate from a much higher risk of a US/global recession if these global tariffs are maintained, while domestic private economic agents stay largely absent.✓We reckon with the RBI that FY26 inflation would have a net disinflationary impulse (CPI revised down 20bps to 4%) which could emanate from lower global commodity prices/supply glut of goods.China’s survival response to massive tariff blow will matter for India, amid its excess industrial capacity and dumping in the world/Asia and use of FX as a policy tool. **RBI MPC 2025 Live: Madhavi Arora, Chief Economist, Emkay Global Financial Services.** RBI MPC: Keeping the guards ready ✓RBI’s unanimous 25bps rate cut and stance change to “accommodative” reflect the uncertain global environment and benign inflation environment; the change in stance provides a directional easing bias going forward. Given global volatility and uncertainty, the MPC chose not to frontload all its actions and thus kept its powder dry for rainier days. The fluid global dynamics will require RBI to be nimble in managing any risk of tighter financial conditions, especially as the shock to sentiment/capital flows will likely require higher risk premia from EMs. The RBI may want to keep ammunitions ready, given fluid global markets, apart from conventional easing. Options like (i) non-conventional easing in the form of easier regulatory (lending) norms, (ii) lower daily CRR maintainance requirement for banks to sub 90%, (ii) sterilised INR management, etc. may be used, if needed. ✓ One does not know the extent to which this global trade war could stretch. Monetary policy may have to do the heavy lifting in India by being more counter-cyclical than fiscal this year. While June 25bps cut is a given, we no longer rule out another 25-50bp cut from there, which could take the terminal rate to 5.25% in this cycle – of course contingent on the extent of the global slowdown/recession ✓ While the 20bp growth downgrade by the RBI to 6.5% for FY26 reflects the uncertain global environment, we think there would be material downward risk to their growth forecast – to the tune of ~50-70bps. This would emanate from a much higher risk of a US/global recession if these global tariffs are maintained, while domestic private economic agents stay largely absent. ✓We reckon with the RBI that FY26 inflation would have a net disinflationary impulse (CPI revised down 20bps to 4%) which could emanate from lower global commodity prices/supply glut of goods. China’s survival response to massive tariff blow will matter for India, amid its excess industrial capacity and dumping in the world/Asia and use of FX as a policy tool. **RBI MPC 2025 Live: Madhavi Arora, Chief Economist, Emkay Global Financial Services.** RBI MPC: Keeping the guards ready ✓RBI’s unanimous 25bps rate cut and stance change to “accommodative” reflect the uncertain global environment and benign inflation environment; the change in stance provides a directional easing bias going forward. Given global volatility and uncertainty, the MPC chose not to frontload all its actions and thus kept its powder dry for rainier days. The fluid global dynamics will require RBI to be nimble in managing any risk of tighter financial conditions, especially as the shock to sentiment/capital flows will likely require higher risk premia from EMs. The RBI may want to keep ammunitions ready, given fluid global markets, apart from conventional easing. Options like (i) non-conventional easing in the form of easier regulatory (lending) norms, (ii) lower daily CRR maintainance requirement for banks to sub 90%, (ii) sterilised INR management, etc. may be used, if needed. ✓ One does not know the extent to which this global trade war could stretch. Monetary policy may have to do the heavy lifting in India by being more counter-cyclical than fiscal this year. While June 25bps cut is a given, we no longer rule out another 25-50bp cut from there, which could take the terminal rate to 5.25% in this cycle – of course contingent on the extent of the global slowdown/recession ✓ While the 20bp growth downgrade by the RBI to 6.5% for FY26 reflects the uncertain global environment, we think there would be material downward risk to their growth forecast – to the tune of ~50-70bps. This would emanate from a much higher risk of a US/global recession if these global tariffs are maintained, while domestic private economic agents stay largely absent. ✓We reckon with the RBI that FY26 inflation would have a net disinflationary impulse (CPI revised down 20bps to 4%) which could emanate from lower global commodity prices/supply glut of goods. China’s survival response to massive tariff blow will matter for India, amid its excess industrial capacity and dumping in the world/Asia and use of FX as a policy tool. 12:58 | April 9, 2025RBI MPC Live Updates: Siddharth Chaudhary, Senior Fund Manager - Fixed Income, Bajaj Finserv AMC.“MPC has delivered almost everything that was anticipated by the market. A 25 bps rate cut and change of policy stance to accommodative are welcome steps. FY 25 growth and inflation projection have been revised downwards by 20 bps to 6.5% and 4%, respectively. Dissipating food inflation, falling crude and uncertainty related to global growth environment seem to have led to this decision. On liquidity though, there is no fresh announcement but there is an assurance on liquidity provision as and when required.” **RBI MPC Live Updates: Siddharth Chaudhary, Senior Fund Manager - Fixed Income, Bajaj Finserv AMC.** “MPC has delivered almost everything that was anticipated by the market. A 25 bps rate cut and change of policy stance to accommodative are welcome steps. FY 25 growth and inflation projection have been revised downwards by 20 bps to 6.5% and 4%, respectively. Dissipating food inflation, falling crude and uncertainty related to global growth environment seem to have led to this decision. On liquidity though, there is no fresh announcement but there is an assurance on liquidity provision as and when required.” **RBI MPC Live Updates: Siddharth Chaudhary, Senior Fund Manager - Fixed Income, Bajaj Finserv AMC.** “MPC has delivered almost everything that was anticipated by the market. A 25 bps rate cut and change of policy stance to accommodative are welcome steps. FY 25 growth and inflation projection have been revised downwards by 20 bps to 6.5% and 4%, respectively. Dissipating food inflation, falling crude and uncertainty related to global growth environment seem to have led to this decision. On liquidity though, there is no fresh announcement but there is an assurance on liquidity provision as and when required.” 12:57 | April 9, 2025RBI MPC Live Updates: Satish Chandra Aluri, Lemonn Markets DeskThe outcome of the RBI meeting was largely in line with expectations, with a unanimous decision to cut the repo rate by 25 basis points to 6%. In a notable move, the Monetary Policy Committee (MPC) also shifted its stance from ‘neutral’ to ‘accommodative’, signaling the possibility of further rate cuts in the coming months.Forecast revisions further reinforced this shift in priorities. GDP growth for FY26 has been revised downward from 6.7% to 6.5%, while inflation expectations have been eased from 4.2% to 4%. This suggests that the RBI is placing greater emphasis on supporting growth, particularly in the face of rising external risks such as global trade tensions, while remaining confident that inflation will stay within manageable levels.Overall, the message is clear: the RBI is now more focused on its growth mandate. Given the current macroeconomic backdrop, we expect an additional 50–75 basis points of rate cuts in FY26, contingent on how the global trade situation evolves. **RBI MPC Live Updates: Satish Chandra Aluri, Lemonn Markets Desk** The outcome of the RBI meeting was largely in line with expectations, with a unanimous decision to cut the repo rate by 25 basis points to 6%. In a notable move, the Monetary Policy Committee (MPC) also shifted its stance from ‘neutral’ to ‘accommodative’, signaling the possibility of further rate cuts in the coming months. Forecast revisions further reinforced this shift in priorities. GDP growth for FY26 has been revised downward from 6.7% to 6.5%, while inflation expectations have been eased from 4.2% to 4%. This suggests that the RBI is placing greater emphasis on supporting growth, particularly in the face of rising external risks such as global trade tensions, while remaining confident that inflation will stay within manageable levels. Overall, the message is clear: the RBI is now more focused on its growth mandate. Given the current macroeconomic backdrop, we expect an additional 50–75 basis points of rate cuts in FY26, contingent on how the global trade situation evolves. **RBI MPC Live Updates: Satish Chandra Aluri, Lemonn Markets Desk** The outcome of the RBI meeting was largely in line with expectations, with a unanimous decision to cut the repo rate by 25 basis points to 6%. In a notable move, the Monetary Policy Committee (MPC) also shifted its stance from ‘neutral’ to ‘accommodative’, signaling the possibility of further rate cuts in the coming months. Forecast revisions further reinforced this shift in priorities. GDP growth for FY26 has been revised downward from 6.7% to 6.5%, while inflation expectations have been eased from 4.2% to 4%. This suggests that the RBI is placing greater emphasis on supporting growth, particularly in the face of rising external risks such as global trade tensions, while remaining confident that inflation will stay within manageable levels. Overall, the message is clear: the RBI is now more focused on its growth mandate. Given the current macroeconomic backdrop, we expect an additional 50–75 basis points of rate cuts in FY26, contingent on how the global trade situation evolves. 12:57 | April 9, 2025RBI MPC announcement from Shri Binod Kumar, MD & CEO of Indian Bank for your reference.Shri Binod Kumar, MD & CEO, Indian Bank:The RBI’s 25 basis points reduction in the repo rate to 6% is a timely intervention. Change in stance to accommodative is sentimentally positive, allowing room for better liquidity and growth. Together, they will support both MSME and retail demand. The MSME sector which contributes nearly 30% to India’s GDP and accounts for over 40% of exports, will benefit from this move as it will ease credit costs and improve cash flows, which are critical for recovery and growth in the evolving market dynamics. We foresee improved credit appetite at Indian Bank as MSMEs form a vital part of our lending portfolio. Increasing scope of colending will further strengthen lending to these sectors.This cut is likely to spur demand for home, auto, and personal loans, especially in tier 2 and tier 3 markets, where interest sensitivity is higher. Retail loans grew over 18% YoY as per recent trends and a lower rate environment could further accelerate consumption and support economic momentum. Indian Bank is fully geared to pass on the benefits swiftly and responsibly to our customers, ensuring inclusive credit growth. **RBI MPC announcement from Shri Binod Kumar, MD & CEO of Indian Bank for your reference.** Shri Binod Kumar, MD & CEO, Indian Bank: The RBI’s 25 basis points reduction in the repo rate to 6% is a timely intervention. Change in stance to accommodative is sentimentally positive, allowing room for better liquidity and growth. Together, they will support both MSME and retail demand. The MSME sector which contributes nearly 30% to India’s GDP and accounts for over 40% of exports, will benefit from this move as it will ease credit costs and improve cash flows, which are critical for recovery and growth in the evolving market dynamics. We foresee improved credit appetite at Indian Bank as MSMEs form a vital part of our lending portfolio. Increasing scope of colending will further strengthen lending to these sectors. This cut is likely to spur demand for home, auto, and personal loans, especially in tier 2 and tier 3 markets, where interest sensitivity is higher. Retail loans grew over 18% YoY as per recent trends and a lower rate environment could further accelerate consumption and support economic momentum. Indian Bank is fully geared to pass on the benefits swiftly and responsibly to our customers, ensuring inclusive credit growth. **RBI MPC announcement from Shri Binod Kumar, MD & CEO of Indian Bank for your reference.** Shri Binod Kumar, MD & CEO, Indian Bank: The RBI’s 25 basis points reduction in the repo rate to 6% is a timely intervention. Change in stance to accommodative is sentimentally positive, allowing room for better liquidity and growth. Together, they will support both MSME and retail demand. The MSME sector which contributes nearly 30% to India’s GDP and accounts for over 40% of exports, will benefit from this move as it will ease credit costs and improve cash flows, which are critical for recovery and growth in the evolving market dynamics. We foresee improved credit appetite at Indian Bank as MSMEs form a vital part of our lending portfolio. Increasing scope of colending will further strengthen lending to these sectors. This cut is likely to spur demand for home, auto, and personal loans, especially in tier 2 and tier 3 markets, where interest sensitivity is higher. Retail loans grew over 18% YoY as per recent trends and a lower rate environment could further accelerate consumption and support economic momentum. Indian Bank is fully geared to pass on the benefits swiftly and responsibly to our customers, ensuring inclusive credit growth. 12:56 | April 9, 2025RBI MPC 2025 Live Updates: Anitha Rangan, Economist, Equirus Securities, on RBI MPC’s rate cutRBI policy – A rate cut as expected, stance change to “accommodation” – growth support all the way.RBI as expected announced a 25 bp rate cut announcement, the second rate cut after the first one in Feb’25, taking repo to 6%. Alongside the stance change to “Accommodation” from “Neutral”. Furthermore, there was a clear message from the governor that the change in stance signaled ‘status quo’ or ‘rate cut’. In addition, with the message that growth inflation trajectory demands monetary policy to be growth supportive – RBI’s path ahead is likely to followed by rate cuts.While lowering growth estimates by 20 bp for FY26 to 6.5%, and inflation estimates also by 20 bp to 4%, clearly there is more support for growth amidst global uncertainties. While acknowledging that the global outlook is clouded with tariff uncertainties, it appears that RBI is more inclined to support growth. Domestic inflation has downside from crude prices and positive drivers from food inflation. While there is risk from imported inflation from currency, inflation is not as much of a concern as much as growth. Overall, the trajectory, despite being guarded has tilted towards a growth-inflation balance from inflation-growth in the previous regime, with a clear emphasis on supporting growth.While there is unknown from tariffs, another unknown is always the weather. While governor acknowledged that tariff related uncertainties are very high, if India is able to manage with lesser dent on inflation, then we can expect more rate cuts down the line. **RBI MPC 2025 Live Updates: Anitha Rangan, Economist, Equirus Securities, on RBI MPC’s rate cut** RBI policy – A rate cut as expected, stance change to “accommodation” – growth support all the way. RBI as expected announced a 25 bp rate cut announcement, the second rate cut after the first one in Feb’25, taking repo to 6%. Alongside the stance change to “Accommodation” from “Neutral”. Furthermore, there was a clear message from the governor that the change in stance signaled ‘status quo’ or ‘rate cut’. In addition, with the message that growth inflation trajectory demands monetary policy to be growth supportive – RBI’s path ahead is likely to followed by rate cuts. While lowering growth estimates by 20 bp for FY26 to 6.5%, and inflation estimates also by 20 bp to 4%, clearly there is more support for growth amidst global uncertainties. While acknowledging that the global outlook is clouded with tariff uncertainties, it appears that RBI is more inclined to support growth. Domestic inflation has downside from crude prices and positive drivers from food inflation. While there is risk from imported inflation from currency, inflation is not as much of a concern as much as growth. Overall, the trajectory, despite being guarded has tilted towards a growth-inflation balance from inflation-growth in the previous regime, with a clear emphasis on supporting growth. While there is unknown from tariffs, another unknown is always the weather. While governor acknowledged that tariff related uncertainties are very high, if India is able to manage with lesser dent on inflation, then we can expect more rate cuts down the line. **RBI MPC 2025 Live Updates: Anitha Rangan, Economist, Equirus Securities, on RBI MPC’s rate cut** RBI policy – A rate cut as expected, stance change to “accommodation” – growth support all the way. RBI as expected announced a 25 bp rate cut announcement, the second rate cut after the first one in Feb’25, taking repo to 6%. Alongside the stance change to “Accommodation” from “Neutral”. Furthermore, there was a clear message from the governor that the change in stance signaled ‘status quo’ or ‘rate cut’. In addition, with the message that growth inflation trajectory demands monetary policy to be growth supportive – RBI’s path ahead is likely to followed by rate cuts. While lowering growth estimates by 20 bp for FY26 to 6.5%, and inflation estimates also by 20 bp to 4%, clearly there is more support for growth amidst global uncertainties. While acknowledging that the global outlook is clouded with tariff uncertainties, it appears that RBI is more inclined to support growth. Domestic inflation has downside from crude prices and positive drivers from food inflation. While there is risk from imported inflation from currency, inflation is not as much of a concern as much as growth. Overall, the trajectory, despite being guarded has tilted towards a growth-inflation balance from inflation-growth in the previous regime, with a clear emphasis on supporting growth. While there is unknown from tariffs, another unknown is always the weather. While governor acknowledged that tariff related uncertainties are very high, if India is able to manage with lesser dent on inflation, then we can expect more rate cuts down the line. 12:56 | April 9, 2025RBI MPC Live Updates: Quote by Mr. Tarun Singh Founder & MD, Highbrow SecuritiesThe RBI’s recent 25-basis-point rate cut, bringing the repo rate to 6%, is more than just a monetary policy adjustment; it’s a calculated gamble on India’s ability to defy global headwinds through the sheer force of domestic demand. The central bank’s decision to revise FY26 GDP growth projections downward from 6.7% to 6.5% reflects realism, acknowledging that domestic demand alone may not be enough to offset external drags. Yet, with global trade fragmenting, export growth uncertain, and capital flows volatile, the economy has no choice except to double down on its most reliable engine: the Indian consumer. This isn’t just about lowering interest rates; it’s about reorienting the entire financial system to fuel consumption-led growth without leaving households and businesses drowning in debt.Financial institutions must move beyond passive rate transmission and actively shape lending toward high-impact sectors. Affordable housing, rural consumption, and small-business credit aren’t just growth drivers they’re lifelines for broader economic resilience. The focus should be on productive lending that boosts incomes, rather than merely spending. For instance, financing agri-tech startups that raise farm productivity puts more money in rural pockets, which then flows into FMCG, autos, and durables. Similarly, supporting MSMEs in tier-2 and tier-3 cities creates jobs that sustain urban consumption. This isn’t trickle-down economics; it’s a direct pipeline from credit to income to demand.But there’s a catch: inflation and currency risks loom large. A consumption surge that relies on imported goods such as electronics or energy could backfire by widening the trade deficit and pressuring the rupee. The solution lies in targeting credit at sectors that stimulate local production renewable energy, food processing, and manufacturing to keep demand leakage in check. Banks must also avoid the trap of reckless retail lending, where easy EMIs today become NPAs tomorrow.The path forward demands precision. Fiscal policy must complement monetary easing think tax cuts for middle-income earners, better supply chains to curb food inflation, and incentives for domestic manufacturing. If executed right, India’s consumption story won’t just offset global drags; it could redefine emerging-market resilience. But if mishandled, we risk repeating the boom-bust cycles of the past. The RBI has fired the starting gun. Now, lenders and policymakers must run the race with discipline. **RBI MPC Live Updates: Quote by Mr. Tarun Singh Founder & MD, Highbrow Securities** The RBI’s recent 25-basis-point rate cut, bringing the repo rate to 6%, is more than just a monetary policy adjustment; it’s a calculated gamble on India’s ability to defy global headwinds through the sheer force of domestic demand. The central bank’s decision to revise FY26 GDP growth projections downward from 6.7% to 6.5% reflects realism, acknowledging that domestic demand alone may not be enough to offset external drags. Yet, with global trade fragmenting, export growth uncertain, and capital flows volatile, the economy has no choice except to double down on its most reliable engine: the Indian consumer. This isn’t just about lowering interest rates; it’s about reorienting the entire financial system to fuel consumption-led growth without leaving households and businesses drowning in debt. Financial institutions must move beyond passive rate transmission and actively shape lending toward high-impact sectors. Affordable housing, rural consumption, and small-business credit aren’t just growth drivers they’re lifelines for broader economic resilience. The focus should be on productive lending that boosts incomes, rather than merely spending. For instance, financing agri-tech startups that raise farm productivity puts more money in rural pockets, which then flows into FMCG, autos, and durables. Similarly, supporting MSMEs in tier-2 and tier-3 cities creates jobs that sustain urban consumption. This isn’t trickle-down economics; it’s a direct pipeline from credit to income to demand. But there’s a catch: inflation and currency risks loom large. A consumption surge that relies on imported goods such as electronics or energy could backfire by widening the trade deficit and pressuring the rupee. The solution lies in targeting credit at sectors that stimulate local production renewable energy, food processing, and manufacturing to keep demand leakage in check. Banks must also avoid the trap of reckless retail lending, where easy EMIs today become NPAs tomorrow. The path forward demands precision. Fiscal policy must complement monetary easing think tax cuts for middle-income earners, better supply chains to curb food inflation, and incentives for domestic manufacturing. If executed right, India’s consumption story won’t just offset global drags; it could redefine emerging-market resilience. But if mishandled, we risk repeating the boom-bust cycles of the past. The RBI has fired the starting gun. Now, lenders and policymakers must run the race with discipline. **RBI MPC Live Updates: Quote by Mr. Tarun Singh Founder & MD, Highbrow Securities** The RBI’s recent 25-basis-point rate cut, bringing the repo rate to 6%, is more than just a monetary policy adjustment; it’s a calculated gamble on India’s ability to defy global headwinds through the sheer force of domestic demand. The central bank’s decision to revise FY26 GDP growth projections downward from 6.7% to 6.5% reflects realism, acknowledging that domestic demand alone may not be enough to offset external drags. Yet, with global trade fragmenting, export growth uncertain, and capital flows volatile, the economy has no choice except to double down on its most reliable engine: the Indian consumer. This isn’t just about lowering interest rates; it’s about reorienting the entire financial system to fuel consumption-led growth without leaving households and businesses drowning in debt. Financial institutions must move beyond passive rate transmission and actively shape lending toward high-impact sectors. Affordable housing, rural consumption, and small-business credit aren’t just growth drivers they’re lifelines for broader economic resilience. The focus should be on productive lending that boosts incomes, rather than merely spending. For instance, financing agri-tech startups that raise farm productivity puts more money in rural pockets, which then flows into FMCG, autos, and durables. Similarly, supporting MSMEs in tier-2 and tier-3 cities creates jobs that sustain urban consumption. This isn’t trickle-down economics; it’s a direct pipeline from credit to income to demand. But there’s a catch: inflation and currency risks loom large. A consumption surge that relies on imported goods such as electronics or energy could backfire by widening the trade deficit and pressuring the rupee. The solution lies in targeting credit at sectors that stimulate local production renewable energy, food processing, and manufacturing to keep demand leakage in check. Banks must also avoid the trap of reckless retail lending, where easy EMIs today become NPAs tomorrow. The path forward demands precision. Fiscal policy must complement monetary easing think tax cuts for middle-income earners, better supply chains to curb food inflation, and incentives for domestic manufacturing. If executed right, India’s consumption story won’t just offset global drags; it could redefine emerging-market resilience. But if mishandled, we risk repeating the boom-bust cycles of the past. The RBI has fired the starting gun. Now, lenders and policymakers must run the race with discipline. 12:53 | April 9, 2025RBI Guv: Banking sector’s financials are strong **RBI Guv: Banking sector’s financials are strong** **RBI Guv: Banking sector’s financials are strong** 12:48 | April 9, 2025All the MPC members were unanimous in moving to a accommodative stance **All the MPC members were unanimous in moving to a accommodative stance** **All the MPC members were unanimous in moving to a accommodative stance** 12:45 | April 9, 2025Dy Guv Swaminathan: we will ensure that customers money is protected when regulated entities get into troubleIf there are lapses, they will be dealt with accordingly. We will ensure that there is no loss or inconvenience to the customer **Dy Guv Swaminathan: we will ensure that customers money is protected when regulated entities get into trouble** If there are lapses, they will be dealt with accordingly. We will ensure that there is no loss or inconvenience to the customer **Dy Guv Swaminathan: we will ensure that customers money is protected when regulated entities get into trouble** If there are lapses, they will be dealt with accordingly. We will ensure that there is no loss or inconvenience to the customer 12:44 | April 9, 2025Our efforts is to minimise such episodes, their impact **Our efforts is to minimise such episodes, their impact** **Our efforts is to minimise such episodes, their impact** 12:44 | April 9, 2025Episodes of financial institution getitng into trouble (I will not call them failures) will happen **Episodes of financial institution getitng into trouble (I will not call them failures) will happen** **Episodes of financial institution getitng into trouble (I will not call them failures) will happen** 12:44 | April 9, 2025Our effort is to minimise the impact of “episodes” in banks and NBFCs **Our effort is to minimise the impact of “episodes” in banks and NBFCs** **Our effort is to minimise the impact of “episodes” in banks and NBFCs** 12:41 | April 9, 2025RBI Gov: At a system level - whether it is co-op banks, NBFCs or scheduled banks - we are safe, secure, resilient **RBI Gov: At a system level - whether it is co-op banks, NBFCs or scheduled banks - we are safe, secure, resilient** **RBI Gov: At a system level - whether it is co-op banks, NBFCs or scheduled banks - we are safe, secure, resilient** 12:39 | April 9, 2025MuleHunter pilot successful in large banks **MuleHunter pilot successful in large banks** **MuleHunter pilot successful in large banks** 12:38 | April 9, 2025Dy Guv Swaminathan: digital frauds has been a major concern; asked banks to ensure fraud risk management is strengthened **Dy Guv Swaminathan: digital frauds has been a major concern; asked banks to ensure fraud risk management is strengthened** **Dy Guv Swaminathan: digital frauds has been a major concern; asked banks to ensure fraud risk management is strengthened** 12:37 | April 9, 2025RBI Gov on KYC requirements: Aim is to ease the process, but it is not easy to implement **RBI Gov on KYC requirements: Aim is to ease the process, but it is not easy to implement** **RBI Gov on KYC requirements: Aim is to ease the process, but it is not easy to implement** 12:35 | April 9, 2025RBI Gov on KYC requirements: Aim is to ease the process, but it is not easy to implement **RBI Gov on KYC requirements: Aim is to ease the process, but it is not easy to implement** **RBI Gov on KYC requirements: Aim is to ease the process, but it is not easy to implement** 12:33 | April 9, 2025To ensure that borrower gets the benefit **To ensure that borrower gets the benefit** **To ensure that borrower gets the benefit** 12:33 | April 9, 2025It has been a beneficial arrangement for the market **It has been a beneficial arrangement for the market** **It has been a beneficial arrangement for the market** 12:33 | April 9, 2025Dy Guv Swaminathan: no change in stance on co-lending **Dy Guv Swaminathan: no change in stance on co-lending** **Dy Guv Swaminathan: no change in stance on co-lending** 12:33 | April 9, 2025Two banks can also enter into Co-lending arrangement **Two banks can also enter into Co-lending arrangement** **Two banks can also enter into Co-lending arrangement** 12:33 | April 9, 2025RBI Gov on co-lending: Expanding co-lending arrangements wider to more participants for better rates for borrowers **RBI Gov on co-lending: Expanding co-lending arrangements wider to more participants for better rates for borrowers** **RBI Gov on co-lending: Expanding co-lending arrangements wider to more participants for better rates for borrowers** 12:31 | April 9, 2025Co-lending arrangement has helped in priority sector lending **Co-lending arrangement has helped in priority sector lending** **Co-lending arrangement has helped in priority sector lending** 12:29 | April 9, 2025Our currency is quite stable, we have sufficient reserves **Our currency is quite stable, we have sufficient reserves** **Our currency is quite stable, we have sufficient reserves** 12:27 | April 9, 2025RBI Gov: We do not target any currency level... but any excessive volatility if it occurs, we will not be found wanting **RBI Gov: We do not target any currency level... but any excessive volatility if it occurs, we will not be found wanting** **RBI Gov: We do not target any currency level... but any excessive volatility if it occurs, we will not be found wanting** 12:26 | April 9, 2025We have comparative advantage on tariffs vis-a-vis other countries, but the tariffs are certainly a growth dampener **We have comparative advantage on tariffs vis-a-vis other countries, but the tariffs are certainly a growth dampener** **We have comparative advantage on tariffs vis-a-vis other countries, but the tariffs are certainly a growth dampener** 12:26 | April 9, 2025The impact of tariffs on India is much lessRBI Gov on currency management: Impact of tariffs on India vis a vis some of the others, is much less. We are better placed than some of the other countries **The impact of tariffs on India is much less** RBI Gov on currency management: Impact of tariffs on India vis a vis some of the others, is much less. We are better placed than some of the other countries **The impact of tariffs on India is much less** RBI Gov on currency management: Impact of tariffs on India vis a vis some of the others, is much less. We are better placed than some of the other countries 12:24 | April 9, 2025We would like the transmission to happen as quickly as possible, but it should not be disruptive **We would like the transmission to happen as quickly as possible, but it should not be disruptive** **We would like the transmission to happen as quickly as possible, but it should not be disruptive** 12:23 | April 9, 2025RBI Gov on transmission: Rate transmission should be done as quickly as possible but should not be disruptive **RBI Gov on transmission: Rate transmission should be done as quickly as possible but should not be disruptive** **RBI Gov on transmission: Rate transmission should be done as quickly as possible but should not be disruptive** 12:22 | April 9, 2025RBI Gov on liquidity framework:Looking at overnight rate in the money market and whether it should continue to remain the same fir purpose of transmission of rate or should be targeting something else. That is something we are consulting **RBI Gov on liquidity framework:** Looking at overnight rate in the money market and whether it should continue to remain the same fir purpose of transmission of rate or should be targeting something else. That is something we are consulting **RBI Gov on liquidity framework:** Looking at overnight rate in the money market and whether it should continue to remain the same fir purpose of transmission of rate or should be targeting something else. That is something we are consulting 12:20 | April 9, 2025Surplus will be maintained at around 1 pc of banking systems deposits to ensure rate cut transmission **Surplus will be maintained at around 1 pc of banking systems deposits to ensure rate cut transmission** **Surplus will be maintained at around 1 pc of banking systems deposits to ensure rate cut transmission** 12:19 | April 9, 2025No tightening of guidelines on gold loansRBI Gov on gold loan regulations: I have not said anything about tightening, it is rationalisation and harmonisation on the conduct side **No tightening of guidelines on gold loans** RBI Gov on gold loan regulations: I have not said anything about tightening, it is rationalisation and harmonisation on the conduct side **No tightening of guidelines on gold loans** RBI Gov on gold loan regulations: I have not said anything about tightening, it is rationalisation and harmonisation on the conduct side 12:18 | April 9, 2025The differential in risk weight between unsecured and secured loans restored to 25% **The differential in risk weight between unsecured and secured loans restored to 25%** **The differential in risk weight between unsecured and secured loans restored to 25%** 12:17 | April 9, 2025RBI Gov on personal loans: There should be some difference in risk weights between secured and unsecured personal loans **RBI Gov on personal loans: There should be some difference in risk weights between secured and unsecured personal loans** **RBI Gov on personal loans: There should be some difference in risk weights between secured and unsecured personal loans** 12:15 | April 9, 2025RBI Gov on personal loans: no concerns there, systems are robust **RBI Gov on personal loans: no concerns there, systems are robust** **RBI Gov on personal loans: no concerns there, systems are robust** 12:14 | April 9, 2025I’m Sanjay but I am not Sanjay of Mahabharat to see where the rate will be **I’m Sanjay but I am not Sanjay of Mahabharat to see where the rate will be** **I’m Sanjay but I am not Sanjay of Mahabharat to see where the rate will be** 12:13 | April 9, 2025Joint effort of RBI and Govt to support the economy **Joint effort of RBI and Govt to support the economy** **Joint effort of RBI and Govt to support the economy** 12:13 | April 9, 2025RBI Gov on credit-deposit ratio: the banks have to be mindful of AL management, so there are no liquidity related issues **RBI Gov on credit-deposit ratio: the banks have to be mindful of AL management, so there are no liquidity related issues** **RBI Gov on credit-deposit ratio: the banks have to be mindful of AL management, so there are no liquidity related issues** 12:13 | April 9, 2025Banks have to be mindful of managing asset liability and liquidity **Banks have to be mindful of managing asset liability and liquidity** **Banks have to be mindful of managing asset liability and liquidity** 12:12 | April 9, 2025RBI Gov on credit-deposit ratio: we do not have any prescription of a C-D ratio. However, we have regulation for asset liability management, liquidity management **RBI Gov on credit-deposit ratio: we do not have any prescription of a C-D ratio. However, we have regulation for asset liability management, liquidity management** **RBI Gov on credit-deposit ratio: we do not have any prescription of a C-D ratio. However, we have regulation for asset liability management, liquidity management** 12:12 | April 9, 2025Credit-Deposit ratio: no regulation for this **Credit-Deposit ratio: no regulation for this** **Credit-Deposit ratio: no regulation for this** 12:09 | April 9, 2025RBI Gov on liquidity: The aim is really to look at the policy rate; transmission will not happen immediately **RBI Gov on liquidity: The aim is really to look at the policy rate; transmission will not happen immediately** **RBI Gov on liquidity: The aim is really to look at the policy rate; transmission will not happen immediately** 12:09 | April 9, 2025RBI Gov on liquidity: Do not want to give a specific number on the surplus **RBI Gov on liquidity: Do not want to give a specific number on the surplus** **RBI Gov on liquidity: Do not want to give a specific number on the surplus** 12:08 | April 9, 2025RBI Gov on liquidity: we will provide sufficient liquidity for rate transmission **RBI Gov on liquidity: we will provide sufficient liquidity for rate transmission** **RBI Gov on liquidity: we will provide sufficient liquidity for rate transmission** 12:07 | April 9, 2025RBI Gov on policy rate: we have changed stance to accommodative, so the trend is going to be downward **RBI Gov on policy rate: we have changed stance to accommodative, so the trend is going to be downward** **RBI Gov on policy rate: we have changed stance to accommodative, so the trend is going to be downward** 12:05 | April 9, 2025More than inflation we are concerned about the tariff impact on growth **More than inflation we are concerned about the tariff impact on growth** **More than inflation we are concerned about the tariff impact on growth** 12:05 | April 9, 2025RBI Gov on tariffs: We have reduced India growth rate **RBI Gov on tariffs: We have reduced India growth rate** **RBI Gov on tariffs: We have reduced India growth rate** 12:04 | April 9, 2025RBI Gov on tariffs: Most global growth rate forecasts have come down **RBI Gov on tariffs: Most global growth rate forecasts have come down** **RBI Gov on tariffs: Most global growth rate forecasts have come down** 11:54 | April 9, 2025RBI MPC Live Updates: Ashwini Shami, Executive Vice President & Portfolio Manager, Omniscience Capital on RBI Policy.Indian Economy Poised for Expansion as RBI Supports Growth“Amid global tariff uncertainties, with the U.S. economy grappling with inflationary pressures and recessionary concerns, the RBI’s rate cut signals confidence in India’s stable inflation outlook—a positive for overall consumption. Beyond consumer goods, lower borrowing costs are expected to provide a significant boost to housing finance.The RBI’s accommodative stance also indicates a conducive environment for private capital investments, enabling businesses to expand capacity and capture growth opportunities. This is particularly beneficial for Indian enterprises looking to strengthen their domestic presence and explore emerging global opportunities arising from the ongoing tariff war.” **RBI MPC Live Updates: Ashwini Shami, Executive Vice President & Portfolio Manager, Omniscience Capital on RBI Policy.** Indian Economy Poised for Expansion as RBI Supports Growth “Amid global tariff uncertainties, with the U.S. economy grappling with inflationary pressures and recessionary concerns, the RBI’s rate cut signals confidence in India’s stable inflation outlook—a positive for overall consumption. Beyond consumer goods, lower borrowing costs are expected to provide a significant boost to housing finance. The RBI’s accommodative stance also indicates a conducive environment for private capital investments, enabling businesses to expand capacity and capture growth opportunities. This is particularly beneficial for Indian enterprises looking to strengthen their domestic presence and explore emerging global opportunities arising from the ongoing tariff war.” **RBI MPC Live Updates: Ashwini Shami, Executive Vice President & Portfolio Manager, Omniscience Capital on RBI Policy.** Indian Economy Poised for Expansion as RBI Supports Growth “Amid global tariff uncertainties, with the U.S. economy grappling with inflationary pressures and recessionary concerns, the RBI’s rate cut signals confidence in India’s stable inflation outlook—a positive for overall consumption. Beyond consumer goods, lower borrowing costs are expected to provide a significant boost to housing finance. The RBI’s accommodative stance also indicates a conducive environment for private capital investments, enabling businesses to expand capacity and capture growth opportunities. This is particularly beneficial for Indian enterprises looking to strengthen their domestic presence and explore emerging global opportunities arising from the ongoing tariff war.” 11:53 | April 9, 2025Sonal Varma, Managing Director and Chief Economist (India and Asia ex-Japan), Nomura.“The RBI has delivered a dovish 25bp rate cut. The combination of downgrades to its GDP growth and inflation projections and the change in stance to accommodative all reinforce that this is a dovish cut. With inflation at target, the MPC’s focus is supporting growth, amid rising downside risks to growth from US tariffs. Despite the growth forecast downgrade, the RBI’s FY26 GDP forecast of 6.5% still appears optimistic to us. We believe the combination of direct and indirect effects will result in GDP growth slowing more sharply to around 6% in FY26, and risks are skewed to the downside. Hence, we expect the rate cutting cycle to continue, with a 25bp cut each in June and August.” **Sonal Varma, Managing Director and Chief Economist (India and Asia ex-Japan), Nomura.** “The RBI has delivered a dovish 25bp rate cut. The combination of downgrades to its GDP growth and inflation projections and the change in stance to accommodative all reinforce that this is a dovish cut. With inflation at target, the MPC’s focus is supporting growth, amid rising downside risks to growth from US tariffs. Despite the growth forecast downgrade, the RBI’s FY26 GDP forecast of 6.5% still appears optimistic to us. We believe the combination of direct and indirect effects will result in GDP growth slowing more sharply to around 6% in FY26, and risks are skewed to the downside. Hence, we expect the rate cutting cycle to continue, with a 25bp cut each in June and August.” **Sonal Varma, Managing Director and Chief Economist (India and Asia ex-Japan), Nomura.** “The RBI has delivered a dovish 25bp rate cut. The combination of downgrades to its GDP growth and inflation projections and the change in stance to accommodative all reinforce that this is a dovish cut. With inflation at target, the MPC’s focus is supporting growth, amid rising downside risks to growth from US tariffs. Despite the growth forecast downgrade, the RBI’s FY26 GDP forecast of 6.5% still appears optimistic to us. We believe the combination of direct and indirect effects will result in GDP growth slowing more sharply to around 6% in FY26, and risks are skewed to the downside. Hence, we expect the rate cutting cycle to continue, with a 25bp cut each in June and August.” 11:53 | April 9, 2025Quote on RBI Monetary policy by Mr. Ajit Mishra – SVP, Research, Religare Broking Ltd“The Reserve Bank of India, in its monetary policy meeting held on April 9, 2025, announced a series of proactive steps aimed at supporting economic growth amid mounting global uncertainties and subdued inflation. The Monetary Policy Committee (MPC) unanimously decided to reduce the repo rate by 25 basis points, lowering it from 6.25% to 6.00%. Alongside the rate cut, the policy stance was shifted from neutral to accommodative, signaling the central bank’s readiness to ease further if required. This shift narrows future options to either maintaining the current rate or implementing additional cuts, depending on evolving economic conditions.In addition to the repo rate, other key policy rates were also revised. The standing deposit facility (SDF) rate was lowered to 5.75%, while both the marginal standing facility (MSF) and the bank rate were set at 6.25%. The RBI also revised its macroeconomic outlook—bringing down the inflation forecast for FY26 to 4%, and trimming the GDP growth projection from 6.7% to 6.5%, reflecting the challenges posed by the global economic environment.This decision comes on the back of a sustained moderation in retail inflation. In February 2025, the Consumer Price Index (CPI) fell to 3.61%, well within the central bank’s target band of 4% ± 2%. The drop in inflation has created the necessary space for monetary easing, with the latest rate cut expected to reduce borrowing costs for both households and businesses, thereby aiding credit growth and demand revival.Overall, the RBI’s latest policy measures are aimed at preserving long-term macroeconomic stability while addressing near-term risks. By enhancing liquidity and reducing interest rates, the central bank seeks to support domestic momentum, counterbalance external shocks such as global trade disruptions and U.S. tariff actions, and create a more conducive environment for sustainable economic growth.” **Quote on RBI Monetary policy by Mr. Ajit Mishra – SVP, Research, Religare Broking Ltd** “The Reserve Bank of India, in its monetary policy meeting held on April 9, 2025, announced a series of proactive steps aimed at supporting economic growth amid mounting global uncertainties and subdued inflation. The Monetary Policy Committee (MPC) unanimously decided to reduce the repo rate by 25 basis points, lowering it from 6.25% to 6.00%. Alongside the rate cut, the policy stance was shifted from neutral to accommodative, signaling the central bank’s readiness to ease further if required. This shift narrows future options to either maintaining the current rate or implementing additional cuts, depending on evolving economic conditions. In addition to the repo rate, other key policy rates were also revised. The standing deposit facility (SDF) rate was lowered to 5.75%, while both the marginal standing facility (MSF) and the bank rate were set at 6.25%. The RBI also revised its macroeconomic outlook—bringing down the inflation forecast for FY26 to 4%, and trimming the GDP growth projection from 6.7% to 6.5%, reflecting the challenges posed by the global economic environment. This decision comes on the back of a sustained moderation in retail inflation. In February 2025, the Consumer Price Index (CPI) fell to 3.61%, well within the central bank’s target band of 4% ± 2%. The drop in inflation has created the necessary space for monetary easing, with the latest rate cut expected to reduce borrowing costs for both households and businesses, thereby aiding credit growth and demand revival. Overall, the RBI’s latest policy measures are aimed at preserving long-term macroeconomic stability while addressing near-term risks. By enhancing liquidity and reducing interest rates, the central bank seeks to support domestic momentum, counterbalance external shocks such as global trade disruptions and U.S. tariff actions, and create a more conducive environment for sustainable economic growth.” **Quote on RBI Monetary policy by Mr. Ajit Mishra – SVP, Research, Religare Broking Ltd** “The Reserve Bank of India, in its monetary policy meeting held on April 9, 2025, announced a series of proactive steps aimed at supporting economic growth amid mounting global uncertainties and subdued inflation. The Monetary Policy Committee (MPC) unanimously decided to reduce the repo rate by 25 basis points, lowering it from 6.25% to 6.00%. Alongside the rate cut, the policy stance was shifted from neutral to accommodative, signaling the central bank’s readiness to ease further if required. This shift narrows future options to either maintaining the current rate or implementing additional cuts, depending on evolving economic conditions. In addition to the repo rate, other key policy rates were also revised. The standing deposit facility (SDF) rate was lowered to 5.75%, while both the marginal standing facility (MSF) and the bank rate were set at 6.25%. The RBI also revised its macroeconomic outlook—bringing down the inflation forecast for FY26 to 4%, and trimming the GDP growth projection from 6.7% to 6.5%, reflecting the challenges posed by the global economic environment. This decision comes on the back of a sustained moderation in retail inflation. In February 2025, the Consumer Price Index (CPI) fell to 3.61%, well within the central bank’s target band of 4% ± 2%. The drop in inflation has created the necessary space for monetary easing, with the latest rate cut expected to reduce borrowing costs for both households and businesses, thereby aiding credit growth and demand revival. Overall, the RBI’s latest policy measures are aimed at preserving long-term macroeconomic stability while addressing near-term risks. By enhancing liquidity and reducing interest rates, the central bank seeks to support domestic momentum, counterbalance external shocks such as global trade disruptions and U.S. tariff actions, and create a more conducive environment for sustainable economic growth.” 11:52 | April 9, 2025RBI MPC Live Updates: Vikram Chhabra, Senior Economist, 360 ONE Asset“The RBI cut the repo rate by 25 basis points today, as widely expected. The substantial infusion of liquidity into the banking system ahead of the decision had already signalled the central bank’s full commitment to easing financial conditions. The growth-inflation outlook had also become supportive of a shift to an ‘accommodative’ policy stance at this meeting, as recent inflation prints have surprised to the downside, while growth risks have intensified amid rising economic uncertainty. The implementation of reciprocal tariffs by the US is expected to dampen global growth and weigh heavily on export-oriented sectors. Given this backdrop, we expect the RBI to cut rates by a further 25–50 basis points in the current cycle..” **RBI MPC Live Updates: Vikram Chhabra, Senior Economist, 360 ONE Asset** “The RBI cut the repo rate by 25 basis points today, as widely expected. The substantial infusion of liquidity into the banking system ahead of the decision had already signalled the central bank’s full commitment to easing financial conditions. The growth-inflation outlook had also become supportive of a shift to an ‘accommodative’ policy stance at this meeting, as recent inflation prints have surprised to the downside, while growth risks have intensified amid rising economic uncertainty. The implementation of reciprocal tariffs by the US is expected to dampen global growth and weigh heavily on export-oriented sectors. Given this backdrop, we expect the RBI to cut rates by a further 25–50 basis points in the current cycle..” **RBI MPC Live Updates: Vikram Chhabra, Senior Economist, 360 ONE Asset** “The RBI cut the repo rate by 25 basis points today, as widely expected. The substantial infusion of liquidity into the banking system ahead of the decision had already signalled the central bank’s full commitment to easing financial conditions. The growth-inflation outlook had also become supportive of a shift to an ‘accommodative’ policy stance at this meeting, as recent inflation prints have surprised to the downside, while growth risks have intensified amid rising economic uncertainty. The implementation of reciprocal tariffs by the US is expected to dampen global growth and weigh heavily on export-oriented sectors. Given this backdrop, we expect the RBI to cut rates by a further 25–50 basis points in the current cycle..” 11:48 | April 9, 2025RBI Governor cuts repo rate by 25 bps to 6% and stance neutral to accommodative. Here is the view from Pranay Aggarwal - Director & CEO of StoxkartRBI’s 25 bps rate cut to 6% and shift to an accommodative stance signals a growth-focused policy. I view this as positive for liquidity and demand recovery. Rate-sensitive sectors like banks, NBFCs, real estate, and autos stand to gain. While banks may see some NIMs compression (Fitch estimates ~10 bps in FY26), improved credit offtake could balance it. Lower rates should boost home and vehicle loan demand. However, global headwinds—especially rising US tariffs—pose risks to export-driven sectors like IT and pharma. Overall, a supportive step for domestic growth with some caution on external pressures. **RBI Governor cuts repo rate by 25 bps to 6% and stance neutral to accommodative. Here is the view from Pranay Aggarwal - Director & CEO of Stoxkart** RBI’s 25 bps rate cut to 6% and shift to an accommodative stance signals a growth-focused policy. I view this as positive for liquidity and demand recovery. Rate-sensitive sectors like banks, NBFCs, real estate, and autos stand to gain. While banks may see some NIMs compression (Fitch estimates ~10 bps in FY26), improved credit offtake could balance it. Lower rates should boost home and vehicle loan demand. However, global headwinds—especially rising US tariffs—pose risks to export-driven sectors like IT and pharma. Overall, a supportive step for domestic growth with some caution on external pressures. **RBI Governor cuts repo rate by 25 bps to 6% and stance neutral to accommodative. Here is the view from Pranay Aggarwal - Director & CEO of Stoxkart** RBI’s 25 bps rate cut to 6% and shift to an accommodative stance signals a growth-focused policy. I view this as positive for liquidity and demand recovery. Rate-sensitive sectors like banks, NBFCs, real estate, and autos stand to gain. While banks may see some NIMs compression (Fitch estimates ~10 bps in FY26), improved credit offtake could balance it. Lower rates should boost home and vehicle loan demand. However, global headwinds—especially rising US tariffs—pose risks to export-driven sectors like IT and pharma. Overall, a supportive step for domestic growth with some caution on external pressures. 11:21 | April 9, 2025RBI MPC Live News Updates: RBI to enable securitisation of stressed assets through a market-based mechanismTheRBIintends to enable securitisation of stressed assets through a market-based mechanism, in addition to the existingARC (asset reconstruction company)route under the SARFAESI Act, 2002.RBI to enable securitisation of stressed assets through a market-based mechanismRBI introduces new securitisation framework for stressed assets, seeking public feedback to improve risk distribution and aid lenders. **RBI MPC Live News Updates: RBI to enable securitisation of stressed assets through a market-based mechanism** TheRBIintends to enable securitisation of stressed assets through a market-based mechanism, in addition to the existingARC (asset reconstruction company)route under the SARFAESI Act, 2002. **RBI to enable securitisation of stressed assets through a market-based mechanism** RBI introduces new securitisation framework for stressed assets, seeking public feedback to improve risk distribution and aid lenders. **RBI MPC Live News Updates: RBI to enable securitisation of stressed assets through a market-based mechanism** TheRBIintends to enable securitisation of stressed assets through a market-based mechanism, in addition to the existingARC (asset reconstruction company)route under the SARFAESI Act, 2002. **RBI to enable securitisation of stressed assets through a market-based mechanism** RBI introduces new securitisation framework for stressed assets, seeking public feedback to improve risk distribution and aid lenders. 11:13 | April 9, 2025RBI MPC 2025 Live: Scope of co-lending to be extended to all forms of arrangements among lenders: RBI Guv Sanjay MalhotraIn a bid to give a fillip to co-lending,RBIGovernor Sanjay Malhotra said it will not be restricted just to arrangements between banks and NBFCs for priority sector loans but to all forms of arrangements among lenders (regulated entities).Malhotra noted that the extant guidelines on co-lending are applicable only to arrangements between banks and NBFCs for priority sector loans.Scope of co-lending to be extended to all forms of arrangements among lenders: RBI Guv Sanjay MalhotraRBI Governor announces expansion of co-lending scope beyond banks and NBFCs, with draft guidelines for public feedback. **RBI MPC 2025 Live: Scope of co-lending to be extended to all forms of arrangements among lenders: RBI Guv Sanjay Malhotra** In a bid to give a fillip to co-lending,RBIGovernor Sanjay Malhotra said it will not be restricted just to arrangements between banks and NBFCs for priority sector loans but to all forms of arrangements among lenders (regulated entities). Malhotra noted that the extant guidelines on co-lending are applicable only to arrangements between banks and NBFCs for priority sector loans. **Scope of co-lending to be extended to all forms of arrangements among lenders: RBI Guv Sanjay Malhotra** RBI Governor announces expansion of co-lending scope beyond banks and NBFCs, with draft guidelines for public feedback. **RBI MPC 2025 Live: Scope of co-lending to be extended to all forms of arrangements among lenders: RBI Guv Sanjay Malhotra** In a bid to give a fillip to co-lending,RBIGovernor Sanjay Malhotra said it will not be restricted just to arrangements between banks and NBFCs for priority sector loans but to all forms of arrangements among lenders (regulated entities). Malhotra noted that the extant guidelines on co-lending are applicable only to arrangements between banks and NBFCs for priority sector loans. **Scope of co-lending to be extended to all forms of arrangements among lenders: RBI Guv Sanjay Malhotra** RBI Governor announces expansion of co-lending scope beyond banks and NBFCs, with draft guidelines for public feedback. 11:04 | April 9, 2025RBI MPC Live Updates: RBI pares GDP and retail inflation projections by 20 bps for FY26The Reserve Bank of India (RBI) has pared the real GDP and retail inflation projections by 20 basis points each for FY26.Real GDP growth for FY26 is now projected at 6.5 per cent (6.7 per cent earlier projection), with Q1 at 6.5 per cent (6.7 per cent); Q2 at 6.7 per cent (7.0 per cent); Q3 at 6.6 per cent (6.5 per cent); and Q4 at 6.3 per cent (6.5 per cent). The risks are evenly balanced.RBI MPC Meeting: RBI pares GDP & retail inflation projections by 20 bps for FY26The Reserve Bank of India (RBI) has pared the real GDP and retail inflation projections by 20 basis points each for FY26. **RBI MPC Live Updates: RBI pares GDP and retail inflation projections by 20 bps for FY26** The Reserve Bank of India (RBI) has pared the real GDP and retail inflation projections by 20 basis points each for FY26. Real GDP growth for FY26 is now projected at 6.5 per cent (6.7 per cent earlier projection), with Q1 at 6.5 per cent (6.7 per cent); Q2 at 6.7 per cent (7.0 per cent); Q3 at 6.6 per cent (6.5 per cent); and Q4 at 6.3 per cent (6.5 per cent). The risks are evenly balanced. **RBI MPC Meeting: RBI pares GDP & retail inflation projections by 20 bps for FY26** The Reserve Bank of India (RBI) has pared the real GDP and retail inflation projections by 20 basis points each for FY26. **RBI MPC Live Updates: RBI pares GDP and retail inflation projections by 20 bps for FY26** The Reserve Bank of India (RBI) has pared the real GDP and retail inflation projections by 20 basis points each for FY26. Real GDP growth for FY26 is now projected at 6.5 per cent (6.7 per cent earlier projection), with Q1 at 6.5 per cent (6.7 per cent); Q2 at 6.7 per cent (7.0 per cent); Q3 at 6.6 per cent (6.5 per cent); and Q4 at 6.3 per cent (6.5 per cent). The risks are evenly balanced. **RBI MPC Meeting: RBI pares GDP & retail inflation projections by 20 bps for FY26** The Reserve Bank of India (RBI) has pared the real GDP and retail inflation projections by 20 basis points each for FY26. 10:29 | April 9, 2025RBI Monetary Policy Live Updates: We are aiming for a non inflationary growth that is built on the foundations of an improved demand and supply: RBI Guv **RBI Monetary Policy Live Updates: We are aiming for a non inflationary growth that is built on the foundations of an improved demand and supply: RBI Guv** **RBI Monetary Policy Live Updates: We are aiming for a non inflationary growth that is built on the foundations of an improved demand and supply: RBI Guv** 10:29 | April 9, 2025RBI Monetary Policy Live Updates: We shall remain agile and decisive in our response, RBI Guv says **RBI Monetary Policy Live Updates: We shall remain agile and decisive in our response, RBI Guv says** **RBI Monetary Policy Live Updates: We shall remain agile and decisive in our response, RBI Guv says** 10:26 | April 9, 2025RBI Monetary Policy Live Updates: The global economy is going through a period of exceptional uncertaintiesThe difficulty to extract signal from a noisy and uncertain environment poses challenges for policy making **RBI Monetary Policy Live Updates: The global economy is going through a period of exceptional uncertainties** The difficulty to extract signal from a noisy and uncertain environment poses challenges for policy making **RBI Monetary Policy Live Updates: The global economy is going through a period of exceptional uncertainties** The difficulty to extract signal from a noisy and uncertain environment poses challenges for policy making 10:26 | April 9, 2025RBI MPC 2025 Live Updates: We are aiming for non-inflationary growth **RBI MPC 2025 Live Updates: We are aiming for non-inflationary growth** **RBI MPC 2025 Live Updates: We are aiming for non-inflationary growth** 10:26 | April 9, 2025RBI MPC Meet Live: Monetary policy can play an anchoring role in such circumstances, says RBI Guv **RBI MPC Meet Live: Monetary policy can play an anchoring role in such circumstances, says RBI Guv** **RBI MPC Meet Live: Monetary policy can play an anchoring role in such circumstances, says RBI Guv** 10:25 | April 9, 2025RBI MPC Meet Live: Global eco is going through a period of exceptional uncertainty **RBI MPC Meet Live: Global eco is going through a period of exceptional uncertainty** **RBI MPC Meet Live: Global eco is going through a period of exceptional uncertainty** 10:25 | April 9, 2025RBI MPC Meet Live: Regulatory sandbox to be theme neutral and on-tap **RBI MPC Meet Live: Regulatory sandbox to be theme neutral and on-tap** **RBI MPC Meet Live: Regulatory sandbox to be theme neutral and on-tap** 10:25 | April 9, 2025RBI MPC Meet Live: P2P transaction limit will remain unchanged at Rs 1 lakh **RBI MPC Meet Live: P2P transaction limit will remain unchanged at Rs 1 lakh** **RBI MPC Meet Live: P2P transaction limit will remain unchanged at Rs 1 lakh** 10:24 | April 9, 2025RBI MPC Meet Live: NPCI to decide transaction limits in UPI from person to merchant **RBI MPC Meet Live: NPCI to decide transaction limits in UPI from person to merchant** **RBI MPC Meet Live: NPCI to decide transaction limits in UPI from person to merchant** 10:23 | April 9, 2025Repo Rate Live Updates: Regulations for partial credit enhancement scheme to be revised **Repo Rate Live Updates: Regulations for partial credit enhancement scheme to be revised** **Repo Rate Live Updates: Regulations for partial credit enhancement scheme to be revised** 10:23 | April 9, 2025RBI Monetary Policy Live Updates: Gold loans: To issue regulations on prudential norms for such loans **RBI Monetary Policy Live Updates: Gold loans: To issue regulations on prudential norms for such loans** **RBI Monetary Policy Live Updates: Gold loans: To issue regulations on prudential norms for such loans** 10:22 | April 9, 2025RBI Monetary Policy Live Updates: Co-lending to be allowed to all regulated entities to all loans **RBI Monetary Policy Live Updates: Co-lending to be allowed to all regulated entities to all loans** **RBI Monetary Policy Live Updates: Co-lending to be allowed to all regulated entities to all loans** 10:22 | April 9, 2025RBI Monetary Policy Live Updates: We propose to enable securitisation of stressed assets through market based mechanism, says RBI Guv **RBI Monetary Policy Live Updates: We propose to enable securitisation of stressed assets through market based mechanism, says RBI Guv** **RBI Monetary Policy Live Updates: We propose to enable securitisation of stressed assets through market based mechanism, says RBI Guv** 10:21 | April 9, 2025RBI MPC 2025 Live Updates: Profitability indicators are healthy, says RBI Guv **RBI MPC 2025 Live Updates: Profitability indicators are healthy, says RBI Guv** **RBI MPC 2025 Live Updates: Profitability indicators are healthy, says RBI Guv** 10:21 | April 9, 2025RBI MPC 2025 Live Updates: The financial soundness of the banking system is robust, RBI Guv says **RBI MPC 2025 Live Updates: The financial soundness of the banking system is robust, RBI Guv says** **RBI MPC 2025 Live Updates: The financial soundness of the banking system is robust, RBI Guv says** 10:20 | April 9, 2025RBI MPC 2025 Live Updates: RBI is committed to providing sufficient system liquidity **RBI MPC 2025 Live Updates: RBI is committed to providing sufficient system liquidity** **RBI MPC 2025 Live Updates: RBI is committed to providing sufficient system liquidity** 10:19 | April 9, 2025RBI MPC Meet Live: System Liquidity tapered during last two months and turned into surplus in AprilSystem liquidity tapered over last two months and RBI measures and is now at surplus of over Rs 1.5 lakh crore **RBI MPC Meet Live: System Liquidity tapered during last two months and turned into surplus in April** System liquidity tapered over last two months and RBI measures and is now at surplus of over Rs 1.5 lakh crore **RBI MPC Meet Live: System Liquidity tapered during last two months and turned into surplus in April** System liquidity tapered over last two months and RBI measures and is now at surplus of over Rs 1.5 lakh crore 10:19 | April 9, 2025RBI MPC Meet Live: System liquidity was in deficit in January at over Rs 3.1 lakh crore **RBI MPC Meet Live: System liquidity was in deficit in January at over Rs 3.1 lakh crore** **RBI MPC Meet Live: System liquidity was in deficit in January at over Rs 3.1 lakh crore** 10:18 | April 9, 2025RBI MPC Meet Live: ECBs and non-resident deposits were higher **RBI MPC Meet Live: ECBs and non-resident deposits were higher** **RBI MPC Meet Live: ECBs and non-resident deposits were higher** 10:18 | April 9, 2025RBI MPC Meet Live: Net FDI moderated sharply due to higher repatriation **RBI MPC Meet Live: Net FDI moderated sharply due to higher repatriation** **RBI MPC Meet Live: Net FDI moderated sharply due to higher repatriation** 10:17 | April 9, 2025RBI Monetary Policy News: FDI has been strong last year, reflecting India’s strong macro fundamentals **RBI Monetary Policy News: FDI has been strong last year, reflecting India’s strong macro fundamentals** **RBI Monetary Policy News: FDI has been strong last year, reflecting India’s strong macro fundamentals** 10:17 | April 9, 2025RBI Monetary Policy News: CAD to remain well within sustainable limits **RBI Monetary Policy News: CAD to remain well within sustainable limits** **RBI Monetary Policy News: CAD to remain well within sustainable limits** 10:17 | April 9, 2025RBI Monetary Policy Live Updates: Q1 CPI at 3.6%, Q2 3.9%, Q3 3.8%, Q4 4.4% **RBI Monetary Policy Live Updates: Q1 CPI at 3.6%, Q2 3.9%, Q3 3.8%, Q4 4.4%** **RBI Monetary Policy Live Updates: Q1 CPI at 3.6%, Q2 3.9%, Q3 3.8%, Q4 4.4%** 10:17 | April 9, 2025RBI Monetary Policy Live Updates: Record Wheat ProductionThe uncertainties regarding Rabi crops have abated considerably, and the second advance estimates point to a record wheat production and higher production of key pulses over that last year. This is expected to set the stage for a durable softening of food prices **RBI Monetary Policy Live Updates: Record Wheat Production** The uncertainties regarding Rabi crops have abated considerably, and the second advance estimates point to a record wheat production and higher production of key pulses over that last year. This is expected to set the stage for a durable softening of food prices **RBI Monetary Policy Live Updates: Record Wheat Production** The uncertainties regarding Rabi crops have abated considerably, and the second advance estimates point to a record wheat production and higher production of key pulses over that last year. This is expected to set the stage for a durable softening of food prices 10:16 | April 9, 2025RBI Monetary Policy Live Updates: CPI inflation for FY26 is projected at 4. per cent (4.2 per cent projected earlier) **RBI Monetary Policy Live Updates: CPI inflation for FY26 is projected at 4. per cent (4.2 per cent projected earlier)** **RBI Monetary Policy Live Updates: CPI inflation for FY26 is projected at 4. per cent (4.2 per cent projected earlier)** 10:15 | April 9, 2025RBI Monetary Policy Live Updates: Fall in crude oil price augur well for inflation outlook **RBI Monetary Policy Live Updates: Fall in crude oil price augur well for inflation outlook** **RBI Monetary Policy Live Updates: Fall in crude oil price augur well for inflation outlook** 10:14 | April 9, 2025RBI Monetary Policy Live Updates: FY26: GDP growthQ1 6.5%Q2 6.7%Q3 6.6%Q4 6.3% **RBI Monetary Policy Live Updates: FY26: GDP growth** Q1 6.5%Q2 6.7%Q3 6.6%Q4 6.3% **RBI Monetary Policy Live Updates: FY26: GDP growth** Q1 6.5%Q2 6.7%Q3 6.6%Q4 6.3% 10:13 | April 9, 2025RBI MPC Meeting Live: Merchandise exports will be weighed down by global uncertainties, while services exports are expected to remain resilient **RBI MPC Meeting Live: Merchandise exports will be weighed down by global uncertainties, while services exports are expected to remain resilient** **RBI MPC Meeting Live: Merchandise exports will be weighed down by global uncertainties, while services exports are expected to remain resilient** 10:13 | April 9, 2025RBI MPC Meeting Live: Headwinds from inflation to pose domestic risk, says RBI Guv **RBI MPC Meeting Live: Headwinds from inflation to pose domestic risk, says RBI Guv** **RBI MPC Meeting Live: Headwinds from inflation to pose domestic risk, says RBI Guv** 10:13 | April 9, 2025RBI MPC Meeting Live: Investment activity has gained traction and is expected to improve further on the back of sustained higher capacity utilization **RBI MPC Meeting Live: Investment activity has gained traction and is expected to improve further on the back of sustained higher capacity utilization** **RBI MPC Meeting Live: Investment activity has gained traction and is expected to improve further on the back of sustained higher capacity utilization** 10:13 | April 9, 2025RBI Monetary Policy News: Services exports expected to remain resilient **RBI Monetary Policy News: Services exports expected to remain resilient** **RBI Monetary Policy News: Services exports expected to remain resilient** 10:13 | April 9, 2025RBI Monetary Policy News: Merchandise exports to be weighed down by global uncertainties **RBI Monetary Policy News: Merchandise exports to be weighed down by global uncertainties** **RBI Monetary Policy News: Merchandise exports to be weighed down by global uncertainties** 10:13 | April 9, 2025RBI Monetary Policy News: Urban consumption is gradually picking up with an uptick in discretionary spending **RBI Monetary Policy News: Urban consumption is gradually picking up with an uptick in discretionary spending** **RBI Monetary Policy News: Urban consumption is gradually picking up with an uptick in discretionary spending** 10:12 | April 9, 2025RBI Monetary Policy Live Updates: Bright prospects for agri sector bode well for rural demand, says RBI Guv **RBI Monetary Policy Live Updates: Bright prospects for agri sector bode well for rural demand, says RBI Guv** **RBI Monetary Policy Live Updates: Bright prospects for agri sector bode well for rural demand, says RBI Guv** 10:12 | April 9, 2025RBI Monetary Policy Live Updates: Real GDP growth for FY26 is projected at 6.5 per cent (6.7 per cent earlier) **RBI Monetary Policy Live Updates: Real GDP growth for FY26 is projected at 6.5 per cent (6.7 per cent earlier)** **RBI Monetary Policy Live Updates: Real GDP growth for FY26 is projected at 6.5 per cent (6.7 per cent earlier)** 10:12 | April 9, 2025RBI Monetary Policy Live Updates: In FY26 Agri sector remains bright, says RBI Guv **RBI Monetary Policy Live Updates: In FY26 Agri sector remains bright, says RBI Guv** **RBI Monetary Policy Live Updates: In FY26 Agri sector remains bright, says RBI Guv** 10:11 | April 9, 2025RBI Monetary Policy Live Updates: Uncertainty may lead to possible currency pressure **RBI Monetary Policy Live Updates: Uncertainty may lead to possible currency pressure** **RBI Monetary Policy Live Updates: Uncertainty may lead to possible currency pressure** 10:10 | April 9, 2025RBI Monetary Policy Live Updates: India is engaging with the US on foreign trade agreements **RBI Monetary Policy Live Updates: India is engaging with the US on foreign trade agreements** **RBI Monetary Policy Live Updates: India is engaging with the US on foreign trade agreements** 10:10 | April 9, 2025RBI Monetary Policy News: Higher tariffs will affect exports **RBI Monetary Policy News: Higher tariffs will affect exports** **RBI Monetary Policy News: Higher tariffs will affect exports** 10:10 | April 9, 2025RBI Monetary Policy News: Dent on global growth due to trade friction will impede domestic growth **RBI Monetary Policy News: Dent on global growth due to trade friction will impede domestic growth** **RBI Monetary Policy News: Dent on global growth due to trade friction will impede domestic growth** 10:10 | April 9, 2025RBI MPC 2025 Live Updates: Uncertainty dampens growth by affecting investment, spending decisions **RBI MPC 2025 Live Updates: Uncertainty dampens growth by affecting investment, spending decisions** **RBI MPC 2025 Live Updates: Uncertainty dampens growth by affecting investment, spending decisions** 10:09 | April 9, 2025RBI MPC 2025 Live Updates: Our stance provides policy rate guidance, says RBI Guv **RBI MPC 2025 Live Updates: Our stance provides policy rate guidance, says RBI Guv** **RBI MPC 2025 Live Updates: Our stance provides policy rate guidance, says RBI Guv** 10:08 | April 9, 2025RBI MPC 2025 Live: Change in stance means that going forward the MPC is considering status quo or rate cut **RBI MPC 2025 Live: Change in stance means that going forward the MPC is considering status quo or rate cut** **RBI MPC 2025 Live: Change in stance means that going forward the MPC is considering status quo or rate cut** 10:08 | April 9, 2025Repo Rate Live Updates: A neutral stance provides flexibility to move in either direction in line with evolving conditions **Repo Rate Live Updates: A neutral stance provides flexibility to move in either direction in line with evolving conditions** **Repo Rate Live Updates: A neutral stance provides flexibility to move in either direction in line with evolving conditions** 10:07 | April 9, 2025RBI MPC Meeting Live: Along with the rate cut, the MPC also votes unanimously to change the monetary policy stance from “neutral” to “accommodative” **RBI MPC Meeting Live: Along with the rate cut, the MPC also votes unanimously to change the monetary policy stance from “neutral” to “accommodative”** **RBI MPC Meeting Live: Along with the rate cut, the MPC also votes unanimously to change the monetary policy stance from “neutral” to “accommodative”** 10:05 | April 9, 2025RBI MPC Meeting Live: Growth is still on recovery path, says RBI Guv **RBI MPC Meeting Live: Growth is still on recovery path, says RBI Guv** **RBI MPC Meeting Live: Growth is still on recovery path, says RBI Guv** 10:05 | April 9, 2025RBI Monetary Policy News: There is greater confidence of durable target of headline inflation **RBI Monetary Policy News: There is greater confidence of durable target of headline inflation** **RBI Monetary Policy News: There is greater confidence of durable target of headline inflation** 10:05 | April 9, 2025RBI MPC Meet Live: MPC notes that inflation is below target **RBI MPC Meet Live: MPC notes that inflation is below target** **RBI MPC Meet Live: MPC notes that inflation is below target** 10:05 | April 9, 2025Guv: MPC unanimously decides to cut repo rate by 25 bps to 6%The rate-setting six-member monetary policy committee (MPC) on Wednesday voted unanimously to cut the policy repo rate by 25 basis points (bps) from 6.25 per cent to 6.00 per cent to support growth, which could face headwinds from the ongoing global tariff war. **Guv: MPC unanimously decides to cut repo rate by 25 bps to 6%** The rate-setting six-member monetary policy committee (MPC) on Wednesday voted unanimously to cut the policy repo rate by 25 basis points (bps) from 6.25 per cent to 6.00 per cent to support growth, which could face headwinds from the ongoing global tariff war. **Guv: MPC unanimously decides to cut repo rate by 25 bps to 6%** The rate-setting six-member monetary policy committee (MPC) on Wednesday voted unanimously to cut the policy repo rate by 25 basis points (bps) from 6.25 per cent to 6.00 per cent to support growth, which could face headwinds from the ongoing global tariff war. 10:03 | April 9, 2025RBI Monetary Policy Live Updates: We remain vigilant to possible risk from global uncertianties and weather disruptions, Guv says **RBI Monetary Policy Live Updates: We remain vigilant to possible risk from global uncertianties and weather disruptions, Guv says** **RBI Monetary Policy Live Updates: We remain vigilant to possible risk from global uncertianties and weather disruptions, Guv says** 10:03 | April 9, 2025RBI MPC Meeting Live: Equity markets are correcting, and crude oil prices have fallen to their lowest in over three years, says Guv **RBI MPC Meeting Live: Equity markets are correcting, and crude oil prices have fallen to their lowest in over three years, says Guv** **RBI MPC Meeting Live: Equity markets are correcting, and crude oil prices have fallen to their lowest in over three years, says Guv** 10:03 | April 9, 2025RBI MPC Meeting Live: The Indian economy has made steady progress toward price stability and growth **RBI MPC Meeting Live: The Indian economy has made steady progress toward price stability and growth** **RBI MPC Meeting Live: The Indian economy has made steady progress toward price stability and growth** 10:03 | April 9, 2025RBI MPC Meeting Live: Central banks are navigating cautiously **RBI MPC Meeting Live: Central banks are navigating cautiously** **RBI MPC Meeting Live: Central banks are navigating cautiously** 10:02 | April 9, 2025RBI Monetary Policy News: The global economic outlook is fast changingThe global economic outlook is fast changing. The recent trade tariff related measures have exacerbated uncertainties, clouding the economic outlook across regions, posing new headwinds for global growth and inflation. **RBI Monetary Policy News: The global economic outlook is fast changing** The global economic outlook is fast changing. The recent trade tariff related measures have exacerbated uncertainties, clouding the economic outlook across regions, posing new headwinds for global growth and inflation. **RBI Monetary Policy News: The global economic outlook is fast changing** The global economic outlook is fast changing. The recent trade tariff related measures have exacerbated uncertainties, clouding the economic outlook across regions, posing new headwinds for global growth and inflation. 10:02 | April 9, 2025RBI Gov: In this challenging global environment the MPC met to deliberate and decide on policy repo rate **RBI Gov: In this challenging global environment the MPC met to deliberate and decide on policy repo rate** **RBI Gov: In this challenging global environment the MPC met to deliberate and decide on policy repo rate** 10:02 | April 9, 2025RBI MPC Live: Reserve bank’s journey over the last nine decades is closely intertwined with the nation’s development and progress as a custodian of monetary and financial stability. **RBI MPC Live: Reserve bank’s journey over the last nine decades is closely intertwined with the nation’s development and progress as a custodian of monetary and financial stability.** **RBI MPC Live: Reserve bank’s journey over the last nine decades is closely intertwined with the nation’s development and progress as a custodian of monetary and financial stability.** 10:02 | April 9, 2025RBI MPC: Guv Malhotra begins his address **RBI MPC: Guv Malhotra begins his address** **RBI MPC: Guv Malhotra begins his address** 10:01 | April 9, 2025RBI Gov: Year has begun on an enxious note for the economy **RBI Gov: Year has begun on an enxious note for the economy** **RBI Gov: Year has begun on an enxious note for the economy** 09:54 | April 9, 2025RBI MPC Meeting Live: Real Gross Domestic Product (GDP) picked up pace in the third quarter (October-December 2024), growing 6.2 per cent against 5.4 per cent in the previous quarter. **RBI MPC Meeting Live: Real Gross Domestic Product (GDP) picked up pace in the third quarter (October-December 2024), growing 6.2 per cent against 5.4 per cent in the previous quarter.** **RBI MPC Meeting Live: Real Gross Domestic Product (GDP) picked up pace in the third quarter (October-December 2024), growing 6.2 per cent against 5.4 per cent in the previous quarter.** 09:54 | April 9, 2025RBI MPC Meet Live: RBI may again cut rate by 25 bps, say expertsThe Reserve Bank of India (RBI) has kept the repo rate (short-term lending rate) unchanged at 6.5 per cent since February 2023. The last time the RBI reduced the rate was during the Covid times (May 2020), and thereafter, it was gradually raised to 6.5 per cent. **RBI MPC Meet Live: RBI may again cut rate by 25 bps, say experts** The Reserve Bank of India (RBI) has kept the repo rate (short-term lending rate) unchanged at 6.5 per cent since February 2023. The last time the RBI reduced the rate was during the Covid times (May 2020), and thereafter, it was gradually raised to 6.5 per cent. **RBI MPC Meet Live: RBI may again cut rate by 25 bps, say experts** The Reserve Bank of India (RBI) has kept the repo rate (short-term lending rate) unchanged at 6.5 per cent since February 2023. The last time the RBI reduced the rate was during the Covid times (May 2020), and thereafter, it was gradually raised to 6.5 per cent. 09:44 | April 9, 2025RBI Monetary Policy Live: Is the Inflation under control?Headline CPI (consumer price index-based), or retail inflation, moderated to a seven-month low of 3.6 per cent in February 2025 from 4.3 per cent in January 2025, as food prices—especially vegetables—recorded a sharp decline driven by the arrival of winter crops in the market. **RBI Monetary Policy Live: Is the Inflation under control?** Headline CPI (consumer price index-based), or retail inflation, moderated to a seven-month low of 3.6 per cent in February 2025 from 4.3 per cent in January 2025, as food prices—especially vegetables—recorded a sharp decline driven by the arrival of winter crops in the market. **RBI Monetary Policy Live: Is the Inflation under control?** Headline CPI (consumer price index-based), or retail inflation, moderated to a seven-month low of 3.6 per cent in February 2025 from 4.3 per cent in January 2025, as food prices—especially vegetables—recorded a sharp decline driven by the arrival of winter crops in the market. 09:37 | April 9, 2025RBI Monetary Policy Live Updates: Retail inflation is expected to settle at 4.1% in Feb’ 25: BoB Economic ResearchRetail inflationis expected to settle at 4.1 per cent in February 2025, helped by the sharp downward corrections in vegetable prices, according to an assessment byBank of Baroda’s (BoB)economic research department (ERD).Retail inflation is expected to settle at 4.1% in Feb’ 25: BoB Economic ResearchRetail inflation expected to settle at 4.1% in February 2025, with downward corrections in vegetable prices, according to Bank of Baroda. **RBI Monetary Policy Live Updates: Retail inflation is expected to settle at 4.1% in Feb’ 25: BoB Economic Research** Retail inflationis expected to settle at 4.1 per cent in February 2025, helped by the sharp downward corrections in vegetable prices, according to an assessment byBank of Baroda’s (BoB)economic research department (ERD). **Retail inflation is expected to settle at 4.1% in Feb’ 25: BoB Economic Research** Retail inflation expected to settle at 4.1% in February 2025, with downward corrections in vegetable prices, according to Bank of Baroda. **RBI Monetary Policy Live Updates: Retail inflation is expected to settle at 4.1% in Feb’ 25: BoB Economic Research** Retail inflationis expected to settle at 4.1 per cent in February 2025, helped by the sharp downward corrections in vegetable prices, according to an assessment byBank of Baroda’s (BoB)economic research department (ERD). **Retail inflation is expected to settle at 4.1% in Feb’ 25: BoB Economic Research** Retail inflation expected to settle at 4.1% in February 2025, with downward corrections in vegetable prices, according to Bank of Baroda. 09:26 | April 9, 2025RBI Monetary Policy Live Updates: MPC may cut repo rate by 25 bps to offset US tariff falloutTheRBI’s six-memberMonetary Policy Committee (MPC)is expected to go for a 25-basis-point repo rate cut in its upcoming meeting to shield the domestic economy from the fallout of the US’ reciprocal tariffs on global trade and the expected slowdown this may trigger in the world economy.MPC may cut repo rate by 25 bps to offset US tariff falloutRBI's MPC expected to cut repo rate by 25 bps to counter US tariffs, with favorable macroeconomic conditions. **RBI Monetary Policy Live Updates: MPC may cut repo rate by 25 bps to offset US tariff fallout** TheRBI’s six-memberMonetary Policy Committee (MPC)is expected to go for a 25-basis-point repo rate cut in its upcoming meeting to shield the domestic economy from the fallout of the US’ reciprocal tariffs on global trade and the expected slowdown this may trigger in the world economy. **MPC may cut repo rate by 25 bps to offset US tariff fallout** RBI's MPC expected to cut repo rate by 25 bps to counter US tariffs, with favorable macroeconomic conditions. **RBI Monetary Policy Live Updates: MPC may cut repo rate by 25 bps to offset US tariff fallout** TheRBI’s six-memberMonetary Policy Committee (MPC)is expected to go for a 25-basis-point repo rate cut in its upcoming meeting to shield the domestic economy from the fallout of the US’ reciprocal tariffs on global trade and the expected slowdown this may trigger in the world economy. **MPC may cut repo rate by 25 bps to offset US tariff fallout** RBI's MPC expected to cut repo rate by 25 bps to counter US tariffs, with favorable macroeconomic conditions. 09:21 | April 9, 2025RBI MPC Live Updates: Global tariff concerns, US inflation data, RBI rate decision to drive markets: AnalystsIn an eventful week ahead, stock markets may face volatile trends before theRBI’s interest rate decision and theUSinflation data announcements, as investors continue to assess the broader implications of UStariffson global economy and inflation, analysts said.Global tariff concerns, US inflation data, RBI rate decision to drive markets: AnalystsInvestors fear global economic slowdown due to US tariffs, leading to volatile markets and potential recession concerns. **RBI MPC Live Updates: Global tariff concerns, US inflation data, RBI rate decision to drive markets: Analysts** In an eventful week ahead, stock markets may face volatile trends before theRBI’s interest rate decision and theUSinflation data announcements, as investors continue to assess the broader implications of UStariffson global economy and inflation, analysts said. **Global tariff concerns, US inflation data, RBI rate decision to drive markets: Analysts** Investors fear global economic slowdown due to US tariffs, leading to volatile markets and potential recession concerns. **RBI MPC Live Updates: Global tariff concerns, US inflation data, RBI rate decision to drive markets: Analysts** In an eventful week ahead, stock markets may face volatile trends before theRBI’s interest rate decision and theUSinflation data announcements, as investors continue to assess the broader implications of UStariffson global economy and inflation, analysts said. **Global tariff concerns, US inflation data, RBI rate decision to drive markets: Analysts** Investors fear global economic slowdown due to US tariffs, leading to volatile markets and potential recession concerns. 08:24 | April 9, 2025RBI MPC Meet 2025: Higher estimates of crop production likely to pull down food inflation, expects FinMin reportThe Finance Ministry on Wednesday expected food inflation to ease in coming months, further impacting the headline inflation.Retail inflation, based on Consumer Price Index (CPI) dipped to a seven-month low of 3.6 per cent in February, showing a decline of 65 basis points in comparison to January. A sharp decline of 222 basis point was observed in food inflation and it came down to 3.75 per cent in February as compared to 5.97 per cent in January. Data for March will be made public on April 14.​Higher estimates of crop production likely to pull down food inflation, expects FinMin reportFinance Ministry expects easing food inflation to impact headline inflation, with positive outlook for agricultural production and private investment.​ **RBI MPC Meet 2025: Higher estimates of crop production likely to pull down food inflation, expects FinMin report** The Finance Ministry on Wednesday expected food inflation to ease in coming months, further impacting the headline inflation. Retail inflation, based on Consumer Price Index (CPI) dipped to a seven-month low of 3.6 per cent in February, showing a decline of 65 basis points in comparison to January. A sharp decline of 222 basis point was observed in food inflation and it came down to 3.75 per cent in February as compared to 5.97 per cent in January. Data for March will be made public on April 14. ​Higher estimates of crop production likely to pull down food inflation, expects FinMin reportFinance Ministry expects easing food inflation to impact headline inflation, with positive outlook for agricultural production and private investment.​ **Higher estimates of crop production likely to pull down food inflation, expects FinMin report** Finance Ministry expects easing food inflation to impact headline inflation, with positive outlook for agricultural production and private investment. **RBI MPC Meet 2025: Higher estimates of crop production likely to pull down food inflation, expects FinMin report** The Finance Ministry on Wednesday expected food inflation to ease in coming months, further impacting the headline inflation. Retail inflation, based on Consumer Price Index (CPI) dipped to a seven-month low of 3.6 per cent in February, showing a decline of 65 basis points in comparison to January. A sharp decline of 222 basis point was observed in food inflation and it came down to 3.75 per cent in February as compared to 5.97 per cent in January. Data for March will be made public on April 14. ​Higher estimates of crop production likely to pull down food inflation, expects FinMin reportFinance Ministry expects easing food inflation to impact headline inflation, with positive outlook for agricultural production and private investment.​ **Higher estimates of crop production likely to pull down food inflation, expects FinMin report** Finance Ministry expects easing food inflation to impact headline inflation, with positive outlook for agricultural production and private investment. **Higher estimates of crop production likely to pull down food inflation, expects FinMin report** Finance Ministry expects easing food inflation to impact headline inflation, with positive outlook for agricultural production and private investment. 08:16 | April 9, 2025RBI MPC 2025 Live Updates: India’s Retail Inflation 2025 Highlights: Retail inflation eases to 3.61% in FebruaryIndia’s Retail Inflation 2025, Retail Inflation outlook for February 2025 news updates: Retail inflation based on Consumer Price Index (CPI) dipped to 3.61 per cent in January, Government data showed on Wednesday.​India’s CPI Retail Inflation February 2025 Highlights: Retail inflation eases to 3.61% in FebruaryIndia’s Retail Inflation 2025, Retail Inflation outlook for February 2025 news updates: Retail inflation based on Consumer Price Index (CPI) dipped to 3.61 per cent in January, Government data showed on Wednesday. This is the lowest after July 2024. Meanwhile, industrial growth based on the Index of Industrial Production (IIP) accelearated to 5 per cent in January. Retail inflation was 4.3 per cent in January. “There is decline of 65 basis points in headline inflation of February, 2025 in comparison to January, 2025,” a statement by Statistics Ministry said. With inflation going below 4 per cent, one more instalment of policy interest rate cut is near certain, when the Monetary Policy Committee will meet next month.​ **RBI MPC 2025 Live Updates: India’s Retail Inflation 2025 Highlights: Retail inflation eases to 3.61% in February** India’s Retail Inflation 2025, Retail Inflation outlook for February 2025 news updates: Retail inflation based on Consumer Price Index (CPI) dipped to 3.61 per cent in January, Government data showed on Wednesday. ​India’s CPI Retail Inflation February 2025 Highlights: Retail inflation eases to 3.61% in FebruaryIndia’s Retail Inflation 2025, Retail Inflation outlook for February 2025 news updates: Retail inflation based on Consumer Price Index (CPI) dipped to 3.61 per cent in January, Government data showed on Wednesday. This is the lowest after July 2024. Meanwhile, industrial growth based on the Index of Industrial Production (IIP) accelearated to 5 per cent in January. Retail inflation was 4.3 per cent in January. “There is decline of 65 basis points in headline inflation of February, 2025 in comparison to January, 2025,” a statement by Statistics Ministry said. With inflation going below 4 per cent, one more instalment of policy interest rate cut is near certain, when the Monetary Policy Committee will meet next month.​ **India’s CPI Retail Inflation February 2025 Highlights: Retail inflation eases to 3.61% in February** India’s Retail Inflation 2025, Retail Inflation outlook for February 2025 news updates: Retail inflation based on Consumer Price Index (CPI) dipped to 3.61 per cent in January, Government data showed on Wednesday. This is the lowest after July 2024. Meanwhile, industrial growth based on the Index of Industrial Production (IIP) accelearated to 5 per cent in January. Retail inflation was 4.3 per cent in January. “There is decline of 65 basis points in headline inflation of February, 2025 in comparison to January, 2025,” a statement by Statistics Ministry said. With inflation going below 4 per cent, one more instalment of policy interest rate cut is near certain, when the Monetary Policy Committee will meet next month. **RBI MPC 2025 Live Updates: India’s Retail Inflation 2025 Highlights: Retail inflation eases to 3.61% in February** India’s Retail Inflation 2025, Retail Inflation outlook for February 2025 news updates: Retail inflation based on Consumer Price Index (CPI) dipped to 3.61 per cent in January, Government data showed on Wednesday. ​India’s CPI Retail Inflation February 2025 Highlights: Retail inflation eases to 3.61% in FebruaryIndia’s Retail Inflation 2025, Retail Inflation outlook for February 2025 news updates: Retail inflation based on Consumer Price Index (CPI) dipped to 3.61 per cent in January, Government data showed on Wednesday. This is the lowest after July 2024. Meanwhile, industrial growth based on the Index of Industrial Production (IIP) accelearated to 5 per cent in January. Retail inflation was 4.3 per cent in January. “There is decline of 65 basis points in headline inflation of February, 2025 in comparison to January, 2025,” a statement by Statistics Ministry said. With inflation going below 4 per cent, one more instalment of policy interest rate cut is near certain, when the Monetary Policy Committee will meet next month.​ **India’s CPI Retail Inflation February 2025 Highlights: Retail inflation eases to 3.61% in February** India’s Retail Inflation 2025, Retail Inflation outlook for February 2025 news updates: Retail inflation based on Consumer Price Index (CPI) dipped to 3.61 per cent in January, Government data showed on Wednesday. This is the lowest after July 2024. Meanwhile, industrial growth based on the Index of Industrial Production (IIP) accelearated to 5 per cent in January. Retail inflation was 4.3 per cent in January. “There is decline of 65 basis points in headline inflation of February, 2025 in comparison to January, 2025,” a statement by Statistics Ministry said. With inflation going below 4 per cent, one more instalment of policy interest rate cut is near certain, when the Monetary Policy Committee will meet next month. **India’s CPI Retail Inflation February 2025 Highlights: Retail inflation eases to 3.61% in February** India’s Retail Inflation 2025, Retail Inflation outlook for February 2025 news updates: Retail inflation based on Consumer Price Index (CPI) dipped to 3.61 per cent in January, Government data showed on Wednesday. This is the lowest after July 2024. Meanwhile, industrial growth based on the Index of Industrial Production (IIP) accelearated to 5 per cent in January. Retail inflation was 4.3 per cent in January. “There is decline of 65 basis points in headline inflation of February, 2025 in comparison to January, 2025,” a statement by Statistics Ministry said. With inflation going below 4 per cent, one more instalment of policy interest rate cut is near certain, when the Monetary Policy Committee will meet next month. 08:09 | April 9, 2025RBI MPC 2025 Live Updates: SBI economists expect 75-100 bps cumulative policy rate reduction by March 2026State Bank of India’s economic research department expects a cumulative policy rate reduction of 75-100 basis points by March 2026, factoring in the average inflation envisaged and the output gap consequent upon different GDP scenarios.​SBI economists expect 75-100 bps cumulative policy rate reduction by March 2026SBI economists predict 75-100 bps rate cut by March 2026, with inflation projections and potential GDP scenarios.​ **RBI MPC 2025 Live Updates: SBI economists expect 75-100 bps cumulative policy rate reduction by March 2026** State Bank of India’s economic research department expects a cumulative policy rate reduction of 75-100 basis points by March 2026, factoring in the average inflation envisaged and the output gap consequent upon different GDP scenarios. ​SBI economists expect 75-100 bps cumulative policy rate reduction by March 2026SBI economists predict 75-100 bps rate cut by March 2026, with inflation projections and potential GDP scenarios.​ **SBI economists expect 75-100 bps cumulative policy rate reduction by March 2026** SBI economists predict 75-100 bps rate cut by March 2026, with inflation projections and potential GDP scenarios. **RBI MPC 2025 Live Updates: SBI economists expect 75-100 bps cumulative policy rate reduction by March 2026** State Bank of India’s economic research department expects a cumulative policy rate reduction of 75-100 basis points by March 2026, factoring in the average inflation envisaged and the output gap consequent upon different GDP scenarios. ​SBI economists expect 75-100 bps cumulative policy rate reduction by March 2026SBI economists predict 75-100 bps rate cut by March 2026, with inflation projections and potential GDP scenarios.​ **SBI economists expect 75-100 bps cumulative policy rate reduction by March 2026** SBI economists predict 75-100 bps rate cut by March 2026, with inflation projections and potential GDP scenarios. **SBI economists expect 75-100 bps cumulative policy rate reduction by March 2026** SBI economists predict 75-100 bps rate cut by March 2026, with inflation projections and potential GDP scenarios. 08:07 | April 9, 2025RBI Monetary Policy Live Updates: Rural demand continued to outpace urban demand for FMCG industry in March quarterFMCG companies saw rural demand recovery trends while urban consumption continued to be sluggish impacting revenue growth in the March quarter. Companies such as Dabur, Marico and AWL Agri Business Ltd (formerly Adani Wilmar Ltd) said rural demand continued to outpace urban demand in their Q4FY25 quarterly results previews. Analysts and industry observers expect urban demand may begin seeing some recovery in the second half of FY26 aided by stabilising food inflation and rebates in income tax.Rural demand continued to outpace urban demand for FMCG industry in March quarterFMCG companies experience rural demand recovery, sluggish urban consumption impacts revenue growth in Q4FY25, with potential urban recovery in FY26. **RBI Monetary Policy Live Updates: Rural demand continued to outpace urban demand for FMCG industry in March quarter** FMCG companies saw rural demand recovery trends while urban consumption continued to be sluggish impacting revenue growth in the March quarter. Companies such as Dabur, Marico and AWL Agri Business Ltd (formerly Adani Wilmar Ltd) said rural demand continued to outpace urban demand in their Q4FY25 quarterly results previews. Analysts and industry observers expect urban demand may begin seeing some recovery in the second half of FY26 aided by stabilising food inflation and rebates in income tax. **Rural demand continued to outpace urban demand for FMCG industry in March quarter** FMCG companies experience rural demand recovery, sluggish urban consumption impacts revenue growth in Q4FY25, with potential urban recovery in FY26. **RBI Monetary Policy Live Updates: Rural demand continued to outpace urban demand for FMCG industry in March quarter** FMCG companies saw rural demand recovery trends while urban consumption continued to be sluggish impacting revenue growth in the March quarter. Companies such as Dabur, Marico and AWL Agri Business Ltd (formerly Adani Wilmar Ltd) said rural demand continued to outpace urban demand in their Q4FY25 quarterly results previews. Analysts and industry observers expect urban demand may begin seeing some recovery in the second half of FY26 aided by stabilising food inflation and rebates in income tax. **Rural demand continued to outpace urban demand for FMCG industry in March quarter** FMCG companies experience rural demand recovery, sluggish urban consumption impacts revenue growth in Q4FY25, with potential urban recovery in FY26. Published on April 9, 2025 Several parts of Tamil Nadu receive moderate, isolated heavy rain Inox Green Energy Services ink pacts to provide O&M services for 285 MWp solar projects Asian Energy Services reports 52% revenue growth in FY25, shares plunge 6% Nifty Bank Prediction Today – May 19, 2025: Index stays in a narrow band BirlaNu Pipes records 76% volume growth in FY25, shares plunge 4.5% Crude oil futures dip as Moody’s downgrades US credit rating US credit rating downgrade tempers market sentiment; Defence stocks rally Rupee rises 16 paise to 85.41 against US dollar in early trade Foreign secretary set to brief parliamentary panel on issues related to Pakistan Nvidia CEO unveils new tech to keep global AI expansion going Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP **Comments** Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by ourcommunity guidelinesfor posting your comments. We have migrated to a new commenting platform. If you are already a registered user of TheHindu Businessline and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. Access 10 free stories per month Access to comment on every story Sign up/Manage to our newsletters Get notified by email for early preview to new features, discounts & offers Log out Terms & conditions|Institutional Subscriber"}