{"id": 1715, "name": "Exopolitics", "domain": "exopolitics.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://exopolitics.org/confederation-of-planets-galactic-federation-of-worlds-a-contrast-in-galactic-conflict-resolution/", "title": "Confederation Of Planets Galactic Federation Of Worlds A Contrast In Galactic Conflict Resolution", "content": "AboutWelcomeWebsiteDr Michael SallaPatreonOfficialLicense for Exopolitics ArticlesPrivacy Policy Welcome Website Dr Michael Salla Patreon Official License for Exopolitics Articles Privacy Policy Welcome Website Dr Michael Salla Patreon Official License for Exopolitics Articles Privacy Policy ShopWebinarsBooks Webinars Books Webinars Books ArchiveBlogExopolitics CommentsInterviews - Exopolitics TodayResearch PapersExonews & ExaminerBook ReviewsRecommended Reading Blog Exopolitics Comments Interviews - Exopolitics Today Research Papers Exonews & Examiner Book Reviews Recommended Reading Blog Exopolitics Comments Interviews - Exopolitics Today Research Papers Exonews & Examiner Book Reviews Recommended Reading ResourcesJP Articles Photos, Videos & BooksExopolitics InstituteExopolitics JournalExoNewsExopolitics ConsultantsGalactic Federation of WorldsCorey Goode & Secret Space ProgramsWilliam Tompkins & US Navy Space ProgramQ Anon Articles JP Articles Photos, Videos & Books Exopolitics Institute Exopolitics Journal ExoNews Exopolitics Consultants Galactic Federation of Worlds Corey Goode & Secret Space Programs William Tompkins & US Navy Space Program Q Anon Articles JP Articles Photos, Videos & Books Exopolitics Institute Exopolitics Journal ExoNews Exopolitics Consultants Galactic Federation of Worlds Corey Goode & Secret Space Programs William Tompkins & US Navy Space Program Q Anon Articles WebinarsUpcoming Live WebinarsCompleted Webinars Upcoming Live Webinars Completed Webinars Upcoming Live Webinars Completed Webinars Events/Media20242023202220212020201920182017201620152013-20142003-2012 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2013-2014 2003-2012 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2013-2014 2003-2012 ContactContact UsSupport Contact Us Support Contact Us Support **Confederation of Planets, Galactic Federation of Worlds – A Contrast in Galactic Conflict Resolution** Written byJas MarlinonMay 29, 2025. Posted inExopolitics Podcasts,Featured. Positively oriented galactic associations have intervened in human affairs using very different conflict resolution approaches. On the one hand, there is a spiritually oriented, almost pacifist organization that goes by names such as ‘Confederation of Planets,’ ‘Galactic Confederation,’ ‘Confederation of Light,’ etc. On the other hand, organizations such as the ‘Galactic Federation of Worlds’ and the ‘Ashtar Command’ are more military-oriented and interventionist in dealing with negative extraterrestrial activities and influences. The Confederation of Planets takes a more long-term spiritual approach, emphasizing nonviolence, cosmic consciousness, education, and love. In short, the “Confederation” is a loosely bound, noninterventionist, almost pacifist galactic alliance. In contrast, the “Federation,” has a more tightly integrated structure that includes a unified military that facilitates direct intervention in galactic conflicts. In this exopolitical commentary, Dr. Michael Salla discusses the Confederation of Planets and how it differs from the Galactic Federation of Worlds in conflict resolution. He cites extensively from his book, Galactic Federations, Councils and Secret Space Programs (2022), to provide sources and information describing these different extraterrestrial organizations, and how they intervene to improve the human situation. Podcast Episode #468 Watch onPatreon,YouTube, &Rumble Audio Podcast onApple,Spotify, orGoogle Related Articles/Interviews Sacred Encounters at Lake Titicaca Remote Viewing the Galactic Federation of Worlds Did Extraterrestrials from Venus Make Contact in 1952? Revisiting George Adamski’s claims of Human looking Extraterrestrials The Coming Solar Flash & the Galactic Federation – Q&A with Corey Goode George Adamski: A Herald for the Space Brothers – Book Review **Share this:** Share Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to share on Facebook (Opens in new window)Facebook Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on WhatsApp (Opens in new window)WhatsApp Click to email a link to a friend (Opens in new window)Email **Like this:** Confederation of Planets,Galactic Federation of Worlds,Galacticc Federation Previous Next **Subscribe to Our Newsletter** **Affiliate Sites** ExopoliticsToday.com ExopoliticsToday.com ExopoliticsToday.com ExopoliticsToday.com ExopoliticsInstitute.org ExopoliticsInstitute.org ExopoliticsInstitute.org ExopoliticsInstitute.org Michael Salla.com Michael Salla.com Michael Salla.com Michael Salla.com ExopolticsJournal.org ExopolticsJournal.org ExopolticsJournal.org ExopolticsJournal.org **Exopolitics.org** About Terms of Use News"}