{"id": 1981, "name": "Get Religion", "domain": "getreligion.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.getreligion.org/getreligion/2016/6/7/plant-face-palm-did-facebook-really-say-jesus-is-buried-in-church-of-the-holy-sepulchre", "title": "Plant Face Palm Did Facebook Really Say Jesus Is Buried In Church Of The Holy Sepulchre", "content": "**** **Plant. Face. Palm. Did Facebook team say Jesus is buried in Church of the Holy Sepulchre? (Updated)** Just what we need, anothercontroversy involving Facebook and its \"trending\" news feature, which is apparently important for legions of social-media content consumers. But in this case, I really need to ask, \"Can I get a witness?\" What I mean is this: Does anyone out there in cyberspace have evidence -- perhaps a screenshot or a URL in a way-back storage program -- to back up those #bangingheadondesk items about an alleged Facebook \"trending\" story that ran with this headline? Church of the Holy Sepulchre: Renovations Begin on Site Where Christians Believe Jesus Is Buried Oh my. And we now have an update from a reader! We have a screenshot. *** *** Now that we have that taken care of, let me note that the principalities and powers at Facebook headquarters can take some comfort in the fact that they are not the first folks in journalism to make that error. Some of you might remember a 2014 item on this here weblog that ran with this headline: \"Revenge of GetReligion MZ: Concerning the NYTimes effort to bury Jesus.\" That post focused onan MZ piece atThe Federalistin which she dissected aNew York Timestravel feature that, while focusing on life and commerce in Jerusalem's Christian Quarter said: Nearby, the vast Church of the Holy Sepulcher marking the site where many Christians believe that Jesus was buried, usually packed with pilgrims, was echoing and empty. At least, that's what it says in theonline version of theTimesstory. However, some people saved the earlier print version (see inset photo) that claimed that the Church of the Holy Sepulcher is the site where many Christians belief that the body of JesusISburied -- as in present tense. I just checked and the online version of theTimesstory, complete with the crucial change to \"was buried,\" still does not contain a correction blurb noting the earlier error. I still think that is rather strange. Meanwhile, what is the actual news story behind the alleged Facebook headline? I assume it must be the event covered in the following Associated Press report, which ran on the CBS News site with this headline: \"Jesus' tomb renovated for first time in 200 years.\" Here is the overture. Note the crucial time element. JERUSALEM --A team of experts began a historic renovation on Monday at the spot where Christians believe Jesus was buried, overcoming longstanding religious rivalries to carry out the first repairs at the site in more than 200 years. The project is focused on repairing, reinforcing and preserving the Edicule -- the ancient chamber housing Jesus' tomb in Jerusalem's Church of the Holy Sepulchre. It is the first such work at the tomb since 1810, when the shrine was restored and given its current shape following a fire. An ornate structure with hanging oil lamps, columns and oversize candlesticks, the Edicule was erected above the spot where Christian tradition says Jesus' body was anointed, wrapped in cloth and buried before his resurrection. It stands a few hundred yards from the site of Jesus' crucifixion. And what is unique about this restoration project? Anyone who has visit the site knows the answer to that. The Roman Catholic, Greek Orthodox and Armenian churches are responsible for maintaining separate sections, and each denomination jealously guards its domain. While the clergymen who work and pray at the church generally get along, tensions can rise to the surface. In 2008, an argument between Greek Orthodox and Armenian monks erupted into a brawl. This time, though, the clergymen put aside their differences -- a reflection of the dire need for the repairs. Last year, Israeli police briefly shut down the building after Israel's Antiquities Authority deemed it unsafe, prompting the Christian denominations to join forces. \"We equally decided the required renovation was necessary to be done, so we agreed upon it\", said the Rev. Samuel Aghoyan, the top Armenian official at the church. By all means, read it all. BONUS:One Facebook exchange on this topic includes this wonderful YouTube link as an ironic comment. Tagged:Facebook,Associated Press,CBS News,Church of the Holy Sepulcher,Jerusalem,resurrection,corrections,M.Z. Hemingway,Easter ©GetReligion.org unless otherwise noted.All rights reserved."}