{"id": 529, "name": "Frontiers in Computational Neuroscience", "domain": "frontiersin.org/journals/computational-neuroscience", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/computational-neuroscience/articles/10.3389/fncom.2025.1612928/full", "title": "Computational Neuroscience", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Scope Specialty chief editors Mission & scope Facts Submission Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Scope Specialty chief editors Mission & scope Facts Submission Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Scope Specialty chief editors Mission & scope Facts Submission Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Comput. Neurosci. Volume 19 - 2025 |doi: 10.3389/fncom.2025.1612928 This article is part of the Research TopicAdvancements in Smart Diagnostics for Understanding Neurological Behaviors and Biosensing Applications - Volume IIView all articles **Generalising Location-Centric Variations to Enhance Contactless Human Activity Recognition** 1Coventry University, Coventry, United Kingdom 2Glasgow Caledonian University, Glasgow, Scotland, United Kingdom 3Prince Mohammad bin Fahd University, Khobar, Saudi Arabia 4Princess Nourah bint Abdulrahman University, Riyadh, Saudi Arabia 5Heriot-Watt University, Edinburgh, Scotland, United Kingdom 6Al Ain University, Al Ain, Abu Dhabi, United Arab Emirates 7University of Glasgow, Glasgow, Scotland, United Kingdom The final, formatted version of the article will be published soon. Select one of your emails You have multiple emails registered with Frontiers: Notify me on publication Please enter your email address: If you already have an account, pleaselogin You don't have a Frontiers account ? You canregister here Contactless Human Activity Recognition (HAR) has played a critical role in smart healthcare and elderly care homes to monitor patient behaviour, detect falls or abnormal activities in real time.The effectiveness of non-invasive HAR is often hindered by location-centric variations in Channel State Information (CSI). These variations limit the ability of HAR models to generalise across new unseen cross-domain environments, for instance a model trained in one location might not perform well in another physical location. To address this challenge, in this paper, we present a novel Federated Learning (FL) algorithm designed to train a robust global model from local datasets in different localisations. The proposed Federated Weighted Averaging for HAR (Fed-WAHAR) algorithm mitigates location-induced disparities, including heterogeneity and non-Independent and Identically Distributed (non-IID) data distributions. Fed-WAHAR employs a dynamic weighting approach based on local models' accuracy to improve global model classification accuracy and reduce convergence time effectively. We evaluated the performance of Fed-WAHAR using various metrics, including accuracy, precision, recall, F1 score, confusion matrix, and convergence analysis. Experimental results demonstrate that Fed-WAHAR achieves an accuracy of 85% in recognising human activities across different locations, enhancing the ability of model to infer across new unseen locations. Keywords:Federated learning, Human activity recognition, non-independent and identically distributed (non-iid) data, localisation, Weighted averaging Received:16 Apr 2025;Accepted:05 Jun 2025. Copyright:© 2025KHAN, Yaseen Shah, Ahmad, Al Mazroa, Zahid, Ilyas, Abbasi and Shah. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) or licensor are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. * Correspondence:FAWAD KHAN, Coventry University, Coventry, United Kingdom Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Share on Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}