{"id": 2194, "name": "Adobo Chronicles", "domain": "adobochronicles.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://adobochronicles.com/2019/02/17/feature-the-otter-side-of-the-exotic-animal-trade-via-facebook/", "title": "Feature The Otter Side Of The Exotic Animal Trade Via Facebook", "content": "**The Adobo Chronicles** Adobo What? About Us The Book Version Projects We Support Contact Us Adobo Chronicles FILMS The Adobo Chronicles Team **Feature: The Otter Side Of The Exotic Animal Trade Via Facebook** (Editor’s note: Every now and then,The Adobo Chroniclesgets serious about issues regarding the destruction of our environment or removing wild animals from their natural habitat. This feature article is in defense of baby otters) Baby otters have become the new trend in the trade of exotic animals via Facebook Anyone who has seen photos or video clips of otters “rafting” or holding hands, would have at some point of time dreamt of holding an otter’s hand! However, some people are taking this fantasy to another level wherein they look in the market to buy otters to keep as pets. There are many promoters that can be found on social media websites that are looking to sell exotic animals. Most of these pet influencers operate with the motive of making a quick profit. This ends up risking the lives of many animals that are considered vulnerable in the risk of extinction index. One such animal is the small-clawed Otter that can be found in Asia. However, the current trend is not something that is uncommon. From time immemorial there have been manyexotic animals that people have keptsuch as snakes, flying squirrels, Mexican red-legged tarantulas, thus making the otter trade only the latest trend. The convenience of Facebook and online payments According to a PhD researcher from Oxford Brookes University from Thailand, there has been a rapid increase in the number of posts aimed at the sale of otters. As per his observations,Facebook is the most popular medium that is usedfor the purpose of offering the sale of both illegal and legal wildlife that are to be sold as pets. In Thailand, the trade of otters is commonplace and there are many Facebook groups that exist for the same. The fact that such trade is not regulated and that most exchanges do not require face-to-face interaction between the buyer and the seller has caused for the trade to flourish. Furthermore, with the increased number of methods to conduct payment through online transactions the trade has become even more convenient. Otters make bad pets Despite the fact that otters are pretty, playful, cute animals that are quite the right size- with them being not too tiny or too big; they make terrible pets. This is because of their traits being more suited to exist in the wild. Unlike animals such as cats, dogs, guinea pigs or horses that have been domesticated over a period of many thousands of years, the domestication of otters is something that has been happening very recently. It has been noticed by many researchers that otters require a lot of special care and attention. That coupled with the fact that they can tend to be very loud, leads to them being abandoned and left to be rescued. The risk of trafficking Owing to the fact that otters live in groups of around 15 members in sources of fresh water, taking them away from their natural habitat comes with many risks. The lucky ones only manage to get isolated and placed in bathtubs in unfamiliar places. Furthermore, the process of transportation does not allow for many of them to reach adulthood as they are deprived of the care that they could have received from their mothers. In the current scenario, otters do not fall in the priority category in the eyes of law enforcement. There is no such legal process that is present that can aid in preventing the trade of otters. The only manner in which such a dangerous trade can be prevented is if platforms such as Facebook actually collaborate and help in finding those responsible for conducting it. **Rate this:** **Share this:** Click to share on Reddit (Opens in new window)Reddit Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to email a link to a friend (Opens in new window)Email Click to share on Pinterest (Opens in new window)Pinterest Click to share on Tumblr (Opens in new window)Tumblr **Related** **Post navigation** **Leave a commentCancel reply** This site uses Akismet to reduce spam.Learn how your comment data is processed. **GLOBAL EDITION** The Adobo Chronicles is a registered trademark with the U.S. Patent and Trademark Office | Registration # 4711386 **Views** 28,483,162 hits **Gallery Of Our Most Viewed Stories** This slideshow requires JavaScript. **Adobo Chronicles Official Music Video** **NEW!!!** **Recent Posts** Our Curtain CallJune 5, 2025 (Senate) Class Dismissed!June 4, 2025 Imee Marcos’ Great RedemptionJune 2, 2025 End Of An Era, err, of an ElonMay 30, 2025 Donald Trump’s Golden Dome Over The U.S.May 30, 2025 **SEARCH BY KEY WORDS** **Follow us on Twitter** **LIKE US ON FACEBOOK** **Follow Blog via Email** Enter your email address to follow this blog and receive notifications of new posts by email. Email Address: Follow **Support Us!** **ARCHIVES** **The Otter Side Of The Exotic Animal Trade** **Your best source of up-to-date, unbelievable news.** Limited edition CDs of the new song single, “SINYOR” now available on Shopee. ClickHEREto order. Comment Reblog SubscribeSubscribedThe Adobo ChroniclesJoin 1,497 other subscribersSign me upAlready have a WordPress.com account?Log in now. The Adobo Chronicles Already have a WordPress.com account?Log in now. The Adobo Chronicles Already have a WordPress.com account?Log in now. The Adobo ChroniclesSubscribeSubscribedSign upLog inCopy shortlinkReport this contentView post in ReaderManage subscriptionsCollapse this bar The Adobo Chronicles SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar The Adobo Chronicles SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar **** **** You must belogged into post a comment. ****"}