{"id": 1651, "name": "National Youth Right Association", "domain": "youthrights.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.youthrights.org/issues/medical-autonomy/who-decides-what-a-mental-disorder-is/", "title": "Who Decides What A Mental Disorder Is", "content": "ABOUTExpandWhat We DoWhy We Do ItExpandLand AcknowledgementWhat Are Youth Rights?ExpandPrinciples of Anti-AgeismResourcesOur TeamOur MovementContact Us What We Do Why We Do ItExpandLand Acknowledgement Land Acknowledgement What Are Youth Rights?ExpandPrinciples of Anti-AgeismResources Principles of Anti-Ageism Resources Our Team Our Movement Contact Us What We Do Why We Do ItExpandLand Acknowledgement Land Acknowledgement Land Acknowledgement What Are Youth Rights?ExpandPrinciples of Anti-AgeismResources Principles of Anti-Ageism Resources Principles of Anti-Ageism Resources Our Team Our Movement Contact Us ISSUESExpandMedical AutonomyExpandMaking Decisions About TreatmentWho Decides What a Mental Disorder Is?The “Troubled Teen” IndustryStudent RightsExpandStudent Bill of RightsAcademic FreedomCorporal Punishment in SchoolDress Codes and UniformsFree Speech in SchoolsThe Pledge of Allegiance and the National AnthemPolicing and Punishment in SchoolsSearch and SeizureStudent ClubsStudent Decision-makingRestraint and SeclusionFighting for Students’ Rights through the CourtsAge DiscriminationExpandBusiness DiscriminationCensorshipDriving AgeLaborVoting AgeExpandTop Ten Reasons to Lower the Voting AgeVoting Age Status ReportVoting Age: Facts and ResourcesThe Movement to Lower the Voting Age: A HistoryAge of CandidacyDrinking AgeExpandReasons to Challenge the Drinking AgeDrinking Age: Facts and ResourcesSolutions and Alternatives to the Drinking AgeState Guide to Drinking Age LawThe National Minimum Drinking Age ActCurfewExpandTop Five Reasons to Abolish CurfewsCurfew Laws by State Medical AutonomyExpandMaking Decisions About TreatmentWho Decides What a Mental Disorder Is?The “Troubled Teen” Industry Making Decisions About Treatment Who Decides What a Mental Disorder Is? The “Troubled Teen” Industry Student RightsExpandStudent Bill of RightsAcademic FreedomCorporal Punishment in SchoolDress Codes and UniformsFree Speech in SchoolsThe Pledge of Allegiance and the National AnthemPolicing and Punishment in SchoolsSearch and SeizureStudent ClubsStudent Decision-makingRestraint and SeclusionFighting for Students’ Rights through the Courts Student Bill of Rights Academic Freedom Corporal Punishment in School Dress Codes and Uniforms Free Speech in Schools The Pledge of Allegiance and the National Anthem Policing and Punishment in Schools Search and Seizure Student Clubs Student Decision-making Restraint and Seclusion Fighting for Students’ Rights through the Courts Age DiscriminationExpandBusiness DiscriminationCensorshipDriving AgeLabor Business Discrimination Censorship Driving Age Labor Voting AgeExpandTop Ten Reasons to Lower the Voting AgeVoting Age Status ReportVoting Age: Facts and ResourcesThe Movement to Lower the Voting Age: A HistoryAge of Candidacy Top Ten Reasons to Lower the Voting Age Voting Age Status Report Voting Age: Facts and Resources The Movement to Lower the Voting Age: A History Age of Candidacy Drinking AgeExpandReasons to Challenge the Drinking AgeDrinking Age: Facts and ResourcesSolutions and Alternatives to the Drinking AgeState Guide to Drinking Age LawThe National Minimum Drinking Age Act Reasons to Challenge the Drinking Age Drinking Age: Facts and Resources Solutions and Alternatives to the Drinking Age State Guide to Drinking Age Law The National Minimum Drinking Age Act CurfewExpandTop Five Reasons to Abolish CurfewsCurfew Laws by State Top Five Reasons to Abolish Curfews Curfew Laws by State Medical AutonomyExpandMaking Decisions About TreatmentWho Decides What a Mental Disorder Is?The “Troubled Teen” Industry Making Decisions About Treatment Who Decides What a Mental Disorder Is? The “Troubled Teen” Industry Making Decisions About Treatment Who Decides What a Mental Disorder Is? The “Troubled Teen” Industry Student RightsExpandStudent Bill of RightsAcademic FreedomCorporal Punishment in SchoolDress Codes and UniformsFree Speech in SchoolsThe Pledge of Allegiance and the National AnthemPolicing and Punishment in SchoolsSearch and SeizureStudent ClubsStudent Decision-makingRestraint and SeclusionFighting for Students’ Rights through the Courts Student Bill of Rights Academic Freedom Corporal Punishment in School Dress Codes and Uniforms Free Speech in Schools The Pledge of Allegiance and the National Anthem Policing and Punishment in Schools Search and Seizure Student Clubs Student Decision-making Restraint and Seclusion Fighting for Students’ Rights through the Courts Student Bill of Rights Academic Freedom Corporal Punishment in School Dress Codes and Uniforms Free Speech in Schools The Pledge of Allegiance and the National Anthem Policing and Punishment in Schools Search and Seizure Student Clubs Student Decision-making Restraint and Seclusion Fighting for Students’ Rights through the Courts Age DiscriminationExpandBusiness DiscriminationCensorshipDriving AgeLabor Business Discrimination Censorship Driving Age Labor Business Discrimination Censorship Driving Age Labor Voting AgeExpandTop Ten Reasons to Lower the Voting AgeVoting Age Status ReportVoting Age: Facts and ResourcesThe Movement to Lower the Voting Age: A HistoryAge of Candidacy Top Ten Reasons to Lower the Voting Age Voting Age Status Report Voting Age: Facts and Resources The Movement to Lower the Voting Age: A History Age of Candidacy Top Ten Reasons to Lower the Voting Age Voting Age Status Report Voting Age: Facts and Resources The Movement to Lower the Voting Age: A History Age of Candidacy Drinking AgeExpandReasons to Challenge the Drinking AgeDrinking Age: Facts and ResourcesSolutions and Alternatives to the Drinking AgeState Guide to Drinking Age LawThe National Minimum Drinking Age Act Reasons to Challenge the Drinking Age Drinking Age: Facts and Resources Solutions and Alternatives to the Drinking Age State Guide to Drinking Age Law The National Minimum Drinking Age Act Reasons to Challenge the Drinking Age Drinking Age: Facts and Resources Solutions and Alternatives to the Drinking Age State Guide to Drinking Age Law The National Minimum Drinking Age Act CurfewExpandTop Five Reasons to Abolish CurfewsCurfew Laws by State Top Five Reasons to Abolish Curfews Curfew Laws by State Top Five Reasons to Abolish Curfews Curfew Laws by State TAKE ACTIONExpandDonateVolunteerTRAIN IN ACTIVISMExpandHow to be a Spokesperson for Youth RightsWorking with Elected OfficialsMedia Guide to Promoting Youth RightsOrganizing a Protest, Walkout or BoycottHow to Change Policy at SchoolHow to do Outreach in your School and CommunityHow to Promote Youth Rights OnlineHow to FundraiseHow to Direct Your Own EducationBecome A MemberFORM A NODEActive NodesNYRA Merch! Donate Volunteer TRAIN IN ACTIVISMExpandHow to be a Spokesperson for Youth RightsWorking with Elected OfficialsMedia Guide to Promoting Youth RightsOrganizing a Protest, Walkout or BoycottHow to Change Policy at SchoolHow to do Outreach in your School and CommunityHow to Promote Youth Rights OnlineHow to FundraiseHow to Direct Your Own Education How to be a Spokesperson for Youth Rights Working with Elected Officials Media Guide to Promoting Youth Rights Organizing a Protest, Walkout or Boycott How to Change Policy at School How to do Outreach in your School and Community How to Promote Youth Rights Online How to Fundraise How to Direct Your Own Education Become A Member FORM A NODE Active Nodes NYRA Merch! Donate Volunteer TRAIN IN ACTIVISMExpandHow to be a Spokesperson for Youth RightsWorking with Elected OfficialsMedia Guide to Promoting Youth RightsOrganizing a Protest, Walkout or BoycottHow to Change Policy at SchoolHow to do Outreach in your School and CommunityHow to Promote Youth Rights OnlineHow to FundraiseHow to Direct Your Own Education How to be a Spokesperson for Youth Rights Working with Elected Officials Media Guide to Promoting Youth Rights Organizing a Protest, Walkout or Boycott How to Change Policy at School How to do Outreach in your School and Community How to Promote Youth Rights Online How to Fundraise How to Direct Your Own Education How to be a Spokesperson for Youth Rights Working with Elected Officials Media Guide to Promoting Youth Rights Organizing a Protest, Walkout or Boycott How to Change Policy at School How to do Outreach in your School and Community How to Promote Youth Rights Online How to Fundraise How to Direct Your Own Education Become A Member FORM A NODE Active Nodes NYRA Merch! Blog **Who Decides What a Mental Disorder Is?** The definition of a mental disorder is a“dysfunction in the psychological, biological, or developmental processes underlying mental functioning.”Unfortunately, this definition is vague and leavesmuch room for debate and criticism. Since it is not entirely clear what “dysfunction” means, the nature of mental disorders is usually open to interpretation. This is especially problematic for young people who don’t have medical autonomy, because they can be controlled by the interpretations and decisions of their parents. Unlike adults, who have an unspoken amount of control and respect when they visit a doctor with symptoms, youth are in an inherent position of inferiority because of their age. This can lead to doctors misdiagnosing symptoms “as typical adolescent mood swings” when they are indicative of something much more serious, like depression or anxiety. This discrimination may occur because the person is young, or because parentsignoreimportant symptoms — potentially out of fear, ignorance, or disbelief. Problems with diagnosis can go both ways, however other types of mental disorders like ADHD are thought to beoverdiagnosedin youth. Both misdiagnosis and underdiagnosis have one thing in common though; they can be traced to discrimination towards young people who are not always given the freedom or respect to make decisions for themselves. Young people who come into conflict with their parents, their schools, or the law are often diagnosed with mental disorders. While these diagnoses can be helpful to struggling youth, there is also potential for overdiagnosis. Psychiatry has diagnosed several mental disorders that only apply to young people who are in conflict with adults or institutions (like schools), such as oppositional defiant disorder (ODD). At the same time, psychiatry has diagnosed few or no specialized mental disorders that apply the other way around: to adults who are in conflict with young people. This indicates a trend of pathologizing certain adolescent behaviors. **Oppositional Defiant Disorder and Conduct Disorder** The symptoms of other common disorders ascribed to youth, such as ODD, are shockingly ordinary and inexact. It is commonly known that most modern humans go through a developmental phase of cynicism andrebellion during adolescence(anywhere from 9 to 23), where opposition and defiance is considered normal. Although ODD allegedly does not apply to “normal” teenage rebellion, it still seeks to pathologize the defiance of authority. Whenever resistance of authority is even a criterion for a mental disorder, we should consider the possibility of discrimination against youth. In 2014, up to16% of adolescentswere diagnosable with some form of ODD. While many of these young people may indeed have ODD, it’s important to keep in mind that defiance in adolescence isa sensible reaction to the way young people are treatedand does not always indicate a mental disorder. Ageism can also sneak into the diagnostic criteria for other disorders. For example, conduct disorder is classified as “a repetitive and persistent pattern of behavior in which the basic rights of others orma­jor age-appropriate societal norms or rules are violated.” While there are some serious behaviors covered in the diagnosis (most of which involve violence), it is possible for someone to be diagnosed for running away or being truant, even though these may indicate an issue with choices made by the parent. The phrase “societal norms” in the diagnostic criteria is also cause for concern, because it suggests a bias against young people who don’t fit the mold of social constructs. These norms can be harmful by encouraging conformity rather than individuality; diagnosing young people because they violate such norms can be deeply problematic. In theDSM-5criteria, these are some questionable symptoms of conduct disorder: 13. Often stays out at night despite parental prohibitions, beginning before age 13 years. 14. Has run away from home overnight at least twice while living in the parental or pa­rental surrogate home, or once without returning for a lengthy period. 15. Is often truant from school, beginning before age 13 years. **Reactive Attachment Disorder** This uncommon disorder can be diagnosed in infancy and is thought to involve “a lack of attachment to any specific caregiver at an early age, and results in an inability for the child to form normal, loving relationships.” Unfortunately, the diagnosis is sometimes accompanied by disturbing “attachment therapy,” which involves a “re-birthing” simulation and “resulted in the injury and death of several children whowere in the foster care system.” These tragic abuses illustrate the discrimination against youth that can occur in the mental health care field, especially when the young people are in an underprivileged position. Youth diagnosed with RAD, particularly if they are infants, cannot stand up for themselves like adults can in medical treatments settings. It’s not a coincidence that such disturbing treatment is only given to young people, who have been taken advantage of and abused as a result of this diagnosis. Some victims of the treatment “complained about being in pain” but were not believed. This tragedy begs the question: would we believe adults? **Attention-Deficit/Hyperactivity Disorder** To diagnose ADHD, a child under 17 must exhibit at leastsix of nine symptomsin both the category of inattention and hyperactivity for six months in multiple settings. This seems like a fairly stringent set of requirements. However, the symptoms are extremely subjective and generalized, including “talking excessively,” “having trouble organizing tasks,” and “feeling restless.” Every single symptom can just as easily be attributed to the burst of developmental energy common in seven-year-olds (theaverage ageof ADHD diagnosis), or a surge in testosterone typical of that age of boys. After all, boys aremore than twice as likelyto be diagnosed with ADHD than girls. It is simply not in the hormonal or psychological nature of developing children to remain seated still and silent at a desk for several uninterrupted hours with such a small amount of mental stimulation, every day, for months at a time. The explanation for psychiatric disorders is typically simplified as a “chemical imbalance,” and children may very well have an imbalance of neurochemicals. However, the imbalance may be caused by many different variables (often temporary, developmental ones), and the problem may not even be a lack of the chemical, but rather another issue entirely that presents itself in a way similar to the symptoms of the disorder. When students are restless and unable to focus in school, this is a failure not only on the student’s part, buton the school’s part as well. Schools do not take their fair share of the responsibility for these failures. When teachers cannot hold students’ attention, the students risk being diagnosed with a mental disorder, which tells them that they lack focus and discipline. Meanwhile, teachers do not risk being diagnosed with a mental disorder for making other people restless. In addition to this double standard, ADHD also turns an institutional problem into a medical one. Instead of addressing inattention byreforming schools and teaching methods, society can address it by medicating inattentive students.69.3%of children with a current diagnosis of ADHD have received medication for it. These medications are serious prescription drugs, and come with a variety ofshort-termandlong-termside effects. This trend of addressing potential institutional problems with prescription-grade medication has troubling implications for our society. **Autism Spectrum Disorder** Autism Spectrum Disorder (ASD) is another prime example of misdiagnosis of youth. It’s not uncommon to hear a small child unknowingly blurt out an insensitive or painfully blunt comment because they do not yet recognize the social constructs surrounding different ideas. There are certainperiodswhen kids develop advanced social skills, like understanding euphemisms and deciphering facial expressions, but they do not always fit the strict criteria laid out by professionals. Young people must learn skills to ride a bike, read books, and even walk, so of course it would take years for them for be socialized. For some, it simply requires more time. That is why it is estimated that13 percentof all children who have been diagnosed with autism were misdiagnosed. Despite these instances of misdiagnosis, the correct identification of autism spectrum disorder can change lives for the better. After his diagnosis in adulthood, artist Martin Robinson “began to understand himself by identifying triggers and learning coping strategies in order to better function in day-to-day life.” This is the purpose of mental health treatment, and youth who are helped by such treatment should not be ignored. In fact, ignoring mental disorders can contribute to thestigmaof all mental illnesses by making them even harder to discuss. However, it’s also important to remember that the misdiagnosis of youthcanoccur, and may very well result from traits linked to adolescence. The prevalence of these misdiagnoses begs the question: is psychiatry always treating the children, or is it sometimes treating the parents and teachers by conforming classrooms to asingle standard of compliant behavior? Furthermore, youth with autism often experience extreme discrimination, including violence, from their own parents who treat Autism as a disease that needs to be cured instead of respecting their children’s’ identities. These parents often engage inactivism claiming there is something wrong with their childrenand not giving the youth a chance to stand up for themselves. Autistic youth are often forced into “special education” programs against their will, and sometimesabusive behavior modification facilities. To an even greater extent than other youth, youth with autism are treated as if they are not capable of making their own decisions. **Drugs and Youth** While many medications can effectively address psychological issues, youth should have some control over their treatment plans. People under eighteen are “often allowed to consent to treatment for . . . substance abuse, mental health care, and birth control,” but these rules vary by state and are thus not guaranteed. Even though there are dozens of international regulatory precautions on them, American youth are often not educated on the repercussions of psychotropic drugs. To decrease ageism in the mental health sector, young people should be educated and given a voice in their medical treatment plans. In fact, it is often insisted that healthy children have disorders and require medication simply to make them more manageable, or in extreme cases, sedated. Foster children are at leastfour timesas likely to be on a psychotropic drug, and over40%of those children were giventhree or moreadditional medications within the same month. Medicating at that level can bring tremendous hazards, even under very careful regulation. While children in foster care aredisproportionately exposed to traumathat may cause or exacerbate mental illness and behavioural disorders, this doesnot accountfor the disparity of prescriptions between them and the rest of the population. Children in foster care are often prescribed medication without proper psychotherapy because theylack the resources or stability(initial diagnosis, ongoing monitoring and check-ups). For example, there isevidence that ongoingtherapy can work as well as medications for some disorders, but children in foster care don’t often have this opportunity. Most often, the parents are listening to the licensed physician, representing aone-trillion dollarindustry that conceals as much information as legally possible. Demanding that a child changes because their behavior is undesirable is cruelty. Forcing them into that change without their consent or knowledge, despite potentially permanent psychological damage, is child abuse. Using chemical manipulation to control children while making a profit should be illegal. **RelatedPages** **The “Troubled Teen” Industry** **Academic Freedom** **Start a Chapter** **OurBlog** Validate EmailJOIN OUR NEWSLETTER*Get Updates Terms of Use Privacy Policy Copyright © 2025 NYRA.All Rights Reserved. **About** What We Do Why We Do It What Are Youth Rights? Our Team Our Movement Contact Us **Blog** **Issues** Age Discrimination Curfew Drinking Age Medical Autonomy Student Rights Voting Age **Take Action** Volunteer Donate Train in Activism Become a Member Form a Node Active Nodes NYRA Merch! **Sitemap** **Sitemap** **Address** National Youth Rights Association5557 Baltimore AveSuite 500-2039Hyattsville, MD 20781 NYRA is a 501(c)(3) nonprofit corporation. ABOUTToggle child menuExpandWhat We DoWhy We Do ItToggle child menuExpandLand AcknowledgementWhat Are Youth Rights?Toggle child menuExpandPrinciples of Anti-AgeismResourcesOur TeamOur MovementContact Us What We Do Why We Do ItToggle child menuExpandLand Acknowledgement Land Acknowledgement What Are Youth Rights?Toggle child menuExpandPrinciples of Anti-AgeismResources Principles of Anti-Ageism Resources Our Team Our Movement Contact Us What We Do Why We Do ItToggle child menuExpandLand Acknowledgement Land Acknowledgement Land Acknowledgement What Are Youth Rights?Toggle child menuExpandPrinciples of Anti-AgeismResources Principles of Anti-Ageism Resources Principles of Anti-Ageism Resources Our Team Our Movement Contact Us ISSUESToggle child menuExpandMedical AutonomyToggle child menuExpandMaking Decisions About TreatmentWho Decides What a Mental Disorder Is?The “Troubled Teen” IndustryStudent RightsToggle child menuExpandStudent Bill of RightsAcademic FreedomCorporal Punishment in SchoolDress Codes and UniformsFree Speech in SchoolsThe Pledge of Allegiance and the National AnthemPolicing and Punishment in SchoolsSearch and SeizureStudent ClubsStudent Decision-makingRestraint and SeclusionFighting for Students’ Rights through the CourtsAge DiscriminationToggle child menuExpandBusiness DiscriminationCensorshipDriving AgeLaborVoting AgeToggle child menuExpandTop Ten Reasons to Lower the Voting AgeVoting Age Status ReportVoting Age: Facts and ResourcesThe Movement to Lower the Voting Age: A HistoryAge of CandidacyDrinking AgeToggle child menuExpandReasons to Challenge the Drinking AgeDrinking Age: Facts and ResourcesSolutions and Alternatives to the Drinking AgeState Guide to Drinking Age LawThe National Minimum Drinking Age ActCurfewToggle child menuExpandTop Five Reasons to Abolish CurfewsCurfew Laws by State Medical AutonomyToggle child menuExpandMaking Decisions About TreatmentWho Decides What a Mental Disorder Is?The “Troubled Teen” Industry Making Decisions About Treatment Who Decides What a Mental Disorder Is? The “Troubled Teen” Industry Student RightsToggle child menuExpandStudent Bill of RightsAcademic FreedomCorporal Punishment in SchoolDress Codes and UniformsFree Speech in SchoolsThe Pledge of Allegiance and the National AnthemPolicing and Punishment in SchoolsSearch and SeizureStudent ClubsStudent Decision-makingRestraint and SeclusionFighting for Students’ Rights through the Courts Student Bill of Rights Academic Freedom Corporal Punishment in School Dress Codes and Uniforms Free Speech in Schools The Pledge of Allegiance and the National Anthem Policing and Punishment in Schools Search and Seizure Student Clubs Student Decision-making Restraint and Seclusion Fighting for Students’ Rights through the Courts Age DiscriminationToggle child menuExpandBusiness DiscriminationCensorshipDriving AgeLabor Business Discrimination Censorship Driving Age Labor Voting AgeToggle child menuExpandTop Ten Reasons to Lower the Voting AgeVoting Age Status ReportVoting Age: Facts and ResourcesThe Movement to Lower the Voting Age: A HistoryAge of Candidacy Top Ten Reasons to Lower the Voting Age Voting Age Status Report Voting Age: Facts and Resources The Movement to Lower the Voting Age: A History Age of Candidacy Drinking AgeToggle child menuExpandReasons to Challenge the Drinking AgeDrinking Age: Facts and ResourcesSolutions and Alternatives to the Drinking AgeState Guide to Drinking Age LawThe National Minimum Drinking Age Act Reasons to Challenge the Drinking Age Drinking Age: Facts and Resources Solutions and Alternatives to the Drinking Age State Guide to Drinking Age Law The National Minimum Drinking Age Act CurfewToggle child menuExpandTop Five Reasons to Abolish CurfewsCurfew Laws by State Top Five Reasons to Abolish Curfews Curfew Laws by State Medical AutonomyToggle child menuExpandMaking Decisions About TreatmentWho Decides What a Mental Disorder Is?The “Troubled Teen” Industry Making Decisions About Treatment Who Decides What a Mental Disorder Is? The “Troubled Teen” Industry Making Decisions About Treatment Who Decides What a Mental Disorder Is? The “Troubled Teen” Industry Student RightsToggle child menuExpandStudent Bill of RightsAcademic FreedomCorporal Punishment in SchoolDress Codes and UniformsFree Speech in SchoolsThe Pledge of Allegiance and the National AnthemPolicing and Punishment in SchoolsSearch and SeizureStudent ClubsStudent Decision-makingRestraint and SeclusionFighting for Students’ Rights through the Courts Student Bill of Rights Academic Freedom Corporal Punishment in School Dress Codes and Uniforms Free Speech in Schools The Pledge of Allegiance and the National Anthem Policing and Punishment in Schools Search and Seizure Student Clubs Student Decision-making Restraint and Seclusion Fighting for Students’ Rights through the Courts Student Bill of Rights Academic Freedom Corporal Punishment in School Dress Codes and Uniforms Free Speech in Schools The Pledge of Allegiance and the National Anthem Policing and Punishment in Schools Search and Seizure Student Clubs Student Decision-making Restraint and Seclusion Fighting for Students’ Rights through the Courts Age DiscriminationToggle child menuExpandBusiness DiscriminationCensorshipDriving AgeLabor Business Discrimination Censorship Driving Age Labor Business Discrimination Censorship Driving Age Labor Voting AgeToggle child menuExpandTop Ten Reasons to Lower the Voting AgeVoting Age Status ReportVoting Age: Facts and ResourcesThe Movement to Lower the Voting Age: A HistoryAge of Candidacy Top Ten Reasons to Lower the Voting Age Voting Age Status Report Voting Age: Facts and Resources The Movement to Lower the Voting Age: A History Age of Candidacy Top Ten Reasons to Lower the Voting Age Voting Age Status Report Voting Age: Facts and Resources The Movement to Lower the Voting Age: A History Age of Candidacy Drinking AgeToggle child menuExpandReasons to Challenge the Drinking AgeDrinking Age: Facts and ResourcesSolutions and Alternatives to the Drinking AgeState Guide to Drinking Age LawThe National Minimum Drinking Age Act Reasons to Challenge the Drinking Age Drinking Age: Facts and Resources Solutions and Alternatives to the Drinking Age State Guide to Drinking Age Law The National Minimum Drinking Age Act Reasons to Challenge the Drinking Age Drinking Age: Facts and Resources Solutions and Alternatives to the Drinking Age State Guide to Drinking Age Law The National Minimum Drinking Age Act CurfewToggle child menuExpandTop Five Reasons to Abolish CurfewsCurfew Laws by State Top Five Reasons to Abolish Curfews Curfew Laws by State Top Five Reasons to Abolish Curfews Curfew Laws by State TAKE ACTIONToggle child menuExpandDonateVolunteerTRAIN IN ACTIVISMToggle child menuExpandHow to be a Spokesperson for Youth RightsWorking with Elected OfficialsMedia Guide to Promoting Youth RightsOrganizing a Protest, Walkout or BoycottHow to Change Policy at SchoolHow to do Outreach in your School and CommunityHow to Promote Youth Rights OnlineHow to FundraiseHow to Direct Your Own EducationBecome A MemberFORM A NODEActive NodesNYRA Merch! Donate Volunteer TRAIN IN ACTIVISMToggle child menuExpandHow to be a Spokesperson for Youth RightsWorking with Elected OfficialsMedia Guide to Promoting Youth RightsOrganizing a Protest, Walkout or BoycottHow to Change Policy at SchoolHow to do Outreach in your School and CommunityHow to Promote Youth Rights OnlineHow to FundraiseHow to Direct Your Own Education How to be a Spokesperson for Youth Rights Working with Elected Officials Media Guide to Promoting Youth Rights Organizing a Protest, Walkout or Boycott How to Change Policy at School How to do Outreach in your School and Community How to Promote Youth Rights Online How to Fundraise How to Direct Your Own Education Become A Member FORM A NODE Active Nodes NYRA Merch! Donate Volunteer TRAIN IN ACTIVISMToggle child menuExpandHow to be a Spokesperson for Youth RightsWorking with Elected OfficialsMedia Guide to Promoting Youth RightsOrganizing a Protest, Walkout or BoycottHow to Change Policy at SchoolHow to do Outreach in your School and CommunityHow to Promote Youth Rights OnlineHow to FundraiseHow to Direct Your Own Education How to be a Spokesperson for Youth Rights Working with Elected Officials Media Guide to Promoting Youth Rights Organizing a Protest, Walkout or Boycott How to Change Policy at School How to do Outreach in your School and Community How to Promote Youth Rights Online How to Fundraise How to Direct Your Own Education How to be a Spokesperson for Youth Rights Working with Elected Officials Media Guide to Promoting Youth Rights Organizing a Protest, Walkout or Boycott How to Change Policy at School How to do Outreach in your School and Community How to Promote Youth Rights Online How to Fundraise How to Direct Your Own Education Become A Member FORM A NODE Active Nodes NYRA Merch! Blog"}