{"id": 1119, "name": "The Post-Journal (Jamestown, New york)", "domain": "post-journal.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.post-journal.com/news/local-news/2025/06/strengthening-communities-former-students-staff-rally-to-save-job-corps/", "title": "Strengthening Communities Former Students Staff Rally To Save Job Corps", "content": "NewsTop storiesLocal NewsPolice ReportsBrieflyBusinessCommunityCorrectionsNew York NewsNational NewsInternational News Top stories Local News Police Reports Briefly Business Community Corrections New York News National News International News Top stories Local News Police Reports Briefly Business Community Corrections New York News National News International News SportsLocal SportsNational SportsNew York Sports Local Sports National Sports New York Sports Local Sports National Sports New York Sports OpinionIn Our OpinionLetters To The EditorLocal Commentaries In Our Opinion Letters To The Editor Local Commentaries In Our Opinion Letters To The Editor Local Commentaries LifeFeaturesFocus On SchoolsViewpointsEngagementsWeddingsAnniversariesArts/EntertainmentNatureBirthsSenior News Features Focus On Schools Viewpoints Engagements Weddings Anniversaries Arts/Entertainment Nature Births Senior News Features Focus On Schools Viewpoints Engagements Weddings Anniversaries Arts/Entertainment Nature Births Senior News Obituaries Classifieds Jobs Garage Sales Contact InformationContact UsSubscribeAdvertiseStatement of ValuesTerms of Service Contact Us Subscribe Advertise Statement of Values Terms of Service Contact Us Subscribe Advertise Statement of Values Terms of Service Submit News Public NoticesBrowse NoticesPlace a notice Browse Notices Place a notice Browse Notices Place a notice Facebook Twitter News Sports Opinion Life Obituaries Classifieds Jobs Garage Sales Place Notice SUBSCRIBE SUBSCRIBE June 11, 2025 | Today's Paper | Submit News | Latest Videos | Subscribe Today Today's Paper | Subscribe **‘Strengthening communities’: Former Students, Staff Rally To Save Job Corps** **** Jun 11, 2025 A large crowd gathered at the Stockton Fire Hall for a rally in support of Job Corps. P -J photos by Gregory Bacon A large crowd gathered at the Stockton Fire Hall for a rally in support of Job Corps. P -J photos by Gregory BaconSTOCKTON – Arlene Tariq was the daughter of a single mother with no financial support. She started working at 16 years old to help support the household, but as her grades slipped, she dropped out of City Tech in Brooklyn. Today she is a licensed master social worker and earns $75 an hour. Tariq shared her story as a testimony of what Job Corps has done in her life. “I felt like I was falling through the cracks. I needed a change,” Tariq said to a room full of people at the Stockton Fire Hall, four miles away from the place where she found her purpose and passion in life. Tariq attended the Cassadaga Job Corps in 2016, graduated, and earned her certifications to be a certified nursing assistant and home health aide. She was later able to attend Jamestown Community College, State University at Fredonia and eventually got her masters degree from the University of Buffalo. She is now an adolescent and adult psychotherapist in Amherst. “I help adolescents who, like me, need someone to believe in them and a system that won’t give up on them,” Tariq said. As a former student, Tariq is calling on Job Corps to remain in place and continue helping teenagers and young adults from disadvantaged backgrounds to obtain high school diplomas or an equivalent, vocational certificates and licenses and on-the-job training. On May 29, the U.S. Department of Labor announced that it was “pausing Job Corps Center operations at contractor-operated Job Corps centers nationwide.” The Cassadaga Job Corps is one of 99 non-federally operated Job Corps centers. Last week, a federal judge issued a temporary restraining order that the government not terminate Job Corps contractors or stop work at Job Corps centers until a further ruling in the case. When the Labor Department initially announced the end of the program, one of the reasons it cited was a low graduation rate, saying less than 40% were getting their GED and a certificate in a training program. Jake Brock, the president of Job Corps’ Union called “Guardians of the Hill,” said he doesn’t know if that national number is accurate, but he said that’s not the case locally. “In Cassadaga, we have almost a 90% completion rate and a 90% placement rate with students after they finish our program,” he said in an interview. When Brock spoke during the rally, he noted that Job Corps also helps society as a whole. “These centers don’t just shape individual futures. They strengthen entire communities. In places like Cassadaga and throughout the surrounding regions, Job Corps provides the skilled motivated workers that the local businesses depend on. It drives economic growth, stability, and hope, not just for the students, but for the towns that grow with them,” he said. According to Brock, the Cassadaga Job Corps had about 165 students before the pause was issued. Job Corps was in the process of sending students home before the temporary retaining order was issued. Now they have about 130 students on the campus on Glasgow Road in the town of Pomfret. Between full- and part-time staff, Brock said they have 117 positions, although some of those positions are vacant. Triston Vera said when he was younger he was essentially homeless, “couch-surfing” from various friends’ homes, as his mother struggled with addiction. Today he works for Absolut Care in Westfield. “Job Corps was my lifeline. Without it, life would look very different, and not in a good way,” he said. Stephen Storey was living in Dunkirk with his grandmother, but applied to live at Job Corps. “I chose to live on campus in Cassadaga because I wanted more than a skill. I wanted structure, support and a fresh start and that’s exactly what I got,” he said. Today Storey has a job where he interprets architectural and engineering drawings. “A Job Corps doesn’t just train, it launches careers,” he said. Margie Andrews, a reading specialist for Job Corps, noted that Job Corps not only educates and trains students in various trades, they teach them life skills, how to manage money, help them obtain a driver’s license and give them hope for a future. “Job Corps isn’t just changing lives, it’s proving what’s possible,” she said. Eric Pasquale, the purchasing agent for Job Corps, called on Rep. Nick Langworthy, who was not in attendance, to “listen to his constituents, meet with our students and staff, and fight for the Job Corps program.” Audience members were encouraged to go to change.org and search “Save Cassadaga Job Corps” to sign the petition, as well as to contact their local, state and federal representatives. Brock, the union president, said the next court hearing is set for June 17 between Job Corps and the Labor Department. **Newsletter** **Local News** **Local News** **‘Strengthening communities’: Former Students, Staff Rally To Save Job Corps** **‘Strengthening communities’: Former Students, Staff Rally To Save Job Corps** **Ribfest Closes Another Run In Celoron** **Ribfest Closes Another Run In Celoron** **Saturday’s Touch A Truck Event Heavily Attended** **Saturday’s Touch A Truck Event Heavily Attended** **Panama Looks To Make Memorial Day Parade Organization Easier In Future** **Panama Looks To Make Memorial Day Parade Organization Easier In Future** **Addressing A New Need** **Addressing A New Need** **Falconer Man Charged Firing Gun At Quality Inn** **Falconer Man Charged Firing Gun At Quality Inn** FALCONER - A Falconer man faces several charges after allegedly firing a gun near the Quality Inn in Falconer on ... MOST READ **Vandalism In City Could Be Curbed By Deterrence** **Vandalism In City Could Be Curbed By Deterrence** **Housing Committee Gets Look At Pre-Permitting Plan** **Housing Committee Gets Look At Pre-Permitting Plan** **Lakewood To Draft Brief Against DEC** **Lakewood To Draft Brief Against DEC** **The Wedding Banquet To Show At Reg Lenna** **The Wedding Banquet To Show At Reg Lenna** **Joyce A. Thomas** **Joyce A. Thomas** **Area Police Reports** **Area Police Reports** **Newsletter** **Starting at $3.50/week.** **Subscribe Today** **Subscribe Today** NewsTop storiesLocal NewsBusinessObituaries Top stories Local News Business Obituaries Top stories Local News Business Obituaries SportsLocal SportsNew York SportsNational Sports Local Sports New York Sports National Sports Local Sports New York Sports National Sports OpinionLocal CommentariesIn Our OpinionLetters To The Editor Local Commentaries In Our Opinion Letters To The Editor Local Commentaries In Our Opinion Letters To The Editor LifeFeaturesViewpointsArts/EntertainmentEngagements Features Viewpoints Arts/Entertainment Engagements Features Viewpoints Arts/Entertainment Engagements ContactSubmit NewsSubscribeAdvertiseContact Us Submit News Subscribe Advertise Contact Us Submit News Subscribe Advertise Contact Us Copyright © 2025 Ogden Newspapers of New York, Inc. | https://www.post-journal.com | PO Box 3386, Jamestown, NY 14702 | 716-487-1111"}