{"id": 919, "name": "MLive (Michigan - Advance Newpapers)", "domain": "mlive.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.mlive.com/news/saginaw-bay-city/2025/06/bay-county-sheriffs-deputies-rescue-2-men-from-sinking-pontoon-boat-on-saginaw-bay.html", "title": "Bay County Sheriffs Deputies Rescue 2 Men From Sinking Pontoon Boat On Saginaw Bay.html", "content": "Ann Arbor Flint Grand Rapids/Muskegon Jackson Kalamazoo Saginaw/Bay City All Michigan Saginaw and Bay City News **Bay County Sheriff’s deputies rescue 2 men from sinking pontoon boat on Saginaw Bay** Updated:Jun. 11, 2025, 3:14 p.m. |Published:Jun. 11, 2025, 2:01 p.m. Jeff Schrier | Mlive.com MLive file photo.The Saginaw News/MLive.com Cole Waterman | Cole_Waterman@mlive.com HAMPTON TWP, MI — Bay County Sheriff’s deputies have rescued two men from their sinking pontoon boat in the Saginaw Bay. About 8:45 a.m. on Saturday, June 7, the office’s Marine Patrol Division responded to an emergency call from the two men. They were about two miles into the bay from Finn Road in Hampton Township, said Sheriff Troy R. Cunningham. Deputies soon located the two men, ages 46 and 61, and successfully rescued them from the sinking pontoon. One of the men was a quadriplegic in a wheelchair, the sheriff added. The pontoon finished sinking once the two marooned men were in deputies’ boat, Cunningham said. It has since been recovered. Deputies took the men to a Bangor Township boat launch, where they received medical attention. One of the men was taken from there to McLaren Bay Region hospital for further treatment of non-life-threatening injuries. Neither of the two men rescued reside in Bay County, the sheriff added. Bangor Township firefighters, U.S. Coast Guard personnel, and Medstar Ambulance also assisted deputies with the incident. Want more Bay City- and Saginaw-area news? Bookmark the localBay City and Saginaw news pageorsign up for the free “3@3″ daily newsletterfor Bay City and Saginaw. **Stories byCole Waterman** Saginaw woman charged with robbing Dollar General at knifepointJun. 11, 2025, 12:16p.m. Saginaw County courts warn of text message scam seeking payments for ‘unpaid tickets’Jun. 10, 2025, 3:15p.m. Ex-Bay City cop gets probation for causing death of Florida bicyclist, 83Jun. 10, 2025, 2:55p.m. If you purchase a product or register for an account through a link on our site, we may receive compensation.By using this site, you consent to ourUser Agreementand agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with ourPrivacy Policy. **Footer Navigation** Contact Us Jobs at MLive MLive Media Group Our Team Advertise with us Accessibility Statement MLive.com Newsletters The Ann Arbor News The Bay City Times The Flint Journal The Grand Rapids Press Jackson Citizen Patriot Kalamazoo Gazette Muskegon Chronicle The Saginaw News Manage your Subscription Place a Vacation Hold Make a Payment Delivery Feedback Jobs Autos Real Estate Rentals Classifieds News Business Sports Advice High School Sports Betting Life Opinion Obituaries Saginaw Jackson Kalamazoo Muskegon Ann Arbor Bay City Flint Grand Rapids Mobile apps Video Weather Post a job Archives Classifieds Sell your car Sell/Rent your home Sponsor Content Twitter Facebook YouTube RSS Your Privacy Choices Privacy Policy |User Agreement |Ad Choices **Disclaimer** Use of and/or registration on any portion of this site constitutes acceptance of ourUser Agreement, (updated 8/1/2024) and acknowledgement of ourPrivacy Policy,andYour Privacy Choices and Rights(updated 1/1/2025). ©2025Advance Local Media LLC. All rights reserved (About Us).The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Advance Local. Community Rulesapply to all content you upload or otherwise submit to this site. YouTube's privacy policyis availablehereandYouTube's terms of serviceis availablehere. Ad Choices"}