{"id": 1339, "name": "Teen Vogue", "domain": "teenvogue.com", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.teenvogue.com/video/watch/kit-connor-and-rachel-zegler-expose-each-other-with-personal-questions", "title": "Kit Connor And Rachel Zegler Expose Each Other With Personal Questions", "content": "Newsletter STYLE POLITICS CULTURE IDENTITY VIDEO SUMMIT SHOPPING Newsletter **Kit Connor & Rachel Zegler Expose Each Other With Personal Questions** About Released on 11/15/2024 Oh, she's crying, she's crying! [Rachel laughing] I found that so funny. You would find that funny. 'Cause she's there, like, you know. But I love you. Love you too. Hi, Teen Vogue, I'm Rachel Zegler. And I'm Kit Connor. And, today, we're gonna be asking each other some questions. Ready? Did we get it? Okay. [both laughing] All right, do it, do it. [upbeat music] [gentle bright music] Are you more of a morning person or an evening person? If I'm doing a film, then I get very used to waking up very early and I want to go to sleep as soon as possible. Yeah. At the moment, I'm quite enjoying the evenings. Right. Get home from the theater. Chill, you know, watch some TV. Yeah. Eat some food. You and I debrief via text. You and I debrief over text. It's great. In bed by 2:00 AM. And I love sleeping in a little bit more. Yeah, Kit's very sweet in making sure that I get in my car safe every night. And then, I make sure that he gets home. And then, I just ask him how he felt about the show. Just making sure that the show is still good. That's really the main thing. And it is. Oh, it's my question now. Who, between the two of us, is the bigger homebody? I think you think it's me, because I have my doggy, Lenny, sweetest boy in the world. And so I do love being home, because I get to spend lots of time with the dog. But I can't express to you how much I've just been craving, like, going out to a restaurant. Like, I could cry about how much I miss going out for dinner. You sound like a mother. I am. Yeah, you are. You're a dog mom. I am, but, I mean, like Lenny doesn't prevent me from going out to dinner. It's just that we've been very hard at work. Yeah, we've been busy. Yeah. But I do just really wanna go have a nice chicken parm at Emilio's and- We'll go and do that, yeah, okay. We should do that soon. Okay, um. [Rachel laughing] Who is the biggest prankster between the two of us and in the cast generally? I'm probably the biggest out of the two of us. It's you. Out of the two of us, it's absolutely you. Yeah, and then out of everyone, it's Gian 100%. He has this bit where, like, you'll be in a scene, you're, like, crying or something, it's a really intense moment. And then, he'll come up to you and just look you in the eyes and whisper, Wake up, as if you're in some kind of like trance. And it's kind of incredible. It's just like, it's so deeply unprofessional and so deeply brilliant. If you had to pick three songs that are always on repeat for you, what would they be? I Look in People's Windows by Taylor Swift, off of her new album, Tortured Poets Department. I really love that song a lot. And it's a really beautiful song in context of her life, I think. Probably The Bomb by the Florence + The Machine, and Graceland Too by Phoebe Bridgers. That's beautiful. Fantastic answers. If you had to eat one thing every day for the rest of your life, what would it be and why? Is it a burger? Probably. Yeah. I like burgers. [Rachel] But why? I mean, my uncle is a chef. He used to work at a restaurant in London called Patty&Bun, which I really like, and he like was the original head chef. So that was like one of my claims to fame as a kid. Oh, that's really cool. It was like, this really great burger joint. You know, I like a relatively rare patty, like, you know, medium rare. I'm a medium gal. I like a good bit of topping, I love pickles. I love pickles. Yes! Absolutely. So I really like having pickles in there. Cheese or no cheese? Cheese. What kind? Whatever cheese they're offering, generally, I'm game. Who is more likely to stop and take a picture with a fan in the street? I think we're- You and I are both pretty piss poor at saying no though. I think you're better at it. Okay. 'Cause I think you are, yeah, you're quite good at that. I really love meeting fans. They're very sweet. Yeah, I'm not very good at meeting ne people. I don't think that's true. It's very true. But I have seen Kit in times that I've been, like, we have to go to dinner, stop and take, you're very gracious. Awesome. You're only human. I'm only human. Who's the most likely to show up to rehearsal late between the two of us? I've not showed up to rehearsal late once. I don't think you have. I've definitely gotten stuck in traffic. I always feel like I'm gonna be late. You come in like an hour early to the theater. I come in like an hour early, yeah. But you also have fight call, I don't have that. Yeah, but even then, I come in an hour before fight call. Yeah. It's professionalism. You know. Okay. Anyway, what's your favorite late-night snack? Ooh, it's honestly the chocolate peanut butter cups from Trader Joe's right now. Ooh. But I have been coming home ravenously hungry from doing our show. So have I. [Rachel] And I usually like have, like, chicken lo mein or something. Mm. Cold chicken lo mein is like the best after-show food ever. Name three of your favorite books that you would recommend to a stranger. So a stranger comes up to you. Quick, name three books. I would recommend Stoner, which is currently what I'm reading. It's a really, like- By John Williams, It's by John Williams. It's like really very well written and very moving. Yeah. And the two books that I would also recommend are like, A Bright Ray of Darkness by Ethan Hawke, which I recommended I think several times before. He's a great author. Yeah. Yeah. And from an actor's perspective, I think it's really interesting. It's about doing Shakespeare and doing it on Broadway, which is kind of cool. Hey-o. Then, finally, another book about acting, 'cause I'm an actor, is Letters from an Actor, which is a really fascinating book about the making of Richard Burton and John Gielgud's Hamlet. Wow. And it's kind of just filled with stories about Gielgud, and Laurence Olivier, and Richard Burton. Awesome. And Elizabeth Taylor. [gentle bright music] What has been the rudest awakening or biggest surprise about performing on stage versus performing on screen? I think I was surprised about how much I missed it. I grew up on stage. I've been acting on stage since I'm 12 years old, and I haven't done it in six years. I was 17, the last time I was on stage. It was my senior year musical, Shrek, and it was so much fun. And I also didn't realize that it was just kind of like riding a bike. And getting back into it, didn't feel like I was dropped off a cliff or anything like that, like, it really felt like I was coming home. They're different muscles. They are different muscles. But it didn't feel sore the next day after flexing it. Do you know what I mean? Very metaphorical. I like it. Thanks. What's the perfect day off in New York for you? Have you even had one yet? Not really. This is our day off. We're here on our day off. This is my- This is the perfect New York day off. Yeah. My perfect day off is probably hanging out with my wonderful friend, Michael. Michael. He lives here. Michael Gandolfini. We love him so much. Shot a movie with him earlier this year. He's the best guy. He became one of my best friends, and I love him very, very much. I love it. So that's probably one of my best days off. Do you have any theater superstitions or general superstitions? I don't like that we don't have a ghost light at the Circle in the Square. I don't like it. Why don't we have a ghost light? What is a ghost light, Rachel? Do you not know? You must. I know of a ghost light. Yeah, it is technically a theater superstition to, like, you know, ward off any bad juju. Yeah, it honestly keeps away the bad actors. Mhmm. That's why, oh my god, it all makes sense. Suddenly I realize I'm here, yeah. I realize why I got cast, 'cause we don't have a ghost light. No, I mean, most theaters, even if they're not professional theaters, they have one, and I have not seen one at Circle in the Square. I would never sleep in a theater. I really do think they are some of the most haunted places, in the best way. Yeah, I love it. But I would never sleep over in a theater. The Old Vic. The Old Vic must be so- That was the last theater I worked in, and that is crazy haunted. Haunted. What's a funny story from our rehearsals that nobody else knows? Oh god, that is quite tricky. A funny story from rehearsals. I was talking to Rachel and- Oh no. And we were talking about what it's gonna feel like on our last performance. Bear in mind, we haven't even opened. We are here until February, so that's a long way away. And then, she said that she's gonna be really sad. And there's a line in which she basically says, Will we ever see each other again? And she started crying at the thought of saying that line on the last night, which I thought was slightly, oh, she's crying, she's crying! I love him, he's awesome! And the show is so much fun. Oh my god, see, I found that hilarious. [Rachel laughing] I found that so funny. You would find that funny. 'Cause she's there, like, you know. But I love you. So what's your favorite scene to act in the show? Which one is the hardest for you? My favorite scene to act in the show is the balcony scene. That's my favorite scene. I think it's the easiest scene in the whole show for me, because I get to play alongside Rachel. I think it's a wonderful, it's one of, you know, the best-written scenes of all time. Mm. It's very funny. The audience are very fun to- They love Kit in that scene, bro. They love you. They love us both I think. I think it's a nice, the audience seem to enjoy that scene, which is always a nice feeling. And I would say the hardest scene for me is, to be honest, the hardest scene for me is the death of, I can say this, it isn't ruining it? It's not a spoiler. The death of Mercutio. That is tough. The death of Mercutio is a really hard scene for me. Who, between the two of us, do you think is closest to our character? I think Sam really encouraged me to tap into as much of Rachel as I could for Juliet. It's very tricky to do, Juliet is 13 and I am not. I don't think you're like Romeo. No? No. I think you're much smarter. Oh, bless you, thank you. Yeah, I needed that. And cooler. Like, when you're upset, you don't hide in trees. Yeah, what is the secret to the perfect audition song? I wouldn't know. I'm gonna be honest, I don't know. I auditioned for Broadway for so many years before getting West Side Story, the movie, and nobody wanted me, so I actually don't think I'm a good person to ask. I missed the section of auditioning for Snow White that was with music, I was only asked to audition after. And then, when I did, it was a song that they had written for the movie. I think the first audition song I ever used was when I was 12 years old auditioning for a production of Fiddler on the Roof in my town, was Wishing You Were Somehow Here Again from Phantom of the Opera. But it's very overused, so don't do that. I'll keep that in mind. Yeah. I'm excited for when the musical theater girlies going in for their BFA audition are using one of the songs from Snow White, 'cause I know that there's gonna be a 16-bar cut that they're gonna use from it. I know what it is. I love that you- And I can't wait. Love that. [Rachel laughing] As you know, in Shakespearean times, men- What are you gonna say? Originally played all female roles. If you could play a female role in any show or film, what would it be and why? Yeah. Holly Golightly. Yeah. Yeah? Yeah. I think genuinely- [Rachel] I think you'd be so beautiful. An incredible role. It is a great part. It's genuinely like such a brilliant role, and she's fantastic in it. Good job, Audrey. Yeah, if they ever did that again, we'd have to get rid of the Mickey Rooney part. Yeah, absolutely. It's heinously offensive. Absolutely. And put you as Holly Golightly. 100%. And I'll be the cat, so we can hang out. Yeah. Okay. Okay, in order to invoke tears on stage, what do you think of? Me. [Rachel laughing] Well, I think of never seeing you again and I cry. Oh, yes. No, I mean, I find deep empathy for this character, like I really do. I'll honestly just have to think of the fact that she's a child, and all of the things that shouldn't be happening to a child that are in this play or in the world and just sob. It's quite simple for Act Two. Act Two is my crying act. Likewise. Yeah. We really go through it. You know, that's how I felt with doing Maria in West Side Story as well. I just felt such deep empathy for her situation. And I used to think of, like, what she would say in her letter home to Puerto Rico to her dad. Her brother's dead, her sister-in-law doesn't wanna associate with her anymore. Her boyfriend's gone. Chino's in jail. Like, all of these things, it's so, oh, it's so horrible. So, in your heart, do you think you're more of a Montague or a Capulet? Oh, Montague for sure. Maybe it's because I read it in the mindset of Romeo, but, like, I do not like the Capulets. I gotta be real! To be fair, like, the stakes of the original play are- The mom and dad are like- They're the worst. I do not like them. Yeah. You know? The stakes in the original play have a lot to do with class. Yeah. And the Capulets are like these, like, the rich [beep]. If you could be famous for anything other than acting, what would it be and why? Directing. I'd love to be someday. Let's not, I'm gonna touch wood on that. No, but you're manifesting. Let's not jinx anything. But I'd love to direct someday, and I'd love for people to think that I was any good at it. But who knows? We'll see. [gentle bright music] What's a random talent you have that not many people know about? Or what's an unusual talent you wish you had? The truth is, I don't have any talent. Can't you play guitar? No. Kind of? I don't know where this thing happened. There is a picture of you with an acoustic guitar that Sam found. Yeah, I can play, like, a little bit of guitar, not well at all. But it's a secret? To call that a talent. Yeah, it's secret for a reason. Can I just say Jack Antonoff tried to get me to play guitar in this show, and I literally just point blank was, I can't do that. If you're gonna have someone do a talent on Broadway, you should make sure that they are of Broadway standard, and yeah, that's not me. If you were on The Great British Baking Show, which is- Oh, we do call it that here. But it is The Great British Bake Off. But, yeah, we call it The Great British Bake Off. But if you were on The Great British Baking Show, what challenge would you be most ready for? You used to like baking. You're more of a cook now, aren't you? Wow, you do, you know? I listen to everything people say. He's so sweet. And then, people get surprised when I- My mom is really excellent at baking. The chemistry of it all, and the exact science of it all, always like makes me scared, because I really like to do my own thing. I also am terrified of making things from scratch. Like, I'm scared of, like, giving people food poisoning by making something from scratch. Flour is scary, eggs are scary, like, they're scary things. So I don't know if I would be very good at anything on The Great British Bake Off, except for charming Paul Hollywood, and he loves brownies. So I would fail so badly, yeah. Do you cook? Yeah, when I'm at home, I haven't cooked once when I'm here. I can't wait to cook for Kit Connor. No. So who would be your dream to collaborate with on stage? On stage? That's a good question. Mark Rylance. Yeah, that's a titan. He's awesome. But so many. I know. Like, there are so many people who I would just pinch myself to be on stage with. Josh O'Connor, I think he's one of the best actors of his generation. A fellow Romeo. A fellow Romeo. Mhmm. Would you rather be invisible for as long as you can hold your breath? That took me a second to read. Yeah. Or be able to fly, but only at the speed of which you can walk/run? Probably fly as fast as I could run. It'd be pretty cool. Because then I wouldn't exert as much energy, I would just fly. Either way, you're still like, you're flying. Yeah. You know? Pretty cool, I don't really wanna be invisible. [Kit] Yeah. Who, between the two of us, would be most likely to survive in the zombie apocalypse? Where would you be and what would you be doing? I mean, earlier this year, I did a film called Warfare, when it comes out, you should watch. Warfare, Warfare. But we did get like three weeks of training from, like, you know, Navy Seals, so I think that would give me some kind of, some edge. Yeah. Although you were Movie Action Star of the Year. Hunger Games, baby. Hunger Games. And I did it in heels. Yeah, she did The Hunger Games. So, you know, maybe- Could've done Warfare in heels. Yeah, then in Vogue. I think if I were in the zombie apocalypse, I'd be a planner. Like, I would be, like- Yeah, you would be a planner. Somebody who would be, like, in charge of getting everybody where they needed to be. Lenny would do it. Yeah, my doggie would come with me. Teen Vogue, thanks for having us. We are so thankful. Please come see us on Broadway, Circle in the Square. We're Rachel Zegler. And I'm Kit Connor. And we're in Romeo + Juliet on Broadway right now. [upbeat music] LE SSERAFIM Expose Each Other with Personal Questions **LE SSERAFIM Expose Each Other with Personal Questions** **LE SSERAFIM Expose Each Other with Personal Questions** **LE SSERAFIM Expose Each Other with Personal Questions** Stray Kids Answer Questions About Each Other **Stray Kids Answer Questions About Each Other** **Stray Kids Answer Questions About Each Other** **Stray Kids Answer Questions About Each Other** Kit Connor & Rachel Zegler Expose Each Other With Personal Questions **Kit Connor & Rachel Zegler Expose Each Other With Personal Questions** **Kit Connor & Rachel Zegler Expose Each Other With Personal Questions** **Kit Connor & Rachel Zegler Expose Each Other With Personal Questions** ATEEZ Plays \"I Dare You\" **ATEEZ Plays \"I Dare You\"** **ATEEZ Plays \"I Dare You\"** **ATEEZ Plays \"I Dare You\"** Ballerina Kayla Mak's Daily Routine 1 Week Before a Show at Juilliard **Ballerina Kayla Mak's Daily Routine 1 Week Before a Show at Juilliard** **Ballerina Kayla Mak's Daily Routine 1 Week Before a Show at Juilliard** **Ballerina Kayla Mak's Daily Routine 1 Week Before a Show at Juilliard** Sydney Sweeney Shares Her \"Firsts\" **Sydney Sweeney Shares Her \"Firsts\"** **Sydney Sweeney Shares Her \"Firsts\"** **Sydney Sweeney Shares Her \"Firsts\"** Welcome to Teen Vogue's New Hollywood Dinner Party **Welcome to Teen Vogue's New Hollywood Dinner Party** **Welcome to Teen Vogue's New Hollywood Dinner Party** **Welcome to Teen Vogue's New Hollywood Dinner Party** How Bridgerton's Charithra Chandran Became \"Edwina\" **How Bridgerton's Charithra Chandran Became \"Edwina\"** **How Bridgerton's Charithra Chandran Became \"Edwina\"** **How Bridgerton's Charithra Chandran Became \"Edwina\"** Maisie Williams on Her First Date, First Audition, First Tattoo & More **Maisie Williams on Her First Date, First Audition, First Tattoo & More** **Maisie Williams on Her First Date, First Audition, First Tattoo & More** **Maisie Williams on Her First Date, First Audition, First Tattoo & More** A Conversation on Diversity With the Cast of Mr. Malcolm’s List Featuring Freida Pinto, Ṣọpẹ́ Dìrísù, and Zawe Ashton **A Conversation on Diversity With the Cast of Mr. Malcolm’s List Featuring Freida Pinto, Ṣọpẹ́ Dìrísù, and Zawe Ashton** **A Conversation on Diversity With the Cast of Mr. Malcolm’s List Featuring Freida Pinto, Ṣọpẹ́ Dìrísù, and Zawe Ashton** **A Conversation on Diversity With the Cast of Mr. Malcolm’s List Featuring Freida Pinto, Ṣọpẹ́ Dìrísù, and Zawe Ashton** **Trending video** iconPlayKATSEYE Play \"I Dare You\" **KATSEYE Play \"I Dare You\"** **KATSEYE Play \"I Dare You\"** **KATSEYE Play \"I Dare You\"** iconPlayITZY Play \"I Dare You\" **ITZY Play \"I Dare You\"** **ITZY Play \"I Dare You\"** **ITZY Play \"I Dare You\"** iconPlayXG Play \"I Dare You\" **XG Play \"I Dare You\"** **XG Play \"I Dare You\"** **XG Play \"I Dare You\"** Facebook X Pinterest Instagram Tiktok More from Teen Vogue About Teen Vogue Newsletter Signup Video Contact Contact Us Careers User Agreement Privacy Policy Your California Privacy Rights Accessibility Help Condé Nast Store Visual Stories ©2025Condé Nast. All rights reserved.Teen Voguemay earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad Choices"}