{"id": 1222, "name": "Science History Institute", "domain": "sciencehistory.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.sciencehistory.org/stories/distillations-pod/the-history-of-the-school-lunch/", "title": "The History Of The School Lunch", "content": "VisitHours & AdmissionExhibitionsEventsConferences & SymposiaGroup & School ToursGetting HereAccessibilityHealth & Safety Hours & Admission Exhibitions Events Conferences & Symposia Group & School Tours Getting Here Accessibility Health & Safety Hours & Admission Exhibitions Events Conferences & Symposia Group & School Tours Getting Here Accessibility Health & Safety CollectionsDigital CollectionsAbout Our CollectionsSearch Our CollectionsCollections Blog Digital Collections About Our Collections Search Our Collections Collections Blog Digital Collections About Our Collections Search Our Collections Collections Blog StoriesDistillations MagazineDistillations PodcastThe Disappearing Spoon PodcastStories by Topic Distillations Magazine Distillations Podcast The Disappearing Spoon Podcast Stories by Topic Distillations Magazine Distillations Podcast The Disappearing Spoon Podcast Stories by Topic ResearchOthmer LibrarySchedule a Library VisitOnline CatalogRights & ReproductionsResearch CentersFellowships Othmer Library Schedule a Library Visit Online Catalog Rights & Reproductions Research Centers Fellowships Othmer Library Schedule a Library Visit Online Catalog Rights & Reproductions Research Centers Fellowships EducationTours & TrainingsClassroom ActivitiesEducational ResourcesScientific Biographies Tours & Trainings Classroom Activities Educational Resources Scientific Biographies Tours & Trainings Classroom Activities Educational Resources Scientific Biographies Support Stories Distillations Podcast **Distillations podcast** **Distillations podcast** **The History of the School Lunch** A familiar rite of passage that’s been more than 100 years in the making. Feeding kids a healthy lunch every school day is a feat of science and logistics. Molded into shape by nutrition scientists who wanted to optimize children’s health, it has endured war, economic depression, and even a global pandemic. Some might say it’s all the stronger for it. So how did all these crises shape school lunch? And is there any room to give our rectangle pizzas and frozen chicken patties a little grace? **Credits** Host:Alexis PedrickExecutive Producer:Mariel CarrProducer:Rigoberto HernandezAssociate Producer:Sarah KaplanAudio Engineer:Jonathan PfefferTheme composed byJonathan Pfeffer. Music byBlue Dot Sessions **Resource List** 1930s Farmer Talks About the Great Depression and Poverty.YouTube video. 1:54. Posted by Timeless Footage, March 10, 2020. ABC Evening News.May 14, 1969. Vanderbilt Television News Archive. CBS News.CBS Evening News.September 4, 1981. Vanderbilt Television News Archive. CBS News.September 25, 1981. Vanderbilt Television News Archive. C-SPAN.House Session, Part 1. Daily School Meals During Coronavirus Closures.YouTube video. 4:59. CBS Sacramento. Great Depression, Film Archives NYC.YouTube video. 6:46. Posted by Reel America, October 30, 2020. Hunger in America.CBS News. “Hunger in America: The 1968 CBS Documentary That Shocked America.” Levine, Susan.School Lunch Politics: The Surprising History of America’s Favorite Welfare Program.Princeton, NJ: Princeton University Press, 2008. Lunch Line.Directed by Michael Graziano and Ernie Park. Uji Films, 2010. Mitman, Greg.YouTube video.2:44. Posted January 13, 2023. Mrs. Croft talks to parents about the need to provide hot lunch to students at a school in Pittsford, Vermont.Critical Past. NBC News.December 21, 1981.Vanderbilt Television News Archive. Nixon Addresses Hunger, 1969.YouTube video. 3:02. Posted by AP Archive, November 5, 2015. Poppendieck, Janet.Free for All: Fixing School Food in America.Berkeley: University of California Press, 2010. “Ronald Reagan on Big Government: ‘Government is the Problem.’”YouTube video, 0:15. Ruis, Andrew R.Eating to Learn, Learning to Eat: The Origins of School Lunch in the United States.New Brunswick, NJ: Rutgers University Press, 2017. “The Twisted History of School Lunch, Part 1.” Pressure Cooker.Podcast audio, 35:17. Hosted by Jane Black and Liz Dunn. Omny Studio, February 6, 2024. **Transcript** Alexis Pedrick:From the Science History Institute, I’m Alexis Pedrick, and this isDistillations. If I asked you what comes to mind when I say the word school lunch, you might think along the same lines as the students outside of a school in Philadelphia. Henry H. Houston Elementary School Students: (Student 1)They need to like, upgrade. (Other students)They need like—we need good—and sometimes— (Student 2)Usually, there’s some nasty circle pizza with some like, some vegetables, some meat. (Student 3)But overall, it’s like the food is like a five out of ten overall. (Student 1)Yeah. No, a four out of ten. Alexis Pedrick:According to these students, the food is—as the kids say—”mid.” Henry H. Houston Elementary School Students: (Student 2)Oh, I got you. That food is a negative zero. (Other students)They don’t got no salt, pepper, nothing. Yeah. (Student 4)The only thing that’s actually like kind of “mid” is the pizza, like nothing else on that menu. (Other students)I don’t like that pizza and that the mac and cheese tastes like nothing. Rigoberto Hernandez:Do you mean like it has, like, no taste? Henry H. Houston Elementary School Students: (Student 4)It has no taste. No flavor. (Student 2)We need to do better. Alexis Pedrick:Now, these kids were less than nice, but they’re hardly alone. School lunch doesn’t necessarily have the greatest reputation. But if you stop and think about it, feeding every single kid school lunch every day is nothing short of a minor miracle. And even the harshest critics I talked to admitted that it serves its function. Henry H. Houston Elementary School Students:(Student 4)If I wasn’t hungry, I would never touch it, but if I was hungry, I would eat it. Alexis Pedrick:Maybe you take the idea of school lunch for granted. I certainly did. But then I learned about the massive, continuous effort it’s taken to make the humble American school lunch a reality. A reality that’s been more than a hundred years in the making. It was born at the same time as compulsory education, when even the poorest kids left their factory jobs and went to school. And over the years, school lunch was molded into shape by nutrition scientists who wanted to optimize children’s health. But it was also shaped in unintended ways by the circumstances of the time. Every time there’s been a national crisis, it’s left its mark on the school lunch, be it war, economic depression, a global pandemic. Each crisis could have wiped school lunch out for good. And yet it survives. **Chapter One: Who’s Responsible for Feeding the Children** Alexis Pedrick:Chapter One: who’s responsible for feeding the children? I don’t want to brag, but school lunch programs started right here in Philly, inDistillation’shometown…And also Boston. Jesse Smith:So efforts to feed children in US schools begin in large US cities at the end of the 1800s. My name is Jessie Smith and I am the curator of our newest exhibition, Lunchtime: The History of Science On the School Food Tray. Alexis Pedrick:Jessie showed us around the exhibit, which, I’m not gonna lie, was quite the walk down memory lane. Alexis (in the museum):Okay, so my favorite thing about coming into this exhibition is they’re sort of like a fake school lunch line with, like, fake school lunches. Like the plastic trays. And you’ve got, like, the, the sort of cardboard boxes of milk. Alexis Pedrick:And there’s even a real live school lunch table which the Philadelphia School District gave the museum. Alexis (in the museum):I actually, I have okay memories of the school lunch table. I think mostly because I was a menace. I think I was the mean kid in school, so I actually feel okay looking at this school lunch table. Alexis Pedrick:Next to the table, there are large images from the 1800s that show us what early school lunches looked like. Alexis (in the museum):It’s an image. Boston students were some of the first in the country to be fed in actual schools, which we take for granted, but was, like, brand new. So let’s see, it looks like this is the New England kitchen. It’s this, like, fantastic picture of like all these women sort of seated in a kitchen, a giant kitchen, sort of sorting food. Alexis Pedrick:In the 1850s, Massachusetts ruled that kids had to go to school. Before that, some went to school and others worked in factories. Eventually, compulsory education, as it was called, spread across the country until it was standard practice. Now, it didn’t look exactly like school does now. One major difference: kids typically went home for lunch, or brought it in a tin pail, or worst of all, went hungry. Alexis (in the museum):The Bitter Cry of the Children? All right, this book is incredible. Journalist John Spargo was horrified by the plight of the country’s poor children at the dawn of the 20th century. Oh, okay. So he did a study in 1907 of Poverty’s impact on the country’s youngest and found large numbers of underfed children in workplaces and also in schools. He told the story of one girl who brought dry, uncooked oatmeal to school for three days, but he was devastated by the large number of school children who ate nothing for lunch, and argued that poor diets and empty stomachs impaired students’ learning and limited their physical development. Alexis Pedrick:But all that soon changed. One thing that happened with the rise of compulsory education is that we started to recognize childhood as a distinct stage of life, that young bodies have different needs from adult bodies, and schools were starting to be seen as an intervention point. This is Andrew Ruis, the author ofEating to Learn, Learning to Eat. Andrew Ruis:People are starting to think that schools could do more for children than just simply educate them, and in fact, that the education mission would be significantly improved if schools did more to, to look after the health and welfare of children. Critical Past – Mrs. Croft talks to Parents, 1950:A good teacher is not only concerned with feeding children’s minds. What feeds their growing bodies also concerns her deeply. Andrew Ruis:This is also a period when schools started to explore whether they should be, you know, getting glasses for students who had eyesight problems. Alexis Pedrick:These efforts were part of a growing movement called Municipal Housekeeping. Jesse Smith:And this was a work largely led by women’s groups that extended care from the home out into the community. So they advocated for clean air and fresh water. They established kindergartens and playgrounds, shared kitchens, communal laundromats. So a lot of those forces are coming together and lead these, these early efforts at school feeding largely driven at first by what we might think of in Philadelphia’s case, at least, as PTA’s—voluntary associations. In other places, like Boston, they were started by the growing number of home economists. Alexis Pedrick:Starting in the early 20th century, educated women who wanted to be scientists but weren’t allowed to work in chemistry labs or teach at universities had to make their own spaces. So they formed their own associations called Home Economics Associations. This is Susan Levine, the author ofSchool Lunch Politics. Susan Levine:Home economics at that time actually was a very scientific endeavor—looking at the nutrition content of food, exploring the role that vitamins played in human health. They looked at diets and made recommendations. Alexis Pedrick:Home economics comes at a time when there’s a new scientific way of thinking about food and nutrition. Jesse Smith:You have a lot of scientific research in this period that’s looking at things like the importance of variety in diet. We start to think about food in the familiar categories that we know today—thinking about foods in terms of carbohydrates and proteins and fats. Alexis Pedrick:And because people in urban centers were living much further away from their food sources, we got new worries like adulteration. Jesse Smith:Putting things into food that actually aren’t food, or things that we wouldn’t want in food. So an example would be hay seeds that were used in strawberry jam to mimic the seeds of a strawberry so that the makers could use less expensive fruit, and they could have other things like, like hay, or things like sawdust in flour. Alexis Pedrick:This is also the period of time that brought us the calorie. Alexis (in the museum):All right, so I’m looking at a picture of this…it kind of looks like a…a telescope on two legs. It looks like there’s…you can pull off the top and kind of fill things in it, like liquids. And it just sort of, like, drips out into the bottom. It’s really sort of sci-fi looking, actually, for being from the 19th century. Alexis Pedrick:This machine was known as the calorimeter. Jesse Smith:So human subjects would go into this and perform activities like eating lunch or washing clothes. The goal was to be able to identify the amount of energy that was required for those activities, and also the amount of energy that was in particular foods. Alexis Pedrick:The calorie was important at this time because beyond worrying about exactly what children ate, we also wanted to make sure they were eating enough food. Period. Susan Levine:They believed that poor people, of course, were malnourished. They were thin and they needed to have whole milk, cream, heavy, calorie laden foods. Alexis Pedrick:And from the beginning, there was another goal beyond merely feeding students a meal during the day. School lunch itself was meant to be educational. Susan Levine:To teach them what was considered to be modern scientific eating habits. And I think even to this day, people think that if you teach children about nutrition, they’ll take those ideas home and families will begin to incorporate those ideas into their own cultural food habits. Alexis Pedrick:Each city’s school lunch looked a little bit different because, well, each valued different things. New York City school lunches were provided by a Home Economics group called the School Lunch Committee, and they valued diversity, so their school lunches reflected that. Andrew Ruis:Places like New York and Boston and Philadelphia and Chicago, you had large Jewish populations who might need kosher meals. You had Catholic populations who wouldn’t eat meat on Fridays. You had large populations of German or Irish or Italian students, all of whom had different preferences for the kinds of foods they ate. Alexis Pedrick:But some places really leaned into the idea of using school as a way to assimilate immigrants, which they did, believe it or not, by serving them food lacking in spice. Susan Levine:Right. Well, the goal of that really was not to offend anyone so that you know, even to this day, some people don’t like spicy food and some people like spicy food. And some cultures use spices in different ways. Alexis Pedrick:The idea was to make the food uniform so everyone could eat it. And then as students set aside their own cultural dishes, they’d learn how to be more American by eating a quote unquote healthy American diet. Susan Levine:In my view, it’s really hard to change a food culture, and I don’t know how successful these programs were. Alexis Pedrick:But they were successful in proving that you could feed kids in school. The only problem was that many of these programs weren’t permanent. They were only meant to be proof of concept. Here’s Andrew Ruis again. Andrew Ruis:Public appointees or school board members or principals—they really saw these as demonstration projects. They said, look, if we can build this…this program and show how effective it is, then maybe the school can take it over entirely, right? That all the expenses, or at least all of the operations, could be transferred entirely to go under public purview and could be a part of, sort of, normal school operation. Alexis Pedrick:But there was a big problem standing in the way. Andrew Ruis:So historically, governments—federal, state or local—had relatively little involvement in, in social welfare or charity. That was generally considered to be something that religious organizations or sort of social beneficent organizations would take care of. Alexis Pedrick:Public money could be used for new infrastructure like building a kitchen. Andrew Ruis:But purchasing food directly for children would have generally been considered well beyond what a school could legally do. Critical Past – Mrs. Croft talks to Parents, 1950:Mr. Williams would like to help, but the school funds just can’t be stretched without an increase in taxes. Alexis Pedrick:Some of these smaller home economics organizations were determined to get their school boards to take them over, but even when that did happen, the results were disappointing. In 1915, the School Lunch Committee in New York City served 80,000 free or low priced lunches to elementary schools, and they worked hard to create menus that were nutritious but also reflected students’ individual cultures. When the school board took the program over, it all went downhill. Andrew Ruis:And the first thing that happened is that there was a major contraction in the number of schools that were offering meals. The quality went down and that kind of thing. And it was clear that the Board of Education wasn’t prepared to take it on entirely on their own, but also didn’t have the same level of investment in the program. Alexis Pedrick:The transfer went so poorly that the school lunch committee had to step back in for a short time and rebuild the program to a point where the Board of Education could actually sustain it. But even after that, things were difficult, and it just deepened the debates over that question: who is responsible for feeding the children? Some board members said that feeding kids should really be the responsibility of families and not schools. Andrew Ruis:And so, in that sense, they may have had very little incentive to make sure that the program succeeded. Alexis Pedrick:Sounds cold, but school boards had to manage everything else that went into running a school. And now they were supposed to feed students on top of that? It made sense that lunch wasn’t their number one priority. Now, this could have been the end for school lunch. But the thing is, once the genie’s out of the bottle, you can’t put it back in. School lunch programs were incredibly popular. Parents insisted that schools had to keep these programs going, and so they did. But as compulsory education spread, becoming the law in all 50 states by 1918, another even bigger scale organization stepped into the school lunch fray. **Chapter Two: The Federal Government Gets Involved** Alexis Pedrick:Chapter Two: the federal government gets involved. Great Depression, Film Archives NYC:It was panic. 16.5 million shares of stock sold in a single day. Sold hopelessly, desperately, at any price. It was the forerunner of depression and crisis. Janet Poppendieck:During the Great Depression, on the one hand, we had millions of people facing severe privation, you know, the edge of starvation and in some cases, actual starvation. And on the other hand, we had huge agricultural surpluses. Alexis Pedrick:This is Janet Poppendieck, a retired college professor, activist, and author ofFree for All: Fixing School Food in America. Janet says the irony of farm surpluses combined with starving people was not lost on anyone. Janet Poppendieck:This was frequently remarked on, you know, commented on in the press, from the pulpit: this paradox of want amid plenty. 1930s Farmer Talks About the Great Depression and Poverty:There was lots of good crops all around, and people were going hungry. The big boys, they wanted to keep the prices up. Janet Poppendieck:It came to a head when the Roosevelt administration came into power. Alexis Pedrick:The price of goods was collapsing. There were millions of farmers whose products were selling for less since the markets were down. And so the government paid them to produce less. But that still left the issue of the crops and livestock that they had already grown. They didn’t want to risk flooding the market and lowering prices even more. So the plan was to dump it. Perhaps one of the wildest examples of this was what pig farmers did in the Midwest. Janet Poppendieck:Maybe they could forestall an impending glut on the hog market by early slaughter of baby pigs. And so the Secretary of Agriculture undertook to slaughter 6 million baby pigs. Alexis Pedrick:The Department of Agriculture offered to buy the pigs at advantageous prices. And so farmers turned their pigs over. Janet Poppendieck:And it turned out to be a public relations disaster. The equipment and slaughterhouses was designed for big hogs, not not little pigs. And so were the pens that were supposed to hold them. So they escaped, and they went squealing down the streets of Omaha. Alexis Pedrick:In another city, pigs were liquefied and turned into fertilizer, but there was nowhere to store it. And so it was dumped by an old quarry. It stank to high heaven and brought a plague of blue flies. Janet Poppendieck:As we would say now, the optics were not good. The Chicago Tribune was particularly vociferous in its attack on the Roosevelt administration, and FDR was, you know, he was no fool because people were saying, how can you be destroying this good food when people are going hungry? Alexis Pedrick:So the federal government came up with an innovative solution. Administrator of Agricultural Adjustment Administration, George Peek, Getty Archive:The curtain is about to fall on the spectacle of indifference to millions of hungry people looking for food, while surplus food rots on the ground and farmers go broke because there is no market for their products. In one stroke, with the president’s backing and cooperation, we hope to help the farmer and feed those who are hungry. Alexis Pedrick:The Department of Agriculture would purchase excess food from farmers, and then send it to food pantries and to schools to serve their students. Jane Black:And it was an interesting idea because it was like, let’s kill two birds with one stone, right? We can help farmers and we can help children. Alexis Pedrick:This is Jane Black, a food journalist who’s written and podcasted extensively about school lunches. Jane Black:If they had extra beef, if they had, you know, a surplus of corn, like, okay, great, we’ll take that from you. Alexis Pedrick:But instead of asking what foods are best for children, the question became what foods do farmers have too much of? Here’s Susan Levine again. Susan Levine:And there are lots of stories about schools getting too many apples. And they find them, you know, in the toilets and things like that. And they’ve got too many olives one year and, you know, kids won’t eat that. And so it was very difficult to plan in terms of, you know, the school districts. It was hard to plan the menus. Alexis Pedrick:But then, yet another crisis came along and changed things. 1941: Attack on Pearl Harbor, Getty Archive:Then in December, America’s role in World War Two was suddenly crystallized by the Japanese. Alexis Pedrick:Suddenly feeding school children was a matter of national importance. Janet Poppendieck calls it defense nutrition. Janet Poppendieck:So it was to have a pool of well-nourished—at that point, young men—whom we could recruit and send off to war. Wartime Nutrition, 1943:A large proportion of defense workers suffer from unsuspected physical defects associated directly or indirectly with malnutrition in Army induction centers all over the nation. Examining doctors found rejectees starved for the foods to give them the steady nerve, the clear eye, the strength of bone and muscle to fight and win a war. Alexis Pedrick:Who did the actual government turn to when they needed help getting nutrition back on the menu? The Department of Agriculture. Now, I know what you’re probably thinking. Didn’t I just say the Department of Agriculture pushed nutrition out of the limelight? Well, it turns out the Department of Agriculture was actually well positioned to help with this because they’d been funding and working with nutrition scientists since the 1860s. Janet Poppendieck:The Department of Agriculture had a Bureau of Home Economics, with a lot of nutrition scientists in it to say, tell us, you know, how much iron do we need? Alexis Pedrick:Remember those women who ran the first school food programs who couldn’t work as traditional scientists? Susan Levine:They found employment in the Department of Agriculture when they couldn’t find it in other kinds of labs. And that was because there had been a tradition of women working with farm families and looking at diets and nutrition and different kinds of communities around the country, both immigrant communities and rural communities. So women played a very big role in the Department of Agriculture in establishing nutrition as a scientific endeavor. Alexis Pedrick:And it was thanks to their work that we got things like the Recommended Daily Allowances. Maybe you’ve heard that a man is supposed to get something like 2000 calories a day, while women are supposed to get 1800? That’s where it came from. So now the federal government is involved in school lunch through the Department of Agriculture, and the goal was to feed children nutritious lunches to make them into better soldiers while simultaneously helping farmers out. But this arrangement wouldn’t become a permanent fixture until the next crisis hit. **Chapter Three: No Nation is Healthier than its Children or Richer than its Farmers** Alexis Pedrick:Chapter Three: no nation is healthier than its children or richer than its farmers. One thing we should clarify is that even though school lunches had been subsidized by various groups and local governments, it wasn’t free for students. Now, you might think that coming out of the Great Depression, people would see this as a problem and you’d be right. And schools did address the issue. Here’s Andrew Ruis again. Andrew Ruis:So in the early development of school meal programs, they’re all local programs, which meant that the way they were financed was‌ determined locally. In many cases, advocates for school meals really hoped that they would be free for all children—what we now call universal free meals. But that was not really a political reality in the early 20th or mid-20th century. Alexis Pedrick:The compromise was usually that schools would use charitable donations to provide meals for poor students. But it was complicated because a lot of people didn’t like using public funds for charity. So students who could afford to pay did. Andrew Ruis:They would charge essentially a nominal fee, enough to cover just the costs of making and serving food to both help finance the program itself, but also to kind of make sure that public moneys were not being spent on charity, which generally would have been would have been illegal. Alexis Pedrick:But still, this idea gathered steam that there should be some kind of national school lunch, some way of ensuring students got food during the day. And as has become commonplace in the story of this miraculous undertaking, there were debates. Here’s Janet again. Janet Poppendieck:You had Robert Taft saying you’re going to destroy the backbone of American youth. They’re going to be used to asking Uncle Sam for dinner. I mean, that’s when the concern about that school lunch would somehow or other pauperize people. Alexis Pedrick:There was also the other big scare of this era: that it would make people into communists. Still, in 1946, an interesting alliance formed in Congress. Segregationists in the South, out of all people, believed feeding children was important. And yes, it was probably the case that they liked the farmers in their states getting paid by the federal government for their surplus goods. On the other side, you had progressives from California who wanted to use the school lunch program as a way to, stop me if you’ve heard this before, educate kids about nutrition. But it wasn’t a completely rosy alliance. Janet Poppendieck:There was very strong resistance from southern senators and members of Congress because they were worried about if the federal government got involved with the schools that they would push for, for an end to segregation. Alexis Pedrick:How then did we get a national school lunch program? Compromise. It was decided that School Lunch Programs would be run by state and local governments, with farm surpluses and some money from the federal government. Ultimately, though, they would need to make up the difference themselves. Deep South conservatives were happy because they believed they wouldn’t have to worry about the federal government desegregating schools. And after some debate over the best agency to run the program, the Department of Agriculture won out. After all, they were already involved. But still, it doesn’t seem like the most logical choice. Jane Black:It’s absolutely bonkers when you think about it, that this program is administered by the US Department of Agriculture. You would think that it would be the US Department of Education, or maybe even Health and Human Services. Alexis Pedrick:But the Department of Agriculture was written into the law. The National School Lunch Act was signed by President Truman in 1946. Jane Black:And he famously declares, and this is important for what happens next, that no nation is healthier than its children or richer than its farmers. So from the very beginning, this was a program that was set up to help two interest groups, although I would say farmers were more of an interest group and kids were more of a byproduct. Alexis Pedrick:Still, there was plenty of reason to be optimistic. Post-world War Two is a period of prosperity in the United States. We see ourselves as world leaders economically and culturally. I mean, we even have a school lunch program. So what if sometimes there are more olives and apples than the kids can actually eat? But you know, it’s not over. In 20 years, school lunch would face another crisis. **Chapter Four: The Rediscovery of Hunger** Alexis Pedrick:Chapter Four: the rediscovery of hunger. Hunger in America, 1968:Hunger is hard to recognize in America. We know it in other places, like Asia and Africa. 10 million Americans are hungry. That’s just the arithmetic. Unfortunately, the problem is all too human. Alexis Pedrick:That’s a clip from the 1968 CBS documentary Hunger in America. That prosperity we were experiencing? The image of the United States as a wealthy country? Turns out there was more to the story. Jane Black:So in 1968, a landmark report was released which was called Their Daily Bread, and it was a look at how the school lunch program was working and what it revealed was that and it was shocking. One third of the 6 million children living in poverty were receiving free or subsidized lunch. There was actually an example in the report that I always remember: that was one school in Alabama had just 15 meals for a thousand children, because that was all that the money that the USDA was sending that they could afford. Hunger in America, 1968: (Interviewer)When you go to school there, do you take lunch with you? (Student)No, sir. (Interviewer)And what do you eat at noon, then? (Student)Nothing. (Interviewer)Do they have…do they have a cafeteria there? (Student)Yes, sir. (Interviewer)Do they know that you eat nothing at noon? (Student)I guess not. (Interviewer)How much does lunch cost over there? (Student)35. (Interviewer)Do you have $0.35 to buy your food with? (Student)No. Alexis Pedrick:Up until this point, the Department of Agriculture was providing schools with food and also giving school districts money to subsidize the cost of these meals. But over time, the math had changed. Jane Black:By the 60s, the schools really weren’t receiving enough money to cover their costs, and so the very poorest schools started to pull out of the program because they, you know, the money just wasn’t enough. They couldn’t feed enough kids. They said, we’re not going to participate. The unintended consequence, and I really think that unintended consequences are a theme of school lunch history, is that middle class students were the ones that ended up benefiting the most because the USDA money would come in. It wasn’t quite enough, but in these wealthier communities, the community could make up the difference. So rich kids end up getting school lunch. Not rich, but middle class and rich kids end up getting school lunch and poor kids don’t, which is not what they had set out to do. So Congress was shamed into taking some action. Alexis Pedrick:There were congressional hearings like this one led by Louisiana Senator Allen Ellender, where he was confronted by welfare rights activist Martha Grass. Allen Ellender, ABC News, 1969:You’re looking at the man who fathered the school lunch program. It’s my program that I put in 20 years ago. Martha Grass, ABC News, 1969:How come those kids are not eating as of today? Alexis Pedrick:In 1969, Richard Nixon addressed the problem. Nixon Addresses Hunger, 1969 :The plain fact is that a great many Americans are not eating well enough to sustain health. Alexis Pedrick:By the 1970s, a series of bills overhauled the school lunch program. Jane Black:And what they did was they created what we now call the three-tiered system. And what this was was that so students from the very poorest families would be entitled to a completely free meal. And those with more, maybe not a lot, but more, would pay a reduced price and everyone else would pay the full price. And the system had the virtue of guaranteeing that the poorest children would be fed. Alexis Pedrick:This was a huge victory, but it also brought complications and some unintended consequences. The programs expanded and rapidly became more expensive, and schools were forced to do more with less. Here’s Susan Levine. Susan Levine:The result of that is problematic because the free lunch mandate only covers the cost of food. It doesn’t cover the cost of equipment that throws the local and state school lunch programs into a quandary, because they have to then provide free lunch, but they also have to then come up with increased funds to pay for the expanded number of kids that they’re serving. Alexis Pedrick:With less money for kitchen equipment and cafeteria workers. Local governments had to find a way to make it work. Some school districts turned to the private sector. Until the 1970s, this wasn’t allowed, but that changed. Susan Levine:By the 70s—end of the 70s—those regulations are lifted or eased, and some school districts begin to contract with private food service companies. Alexis Pedrick:By bringing in outside vendors, they basically allowed fast food into the schools, putting it at odds with the nutritional goals the program was also trying to meet. Jane Black:But at the same time, it also—and here’s one of those unintended consequences—transformed School Lunch into a program that felt like a welfare program that felt like a program for poor kids, rather than a program for all children. Alexis Pedrick:I’m intimately familiar with this problem, because I was one of those kids that got free school lunch. When you start differentiating between poor and better off kids, it creates stigma and shame. Janet Poppendieck:It doesn’t work well. It undermines the reputation of the food. So then kids don’t want to eat it because they think of it as poor kid’s food. It imposes a stigma. That’s a deterrent. Some kids who need the food won’t participate because they think people will think they’re poor. It doesn’t happen in all schools, but it happened in a lot of schools. Alexis Pedrick:Add to that the complication of trying to figure out who qualified for these meals. Schools went with a formula created by the Department of Agriculture. It became known as the poverty line, but the number was way too low and didn’t account for how much the cost of living varied from place to place. Schools were overburdened. Figuring out who qualified for free school lunch was one more thing to do. And nutrition was still a problem. And it was about to get worse. **Chapter Five: Let Them Eat Ketchup** Alexis Pedrick:Chapter five: let them eat ketchup. Ronald Reagan’s Inaugural Address, 1981 :In this present crisis, government is not the solution to our problem. Government is the problem. Alexis Pedrick:Nutrition science is a dynamic field, and by 1980 our standards had changed. That year, the Department of Agriculture released new guidelines that encouraged Americans to avoid too much fat, saturated fat, and cholesterol, which was all well and good, but the reality was that school lunches and farm surpluses were still interwoven and these surpluses were contributing to the problem. In the 80s, there was one particular product farmers had a ton of. Here’s Jane Black again. Jane Black:There’s this very famous example in the 1980s when dairy farmers found themselves awash in milk. And it’s a really interesting, kind of funny little backstory, which is that this was the time when farmers had started to use hormones to get cattle to produce more milk. The problem was the cattle produced more milk. And then they thought, oh my God, what are we going to do? Like it’s more efficient, but what are we going to do with all this milk? And so they thought, okay, well we’ll turn it into cheese because cheese is essentially a way to preserve milk if you think about it. So they turned it all into cheese, but then they didn’t know what to do with the cheese. And so they started to stockpile it. NBC Evening News, 1981:Among the problems facing the United States government: cheese. More than a quarter of a million tons of cheese. Mountains of surplus cheese piling up in refrigerated warehouses. The surplus is growing so rapidly that some cabinet members are meeting tomorrow to discuss what to do with it. Lisa Myers reports. Jane Black:And it’s a very interesting fact that many people don’t know that under Kansas City, there are these miles and miles of tunnels where the government stores surplus products. And at this point in the 1980s, the caves were full. I mean, literally miles of caves, floor to ceiling, stacked with cheese. NBC Evening News, 1981:5 pound blocks of processed American, 500 barrels of cheddar, 560 million pounds of cheese, more than 2 pounds for every man, woman and child in this country. And that’s only a third of the surplus dairy products that cost the government as much as $1 million a day just to keep. It’s an incredibly weird situation to have all of these stocks, and we’re still buying them and taking them on and spending a billion and a half a year on these stocks. It’s inexcusable. Jane Black:And so the government says, what are we going to do with this? And they think, oh, let’s give it to the schools. Great idea. The problem was that this happened right at the time, in the 1980s, when suddenly the American public decided it was terrified of saturated fat. Alexis Pedrick:So how did schools solve this cheese Fort Knox situation while not straying too far from their nutritional goals? I’d love to tell you they did something fancy with nutritional science, but they really just did things like cut the amount of mozzarella cheese they used on pizzas. School lunch took another hit when Ronald Reagan became president. CBS Evening News, 1981:The Reagan administration today proposed reductions in the minimum amount of food in school lunches. It says the minimum will still provide up to one third of the average daily allowance for most nutrients. But critics, says Bill Lynch Reports, charge the program substitutes a snack. CBS Evening News, 1981:Portions of meat and vegetables are also reduced, so that a serving of a two-ounce hamburger with ten French fries, previously required for elementary schools, is cut back to a 1.5oz hamburger with six French fries. Alexis Pedrick:So now school lunches are smaller and less healthy. But Reagan came up with a clever, if controversial, solution. Lunch Line, 2010:The administration has been under fire ever since it put out rules saying that ketchup and relish were vegetables under the school lunch program, and that the hamburgers could be part soybean. Democratic senators denounced the rules as they ate school lunches yesterday. Lunch Line, 2010:This is the vegetable. This little cup, which is half sugar, is the vegetable. You’re going to have to go along with this plate of food. And it’s absolutely obscene. Alexis Pedrick:That’s right. Ketchup, if you follow the logic, is made out of tomatoes. So it was just like having tomatoes on the table. Advocates had a banquet meal on the steps of the Capitol, proudly showing how meager and thus cheaper a school lunch could be, and still get reimbursed. The press had a field day and the ketchup proposal was withdrawn a month later. Instead, they lowered the eligibility requirements for free school lunch, which meant students now had to be below the poverty line to qualify. They also paid less money to farmers for their excess crops. And while this solved the budgetary issue, it also created some unintended consequences. Janet Poppendieck:The meals became more expensive and a lot of people decided not to eat them, to bring lunch from home, or increasingly, kids go out to the corner store for lunch. So you had a drop in the paying customers. You had a drop in the reduced price participation. And you had a less adequate reimbursement for the meals served free. So it created a financial crisis. Alexis Pedrick:Schools responded by switching to industrialized meal systems. Think airline meals or TV dinners that are manufactured, frozen and then sent to schools to be reheated. Plus, as even more schools turned to privatization, companies began courting school districts. Janet Poppendieck:And these vendors came in and sold school boards on a whole system where the vendor provided the walk-in freezer, the stacked tray, things that you roll the meals into the freezer and out of the freezer, and then you roll them into an oven. So you needed almost no labor. Alexis Pedrick:And maybe now this starts to sound like the school lunch, you know, and well, know. A three-tier semi-private system with food kids don’t love and thus don’t want to eat, that creates shame and more work for schools in trying to determine who’s worthy. What was it those kids at the beginning said? Henry H. Houston Elementary School Students:(Student 2)We need to do better. **Chapter Six: Universal School Lunch** Alexis Pedrick:Chapter six: Universal School Lunch. Around the time that school lunch was becoming privatized and struggling with shortfalls was when Janet Poppendieck went from being an academic to an organizer. Her main goal was to implement universal school lunch. This means that all the meals are free to all of the kids, no matter their income level. Janet Poppendieck:I believe that universal free school meals creates a situation in which you can integrate the school meal with the curriculum in a way that I don’t think you can do when the meal is stigmatized, or only some kids are‌ eating. So that’s what I look forward to. A time in the future when all our kids will have access to meals free as a regular part of the school day. Alexis Pedrick:It is in some ways, a return to the vision that those first Municipal Housekeeping groups and Home Economics associations had. And it’s not that far off. Changes started during the Obama administration with the passage of the Healthy, Hunger-Free Kids Act of 2010. The act basically raised reimbursement rates. Andrew Ruis:But also introduced the Community Eligibility Program, which under which basically if a certain percentage of kids at a school would qualify for free or reduced-price lunches individually, then the whole school could qualify. Alexis Pedrick:It was a huge reduction in paperwork because as long as 80% of students meet the income guidelines, schools are allowed to serve universal school lunch, which is how it is in Philadelphia. This is Stacy Smith, who oversees the lunch program for the entire district. Stacy Smith:Any student that’s within the School district of Philadelphia can receive a free breakfast or free lunch, which is great. You know, they don’t have to—it just does—it just makes it so much easier and cleaner. Well, I think that they had employees that specifically only dealt with the application process. Janet Poppendieck:It’s a much more sensible way to feed children at school. You can focus on preparing good, healthy, nutritious meals. Alexis Pedrick:In 2017, Poppendieck and others persuaded the City of New York to get funds for a universal school lunch, and she’s very proud of the fact that it represents exactly what New York City values, like diversity and a dedication to healthier eating and local foods. Rigoberto Hernandez:If I was to go to a New York City public school. Now, what? What would be on the table? Janet Poppendieck:Well, you would see that we value diversity because on the menu would be some Asian American food traditions and some Italian American food traditions. And there are some schools in New York City that provide halal food and some that provide kosher food. So you would see that we value diversity. You would see that there’s an effort to provide kid food, kids’ favorite foods. So you would undoubtedly find varieties of chicken nuggets and burgers. You would find New York State apples and other foods identified as New York State. You would find it a clear, articulated concern about the climate impacts and sustainability. Alexis Pedrick:There’s one final crisis in our story. CBS Sacremento, 2020:With thousands of local students at home and many parents out of work right now. School meals right now are critical. CBS Sacremento, 2020:Some are very anxious. They’re worried where, you know, “is this going to stop or…” I’m just telling them I’ll be here every day. Alexis Pedrick:During the Covid-19 pandemic, a waiver program gave every student in the country access to free breakfasts and lunch. Janet Poppendieck:So briefly, we had nationwide universal free school meals. And advocates, of course, were hoping that we would continue. Alexis Pedrick:It opened a lot of people’s eyes to how essential school lunches and the people who make them are Janet Poppendieck:During the pandemic, there were suddenly lunch ladies on the cover of Time magazine or what have you. And I don’t think that was a trivial change. I think that was a long overdue recognition that there have been people who have been working hard, trying to provide not just nutritionally adequate, healthy, but also tasty meals for students. Alexis Pedrick:And the benefits during the pandemic were measurable. Average daily participation in the lunch program increased by 1.4 million. 95% of school districts said it reduced hunger, and 82% said that it helped academic achievement. Nevertheless, after two years, Congress ended the waiver program. House Session Part 1, C-SPAN, 2022:By returning these programs back to normal. We can uphold our responsibility to taxpayers and the principle that aid should be targeted and temporary. Alexis Pedrick:And so we were back where we started. But remember, you can’t put the genie back in the bottle. Since the pandemic, eight states have passed laws making school lunches universal. California, Colorado. Maine, Massachusetts, Michigan, Minnesota, New Mexico and Vermont. And Janet Poppendieck helped get it passed in New York state. Janet Poppendieck:And we believe that it will be announced any day now. Alexis Pedrick:Over the years, many people have tried to improve the school lunch from celebrity chefs like Jamie Oliver and Marc Vetri in Philadelphia to RFK Jr. But making a healthy school lunch that kids want to eat from scratch is nearly impossible with the money allocated, just $1.25 per meal. But that hasn’t stopped schools from trying. Here’s Stacey Smith again. Stacy Smith:And that’s what we tell our managers, like, the students, are our customers, so we want them to be satisfied. When you go to a restaurant, if you had a bad experience, are you going to go back? I mean, if the kids don’t like what they’re being served, then they’re not going to eat it. The last thing we want is for them to throw it away. Alexis Pedrick:So they get student feedback and they innovate. And many of the kids seem to be responding to it. Henry H. Houston Elementary School Students: (Student 5)Now hold on there, them tater tots good. (Other students)Oh yeah! (Student 5) I ain’t gonna hold you. Alexis Pedrick:Probably the biggest success they’ve had in recent years is with something known as the Walking Taco. It’s basically a bag of Frito-Lays that’s turned sideways, cut open with scissors, and then students can choose to fill it with ground beef or chicken or cheese, basically customize it however they want. Even the harsh critics we heard from earlier had nice things to say about it. Henry H. Houston Elementary School Students: (Other students)Oh yeah, the walking taco! So the walking taco hit different! Alexis Pedrick:Besides making foods that kids want to eat, the Philly School lunch program also ensures that fruits and vegetables are included. Gina Coyle:I’ve worked for the district for 21 years. I’m very particular about my job. I like it “ding, ding, ding.” I run a tight ship. Alexis Pedrick:That’s Gina Coyle. She manages the cafeteria at Anne Frank school. Gina Coyle:For lunch, we have…Next week we’re having meatball sandwiches on Monday. And you’ll have pizza. You’ll have baby carrots, French fries, apples and craisins. Tuesday, you’ll have a new item. Chicken wings with pepper jack, pretzel bites, cucumbers, vegetable juice, a pear or applesauce. Alexis Pedrick:The menus might sound unremarkable to some, but it illustrates all the victories and compromises that have been won since the inception of school lunch. Anne Frank School, 5th Grader:Make sure you come sit with us. Alexis Pedrick:That’s a fifth grader at Anne Frank School in Northeast Philadelphia. Our producer, Rigo, sat down with them for lunch on a recent spring day. Anne Frank School, 5th Grader:The chocolate milk is the best. Rigoberto Hernandez:How does this compare to home? Anne Frank School, 5th Grader:Compared to home? Like this is the same. They’re both pretty good. So today we are eating some chicken nugget bites. Very delicious. Ten out of ten. We have some frozen, basically, like, a water ice. Yeah, I’m obsessed with it. Alexis Pedrick:So perhaps we should take a cue from these kids. And the next time we think about school lunch, give it some grace. It’s a miracle that happens every day. And it’s been more than a hundred years in the making. **Listen to more episodes** **Science, Interrupted** The story of the 1975 Asilomar Conference on Recombinant DNA. **ALS Patients Take on the FDA** Research on the deadly disease progressed dramatically after the 2014 Ice Bucket Challenge, but a huge blow came when the most recent treatment was taken off the market. **The Fraud That Transformed Psychiatry** Psychology professor David Rosenhan made waves with his “On Being Sane in Insane Places” study, but decades later its legitimacy was questioned. **Never Miss an Episode** 315 Chestnut StreetPhiladelphia, PA 19106215.925.2222info@sciencehistory.org About Leadership Staff & Fellows Projects & Initiatives Awards Program News Pressroom Careers MUSEUM HOURS Wednesday: 12:30pm–5pm Thursday: 12:30pm–5pm Friday: 12:30pm–5pm Saturday: 10am–5pm Sunday: Closed Monday: Closed Tuesday: Closed See an Exhibition Schedule a Library Visit Host An Event Contact Us Support Us Registered 501(c)(3) EIN: 22-2817365 Privacy Policy Terms of Use Accessibility **Republish** Copy the above HTML to republish this content. We have formatted the material to follow our guidelines, which include our credit requirements. Please review ourfull list of guidelinesfor more information. By republishing this content, you agree to our republication requirements."}