{"id": 1846, "name": "World Council for Health", "domain": "worldcouncilforhealth.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "very-low", "questionable": null, "url": "https://www.worldcouncilforhealth.org/new-zealand-human-rights-advocates-call-for-immediate-exit-from-who-pandemic-treaty-amid-icc-complaint/", "title": "New Zealand Human Rights Advocates Call For Immediate Exit From Who Pandemic Treaty Amid Icc Complaint", "content": "About WCHWho We AreBetter Way PrinciplesCoalition PartnersWikipediaSteering CommitteeLaw & Activism CommitteeHealth and Science CommitteeContact Us Who We Are Better Way Principles Coalition Partners Wikipedia Steering Committee Law & Activism Committee Health and Science Committee Contact Us Who We Are Better Way Principles Coalition Partners Wikipedia Steering Committee Law & Activism Committee Health and Science Committee Contact Us News & EventsNewsEventsLive StreamsRumble StreamSubstack News Events Live Streams Rumble Stream Substack News Events Live Streams Rumble Stream Substack Country CouncilsCountry CouncilsWCH Nursing Country Councils WCH Nursing Country Councils WCH Nursing Health ResourcesSpike Protein Detox GuideEarly Covid-19 TreatmentCovid 19 vaccine pharmacovigilance reportTestingVaccine ResourcesClimate AgendaWind Turbines5G & Electromagnetic RadiationHealth Guide SeriesArticles & GuidesHealth LeafletsWCH MarketplacePolicy & Legal Briefs Spike Protein Detox Guide Early Covid-19 Treatment Covid 19 vaccine pharmacovigilance report Testing Vaccine Resources Climate Agenda Wind Turbines 5G & Electromagnetic Radiation Health Guide Series Articles & Guides Health Leaflets WCH Marketplace Policy & Legal Briefs Spike Protein Detox Guide Early Covid-19 Treatment Covid 19 vaccine pharmacovigilance report Testing Vaccine Resources Climate Agenda Wind Turbines 5G & Electromagnetic Radiation Health Guide Series Articles & Guides Health Leaflets WCH Marketplace Policy & Legal Briefs ResearchWCH ResearchDetox & Wellbeing Study WCH Research Detox & Wellbeing Study WCH Research Detox & Wellbeing Study Get InvolvedSpread LOVE CampaignAsk me / Tell Me CampaignDetox & Wellbeing StudyThe Great Freeset CampaignExit the WHOCease and Desist Covid Vaccines CampaignWork With Us Spread LOVE Campaign Ask me / Tell Me Campaign Detox & Wellbeing Study The Great Freeset Campaign Exit the WHO Cease and Desist Covid Vaccines Campaign Work With Us Spread LOVE Campaign Ask me / Tell Me Campaign Detox & Wellbeing Study The Great Freeset Campaign Exit the WHO Cease and Desist Covid Vaccines Campaign Work With Us About WCHWho We AreBetter Way PrinciplesCoalition PartnersWikipediaSteering CommitteeLaw & Activism CommitteeHealth and Science CommitteeContact Us Who We Are Better Way Principles Coalition Partners Wikipedia Steering Committee Law & Activism Committee Health and Science Committee Contact Us Who We Are Better Way Principles Coalition Partners Wikipedia Steering Committee Law & Activism Committee Health and Science Committee Contact Us News & EventsNewsEventsLive StreamsRumble StreamSubstack News Events Live Streams Rumble Stream Substack News Events Live Streams Rumble Stream Substack Country CouncilsCountry CouncilsWCH Nursing Country Councils WCH Nursing Country Councils WCH Nursing Health ResourcesSpike Protein Detox GuideEarly Covid-19 TreatmentCovid 19 vaccine pharmacovigilance reportTestingVaccine ResourcesClimate AgendaWind Turbines5G & Electromagnetic RadiationHealth Guide SeriesArticles & GuidesHealth LeafletsWCH MarketplacePolicy & Legal Briefs Spike Protein Detox Guide Early Covid-19 Treatment Covid 19 vaccine pharmacovigilance report Testing Vaccine Resources Climate Agenda Wind Turbines 5G & Electromagnetic Radiation Health Guide Series Articles & Guides Health Leaflets WCH Marketplace Policy & Legal Briefs Spike Protein Detox Guide Early Covid-19 Treatment Covid 19 vaccine pharmacovigilance report Testing Vaccine Resources Climate Agenda Wind Turbines 5G & Electromagnetic Radiation Health Guide Series Articles & Guides Health Leaflets WCH Marketplace Policy & Legal Briefs ResearchWCH ResearchDetox & Wellbeing Study WCH Research Detox & Wellbeing Study WCH Research Detox & Wellbeing Study Get InvolvedSpread LOVE CampaignAsk me / Tell Me CampaignDetox & Wellbeing StudyThe Great Freeset CampaignExit the WHOCease and Desist Covid Vaccines CampaignWork With Us Spread LOVE Campaign Ask me / Tell Me Campaign Detox & Wellbeing Study The Great Freeset Campaign Exit the WHO Cease and Desist Covid Vaccines Campaign Work With Us Spread LOVE Campaign Ask me / Tell Me Campaign Detox & Wellbeing Study The Great Freeset Campaign Exit the WHO Cease and Desist Covid Vaccines Campaign Work With Us Home Who We Are Better Way Principles Coalition Partners Wikipedia Steering Committee Law & Activism Committee Health and Science Committee Contact Us Home Who We Are Better Way Principles Coalition Partners Wikipedia Steering Committee Law & Activism Committee Health and Science Committee Contact Us News Events Live Streams Rumble Stream Substack News Events Live Streams Rumble Stream Substack Country Councils WCH Nursing Country Councils WCH Nursing Spike Protein Detox Guide Early Covid-19 Treatment Covid 19 vaccine pharmacovigilance report Testing Vaccine Resources Climate Agenda Wind Turbines 5G & Electromagnetic Radiation Health Guide Series Articles & Guides Health Leaflets WCH Marketplace Policy & Legal Briefs Spike Protein Detox Guide Early Covid-19 Treatment Covid 19 vaccine pharmacovigilance report Testing Vaccine Resources Climate Agenda Wind Turbines 5G & Electromagnetic Radiation Health Guide Series Articles & Guides Health Leaflets WCH Marketplace Policy & Legal Briefs WCH Research WCH Research Detox & Wellbeing Study WCH Research WCH Research Detox & Wellbeing Study Spread LOVE Campaign Ask me / Tell Me Campaign Detox & Wellbeing Campaign The Great Freeset Campaign Exit the WHO Cease and Desist Covid Vaccines Campaign Work With Us WCH Research Spread LOVE Campaign Ask me / Tell Me Campaign Detox & Wellbeing Campaign The Great Freeset Campaign Exit the WHO Cease and Desist Covid Vaccines Campaign Work With Us WCH Research **From GUIDES TO GREATREADS VISIT OUR SHOP** **CONTRIBUTE TO A HEALTHIER WORLD** **Recommended Searches** About WCH Committees Health Resources Get Involved May 27, 2025 Blog,Latest News,News **New Zealand Human Rights Advocates Call for Immediate Exit from WHO Pandemic Treaty Amid ICC Complaint** WELLINGTON, AOTEAROA NEW ZEALAND | 14 MAY 2025— In a formal communication submitted to the New Zealand Parliament’s Foreign Affairs division, a coalition of human rights advocates, led byRongo Whakawa, has called for the government to immediately withdraw from the World Health Organization’s Pandemic Treaty and exit the WHO altogether. This demand follows the filing of a formal complaint with theInternational Criminal Court (ICC), accusing New Zealand officials and international partners ofgenocide and crimes against humanity. The complaint is rooted in allegations of grave violations underArticles 6 to 8 bis of the Rome Statute, specifically citing the deployment of biological weapons on New Zealand’s population under the guise of emergency health declarations. The submission argues thatexperimental Covid-19 countermeasures— distributed during the pandemic — were falsely promoted as safe and effective but are now alleged to containbiological weapon components, including toxic lipid nanoparticles, plasmid DNA, and SV-40 virus fragments far exceeding permissible safety thresholds. “There is mounting evidence that these substances, delivered under fraudulent emergency authorisations, may cause long-term genetic harm,” the letter states. “The New Zealand Government, operating under the corporate entity of the ‘Crown in right of New Zealand,’ has failed in its duty to protect both the general population and the Indigenous Māori people.” **WHO Leadership Under Scrutiny** The communication also points to multiple complaints filed with the ICC againstWHO Director-General Tedros Adhanom Ghebreyesus, citing his alleged collusion with organisations implicated in a broader depopulation agenda and global governance takeover. This assertion is reinforced byDr. David Martin’s testimony to the European Parliament, which describes the WHO’s influence as a form of “global tyranny,” and echoes Professor Michel Chossudovsky’s analysis of a “global coup d’état against humanity.” Links to these statements were provided: Dr. David Martin: WHO Tyranny Testimony Prof. Chossudovsky: Global Coup Analysis **Human Rights Violations and Legal Frameworks** The letter further references violations of key international legal instruments, including: TheUniversal Declaration on Bioethics and Human Rights TheNuremberg Code (1946) TheDeclaration of Helsinki (1948) TheInternational Covenant on Civil and Political Rights, Article 7 The1989 Biological Weapons Anti-Terrorism Act International human rights lawyerDr. Willem van Aardtis cited as having provided expert opinion on these breaches, asserting that millions of New Zealanders were subjected to coercion, misinformation, and involuntary medical experimentation. His interviews and findings are publicly accessible: Willem van Aardt on Voluntary Consent and Bioweapons **Allegations of HIV Components and Immune Suppression** Further deepening the concern is the discovery ofHIV-related sequenceswithin the genetic makeup of the C-19 vaccine formulations. Independent researchers and platforms, includingChildren’s Health DefenseandAnandamide Substack, report that these genetic inserts could potentially compromise immune system function. Children’s Health Defense: Repeated Vaccines and Immune Harm Anandamide: Fauci HIV Vax Sequence **Call for Accountability and National Sovereignty** The letter concludes by asserting that the New Zealand Government, while operating under thePREP Actand emergency military measures, isno longer able to represent the people of New Zealand in good faith. The authors contend that any treaties signed under current conditions — including the WHO Pandemic Treaty — are invalid due to coercion and violation of sovereign rights. “This is not just a legal issue, it’s a matter of life, dignity, and national survival,” says Rongo Whakawa. “We urge the government to take immediate action to restore sovereignty, demand accountability, and protect the people from further harm.” **Yes! I'll support WCHand a healthier world.** **Latest Articles** **93% of Gaza’s Children at Critical Risk: World Council for Health Statement on Deliberate Starvation and Targeting of Civilians in Gaza and Global Humanitarian Crises** **Darkfield Microscopy and EMF Monitoring Reveal Disturbing Findings Relating to Infant Deaths in the Philippines** **Doctors Hold Historic Rally in Drug Price Protest** **WCH Files Report to the Federal Communications Commission to Protect Public Health from the Impacts of Wireless Radiation** **Join our newsletter** © World Council for Health 2025 World Council for Health About The World Council for Health World Council for Health Steering Committee Better Way Principles Wikipedia World Council for Health About The World Council for Health World Council for Health Steering Committee Better Way Principles Wikipedia All News Live Streams Health Leaflets Health Guide Series Spike Protein Detox Guide All News Live Streams Health Leaflets Health Guide Series Spike Protein Detox Guide Terms and Conditions Privacy Policy Transparency & Disclaimer Volunteer Contact Us Terms and Conditions Privacy Policy Transparency & Disclaimer Volunteer Contact Us Designed & Developed with love by Unitedly **Subscribe To Our Bi-weekly Newsletter** Welcome to our new website, We have new content being added all the time, Sign up to receive regular updates."}