{"id": 2046, "name": "Milwaukee Independent", "domain": "milwaukeeindependent.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.milwaukeeindependent.com/heather-richardson/cowardice-can-contagious-governor-j-b-pritzker-gives-barn-burning-speech-energize-democrats/", "title": "Cowardice Can Contagious Governor J B Pritzker Gives Barn Burning Speech Energize Democrats", "content": "© Donate Contact Subscribe NewsArticlesPhotosColumnsProfiles Articles Photos Columns Profiles Articles Photos Columns Profiles FeaturedSpecialsNewswireVideoAudio Specials Newswire Video Audio Specials Newswire Video Audio AboutOur StoryContactSupportSubscribe Our Story Contact Support Subscribe Our Story Contact Support Subscribe Timeline Select Page **Cowardice can be contagious: Governor J.B. Pritzker gives barn-burning speech to energize Democrats** Posted byHeather Cox Richardson|May 1, 2025 There has been a change afoot in the Democratic Party for a while now as its leaders shift from trying to find common ground with Republicans to standing firmly against MAGAs and articulating their own vision for the United States. That shift burst dramatically into the open last night when Democratic Illinois governor J.B. Pritzker gave a barn-burning speech to Democrats in New Hampshire. After walking out to the American Authors song “Go Big or Go Home,” Pritzker urged Democrats to stop listening to “do-nothing political types” who are calling for caution at a time when Americans are demanding urgent action, and to “fight—EVERYWHERE AND ALL AT ONCE.” Pritzker highlighted three ordinary Americans who are opposing the Trump administration and Elon Musk’s “Department of Government Efficiency” by building communities to protest, hanging an upside-down flag on the face of Yosemite National Park’s famous cliff El Capitan, and welcoming Vice President J.D. Vance to Sugarbush Resort in Vermont with a snow report calling attention to the administration’s attacks on veterans, people with disabilities, LGBTQ+ Americans, immigrant workers, and people of color. He urged Democrats to lead with the same passion. He listed the positions on which he wants Democrats to stand firm, beginning: “It’s wrong to snatch a person off the street and ship them to a foreign gulag with no chance to defend themselves in a court of law.” This is not about immigration, he said, but about the Constitution. “Standing for the idea that the government doesn’t have the right to kidnap you without due process is arguably the MOST EFFECTIVE CAMPAIGN SLOGAN IN HISTORY,” he said. “Today, it’s an immigrant with a tattoo. Tomorrow, it’s a citizen whose Facebook post annoys Trump.” Pritzker tore into the MAGA myth that Democrats want rapists and murderers on the streets, saying that Democrats do not want undocumented immigrants who are convicted of violent crimes to stay in the country. He called for “real, sensible immigration reform.” But, he said, “Immigration—with all its struggles and its complexities, is part of the secret sauce that makes America great, always. Immigrants strengthen our communities, enrich our neighborhoods, renew our passion for America’s greatness, enliven our music and our culture, enhance understanding of the world. The success of our economy depends upon immigrants. In fact, forty-six percent … of Fortune 500 companies were founded by immigrants or the children of immigrants.” Trump’s attacks on immigrants, he said, are likely to make the U.S. economy fail. Indeed, he suggested, making America fail is the point of the Trump administration’s actions. “We have a Secretary of Education who hates teachers and schools,” he said. “We have a Secretary of Transportation who hates public transit. We have an Attorney General who hates the Constitution. We have a Secretary of State, the son of naturalized citizens, a family of refugees, on a crusade to expel our country of both. “We have a head of the Department of Government Efficiency, an immigrant granted the privilege of living and working here, a man who has made hundreds of billions of dollars after the government rescued his business for him, who is looking to destroy the American middle class to fund tax cuts for himself. And we have a President who claims to love America but who hates our military so much that he calls them ‘losers’ and ‘suckers’ and who can’t be bothered to delay his golf game to greet the bodies of four fallen US soldiers. And we have a Grand Old Party, founded by one of our nation’s bravest Presidents, Abraham Lincoln—who today would be a Democrat, I might add… so afraid of the felon and the fraud that they put in the White House that they would sooner watch him destroy our country than lift a hand to save it.” He called on Democrats to “stop wondering if you can trust the nuclear codes to people who don’t know how to organize a group chat. It’s time to stop ignoring the hypocrisy in wearing a big gold cross while announcing the defunding of children’s cancer research. And time to stop thinking we can reason or negotiate with a madman. Time to stop apologizing when we were NOT wrong. Time to stop surrendering, when we need to fight. “Our small businesses don’t deserve to be bankrupted by unsustainable tariffs. Our retirees don’t deserve to be left destitute by a Social Security Administration decimated by Elon Musk. Our citizens don’t deserve to lose healthcare coverage because Republicans want to hand a tax cut to billionaires. Our federal workers don’t deserve to have, well, a 19-year-old DOGE bro called Big Balls destroy their careers. “Autistic kids and adults who are loving contributors to our society don’t deserve to be stigmatized by a weird nepo baby who once stashed a dead bear in the backseat of his car. “Our military servicemembers don’t deserve to be told by a washed up Fox TV commentator, who drank too much and committed sexual assault before being appointed Secretary of Defense, that they can’t serve this country simply because they’re Black or gay or a woman. “And If it sounds like I’m becoming contemptuous of Donald Trump and the people that he has elevated, it’s because… I am. You should be too. They are an affront to every value this country was founded upon.” Pritzker called on Democrats to be “bold and our ideas fearless…. And we must deliver on that agenda for working families and for the real people who truly make America great.” “I understand the tendency to give in to despair right now,” he said, “But despair is an indulgence that we cannot afford in the times upon which history turns. Never before in my life have I called for mass protests, for mobilization, for disruption. But I am now. “These Republicans cannot know a moment of peace. They have to understand that we will fight their cruelty with every megaphone and microphone that we have. We must castigate them on the soap box, and then punish them at the ballot box. They must feel in their bones that when we survive this shameful episode of American history with our democracy intact—because we have no alternative but to do just that—that we will relegate their portraits to the museum halls reserved for tyrants and traitors.” “Cowardice can be contagious,” Pritzker said, “But so too can courage…. Just as the hope that we hold onto in the darkness, shines with its own…special light. “Tonight, I’m telling you what I’m willing to do…is fight—for our democracy, for our liberty, for the opportunity for all our people to live lives that are meaningful and free. And I see around me tonight a roomful of people who are ready to do the same.” “So I have one question for all of you,” Pritzker said. “Are you ready for the fight?” Written By © Photo Subscribe Hеаthеr Cоx Rіchаrdsоn Reba Saldanha (AP) Letters from an Аmericanis a daily email newsletter written by Heather Cox Richardson, about the history behind today’s politics Share: **About The Author** Heather Cox Richardson is Professor of History at Boston College and an expert on American political and economic history. She writes extensively on history and current affairs, and is the author of the widely-readLetters from an American, a nightly chronicle of American politics. Her latest book isDemocracy Awakening: Notes on the State of America. **Related Posts** January 9, 2023 October 8, 2022 April 4, 2023 August 10, 2021 Special Reports Journalism Awards la comunidad puertorriqueña de Milwaukee celebra el histórico regreso del desfile tras tres décadas de ausencia Responsabilidad por el caos: el movimiento de Trump, construido sobre la crueldad, enfrenta un ajuste de cuentas sin espacio para el arrepentimiento Por qué “humillar a los progresistas” es el último refugio de una ideología fracasada que no puede defender sus políticas por sus méritos Milwaukee advocates join peaceful nationwide protests against Trump’s mass detentions by ICE in L.A. Trump escalates public resistance to harsh ICE raids in L.A. into a political crisis of his own making The National Guard once defended civil rights but now Trump uses it in L.A. to criminalize protests Milwaukee Independent emerges as a Wisconsin leader for reporting on artificial intelligence How the invention of photography transformed art without exploiting its creators as AI does today Articles Photos Explainers Broadcast español+ Heather Richardson Thom Hartmann John Pavlovitz Robert Reich Reggie Jackson Mitchell A. Sobieski Pardeep Kaleka Jasmyne Jade Hill Kenneth Cole Noria Doyle Dominic Inouye Contributors We Need Each Other: Downtown Milwaukee buildings illuminate the darkness with beacons of hope We Need Each Other: Downtown Milwaukee buildings illuminate the darkness with beacons of hope We Need Each Other: Downtown Milwaukee buildings illuminate the darkness with beacons of hope la comunidad puertorriqueña de Milwaukee celebra el histórico regreso del desfile tras tres décadas de ausencia Responsabilidad por el caos: el movimiento de Trump, construido sobre la crueldad, enfrenta un ajuste de cuentas sin espacio para el arrepentimiento Por qué “humillar a los progresistas” es el último refugio de una ideología fracasada que no puede defender sus políticas por sus méritos SPECIAL | Exploring Korea: Stories from Milwaukee to the DMZ and across a divided peninsula SPECIAL | Exploring Korea: Stories from Milwaukee to the DMZ and across a divided peninsula SPECIAL | Exploring Korea: Stories from Milwaukee to the DMZ and across a divided peninsula Black Lives Matter COVID-19 Pandemic Earthquake in Türkiye Exploring Fukushima Invasion of Ukraine Jordan Medical Mission Contribute Endorsements Membership Our Story Timeline Year In Review Designed byElegant Themes| Powered byWordPress Transformative Journalism  Daily Newswire Editorial Specials Graphics Profiles Podcasts Donate Contact © Privacy"}