{"id": 1308, "name": "Stars and Stripes", "domain": "stripes.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.stripes.com/theaters/americas/2025-06-11/denmark-approves-us-military-bases-on-danish-soil-as-trump-eyes-greenland-18086796.html", "title": "Denmark Approves Us Military Bases On Danish Soil As Trump Eyes Greenland 18086796.html", "content": "Theaters Branches Veterans History Living Sports Multimedia Communities Theaters U.S. Europe - K-town Now Asia-Pacific - Storm Tracker Middle East Americas Africa Veterans News Map of Memorials Jobs Obituaries Living Events Entertainment - Movies - Video Games Europe Travel - Quick Trips - After Hours - Events Pacific Travel - Quick Trips - After Hours - Events The Meat and Potatoes of Life U.S. Travel Opinion Storm Tracker Promotions Rewards for readers Get Stripes Subscribe ePaper Stripes Lite Archives/Library Special Publications Mobile Apps Email Newsletters Digital Access Home Delivery Branches Army Marine Corps Navy Air Force Coast Guard Space Force Promotions History Archive photo of the day Sports Europe - Schedules Europe - Scoreboards Europe Pacific - Schedules Pacific - Scoreboards Pacific - Pacific Sports Blog U.S. Multimedia Podcasts - WW II Podcast - Military Matters - Force for Hire Out of Uniform Videos - WW II Videos Communities Stripes Europe Stripes Guam Stripes Japan Stripes Korea Stripes Okinawa Our Other Websites In Memoriam Month of the Military Child Letters to Santa Printshop **Follow Us:** **Americas** **Denmark approves US military bases on Danish soil as Trump eyes Greenland** The Danish Parliament, Christiansborg Palace in Copenhagen on Feb. 14, 2018. (Philip Davali/Ritzau Scanpix via AP) COPENHAGEN, Denmark — Denmark’s Parliament on Wednesday approved a bill to allow U.S. military bases on Danish soil, a move that comes as President Donald Trump seeks to take control of the kingdom’s semi-autonomous territory of Greenland. Critics say the vote ceded Danish sovereignty to the U.S. The legislation widens a previous military agreement, made in 2023 with the Biden administration, where U.S. troops had broad access to Danish airbases in the Scandinavian country. The new parameters follow Trump’s coveting of the strategic, mineral-rich Arctic island even as the U.S. and Denmark are NATO allies. Danish Foreign Minister Lars Løkke Rasmussen, in a response to lawmakers’ questions, wrote that Denmark would be able to terminate the agreement if the U.S. tries to annex all or part of Greenland. Ninety-four lawmakers voted for the bill, with 11 against. The legislation now goes to Danish King Frederik X for his signature. Greenland’s prime minister previously said U.S. statements about the island have been disrespectful and it “will never, ever be a piece of property that can be bought by just anyone.” **previous coverage** Space Force commander in Greenland fired following Pentagon rebuke Greenland picks party favoring slow independence in surprise Denmark is open to US expansion in Greenland, prime minister says Rubio says Trump Greenland bid ‘not a joke,’ citing China risks Denmark orders ships for Greenland after Trump demands **Subscribe to Stars and Stripes** **stars and stripes videos** **around the web** **stripes top news** **U.S.** **U.S.** **U.S.** **Editors' Picks** VA’s disability calculator produced wrong results, costing some vets thousands of dollars Museums preserving history of 82nd Airborne, 2nd Cavalry among 29 on Army shutdown list K-Town Now features the latest news from the Kaiserslautern Military Community **Video Spotlight** **follow us** **Explore** COVID Archive photo of the day Pacific Storm Tracker Opinion Today's ePaper Contingency Edition Weekly Comics Special Publications **Events** **Sign Up for Daily Headlines** Sign up to receive a daily email of today's top military news stories from Stars and Stripes and top news outlets from around the world. Sign Up Now Our MissionOur MissionOur MissionOur HistoryOur HistoryOur HistoryHelpHelpHelpContact UsStaff DirectoryAdvertise with usFAQsMember ServicesArchive ServicesReprint PermissionsDisclaimerPrivacy PolicyRSS Feeds **Our MissionOur Mission** **Our HistoryOur History** **HelpHelp** Contact Us Staff Directory Advertise with us FAQs Member Services Archive Services Reprint Permissions Disclaimer Privacy Policy RSS Feeds **Our MissionOur Mission** **Our HistoryOur History** **HelpHelp** Contact Us Staff Directory Advertise with us FAQs Member Services Archive Services Reprint Permissions Disclaimer Privacy Policy RSS Feeds TheatersTheatersTheatersToday's Theaters NewsU.S.Middle EastEuropeAsia-PacificAmericasAfricaBranchesBranchesBranchesToday's Branches NewsArmyMarine CorpsNavyAir ForceCoast GuardSpace ForcePromotions **TheatersTheaters** Today's Theaters News U.S. Middle East Europe Asia-Pacific Americas Africa **BranchesBranches** Today's Branches News Army Marine Corps Navy Air Force Coast Guard Space Force Promotions **TheatersTheaters** Today's Theaters News U.S. Middle East Europe Asia-Pacific Americas Africa **BranchesBranches** Today's Branches News Army Marine Corps Navy Air Force Coast Guard Space Force Promotions VeteransVeteransVeteransToday's Veterans NewsMap of MemorialsNewsVA LoansJobsObituariesHistoryHistoryHistoryToday's History NewsArchive photo of the daySportsSportsSportsToday's SportsEuropePacificU.S. **VeteransVeterans** Today's Veterans News Map of Memorials News VA Loans Jobs Obituaries **HistoryHistory** Today's History News Archive photo of the day **SportsSports** Today's Sports Europe Pacific U.S. **VeteransVeterans** Today's Veterans News Map of Memorials News VA Loans Jobs Obituaries **HistoryHistory** Today's History News Archive photo of the day **SportsSports** Today's Sports Europe Pacific U.S. LivingLivingLivingToday's Living NewsEventsEntertainmentEurope TravelPacific TravelThe Meat and Potatoes of LifeU.S. Travel **LivingLiving** Today's Living News Events Entertainment Europe Travel Pacific Travel The Meat and Potatoes of Life U.S. Travel **LivingLiving** Today's Living News Events Entertainment Europe Travel Pacific Travel The Meat and Potatoes of Life U.S. Travel MultimediaMultimediaMultimediaPodcastsOut of UniformVideosGet StripesGet StripesGet StripesSubscribeePaperStripes LiteArchives/LibrarySpecial PublicationsMobile AppsEmail NewslettersDigital AccessHome Delivery **MultimediaMultimedia** Podcasts Out of Uniform Videos **Get StripesGet Stripes** Subscribe ePaper Stripes Lite Archives/Library Special Publications Mobile Apps Email Newsletters Digital Access Home Delivery **MultimediaMultimedia** Podcasts Out of Uniform Videos **Get StripesGet Stripes** Subscribe ePaper Stripes Lite Archives/Library Special Publications Mobile Apps Email Newsletters Digital Access Home Delivery OpinionOpinionOpinionStorm TrackerStorm TrackerStorm TrackerPromotionsPromotionsPromotionsPromotion Rules **OpinionOpinion** **Storm TrackerStorm Tracker** **PromotionsPromotions** Promotion Rules **OpinionOpinion** **Storm TrackerStorm Tracker** **PromotionsPromotions** Promotion Rules Today's ePAPERToday's ePAPERToday's ePAPER **Today's ePAPERToday's ePAPER** **Today's ePAPERToday's ePAPER** Our Other WebsitesOur Other WebsitesOur Other WebsitesStripes JapanStripes EuropeStripes KoreaStripes OkinawaStripes GuamIn MemoriamMonth of the Military ChildLetters to SantaPrintshop **Our Other WebsitesOur Other Websites** Stripes Japan Stripes Europe Stripes Korea Stripes Okinawa Stripes Guam In Memoriam Month of the Military Child Letters to Santa Printshop **Our Other WebsitesOur Other Websites** Stripes Japan Stripes Europe Stripes Korea Stripes Okinawa Stripes Guam In Memoriam Month of the Military Child Letters to Santa Printshop © 2025 Stars and Stripes. All Rights Reserved. | Disclaimer | Web Notices and Privacy Policy | Accessibility / Section 508 | Veterans/Military Crisis Line"}