{"id": 1887, "name": "Americans for Tax Reform (ATR)", "domain": "atr.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://atr.org/house-passed-one-big-beautiful-bill-act-includes-removal-of-200-tax-stamp-on-suppressors/", "title": "House Passed One Big Beautiful Bill Act Includes Removal Of 200 Tax Stamp On Suppressors", "content": "Twitter Facebook LinkedIn YouTube AboutATRGroverCoalition MeetingsInternships ATR Grover Coalition Meetings Internships ATR Grover Coalition Meetings Internships The PledgePledge Database2025 Pledge SignersAbout the PledgeTake the Pledge Pledge Database 2025 Pledge Signers About the Pledge Take the Pledge Pledge Database 2025 Pledge Signers About the Pledge Take the Pledge Policy AreasTax ReformSpending & Regulatory ReformHealthcareTech & TelecomEnergyLaborProperty RightsFinancial Services Tax Reform Spending & Regulatory Reform Healthcare Tech & Telecom Energy Labor Property Rights Financial Services Tax Reform Spending & Regulatory Reform Healthcare Tech & Telecom Energy Labor Property Rights Financial Services Our WorkCommentaryLettersThe Sustainable Budget Project Commentary Letters The Sustainable Budget Project Commentary Letters The Sustainable Budget Project Take Action Donate Americans for Tax Reform OpposesAll Tax IncreasesAs aMatter of Principle. Tax Reform Commentary **House-Passed One, Big, Beautiful Bill Act Includes Removal of $200 Tax Stamp on Suppressors** Nathan Seibert 06/11/2025 Twitter Facebook LinkedIn On May 22nd, the House passed its version of theOne Big Beautiful Bill Act(OBBBA). The legislation includes a long overdue provision to remove the burdensome tax stamp on firearm suppressors. Specifically, this bill would eliminate the $200 excise tax on suppressors. This tax originated from theNational Firearms Act of 1934and has remained unchanged since. Under the OBBBA, suppressors would be taxed at 10 percent, the same level as ordinary firearms. Calls for reforming the treatment of suppressors are not new. Second Amendment advocates have been calling for lawmakers to make a change for decades but gained little traction until recent years. TheHearing Protection Act, which would remove suppressors from the National Firearms Act and eliminate the excise tax, was introduced in 2015 and has been reintroduced numerous times since then. Most recently, by Rep. Ben Cline (R-Va.) in January 2025. Suppressors are simple tools. A suppressor reduces the noise level made by the discharge of a firearm. It does this through a series of baffles that trap and cool the hot gas before it exits the end of the barrel and expands, causing the crack of the shot. To be clear, no discharge of a firearm is silent. Suppressors work to lower the noise of firearms but at no point can they be considered silent. The most effective suppressors on the smallest usable caliber still produce a reading of 110 decibels, the same as a jackhammer. Suppressed firearms often exceed safe levels of sound. The term “silencer” excites uninformed buyers and terrifies uninformed protestors, but this tool cannot silence firearms. Many people might wonder what the application of this tool is if it can’t lower the sound of firearms to a safe level. When used in conjunction with hearing protection, these devices can prevent hearing damage over several years. Aside from this, earbuds protect the user while suppressors bring down sound levels for everyone around them. Those shooting on private property close to others or hunting on local lands can use these tools out of courtesy to others around them. Finally, if someone must defend themselves or others, reducing the mind-numbing sound of a discharge will help keep he or she focused and judicious. If the intention of the tax stamp was to limit buyers from obtaining this device, then the last decade has shown its failure. In 2017, the DOJ disclosed that 1.3 million suppressors were registered in the U.S. By 2024, the number of registered suppressors in the United States grew to4.86 million. The tax stamp doesn’t seem to disincentivize buyers from acquiring these suppressors but just serves as an unnecessary barrier for those who cannot afford them. The regulation of suppressors has no impact on crime statistics in modern times. In 2017 the ATF confirmed that suppressors are rarely used in crimes even as their popularity exploded. The ATF released reports that only.003 percentof suppressors are used in crimes each year This tool improves hearing protection for users and all surrounding individuals. There are no safety risks from the elimination of this tax, and it represents a huge win for Second Amendment advocates. Any lawmaker who takes the time to educate themselves on suppressors should push for this provision to pass in President Trump’s One, Big, Beautiful Bill. Financial Services **One Big, Beautiful Bill Could Include Roger Williams Bill to Help Small Business** Andrew Gins and James Erwin 06/11/2025 Commentary Spending & Regulatory Reform **KEY VOTE: “YES” on H.R. 4, the Rescissions Act of 2025** Isabelle Morales 06/11/2025 Commentary Tax Reform **One Big Beautiful Bill Delivers Tax Relief to Seniors** Rachel Loren 06/10/2025 Commentary **Fight BackAgainst BigGovernment!** Join thousands of hardworking Americans standing up against: Crushing tax hikes Government overreach Special interest corruption Email* Zip Code CAPTCHA Δ **Affiliated Sites:** Property Rights Alliance Open Competition Center Digital Liberty Shareholder Advocacy Forum Tholos Twitter Facebook LinkedIn YouTube **Join ATR** Email* Zip Code CAPTCHA Δ AboutATRGroverCoalition MeetingsInternships ATR Grover Coalition Meetings Internships ATR Grover Coalition Meetings Internships The PledgePledge Database2025 Pledge SignersAbout the PledgeTake the Pledge Pledge Database 2025 Pledge Signers About the Pledge Take the Pledge Pledge Database 2025 Pledge Signers About the Pledge Take the Pledge Policy AreasTax ReformSpending & Regulatory ReformHealthcareTech & TelecomEnergyLaborProperty RightsFinancial Services Tax Reform Spending & Regulatory Reform Healthcare Tech & Telecom Energy Labor Property Rights Financial Services Tax Reform Spending & Regulatory Reform Healthcare Tech & Telecom Energy Labor Property Rights Financial Services Our WorkCommentaryLettersThe Sustainable Budget Project Commentary Letters The Sustainable Budget Project Commentary Letters The Sustainable Budget Project Take Action Donate P:(202) 785-0266 F:(202) 785-0261 info@atr.org © Americans For Tax Reform 2025 |Privacy Policy **Fight BackAgainst BigGovernment!** Join thousands of hardworking Americans standing up against: Crushing tax hikes Government overreach Special interest corruption Email* Zip Code CAPTCHA Δ **ExtendThe TrumpTax Cuts** Avert the largest tax increase in American history!"}