{"id": 1348, "name": "Madisonville Messenger", "domain": "the-messenger.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.the-messenger.com/site/ai_policy.html", "title": "Www.the Messenger.com", "content": "Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Contest Contact Multimedia A.I. Policy Readers' Choice 2022 Coronavirus Archives e-Edition TV Listings AP Images Lifestyles Entertainment Hopkins County Crime Map Town Crier Pennyrile Plus Submit a News Tip Dawson Springs Panthers Hopkins County Central Storm Madisonville North-Hopkins Maroons Webster County Trojans Athlon Sports Hunting and Fishing Columnists Congress e-thepeople Factcheck Letters To The Editor Polls Submit a Letter to the Editor Anniversary Form Birth Form Engagement Form Wedding Form Pet Tribute Coupons Display Ads Shopping Yellow Pages Announcements Auctions Garage Sales Homes for Sale Jobs Public Notices Merchandise Real Estate Rentals Transportation Welcome to Madisonville, Kentucky Subscribe e-Edition Extra Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Facebook Twitter YouTube Serving Madisonville andHopkins County, KY.Since 1917270-824-3300 61°Madisonville, KY(42431)TodayAreas of patchy fog early. Cloudy early with peeks of sunshine expected late. High 87F. Winds light and variable..TonightPartly cloudy. Low 64F. Winds light and variable.Updated: June 11, 2025 @ 6:22 amFull Forecast Madisonville, KY(42431)TodayAreas of patchy fog early. Cloudy early with peeks of sunshine expected late. High 87F. Winds light and variable..TonightPartly cloudy. Low 64F. Winds light and variable.Updated: June 11, 2025 @ 6:22 am Areas of patchy fog early. Cloudy early with peeks of sunshine expected late. High 87F. Winds light and variable.. Partly cloudy. Low 64F. Winds light and variable. Updated: June 11, 2025 @ 6:22 am Full Forecast Madisonville, KY(42431)TodayAreas of patchy fog early. Cloudy early with peeks of sunshine expected late. High 87F. Winds light and variable..TonightPartly cloudy. Low 64F. Winds light and variable.Updated: June 11, 2025 @ 6:22 am Areas of patchy fog early. Cloudy early with peeks of sunshine expected late. High 87F. Winds light and variable.. Partly cloudy. Low 64F. Winds light and variable. Updated: June 11, 2025 @ 6:22 am Areas of patchy fog early. Cloudy early with peeks of sunshine expected late. High 87F. Winds light and variable.. Partly cloudy. Low 64F. Winds light and variable. Updated: June 11, 2025 @ 6:22 am Full Forecast HomeContestContactAbout UsAdvertising UploadCommunity LinksOur Sister NewspapersPrivacy PolicyTerms of UseMultimediaBuy PhotosNews VideosPhoto GalleriesAP VideosSubmit a PhotoA.I. Policy Contest ContactAbout UsAdvertising UploadCommunity LinksOur Sister NewspapersPrivacy PolicyTerms of Use About Us Advertising Upload Community Links Our Sister Newspapers Privacy Policy Terms of Use MultimediaBuy PhotosNews VideosPhoto GalleriesAP VideosSubmit a Photo Buy Photos News Videos Photo Galleries AP Videos Submit a Photo A.I. Policy Contest ContactAbout UsAdvertising UploadCommunity LinksOur Sister NewspapersPrivacy PolicyTerms of Use About Us Advertising Upload Community Links Our Sister Newspapers Privacy Policy Terms of Use About Us Advertising Upload Community Links Our Sister Newspapers Privacy Policy Terms of Use MultimediaBuy PhotosNews VideosPhoto GalleriesAP VideosSubmit a Photo Buy Photos News Videos Photo Galleries AP Videos Submit a Photo Buy Photos News Videos Photo Galleries AP Videos Submit a Photo A.I. Policy e-Edition KY Extra eEdition NewsReaders' Choice 2022CoronavirusArchivese-EditionTV ListingsAP ImagesLifestylesAmerican ProfileFoodHealthRelishSPRYReligion and ValuesParadeRecipesEntertainmentGames: CrosswordGames: SudokuHoroscopeKentucky LotteryMovie TimesTranslatorHopkins County Crime Map Readers' Choice 2022 Coronavirus Archives e-Edition TV Listings AP Images LifestylesAmerican ProfileFoodHealthRelishSPRYReligion and ValuesParadeRecipes American Profile Food Health Relish SPRY Religion and Values Parade Recipes EntertainmentGames: CrosswordGames: SudokuHoroscopeKentucky LotteryMovie TimesTranslator Games: Crossword Games: Sudoku Horoscope Kentucky Lottery Movie Times Translator Hopkins County Crime Map Readers' Choice 2022 Coronavirus Archives e-Edition TV Listings AP Images LifestylesAmerican ProfileFoodHealthRelishSPRYReligion and ValuesParadeRecipes American Profile Food Health Relish SPRY Religion and Values Parade Recipes American Profile Food Health Relish SPRY Religion and Values Parade Recipes EntertainmentGames: CrosswordGames: SudokuHoroscopeKentucky LotteryMovie TimesTranslator Games: Crossword Games: Sudoku Horoscope Kentucky Lottery Movie Times Translator Games: Crossword Games: Sudoku Horoscope Kentucky Lottery Movie Times Translator Hopkins County Crime Map Local NewsTown CrierPennyrile PlusSubmit a News Tip Town Crier Pennyrile Plus Submit a News Tip Town Crier Pennyrile Plus Submit a News Tip SportsDawson Springs PanthersHopkins County Central StormMadisonville North-Hopkins MaroonsWebster County TrojansAthlon SportsHunting and Fishing Dawson Springs Panthers Hopkins County Central Storm Madisonville North-Hopkins Maroons Webster County Trojans Athlon Sports Hunting and Fishing Dawson Springs Panthers Hopkins County Central Storm Madisonville North-Hopkins Maroons Webster County Trojans Athlon Sports Hunting and Fishing OpinionColumnistsCongresse-thepeopleFactcheckLetters To The EditorPollsSubmit a Letter to the Editor Columnists Congress e-thepeople Factcheck Letters To The Editor Polls Submit a Letter to the Editor Columnists Congress e-thepeople Factcheck Letters To The Editor Polls Submit a Letter to the Editor FormsAnniversary FormBirth FormEngagement FormWedding FormPet Tribute Anniversary Form Birth Form Engagement Form Wedding Form Pet Tribute Anniversary Form Birth Form Engagement Form Wedding Form Pet Tribute MarketplaceCouponsDisplay AdsShoppingYellow Pages Coupons Display Ads Shopping Yellow Pages Coupons Display Ads Shopping Yellow Pages ClassifiedsAnnouncementsAuctionsGarage SalesHomes for SaleJobsPublic NoticesMerchandiseReal EstateRentalsTransportation Announcements Auctions Garage Sales Homes for Sale Jobs Public Notices Merchandise Real Estate Rentals Transportation Announcements Auctions Garage Sales Homes for Sale Jobs Public Notices Merchandise Real Estate Rentals Transportation Subscription Services Dawson Springs Progress Home Site **Site** **A.I. Policy** ARTIFICIAL INTELLIGENCE (“AI”) USAGE Artificial intelligence is the use of computer systems and models capable of performing complex tasks, such as reasoning, decision making, and problem solving. Within newsgathering, AI can create something new, such as text, images, graphics, and interactive media. Although AI has the potential to improve newsgathering, it also has the potential to harm journalists’ credibility and our unique relationship with our audience. The Company has established the following guidelines/principles that will govern acceptable use of AI: - Transparency – maintaining public trust is imperative as such AI usage must not impact the public’s trust in our work and must be disclosed. When we publish any content that was created by AI, we disclose it to our audience. Transparency extends to internal notifications to management to ensure compliance with this policy. - Accuracy – all information generated by AI requires human verification. The use of AI must not impact the accuracy of the final work product. It is the journalist’s job to ensure the accuracy of all content produced, including AI. - Intellectual Property – the use of AI-based tools and the content produced must not violate the intellectual property rights of others. - Privacy and Security – personally identifiable information and intellectual property of the Company cannot be entered into AI programs. The Company requires journalists and content-producers to be responsible for the facts they gather, verify, and publish. The use of AI tools for article composition, scriptwriting, editing, and image generation are strictly prohibited on all platforms. The Company has identified the following acceptable uses of AI: - Research – it is generally acceptable to obtain publicly available research, mine public databases, or assemble and calculate statistics. However, journalists must independently verify any information that is used in the creation and final work product. - Headline Experimentation – generating headline options is considered a form of research. Once again, the final headline is the responsibility of the journalist and/or editor and must be reviewed for accuracy. - Social Media Content Distribution – utilizing AI to reformat and publish original content over the various social media platforms is appropriate. - Submitted News Releases – utilizing AI to reformat submitted news releases for publication across all platforms is appropriate. - Advertising Initiatives – utilizing AI to perform a wide variety of advertising related work including but not limited to generating ad copy, proposal preparation, lead development, client communications, and video compilation. All AI generated advertising material must be edited and reviewed to meet all truth in advertising standards before it is distributed. AI is a rapidly developing and ever-changing technology. The Company’s use of AI must be guided by what will be useful to our audience and customers. The Company will continue to monitor developments and update this policy as needed. 9/26/2024 Past Editions **Latest Messenger** Jun 10, 2025 Past Editions **Extra Coverage** 6 hrs ago **Most Popular** Articles Images Videos Commented Jeffrey Dale Rodgers Carolyn H. Eddings Marthann Gill Penny Lee Eden Maye Louise Parris Butler William A. Johnson, Sr. Alice Lynn Eddie Ford James Lee Hicks Carolyn Coates Sorry, there are no recent results for popular videos. Sorry, there are no recent results for popular commented articles. Mon.-Fri. 8AM-4PM (EST); Sat. 8AM-11AM (EST) Message and data rates may apply frequency may vary. **Stocks** **Today's Poll** Home News Sports Entertainment Local Events Features Opinion Records Photos Videos Weather About Us Contact Us Advertise Subscription Services Rack Locations Submission Forms Promote Your Event Add Search Toolbar Facebook Twitter Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}