{"id": 101, "name": "Aspen Institute", "domain": "aspeninstitute.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.aspeninstitute.org/events/how-good-jobs-support-small-business-success-lessons-from-the-shared-success-demonstration/how-good-jobs-support-small-business-success-lessons-from-the-shared-success-demonstration-transcript-panel-2/", "title": "How Good Jobs Support Small Business Success Lessons From The Shared Success Demonstration Transcript Panel 2", "content": "Aspen is a place for leaders to lift their sights above the possessions which possess them. To confront their own nature as human beings, to regain control over their own humanity by becoming more self-aware, more self-correcting, and hence more self-fulfilling. Welcome About Us Our Work Impact Areas People Support Us Events Programs Seminars Donate Store Contact Us WelcomeWelcome to the Aspen Institute—explore our work, programs, and ideas creating new possibilities for a better world. Who We Are What We Do How We Work About UsWe are a global convener of changemakers building a better world. Explore our history, impact, and the places that bring our mission to life. Impact History Locations International Partners Careers Press center Our WorkWe create real-world impact through a wide range of initiatives that connect people, spark ideas, and advance solutions. Programs Fellowships Events Seminars Centers Awards Publications Impact AreasOur impact areas connect the dots across programs, fellowships, and networks—linking and leveraging our strengths to take on complex, interdisciplinary challenges. Economic Opportunity Energy and Climate Leadership rising generations Societal Trust PeopleThe Aspen Institute is powered by people who lead with purpose: experts, leaders, and changemakers who bring curiosity, conviction, and drive to create a better world. President and CEO Board of Trustees Executive Leadership Experts **Who We Are** **Our Purpose** We ignite human potential to build understanding and create new possibilities for a better world. **Our Heritage** We were founded in 1949 as an experiment—as a place to reflect on values and lead with purpose in a complex, changing world. **Our People** The Aspen Institute is powered by a dedicated community of leaders working together to advance our mission with purpose and care. **How We Work** We bring people together, develop leaders, and enable solutions to today’s challenges by fostering dialogue and collaboration. Facilitate Dialogue and Curate Convenings Develop Leaders and Leadership Enable Solutions **What We Do** We tackle society’s most complex challenges through programs, leadership initiatives, and convenings that turn ideas into action. Our Impact Areas Economic Opportunity Energy and Climate Leadership Rising Generations Societal Trust **About Us** **Impact** We convene diverse voices to explore complex challenges and spark ideas and foster relationships that lead to real-world impact. **The Latest From the Aspen Institute** **History and Heritage** We were founded in 1949 as an experiment—as a place to reflect on values and lead with purpose in a complex, changing world. **Locations** Our U.S. locations foster connection, reflection, and dialogue—serving as hubs for ideas, leadership, and impact. Washington D.C. (Headquarters) Aspen, Colorado New York, New York **International Partners** Our network of 13 international partners advance dialogue, civil discourse, and practical solutions to important challenges within their societies. They are distinct nonprofit organizations affiliated with the Aspen Institute. Aspen Initiative Africa – Nairobi Aspen Institute Central Europe Aspen Institute Columbia Aspen Institute España Institut Aspen France Aspen Institute Germany Ananta Aspen Centre (India) Aspen Institute Italia Aspen Institute Japan Aspen Institute Kyiv Aspen Institute México Aspen Institute New Zealand Aspen Romania Aspen Institute UK **Careers** Aspen Institute employees bring diverse backgrounds and a unique blend of knowledge, skills, and experience. We value their passion, insight, and commitment as our most vital resource. **Career Opportunities** If you are interested in a career with the Aspen Institute, please explore our open positions. **Internships** The Aspen Institute offers internships that build skills, provide hands-on learning, and connect you with professionals in your field. **Across the Institute** **Programs** Our programs tackle complex challenges across policy, society, and culture, creating space for dialogue, innovation, and practical solutions. No programs found. Arts Program Ascend at the Aspen Institute Aspen Challenge Aspen Community Programs Aspen Digital Aspen Economic Strategy Group Aspen Forum for Community Solutions (AFCS) Aspen Global Innovators Group Aspen Global Leadership Network Aspen Institute Latinos and Society Aspen Network of Development Entrepreneurs Aspen Policy Academy Aspen Strategy Group Aspen Words Business & Society Program Center for Native American Youth College Excellence Program Community Strategies Group Congressional Program Criminal Justice Reform Initiative Economic Opportunities Program Education and Society Program Energy and Environment Program Financial Security Program Food and Society Program Health, Medicine & Society Program Philanthropy and Social Innovation Philosophy & Society Religion & Society Program Socrates Program Sports & Society Stevens Initiative Weave: The Social Fabric Project **Events** From global convenings to local forums, our events bring together diverse voices to exchange ideas and explore solutions to critical issues. Wed11Jun 20252025 Aspen Community Programs & Aspen Society Summer CalendarCheck back here for up-to-date information about summer events taking place with the Aspen Institute Community Programs and the Aspen Society. **2025 Aspen Community Programs & Aspen Society Summer Calendar** Check back here for up-to-date information about summer events taking place with the Aspen Institute Community Programs and the Aspen Society. **2025 Aspen Community Programs & Aspen Society Summer Calendar** Check back here for up-to-date information about summer events taking place with the Aspen Institute Community Programs and the Aspen Society. Wed11Jun 2025Writing an Op-EdLearn how to draft an op-ed to advance a broader goal of policy change in this 1-hour webinar. **Writing an Op-Ed** Learn how to draft an op-ed to advance a broader goal of policy change in this 1-hour webinar. **Writing an Op-Ed** Learn how to draft an op-ed to advance a broader goal of policy change in this 1-hour webinar. **Fellowships** **Seminars** **Partnerships** **MyAspen Sign Up** **People** **Support Us** The Aspen Institute was founded in 1949 as an experiment—a place where people could step away from daily demands to reflect on timeless values, engage in meaningful dialogue, and explore new ways of leading and acting in a complex world. **Donate** Make a gift to the Aspen Institute **Seminars** Our signature leadership seminars create transformative experiences that challenge participants to reflect deeply, think critically, and grow as purposeful leaders. **Centers** Aspen Institute Centers provide focused platforms for advancing specific fields of inquiry, public understanding, and leadership development across disciplines. **Publications and Reports** Our research, reports, and commentary share knowledge, surface insights, and inform policy and public discourse. **Awards** We recognize and celebrate individuals and organizations making exceptional contributions to society, leadership, and the public good. **Fellowships** We cultivate communities of high-impact leaders committed to values-driven leadership and positive change in their sectors and communities. No programs found. Africa Leadership Initiative – East Africa Africa Leadership Initiative – South Africa Africa Leadership Initiative – West Africa Ascend Fellowship Aspen President’s Fellowship Aspen Rising President’s Fellowship Aspen Strategy Group Rising Leaders Program Aspen Young Leaders Fellowship Aspen-Kern Program on Leadership and Character in Higher Education Brave Heart Fellowship Building Indigenous Communities of Hope Fellowship Central America Leadership Initiative China Fellowship Program Civil Society Fellowship Economic Mobility Fellowship Finance Leaders Fellowship Food Leaders Fellowship Future Leaders Climate Fellowship Health Innovators Fellowship Henry Crown Fellowship Impact West Africa Fellowship Job Quality Fellowship Kamalnayan Bajaj Fellowship Leading Colombia 2050 Liberty Fellowship Middle East Leadership Initiative New Voices Fellowship Pahara Fellowship Remembering Our Sisters Fellowship Science and Technology Policy Fellowship SOAR Fellowship Workforce Leadership Academies **Energy and Climate** We elevate climate solutions through practical, collective action that protects our planet and our future. **Economic Opportunity** We advance strategies, policies, and ideas that catalyze the change needed to build an inclusive economy—one that ensures financial security, opportunity, and resilience. **Leadership** We connect and develop leaders across sectors, geographies, and generations, creating networks of individuals committed to solving our greatest challenges. **Rising Generations** We ignite the potential of young people of all backgrounds by developing their leadership, amplifying their voices, and enabling productive dialogue across differences.​ **Societal Trust** We strengthen democracy and our social fabric by building trust and solving problems in partnership with individuals, institutions, and communities. **President and CEO** Dan Porterfield is President and CEO of the Aspen Institute. He has been recognized as a visionary strategist, leader, and advocate for young people and purpose-driven leadership. **Board of Trustees** The Board of Trustees includes leaders from the public and private sectors. They provide counsel to the President and oversee the property, business and affairs of the Aspen Institute. **Executive Leadership** The Executive Team advises the President and CEO on strategy and operations, ensures alignment across the Institute, and advances its mission internally and externally. Members represent key programs and functions. **Experts** Our experts focus on an array of relevant critical issues and ideas. They come from a diverse range of backgrounds and have made it their mission to further the ideals of the Aspen Institute **Planned Giving** Your values-based legacy gift to the Aspen Institute can be a powerful testament to shared beliefs and provide essential support towards our impactful work. **Corporate and Foundation Partners** The Aspen Institute is proud to partner with leading companies in our mission to solve the greatest challenges of our time through dialogue, leadership, and action. **Aspen Society** The Aspen Society is a national community of Aspen Institute supporters who are committed to making a lasting impact on society. Economic Opportunity Energy and Climate Leadership Rising Generations Societal Trust Welcome About Us Our Work Discussion and Reception — How Good Jobs Support Small Business Success: Lessons from the Shared Success Demonstration **How Good Jobs Support Small Business Success: Lessons from the Shared Success Demonstration – Transcript (Panel 2)** Note: This is a past event, additional resources may be available below. **Date** **Location** **Contact** **Hosts** Economic Opportunities Program Shared Success: <br> **** **Transcript** **Maureen Conway (00:00:04)** So joining me here… let’s see, who’s going to sit next to me? Okay, great. So sitting next to me is Viola Mai, Director of Development and Impact at ICA Fund in California. Sitting next to Viola is Betsy Biemann, CEO of Coastal Enterprises in Maine. And sitting next to Betsy is Barbara Magnoni, President of EA Consultants and Adjunct professor at the School of International and Public Affairs at Columbia University, and also a regular collaborator with the Financial Access Initiative at NYU. Thank you all so much for joining this conversation. This conversation we’re going to be talking about building, sustaining, and scaling job quality work within CDFIs. And the previous panel really set the stage beautifully for this conversation. They really gave us a flavor of how CDFIs work with small business, how it really is contextualized to the community to the specifics of a business. They really just highlighted the ways in which CDFIs have broadened the scope of what they do to support small businesses and to incorporate a focus on job quality.So in this panel we really want to explore a little bit more. What does it take for a CDFI to add this focus? The work involves building your internal capacity, thinking about the organization’s strategic focus, how does this fit? How do you build new skills and new knowledge that you might need to do the work? And it also requires building external capacity and building new relationships. So Israel actually mentioned the relationship with GOOD for Michigan, so there’s new relationships and new partners that may also need to be brought into the work. So we’re going to dig into all of these things about what it needs to be able to grow and flourish in more communities. So you’ll notice Barbara is not Tim Ogden who was on the agenda and you may have been expecting, but very unfortunately is dealing with some health issues and could not be here with us live. Although, may be here with us virtually.But I’m really thrilled that Barbara’s joining us, and Barbara and Tim have worked closely together, so they did a little mind meld yesterday and she’s totally ready, not that she needed it. So anyway, let’s jump in and I want to start the conversation of course with asking you each to introduce yourself. And Betsy, I’m just going to start with you. If you could tell us about yourself, how you got to CEI and CEI’s approach. Which actually, you’ve been doing for quite some time in terms of integrating job quality into the work. Okay. I’m going to give a little shout-out to Betsy was also a job quality fellow with us here at The Aspen Institute. So we’ve really loved partnering with Betsy for many, many years. So Betsy. **Betsy Biemann (00:03:22)** Great. Well, it’s wonderful to be here. Thank you for including me on the panel. So about myself, I’ve worked in economic community and workforce development for probably the last 30 years. I’m dating myself. Just all as strategies to advance economic opportunity across the US. In 20 of those years I’ve been working as a practitioner in Maine and rural places and previously for nine years worked at the Rockefeller Foundation as a grantmaker and an impact investor, but all the time working at the intersection of the nonprofit public and private sectors and looking at ways to leverage the various resources, partnerships, relationships, know-how across to really maximize the impact for low-income communities. Along the way, I’ve also served on the board of the Opportunity Finance Network, the Trade Association of Community Loan Funds, as well as served for 10 years on the board of a place-based foundation in Maine that does impact investing. So I’ve seen a lot of the different perspectives for ways to advance this work.I’ve been at CEI for nine years as CEO. For those of you who don’t know CEI, we’re a forty-eight-year-old CDFI, one of the early rural CDFIs. And our mission is to build a more just vibrant and climate-resilient future for people and communities in Maine and in other rural regions across the country. To give you a sense of scale, we have a small business loan portfolio with about 450 small business loans that totals around $76 million and we advise around 1600 entrepreneurs a year. We also, over time, have developed a number of financing subsidiaries that make venture capital investments, tax credit investments, and real estate investments regionally and nationally. And we can talk later about how we’ve infected them with our good jobs work as well.But I think historically we always cared about good jobs, but I think when I got to CEI, we started sort of asking, “Well, we want to be maximizing our resources.” So not just creating any job, but good quality jobs that I think if you had asked everyone in the organization what is a good job, you would’ve gotten 50 different answers. So one of the things that we did was some research and conversation with employers and workers and we benefited from sharing with PCV, a CDFI partner that had done research in this area, and developed a framework that I can talk about a little later. But really that has helped us be a tool for informing our lending but also for working with small business owners because we believe that good jobs are good for the small business, good for the workers, and ultimately good for the communities where the small businesses and workers live and exist. **Maureen Conway (00:06:32)** Great. Thank you so much, Betsy. Viola, I’m going to come to you next. You also have a great history in this work, not just at ICA, but you also worked at Self-Help. So I’m wondering if you can just tell us a little bit about your journey into this work and about ICA Funds approach to job quality, which is a little distinct because you do more of the investing than lending. So maybe you could just share a little bit about that and about your background in this work. **Viola Mai (00:07:00)** Yes. And I have the great pleasure of going after Betsy, who has an amazing career. But I feel like for me in how I approach my professional life and my personal life, it’s always about how do I democratize systems? So I’m a child of immigrants. My father was a small business owner and it was really common for me to be in elementary school and just trying to figure out tax terms that he would ask me about. And I was like, “This is crazy.” And then growing up, I did go into finance. I have an econ degree, and I began to understand all of the crazy systems that our society has created to manage finance, but it also gate-keeps a lot of folks, especially if you are not a native English speaker or you come from a rural area or you just don’t have access to those networks.And so every part of my career has really been how can I help leverage my skill to share knowledge and share resources? Because we know the two have to go hand in hand. You can teach someone how to do something, but you also need to make sure they have access to those networks, those resources, capital, things like that. So that’s what initially drew me to my work at Self-Help. So I was at Self-Help for about four years. I was there helping raise mission supportive deposits. Self-Help is a national credit union, so they do mission supportive lending, but oftentimes their client base doesn’t have enough capital to support the lending projects that they wanted to do. So I would go to different institutions, different high net worth individuals and work with them to move their money. That was a really big popular phrase, move your money.And through my work, I was so excited about the big scale projects that Self Help was doing. But me personally, I’m based in the San Francisco Bay Area. I never really saw how those projects impacted the main streets that I lived on, what’s happening with the small businesses in my community. And that was really the transition that made me really love ICA’s work. So just zooming out a little bit, ICA Fund, we are a provider in the San Francisco Bay Area. We work with local small businesses, but we really offer the gamut of services. We do a business accelerator where we work with about 40 businesses every year, really comprehensive business coaching paired with a personal advisor. We also have the ICA community. So entrepreneurship is very lonely, it can be really hard to find people who are in the same position or going through the same struggles.So we operate the ICA community to really bring space where folks feel safe to network and also learn from each other. We also have a great peer mentorship program going through the community right now. And then lastly, but also super, super importantly, we run an investment fund. So actually the fund was originally named Fund Good Jobs back in the day when it first started. So the investment fund through which we do primarily equity investments, but we also do convertible debt and some new products that we’re thinking of, more working capital stuff. All of it’s just centered on how can we support small businesses in accelerating their growth, but really supporting their local community. We want everything at ICA to be about creating vibrant communities, creating community wealth because at the end of the day, that’s where you live and we want to make sure that we can support the continuation of that, make sure the people like where they live and are really building for the future. **Maureen Conway (00:10:30)** Yeah. Great. Wonderful. Thank you. And Barbara, I want to come to you now. You also have an amazing career and have done a lot of work with small businesses in a variety of contexts. And coming to work with us on Shared Success, I think the job quality aspect was a little bit new for you. So tell us a little bit about the work that you do and also what was interesting to you about coming to work on Shared Success? **Barbara Magnoni (00:11:01)** Yes. Okay. Yeah. So my name is Barbara Mangoni and as Maureen said, I’ve been working in the financial inclusion space for years, but never really focused on job quality the way this project is. The closest I’ve gotten was when I started a company in Mexico in 2019. We were offering FinTech services in low-income communities and we’d hired women over 40 who tended to be excluded from the working population and ended up in a lot of informal jobs to offer these services in low-income communities. And everybody advised us to pay them on commission and we just didn’t feel like that was right. They needed to feed their families and pay their rent, and take care of their kids, and commission just wasn’t going to cut it.So we flipped the risk and gave them basic salaries and focused a lot on HR to make sure that they were motivated and doing well. Our retention rates were through the roof. We had 50 employees, we only lost one, and that was for a health reason. Which is unheard of in the Mexican financial sector, probably in the US financial sector as well, which I’m not as familiar with. And it just got me thinking about the possibilities of a business model that looks different that does center around the HR piece and makes sure that people are happy and feel good in their jobs.So anyway, when Tim brought this project along that he was talking to Aspen EOP with, to me it was really exciting. Because I thought, “Wow, we can learn a lot more about what these opportunities are and what these business models can look like.” And I’ll just say working with FAI is a really great way to do that. For those of you not familiar with the Financial Access Initiative at NYU Wagner, they do research a little bit differently. They really poke into the deep understanding of the reasons people make the choices they make, particularly in the financial space. And that was a really great approach for understanding this project a little bit better. So that’s what brought me here. **Maureen Conway (00:13:27)** Great, thank you so much. So I’m going to transition a little bit because I know that you’ve touched on a little why you do the work that you do, and the urgency of this work looks a little bit differently in different places in different communities. So Betsy, I’m wondering if you can start just talking about why this focus on job quality is important to Maine and what that means for Maine, and what kinds of outcomes you’re seeing in the work that you do. **Betsy Biemann (00:13:56)** So in case you’re not that familiar with Maine, we’re half of the landmass of New England, but we only have about 1.3 million people who live there and lots, and lots, and lots of trees and lobsters. You’ve heard about the lobsters probably more than the trees. But we’re really still transitioning from a 19th century economy to a 21st century economy. And it used to be that you could graduate from high school and walk across the street and get a job at the paper mill or be a stern man on a lobster boat and make a decent living. And starting in the 1970s that started to change. And today we are a small business state. Almost well over 90% of the businesses in Maine are small businesses and well over half of all Mainers work in small businesses, but small businesses typically don’t have that HR department.You’re a baker who’s talented at baking and you’ve started a bakery or you are that lobsterman and you’re hiring a stern man and you don’t necessarily know about the New Merit program, which is a retirement program that Maine has started so that small businesses who don’t have a retirement savings program can make sure that their employees have a way to save money for their retirement. But we have this wonderful team at CEI who can help. So the way we really started, I noted that we had always cared about good jobs, but we didn’t really have a definition. And we did some of this research and participatory research, really talking to small businesses and learning from our peers and developed a framework that is seven different aspects of a good job. And we’ve really used that to then both inform our small business loan decisions and even to help set the interest rate that we charge depending on whether a small business provides good jobs or is interested and committed to improving the quality of their jobs. But also to really help guide our conversations with small business owners.A lot of the businesses we work with and finance are in the natural resource-based sectors, so they are seasonal often. We work with a malt house that malts barley. Well, barley doesn’t come to work at 9:00 in the morning and go home at 5:00. Though when you’re malting barley, it’s a 24-hour process. So working with that small business owner who has literally an award-winning barley malting operation and provides malted barley to over 120 beer and other craft breweries, he needed help to figure out how do I make these jobs that people are going to want to stay in when part of the year you might have to work well after 5:00 in the afternoon, or come in well before 9:00 in the morning? And how does one structure and remunerate those positions in a way that folks can see a future and can also see having a family and doing what you have to do as an individual while having that job.Also, we’ve done work with Mussel and Kelp Aquaculture company. Again, you get on the boat, you go out, rain or shine. It can be very unforgiving weather conditions and if your kid has a doctor’s appointment at 11:00, you can’t just motor back into the harbor. So these are complicated jobs and there is some flexibility that the small business owner has and we help them figure out how can their business model and the realities of their small business best create jobs that pay a living wage, provide paid time off, provide an opportunity for wealth building or retirement savings? Have some kind of a health benefit or health stipend, give people at least two weeks notice. Because schedule notice is very inexpensive to provide, but can be very stressful and very expensive for a worker if they don’t have it.Performance reviews process that lead to increases in one’s compensation as well as opportunities for training or tuition. So again, you can improve your wages either at that business or another one. So those are all the kinds of things that we do. We advise over around 125 businesses per year in our small business lending, Maine based work. But we also over time have started working with our venture capital subsidiary that is working with more growth oriented businesses across New England and the Northeast. As well as our new markets subsidiary, which is investing in much larger rural manufacturing companies across the nation. Where the smallest one I think has about 65 jobs and often has north of 200 or even 300. So we’ve managed to integrate a lot of this thinking and that framework into how we work both in Maine as well as nationally and are seeing really important results. **Maureen Conway (00:19:50)** Great. Thank you so much Viola. I’m coming to you next because I bet things are a little different in the Bay Area. **Viola Mai (00:19:58)** Very. **Maureen Conway (00:19:59)** And maybe some of the businesses are a little different than that. So I’m wondering if you could just share some examples from the work that you do and why this is important in the communities. You mentioned that a little bit. Say a little more about why it’s important in the communities where you live. **Viola Mai (00:20:17)** Yeah. So I feel like everyone probably thinks of San Francisco, Silicon Valley, Tech AI, money. Yes. And at the same time, our region has one of the highest income gaps of any area in the nation. And because of the highest highs, we also have the lowest lows. So that’s why it’s so important to have quality jobs to help people build wealth. In the area, also homeowners… We typically think in terms of wealth building homeownership is the easiest thing. Get real estate, let it gain value over time. But also in the San Francisco Bay Area, it’s one of the most expensive real estate markets in the world. So in the interim, what can you do? So a lot of folks have been turning to small business as a way to take back ownership of their life and then just really create a good quality business, source of jobs for people in their community. And I actually do want to raise up two products that ICA Fund has been using, and I want to say that they’re not new. We’ve been working on these things for years and years and years.So the first one is our good employer Matrix. So through our accelerator program we do really focus on the people strategy of how as a solopreneur, someone with just one employee, how do you actually build the strategy to higher up? How do you promote people? And then also, as Israel was saying earlier in the first panel, having job descriptions, just having uniform policies. So our people strategy module is part of that. And then as part of people strategy, we also talk about the GEM, which it’s just a scale of what no benefit looks like. And we also break it out. I believe now it’s three categories. It’s a very quickly evolving changing thing because so many things change about our world, so we have to move with the economy and society. But we have a scale of what does it look like for no benefit, what’s one step up, what’s another step up? All the way to what is the perfect way you can operate in this specific benefit capacity?And we break it out over different categories so folks can look at that and see what’s either a low cost or no cost option until they get enough revenue to maybe invest in that retirement plan or that health insurance plan. So we have this as a tool that’s accessible. We also have another product, it’s called the ISA impact note. And this is actually an investment note where we have co-created with the investment recipient. What are the different social impact goals that you want to achieve with your business? It might be creating X number of jobs. It might be, “Oh, I want to provide a profit sharing plan.” Or, “I want to create an advisory board for my business so I can make sure I’m meeting community needs.” So we insert five of those goals into the ISA impact note, and when an entrepreneur meets that, they actually get a portion of our equity ownership returned back to them.So that actually allows them to both meet their social impact goal and also make a financially good decision. So those are some of the tools, but definitely something about ICA is we are in the heart of Silicon Valley and we see so much innovation around us and actually that’s what we pride ourselves on, we innovate with the quickly changing world. Because our area has one of the highest income disparities in the nation, we really think it’s imperative for us to center small businesses and quality jobs in order to reduce that wealth gap and really make sure that we love and enjoy the community that we’re in. **Maureen Conway (00:24:03)** Great. Thank you so much. So Barbara, I’m coming to you now because we’ve heard from Maine, we’ve heard from the Bay Area, and you’ve done a lot of research on the financial lives of low-income workers across the country and even globally. So I want you to comment on how they think about job quality and what that means to them. But also you’ve been doing work lately for Shared Success, talking to both the business owners and their workers. And I’m wondering if you can share just some of the highlights from what you’ve been hearing. **Barbara Magnoni (00:24:35)** Sure. So I’ll start with some of the research that we’re working on right now with FAI. We’re just starting a project called Small Firm Diaries here in the US that’s based on prior work, on household financial diaries, and also global small firm diaries. That work has really informed a lot of the thinking around just the challenges small business have that we’re incorporating into our analysis, including this project. One of the big highlights of both the individual household studies and the global firm level studies is that low-income households and small businesses are dealing with a lot of unpredictability and a lot of financial volatility. And maybe that sounds intuitive, but it has a lot of repercussions in terms of the choices that they have to make and the trade-offs that they have to face.In the workspace or in the job quality space, one of those is the trust gap. And I hate to call you out Tristan, because you said this, I don’t know, in a very open way and I don’t want to call out any illegal activity any more than it’s already been mentioned, but I think it’s a really- **Speaker 6 (00:25:59)** Statute of limitations. **Barbara Magnoni (00:26:03)** But it is a really great example that you mentioned earlier of the trust gap. Where maybe an employer doesn’t have enough security in their cash flow to pay workers more or doesn’t prioritize it. So workers might take a little money off the top if that’s accessible to them, because they don’t feel like they’re being treated well. And then the employer might look at workers in a different way because they don’t really trust them anymore, and so they’re micromanaging or not managing as well.So this volatility has incredible repercussions for the quality jobs and what that looks like in the end. As Maureen said, we have had the enormous pleasure of speaking with 77 small businesses in this project individually and 50 workers from those businesses. And it’s something that we have tried to tease out. And what we found really interesting is that small business owners and their workers both agree that creating a more supportive work environment is important to them. And in many cases, most important to them. And that speaks a lot to closing this trust gap. It speaks a lot to how we bridge this gap between worker and employer. So I’m just going to mention a couple of things that we’ve unpacked from that concept.One is communication. Again, I think Tristan spoke to that really well. Having a huddle or having this moment of just talking to your workers and understanding them can be really powerful. Another that maybe hasn’t come up as much but we’ve heard, is autonomy. Giving workers the space to make decisions, to control their environment. To say, “Hey, this doesn’t work. Can I fix it?” And taking the lead on doing that is very powerful as well. Growth opportunities. We met a business that is an ICA investor that has actually leveraged a lot of the learning and the contacts from ICA to put in place some management skills. They have a management team that’s been promoted from below, so with no management experience. And when they do their huddle or their weekly meeting, they actually read a management book together and comment on it and learn from it, so it’s kind of like getting a little mini weekly MBA every single week to help build up those skills. Which is pretty cool and amazing.And finally, another thing that we’re seeing, and again, we saw this quite a bit in Maine. But in a lot of different places is investment in workers, not just productivity, but safety and reducing some of the tedium around work. So buying machines or investing in technology that takes some of the really yucky work away from workers so they can focus on the more interesting things, or less tedious things, or less even physically difficult things. All of those aspects are things that we’re bundling into the concept of a supportive work environment, which can really help build this trust gap. **Maureen Conway (00:29:25)** Great. Thank you so much. So now I want to shift gears a little. So I mentioned at the opening that doing this work requires capacity building, and thinking both internally and externally for the organization. So Viola, I’m going to start with you and focus first on the internal piece. You’re on the leadership team at ICA and you’ve just spent a lot of time thinking about what are the systems, what are the capacities and all of that, that you need on your team and inside the organization. So I’m wondering if you could just comment on what it takes to build that internal capacity to do job quality work? **Viola Mai (00:30:06)** This is going to be a boring answer, but it has to come from the top. If this is something that is valued by the organization, it really has to be institutionalized. And ICA Fund is super lucky because our board of directors is very, very aligned. Our whole management team, including our CEO Allison, who’s sitting in front of me, super, super aligned with job quality. So then we’re able to make sure that trickles through and is embedded in our goals, and is in our products and not just an afterthought. So I think one of the biggest things is make sure you have buy-in from the top of the organization. And if you’re not there, so if you are maybe a project manager or an associate and you’re just trying to get folks to think about job quality, I actually think one of the most important things is to present the story in terms of the client impact and also the economic impact. And they’re both really important.And I think having both pieces and presenting that to whoever might be a larger decision maker and having it trickle up is really, really key for making this work supported throughout the organization. Also, someone else in our Shared Success demonstration mentioned this, but it might be easiest to get this kind of work introduced through a pilot, but that also silos it from all of the other parts of the organization that would also benefit from knowing about the work and implementing job quality work. So something I’ve been thinking about separately, and ICA does have this, but include it in your strategic vision. Everyone has a five-year strategic plan, or three, or what have you. But if you can get job quality in there, then it gets into people’s goals and then the team then will operate with that in mind. And then hopefully it doesn’t leave the strategic vision once you do your visioning process again, maybe it then becomes a core value in organization. But that’s my fast and dirty version of how do you get this work happening? **Maureen Conway (00:32:07)** Yeah. No, I really appreciate that. I also love how you think about adding that to people’s goals. And Betsy, just building on that, in your role as CEO… I remember visiting Coastal Enterprises in the 1990s and they had a concern about good jobs because Maine needed good jobs and everything, but it was not institutionalized. So I’m wondering if you can just talk about what it took in terms of institutionalizing that focus at CEI. **Betsy Biemann (00:32:42)** Sure. So I really resonated with a lot of the things that you said, but I certainly know at CEI if it had just been me coming in and saying, “I’m the new CEO and we’re going to now start working on good jobs.” And it stopped there, it would’ve stopped there. Because we’re a very democratic organization. I don’t know. There’s a lot of, yes, inclusive, collaborative and really want to get. So I’d say the first thing that we did after we decided this was a key strategic effort of the organization was to start building a team and really wanting to hire a terrific, dedicated team with expertise in the private sector, in senior manager. And I will put her on the spot, but Cynthia Murphy is here, who was that person and she’s really driven this work.But brought not only deep commitment to growing good jobs in Maine, but just experience from an international career working in management in all different sizes of organizations. And thinking very carefully and strategically about how you build people and build teams. And since then we’ve added Taben and Cameron who some of you have met, and they’re really the locus of what I’d consider the practice development, leadership, and learning around good jobs in our organization. Then we created this clear and pragmatic tool that I mentioned, the framework with the seven elements of it, but have really over the last probably seven or eight years integrated that throughout our lending process.If you’re growing jobs, if you have jobs, we look at the job quality as part of our due diligence on a loan. Our scorecard is part of our investment memo. Everyone is trained in and understands how that is an integral part of our decision making. And similarly on the business advising side, we have a lot of business advisors who didn’t have and don’t have deep specific knowledge, but this great team has developed resources that they can use very easily. Thirdly, we walk the talk. One of the first things we did when we decided to do this is look at our own jobs. Do they fit all of these? We can’t go out and ask small businesses to do something we are not doing ourselves, so that was an important part.Just communicating regularly, telling stories at all staff meetings and not just communicating within the program team or the lending team, but our accounting folks need to know about this and our IT team needs to know about this. Everyone needs to understand and really appreciate the importance of it. And I’d say finally, make it easy to incorporate it. Again, our good jobs team has been terrific. They have these grab and go resources. So if a business advisor who’s not on the good jobs team, but say maybe one of our sector in child care or in aquaculture talks with a small business owner and they say, “Oh, I’d love to figure out how we can support retirement savings for our folks, but we don’t have any money to do it.” There’s the follow-up email draft with the links embedded in it, and off it goes. So making it very simple and seamless with all of our work. So those are some of the things that have worked for us and we’re continuing to grow and evolve the work. **Maureen Conway (00:36:36)** Yeah. Great. Thank you. Thank you both so much. Because I will just say I talked to a number of organizations that are like, “Oh, that job quality thing, that’s so interesting. I’m totally there, but what do I do?” So I think you gave them a lot of what do I do’s? So that was really terrific. And now we’re going to go to the outside part of it, because it’s not just within your organization, you also need partners. And Viola, I’m going to come back to you because I know the director of development is part of your job. So I’m thinking about funders is of course important, but there’s other partners too, so I’m wondering if you could just talk about the external partners that are important in this work. **Viola Mai (00:37:13)** Yeah. I will just say ICA Fund is really lucky to have really trust-based funders who believe and align with the mission of our work and trust that we will design the programming that will help us achieve our mission. I know that not every organization is that lucky. A lot of organizations, especially right now, we’re all dealing with a difficult fundraising environment. So I would say now more than ever, one approach to make sure that this job quality work really gets not just started but really sustained, is to really normalize those talking points. Earlier I said the economic story and the impact story, and I think that’s double underlined, bold font for funders. If you are interested in trying to get this work started and figuring out how to make this not just a one-time pilot, but something to be sustained, it’s really about making sure that you really are capturing the impact of what job quality means.Because we all just heard from these amazing entrepreneurs about what it really looks like for their employees, their community? And also I think for folks like me who at ICA, I’m writing grants, talking to funders, tracking data, uploading stuff on Salesforce, it’s like my job then to really encapsulate what does this actually mean though? What does it do when we do this at scale? What does it look like if we can help 100 Cafe Rica’s? So I think that’s super, super important if you are looking to get funding for this kind of work and continue it.And then I would say too, it’s also helpful to start with a pilot. Like, “Here’s a cool idea we have and here’s what we want to achieve. And I’m really hoping XYZ funder, if we’re successful in this, we can make this into a fully fledged program.” So that might be a way to step into a little bit of funding that can help evolve into something bigger. And I will say, I’ve been in fundraising for almost eight years, and that is typically how you get to those bigger pools of money. You start with a small pilot, a project, gain trust from the funder, and then eventually that becomes a really long-lasting partnership. Not just from a dollar basis, but who they connect you with and what opportunities to speak up about the work that they give you. All of it’s really a true partnership. So I would say get really clear about your storytelling and look for folks who are partners for the long run, if you have that ability. **Maureen Conway (00:39:55)** Masterclass from the development director. And Betsy, I’m going to come to you. You have a lot of experience engaging in funders in this, but you also were a funder for a long time, so maybe you can reflect on that experience and just share what has drawn funders to this kind of work. **Betsy Biemann (00:40:17)** So it’s interesting, despite the fact that we have this great track record, we have not been able to raise project funding from a lot of foundations. I think some of the issues were not in the Bay Area, so when we go to national funders, they might care about good jobs, but they don’t care about Maine, they care about their geographic footprint, which is somewhere else. Or they care about Maine if they’re maybe Maine funders, but they don’t necessarily care about good jobs, they care about something else. So we’ve had a hard time finding that Venn diagram of folks who care about Maine and good jobs. So I think that we’ve then switched strategies and instead as we’ve integrated our good jobs through all of our work, we have taken slices of our good jobs advising and been able to build them into say, a project grant over here or there.And some of those are federal and some of those are private. The other thing that has been helpful, and kudos to the Casey Foundation, because of our good jobs work, they’ve made two PRIs to CEI. So a 4 million ten-year investment in our small business lending and a 1 million investment in one of our venture capital funds. It’s focusing on good jobs. So that capital enables us to grow our lending, which grows some of our revenues. So in this way, instead of what I consider almost a vertical, here’s a grant to do this one thing, it’s across our organization and we’re able to scrape together the resources that we need to continue this good work.I have to say I’m still a little puzzled. I think part of the problem is that I’ve drunk the Kool-Aid and I think this is really valuable work. And I know if I were back at the Rockefeller Foundation, I would be funding this work. But foundations have boards, they have strategies, they have their theory of change. And if you don’t fit in that theory of change, it’s really hard. You put yourself in a pretzel to try to secure that funding. But part of our excitement about being part of this initiative, the Shared Success initiative, has been how do we collectively put the value and the potential of this work forward in a compelling way, in a national way such that we can bring funders along and excite them about investing in this kind of work nationally. **Maureen Conway (00:43:08)** Great. Yeah. Go ahead. **Viola Mai (00:43:10)** Can I just respond to something that Betsy said, which was actually super, super important. This is also why it’s so critical to embed job quality work into the organization. If you are able to make it a core kernel or a mission part of the organization, you don’t then have to go around chasing different pools of project funding because ultimately then what you’re doing is finding funding partners for the nonprofit and not a specific other project, which maybe is just maybe a bit easier. You don’t have to look for that Venn diagram. So just tagging on explaining why it’s so important to get that top down, all around, everyone buy-in for job quality. **Maureen Conway (00:43:54)** Great. Thank you. And Barbara, this is a perfect segue to you because the research that you do has been critical to providing insights and often to funders about what the value of work is and how they should think about their investments. So what do you think funders will want to know about this work? And also, can you share a little bit of what we are learning? **Barbara Magnoni (00:44:15)** Yeah. So I spoke earlier about some of the qualitative visits that we’ve been doing, but we’ve also been surveying small businesses in the program to understand what they’ve been learning, doing, and why they’re doing it through a more quantitative survey. So we have preliminary data, I don’t want to get too stuck on it, from our inline survey. Which is about 158 businesses across the 11 CDFIs. And 92% have made a job quality improvement over the last two years, which is a pretty crazy number. Yeah. 84% also have said that they believe this has impacted some business outcome. So whether it’s retention, productivity, et cetera, but some kind of business outcome. Which is also really exciting as we think about that kind of linkage to business outcomes that we’ve been talking about as a convincing argument to support the work. And then back to my comment earlier, 73% are seeing an outcome around the supportive work environment that we were talking about, which is important to workers obviously and businesses as well.So I’ve got a ton more numbers, but I’m only going to share these three for now. But they’re pretty encouraging. It’s pretty exciting to see how this program has moved forward. And the really important piece of this is the CDFI linkage. Without the CDFIs, this would not have been possible. And yet CDFIs are under so much pressure to do everything and to do it well, and to do it profitably and to reach scale. And to serve customers with appropriate… Should I go on? Serve customers with products that are appropriate at reasonable interest rates for credit products so that you’re not creating more problems than solutions. And there’s just a lot of pressure. Tim and Joyce actually wrote a piece on this, looking at US microfinance or US financial institutions and what they could teach global microfinance institutions. Which is a little bit of a switch from the normal approach.But because the US financial institutions do have this really unique mission to serve the underserved in a way that is very different in global microfinance. In global microfinance, everybody is underserved. So you have some really good credit customers there in the underserved that maybe they don’t have a formal credit history, but they have good incomes, they have a big family with lots of jobs. They’ve been paying informal loans regularly and on time forever. They’re not as excluded from financial sector credit worthiness as the folks that are served by this community of CDFIs. So it is a really difficult thing.Tim actually asked me to quote a paper, which I probably won’t quote well, but called Financial Inclusion Trilemma. But the point of this paper here in the US is that financial institutions here in the inclusion space are asked to provide good non-predatory products at scale profitably. And the paper posits that those three things together can’t happen. And what that suggests is that there’s a real case for donors to step in if they want to serve these communities in the way that they need to be served. And this is just another layer onto it, the good jobs piece. Whether it’s special programming or embedded, which I think makes a lot of sense, is really important. **Maureen Conway (00:48:38)** Great. Thank you. So I’m going to ask them one more round of questions, but I want everybody to know I’m going to be coming to you all soon, so be ready. So last question for you, Betsy. As a CDFI leader, you’ve been involved in and worked with industry associations. And I’m just curious, what are your thoughts on industry associations, other intermediaries, or other players and the role that they can play in terms of supporting and growing this kind of work? **Betsy Biemann (00:49:11)** Well, as Barbara just very eloquently noted, practitioners are busy doing a lot of stuff in the trenches that’s very hard. And one of the great roles that I think networks or trade associations can play is as a convener, a best practice capturer and sharer because we don’t have the time or the money to do it. So when I was a funder, I sometimes would support a multi-site, multi-ear initiative. Where there was a central organization that might manage the money, might organize the cohort meetings, something like The Aspen Institute does so well. And it was a great way, a complimentary way to let the practitioners do what they were good at and to channel a little money to them to help them advance their practice and also show up for the meetings.But then to lean on the trade association or convener to do what they’re good at. Which is to bring folks together, manage the money, make sub-awards, maybe bring in communications people. So as those best practices are identified, they can help to figure out how to leverage their national networks and their strategic communications knowledge and capacity to get the word out either through a trade association to other practitioners or to a broader set of policy or practice folks. So I certainly think that those types of organizations can be really valuable. There’s also, we haven’t talked about policy much today. But we have found that in Maine not only do we advocate for policies that are benefiting small businesses and workers, but also when they make a new policy, even if it might be for larger companies, like our recent earned paid leave policy is only for employers who are 10 employees over.But it starts a conversation where then a lot of that is in the news. And then we can work with the smaller businesses who might say, “Oh, my competitor down the block has got 12 employees and he’s starting to do this. So I better start it too, otherwise my folks are going to want to work for him.” So there are direct as well as these ripple effect ways that the public policy and state and municipal government play an important role in this ecosystem. So those are just a couple of examples of ways that that ecosystem can work together and can be moving this work forward. **Maureen Conway (00:52:12)** Great. Thank you so much. I’m glad you brought up the policy angle. Viola, to you, are there other partners that you all work with other than funders that are important to supporting this work? **Viola Mai (00:52:25)** Yeah. I would really echo Betsy’s point about policy and also I would say local chambers of commerce, local, municipal, and also state level government. Those are really good resources to tap. A lot of them have repositories or lists of all the different organizations in your area that do X, Y, Z. It’s really important, I think, to be aligned with those organizations so that the organizations, the practitioners don’t have to do that extra work of trying to yell out into the wilderness like, “This is the stuff we do.” I also want to really make a plug for organizations like Opportunity Finance Network that help convene different CDFIs. So oftentimes for us CDFIs, we only can fill one part of the capital stack for a business. Do we have a very clear idea of what we invest in? What kind of loan do we do? What kind of investment do we do? What kind of equity investment do we do?And ICA actually has an example of an entrepreneur who has been really resourceful. He originally created his restaurant, it’s a Japanese fast casual chain. But he created it and wanted to figure out how to make this a business. So he first went to an incubator, it is called La Cocina. La Cocina’s had their 20th anniversary. Really, really cool organization if you’re interested. But he went to La Cocina and he’s like, “I need capital. How do I do this?” So then La Cocina referred the entrepreneur to different CDFIs in an area such as ICA. Entrepreneurs went through our accelerator program. Also, then got financing from another CDFI microloan, and then came back to us and got an equity investment.So all of us working together was what made this business now into a franchise model. He just opened his first franchise location, he’s now six locations, 41 employees strong. But it was because he was able to tap into this network of providers that were convened by organizations like OFN that he was able to meet all of those different needs. And then now he’s super successful, although still trying to grow, still trying to hire more folks, create more quality jobs. But I just want to make a plug for those network conveners because they help make the whole system work. **Maureen Conway (00:54:48)** Great. I love that. And I love the really different context and models you brought up. And Barbara, I’m just wondering if you have any other comments on this idea having seen a range of things in your work? **Barbara Magnoni (00:55:01)** Yeah. I’ll mention a couple of things just on Viola’s point. We definitely saw that in our interviews and even in our survey. I don’t have the numbers in front of me, but people aren’t learning about job quality from only one source, they’re learning about it from different sources. They’re interacting with different organizations in their communities. So the more those organizations are aligned and connected, the more powerful the interventions can be. And that’s maybe an opportunity for the future to really push that. The second comment, which is mushy-gushy that I was going to make was just this group of really diverse organizations that we were so kindly welcomed into as external actors, has been just such a pleasure to get to know.And I think as a community of practice, there’s a lot of power in having this incredibly diverse community, serving really different types of clients and really different client communities. You got a little bit of a taste of that today for those of you who don’t know them. But it’s not easy to align conversations from North Carolina to South Dakota, to the Bay Area, to Maine. And there’s a lot of sharing that happens and beyond just amplifying the lessons, amplifying the voices, I think the individuals in this group, this broader group of CDFI people… I don’t know what to call you. It’s hard work and you don’t always want to prioritize it either. And having a group around you that checks in that is also doing the hard work is a really effective and powerful thing, at least from what I’ve seen. So that’s been really exciting and I think obviously one of the strengths that Aspen brings to this. **Maureen Conway (00:57:00)** Thank you. Great. Well, thank you all. And we are open for questions, if anyone has questions. Yes. And we do have mics coming. Yeah. And please introduce yourself when you ask a question. **Molly Scott (00:57:14)** Sure. My name is Molly Scott. I’m from the Urban Institute. I’m a big fan of your work, I’ve been following it for a while. My question is about the business case for the CDFIs themselves. What have you learned about how including job quality impacts or not the loan performance? Does it help you when you’re underwriting in terms of making better loans and being more successful on that level as well? Just curious. **Betsy Biemann (00:57:51)** So this is a very initial perspective from our venture fund where we have a little bit more in terms of years of data, but we have seen that… And it’s correlation, not necessarily causation. But the companies in the venture fund portfolio that have been working on good jobs, so our more recent portfolios, that either have higher quality jobs or have been making improvements in their jobs are growing faster than the other businesses in the portfolio. So that’s an interesting data point that we’re obviously following. And as time goes on, we will have more data that we can make pronouncements like that about. But that was very promising.And we also get tons of anecdotal information about this company, which used to have a lot of turnover issues and paid a lot of… This is in our small business loan portfolio, but a company that had a lot of turnover, paying a lot of overhead, and as we helped them, should have changed that picture. One of the things was they hadn’t been able to take on contracts because they didn’t have the capacity, and so they were then able… So we see those kinds of more micro examples all the time. And as the work goes on, we’re able to start collecting more of that data, seeing more of those examples and over time, see the performance in… Happily, we have very low non-performing rates in our small business loan portfolio anyway, but we’re able to see company by company how the job quality work is really contributing to the success of the businesses. **Viola Mai (00:59:45)** I’ll also take a shot at answering that and ICA, we don’t operate a traditional loan fund, we have an equity fund. But for us, it’s actually a really key source of due diligence when we see how entrepreneurs implement job quality work and how they’re really addressing their business to help it have a real tangible business plan and scale. That to us tells us, “Okay, actually this probably is going to be a good investment.” So it’s a key part of how we assess the viability of our investments. But then also it’s about business resiliency. So when there’s investment in good jobs, that also means that the entrepreneur is not the one weakness point. When there’s investment in the management team at the business, there are people who can take over if God forbid something happens. So I think there’s absolutely an economic case for it. Happy to talk more about how the performance of our fund has been going and how we’re seeing it play out in terms of the due diligence in our scorecard. **Speaker (01:00:47)** I have a few questions from our live stream, if we have time for two questions. Our first question is, “As described, small businesses often are a supportive anchor for communities. Can each of you discuss the Venn diagram to access the money with small businesses as an actor? As described, small business often is a supportive anchor for communities, can you each discuss the Venn diagram to access the money with small business as an actor?” **Maureen Conway (01:01:25)** I don’t know, [inaudible 01:01:26]. **Viola Mai (01:01:32)** Can we answer that offline, maybe get some clarification? **Speaker 6 (01:01:34)** Yes. We will ask for clarification and get back to that person. The following question is, “Small companies and nonprofits, in my experience, tend to be very averse to providing or thinking about disability accommodations and rely on carve outs around the number of employees to get around them. How do you work with small businesses to get them to understand that accommodations are usually not expensive or onerous? Disabled employees provide a lot of value and that they can see a lot of benefits from doing more than the legal bare minimum.” **Barbara Magnoni (01:02:06)** Can I just give an example, maybe not take a stab at answering the broader question? But I touched on the idea of making investments to make the work at small businesses a little bit less tedious. Some businesses specifically referred to disabilities as part of that. The work was difficult for people with disabilities, or even people who just couldn’t stand on their feet a whole day without getting pain, or people who couldn’t lift certain equipment. So one of the really, I think, exciting things about some of the larger loan funds and equity funds is that they’re giving enough capital to small businesses to invest in machinery that makes the small businesses a lot more friendly to people with some sort of physical disadvantage. Or even just more broadly, women, older people, everybody. **Betsy Biemann (01:03:13)** I can think of two examples. I’m not sure how much they’ve been in our good jobs work versus just the folks we work with, but who are great examples. There’s a company in the Skowhegan area, the Good Crest. And the founder of that company is an occupational therapist, and her twin sister actually runs a company called Main Grains that makes flour using an old milling technology and for the artisanal bakery market. But Heather started the Good Crest and purposefully crafted the workforce opportunities around folks with different physical and mental abilities so that they can be part of the company.That was her purpose really, was to create a workforce that would be a welcoming environment and a very positive work environment for folks with varying abilities in that company. Another one is a mushroom production company where they were having issues around how they had organized their factory floor and it wasn’t working that well. And our good jobs team helped them recognize that there were some functions that folks with developmental disabilities would be great at. So they partnered with a local nonprofit that works with and supports those folks and can coach them. And they restructured their operations such that folks who were doing the packaging could focus on the packaging, and then other folks could do other functions.And had a partnership where folks came in and they had a coach for a while to help them get the training and support they needed. And it was an extraordinarily positive step for that company across the board, both from a financial and a workplace productivity and happiness perspective. So those are sort of just two examples of businesses that have absolutely incorporated people with differing abilities to have a successful working experience in a sustained way. **Maureen Conway (01:05:42)** Great. Great. Thank you. So I think unfortunately that brings us to close, but thank you for your comments. I think that was a great question because I feel like it demonstrates just the problem solving, the uniqueness of this work. But also, again, what is possible? That these things are possible and we just have to think about how we do it. So thank you all for joining us. We will be sharing more from all the things that we’ve been learning from Shared Success. I didn’t do this in the beginning, which was a real failing on my part, but I want to acknowledge that many of the other Shared Success folks are in the room from the different CDFIs around the country. So I hope those of you who are in the room will join us for the reception downstairs and get to know them and get to know their work a little. They all do something a little different. They’re all really amazing and fascinating. So I hope that you will join us.For those of you who are online, thank you so much for joining the conversation. Please do again, respond to our feedback survey. And then finally, I just do want to thank my many colleagues for their help and support in putting on this event. These events take a whole team. So Amanda Fins, Maya Smith, Bryn Morgan are around somewhere. Joyce Klein maybe stepped out. Oh, there you are. She’s right in front of me. I can’t see anymore. Lauren Starks. The whole team, just really amazing. So I thank them and I hope you’ll join me in thanking them and thanking our amazing panel. **Learn More** Good jobs and strong businesses are vital to the well-being of communities across the country. Yet millions of workers struggle withpoor-quality jobs, and small business owners often struggle to find and retain the employees they need.Shared Success, a project of the Aspen InstituteEconomic Opportunities Program(EOP), shows how building better jobs can uplift both sides at the same time. Supported by a $12 million investment from the Gates Foundation, EOP partnered with 11 community lenders to integrate job quality programming into their small business support services, supporting the needs of employees while helping small businesses succeed. The Aspen InstituteEconomic Opportunities Programhosts a variety of discussions to advance strategies, policies, and ideas to help low- and moderate-income people thrive in a changing economy. To learn about upcoming events and webinars,join our mailing listandfollow us on social media. **** **Transcript** **Maureen Conway (00:00:04)** So joining me here… let’s see, who’s going to sit next to me? Okay, great. So sitting next to me is Viola Mai, Director of Development and Impact at ICA Fund in California. Sitting next to Viola is Betsy Biemann, CEO of Coastal Enterprises in Maine. And sitting next to Betsy is Barbara Magnoni, President of EA Consultants and Adjunct professor at the School of International and Public Affairs at Columbia University, and also a regular collaborator with the Financial Access Initiative at NYU. Thank you all so much for joining this conversation. This conversation we’re going to be talking about building, sustaining, and scaling job quality work within CDFIs. And the previous panel really set the stage beautifully for this conversation. They really gave us a flavor of how CDFIs work with small business, how it really is contextualized to the community to the specifics of a business. They really just highlighted the ways in which CDFIs have broadened the scope of what they do to support small businesses and to incorporate a focus on job quality.So in this panel we really want to explore a little bit more. What does it take for a CDFI to add this focus? The work involves building your internal capacity, thinking about the organization’s strategic focus, how does this fit? How do you build new skills and new knowledge that you might need to do the work? And it also requires building external capacity and building new relationships. So Israel actually mentioned the relationship with GOOD for Michigan, so there’s new relationships and new partners that may also need to be brought into the work. So we’re going to dig into all of these things about what it needs to be able to grow and flourish in more communities. So you’ll notice Barbara is not Tim Ogden who was on the agenda and you may have been expecting, but very unfortunately is dealing with some health issues and could not be here with us live. Although, may be here with us virtually.But I’m really thrilled that Barbara’s joining us, and Barbara and Tim have worked closely together, so they did a little mind meld yesterday and she’s totally ready, not that she needed it. So anyway, let’s jump in and I want to start the conversation of course with asking you each to introduce yourself. And Betsy, I’m just going to start with you. If you could tell us about yourself, how you got to CEI and CEI’s approach. Which actually, you’ve been doing for quite some time in terms of integrating job quality into the work. Okay. I’m going to give a little shout-out to Betsy was also a job quality fellow with us here at The Aspen Institute. So we’ve really loved partnering with Betsy for many, many years. So Betsy. **Betsy Biemann (00:03:22)** Great. Well, it’s wonderful to be here. Thank you for including me on the panel. So about myself, I’ve worked in economic community and workforce development for probably the last 30 years. I’m dating myself. Just all as strategies to advance economic opportunity across the US. In 20 of those years I’ve been working as a practitioner in Maine and rural places and previously for nine years worked at the Rockefeller Foundation as a grantmaker and an impact investor, but all the time working at the intersection of the nonprofit public and private sectors and looking at ways to leverage the various resources, partnerships, relationships, know-how across to really maximize the impact for low-income communities. Along the way, I’ve also served on the board of the Opportunity Finance Network, the Trade Association of Community Loan Funds, as well as served for 10 years on the board of a place-based foundation in Maine that does impact investing. So I’ve seen a lot of the different perspectives for ways to advance this work.I’ve been at CEI for nine years as CEO. For those of you who don’t know CEI, we’re a forty-eight-year-old CDFI, one of the early rural CDFIs. And our mission is to build a more just vibrant and climate-resilient future for people and communities in Maine and in other rural regions across the country. To give you a sense of scale, we have a small business loan portfolio with about 450 small business loans that totals around $76 million and we advise around 1600 entrepreneurs a year. We also, over time, have developed a number of financing subsidiaries that make venture capital investments, tax credit investments, and real estate investments regionally and nationally. And we can talk later about how we’ve infected them with our good jobs work as well.But I think historically we always cared about good jobs, but I think when I got to CEI, we started sort of asking, “Well, we want to be maximizing our resources.” So not just creating any job, but good quality jobs that I think if you had asked everyone in the organization what is a good job, you would’ve gotten 50 different answers. So one of the things that we did was some research and conversation with employers and workers and we benefited from sharing with PCV, a CDFI partner that had done research in this area, and developed a framework that I can talk about a little later. But really that has helped us be a tool for informing our lending but also for working with small business owners because we believe that good jobs are good for the small business, good for the workers, and ultimately good for the communities where the small businesses and workers live and exist. **Maureen Conway (00:06:32)** Great. Thank you so much, Betsy. Viola, I’m going to come to you next. You also have a great history in this work, not just at ICA, but you also worked at Self-Help. So I’m wondering if you can just tell us a little bit about your journey into this work and about ICA Funds approach to job quality, which is a little distinct because you do more of the investing than lending. So maybe you could just share a little bit about that and about your background in this work. **Viola Mai (00:07:00)** Yes. And I have the great pleasure of going after Betsy, who has an amazing career. But I feel like for me in how I approach my professional life and my personal life, it’s always about how do I democratize systems? So I’m a child of immigrants. My father was a small business owner and it was really common for me to be in elementary school and just trying to figure out tax terms that he would ask me about. And I was like, “This is crazy.” And then growing up, I did go into finance. I have an econ degree, and I began to understand all of the crazy systems that our society has created to manage finance, but it also gate-keeps a lot of folks, especially if you are not a native English speaker or you come from a rural area or you just don’t have access to those networks.And so every part of my career has really been how can I help leverage my skill to share knowledge and share resources? Because we know the two have to go hand in hand. You can teach someone how to do something, but you also need to make sure they have access to those networks, those resources, capital, things like that. So that’s what initially drew me to my work at Self-Help. So I was at Self-Help for about four years. I was there helping raise mission supportive deposits. Self-Help is a national credit union, so they do mission supportive lending, but oftentimes their client base doesn’t have enough capital to support the lending projects that they wanted to do. So I would go to different institutions, different high net worth individuals and work with them to move their money. That was a really big popular phrase, move your money.And through my work, I was so excited about the big scale projects that Self Help was doing. But me personally, I’m based in the San Francisco Bay Area. I never really saw how those projects impacted the main streets that I lived on, what’s happening with the small businesses in my community. And that was really the transition that made me really love ICA’s work. So just zooming out a little bit, ICA Fund, we are a provider in the San Francisco Bay Area. We work with local small businesses, but we really offer the gamut of services. We do a business accelerator where we work with about 40 businesses every year, really comprehensive business coaching paired with a personal advisor. We also have the ICA community. So entrepreneurship is very lonely, it can be really hard to find people who are in the same position or going through the same struggles.So we operate the ICA community to really bring space where folks feel safe to network and also learn from each other. We also have a great peer mentorship program going through the community right now. And then lastly, but also super, super importantly, we run an investment fund. So actually the fund was originally named Fund Good Jobs back in the day when it first started. So the investment fund through which we do primarily equity investments, but we also do convertible debt and some new products that we’re thinking of, more working capital stuff. All of it’s just centered on how can we support small businesses in accelerating their growth, but really supporting their local community. We want everything at ICA to be about creating vibrant communities, creating community wealth because at the end of the day, that’s where you live and we want to make sure that we can support the continuation of that, make sure the people like where they live and are really building for the future. **Maureen Conway (00:10:30)** Yeah. Great. Wonderful. Thank you. And Barbara, I want to come to you now. You also have an amazing career and have done a lot of work with small businesses in a variety of contexts. And coming to work with us on Shared Success, I think the job quality aspect was a little bit new for you. So tell us a little bit about the work that you do and also what was interesting to you about coming to work on Shared Success? **Barbara Magnoni (00:11:01)** Yes. Okay. Yeah. So my name is Barbara Mangoni and as Maureen said, I’ve been working in the financial inclusion space for years, but never really focused on job quality the way this project is. The closest I’ve gotten was when I started a company in Mexico in 2019. We were offering FinTech services in low-income communities and we’d hired women over 40 who tended to be excluded from the working population and ended up in a lot of informal jobs to offer these services in low-income communities. And everybody advised us to pay them on commission and we just didn’t feel like that was right. They needed to feed their families and pay their rent, and take care of their kids, and commission just wasn’t going to cut it.So we flipped the risk and gave them basic salaries and focused a lot on HR to make sure that they were motivated and doing well. Our retention rates were through the roof. We had 50 employees, we only lost one, and that was for a health reason. Which is unheard of in the Mexican financial sector, probably in the US financial sector as well, which I’m not as familiar with. And it just got me thinking about the possibilities of a business model that looks different that does center around the HR piece and makes sure that people are happy and feel good in their jobs.So anyway, when Tim brought this project along that he was talking to Aspen EOP with, to me it was really exciting. Because I thought, “Wow, we can learn a lot more about what these opportunities are and what these business models can look like.” And I’ll just say working with FAI is a really great way to do that. For those of you not familiar with the Financial Access Initiative at NYU Wagner, they do research a little bit differently. They really poke into the deep understanding of the reasons people make the choices they make, particularly in the financial space. And that was a really great approach for understanding this project a little bit better. So that’s what brought me here. **Maureen Conway (00:13:27)** Great, thank you so much. So I’m going to transition a little bit because I know that you’ve touched on a little why you do the work that you do, and the urgency of this work looks a little bit differently in different places in different communities. So Betsy, I’m wondering if you can start just talking about why this focus on job quality is important to Maine and what that means for Maine, and what kinds of outcomes you’re seeing in the work that you do. **Betsy Biemann (00:13:56)** So in case you’re not that familiar with Maine, we’re half of the landmass of New England, but we only have about 1.3 million people who live there and lots, and lots, and lots of trees and lobsters. You’ve heard about the lobsters probably more than the trees. But we’re really still transitioning from a 19th century economy to a 21st century economy. And it used to be that you could graduate from high school and walk across the street and get a job at the paper mill or be a stern man on a lobster boat and make a decent living. And starting in the 1970s that started to change. And today we are a small business state. Almost well over 90% of the businesses in Maine are small businesses and well over half of all Mainers work in small businesses, but small businesses typically don’t have that HR department.You’re a baker who’s talented at baking and you’ve started a bakery or you are that lobsterman and you’re hiring a stern man and you don’t necessarily know about the New Merit program, which is a retirement program that Maine has started so that small businesses who don’t have a retirement savings program can make sure that their employees have a way to save money for their retirement. But we have this wonderful team at CEI who can help. So the way we really started, I noted that we had always cared about good jobs, but we didn’t really have a definition. And we did some of this research and participatory research, really talking to small businesses and learning from our peers and developed a framework that is seven different aspects of a good job. And we’ve really used that to then both inform our small business loan decisions and even to help set the interest rate that we charge depending on whether a small business provides good jobs or is interested and committed to improving the quality of their jobs. But also to really help guide our conversations with small business owners.A lot of the businesses we work with and finance are in the natural resource-based sectors, so they are seasonal often. We work with a malt house that malts barley. Well, barley doesn’t come to work at 9:00 in the morning and go home at 5:00. Though when you’re malting barley, it’s a 24-hour process. So working with that small business owner who has literally an award-winning barley malting operation and provides malted barley to over 120 beer and other craft breweries, he needed help to figure out how do I make these jobs that people are going to want to stay in when part of the year you might have to work well after 5:00 in the afternoon, or come in well before 9:00 in the morning? And how does one structure and remunerate those positions in a way that folks can see a future and can also see having a family and doing what you have to do as an individual while having that job.Also, we’ve done work with Mussel and Kelp Aquaculture company. Again, you get on the boat, you go out, rain or shine. It can be very unforgiving weather conditions and if your kid has a doctor’s appointment at 11:00, you can’t just motor back into the harbor. So these are complicated jobs and there is some flexibility that the small business owner has and we help them figure out how can their business model and the realities of their small business best create jobs that pay a living wage, provide paid time off, provide an opportunity for wealth building or retirement savings? Have some kind of a health benefit or health stipend, give people at least two weeks notice. Because schedule notice is very inexpensive to provide, but can be very stressful and very expensive for a worker if they don’t have it.Performance reviews process that lead to increases in one’s compensation as well as opportunities for training or tuition. So again, you can improve your wages either at that business or another one. So those are all the kinds of things that we do. We advise over around 125 businesses per year in our small business lending, Maine based work. But we also over time have started working with our venture capital subsidiary that is working with more growth oriented businesses across New England and the Northeast. As well as our new markets subsidiary, which is investing in much larger rural manufacturing companies across the nation. Where the smallest one I think has about 65 jobs and often has north of 200 or even 300. So we’ve managed to integrate a lot of this thinking and that framework into how we work both in Maine as well as nationally and are seeing really important results. **Maureen Conway (00:19:50)** Great. Thank you so much Viola. I’m coming to you next because I bet things are a little different in the Bay Area. **Viola Mai (00:19:58)** Very. **Maureen Conway (00:19:59)** And maybe some of the businesses are a little different than that. So I’m wondering if you could just share some examples from the work that you do and why this is important in the communities. You mentioned that a little bit. Say a little more about why it’s important in the communities where you live. **Viola Mai (00:20:17)** Yeah. So I feel like everyone probably thinks of San Francisco, Silicon Valley, Tech AI, money. Yes. And at the same time, our region has one of the highest income gaps of any area in the nation. And because of the highest highs, we also have the lowest lows. So that’s why it’s so important to have quality jobs to help people build wealth. In the area, also homeowners… We typically think in terms of wealth building homeownership is the easiest thing. Get real estate, let it gain value over time. But also in the San Francisco Bay Area, it’s one of the most expensive real estate markets in the world. So in the interim, what can you do? So a lot of folks have been turning to small business as a way to take back ownership of their life and then just really create a good quality business, source of jobs for people in their community. And I actually do want to raise up two products that ICA Fund has been using, and I want to say that they’re not new. We’ve been working on these things for years and years and years.So the first one is our good employer Matrix. So through our accelerator program we do really focus on the people strategy of how as a solopreneur, someone with just one employee, how do you actually build the strategy to higher up? How do you promote people? And then also, as Israel was saying earlier in the first panel, having job descriptions, just having uniform policies. So our people strategy module is part of that. And then as part of people strategy, we also talk about the GEM, which it’s just a scale of what no benefit looks like. And we also break it out. I believe now it’s three categories. It’s a very quickly evolving changing thing because so many things change about our world, so we have to move with the economy and society. But we have a scale of what does it look like for no benefit, what’s one step up, what’s another step up? All the way to what is the perfect way you can operate in this specific benefit capacity?And we break it out over different categories so folks can look at that and see what’s either a low cost or no cost option until they get enough revenue to maybe invest in that retirement plan or that health insurance plan. So we have this as a tool that’s accessible. We also have another product, it’s called the ISA impact note. And this is actually an investment note where we have co-created with the investment recipient. What are the different social impact goals that you want to achieve with your business? It might be creating X number of jobs. It might be, “Oh, I want to provide a profit sharing plan.” Or, “I want to create an advisory board for my business so I can make sure I’m meeting community needs.” So we insert five of those goals into the ISA impact note, and when an entrepreneur meets that, they actually get a portion of our equity ownership returned back to them.So that actually allows them to both meet their social impact goal and also make a financially good decision. So those are some of the tools, but definitely something about ICA is we are in the heart of Silicon Valley and we see so much innovation around us and actually that’s what we pride ourselves on, we innovate with the quickly changing world. Because our area has one of the highest income disparities in the nation, we really think it’s imperative for us to center small businesses and quality jobs in order to reduce that wealth gap and really make sure that we love and enjoy the community that we’re in. **Maureen Conway (00:24:03)** Great. Thank you so much. So Barbara, I’m coming to you now because we’ve heard from Maine, we’ve heard from the Bay Area, and you’ve done a lot of research on the financial lives of low-income workers across the country and even globally. So I want you to comment on how they think about job quality and what that means to them. But also you’ve been doing work lately for Shared Success, talking to both the business owners and their workers. And I’m wondering if you can share just some of the highlights from what you’ve been hearing. **Barbara Magnoni (00:24:35)** Sure. So I’ll start with some of the research that we’re working on right now with FAI. We’re just starting a project called Small Firm Diaries here in the US that’s based on prior work, on household financial diaries, and also global small firm diaries. That work has really informed a lot of the thinking around just the challenges small business have that we’re incorporating into our analysis, including this project. One of the big highlights of both the individual household studies and the global firm level studies is that low-income households and small businesses are dealing with a lot of unpredictability and a lot of financial volatility. And maybe that sounds intuitive, but it has a lot of repercussions in terms of the choices that they have to make and the trade-offs that they have to face.In the workspace or in the job quality space, one of those is the trust gap. And I hate to call you out Tristan, because you said this, I don’t know, in a very open way and I don’t want to call out any illegal activity any more than it’s already been mentioned, but I think it’s a really- **Speaker 6 (00:25:59)** Statute of limitations. **Barbara Magnoni (00:26:03)** But it is a really great example that you mentioned earlier of the trust gap. Where maybe an employer doesn’t have enough security in their cash flow to pay workers more or doesn’t prioritize it. So workers might take a little money off the top if that’s accessible to them, because they don’t feel like they’re being treated well. And then the employer might look at workers in a different way because they don’t really trust them anymore, and so they’re micromanaging or not managing as well.So this volatility has incredible repercussions for the quality jobs and what that looks like in the end. As Maureen said, we have had the enormous pleasure of speaking with 77 small businesses in this project individually and 50 workers from those businesses. And it’s something that we have tried to tease out. And what we found really interesting is that small business owners and their workers both agree that creating a more supportive work environment is important to them. And in many cases, most important to them. And that speaks a lot to closing this trust gap. It speaks a lot to how we bridge this gap between worker and employer. So I’m just going to mention a couple of things that we’ve unpacked from that concept.One is communication. Again, I think Tristan spoke to that really well. Having a huddle or having this moment of just talking to your workers and understanding them can be really powerful. Another that maybe hasn’t come up as much but we’ve heard, is autonomy. Giving workers the space to make decisions, to control their environment. To say, “Hey, this doesn’t work. Can I fix it?” And taking the lead on doing that is very powerful as well. Growth opportunities. We met a business that is an ICA investor that has actually leveraged a lot of the learning and the contacts from ICA to put in place some management skills. They have a management team that’s been promoted from below, so with no management experience. And when they do their huddle or their weekly meeting, they actually read a management book together and comment on it and learn from it, so it’s kind of like getting a little mini weekly MBA every single week to help build up those skills. Which is pretty cool and amazing.And finally, another thing that we’re seeing, and again, we saw this quite a bit in Maine. But in a lot of different places is investment in workers, not just productivity, but safety and reducing some of the tedium around work. So buying machines or investing in technology that takes some of the really yucky work away from workers so they can focus on the more interesting things, or less tedious things, or less even physically difficult things. All of those aspects are things that we’re bundling into the concept of a supportive work environment, which can really help build this trust gap. **Maureen Conway (00:29:25)** Great. Thank you so much. So now I want to shift gears a little. So I mentioned at the opening that doing this work requires capacity building, and thinking both internally and externally for the organization. So Viola, I’m going to start with you and focus first on the internal piece. You’re on the leadership team at ICA and you’ve just spent a lot of time thinking about what are the systems, what are the capacities and all of that, that you need on your team and inside the organization. So I’m wondering if you could just comment on what it takes to build that internal capacity to do job quality work? **Viola Mai (00:30:06)** This is going to be a boring answer, but it has to come from the top. If this is something that is valued by the organization, it really has to be institutionalized. And ICA Fund is super lucky because our board of directors is very, very aligned. Our whole management team, including our CEO Allison, who’s sitting in front of me, super, super aligned with job quality. So then we’re able to make sure that trickles through and is embedded in our goals, and is in our products and not just an afterthought. So I think one of the biggest things is make sure you have buy-in from the top of the organization. And if you’re not there, so if you are maybe a project manager or an associate and you’re just trying to get folks to think about job quality, I actually think one of the most important things is to present the story in terms of the client impact and also the economic impact. And they’re both really important.And I think having both pieces and presenting that to whoever might be a larger decision maker and having it trickle up is really, really key for making this work supported throughout the organization. Also, someone else in our Shared Success demonstration mentioned this, but it might be easiest to get this kind of work introduced through a pilot, but that also silos it from all of the other parts of the organization that would also benefit from knowing about the work and implementing job quality work. So something I’ve been thinking about separately, and ICA does have this, but include it in your strategic vision. Everyone has a five-year strategic plan, or three, or what have you. But if you can get job quality in there, then it gets into people’s goals and then the team then will operate with that in mind. And then hopefully it doesn’t leave the strategic vision once you do your visioning process again, maybe it then becomes a core value in organization. But that’s my fast and dirty version of how do you get this work happening? **Maureen Conway (00:32:07)** Yeah. No, I really appreciate that. I also love how you think about adding that to people’s goals. And Betsy, just building on that, in your role as CEO… I remember visiting Coastal Enterprises in the 1990s and they had a concern about good jobs because Maine needed good jobs and everything, but it was not institutionalized. So I’m wondering if you can just talk about what it took in terms of institutionalizing that focus at CEI. **Betsy Biemann (00:32:42)** Sure. So I really resonated with a lot of the things that you said, but I certainly know at CEI if it had just been me coming in and saying, “I’m the new CEO and we’re going to now start working on good jobs.” And it stopped there, it would’ve stopped there. Because we’re a very democratic organization. I don’t know. There’s a lot of, yes, inclusive, collaborative and really want to get. So I’d say the first thing that we did after we decided this was a key strategic effort of the organization was to start building a team and really wanting to hire a terrific, dedicated team with expertise in the private sector, in senior manager. And I will put her on the spot, but Cynthia Murphy is here, who was that person and she’s really driven this work.But brought not only deep commitment to growing good jobs in Maine, but just experience from an international career working in management in all different sizes of organizations. And thinking very carefully and strategically about how you build people and build teams. And since then we’ve added Taben and Cameron who some of you have met, and they’re really the locus of what I’d consider the practice development, leadership, and learning around good jobs in our organization. Then we created this clear and pragmatic tool that I mentioned, the framework with the seven elements of it, but have really over the last probably seven or eight years integrated that throughout our lending process.If you’re growing jobs, if you have jobs, we look at the job quality as part of our due diligence on a loan. Our scorecard is part of our investment memo. Everyone is trained in and understands how that is an integral part of our decision making. And similarly on the business advising side, we have a lot of business advisors who didn’t have and don’t have deep specific knowledge, but this great team has developed resources that they can use very easily. Thirdly, we walk the talk. One of the first things we did when we decided to do this is look at our own jobs. Do they fit all of these? We can’t go out and ask small businesses to do something we are not doing ourselves, so that was an important part.Just communicating regularly, telling stories at all staff meetings and not just communicating within the program team or the lending team, but our accounting folks need to know about this and our IT team needs to know about this. Everyone needs to understand and really appreciate the importance of it. And I’d say finally, make it easy to incorporate it. Again, our good jobs team has been terrific. They have these grab and go resources. So if a business advisor who’s not on the good jobs team, but say maybe one of our sector in child care or in aquaculture talks with a small business owner and they say, “Oh, I’d love to figure out how we can support retirement savings for our folks, but we don’t have any money to do it.” There’s the follow-up email draft with the links embedded in it, and off it goes. So making it very simple and seamless with all of our work. So those are some of the things that have worked for us and we’re continuing to grow and evolve the work. **Maureen Conway (00:36:36)** Yeah. Great. Thank you. Thank you both so much. Because I will just say I talked to a number of organizations that are like, “Oh, that job quality thing, that’s so interesting. I’m totally there, but what do I do?” So I think you gave them a lot of what do I do’s? So that was really terrific. And now we’re going to go to the outside part of it, because it’s not just within your organization, you also need partners. And Viola, I’m going to come back to you because I know the director of development is part of your job. So I’m thinking about funders is of course important, but there’s other partners too, so I’m wondering if you could just talk about the external partners that are important in this work. **Viola Mai (00:37:13)** Yeah. I will just say ICA Fund is really lucky to have really trust-based funders who believe and align with the mission of our work and trust that we will design the programming that will help us achieve our mission. I know that not every organization is that lucky. A lot of organizations, especially right now, we’re all dealing with a difficult fundraising environment. So I would say now more than ever, one approach to make sure that this job quality work really gets not just started but really sustained, is to really normalize those talking points. Earlier I said the economic story and the impact story, and I think that’s double underlined, bold font for funders. If you are interested in trying to get this work started and figuring out how to make this not just a one-time pilot, but something to be sustained, it’s really about making sure that you really are capturing the impact of what job quality means.Because we all just heard from these amazing entrepreneurs about what it really looks like for their employees, their community? And also I think for folks like me who at ICA, I’m writing grants, talking to funders, tracking data, uploading stuff on Salesforce, it’s like my job then to really encapsulate what does this actually mean though? What does it do when we do this at scale? What does it look like if we can help 100 Cafe Rica’s? So I think that’s super, super important if you are looking to get funding for this kind of work and continue it.And then I would say too, it’s also helpful to start with a pilot. Like, “Here’s a cool idea we have and here’s what we want to achieve. And I’m really hoping XYZ funder, if we’re successful in this, we can make this into a fully fledged program.” So that might be a way to step into a little bit of funding that can help evolve into something bigger. And I will say, I’ve been in fundraising for almost eight years, and that is typically how you get to those bigger pools of money. You start with a small pilot, a project, gain trust from the funder, and then eventually that becomes a really long-lasting partnership. Not just from a dollar basis, but who they connect you with and what opportunities to speak up about the work that they give you. All of it’s really a true partnership. So I would say get really clear about your storytelling and look for folks who are partners for the long run, if you have that ability. **Maureen Conway (00:39:55)** Masterclass from the development director. And Betsy, I’m going to come to you. You have a lot of experience engaging in funders in this, but you also were a funder for a long time, so maybe you can reflect on that experience and just share what has drawn funders to this kind of work. **Betsy Biemann (00:40:17)** So it’s interesting, despite the fact that we have this great track record, we have not been able to raise project funding from a lot of foundations. I think some of the issues were not in the Bay Area, so when we go to national funders, they might care about good jobs, but they don’t care about Maine, they care about their geographic footprint, which is somewhere else. Or they care about Maine if they’re maybe Maine funders, but they don’t necessarily care about good jobs, they care about something else. So we’ve had a hard time finding that Venn diagram of folks who care about Maine and good jobs. So I think that we’ve then switched strategies and instead as we’ve integrated our good jobs through all of our work, we have taken slices of our good jobs advising and been able to build them into say, a project grant over here or there.And some of those are federal and some of those are private. The other thing that has been helpful, and kudos to the Casey Foundation, because of our good jobs work, they’ve made two PRIs to CEI. So a 4 million ten-year investment in our small business lending and a 1 million investment in one of our venture capital funds. It’s focusing on good jobs. So that capital enables us to grow our lending, which grows some of our revenues. So in this way, instead of what I consider almost a vertical, here’s a grant to do this one thing, it’s across our organization and we’re able to scrape together the resources that we need to continue this good work.I have to say I’m still a little puzzled. I think part of the problem is that I’ve drunk the Kool-Aid and I think this is really valuable work. And I know if I were back at the Rockefeller Foundation, I would be funding this work. But foundations have boards, they have strategies, they have their theory of change. And if you don’t fit in that theory of change, it’s really hard. You put yourself in a pretzel to try to secure that funding. But part of our excitement about being part of this initiative, the Shared Success initiative, has been how do we collectively put the value and the potential of this work forward in a compelling way, in a national way such that we can bring funders along and excite them about investing in this kind of work nationally. **Maureen Conway (00:43:08)** Great. Yeah. Go ahead. **Viola Mai (00:43:10)** Can I just respond to something that Betsy said, which was actually super, super important. This is also why it’s so critical to embed job quality work into the organization. If you are able to make it a core kernel or a mission part of the organization, you don’t then have to go around chasing different pools of project funding because ultimately then what you’re doing is finding funding partners for the nonprofit and not a specific other project, which maybe is just maybe a bit easier. You don’t have to look for that Venn diagram. So just tagging on explaining why it’s so important to get that top down, all around, everyone buy-in for job quality. **Maureen Conway (00:43:54)** Great. Thank you. And Barbara, this is a perfect segue to you because the research that you do has been critical to providing insights and often to funders about what the value of work is and how they should think about their investments. So what do you think funders will want to know about this work? And also, can you share a little bit of what we are learning? **Barbara Magnoni (00:44:15)** Yeah. So I spoke earlier about some of the qualitative visits that we’ve been doing, but we’ve also been surveying small businesses in the program to understand what they’ve been learning, doing, and why they’re doing it through a more quantitative survey. So we have preliminary data, I don’t want to get too stuck on it, from our inline survey. Which is about 158 businesses across the 11 CDFIs. And 92% have made a job quality improvement over the last two years, which is a pretty crazy number. Yeah. 84% also have said that they believe this has impacted some business outcome. So whether it’s retention, productivity, et cetera, but some kind of business outcome. Which is also really exciting as we think about that kind of linkage to business outcomes that we’ve been talking about as a convincing argument to support the work. And then back to my comment earlier, 73% are seeing an outcome around the supportive work environment that we were talking about, which is important to workers obviously and businesses as well.So I’ve got a ton more numbers, but I’m only going to share these three for now. But they’re pretty encouraging. It’s pretty exciting to see how this program has moved forward. And the really important piece of this is the CDFI linkage. Without the CDFIs, this would not have been possible. And yet CDFIs are under so much pressure to do everything and to do it well, and to do it profitably and to reach scale. And to serve customers with appropriate… Should I go on? Serve customers with products that are appropriate at reasonable interest rates for credit products so that you’re not creating more problems than solutions. And there’s just a lot of pressure. Tim and Joyce actually wrote a piece on this, looking at US microfinance or US financial institutions and what they could teach global microfinance institutions. Which is a little bit of a switch from the normal approach.But because the US financial institutions do have this really unique mission to serve the underserved in a way that is very different in global microfinance. In global microfinance, everybody is underserved. So you have some really good credit customers there in the underserved that maybe they don’t have a formal credit history, but they have good incomes, they have a big family with lots of jobs. They’ve been paying informal loans regularly and on time forever. They’re not as excluded from financial sector credit worthiness as the folks that are served by this community of CDFIs. So it is a really difficult thing.Tim actually asked me to quote a paper, which I probably won’t quote well, but called Financial Inclusion Trilemma. But the point of this paper here in the US is that financial institutions here in the inclusion space are asked to provide good non-predatory products at scale profitably. And the paper posits that those three things together can’t happen. And what that suggests is that there’s a real case for donors to step in if they want to serve these communities in the way that they need to be served. And this is just another layer onto it, the good jobs piece. Whether it’s special programming or embedded, which I think makes a lot of sense, is really important. **Maureen Conway (00:48:38)** Great. Thank you. So I’m going to ask them one more round of questions, but I want everybody to know I’m going to be coming to you all soon, so be ready. So last question for you, Betsy. As a CDFI leader, you’ve been involved in and worked with industry associations. And I’m just curious, what are your thoughts on industry associations, other intermediaries, or other players and the role that they can play in terms of supporting and growing this kind of work? **Betsy Biemann (00:49:11)** Well, as Barbara just very eloquently noted, practitioners are busy doing a lot of stuff in the trenches that’s very hard. And one of the great roles that I think networks or trade associations can play is as a convener, a best practice capturer and sharer because we don’t have the time or the money to do it. So when I was a funder, I sometimes would support a multi-site, multi-ear initiative. Where there was a central organization that might manage the money, might organize the cohort meetings, something like The Aspen Institute does so well. And it was a great way, a complimentary way to let the practitioners do what they were good at and to channel a little money to them to help them advance their practice and also show up for the meetings.But then to lean on the trade association or convener to do what they’re good at. Which is to bring folks together, manage the money, make sub-awards, maybe bring in communications people. So as those best practices are identified, they can help to figure out how to leverage their national networks and their strategic communications knowledge and capacity to get the word out either through a trade association to other practitioners or to a broader set of policy or practice folks. So I certainly think that those types of organizations can be really valuable. There’s also, we haven’t talked about policy much today. But we have found that in Maine not only do we advocate for policies that are benefiting small businesses and workers, but also when they make a new policy, even if it might be for larger companies, like our recent earned paid leave policy is only for employers who are 10 employees over.But it starts a conversation where then a lot of that is in the news. And then we can work with the smaller businesses who might say, “Oh, my competitor down the block has got 12 employees and he’s starting to do this. So I better start it too, otherwise my folks are going to want to work for him.” So there are direct as well as these ripple effect ways that the public policy and state and municipal government play an important role in this ecosystem. So those are just a couple of examples of ways that that ecosystem can work together and can be moving this work forward. **Maureen Conway (00:52:12)** Great. Thank you so much. I’m glad you brought up the policy angle. Viola, to you, are there other partners that you all work with other than funders that are important to supporting this work? **Viola Mai (00:52:25)** Yeah. I would really echo Betsy’s point about policy and also I would say local chambers of commerce, local, municipal, and also state level government. Those are really good resources to tap. A lot of them have repositories or lists of all the different organizations in your area that do X, Y, Z. It’s really important, I think, to be aligned with those organizations so that the organizations, the practitioners don’t have to do that extra work of trying to yell out into the wilderness like, “This is the stuff we do.” I also want to really make a plug for organizations like Opportunity Finance Network that help convene different CDFIs. So oftentimes for us CDFIs, we only can fill one part of the capital stack for a business. Do we have a very clear idea of what we invest in? What kind of loan do we do? What kind of investment do we do? What kind of equity investment do we do?And ICA actually has an example of an entrepreneur who has been really resourceful. He originally created his restaurant, it’s a Japanese fast casual chain. But he created it and wanted to figure out how to make this a business. So he first went to an incubator, it is called La Cocina. La Cocina’s had their 20th anniversary. Really, really cool organization if you’re interested. But he went to La Cocina and he’s like, “I need capital. How do I do this?” So then La Cocina referred the entrepreneur to different CDFIs in an area such as ICA. Entrepreneurs went through our accelerator program. Also, then got financing from another CDFI microloan, and then came back to us and got an equity investment.So all of us working together was what made this business now into a franchise model. He just opened his first franchise location, he’s now six locations, 41 employees strong. But it was because he was able to tap into this network of providers that were convened by organizations like OFN that he was able to meet all of those different needs. And then now he’s super successful, although still trying to grow, still trying to hire more folks, create more quality jobs. But I just want to make a plug for those network conveners because they help make the whole system work. **Maureen Conway (00:54:48)** Great. I love that. And I love the really different context and models you brought up. And Barbara, I’m just wondering if you have any other comments on this idea having seen a range of things in your work? **Barbara Magnoni (00:55:01)** Yeah. I’ll mention a couple of things just on Viola’s point. We definitely saw that in our interviews and even in our survey. I don’t have the numbers in front of me, but people aren’t learning about job quality from only one source, they’re learning about it from different sources. They’re interacting with different organizations in their communities. So the more those organizations are aligned and connected, the more powerful the interventions can be. And that’s maybe an opportunity for the future to really push that. The second comment, which is mushy-gushy that I was going to make was just this group of really diverse organizations that we were so kindly welcomed into as external actors, has been just such a pleasure to get to know.And I think as a community of practice, there’s a lot of power in having this incredibly diverse community, serving really different types of clients and really different client communities. You got a little bit of a taste of that today for those of you who don’t know them. But it’s not easy to align conversations from North Carolina to South Dakota, to the Bay Area, to Maine. And there’s a lot of sharing that happens and beyond just amplifying the lessons, amplifying the voices, I think the individuals in this group, this broader group of CDFI people… I don’t know what to call you. It’s hard work and you don’t always want to prioritize it either. And having a group around you that checks in that is also doing the hard work is a really effective and powerful thing, at least from what I’ve seen. So that’s been really exciting and I think obviously one of the strengths that Aspen brings to this. **Maureen Conway (00:57:00)** Thank you. Great. Well, thank you all. And we are open for questions, if anyone has questions. Yes. And we do have mics coming. Yeah. And please introduce yourself when you ask a question. **Molly Scott (00:57:14)** Sure. My name is Molly Scott. I’m from the Urban Institute. I’m a big fan of your work, I’ve been following it for a while. My question is about the business case for the CDFIs themselves. What have you learned about how including job quality impacts or not the loan performance? Does it help you when you’re underwriting in terms of making better loans and being more successful on that level as well? Just curious. **Betsy Biemann (00:57:51)** So this is a very initial perspective from our venture fund where we have a little bit more in terms of years of data, but we have seen that… And it’s correlation, not necessarily causation. But the companies in the venture fund portfolio that have been working on good jobs, so our more recent portfolios, that either have higher quality jobs or have been making improvements in their jobs are growing faster than the other businesses in the portfolio. So that’s an interesting data point that we’re obviously following. And as time goes on, we will have more data that we can make pronouncements like that about. But that was very promising.And we also get tons of anecdotal information about this company, which used to have a lot of turnover issues and paid a lot of… This is in our small business loan portfolio, but a company that had a lot of turnover, paying a lot of overhead, and as we helped them, should have changed that picture. One of the things was they hadn’t been able to take on contracts because they didn’t have the capacity, and so they were then able… So we see those kinds of more micro examples all the time. And as the work goes on, we’re able to start collecting more of that data, seeing more of those examples and over time, see the performance in… Happily, we have very low non-performing rates in our small business loan portfolio anyway, but we’re able to see company by company how the job quality work is really contributing to the success of the businesses. **Viola Mai (00:59:45)** I’ll also take a shot at answering that and ICA, we don’t operate a traditional loan fund, we have an equity fund. But for us, it’s actually a really key source of due diligence when we see how entrepreneurs implement job quality work and how they’re really addressing their business to help it have a real tangible business plan and scale. That to us tells us, “Okay, actually this probably is going to be a good investment.” So it’s a key part of how we assess the viability of our investments. But then also it’s about business resiliency. So when there’s investment in good jobs, that also means that the entrepreneur is not the one weakness point. When there’s investment in the management team at the business, there are people who can take over if God forbid something happens. So I think there’s absolutely an economic case for it. Happy to talk more about how the performance of our fund has been going and how we’re seeing it play out in terms of the due diligence in our scorecard. **Speaker (01:00:47)** I have a few questions from our live stream, if we have time for two questions. Our first question is, “As described, small businesses often are a supportive anchor for communities. Can each of you discuss the Venn diagram to access the money with small businesses as an actor? As described, small business often is a supportive anchor for communities, can you each discuss the Venn diagram to access the money with small business as an actor?” **Maureen Conway (01:01:25)** I don’t know, [inaudible 01:01:26]. **Viola Mai (01:01:32)** Can we answer that offline, maybe get some clarification? **Speaker 6 (01:01:34)** Yes. We will ask for clarification and get back to that person. The following question is, “Small companies and nonprofits, in my experience, tend to be very averse to providing or thinking about disability accommodations and rely on carve outs around the number of employees to get around them. How do you work with small businesses to get them to understand that accommodations are usually not expensive or onerous? Disabled employees provide a lot of value and that they can see a lot of benefits from doing more than the legal bare minimum.” **Barbara Magnoni (01:02:06)** Can I just give an example, maybe not take a stab at answering the broader question? But I touched on the idea of making investments to make the work at small businesses a little bit less tedious. Some businesses specifically referred to disabilities as part of that. The work was difficult for people with disabilities, or even people who just couldn’t stand on their feet a whole day without getting pain, or people who couldn’t lift certain equipment. So one of the really, I think, exciting things about some of the larger loan funds and equity funds is that they’re giving enough capital to small businesses to invest in machinery that makes the small businesses a lot more friendly to people with some sort of physical disadvantage. Or even just more broadly, women, older people, everybody. **Betsy Biemann (01:03:13)** I can think of two examples. I’m not sure how much they’ve been in our good jobs work versus just the folks we work with, but who are great examples. There’s a company in the Skowhegan area, the Good Crest. And the founder of that company is an occupational therapist, and her twin sister actually runs a company called Main Grains that makes flour using an old milling technology and for the artisanal bakery market. But Heather started the Good Crest and purposefully crafted the workforce opportunities around folks with different physical and mental abilities so that they can be part of the company.That was her purpose really, was to create a workforce that would be a welcoming environment and a very positive work environment for folks with varying abilities in that company. Another one is a mushroom production company where they were having issues around how they had organized their factory floor and it wasn’t working that well. And our good jobs team helped them recognize that there were some functions that folks with developmental disabilities would be great at. So they partnered with a local nonprofit that works with and supports those folks and can coach them. And they restructured their operations such that folks who were doing the packaging could focus on the packaging, and then other folks could do other functions.And had a partnership where folks came in and they had a coach for a while to help them get the training and support they needed. And it was an extraordinarily positive step for that company across the board, both from a financial and a workplace productivity and happiness perspective. So those are sort of just two examples of businesses that have absolutely incorporated people with differing abilities to have a successful working experience in a sustained way. **Maureen Conway (01:05:42)** Great. Great. Thank you. So I think unfortunately that brings us to close, but thank you for your comments. I think that was a great question because I feel like it demonstrates just the problem solving, the uniqueness of this work. But also, again, what is possible? That these things are possible and we just have to think about how we do it. So thank you all for joining us. We will be sharing more from all the things that we’ve been learning from Shared Success. I didn’t do this in the beginning, which was a real failing on my part, but I want to acknowledge that many of the other Shared Success folks are in the room from the different CDFIs around the country. So I hope those of you who are in the room will join us for the reception downstairs and get to know them and get to know their work a little. They all do something a little different. They’re all really amazing and fascinating. So I hope that you will join us.For those of you who are online, thank you so much for joining the conversation. Please do again, respond to our feedback survey. And then finally, I just do want to thank my many colleagues for their help and support in putting on this event. These events take a whole team. So Amanda Fins, Maya Smith, Bryn Morgan are around somewhere. Joyce Klein maybe stepped out. Oh, there you are. She’s right in front of me. I can’t see anymore. Lauren Starks. The whole team, just really amazing. So I thank them and I hope you’ll join me in thanking them and thanking our amazing panel. **Learn More** Good jobs and strong businesses are vital to the well-being of communities across the country. Yet millions of workers struggle withpoor-quality jobs, and small business owners often struggle to find and retain the employees they need.Shared Success, a project of the Aspen InstituteEconomic Opportunities Program(EOP), shows how building better jobs can uplift both sides at the same time. Supported by a $12 million investment from the Gates Foundation, EOP partnered with 11 community lenders to integrate job quality programming into their small business support services, supporting the needs of employees while helping small businesses succeed. The Aspen InstituteEconomic Opportunities Programhosts a variety of discussions to advance strategies, policies, and ideas to help low- and moderate-income people thrive in a changing economy. To learn about upcoming events and webinars,join our mailing listandfollow us on social media. **Related Events** **The World of Work: The State of the Global Workplace** UnfavoriteFavoriteJune 11, 2025 Maureen Conway **How Do We Get There?** UnfavoriteFavoriteJune 9, 2025 Haley Glover **Upskilling Playbook: Metrics** UnfavoriteFavoriteJune 5, 2025 **Upcoming EOP Events Newsletter — June 2025** UnfavoriteFavoriteJune 4, 2025 **Announcing Our New Upskilling Playbook** UnfavoriteFavoriteJune 3, 2025 Chelsea Miller Chris Huyck Trout **Job Quality & Capital** UnfavoriteFavoriteJune 2, 2025 **Making All Learning Count: Building a Skills-First Future for Everyone** UnfavoriteFavoriteJune 2, 2025 Haley Glover **(Recording) Building, Sustaining, and Scaling Job Quality within CDFIs** UnfavoriteFavoriteMay 30, 2025 **(Recording) Driving Innovation in Small Business Lending Examples of How Small Business and CDFIs are Working Together to Advance Job Quality** UnfavoriteFavoriteMay 30, 2025 **Upskilling Playbook: Program Components** UnfavoriteFavoriteMay 29, 2025 Driving change through dialogue, leadership, and action to help solve the greatest challenges of our time. Instagram X Facebook LinkedIn YouTube Aspen Institute our purpose Press center History Event Calendar Leadership Careers store Contact Legal Terms of Use Privacy Policy"}