{"id": 596, "name": "GLAAD", "domain": "glaad.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://glaad.org/the-glaad-wrap-the-venus-effect-now-streaming-first-look-at-wicked-for-good-and-kiss-of-the-spider-woman-new-music-by-ethel-cain-staci-gruber-and-more/", "title": "The Glaad Wrap The Venus Effect Now Streaming First Look At Wicked For Good And Kiss Of The Spider Woman New Music By Ethel Cain Staci Gruber And More", "content": "**Join GLAAD and take action for acceptance.** Tony Awards 2025: Harvey Fierstein’s Lifetime Achievement Award, Cynthia Erivo Hosts, Paul Tazewell and Cole Escola Make History Meet the Spellman Twinz: Queer Joy, Twin Power, and the Sound of Summer GLAAD’s 13th Annual “Studio Responsibility Index” Finds LGBTQ Inclusion at Three Year Low PRIDE 2025: GLAAD and OUTFRONT Media Launch Nationwide Campaign Centering LGBTQ Stories WATCH: Vico Ortiz Talks Perfectionism, Astrology, and Growing Up Queer in ‘Rise of a King:’ “I wrote it for my community, I wrote it for us.” LGBTQ-Affirming Kids Books to Rewrite Messages from the Playground ‘LEGO Masters’ Duo John & Justin Talk ‘Wicked’ Competition and Representing LGBTQ Community in Season 5 A Tony Award Win and a Message: Paul Tazewell Legacy and Making Space for Black Queer Creatives (EXCLUSIVE) ABOUT USOur StoryFinancial Reporting & AccountabilityCareersContact Us Our Story Financial Reporting & Accountability Careers Contact Us Our Story Financial Reporting & Accountability Careers Contact Us OUR WORKConsulting & TrainingGLAAD Media InstituteCommunities of Color & MediaTransgender Media & RepresentationMedios Latinos y en EspañolGLAAD GamingHIV Stigma & ResourcesAdvocacy & AccountabilityNews & Rapid ResponseSocial Media Safety ProgramALERT DeskGLAAD Accountability ProjectTrump Accountability TrackerJournalist Fact SheetsMedia Reference GuideCivic Engagement20 Under 20 List#SpiritDay“Here We Are”ResearchGLAAD Media Awards Consulting & TrainingGLAAD Media InstituteCommunities of Color & MediaTransgender Media & RepresentationMedios Latinos y en EspañolGLAAD GamingHIV Stigma & Resources GLAAD Media Institute Communities of Color & Media Transgender Media & Representation Medios Latinos y en Español GLAAD Gaming HIV Stigma & Resources Advocacy & AccountabilityNews & Rapid ResponseSocial Media Safety ProgramALERT DeskGLAAD Accountability ProjectTrump Accountability TrackerJournalist Fact SheetsMedia Reference GuideCivic Engagement20 Under 20 List#SpiritDay“Here We Are” News & Rapid Response Social Media Safety Program ALERT Desk GLAAD Accountability Project Trump Accountability Tracker Journalist Fact Sheets Media Reference Guide Civic Engagement 20 Under 20 List #SpiritDay “Here We Are” Research GLAAD Media Awards Consulting & TrainingGLAAD Media InstituteCommunities of Color & MediaTransgender Media & RepresentationMedios Latinos y en EspañolGLAAD GamingHIV Stigma & Resources GLAAD Media Institute Communities of Color & Media Transgender Media & Representation Medios Latinos y en Español GLAAD Gaming HIV Stigma & Resources GLAAD Media Institute Communities of Color & Media Transgender Media & Representation Medios Latinos y en Español GLAAD Gaming HIV Stigma & Resources Advocacy & AccountabilityNews & Rapid ResponseSocial Media Safety ProgramALERT DeskGLAAD Accountability ProjectTrump Accountability TrackerJournalist Fact SheetsMedia Reference GuideCivic Engagement20 Under 20 List#SpiritDay“Here We Are” News & Rapid Response Social Media Safety Program ALERT Desk GLAAD Accountability Project Trump Accountability Tracker Journalist Fact Sheets Media Reference Guide Civic Engagement 20 Under 20 List #SpiritDay “Here We Are” News & Rapid Response Social Media Safety Program ALERT Desk GLAAD Accountability Project Trump Accountability Tracker Journalist Fact Sheets Media Reference Guide Civic Engagement 20 Under 20 List #SpiritDay “Here We Are” Research GLAAD Media Awards NEWS RESEARCH PRESSPress, Media & CreatorsPress Releases Press, Media & Creators Press Releases Press, Media & Creators Press Releases TAKE ACTIONDonate MonthlyWays to GiveEvents36th GLAAD Media AwardsBlack Queer Creative Summit (BQCS)#GLAADHonorsLatine HonorsCorporate EngagementSign up for Updates Donate Monthly Ways to Give Events36th GLAAD Media AwardsBlack Queer Creative Summit (BQCS)#GLAADHonorsLatine Honors 36th GLAAD Media Awards Black Queer Creative Summit (BQCS) #GLAADHonors Latine Honors Corporate Engagement Sign up for Updates Donate Monthly Ways to Give Events36th GLAAD Media AwardsBlack Queer Creative Summit (BQCS)#GLAADHonorsLatine Honors 36th GLAAD Media Awards Black Queer Creative Summit (BQCS) #GLAADHonors Latine Honors 36th GLAAD Media Awards Black Queer Creative Summit (BQCS) #GLAADHonors Latine Honors Corporate Engagement Sign up for Updates **The GLAAD Wrap: “The Venus Effect” Streaming, First Trailers for “Wicked: For Good” and “Kiss of the Spider Woman,” New Music by Ethel Cain, Staci Gruber, and More!** Every week, The GLAAD Wrap brings you LGBTQ-related entertainment news highlights, fresh stuff to watch out for, and fun diversions to help you kick off the weekend. 1.)Anna Emma Haudal’s lesbain rom-comThe Venus Effectis now available to stream on Amazon! In the Danish drama, twenty-something Liv’s life is turned upside down when the chaotic and headstrong Andrea comes crashing into her countryside gardening story. Andrea is everything Liv isn’t, and as the women grow closer, their different lifestyles begin to clash. Ultimately, Liv discovers that relationships, love, and family can come in many forms. Check out the trailer below andrent or buyThe Venus Effecttoday! 2.)Welcome back to the Emerald City in the official trailer ofWicked: For Good! The second part to GLAAD Media Award-nominated Broadway movie adaptation reunites Cynthia Erivo’s Elphaba with a number of queer actors, including Jonathan Bailey as Fiyero, Marissa Bode as Nessarose, and Bowen Yang as Pfannee. Set in the Land of Oz, the final chapter finds Elphaba and Glinda’s friendship being put to the test as they embrace their new respective identities as the Wicked Witch of the West and Glinda the Good Witch of the North. Watch the trailer below and catchWicked: For Goodin theaters November 21. 3.)In other movie musical news, the first teaser trailer for outdirector Bill Condon’sKiss of the Spider Womanarrived! In this adaptation of the 1976 novel and Broadway musical of the same name, gay hairdresser Luis Molina is serving an eight-year prison sentence. To escape the horrors of his imprisonment, Molina envisions films starring his favorite silver screen diva, Ingrid Luna. But Molina’s life is upended when a Marxist, Valentín, is brought into his cell, and they form an unlikely bond. Check out the teaser below and don’t missKiss of the Spider Womanin theaters October 10. 4.)Out Emmy and Golden Globe nominee Andrew Scott joined the legal thrillerA Place in Hell. Starring Michelle Williams and Daisy Edgar Jones, the pic follows two women at a high profile criminal law firm. Report back for more information! Andrew Scott joins Chloe Domont’s next film ‘A PLACE IN HELL’ alongside Michelle Williams and Daisy Edgar-Jones. Described as a thriller following two women at a high profile criminal law firm.pic.twitter.com/t82Rlgtow4 — Film Updates (@FilmUpdates)June 2, 2025 5.)Prime Video debuted a teaser trailer forGen Vseason two, premiering with three new episodes September 17!The Boysspinoff series takes place at the only U.S. college for young superheroes as the students compete for the schools top ranking. In the sophomore season, queer character Marie and Jordan join the group returning to college, burdened by months of trauma and loss. Soon, the gang learns of a secret program that may have larger implications than they realize. Find the teaser below! 6.)In other Prime Video news, the streamer confirmed its lead cast forCarrie, including out stars Josie Totah and Thalia Dudek! The TV adaptation of Stephen King’s novel of the same name is a reimagining of the story of misfit high schooler Carrie White, who has spent her life in seclusion with her domineering mother. Following her father’s sudden death, Carrie finds herself contending with the challenges of high school, a bullying scandal and the emergence of mysterious telekinetic powers. Additionally, pansexualSchitt’s Creekalumna Emily Hampshire joined Marvel’sVision, the secondWandaVisionspinoff after GLAAD Media Award-winning seriesAgatha All Along. Hampshire is believed to be playing E.D.I.T.H., Tony Stark’s sophisticated augmented reality security system. Stay tuned for more information on these exciting projects! A post shared by Amazon MGM Studios (@amazonmgmstudios) 7.)Drag Race Brasilrevealed the queens competing in the upcoming second season! Hosted by Grag Queen, the season will see ten Glamazonians use their charisma, uniqueness, nerve and talent to compete in a series of acting challenges, fashion runways, live performances, and more. Tune in to WOW Presents Plus on July 10 andmeet the queenstoday. A post shared by Drag Race Brasil (@dragracebr) 8.)Queer glimmer rock artistVienna Vienna unleashed the righteous single and“Cashgrab” — watch the music video below!Lesbian singer-songwriter Staci Gruber also dropped the country-meets-Americana single “Be Kind With My Heart.” Additionally, queer genre-blurring artist Wic Whitney released the new single “Pocket” off his upcoming albumFoolhardy, arriving September 26,and multihyphenate Ethel Cain revealed the song “Nettles.” In other music news, the Original Cast Recording of the late bisexual singer-songwriter Jill Sobule’s autobiographical musical memir “F*ck 7th Grade” arrived alongside a special reissue of the 30th anniversary of her landmark albumJill Sobule. Last but certainly not least,Wickedstar Cynthia Erivo shared her sophomore solo albumI Forgive You. 9.)Netflix’sEurovision Song Content: The Story of Fire Sagais coming to Broadway! The musical is under development with beloved trans writer Harper Steele, Will Ferrell and Anthony King writing the book. The 2020 film tells the story of aspiring Icelandic musicians Lars Erickssong and Sigrit Eicksdottir as they represent their country at the world’s most famous song competition. Keep an eye out for additional details as they arise, and in the meantime, watchWill & Harperon Netflix today. A post shared by Hollywood Reporter (@hollywoodreporter) 10.)The winners of the second annualGotham Television Awardshave been announced! The newly created category for “Outstanding Original Films, Broadcast or Streaming” went to the documentaryPee-wee as Himself, which tells the story of the man behind the infamous persona, Paul Reubens. Other LGBTQ winners include Julio Torres for “Outstanding Lead Performance in a Comedy Series” inFantasmasand Ben Whishaw for “Outstanding Supporting Performance in a Drama Series” inBlack Doves. In more award show news, the78th annual Tony Awardshas set the performances for the upcoming ceremony. Hosted by Cynthia Erivo, the original cast ofHamiltonwill reunite to celebrate the show’s 10th anniversary, featuring out stars Ariana DeBose, Jonathan Groff, Andrew Chappelle, Sydney James Harcourt, and more. LGBTQ nominees include Cole Escola, Conrad Ricamora, Paul Tazewell, and Jonathan Groff, among others. Don’t miss the Tony Awards this Sunday at 8pm ET on CBS or Paramount+! A post shared by The Gotham (@thegotham) See more articles fromThe GLAAD Wraphere. You must belogged into post a comment. **Join GLAAD and take action for acceptance.** Facebook Instagram YouTube LinkedIn TikTok Bluesky **The New York Times Continues to Double Down on Biased, Inaccurate Transgender Coverage** The New York Times’ coverage of transgender people and issues has been critiqued for years… As a dynamic media force, GLAAD tackles tough issues to shape the narrative and provoke dialogue that leads to cultural change. Facebook Instagram YouTube LinkedIn TikTok Bluesky For Media Donate Ways to Give GLAAD Media Awards Corporate Partners Privacy Policy State Disclosures Careers Contact Us Type above and pressEnterto search. PressEscto cancel. stay tuned!"}