{"id": 352, "name": "Delo", "domain": "delo.si", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://deloindom.delo.si/vrt-in-zivali/zivali/ali-je-lajanje-psa-ponoci-kaznivo-dejanje-preverili-smo-v-katerih-slovenskih-obcinah-vas-za-to-lahko-doleti-globa", "title": "Ali Je Lajanje Psa Ponoci Kaznivo Dejanje Preverili Smo V Katerih Slovenskih Obcinah Vas Za To Lahko Doleti Globa", "content": "Bivanje Gradnja in obnova Energija in okolje Vrt in živali Podkasti Vrt in živali Okrasni vrtovi Zelenjavni vrtovi Sadovnjaki Eko kotiček Živali **Pozdravljeni!** **Arhitekturni izziv: Bolj pretočen bivalni del** **Lastniki psov, pozor: Tako močno se poleti v mestih segreje asfalt** **Nov gradbeni zakon: Hiše, zgrajene pred letom 1995, bodo avtomatično legalizirane** **Ali je lajanje psa ponoči kaznivo dejanje? Preverili smo, v katerih slovenskih občinah vas za to lahko doleti globa** Lajanjepsa ponoči številnim para živce – tako tistim, ki imajo psa, kot tistim, ki ga nimajo, a živijo v njegovi bližini. A lajež psa v nočnem času ni le neprijetna izkušnja, ampak v nekaterih občinah celo kaznivo dejanje, zaradi katerega lahko kot lastnik plačate tudi globo. **Globa – ja, a ne v vseh primerih** V slovenski zakonodaji ni posebnega zakona, ki bi prepovedal ali kaznoval lajanje psov ponoči, kar pa ne pomeni, da so lastniki psov povsem brez odgovornosti. Zakon namreč določa, da je prekršek vsakršno motenje miru med 22.00 in 6.00, vključno s hrupom, ki bi ga povzročil pes. Kar pomeni, da si lahko zaradi svojega psa nakopljete težave, vendar policija v praksi le redko ukrepa zgolj zaradi lajanja. To se navadno zgodi le, če gre za res dolgotrajno in glasno motnjo. **Vendar pozor - lokalni odloki imajo zadnjo besedo** Veliko pomembnejši od državnega zakona pa so na tem področju lokalni občinski odloki. Nekatere slovenske občine so namreč zelo natančne in imajo v svojih odlokih jasno zapisano, da lajanje psa ponoči ni dovoljeno. Na primer, v občini Log–Dragomer imajo prav poseben odlok, ki prepoveduje lajež med 22.00 in 6.00. Če se pes v tem času večkrat oglaša in to moti sosede, lahko redar napiše globo, ki znaša približno 100 evrov. Podoben odlok so sprejeli tudi v Tržiču, kjer zaradi motečega ponavljajočega se lajanja v nočnem času lahko dobite globo v višini 208 evrov (za fizične osebe). Glede na podatke, dostopne na spletnih straneh slovenskih občin, kazni zaradi nočnega laježa v drugih slovenskih občinah niso posebej predvidene – kljub temu pa lahko sosedje, ki jih lajež vašega psa moti, ukrepajo prek policije, redarjev ali celo civilne poti. Da ne boste imeli težav s sosedi (ali z redarji), je dobro, da ukrepate, še preden pride do konflikta. Foto Onanong Tasanapitak//Shutterstock **Kaj pa pri naših sosedih?** Če se s psom odpravljate na počitnice k našim sosedom, vas bo morda zanimalo, kaj narekuje njihova zakonodaja. Na Hrvaškem je podobno kot v Sloveniji, kjer celovita državna določba, ki bi poenoteno prepovedovala lajež psov v nočnem času, ne obstaja. So pa v Zagrebu z lokalnim odlokom o komunalnem redu določili, da lastniki psov ne smejo povzročati hrupa. Komunalni redarji lahko v tem primeru izrečejo opomin in izdajo denarne kazni. Podobno velja tudi v Avstriji, kjer lahko lastniki psov, katerih ljubljenčki dlje časa lajajo in motijo okoliške prebivalce, prejmejo kazen v višini do 100 evrov. Popolnoma drugače so se tega problema lotili v Italiji, kjer lajanje psa v nočnem času velja za resen prekršek. Po Civilnem zakoniku in lokalnih odlokih lahko lastnik psa, ki ponoči vztrajno laja in moti počitek sosedov, dobi celo do 309 evrov kazni, grozi pa mu lahko tudi zaporna kazen do treh mesecev. Slednje se je namreč že zgodilo na Siciliji, kjer so lastniku psa zaradi laježa dosodili 2 meseca zapora in 500 evrov denarne kazni. Kaj lahko naredite kot lastnik psa?Da ne boste imeli težav s sosedi (ali z redarji), je dobro, da ukrepate, še preden pride do konflikta. Tu je nekaj preprostih, a učinkovitih nasvetov:Utrudite psa čez dan- Pes, ki se dovolj sprehaja in igra, bo ponoči mirneje spal in ne bo lajal ob vsakem šumu.Uredite miren prostor za spanje- Če je le možno, naj pes spi v notranjosti, ne zunaj na balkonu ali terasi, kjer sliši vsako stvar. Manj dražljajev – manj lajanja.Učite ga tišine- Če pes pogosto laja iz navade, poskusite s šolanjem ali pomočjo pasjega inštruktorja. Dobra vzgoja je zlata vredna.Pogovorite se s sosedi- Včasih že pogovor in razlaga, da delate na tem, veliko pomagata. Ljudje lažje potrpijo, če vedo, da situacijo jemljete resno. **Kaj lahko naredite kot lastnik psa?** Da ne boste imeli težav s sosedi (ali z redarji), je dobro, da ukrepate, še preden pride do konflikta. Tu je nekaj preprostih, a učinkovitih nasvetov: Utrudite psa čez dan- Pes, ki se dovolj sprehaja in igra, bo ponoči mirneje spal in ne bo lajal ob vsakem šumu. Uredite miren prostor za spanje- Če je le možno, naj pes spi v notranjosti, ne zunaj na balkonu ali terasi, kjer sliši vsako stvar. Manj dražljajev – manj lajanja. Učite ga tišine- Če pes pogosto laja iz navade, poskusite s šolanjem ali pomočjo pasjega inštruktorja. Dobra vzgoja je zlata vredna. Pogovorite se s sosedi- Včasih že pogovor in razlaga, da delate na tem, veliko pomagata. Ljudje lažje potrpijo, če vedo, da situacijo jemljete resno. **Kaj lahko naredite kot lastnik psa?** Da ne boste imeli težav s sosedi (ali z redarji), je dobro, da ukrepate, še preden pride do konflikta. Tu je nekaj preprostih, a učinkovitih nasvetov: Utrudite psa čez dan- Pes, ki se dovolj sprehaja in igra, bo ponoči mirneje spal in ne bo lajal ob vsakem šumu. Uredite miren prostor za spanje- Če je le možno, naj pes spi v notranjosti, ne zunaj na balkonu ali terasi, kjer sliši vsako stvar. Manj dražljajev – manj lajanja. Učite ga tišine- Če pes pogosto laja iz navade, poskusite s šolanjem ali pomočjo pasjega inštruktorja. Dobra vzgoja je zlata vredna. Pogovorite se s sosedi- Včasih že pogovor in razlaga, da delate na tem, veliko pomagata. Ljudje lažje potrpijo, če vedo, da situacijo jemljete resno. **Sorodni članki** **Lastniki psov, pozor: Tako močno se poleti v mestih segreje asfalt** **Poiskali smo odgovor: Se lahko klop s psa preseli na človeka?** **Se na pot odpravljate s hišnim ljubljenčkom? Strokovnjaki želijo, da veste tole (z res uporabnimi nasveti veterinarke)** **Naročite se na e-novice** **Več iz teme** **Ali je lajanje psa ponoči kaznivo dejanje? Preverili smo, v katerih slovenskih občinah vas za to lahko doleti globa** **Nov gradbeni zakon: Hiše, zgrajene pred letom 1995, bodo avtomatično legalizirane** **Očarljiva hiša, ki je pravo nasprotje sodobnim izčiščenim domovom** **Eko sklad razpisal 36 milijonov evrov: kdo lahko dobi pomoč?** **Ali je lajanje psa ponoči kaznivo dejanje? Preverili smo, v katerih slovenskih občinah vas za to lahko doleti globa** **Očarljiva hiša, ki je pravo nasprotje sodobnim izčiščenim domovom** **Shranjevalne površine: koliko jih potrebujemo, če imamo običajno količino oblačil** **To je razlog, zakaj se okrog potonikinih grmov zbirajo mravlje** **Očarljiva hiša, ki je pravo nasprotje sodobnim izčiščenim domovom** **Shranjevalne površine: koliko jih potrebujemo, če imamo običajno količino oblačil** **To je razlog, zakaj se okrog potonikinih grmov zbirajo mravlje** **Pametno hlajenje, ki ga vodi vaš ritem življenja** **Vrtni polži: Kako se znebiti teh požrešnih škodljivcev** **Sodobne bivalne rešitve: Medprostor kot most med vašim domom in naravo** **Kako rastline izboljšajo ozračje in kako jim pomagamo, da ostanejo zdrave!** **Prihranite do 80 % pri elektriki s pametno samooskrbo** **Kupujete čistilno napravo? Razmišljate tudi o zbiranju brezplačne deževnice?** **Rešitev za vroče dni: klima Panasonic z vrhunsko tehnologijo nanoe™ X** **Izkoristite maj za sajenje paradižnika na prosto** Bivanje Gradnja in obnova Energija in okolje Vrt in živali Podkasti"}