{"id": 801, "name": "KXLH - Helena News", "domain": "kxlh.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kxlh.com/science-and-tech/animals-and-insects/man-gored-by-bison-at-yellowstone-national-park-second-incident-this-year", "title": "Man Gored By Bison At Yellowstone National Park Second Incident This Year", "content": "Menu Local News Montana and Regional News Montana Politics NewsHelena NewsMontana and Regional NewsCoronavirusWe're Open MontanaWildfire WatchBOLO AlertsMontana PoliticsMontana Ag NetworkMilitary Matters Helena News Montana and Regional News Coronavirus We're Open Montana Wildfire Watch BOLO Alerts Montana Politics Montana Ag Network Military Matters Helena News Montana and Regional News Coronavirus We're Open Montana Wildfire Watch BOLO Alerts Montana Politics Montana Ag Network Military Matters VideosPhoto GalleriesOn KXLH Photo Galleries On KXLH Photo Galleries On KXLH About UsClosed CaptioningContact UsNews TeamJobs at KXLHKXLH Apps Closed Captioning Contact Us News Team Jobs at KXLH KXLH Apps Closed Captioning Contact Us News Team Jobs at KXLH KXLH Apps Mug Shots policy Moving Forward On KXLH WeatherToday's ForecastWildfire WatchInteractive RadarDaily ForecastHourly ForecastSTORMTracker BlogLightning TrackerWeather Cameras Today's Forecast Wildfire Watch Interactive Radar Daily Forecast Hourly Forecast STORMTracker Blog Lightning Tracker Weather Cameras Today's Forecast Wildfire Watch Interactive Radar Daily Forecast Hourly Forecast STORMTracker Blog Lightning Tracker Weather Cameras Wildfire Watch CommunityHeart of HelenaContests Heart of Helena Contests Heart of Helena Contests Sports Sign In Newsletters Sign Out Manage Emails Apps Careers Search Weather Sports Montana Politics Positively Montana Contests Find MTN Indian Country On KXLH Scripps National News Montana Ag Network Heart of Helena **Actions** Facebook Tweet Email **Man gored by bison at Yellowstone National Park, second incident this year** A 30-year-old man from New Jersey was gored by a bison at Yellowstone National Park on June 10, according to National Park Officials. This is the second goring incident this year. The man was among a group of visitors at the park that approached the animal too closely, officials said. The incident happened around 9:45 a.m. in the Upper Geyser Basin at Old Faithful. Officials said the man was treated by local medics and his injuries were not life-threatening. The incident is still under investigation. RELATED STORY |Invasive Asian needle ants with potentially deadly sting spreading across multiple states Another individual, a 47-year-old Florida man, was gored by a bison on May 4 in the Lake Village area of the park. His injuries were also minor. On May 4, 2025, a 47-year-old man from Cape Coral, Florida, was injured by a bison in Yellowstone National Park. Officials said there were two reported goring incidents in 2024 and one in 2023. National Park Service officials said bison are territorial and have injured more people in Yellowstone than any other animal. \"They are unpredictable and can run three times faster than humans,\" officials said. Visitors are supposed to stay more than 25 yards away from all large animals — including bison, elk, bighorn sheep, deer, moose, and coyotes — and at least 100 yards away from bears, wolves and cougars. **Sign up for theBreaking News Newsletterand receive up to date information.** **now signed up to receive theBreaking News Newsletter.** News Weather Community Sports Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact kxlhtv explore/tags/kxlh KXLH UCHltmK0FtgpvOb_IFP6obog"}