{"id": 1539, "name": "Voice of OC", "domain": "voiceofoc.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://voiceofoc.org/2025/06/mai-and-nguyen-from-the-pediatric-perspective-orange-countys-polluted-air-is-an-immediate-danger-to-our-childrens-lungs-we-have-a-chance-to-fix-it/", "title": "Mai And Nguyen From The Pediatric Perspective Orange Countys Polluted Air Is An Immediate Danger To Our Childrens Lungs We Have A Chance To Fix It", "content": "This month, you've readarticlesfrom what some dub as \"The Noise of OC.\" Help us amplify critical voices and truths so they aren't just background noise with a tax-deductible donation. Get the essential context on what’s happening behind closed doors and the issues that shape Orange County. Every morning, for free, in your inbox. Δ 🤍 DONATE FREE NEWSLETTER REGIONSOpen dropdown menuCOASTNORTH COUNTYCENTRAL COUNTYSOUTH COUNTY COAST NORTH COUNTY CENTRAL COUNTY SOUTH COUNTY COAST NORTH COUNTY CENTRAL COUNTY SOUTH COUNTY NEWSOpen dropdown menuCOLLEGIATE NEWS SERVICEECONOMYEDUCATIONEMERGENCIES & DISASTERSEQUALITY & EQUITYGOVERNMENTHEALTH & WELLNESSHOUSING & HOMELESSNESSINVESTIGATIVEOUTDOORSPOLITICS & ELECTIONSSAFETY, SECURITY & JUSTICETRANSPORTATIONWATER, POWER & WASTE COLLEGIATE NEWS SERVICE ECONOMY EDUCATION EMERGENCIES & DISASTERS EQUALITY & EQUITY GOVERNMENT HEALTH & WELLNESS HOUSING & HOMELESSNESS INVESTIGATIVE OUTDOORS POLITICS & ELECTIONS SAFETY, SECURITY & JUSTICE TRANSPORTATION WATER, POWER & WASTE COLLEGIATE NEWS SERVICE ECONOMY EDUCATION EMERGENCIES & DISASTERS EQUALITY & EQUITY GOVERNMENT HEALTH & WELLNESS HOUSING & HOMELESSNESS INVESTIGATIVE OUTDOORS POLITICS & ELECTIONS SAFETY, SECURITY & JUSTICE TRANSPORTATION WATER, POWER & WASTE ARTS & CULTUREOpen dropdown menuCULTUREDANCEFOODMUSICTHEATERVISUAL ARTS CULTURE DANCE FOOD MUSIC THEATER VISUAL ARTS CULTURE DANCE FOOD MUSIC THEATER VISUAL ARTS COLUMNS LOCAL LENS INVOLVEMENTOpen dropdown menuCOMMUNITY OPINIONPRESS RELEASESSUBMIT A COMMUNITY OPINION PIECE COMMUNITY OPINION PRESS RELEASES SUBMIT A COMMUNITY OPINION PIECE COMMUNITY OPINION PRESS RELEASES SUBMIT A COMMUNITY OPINION PIECE ABOUTOpen dropdown menuABOUT USWAYS TO GIVEINSIDE THE NEWSROOMMISSION & VALUESFUNDINGIMPACT & HONORSSTAFF & CONTACT USCIVIC ENGAGEMENTARCHIVES ABOUT US WAYS TO GIVE INSIDE THE NEWSROOM MISSION & VALUES FUNDING IMPACT & HONORS STAFF & CONTACT US CIVIC ENGAGEMENT ARCHIVES ABOUT US WAYS TO GIVE INSIDE THE NEWSROOM MISSION & VALUES FUNDING IMPACT & HONORS STAFF & CONTACT US CIVIC ENGAGEMENT ARCHIVES Facebook Bluesky X Instagram Apple News Google News Facebook Bluesky X Instagram Apple News Google News Voice of OC Orange County's Nonprofit Newsroom 🤍 DONATE FREE NEWSLETTER REGIONSOpen dropdown menuCOASTNORTH COUNTYCENTRAL COUNTYSOUTH COUNTY COAST NORTH COUNTY CENTRAL COUNTY SOUTH COUNTY COAST NORTH COUNTY CENTRAL COUNTY SOUTH COUNTY NEWSOpen dropdown menuCOLLEGIATE NEWS SERVICEECONOMYEDUCATIONEMERGENCIES & DISASTERSEQUALITY & EQUITYGOVERNMENTHEALTH & WELLNESSHOUSING & HOMELESSNESSINVESTIGATIVEOUTDOORSPOLITICS & ELECTIONSSAFETY, SECURITY & JUSTICETRANSPORTATIONWATER, POWER & WASTE COLLEGIATE NEWS SERVICE ECONOMY EDUCATION EMERGENCIES & DISASTERS EQUALITY & EQUITY GOVERNMENT HEALTH & WELLNESS HOUSING & HOMELESSNESS INVESTIGATIVE OUTDOORS POLITICS & ELECTIONS SAFETY, SECURITY & JUSTICE TRANSPORTATION WATER, POWER & WASTE COLLEGIATE NEWS SERVICE ECONOMY EDUCATION EMERGENCIES & DISASTERS EQUALITY & EQUITY GOVERNMENT HEALTH & WELLNESS HOUSING & HOMELESSNESS INVESTIGATIVE OUTDOORS POLITICS & ELECTIONS SAFETY, SECURITY & JUSTICE TRANSPORTATION WATER, POWER & WASTE ARTS & CULTUREOpen dropdown menuCULTUREDANCEFOODMUSICTHEATERVISUAL ARTS CULTURE DANCE FOOD MUSIC THEATER VISUAL ARTS CULTURE DANCE FOOD MUSIC THEATER VISUAL ARTS COLUMNS LOCAL LENS INVOLVEMENTOpen dropdown menuCOMMUNITY OPINIONPRESS RELEASESSUBMIT A COMMUNITY OPINION PIECE COMMUNITY OPINION PRESS RELEASES SUBMIT A COMMUNITY OPINION PIECE COMMUNITY OPINION PRESS RELEASES SUBMIT A COMMUNITY OPINION PIECE ABOUTOpen dropdown menuABOUT USWAYS TO GIVEINSIDE THE NEWSROOMMISSION & VALUESFUNDINGIMPACT & HONORSSTAFF & CONTACT USCIVIC ENGAGEMENTARCHIVES ABOUT US WAYS TO GIVE INSIDE THE NEWSROOM MISSION & VALUES FUNDING IMPACT & HONORS STAFF & CONTACT US CIVIC ENGAGEMENT ARCHIVES ABOUT US WAYS TO GIVE INSIDE THE NEWSROOM MISSION & VALUES FUNDING IMPACT & HONORS STAFF & CONTACT US CIVIC ENGAGEMENT ARCHIVES Trending OC Corruption Sheriffs Union Strikes **Mai and Nguyen: From the Pediatric Perspective, Orange County’s Polluted Air is an Immediate Danger to Our Children’s Lungs. We Have a Chance to Fix It.** **Share this:** Click to share on X (Opens in new window)X Click to share on Bluesky (Opens in new window)Bluesky Click to share on Facebook (Opens in new window)Facebook Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Reddit (Opens in new window)Reddit Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print We represent a volunteer group of pediatricians and future pediatricians (premedical and medical students) who work together to ensure the health of our patients.The American Academy of Pediatricscalls on us to speak up for children at the local government level when their health is at risk due to air pollution. Orange County’s air quality is the worst in the United States—and our children are paying the price. Alongside Los Angeles and Long Beach, our region consistently ranks worst in the nation for ozone pollution, according to the American Lung Association, which gives us afailinggrade year after year. As pediatricians, we see firsthand how air pollution damages pediatric lungs — by triggering asthma exacerbations, causing missed school days for children, and increasing children’s susceptibility to viral and bacterial pneumonias. The root of many of these issues is the polluted air in Orange County. Fortunately in the next few weeks, we have an amazing opportunity for change! On June 6, the South Coast Air Quality Management District (SCAQMD) will vote on new standards that target one of the region’s most dangerous and overlooked sources of air pollution: the gas-powered water heaters and furnaces inside our homes. What happens at this meeting will determine the future health of our children. Indoor air pollution affects pediatric lungs, and poor indoor air quality leads to poor pediatric health. The gas appliances we use hide in plain sight—yet they produceseven times more smog-forming nitrogen oxide (NOx) pollutionthan the region’s power plants. The longer we keep using gas appliances, the longer our children will suffer disproportionately worse health compared to other regions. Burning fossil fuels in homes and buildings contributes to anestimated 76,000 asthma attacks, 30,000 missed school days, 130 premature deaths, and $2 billion in health-related costs each year. Those aren’t just statistics—they’re our children. These are the kids growing up in our neighborhoods who deserve a chance to thrive without having their growing lungs strained by dirty air. They are the kids coming to our pediatric clinics with worsening health. In Orange County alone,40,000 children and 219,000 adults live with asthma. These numbers should alarm every parent—and every policymaker. But these health impacts go far beyond asthma. Air pollution affects adult patients as well by exacerbating heart disease, lung disease, and pregnancy complications. Here’s what the SCAQMD rules would do: Starting in 2027, manufacturers would need to ensure that 30% of the water heaters and furnaces they sell are zero-emission models, such as electric heat pumps. That percentage would gradually increase to 90% by 2036. Companies that don’t meet the targets would pay a compliance fee to fund the Go Zero program, which provides rebates and installation support to help families and small businesses upgrade to clean, non-polluting options. From local politics to the people and policies shaping our daily lives—it’s all in The Morning Report. Don’t miss out on this free daily email. Δ These upgrades won’t just clean up our air—they’ll actually save families money! Heat pumps, which provide both heating and cooling in one system, are far more energy-efficient than gas-powered appliances. For households that already use central air and are on electrification-friendly utility rates, switching to heat pumps can cut utility bills by around$370 a year! Over time, those savings add up—putting money back into parents’ pockets while reducing pollution in our neighborhoods. Despite these public health and financial benefits, many Orange County elected officials oppose these common sense standards. According toVoice of OCreporting, local leaders in cities like Anaheim, Huntington Beach, and Yorba Linda have passed resolutions opposing the SCAQMD’s proposed rules. As practicing pediatricians, we are disheartened. Rather than championing cleaner air and healthier futures, some local leaders are choosing to maintain the status quo—a status quo that leaves children and our OC families bearing a disproportionate burden of poor lung health. Orange County lags behind other areas on health and environmental policy.26 of our 34 cities have no Climate Action Plan, leaving residents more vulnerable to extreme heat, poor air, and environmental injustice. These appliance standards offer a step forward—but they’ll only work if we let them. Polluted air is not normal and we can do better for our children and community. We have the tools to fix it, namely passing the proposed SCAQMD rules. The SCAQMD’s vote on June 6 is more than a policy decision. It’s a clinical decision. Will our community continue to allow OC’s children to breathe harmful air so outdated gas appliances can stay in use? Or will we take this opportunity to build a cleaner, healthier future? We urge the SCAQMD to vote yes on these standards. We urge our OC neighbors and leaders to stand up for clean air and public health. Our kids’ pulmonary health depends on it. Wayne Maiis a lifelong resident of OC and a graduate of Tesoro High School and UC San Diego. Wayne is applying to medical school, and is the Student-Director of San Diego Pediatricians for Clean Air. Dr. Vi Thuy Nguyenearned her MD from Harvard Medical School and completed pediatric training at Massachusetts General Hospital. She has practiced general pediatrics in Southern California for over 15 years. She is the Chair of the American Academy of Pediatrics, California State Government Affairs Expert Committee on Environmental Health and Climate Change, and is also the Founder of San Diego Pediatricians for Clean Air. Opinions expressed in community opinion pieces belong to the authors and not Voice of OC. Voice of OC is interested in hearing different perspectives and voices. If you want to weigh in on this issue or others pleaseemailopinions@voiceofoc.org. **It's our birthday!Help us raise $16,000 this June.** For 16 years, Voice of OC has deliveredfearless, non-partisan reporting that tracks the shakeups, deals, and decisions that impactyour wallet, your home, and your community. No ads. No paywalls. No spin. Just the truth. And none of it happens without readers like you.Join us by making a tax-deductible contribution today. **Related** **OC’s Nonprofit & Nonpartisan Newsroom** MISSION & VALUES FUNDING & PARTNERSHIPS IMPACT & HONORS STAFF & CONTACT US CIVIC ENGAGEMENT ARCHIVES Facebook Bluesky X Instagram Apple News Google News **** **** ****"}