{"id": 1328, "name": "Task and Purpose", "domain": "taskandpurpose.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://taskandpurpose.com/military-life/transgender-ban-bree-fram-space-force/", "title": "Transgender Ban Bree Fram Space Force", "content": "Check out our latest YouTube videos. Watch here 🎥 NewsAnalysisMilitary BranchesOpinionAround the World Analysis Military Branches Opinion Around the World Analysis Military Branches Opinion Around the World CultureEntertainmentHumorMandatory Fun Entertainment Humor Mandatory Fun Entertainment Humor Mandatory Fun Military LifeActive DutyEnlistingResourcesVeteransCareer Center Active Duty Enlisting Resources Veterans Career Center Active Duty Enlisting Resources Veterans Career Center HistoryHistorical FiguresPast Conflicts Historical Figures Past Conflicts Historical Figures Past Conflicts Tech & Tactics Video **US military’s highest ranking transgender officer says seperation process is broken** ByNicholas Slayton PublishedJun 9, 2025 4:02 PM EDT The highest-ranking transgender officer in the Department of Defense said that the military’s transgender separation policy is going to leave gaps in units as skilled service members are removed from the armed forces. U.S. Space Force Col. Bree Fram said that as of June 7, she is on administrative leave from the service, pending separation, as a result of the Pentagon’s ban on transgender troops. She told Task & Purpose Monday that she is at the end of her more than two-decade career in the armed forces. She spoke to Task & Purpose in her personal capacity, not in reflection of Pentagon policy. Fram, an astronautical engineer who previously served in the Air Force before moving to Space Force in 2021, was serving as director of requirements and integration for Space Force. In posts on social media, she said that her last official act was to pin medals on three people who served under her. The Department of Defense officials say they believe there are approximately 4,200 service members with gender dysphoria in the ranks, and that as of May 15, 1,000 had come forward to begin a so-called “voluntary” separation process. Others who may later be identified and “involuntarily” separated could receive smaller compensation packages, officials say. “People are on pins and needles. We’re asking each other ‘what do you know? What do we all know?’ It’s been really difficult,” she told Task & Purpose on Monday. “I want to stress that although this is labeled voluntarily, neither the ‘voluntary’ or ‘involuntary’ process is a choice, or what anyone wanted or would have done.” Fram joined the military after Sept. 11, 2001, and came out as transgender in 2016, the same day that the Department of Defense lifted its ban on transgender service. She spent nearly 20 years in the Air Force, then moved to the Space Force in 2021. **Get Task & Purpose in Your Inbox** Get Task & Purpose in Your Inbox Get Task & Purpose in Your Inbox Sign up for Task & Purpose Today to get the latest in military news each morning, and The Pentagon Rundown for a weekly breakdown of the biggest stories every Friday. By signing up you agree to ourTerms of ServiceandPrivacy Policy. Transgender service members, Fram said, “have been operating in a vacuum,” and are looking for more information from military leadership. The military’s involuntary separation process fortransgender troops, which started on June 7, remains vague on details. Members in the reserves have until July 7 to choose to go through the voluntary separation process. The Air Force andNavyhave said that troops with certain years of service are eligible for early retirement in this process. **Dispute over negative separation codes** A technical but life-altering issue for troops, said Fram, is the “separation code” under which they will leave the service. Most troops leaving the military are granted an “honorable discharge,” a separation code that indicates they left in good standing with no serious discipline issues or professional failures. Though the Pentagon has, at times, said that transgender troops with clean records would receive honorable discharges, but Fram said that’s no longer clear. AMay 15 memofrom the Office of the Under Secretary of Defense for Personnel and Readiness said transgender enlisted personnel would be separated under the JFF separation code, meaning it was done by secretarial authority. Officers would be given a JDK code, which indicates on their service record that “their continued service is not clearly consistent with the interests of national security” — a black mark for troops in the job market, as it could prevent them from getting or maintaining security clearances that are required for certain jobs. Rachel VanLandingham, a retired Air Force lieutenant colonel and JAG, told Task & Purpose that the JDK separation code is usually reserved for matters such as mishandling classified information. Fram said that the main concern for them has been uncertainty over what is next. “Anyone navigating a transition out of the military is put in a challenging position, but they have this extra burden of being labeled as dishonorable or liars,” she said. Fram also noted that the separations will cause disruptions for ongoing operations as troops who are qualified for specific roles are “suddenly gone.” Fram’s work focused on researching what capabilities and “fight critical” systems the Space Force will need to field in the next decade. It’s specialized work drawing on her years of experience, which others in Space Force don’t have, she said. Fram noted that units that have open transgender personnel have tried to do some planning to fill gaps left by separation, but replacing thousands of people across the military “is not something that happens tomorrow.” “The impact of this is not just on today. It stretches far into the future,” she said. A few days before her final acts in her role, at a meeting with fellow officers, her colleagues were stunned to learned she was leaving the service and all shook her hand as the event broke up. “We served with our friends, our colleagues, with people who respected us, and now that’s just missing,” she said. **The latest on Task & Purpose** A Marine Corpsreply-all email apocalypsehas an incredible real-life ending Armyshuts downits sole active-duty information operations command Army plans to close more than20 base museumsin major reduction FormerGreen Beretnominated to top Pentagon position to oversee special ops The Navy’s new recruiting commercial puts the ‘dirt wars’ in the past **Task & Purpose Video** Task & Purpose Video Task & Purpose Video Each week on Tuesdays and Fridays our team will bring you analysis of military tech, tactics, and doctrine. **Nicholas Slayton** **Contributing Editor** Nicholas Slayton is a Contributing Editor for Task & Purpose. In addition to covering breaking news, he writes about history, shipwrecks, and the military’s hunt for unidentified anomalous phenomenon (formerly known as UFOs). Military Branches News Space Force **Latest Articles** **Marines tasked with LA mission have not yet completed use of force and nonlethal trainingMarines tasked with LA mission have not yet completed use of force and nonlethal training** **Marines tasked with LA mission have not yet completed use of force and nonlethal trainingMarines tasked with LA mission have not yet completed use of force and nonlethal training** ByJeff Schogol **Sailors who can’t deploy will be moved to empty jobs under Navy programSailors who can’t deploy will be moved to empty jobs under Navy program** **Sailors who can’t deploy will be moved to empty jobs under Navy programSailors who can’t deploy will be moved to empty jobs under Navy program** ByPatty Nieberg **More in Military Life** **Transgender troops say Pentagon is causing chaos with sudden policy reversalTransgender troops say Pentagon is causing chaos with sudden policy reversal** **Transgender troops say Pentagon is causing chaos with sudden policy reversalTransgender troops say Pentagon is causing chaos with sudden policy reversal** ByNicholas Slayton **The military’s only search and rescue dog has retiredThe military’s only search and rescue dog has retired** **The military’s only search and rescue dog has retiredThe military’s only search and rescue dog has retired** ByNicholas Slayton **Ranger legend Col. Ralph Puckett honored at U.S. CapitolRanger legend Col. Ralph Puckett honored at U.S. Capitol** **Ranger legend Col. Ralph Puckett honored at U.S. CapitolRanger legend Col. Ralph Puckett honored at U.S. Capitol** ByPatty Nieberg **U.S. Army Vet and Ranger school graduate killed fighting in UkraineU.S. Army Vet and Ranger school graduate killed fighting in Ukraine** **U.S. Army Vet and Ranger school graduate killed fighting in UkraineU.S. Army Vet and Ranger school graduate killed fighting in Ukraine** ByJeff Schogol **Troops caught up by anti-gay UCMJ rules will get White House pardonsTroops caught up by anti-gay UCMJ rules will get White House pardons** **Troops caught up by anti-gay UCMJ rules will get White House pardonsTroops caught up by anti-gay UCMJ rules will get White House pardons** **Top U.S. special ops units held a major exercise off Alaska, 45 miles from RussiaTop U.S. special ops units held a major exercise off Alaska, 45 miles from Russia** **Top U.S. special ops units held a major exercise off Alaska, 45 miles from RussiaTop U.S. special ops units held a major exercise off Alaska, 45 miles from Russia** ByJoshua Skovlund **How to ace U.S. Army Basic Combat TrainingHow to ace U.S. Army Basic Combat Training** **How to ace U.S. Army Basic Combat TrainingHow to ace U.S. Army Basic Combat Training** ByJoshua Skovlund **In first victory for new office, a soldier recalled to duty pleads guilty to abusing stepdaughterIn first victory for new office, a soldier recalled to duty pleads guilty to abusing stepdaughter** **In first victory for new office, a soldier recalled to duty pleads guilty to abusing stepdaughterIn first victory for new office, a soldier recalled to duty pleads guilty to abusing stepdaughter** ByPatty Nieberg **NEWSLETTER SIGNUP** Sign up for Task & Purpose Today to get the latest in military news each morning, and The Pentagon Rundown for a weekly breakdown of the biggest stories every Friday. By signing up you agree to ourTerms of ServiceandPrivacy Policy. NewsAnalysisMilitary BranchesAround the World **News** Analysis **Analysis** Military Branches **Military Branches** Around the World **Around the World** **News** **News** Analysis **Analysis** **Analysis** **Analysis** Military Branches **Military Branches** **Military Branches** **Military Branches** Around the World **Around the World** **Around the World** **Around the World** CultureEntertainmentHumorMandatory Fun **Culture** Entertainment **Entertainment** Humor **Humor** Mandatory Fun **Mandatory Fun** **Culture** **Culture** Entertainment **Entertainment** **Entertainment** **Entertainment** Humor **Humor** **Humor** **Humor** Mandatory Fun **Mandatory Fun** **Mandatory Fun** **Mandatory Fun** Military LifeActive DutyEnlistingResourcesVeteransCareer Center **Military Life** Active Duty **Active Duty** Enlisting **Enlisting** Resources **Resources** Veterans **Veterans** Career Center **Career Center** **Military Life** **Military Life** Active Duty **Active Duty** **Active Duty** **Active Duty** Enlisting **Enlisting** **Enlisting** **Enlisting** Resources **Resources** **Resources** **Resources** Veterans **Veterans** **Veterans** **Veterans** Career Center **Career Center** **Career Center** **Career Center** HistoryHistorical FiguresPast Conflicts **History** Historical Figures **Historical Figures** Past Conflicts **Past Conflicts** **History** **History** Historical Figures **Historical Figures** **Historical Figures** **Historical Figures** Past Conflicts **Past Conflicts** **Past Conflicts** **Past Conflicts** Tech & Tactics **Tech & Tactics** **Tech & Tactics** **Tech & Tactics** MoreGot A Tip?About Task & PurposeTerms & ConditionsPrivacy PolicySitemap **More** Got A Tip? **Got A Tip?** About Task & Purpose **About Task & Purpose** Terms & Conditions **Terms & Conditions** Privacy Policy **Privacy Policy** Sitemap **Sitemap** **More** **More** Got A Tip? **Got A Tip?** **Got A Tip?** **Got A Tip?** About Task & Purpose **About Task & Purpose** **About Task & Purpose** **About Task & Purpose** Terms & Conditions **Terms & Conditions** **Terms & Conditions** **Terms & Conditions** Privacy Policy **Privacy Policy** **Privacy Policy** **Privacy Policy** Sitemap **Sitemap** **Sitemap** **Sitemap** **FOLLOW US** **DISCLAIMER(S)** Articles may contain affiliate links which enable us to share in the revenue of any purchases made.Registration on or use of this site constitutes acceptance of our Terms of Service.© 2025Recurrent. All rights reserved."}