{"id": 1729, "name": "Healing Oracle", "domain": "healingoracle.ch", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "very-low", "questionable": null, "url": "https://healingoracle.ch/2017/08/27/how-marijuana-may-treat-aggressive-brain-cancer-successful-treatment-reinforces-the-potential-role-of-cannabinoids-in-the-field-of-oncology/", "title": "How Marijuana May Treat Aggressive Brain Cancer Successful Treatment Reinforces The Potential Role Of Cannabinoids In The Field Of Oncology", "content": "HomeArticlesImmunotherapyAutismFoodCancerVaccinesCannabis Oil (CBD)GeneralNewsletterContact Us Home ArticlesImmunotherapyAutismFoodCancerVaccinesCannabis Oil (CBD)GeneralNewsletter Immunotherapy Autism Food Cancer Vaccines Cannabis Oil (CBD) General Newsletter Contact Us Home ArticlesImmunotherapyAutismFoodCancerVaccinesCannabis Oil (CBD)GeneralNewsletter Immunotherapy Autism Food Cancer Vaccines Cannabis Oil (CBD) General Newsletter Immunotherapy Autism Food Cancer Vaccines Cannabis Oil (CBD) General Newsletter Contact Us Maryjayne 27/08/2017 **How Marijuana May Treat Aggressive Brain Cancer Successful treatment ‘reinforces the potential role of cannabinoids in the field of oncology.’** **How Marijuana Treats Aggressive Brain Cancer:** **Successful treatment ‘reinforces the potential role of cannabinoids in the field of oncology.’** RELATED STORY:Can Marijuana Really Cure Cancer? Here’s The Science **RELATED STORY:Can Marijuana Really Cure Cancer? Here’s The Science** **RELATED STORY:Can Marijuana Really Cure Cancer? Here’s The Science** INSTRUCTIVE INFO:The Beginners Guide on How to Grow Weed at Home in 10 Easy Steps **INSTRUCTIVE INFO:The Beginners Guide on How to Grow Weed at Home in 10 Easy Steps** **INSTRUCTIVE INFO:The Beginners Guide on How to Grow Weed at Home in 10 Easy Steps** According to the study, patients with documented recurrent GBM treated with THC:CBD had an 83 percent one year survival rate compared with 53 percent for patients taking a placebo. Said Professor Susan Short, principal investigator of the study: “The findings from this well-designed controlled study suggest that the addition of a combination of THC and CBD to patients on dose-intensive temozolomide produced relevant improvements in survival compared with placebo and this is a good signal of potential efficacy. Moreover, the cannabinoid medicine was generally well tolerated. These promising results are of particular interest as the pharmacology of the THC:CBD product appears to be distinct from existing oncology medications and may offer a unique and possibly synergistic option for future glioma treatment.” See related articles by cancer researcher and practitioner of almost 2 decades.https://healingoracle.ch/category/cannabis-oil-cbd/ Here is a helpful link: And as featured above: **The Beginners Guide on How to Grow Weed at Home in 10 Easy Steps** :https://plantsily.com/ PURCHASING FULL SPECTRUM CANNABIS OIL:Should you need to purchase organic full spectrum oil, we know of dispatchers worldwide. Cancer,Cannabis Oil (CBD) brain cancer,cancer,cannabis,cannabis and cancer About Healing OracleThe Healing Oracle team is made up of a group of unpaid volunteers. Collectively we share the same interests and goals and comprise of decades of medical and holistic experience.Our mission is to spread our knowledge and experience of the medical world, from both sides of the so called divide between holistic and mainstream practices. There is good and bad on both sides and we hope to unite the best of both worlds.Please read our philosophy, here in this article from MD Fermin Celma The Healing Oracle team is made up of a group of unpaid volunteers. Collectively we share the same interests and goals and comprise of decades of medical and holistic experience.Our mission is to spread our knowledge and experience of the medical world, from both sides of the so called divide between holistic and mainstream practices. There is good and bad on both sides and we hope to unite the best of both worlds.Please read our philosophy, here in this article from MD Fermin Celma Our mission is to spread our knowledge and experience of the medical world, from both sides of the so called divide between holistic and mainstream practices. There is good and bad on both sides and we hope to unite the best of both worlds.Please read our philosophy, here in this article from MD Fermin Celma Please read our philosophy, here in this article from MD Fermin Celma The Healing Oracle team is made up of a group of unpaid volunteers. Collectively we share the same interests and goals and comprise of decades of medical and holistic experience.Our mission is to spread our knowledge and experience of the medical world, from both sides of the so called divide between holistic and mainstream practices. There is good and bad on both sides and we hope to unite the best of both worlds.Please read our philosophy, here in this article from MD Fermin Celma Our mission is to spread our knowledge and experience of the medical world, from both sides of the so called divide between holistic and mainstream practices. There is good and bad on both sides and we hope to unite the best of both worlds.Please read our philosophy, here in this article from MD Fermin Celma Please read our philosophy, here in this article from MD Fermin Celma Our mission is to spread our knowledge and experience of the medical world, from both sides of the so called divide between holistic and mainstream practices. There is good and bad on both sides and we hope to unite the best of both worlds.Please read our philosophy, here in this article from MD Fermin Celma Please read our philosophy, here in this article from MD Fermin Celma Please read our philosophy, here in this article from MD Fermin Celma You must belogged into post a comment. **Language** **CATEGORIES** Ancient Medicine Autism Breaking News! Breast Cancer Cancer Cannabis Oil (CBD) coronavirus Dental DNA Dogs epilepsy Farm and Agriculture Fiona O'Leary Food and Health General Immune boosting recipes Medicine Mental Physical Health MicroBiology Newsletters Pharmaceutical Industry Public Posts Show Archives Social Media Spiritual Stem cells Vaccines VDTP **Popular Posts** CDC forced to release documents showing they Knew Vaccine Preservative Causes Autism.30/04/2017 30/04/2017 30/04/2017 How Marijuana May Treat Aggressive Brain Cancer Successful treatment ‘reinforces the potential role of cannabinoids in the field of oncology.’27/08/2017 27/08/2017 27/08/2017 Orgasms are a medicine ladies. Here is the science31/01/2018 31/01/2018 31/01/2018 Carboxylation: What It Is, & Why You Should Decarb Your Weed02/05/2017 02/05/2017 02/05/2017 More Doctors Confessing To Intentionally Diagnosing Healthy People With Cancer To Make Money30/08/2017 30/08/2017 30/08/2017 © Copyrights 2014 - 2023. All Rights Reserved. Designed by"}