{"id": 1224, "name": "Science Media Centre", "domain": "sciencemediacentre.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.sciencemediacentre.org/expert-reaction-to-study-looking-at-the-association-between-prescribed-use-of-common-psychiatric-medications-and-the-risk-and-progression-of-amyotrophic-lateral-sclerosis-als/", "title": "Expert Reaction To Study Looking At The Association Between Prescribed Use Of Common Psychiatric Medications And The Risk And Progression Of Amyotrophic Lateral Sclerosis Als", "content": "working with usfor journalistsfor press officersfor scientists for journalists for press officers for scientists for journalists for press officers for scientists about usstaffgovernanceinternsfundingjobs staff governance interns funding jobs staff governance interns funding jobs publicationspublications for journalistspublications for press officerspublications for scientistspublications about the Science Media Centresubmissions to committees and inquiriesfoundational documents publications for journalists publications for press officers publications for scientists publications about the Science Media Centre submissions to committees and inquiries foundational documents publications for journalists publications for press officers publications for scientists publications about the Science Media Centre submissions to committees and inquiries foundational documents international SMCsa pilot SMC for Ireland a pilot SMC for Ireland a pilot SMC for Ireland contact us working with usworking with us homefor journalistsfor press officersfor scientists working with us home for journalists for press officers for scientists working with us home for journalists for press officers for scientists about usabout us homestaffgovernanceinternsfundingjobs about us home staff governance interns funding jobs about us home staff governance interns funding jobs publicationspublications homefor journalistsfor press officersfor scientistsabout the Science Media Centresubmissions to committees and inquiriesfoundational documents publications home for journalists for press officers for scientists about the Science Media Centre submissions to committees and inquiries foundational documents publications home for journalists for press officers for scientists about the Science Media Centre submissions to committees and inquiries foundational documents international SMCsa pilot SMC for Ireland a pilot SMC for Ireland a pilot SMC for Ireland contact us **June 4, 2025** **expert reaction to study looking at the association between prescribed use of common psychiatric medications and the risk and progression of amyotrophic lateral sclerosis (ALS)** A study published inJAMA Network Openlooks at the association between psychiatric medication use and the risk of amyotrophic lateral sclerosis (ALS) progression.Prof Ammar Al-Chalabi, Professor of Neurology and Complex Disease Genetics, King’s College London (KCL), said:“This is an interesting study, well carried out and leveraging the important Scandinavian health registers. There are two points to make:The associated effect on the risk of disease is small except in the year immediately before diagnosis (when there are symptoms of ALS/MND already). At most it represents a 25% increase in relative risk, which for a condition with a 1 in 300 lifetime risk, is not a big change.Association is not causation. That is especially important here. We already know that some of the genetic variants that nudge people towards schizophrenia for example, overlap with variants that nudge people towards ALS (the authors talk about this in the Introduction and cite the relevant paper). The same for other neuropsychiatric conditions – the authors do acknowledge this to some extent in the limitations section, when they talk about C9orf72. So it may not be use of the medication that increases ALS risk, but that the need for the medication is a signal that someone is already at increased genetic risk. Either interpretation fits the results.”Dr Brian Dickie, Chief Scientist, MND Association (Motor Neurone Disease Association), said:“The findings from this well performed but relatively small study are consistent with previous research from other investigators which indicates that ALS and schizophrenia may have some common genetic elements, and also with other research indicating increased cases of psychiatric illness amongst relatives of people diagnosed with ALS when compared with the general population. As people with psychiatric symptoms will more likely be prescribed relevant medication, these latest findings are not surprising in themselves.“The authors correctly seek to avoid over-interpretation of the results, stressing they have identified “an association”. They therefore veer away from any implication that these medications can cause or exacerbate ALS. In order to drill down further into these findings, future studies will need to incorporate more genetic data, as this would help address a number of potential confounding factors.“The most common genetic risk factor for ALS (a repeat expansion in the C9orf72 gene) originated in Scandinavia and therefore is particularly prevalent within the Scandinavian population. It is also the most common genetic risk factor for frontotemporal dementia, as well as possibly other neurological conditions, so a study in the Swedish population will most likely have a higher proportion of people with this particular genetic form of the disease. Not only would higher use of psychiatric medication be likely, but this genetic form is also linked with faster progression and shorter survival, which could explain the association between psychiatric medication and more aggressive disease.“A further potential factor linked to the higher prevalence of familial ALS in Scandinavia is that there may be much greater awareness of the genetic risk of ALS in families where a member has been diagnosed with ALS. Other family members may therefore exhibit anxiety and depression, especially as they start to approach the age at which their relatives were diagnosed.”Comments provided by our friends at the Australian SMC:Professor Bryce Vissel, Head of the Neuroscience and Regenerative Medicine Program at St Vincent’s Hospital Sydney, said:“Depression and anxiety are common conditions, while ALS is rare.“Psychiatric disorders such as depression and anxiety are not unusual in people who are later diagnosed with MND or ALS. But because these mental health issues are so common — and ALS is so rare — having depression or anxiety does not mean you are likely to develop ALS.“It’s far more likely that your symptoms are just what they seem. They should be treated for what they are, not feared as signs of something more serious — which is very uncommon.“We should treat depression and anxiety as depression and as anxiety — not as a warning sign for ALS in most people.“This study does not suggest the treatments cause ALS. Rather, it’s possible that early psychiatric symptoms — such as depression — are part of the disease itself. We call this a ‘prodrome’. That’s very different.”Professor Anthony Hannan, researcher at the Florey Institute of Neuroscience and Mental Health, said:“This new research article in JAMA Network Open adds to the evidence linking some psychiatric conditions to ALS, the most common form of motor neuron disease (MND). It should be noted that this study only addresses correlation, not causation (‘cause and effect’).“Considering that the psychiatric medications linked to MND have very diverse pharmacology (and mechanisms of action), it is extremely unlikely that each of these medications directly contributes to the risk of MND.“What is more likely is that the findings reflect associations between psychiatric symptoms and risk of MND (independent of medication). This is consistent with previous studies, including those involving genetics, which link MND to frontotemporal dementia, a neurodegenerative disease where psychiatric symptoms are often prominent. It should be noted that the present study only involved 1057 ALS/MND patients (and a larger number of control subjects) in Sweden from 2015-2023.“It will be important to follow up these findings with larger studies internationally, which also have comprehensive genetic profiling and other biomarkers (for both neurological and psychiatric disorders). Such future studies could inform new approaches to delay the onset of, and treat MND, and its associated neurological (and sometimes psychiatric) symptoms. Considering that this devastating disorder is currently incurable, and usually kills patients within a few years of diagnosis, any new approaches to help sufferers and their families are urgently needed.”‘Use of Common Psychiatric Medications and Risk and Prognosis of Amyotrophic Lateral Sclerosis’ by Charilaos Chourpiliadiset al.was published inJAMA Network Openat 16:00 UK time Wednesday 4 June 2025.DOI: 10.1001/jamanetworkopen.2025.14437Declared interestsDr Ammar Al-Chalabi:I know two of the authors well personally, Fang Fang and Caroline Ingre. In fact I am at a conference all week with Caroline. I consult for many pharmaceutical companies with the funds going to my research accounts at King’s, not to me personally. I am co-Director of the UK MND Research Institute.Dr Brian Dickie:No CoI’s.Professor Anthony Hannan:has not declared any conflicts of interest.Professor Bryce Vissel:has not declared any conflicts of interest. A study published inJAMA Network Openlooks at the association between psychiatric medication use and the risk of amyotrophic lateral sclerosis (ALS) progression. Prof Ammar Al-Chalabi, Professor of Neurology and Complex Disease Genetics, King’s College London (KCL), said: “This is an interesting study, well carried out and leveraging the important Scandinavian health registers. There are two points to make: The associated effect on the risk of disease is small except in the year immediately before diagnosis (when there are symptoms of ALS/MND already). At most it represents a 25% increase in relative risk, which for a condition with a 1 in 300 lifetime risk, is not a big change. Association is not causation. That is especially important here. We already know that some of the genetic variants that nudge people towards schizophrenia for example, overlap with variants that nudge people towards ALS (the authors talk about this in the Introduction and cite the relevant paper). The same for other neuropsychiatric conditions – the authors do acknowledge this to some extent in the limitations section, when they talk about C9orf72. So it may not be use of the medication that increases ALS risk, but that the need for the medication is a signal that someone is already at increased genetic risk. Either interpretation fits the results.” Dr Brian Dickie, Chief Scientist, MND Association (Motor Neurone Disease Association), said: “The findings from this well performed but relatively small study are consistent with previous research from other investigators which indicates that ALS and schizophrenia may have some common genetic elements, and also with other research indicating increased cases of psychiatric illness amongst relatives of people diagnosed with ALS when compared with the general population. As people with psychiatric symptoms will more likely be prescribed relevant medication, these latest findings are not surprising in themselves. “The authors correctly seek to avoid over-interpretation of the results, stressing they have identified “an association”. They therefore veer away from any implication that these medications can cause or exacerbate ALS. In order to drill down further into these findings, future studies will need to incorporate more genetic data, as this would help address a number of potential confounding factors. “The most common genetic risk factor for ALS (a repeat expansion in the C9orf72 gene) originated in Scandinavia and therefore is particularly prevalent within the Scandinavian population. It is also the most common genetic risk factor for frontotemporal dementia, as well as possibly other neurological conditions, so a study in the Swedish population will most likely have a higher proportion of people with this particular genetic form of the disease. Not only would higher use of psychiatric medication be likely, but this genetic form is also linked with faster progression and shorter survival, which could explain the association between psychiatric medication and more aggressive disease. “A further potential factor linked to the higher prevalence of familial ALS in Scandinavia is that there may be much greater awareness of the genetic risk of ALS in families where a member has been diagnosed with ALS. Other family members may therefore exhibit anxiety and depression, especially as they start to approach the age at which their relatives were diagnosed.” Comments provided by our friends at the Australian SMC: Professor Bryce Vissel, Head of the Neuroscience and Regenerative Medicine Program at St Vincent’s Hospital Sydney, said: “Depression and anxiety are common conditions, while ALS is rare. “Psychiatric disorders such as depression and anxiety are not unusual in people who are later diagnosed with MND or ALS. But because these mental health issues are so common — and ALS is so rare — having depression or anxiety does not mean you are likely to develop ALS. “It’s far more likely that your symptoms are just what they seem. They should be treated for what they are, not feared as signs of something more serious — which is very uncommon. “We should treat depression and anxiety as depression and as anxiety — not as a warning sign for ALS in most people. “This study does not suggest the treatments cause ALS. Rather, it’s possible that early psychiatric symptoms — such as depression — are part of the disease itself. We call this a ‘prodrome’. That’s very different.” Professor Anthony Hannan, researcher at the Florey Institute of Neuroscience and Mental Health, said: “This new research article in JAMA Network Open adds to the evidence linking some psychiatric conditions to ALS, the most common form of motor neuron disease (MND). It should be noted that this study only addresses correlation, not causation (‘cause and effect’). “Considering that the psychiatric medications linked to MND have very diverse pharmacology (and mechanisms of action), it is extremely unlikely that each of these medications directly contributes to the risk of MND. “What is more likely is that the findings reflect associations between psychiatric symptoms and risk of MND (independent of medication). This is consistent with previous studies, including those involving genetics, which link MND to frontotemporal dementia, a neurodegenerative disease where psychiatric symptoms are often prominent. It should be noted that the present study only involved 1057 ALS/MND patients (and a larger number of control subjects) in Sweden from 2015-2023. “It will be important to follow up these findings with larger studies internationally, which also have comprehensive genetic profiling and other biomarkers (for both neurological and psychiatric disorders). Such future studies could inform new approaches to delay the onset of, and treat MND, and its associated neurological (and sometimes psychiatric) symptoms. Considering that this devastating disorder is currently incurable, and usually kills patients within a few years of diagnosis, any new approaches to help sufferers and their families are urgently needed.” ‘Use of Common Psychiatric Medications and Risk and Prognosis of Amyotrophic Lateral Sclerosis’ by Charilaos Chourpiliadiset al.was published inJAMA Network Openat 16:00 UK time Wednesday 4 June 2025. DOI: 10.1001/jamanetworkopen.2025.14437 Declared interests Dr Ammar Al-Chalabi:I know two of the authors well personally, Fang Fang and Caroline Ingre. In fact I am at a conference all week with Caroline. I consult for many pharmaceutical companies with the funds going to my research accounts at King’s, not to me personally. I am co-Director of the UK MND Research Institute. Dr Brian Dickie:No CoI’s. Professor Anthony Hannan:has not declared any conflicts of interest. Professor Bryce Vissel:has not declared any conflicts of interest. A study published inJAMA Network Openlooks at the association between psychiatric medication use and the risk of amyotrophic lateral sclerosis (ALS) progression. Prof Ammar Al-Chalabi, Professor of Neurology and Complex Disease Genetics, King’s College London (KCL), said: “This is an interesting study, well carried out and leveraging the important Scandinavian health registers. There are two points to make: The associated effect on the risk of disease is small except in the year immediately before diagnosis (when there are symptoms of ALS/MND already). At most it represents a 25% increase in relative risk, which for a condition with a 1 in 300 lifetime risk, is not a big change. Association is not causation. That is especially important here. We already know that some of the genetic variants that nudge people towards schizophrenia for example, overlap with variants that nudge people towards ALS (the authors talk about this in the Introduction and cite the relevant paper). The same for other neuropsychiatric conditions – the authors do acknowledge this to some extent in the limitations section, when they talk about C9orf72. So it may not be use of the medication that increases ALS risk, but that the need for the medication is a signal that someone is already at increased genetic risk. Either interpretation fits the results.” Dr Brian Dickie, Chief Scientist, MND Association (Motor Neurone Disease Association), said: “The findings from this well performed but relatively small study are consistent with previous research from other investigators which indicates that ALS and schizophrenia may have some common genetic elements, and also with other research indicating increased cases of psychiatric illness amongst relatives of people diagnosed with ALS when compared with the general population. As people with psychiatric symptoms will more likely be prescribed relevant medication, these latest findings are not surprising in themselves. “The authors correctly seek to avoid over-interpretation of the results, stressing they have identified “an association”. They therefore veer away from any implication that these medications can cause or exacerbate ALS. In order to drill down further into these findings, future studies will need to incorporate more genetic data, as this would help address a number of potential confounding factors. “The most common genetic risk factor for ALS (a repeat expansion in the C9orf72 gene) originated in Scandinavia and therefore is particularly prevalent within the Scandinavian population. It is also the most common genetic risk factor for frontotemporal dementia, as well as possibly other neurological conditions, so a study in the Swedish population will most likely have a higher proportion of people with this particular genetic form of the disease. Not only would higher use of psychiatric medication be likely, but this genetic form is also linked with faster progression and shorter survival, which could explain the association between psychiatric medication and more aggressive disease. “A further potential factor linked to the higher prevalence of familial ALS in Scandinavia is that there may be much greater awareness of the genetic risk of ALS in families where a member has been diagnosed with ALS. Other family members may therefore exhibit anxiety and depression, especially as they start to approach the age at which their relatives were diagnosed.” Comments provided by our friends at the Australian SMC: Professor Bryce Vissel, Head of the Neuroscience and Regenerative Medicine Program at St Vincent’s Hospital Sydney, said: “Depression and anxiety are common conditions, while ALS is rare. “Psychiatric disorders such as depression and anxiety are not unusual in people who are later diagnosed with MND or ALS. But because these mental health issues are so common — and ALS is so rare — having depression or anxiety does not mean you are likely to develop ALS. “It’s far more likely that your symptoms are just what they seem. They should be treated for what they are, not feared as signs of something more serious — which is very uncommon. “We should treat depression and anxiety as depression and as anxiety — not as a warning sign for ALS in most people. “This study does not suggest the treatments cause ALS. Rather, it’s possible that early psychiatric symptoms — such as depression — are part of the disease itself. We call this a ‘prodrome’. That’s very different.” Professor Anthony Hannan, researcher at the Florey Institute of Neuroscience and Mental Health, said: “This new research article in JAMA Network Open adds to the evidence linking some psychiatric conditions to ALS, the most common form of motor neuron disease (MND). It should be noted that this study only addresses correlation, not causation (‘cause and effect’). “Considering that the psychiatric medications linked to MND have very diverse pharmacology (and mechanisms of action), it is extremely unlikely that each of these medications directly contributes to the risk of MND. “What is more likely is that the findings reflect associations between psychiatric symptoms and risk of MND (independent of medication). This is consistent with previous studies, including those involving genetics, which link MND to frontotemporal dementia, a neurodegenerative disease where psychiatric symptoms are often prominent. It should be noted that the present study only involved 1057 ALS/MND patients (and a larger number of control subjects) in Sweden from 2015-2023. “It will be important to follow up these findings with larger studies internationally, which also have comprehensive genetic profiling and other biomarkers (for both neurological and psychiatric disorders). Such future studies could inform new approaches to delay the onset of, and treat MND, and its associated neurological (and sometimes psychiatric) symptoms. Considering that this devastating disorder is currently incurable, and usually kills patients within a few years of diagnosis, any new approaches to help sufferers and their families are urgently needed.” ‘Use of Common Psychiatric Medications and Risk and Prognosis of Amyotrophic Lateral Sclerosis’ by Charilaos Chourpiliadiset al.was published inJAMA Network Openat 16:00 UK time Wednesday 4 June 2025. DOI: 10.1001/jamanetworkopen.2025.14437 Declared interests Dr Ammar Al-Chalabi:I know two of the authors well personally, Fang Fang and Caroline Ingre. In fact I am at a conference all week with Caroline. I consult for many pharmaceutical companies with the funds going to my research accounts at King’s, not to me personally. I am co-Director of the UK MND Research Institute. Dr Brian Dickie:No CoI’s. Professor Anthony Hannan:has not declared any conflicts of interest. Professor Bryce Vissel:has not declared any conflicts of interest. **in this section** for journalists for scientists for press officers **roundups & rapid reactions** **briefings** **filter RoundUps by year** 2025(167) 2024(325) 2023(398) 2022(444) 2021(870) 2020(1245) 2019(472) 2018(375) 2017(361) 2016(358) 2015(356) 2014(306) 2013(244) 2012(280) 2011(185) 2010(120) 2009(166) 2008(119) 2007(147) 2006(82) 2005(45) 2004(49) 2003(30) 2002(21) **search by tag**"}