{"id": 952, "name": "WGBA - Green Bay News", "domain": "nbc26.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.nbc26.com/sports/high-school-sports/kaukauna-softball-eyes-fourth-state-title-in-five-years-led-by-senior-core-and-undefeated-2025-record", "title": "Kaukauna Softball Eyes Fourth State Title In Five Years Led By Senior Core And Undefeated 2025 Record", "content": "Menu Watch NBC 26 Live WeatherDaily Forecast3 Degree GuaranteeCameron's Road ShowWeather RadarWeather AlertsWeather MapsClosings & DelaysLive CamsStorm Tracker Daily Forecast 3 Degree Guarantee Cameron's Road Show Weather Radar Weather Alerts Weather Maps Closings & Delays Live Cams Storm Tracker Daily Forecast 3 Degree Guarantee Cameron's Road Show Weather Radar Weather Alerts Weather Maps Closings & Delays Live Cams Storm Tracker NewsLatest NewsNational NewsIn Your NeighborhoodWashington IslandDont Waste Your MoneyYour Health MattersContact Us Latest News National News In Your Neighborhood Washington Island Dont Waste Your Money Your Health Matters Contact Us Latest News National News In Your Neighborhood Washington Island Dont Waste Your Money Your Health Matters Contact Us SportsGreen Bay PackersSports ShowdownHigh School SportsMilwaukee BrewersMilwaukee BucksOlympicsPackers on the Clock Green Bay Packers Sports Showdown High School Sports Milwaukee Brewers Milwaukee Bucks Olympics Packers on the Clock Green Bay Packers Sports Showdown High School Sports Milwaukee Brewers Milwaukee Bucks Olympics Packers on the Clock ShowsNBC ShowsThe Kelly Clarkson Showtv32 NBC Shows The Kelly Clarkson Show tv32 NBC Shows The Kelly Clarkson Show tv32 About UsNBC 26 News TeamContact UsWACY Contact UsTV ListingsContestsSupportAdvertise With UsGifts For TeensShop With A Cop NBC 26 News Team Contact Us WACY Contact Us TV Listings Contests Support Advertise With Us Gifts For Teens Shop With A Cop NBC 26 News Team Contact Us WACY Contact Us TV Listings Contests Support Advertise With Us Gifts For Teens Shop With A Cop Gas Price Tracker Advertise With Us Wellness Experts Trusted Advisor WACY tv32 Sign In Newsletters Sign Out Manage Emails Apps Careers Search Green Bay Packers Packers on the Clock Sports Showdown High School Sports Milwaukee Brewers Milwaukee Bucks Olympics tv32 Homepage NBC 26 Homepage **Actions** Facebook Tweet Email **Kaukauna softball eyes fourth state title in five years, led by senior core and undefeated 2025 record** KAUKAUNA (NBC 26) — Kaukauna softball is chasing its fourth state title in the last five years, and this season, the Ghosts have both experience and momentum on their side. After falling short in last year's semifinal and earning the No. 2 seed in the 2025 WIAA Division 1 state tournament, the team is playing with a chip on its shoulder. “Especially the loss last year adds to the idea that they want to get back to win it all,” head coach Tim Roehrig said. “The two seed, as they put it, just shows people don’t believe in us. I said there’s only one way to change that, and that’s make people believe. So I think that fire is there.” This year’s roster is built around a veteran senior class that brings chemistry and confidence. Senior pitcher Karly Meredith said that bond is what gives the Ghosts an edge. “We’re so close with each other,” Meredith said. “They do so well with the youth program so growing up I played with these girls so much. We have such a good connection. So I think just having that relationship really helps this program. There’s a lot of seniors on this team this year, so I think that makes it even more special for all of us to go out on a positive note and end it winning.” Meredith, who is committed to play softball at the University of Virginia, has anchored the team’s success from the circle. She’s a three-time Gatorade Player of the Year and a four-time conference player of the year. “I always say it’s squirrel doing squirrel things, and we’ve always taken it for granted that Karly is going to go out and throw this unbelievable game,” Roehrig said. “I don't know if we're ever going to be able to replace Karly Meredith. That’s just who she is.” But Meredith isn’t the team’s only weapon. Kaukauna has talent and depth across the field. “We have a lot of talent, whether that’s hitting, defensively, Karly pitching—anything,” senior second baseman Chloe Herzfeldt said. “We have what it takes. Our outfield, those big plays—we’re always ready for that. We’re willing to give everything we have behind Karly’s back to keep this team all the way to the end.” This senior group is no stranger to the state tournament. They already won state titles as freshmen and sophomores, and they’re hoping to close their careers with one more. “They’ve been there. They’ve done that,” Roehrig said. “Now they want to finish it off right. So I think there’s that extra drive to say, we’re walking off as champions.” “We all just have that want, that aggressiveness, that we’re just gonna go out there and leave it all out there,\" Meredith added. Kaukauna enters the quarterfinals as the only undefeated team remaining in Division 1. The Ghosts will face Sun Prairie East at 11 a.m. Wednesday at Goodman Diamond in Madison. **Sign up for theBreaking News Newsletterand receive up to date information.** **now signed up to receive theBreaking News Newsletter.** **Learn More About Sports Reporter John Miller** **Learn More About Sports Reporter John Miller** **Learn More About Sports Reporter Kelly Hallinan** **Learn More About Sports Reporter Kelly Hallinan** News Weather Sports Contact Us WACY Contact Us Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers WGBA FCC Public File WGBA Public File Contact Us WACY FCC Public File WACY Public File Contact Us WLWK FCC Public File WLWK Public File Contact Us FCC Application Accessibility Statement Scripps Media Trust Center Closed Captioning Contact NBC26GreenBay nbc26"}