{"id": 816, "name": "LNP - LancasterOnline", "domain": "lancasteronline.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://lancasteronline.com/2024-annual-benefit-report/pdf_012c2486-955b-11ef-9406-f73fc3a795b4.html", "title": null, "content": "Please enable JavaScript to properly view our site. Subscribe Today! Register Log In My Account Log Out High School Sports Baseball Basketball Bowling Cross Country Field Hockey Football Golf Ice Hockey Lacrosse Rifle Soccer Softball Swimming Tennis Track & Field Volleyball Wrestling Statistics & Standings College Sports Lancaster County Colleges Penn State Other Colleges Pro Sports MLB NBA & WNBA NFL NHL Golf Tennis MLS Premier League Boxing Auto Racing Barnstormers Hershey Bears USA Field Hockey Public Notices Estate Notices Facebook X-Twitter Bluesky LinkedIn YouTube TikTok Pinterest Instagram Download on the App Store Get it on Google Play Site searchSearch Site searchSearch Site searchSearch Subscribe Log In My Account Log Out Obits Sports Events Crime Jobs Classifieds Games Archives Shop Facebook Twitter WhatsApp SMS Email Print Copy article link June 11, 2025 82° **2024 Annual Benefit Report** Oct 28, 2024 Oct 28, 2024 Facebook Twitter WhatsApp SMS Email Print Copy article link {{byline}} Dec 31, 1969 Support local journalism.Click hereto learn more about the role the Lancaster County Local Journalism Fund plays in Lancaster County and to make a tax-deductible donation. Facebook Twitter WhatsApp SMS Email Print Copy article link E-Newspaper Ancestry Archives Classifieds Games & Puzzles Mobile App Contests Newsletters Community Profiles Donate Now News Sports Business Life & Culture Calendar Opinion Letters to the Editor Obituaries Celebrations Special Publications Customer Care Center Manage Subscription / Pay Bill Advertise Submit a Legal Notice Submit News Promote Your Event Staff Directory 2024 Annual Benefit Report Facebook X-Twitter Bluesky LinkedIn YouTube TikTok Pinterest Instagram Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}