{"id": 1900, "name": "Business2Community", "domain": "business2community.com", "bias": "center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.business2community.com/artificial-intelligence/will-openai-cofounder-ilya-sutskevers-new-safe-ai-company-take-over-the-world-02811345", "title": "Will Openai Cofounder Ilya Sutskevers New Safe Ai Company Take Over The World 02811345", "content": "NewsNewsBusiness NewsCrypto NewsEntertainment News News Business News Crypto News Entertainment News News Business News Crypto News Entertainment News ResearchResearchStatistics Research Statistics Research Statistics MarketingMarketingB2B MarketingDigital MarketingOnline MarketingSmall BusinessMarketing Marketing B2B Marketing Digital Marketing Online Marketing Small Business Marketing Marketing B2B Marketing Digital Marketing Online Marketing Small Business Marketing About UsAbout UsAbout B2CWhy Trust Us?Editorial Policy About Us About B2C Why Trust Us? Editorial Policy About Us About B2C Why Trust Us? Editorial Policy USA Argentina Bosnia Brasil Čeština Chile Colombia Croatia Danmark Deutschland Eesti España Español EE.UU France Indonesia Italia Latvija Lietuva Magyarország Melayu México Nederland Norge Polska Português Perú România Serbia Slovensko Slovenija Suomi Svenska Türkiye Việt Nam Ελληνικά Български Русский ישראל عربي ไทย 한국 中国 日本 Cryptocurrency with Business2Community Best Crypto to Invest in 12 Best Altcoins to Invest in 2023 – Which New Altcoins to Buy?Business Articles Best Bitcoin Casino Sites - Compare Bitcoin Casino Sites Home Artificial Intelligence Will OpenAI Cofounder Ilya Sutskever’s New Safe AI Company Take Over the World? **Will OpenAI Cofounder Ilya Sutskever’s New Safe AI Company Take Over the World?** Henry is a managing editor and writer at Business2Community.com with a passion for writing and… Mohit Oberoi is a freelance ecommerce, business, and finance writer for Business2Community.com based in India.… Facebook Twitter Whatsapp More Ilya Sutskever, one of OpenAI’s most important co-founders, started a new artificial intelligence (AI) company barely a month after he quit the ChatGPT parent company. He has named the new firm Safe Superintelligence (SSI Inc.) and the focus on “safety” cannot be missed here. Reportedly, Sutskever quit OpenAI as he and Sam Altman had differing opinions about how OpenAI should balance growth while ensuring AI stays safe for humanity. Ex-OpenAI engineer Daniel Levy and former Y Combinator partner Daniel Gross worked with Sutskever to cofound SSI together.In its release, SSI said, “Building safe superintelligence (SSI) is the most important technical problem of our time.” It said that the company’s investors and business model are aligned to achieve safe superintelligence. The release added, “We approach safety and capabilities in tandem, as technical problems to be solved through revolutionary engineering and scientific breakthroughs. We plan to advance capabilities as fast as possible while making sure our safety always remains ahead.” We will pursue safe superintelligence in a straight shot, with one focus, one goal, and one product. We will do it through revolutionary breakthroughs produced by a small cracked team. Join us:https://t.co/oYL0EcVED2 — Ilya Sutskever (@ilyasut)June 19, 2024 **Safety Concerns Over AI** Sutskever and many other AI critics have multiple genuine concerns amid the advancements of AI. It threatens to harm privacy in the short term and, in the long term, it could take over the world. The privacy fears were well illustrated whenMicrosoft revealed its new “Recall” feature for Copilot+ PCs at its Build conferenceevent last month. The feature will record essentially everything you do on your PC to enable it to retrieve snapshots for you, enabling a potentially massive breach of privacy. After much online furor, Microsoft announced that it won’t be a default feature on the device. Apple perhaps learned from that saga and, at theWorldwide Developer Conference earlier this month,said that safety would be the core of Apple Intelligence, even as it delivers personalized experiences. Apple Intelligence would run on severallarge language models(LLMs) many of which would run on the device itself. According to SSI, “Our singular focus means no distraction by management overhead or product cycles, and our business model means safety, security, and progress are all insulated from short-term commercial pressures.” OpenAI Co-Founder launches new AI company Ilya Sutskever, who was OpenAI's chief scientist, has founded new AI safety company Safe Superintelligence Inc (SSI). The newly founded AI company's has one goal and one product: a safe superintelligence.SSI states that: “Building…pic.twitter.com/6SJmQsYvxa — The Upload (@theuploadweekly)June 20, 2024 **SSI It Putting a Lot of Focus on Safety** While Sutskever hasn’t revealed the company’s investors and financial backers, speaking withBloomberg’s Ashlee Vancehe said that the company “will be fully insulated from the outside pressures of having to deal with a large and complicated product and having to be stuck in a competitive rat race.” Meanwhile, it remains to be seen how the company advances in AI while not getting “distracted” by commercial pressures as investors have been quite demanding of the companies. **OpenAI Also Started as a Non-Profit AI Company** Incidentally, even OpenAI also started as a nonprofit but later became a for-profit company as it received billions of dollars in investments, including from Microsoft. Elon Musk – another OpenAI confounder – has criticized OpenAI for transforming from a non-profit companyto a “maximum profit” company. He has good reason to be upset as he donated tens of millions of dollars before it shifted to a non-profit (meaning that he got absolutely nothing for his money). The billionaire has since disassociated himself from OpenAI and has started his own AI company X.ai which incidentally raised $6 billion late last month which gave the OpenAI competitor avaluation of a mammoth $24 billion. **Sutskever Backed Sam Altman’s Sacking** Sutskever was among those who backed Sam Altman’s sacking as OpenAI’s CEO. This mistake quickly turned into a tornado of controversy and chaos as mostOpenAI employees threatened to quitif Altman wasn’t reinstated. In just a few days, Altman was brought back as CEO and Sutskever apologized for participating in the board’s action to remove him. However, his position at OpenAI apparently became untenable after the incident. Meanwhile, the timing of his departure raised eyebrows, as it came just a day afterOpenAI launched a new AI modelalong with a desktop version of ChatGPT. Now with Sutskever starting his own AI company, the competition could heat up as SSI seems to put “safety” and “security” as its USPs at a time when individuals, institutions, as well as governments are getting wary of the emerging technology. Facebook Twitter More **Stay Informed, Sign Up for Our Exclusive Newsletter!** **Trending News** **Google Doubles Down on Its Project Astra as AI War Heats Up** **184 Million Logins Stolen in Huge Data Breach: How to Secure Your Accounts** **Apple Refuses Fortnite App Yet Again: Will the Courts Intervene?** **Critics Slam FTC As It Drops Cases Against Pepsi and Microsoft** **Deep-Sea Mining Is Coming: Will It Destroy the Ocean Ecosystem?** **Related Articles** **Latest News** **Tesla Cybertrucks Crash Nearly 40% as Trade-Ins Open** While Tesla stock (NYSE: TSLA) has jumped sharply over the… **184 Million Logins Stolen in Huge Data Breach: How to Secure Your Accounts** In one of the largest data breaches of all time,… **Critics Slam FTC As It Drops Cases Against Pepsi and Microsoft** The Federal Trade Commission (FTC) has dropped its case against… **Deep-Sea Mining Is Coming: Will It Destroy the Ocean Ecosystem?** **Apple Faces Another Challenge as Trump Warns of a 25% Tariff on iPhone Imports** **Waymo Expands in Silicon Valley Ahead of Tesla’s June Robotaxi Launch** **OpenAI Buys AI Hardware Startup for $6.4 Billion: Will It Shake Up the Market?** Copy link Email Facebook Twitter Whatsapp LinkedIn Telegram Reddit **Stay Informed, Sign Up for Our Exclusive Newsletter!** Twitter Facebook Telegram Linkedin BusinessHow To Start A BusinessEntrepreneurshipRunning a Small Business How To Start A Business Entrepreneurship Running a Small Business How To Start A Business Entrepreneurship Running a Small Business FinanceFinance 101Finance for StartupsFinancial Planning Finance 101 Finance for Startups Financial Planning Finance 101 Finance for Startups Financial Planning TechnologyGrow Your Business With TechnologyTechnology InnovationsTechnologies for Small Businesses Grow Your Business With Technology Technology Innovations Technologies for Small Businesses Grow Your Business With Technology Technology Innovations Technologies for Small Businesses InformationAdvertise on B2CEditorial PolicyPrivacy Policy Advertise on B2C Editorial Policy Privacy Policy Advertise on B2C Editorial Policy Privacy Policy CompanyAbout B2CEditorsWhy Trust UsContact Us About B2C Editors Why Trust Us Contact Us About B2C Editors Why Trust Us Contact Us"}