{"id": 928, "name": "Moonshot News", "domain": "moonshot.news", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://moonshot.news/news/diversity-inclusion/just-14-countries-in-the-world-have-laws-giving-women-the-same-rights-as-men/", "title": "Just 14 Countries In The World Have Laws Giving Women The Same Rights As Men", "content": "Skip to primary navigation Skip to content Home NewsITMediaAdvertising IT Media Advertising IT Media Advertising PrimeInterviewsIn FocusGrowth MindsetShortlist Interviews In Focus Growth Mindset Shortlist Interviews In Focus Growth Mindset Shortlist Diversity & Inclusion CommunityBlogs Blogs Blogs AssociationsAssociations ListNetwork News Associations List Network News Associations List Network News About Home News Diversity & Inclusion Just 14 countries have laws giving women the same rights as men Home NewsITMediaAdvertising IT Media Advertising IT Media Advertising PrimeInterviewsIn FocusGrowth MindsetShortlist Interviews In Focus Growth Mindset Shortlist Interviews In Focus Growth Mindset Shortlist Diversity & Inclusion CommunityBlogs Blogs Blogs AssociationsAssociations ListNetwork News Associations List Network News Associations List Network News About **Just 14 countries have laws giving women the same rights as men** “This “reform fatigue” is a potential impediment to economic growth and resilience at a critical time for the global economy. As global economic growth is slowing, all countries need to mobilize their full productive capacity to confront the confluence of crises besetting them.” The 14 countries with same legal rights for women and men are Belgium, Canada, Denmark, France, Germany, Greece, Iceland, Ireland, Latvia, Luxembourg, the Netherlands, Portugal, Spain, and Sweden. At today’s pace, it will take several decades to close the legal gender gap across the world, the World Bank says. “This means that millions of young women entering the workforce today will have to wait until retirement—many even longer—before they get equal rights.” “Today, nearly 2.4 billion working-age women live in economies that do not grant them the same rights as men. The year 2022 marks a low point in one respect: economies adopted the fewest gender-related reforms in more than two decades.” In some economies, moreover, a troubling trend is under way: previously granted rights are being reversed. The report finds that some economies have made legal changes to strip women of existing rights, including the freedom of movement and the ability to get a job. “Some have imposed additional burdens, like the duty of obedience to the husband.” The World Bank’s five main takeaways on change since 1970: Since 1970, the global average Women, Business and the Law score has improved by about two-thirds, rising from 45.8 to 77.1 points. Today, just 14 economies—all high income—have laws giving women the same rights as men, and progress has been uneven across regions and over time. Equality of economic opportunity for women is highest in Organisation for Economic Co-operation and Development (OECD) high-income economies, where the average score on the Women, Business and the Law index is 95.3 points, and lowest in the Middle East and North Africa region, where the average score is 53.2 points. Progress across the areas measured has also been uneven, with most reforms in the areas of Workplace and Parenthood. Across all topic areas, most reforms have been issued to address domestic violence, prohibit gender discrimination in employment, and legislate on sexual harassment. Economies with historically larger legal gender gaps have been catching up, especially since 2000. Faster progress is being made in economies that have had historically lower levels of gender equality. This is the case, for instance, in some countries in the Middle East and North Africa, and in Sub-Saharan Africa. Economies that have the highest growth rates in the Women, Business and the Law score include Bahrain, Botswana, the Democratic Republic of Congo, Indonesia, São Tomé and Príncipe, Saudi Arabia, South Africa, Togo, and the United Arab Emirates. The catch-up effect has been happening across all areas covered by Women, Business and the Law, but the pace of progress has been uneven. The catch-up effect in closing the gender gap has been strongest in the laws affecting Workplace, followed by Parenthood, Pay, and Marriage. The catch-up effect has been weakest in laws related to Mobility, Assets, and Entrepreneurship. Moonshot News is an independent European news website for all IT, Media and Advertising professionals, powered by women and with a focus on driving the narrative for diversity, inclusion and gender equality in the industry. Our mission is to provide top and unbiased information for all professionals and to make sure that women get their fair share of voice in the news and in the spotlight! We produce original content, news articles, a curated calendar of industry events and a database of women IT, Media and Advertising associations. **You may also like** Diversity & Inclusion **Women’s reports on workplace abuse often underestimated** Diversity & Inclusion **Gender-based online violence normalised in Western Balkans** **Try our Weekly Newsletter!** We write a Weekly Newsletter that summarizes recent most important news stories about women in IT and Media and keeps you up-dated. Subscribe with your email address: **Blog Authors** **Enter the Members Area** About Support Cookie Policy Terms and Conditions Privacy Policy IT Interviews In Focus Media Advertising Read Our Blogs Community Submit an Idea Member Services Advertise with Us Subscriptions Write For Us © 2023 Moonshot News | Developed by LionWeb Do you want an experienced opinion on a job issue?Moonshot Manager is here to answer! Your Alias(You can choose how to sign your question) Your Email(This will not show) Content Moonshot community sharing thoughts and ideas, in a anonymous, safe environment. Title(Give a title to your comment) Your Email(This will not show) Comment Adding {{itemName}} to cart Added {{itemName}} to cart"}