{"id": 442, "name": "FedScoop", "domain": "fedscoop.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://fedscoop.com/radio/in-addition-to-gaining-access-to-social-security-administration-records-the-high-court-also-further-shielded-doge-from-producing-documents/", "title": "In Addition To Gaining Access To Social Security Administration Records The High Court Also Further Shielded Doge From Producing Documents", "content": "FedScoop AIScoop DefenseScoop CyberScoop StateScoop EdScoop TopicsBackModernizationCyberAIEmerging TechPolicyWorkforce Modernization Cyber AI Emerging Tech Policy Workforce Modernization Cyber AI Emerging Tech Policy Workforce TRANSITION COVERAGE Special Reports Events Podcasts Videos Insights Subscribe to Newsletters Advertise FedScoop AIScoop DefenseScoop CyberScoop StateScoop EdScoop Vote today for the 2025 FedScoop 50 awards. The Daily Scoop Podcast **Supreme Court allows DOGE to access Social Security records; Nancy Mace reintroduces federal AI training bill** June 9, 2025 The Supreme Court handed a win to President Donald Trump’s Department of Government Efficiency on Friday,granting the efficiency unit access to records at the Social Security Administration. The unsigned opinion provides the Elon Musk-associated DOGE with even more access to sensitive government information to fulfill its mission of making government more efficient. Just last month, the team also gained access to payment systems at the Department of Treasury. The ruling also comes at an awkward time for the DOGE, as Musk — its creator — and Trump are in the midst of an apparent falling out on social media. Per the decision, a majority of the justices voted to grant the administration’s request to stay a lower court decision and concluded that “SSA may proceed to afford members of the SSA DOGE Team access to the agency records in question in order for those members to do their work.” Justices voted on political lines, with liberals Elena Kagan, Ketanji Brown Jackson and Sonia Sotomayor saying they would have denied the government’s application for a stay. Simultaneously on Friday, the Supreme Court handed a second win to the DOGE, shielding it from producing documents as part of a discovery process in a Freedom of Information Act lawsuit. More federal workers would have access to artificial intelligence training undera bill reintroduced in the House on Thursday by Rep. Nancy Mace. The AI Training Extension Act of 2025 aims to expand the Artificial Intelligence Training for the Acquisition Workforce Act, which was signed into law by President Joe Biden in 2022, by offering available AI training to more pools of federal employees beyond the acquisition workforce, including “supervisors, managers, and frontline staff in data and technology roles,” according to a release from the South Carolina Republican’s office. Chair of the House Oversight Subcommittee on Cybersecurity, Information Technology, and Government Innovation, Mace previously introduced the bill in 2023 during the 118th Congress with Rep. Gerry Connolly, D-Va., who passed away last month. Rep. Shontel Brown, D-Ohio, is a co-sponsor of the reintroduced bill. The Daily Scoop Podcast is available every Monday-Friday afternoon. If you want to hear more of the latest from Washington, subscribe to The Daily Scoop PodcastonApple Podcasts,Soundcloud,SpotifyandYouTube. Monday through Friday **The Daily Scoop Podcast** We discuss the latest news and trends facing government leaders on such topics as technology, management and workforce. The program will explore headlines of the day as well as in depth discussions with top executives in both government and industry. Apple Podcasts Spotify Soundcloud YouTube **The Daily Scoop Podcast** Monday through Friday We discuss the latest news and trends facing government leaders on such topics as technology, management and workforce. The program will explore headlines of the day as well as in depth discussions with top executives in both government and industry. Apple Podcasts Spotify Soundcloud YouTube **Related Podcasts** **The former leader of 18F speaks out on the digital services team’s ‘deletion’** **Supreme Court halts orders directing DOGE document production; DHS cuts off access to ChatGPT and other commercial AI** **NLRB watchdog investigating DOGE; Democrats want Treasury watchdog probe following DOGE’s IRS ‘hackathon’** Facebook LinkedIn Twitter Copy Link **** FedScoop DefenseScoop CyberScoop StateScoop EdScoop AIScoop Newsletters Advertise with us Ad specs Contact Us (202) 887-8001 FB TW LinkedIn IG YT"}