{"id": 463, "name": "WTXF-TV Fox 29", "domain": "fox29.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.fox29.com/news/fox-news-sunday-with-shannon-bream", "title": "Fox News Sunday With Shannon Bream", "content": "Live News Weather Good Day Sports Contests More Philadelphia Pennsylvania New Jersey Delaware More Local News National News World News FOX News Sunday 7-Day Forecast School Closings & Delays FOX Weather Radar Temperatures Watches/Warnings Weather App Good Day After Show Good Day Weekend 'Digest' Newsletter Traffic Watch Live Ya Gotta Try This Seen On TV Good Day Uncut Election Election Results Donald J. Trump Josh Shapiro Phantastic Sports Show Eagles Flyers Phillies 76ers Union FOX Sports App How To Stream Newscasts & Replays LiveNOW from FOX News Specials Webcams FOX Soul YouTube Local Matters Contests FOX Shows The ClassH-Room TMZ Watch FOX Shows Share Your Photos & Videos Behind The News Mondays with Mike Bill & Shane Kelly Drives The 215 The Pulse BAM Save Our Streets Coronavirus Dr. Mike Health Care Opioid Epidemic Business Consumer Deals Personal Finance Technology FOX LOCAL App New Jersey News - My9NJ New York News - FOX 5 NY Washington DC News - FOX 5 DC Apps Contact Us FCC Public File FCC Applications How To Advertise Personalities TV Listings Jobs Internships **FOX News Sunday with Shannon Bream: How and when to watch on FOX 29 Philadelphia** Share Copy Link Email Facebook Twitter LinkedIn Reddit Watch FOX News Sunday with Shannon Bream on FOX 29 Philadelphia starting at 9 a.m. on Sundays. PHILADELPHIA-Shannon Bream has ushered in a new era of Sunday morning talk shows as she interviews the biggest newsmakers of the week on FOX News Sunday. You can catch all the action ofFOX News Sunday with Shannon Breamon FOX 29 Philadelphia from 9 a.m. to 10 a.m. on Sundays. Leading guests in providing context and analysis of the issues facing Americans, Bream’s weekly guest roster is among the most diverse in Sunday morning talk, featuring interviews with political, business and public affairs newsmakers from the U.S. and abroad. Before becoming the first woman to host FOX News Sunday in its nearly three-decade history, Bream served as anchor of FOX News @ Night for five years. In addition to her new role, she also continues to serve as the network’s chief legal correspondent. WatchFOX News Sunday with Shannon Breamon FOX 29 Philadelphia starting at 9 a.m. on Sundays. **Latest News** **Live Nation to open 18 new music venues in US: See the list** **Cause of massive 4-story vacant West Philly apartment building announced** **2 juveniles hurt in Philadelphia rowhome fire that displaced over a dozen: officials** **Hiker missing in India, San Francisco family desperate to find him** **ICE to deploy tactical units to Northern Virginia and 4 other cities, sources say** **Trending** **DAILY NEWSLETTER** All the news you need to know, every day By clicking Sign Up, I confirmthat I have read and agreeto thePrivacy PolicyandTerms of Service. **Subscribe to FOX 29 on YouTube** Philadelphia Pennsylvania New Jersey Delaware More Local News National News World News FOX News Sunday 7-Day Forecast School Closings & Delays FOX Weather Radar Temperatures Watches/Warnings Weather App Good Day After Show Good Day Weekend 'Digest' Newsletter Traffic Watch Live Ya Gotta Try This Seen On TV Good Day Uncut Election Election Results Donald J. Trump Josh Shapiro Phantastic Sports Show Eagles Flyers Phillies 76ers Union FOX Sports App How To Stream Newscasts & Replays LiveNOW from FOX News Specials Webcams FOX Soul YouTube Local Matters Contests FOX Shows The ClassH-Room TMZ Watch FOX Shows Share Your Photos & Videos Behind The News Mondays with Mike Bill & Shane Kelly Drives The 215 The Pulse BAM Save Our Streets Coronavirus Dr. Mike Health Care Opioid Epidemic Business Consumer Deals Personal Finance Technology FOX LOCAL App New Jersey News - My9NJ New York News - FOX 5 NY Washington DC News - FOX 5 DC Apps Contact Us FCC Public File FCC Applications How To Advertise Personalities TV Listings Jobs Internships facebook twitter instagram youtube email About Us New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File Closed Captioning Work For Us Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"}