{"id": 970, "name": "NewFolks", "domain": "newfolks.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.newfolks.com/stages/what-is-the-right-age-for-your-child-to-start-wearing-makeup/", "title": "What Is The Right Age For Your Child To Start Wearing Makeup", "content": "StagesStagesSee All StagesSee AllPregnancy and MaternityBabyToddlerKidsTeens See All Stages See All Pregnancy and Maternity Baby Toddler Kids Teens See All Stages See All Pregnancy and Maternity Baby Toddler Kids Teens InspirationInspirationSee All InspirationSee AllFashionNursery DecorPlaytimeMealtimeSleep See All Inspiration See All Fashion Nursery Decor Playtime Mealtime Sleep See All Inspiration See All Fashion Nursery Decor Playtime Mealtime Sleep ActivitiesActivitiesSee All ActivitiesSee AllFun and PlayLearningPhysical ActivityCreativityHolidays and EventsBirthdays See All Activities See All Fun and Play Learning Physical Activity Creativity Holidays and Events Birthdays See All Activities See All Fun and Play Learning Physical Activity Creativity Holidays and Events Birthdays ShopShopSee All ShopSee AllEssentialsClothesHealth and FitnessToysGearEducational See All Shop See All Essentials Clothes Health and Fitness Toys Gear Educational See All Shop See All Essentials Clothes Health and Fitness Toys Gear Educational Home Stages **The right age for makeup: What parents should consider** **Advice for parents wondering how old a child has to be to wear makeup** Kids grow up so fast, and before you know it, your tween is asking to wear makeup. Loaning your lip gloss and giving your personal makeup tips to your teenager may be a rite of passage, but what about your younger kids? It seems that children are wearing makeup now at younger and younger ages, and as your child transitions into their tween years, and sometimes even younger, they may want to start wearing some makeup as a way to express themselves. Experimenting with makeup doesn’t have to be taboo, and it can even be a safe and healthy way for your child to experiment with their creativity and express their personality. You may find yourself wondering how old do you have to be to wear makeup, especially if your parents were strict about the matter.Take a look at ourhelpful parenting tipsbelow as a guide for how to talk to your child about makeup. **At what age will my child turn to makeup? Should I be concerned?** Starting around the age of 11, your child might get interested in makeup. When they were small, you may have even let them play with a toy version of a makeup palette or apply a dab of lipstick for fun. However,at 11, they’re starting to feel self-aware and internalize the influences around them. This includes their family, friends, and of course, celebrities. While not all celebrities wear makeup and may not wear it at all times, they’re often glammed up or retouched for events and photos.Your child might also be encouraged by makeup gurusthey watch onlineor follow on social media if they have activesocial media accounts. Onestudyfound that around40% to 50% of 12- to 14-year-oldswear makeup. This includes staples like eyebrow pencils, mascara, eyeliner, and more coverage products like foundation, concealer, blush, and bronzer. This age range seems to be the common stage when your child will most likely ask you if they can finally try some beauty products. But not to worry, when you show your tween that you’re open to dialogue, they’re more likely to develop healthy beauty habits from the start. Open communication can also put a damper on them going behind your back and building unsafe beauty habits. **How can I talk to my child about makeup without sounding too critical?** For starters, there is one important topic to discuss with your child when they ask, “How old do you have to be to wear makeup?” You might askwhythey’re interested in makeup in the first place. This is not an exhaustive list of the possible reasons your child might want to try makeup. The main thing to remember is that this makeup discussion will have the best outcome if you find a good middle ground. **Reasons your child wants to try makeup** Wants to improve self-esteem Wants to fit in with their peers Wants to express themselves in a creative way Wants to impress someone they’re attracted to Wants to mimic a role model Wants to cover up skin imperfections If you don’t feel comfortable with your child going to school with a full face of makeup, let them know. Perhaps letting them wear something like a tinted lip balm and eyebrow pencil or skin-tone-appropriate blush and lip gloss would be a good compromise. You also want to set boundaries forwhen and whereit’s OK to wear makeup. For instance, you might give them the green light for special occasions like school dances or family gatherings, but not every single day at school. We know makeup is often seen as an inappropriate tool used to increase sex appeal, and perhaps that’s why so many parents are reluctant to allow their children to even go near it. But let’s face it: tweens will likely go into full rebel mode if you double down on their makeup privileges. The ideal tone you want to set is one of understanding, so your child feels comfortable talking to you about makeup. **What are helpful makeup and skincare basics to discuss with my child?** Instead of steering your child away from makeup completely, teach them safe habits right from the beginning. Some common tips are cleaning brushes and tools regularly to avoid infections.Another big thing is to use products by their expiration dates. For starters, an opened mascara will typically last between three and six months. On the other hand, powder eye shadow can last up to two years. You should also warn your child about sharing makeup and tools with other people. For sanitary reasons, they should use their own kits and tools at all times.Besides cleanliness, share some makeup application wisdom. If you’re not a makeup enthusiast, many beauty counters and department store cosmetic sections offer free application demonstrations. At these sessions, you and your child can discover natural looks that are age-appropriate. Lastly, explain to your child that skin care is a big part of makeup. This step is especially helpful if they want to use makeup to cover up blemishes like acne or uneven skin tone. Shop for natural facial cleansers, moisturizers, and face maskstogetherso your tween can learn abouthealthy skin care. **Where do you start?** Kids seem to know a lot more about makeup these days than they did even 10 years ago. Thanks to social media influencers and celebrity makeup artists, many tweens and teens are more skilled at doing their makeup than the adults in their lives. Celebrity makeup artist Bobbi Brown toldOprah Magazinethat kids are wearing makeup at a younger age these days, but what’s most important is that they do what makes them feel good about themselves. “All girls are beautiful — what it takes is time,” she says. “Find what makes you special.” She recommends middle school as an appropriate time to start wearing makeup and is a fan of a more natural look for younger kids who are just starting to experiment with makeup. At the end of the day, you need to discuss with your child what you’re comfortable with and help them discover products that make them feelgood about themselves. **Set boundaries** Now that you’ve spoken with your child about wearing makeup, you may want to set some general boundaries. You’ll want to take a balanced approach to this, since you’ve just allowed them to wear makeup, so you don’t want to list what’s off-limits immediately. You also don’t want your tween heading to school with a full face of glam either, so having an open discussion is important. Explain what you’re comfortable with and what you think is age-appropriate. Focus on skin health and the importance of self-expression. Encouraging discussions about media influence and self-confidence can also ensure that tweens view makeup as a fun tool rather than a necessity. The more open you are with your child, the more you can both come to an agreement on what is age-appropriate. **Are there other alternatives to makeup if my child is still too young?** Many makeup brands containquestionable ingredients. There are makeup alternatives such asfood-basedproductslike fruit-tinted lip balms and cheek tints. There are also countless makeup do-it-yourself projects you and your child can try out at home. If you feel your childistoo young for makeup, you can encourage them to try other ways of self-expression. Trying out new clothing, getting a hair makeover, or enrolling in online art classes are all great ways your child can still have fun experimenting without the use of makeup. So, there you have it. There’s no exact answer to how old you have to be to wear makeup; the makeup discussion between you and your child can be relaxed and engaging. It can even turn into a learning activity if you decide to craft your own products at home. Just remember that your sweet child is growing up, and you are the role model they look up to for healthy makeup habits. Inspiration Kids Mock Page **Editors’ Recommendations** Ear piercings for kids: A complete guide for parents When should your baby be able to stack blocks? Here’s what to know Can you use a heating pad while pregnant? Here’s what you should know 5 essential house rules for teens every parent needs Should your teen have a bedtime? Stages A telltale sign that a boy is going through puberty is when their voice begins to change. Before you know it, they're experiencing that sing-songy, high-low, cracking, and croaking voice. If your son's voice is suddenly all over the map — oscillating between soprano and bass — it means that some major physical and anatomical changes are on the way. His larynx is growing, and his pitch will eventually drop, and your son's voice will start to change. Say goodbye to that sweet little boy and his sweet little voice, and say hello to your emerging mini man.Want to understand how, why, and when this will all happen and need some tips on how to handle this somewhat awkward but oh-so-relatable situation? Here is what you need to know about boys' voice changes. Why does a boy's voice change? Activities Every parent can agree that chores are an important part of a child's responsibility. Having kids do assigned chores helps ensure that everyone is contributing around the house. Doing chores also teaches school-age kids important life skills. You may not want to think about it now, but those tweens and teens will be heading off to college or the real world soon enough, so they need to know how to look after themselves as well as their dorm room or apartment. Having children do chores, even outdoor chores, at a young age, teaches teamwork and helps instill a strong work ethic while introducing kids to time management. Tying chores to earning a weekly allowance has its bonuses, as well. Earning an allowance is a teaching tool in itself, introducing kids to the relationship between work and pay. Having an allowance also showcases another vital life skill — the difference between want and need. When kids spend their own hard-earned money, they learn to stop and think before making a purchase. Stages Anyone who has ever been around an overtired toddler knows the importance of napping. Napping is important for younger children who need to rest so they can not only recharge their batteries but so they can grow and develop. But napping too much can cause problems sleeping at night. What is the right age for kids to stop napping? And what happens if they nap too much or too little? We have all the answers here.What is the right age for kids to stop napping? Do older children benefit from naps? Although there isn’t a hard and fast rule, as toddlers turn to preschoolers and beyond, they’ll only need one nap a day instead of two. There are a few telltale signs to look for that signal your child is outgrowing naps. If your child takes a long time to fall asleep before a nap or at night, or if they are interested in skipping naps, they are probably ready to take fewer naps. If they aren’t tired, don’t try to force them to sleep. Note that even if a nap is skipped, the total number of hours a child needs to sleep in a day is not changed, and they may need to go to bed earlier or wake up later. The Modern Parent’s Guide to Great Gear.New moms and dads can rest assured that NewFolks’ relatable, cleverly written parenting tips and product coverage will guide them towards a happier, healthier family life. Facebook Instagram Twitter Stages Inspiration Activities Shop About Us Contact Us Logo & Accolade Licensing Editorial Guidelines Careers Work With Us Diversity & Inclusion Terms of Use Privacy Policy Do Not Sell or Share My Information Press Room Sitemap"}