{"id": 1370, "name": "The Brief", "domain": "thedebrief.org", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://thedebrief.org/people-thought-this-couldnt-be-done-ground-based-telescopes-detect-echoes-of-cosmic-dawn-by-peering-13-billion-years-back-in-time/", "title": "People Thought This Couldnt Be Done Ground Based Telescopes Detect Echoes Of Cosmic Dawn By Peering 13 Billion Years Back In Time", "content": "Science Defense Space Astronomy Tech Energy Physics Newsletter Submissions About **“People Thought This Couldn’t Be Done”: Ground-Based Telescopes Detect Echoes of “Cosmic Dawn” by Peering 13 Billion Years Back in Time** Astronomers report the first successful use of Earth-bound telescopes to peer over 13 billion years back in time to observe conditions in our universe shortly after the Big Bang, which astronomers call ‘Cosmic Dawn.’ High atop the Chilean Andes, a novel array of ground-based instruments has successfully detected faint microwave signals left behind by the universe’s first stars. This discovery pushes the limits of observational astronomy and cracks open one of the most mysterious epochs in cosmic history. The breakthrough, led by a team of Johns Hopkins University astronomers and reported in theAstrophysical Journal, marks the first time Earth-based telescopes isolated these elusive signals from the reionization era, an early phase of the universe when the first stars and galaxies lit up the cosmos. “People thought this couldn’t be done from the ground,” project leader and Johns Hopkins professor of physics and astronomy, Dr. Tobias Marriage, said in arelease. “Astronomy is a technology-limited field, and microwave signals from the Cosmic Dawn are famously difficult to measure.” “Ground-based observations face additional challenges compared to space,” Marriage added. “Overcoming those obstacles makes this measurement a significant achievement.” **Peering Over 13 Billion Years Back in Time** Most scientists place the dawn of the universe sometime around 13.8 billion years before the present. After the initial formation event, the Big Bang, the universe was filled with dense electrons that even prevented light from escaping. After the universe began to cool, microwave light was ultimately able to escape and fill the space in between. According to the Johns Hopkins-led research team, the formation of new stars during this Cosmic Dawn accelerated the process, causing the microwave light to scatter or polarize. “When light hits the hood of your car and you see a glare, that’s polarization,” explained the study’s first author, Yunyang Li, a PhD student at Johns Hopkins and then a fellow at the University of Chicago during the research. Still, detecting the polarized light fromthe cosmic dawn over 13 million years agois particularly difficult, especially for Earth-based telescopes. According to Marriage, ground-based observations “face additional challenges” compared to space observatories. For example, telescopes operating within the Earth’s atmosphere must differentiate cosmic data from broadcast radio waves, radar, and satellite signals. Weather, temperature, and atmosphere also pose challenges that make observations of this sensitivity difficult even in perfect conditions. **Cosmic Dawn: A Look 13 Billion Years Back in Time** In their new study, the researchers say they were curious to see if they could look back over 13 billion years to the Cosmic Dawn using the telescopes in the U.S. National Science Foundation’s Cosmology Large Angular Scale Surveyor, or CLASS, project. CLASS—short for Cosmology Large Angular Scale Surveyor—is an ambitious multi-telescope project funded by the U.S. National Science Foundation and operated from the Parque Astronómico Atacama in northern Chile. Positioned at a high elevation to minimize atmospheric distortion, the telescopes are uniquely engineered to capture polarizationin the cosmic microwave background (CMB)—the residualglow from the Big Bang—at enormous angular scales. At the heart of this endeavor lies the challenge of detecting “E-mode” polarization patterns in the CMB caused by free electrons liberated when the first stars ionized the surrounding hydrogen gas. That scattering leaves a barely perceptible fingerprint in the CMB—a signature of the universe’s transformation from a foggy soup of particles to a clear, transparent expanse that allows light to travel freely. **Precision Measurements** The CLASS team employed a sophisticated observational strategy that involved continuously scanning the sky in azimuth while applying innovative filtering techniques to remove spurious noise from the Earth’s atmosphere, electronics, and even reflections between telescope components. The researchers’ key finding is a measurement of the so-called ‘reionization optical depth,’ denoted by the symbol τ (tau). This parameter quantifies the probability that a CMB photon scattered off a free electron liberated during reionization. A precise measurement of τ is crucial as it provides a direct probe of the amount of matter in the universe and the nature of the primordial density fluctuations that gave rise to the large-scale structure we observe today. See AlsoNew Material Able To Withstand Extreme Temperatures Discovered Totally By Accident **New Material Able To Withstand Extreme Temperatures Discovered Totally By Accident** **New Material Able To Withstand Extreme Temperatures Discovered Totally By Accident** CLASS measured τ = 0.053 with a margin of error that rivals previous space-based observations from NASA’s Wilkinson Microwave Anisotropy Probe (WMAP) and ESA’s Planck satellite, demonstrating the precision and reliability of the project’s measurements. The newly published results stem from over 115 detector years of 90 GHz polarization data collected between 2018 and 2024 using a specialized modulator known as a variable-delay polarization modulator (VPM). This device helps suppress unwanted signals and improves sensitivity to polarized light—an essential capability for teasing out the delicate reionization signature. The researchers explained that looking back at theCosmic Dawnusing polarization is like wearing polarized sunglasses to cut through the sun’s glare. By filtering out the cosmic glare, scientists could reveal what lies beneath. **First-Ever Ground-Based Measurement an “Impressive Leap Forward”** “No other ground-based experiment can do what CLASS is doing,” said Nigel Sharp, program director in the NSF Division of Astronomical Sciences, which has supported the CLASS instrument and research team since 2010. “The CLASS team has greatly improved measurement of the cosmic microwave polarization signal, and this impressive leap forward is a testament to the scientific value produced by NSF’s long-term support.” According to Charles Bennett, a Bloomberg Distinguished Professor at Johns Hopkins who led the WMAP space mission, the team’s success is “ an important frontier of cosmic microwave background research.” He also hopes future analysis of the CLASS data will help the team reach the “highest possible precision that’s achievable.” “For us, the universe is like a physics lab,” Bennet said. “Better measurements of the universe help to refine our understanding of dark matter and neutrinos, abundant but elusive particles that fill the universe.” Christopher Plain is a Science Fiction and Fantasy novelist and Head Science Writer at The Debrief. Follow and connect with him onX,learn about his books atplainfiction.com, or email him directly atchristopher@thedebrief.org. **Related Posts** **“People Thought This Couldn’t Be Done”: Ground-Based Telescopes Detect Echoes of “Cosmic Dawn” by Peering 13 Billion Years Back in Time** **High-Energy Neutrinos May Hint at New Physics—or New Civilizations** **Time Travel? Powerful Atacama Cosmology Telescope Peers Over 99.99% of the Way Back in Time** **Exploring the Universe’s True Shape: New Study Proposes Challenges to the Cosmological Principle** Send a News Tip The Intelligence Brief Get Our Newsletter Science Defense Space Astronomy Tech Energy Physics Newsletter Submissions About"}