{"id": 708, "name": "Janes Information Group", "domain": "janes.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.janes.com/osint-insights/open-source-defence-intelligence-case-studies/case-study/introducing-janes-new-online-portal", "title": "Open Source Defence Intelligence Case Studies", "content": "Home Insights Case Studies Case Study Post **Introducing Janes new online portal** Janes digital platform enables you to quickly explore trusted defence, security, and geopolitical data and insight. Whatever your starting point – a piece of equipment, a military group, an installation, an event … Janes reveals the connections you expect to see – and ones you don’t – at the click of a button. Effortlessly flow through the content, interacting with data visualisations, tables, and maps, to find the insights you need quicker than ever before. Save time by exporting the content you need for your assessments and reports with single click. Designed by analysts, for analysts – Janes turns overwhelming data into clear, actionable intelligence and insights. **Discover howJanescan support your mission** **Solutions for defence** Delivering trusted intelligence to warfighters to protect national interests, support readiness, and deter aggression. **Solutions for defence** Delivering trusted intelligence to warfighters to protect national interests, support readiness, and deter aggression. **Solutions for the intelligence community** Providing mission users with faster access to quality data to pre-empt threats and protect national security. **Solutions for the intelligence community** Providing mission users with faster access to quality data to pre-empt threats and protect national security. **Describe the operating environment** A trusted holistic view of threat, stability, and capability across the globe. **Describe the operating environment** A trusted holistic view of threat, stability, and capability across the globe. **Inform decision making** Assured interconnected OSINT to deliver informed, accurate, and reliable mission intelligence. **Inform decision making** Assured interconnected OSINT to deliver informed, accurate, and reliable mission intelligence. **You might be interested in...** Solutions Insights About Contact Request a demo Customer Login Store Privacy Policy Terms of Use Accessibility statement Slavery Statement **Speak to our team and see howJanescan help you** The world's most complete foundational military data asset. 500,000+ analyst hours per year to keep data current. Easy integration into high and low-side environments. By submitting this request, I agree with Janesterms of use* First Choice Janes IntelTrak Country Intelligence Janes Intara Defence Industry Intelligence Equipment Intelligence Industry Advisory Threat Intelligence About Janes Geoeconomic Statecraft IntelTrak Receive the latest developments in defence and security as well as keep informed on Janes news and events. The Belt and Road Monitor Janes Intelligence Summary The Belt and Road MonitorA monthly newsletter that is the most authoritative, regularly updated source of information for tracking China’s global Belt and Road Initiative (BRI), providing infographics, charts, notable quotes and analysis of some of the most noteworthy BRI developments from the previous weeks. Janes Intelligence SummaryA fortnightly update featuring the latest analysis, intelligence briefings, podcasts and news. I consent to receive Janes newsletters, product announcements and event invitations. I can freely withdraw my consent at any time.* First Choice Janes IntelTrak Country Intelligence Janes Intara Defence Industry Intelligence Equipment Intelligence Industry Advisory Threat Intelligence About Janes Geoeconomic Statecraft IntelTrak"}