{"id": 1146, "name": "Psych Central", "domain": "psychcentral.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.psychcentral.com/blog/podcast-marginalized-communities-and-the-healing-justice-model", "title": "Podcast Marginalized Communities And The Healing Justice Model", "content": "ConditionsFeaturedAllAddictionsAnxiety DisorderADHDBipolar DisorderDepressionPTSDSchizophreniaArticlesAllAdjustment DisorderAgoraphobiaAntisocial Personality DisorderBorderline Personality DisorderChildhood ADHDDissociative Identity DisorderNarcissistic Personality DisorderNarcolepsyOppositional Defiant DisorderPanic AttackPostpartum DepressionSchizoaffective DisorderSeasonal Affective DisorderSex AddictionSocial AnxietySpecific PhobiasTeenage DepressionTrauma **Featured** Addictions Anxiety Disorder ADHD Bipolar Disorder Depression PTSD Schizophrenia **Articles** Adjustment Disorder Agoraphobia Antisocial Personality Disorder Borderline Personality Disorder Childhood ADHD Dissociative Identity Disorder Narcissistic Personality Disorder Narcolepsy Oppositional Defiant Disorder Panic Attack Postpartum Depression Schizoaffective Disorder Seasonal Affective Disorder Sex Addiction Social Anxiety Specific Phobias Teenage Depression Trauma **Featured** Addictions Anxiety Disorder ADHD Bipolar Disorder Depression PTSD Schizophrenia **Articles** Adjustment Disorder Agoraphobia Antisocial Personality Disorder Borderline Personality Disorder Childhood ADHD Dissociative Identity Disorder Narcissistic Personality Disorder Narcolepsy Oppositional Defiant Disorder Panic Attack Postpartum Depression Schizoaffective Disorder Seasonal Affective Disorder Sex Addiction Social Anxiety Specific Phobias Teenage Depression Trauma DiscoverWellness TopicsBlack Mental HealthGriefEmotional HealthSex & RelationshipsTraumaUnderstanding TherapyWorkplace Mental HealthOriginal SeriesMy Life with OCDCaregivers ChroniclesEmpathy at WorkSex, Love & All of the AboveParent CentralMindful MomentNews & EventsMental Health NewsCOVID-19Live Town Hall: Mental Health in FocusPodcastsInside Mental HealthInside SchizophreniaInside Bipolar **Wellness Topics** Black Mental Health Grief Emotional Health Sex & Relationships Trauma Understanding Therapy Workplace Mental Health **Original Series** My Life with OCD Caregivers Chronicles Empathy at Work Sex, Love & All of the Above Parent Central Mindful Moment **News & Events** Mental Health News COVID-19 Live Town Hall: Mental Health in Focus **Podcasts** Inside Mental Health Inside Schizophrenia Inside Bipolar **Wellness Topics** Black Mental Health Grief Emotional Health Sex & Relationships Trauma Understanding Therapy Workplace Mental Health **Original Series** My Life with OCD Caregivers Chronicles Empathy at Work Sex, Love & All of the Above Parent Central Mindful Moment **News & Events** Mental Health News COVID-19 Live Town Hall: Mental Health in Focus **Podcasts** Inside Mental Health Inside Schizophrenia Inside Bipolar QuizzesConditionsADHD Symptoms QuizAnxiety Symptoms QuizAutism Quiz: Family & FriendsAutism Symptoms QuizBipolar Disorder QuizBorderline Personality TestChildhood ADHD QuizDepression Symptoms QuizEating Disorder QuizNarcissism Symptoms TestOCD Symptoms QuizPsychopathy TestPTSD Symptoms QuizSchizophrenia QuizLifestyleAllAttachment Style QuizCareer TestDo I Need Therapy Quiz?Domestic Violence Screening QuizEmotional Type QuizLoneliness QuizParenting Style QuizPersonality TestRelationship QuizStress TestWhat's Your Sleep Like? **Conditions** ADHD Symptoms Quiz Anxiety Symptoms Quiz Autism Quiz: Family & Friends Autism Symptoms Quiz Bipolar Disorder Quiz Borderline Personality Test Childhood ADHD Quiz Depression Symptoms Quiz Eating Disorder Quiz Narcissism Symptoms Test OCD Symptoms Quiz Psychopathy Test PTSD Symptoms Quiz Schizophrenia Quiz **Lifestyle** Attachment Style Quiz Career Test Do I Need Therapy Quiz? Domestic Violence Screening Quiz Emotional Type Quiz Loneliness Quiz Parenting Style Quiz Personality Test Relationship Quiz Stress Test What's Your Sleep Like? **Conditions** ADHD Symptoms Quiz Anxiety Symptoms Quiz Autism Quiz: Family & Friends Autism Symptoms Quiz Bipolar Disorder Quiz Borderline Personality Test Childhood ADHD Quiz Depression Symptoms Quiz Eating Disorder Quiz Narcissism Symptoms Test OCD Symptoms Quiz Psychopathy Test PTSD Symptoms Quiz Schizophrenia Quiz **Lifestyle** Attachment Style Quiz Career Test Do I Need Therapy Quiz? Domestic Violence Screening Quiz Emotional Type Quiz Loneliness Quiz Parenting Style Quiz Personality Test Relationship Quiz Stress Test What's Your Sleep Like? ResourcesTreatment & SupportFind SupportSuicide PreventionDrugs & MedicationsFind a Therapist **Treatment & Support** Find Support Suicide Prevention Drugs & Medications Find a Therapist **Treatment & Support** Find Support Suicide Prevention Drugs & Medications Find a Therapist We include products we think are useful for our readers. If you buy through links on this page, we may earn a small commission.Here’s our process **Inside Mental Health Podcast: Marginalized Communities and the Healing Justice Model** **Episode Description** According to Prentis Hemphill, “Healing justice is active intervention in which we transform the lived experience of Blackness in our world.” But it’s important to understand what those words mean. Today’s guest, Yolo Akili Robinson, the executive director of BEAM (Black Emotional and Mental Health Collective), explains how his organization utilizes healing justice to engage with marginalized communities. Yolo explains why he advocates for discussions surrounding mental health and mental illness in the Black community to include how racism, sexism, and other biases are deeply intertwined with psychology and psychiatry. **Guest Bio** Yolo Akili Robinsonis an award-winning writer, healing justice worker, yogi, and the founder and executive director ofBEAM (Black Emotional and Mental Health Collective). Yolo has worked primarily in three areas: Batterers intervention/family counseling with Black men and boys, HIV/AIDS, and healing justice/wellness. In 2018, Yolo was awarded the prestigious Robert Wood Johnson Foundation “Health Equity Award” for his work. He was also featured at the 2020 BET Awards as an “Empowerful Spotlight,” highlighting his work facilitating the vision of BEAM. His writings and work have appeared on Shondaland, GQ, Women’s Health, USA Today, Vice, BET, Huffington Post, Cassius, Ebony, Everyday Feminisms, and more. He’s the author of the social justice themed affirmation book, “Dear Universe: Letters of Affirmation & Empowerment for All of Us” and a contributor to Tarana Burke and Dr. Brené Brown’s anthology on Black vulnerability and shame resilience, “You are Your Best Thing.” You can find Yolo on Twitter@YoloAkili. **Inside Mental Health Podcast Host** Gabe Howardis an award-winning writer and speaker who lives with bipolar disorder. He is the author of the popular book, “Mental Illness is an Asshole and other Observations,”available from Amazon; signed copies are also availabledirectly from the author. To learn more about Gabe, please visit his website,gabehoward.com. **Episode Transcript** Producer’s Note:Please be mindful that this transcript has been computer generated and therefore may contain inaccuracies and grammar errors. Thank you. Announcer:You’re listening to Inside Mental Health: A Psych Central Podcast where experts share experiences and the latest thinking on mental health and psychology. Here’s your host, Gabe Howard. Gabe Howard:Hello, everyone, and welcome to this week’s episode of Inside Mental Health: A Psych Central Podcast, I’m your host, Gabe Howard, and I want to quickly thank our sponsor, Better Help. You can get a week free by visiting BetterHelp.com/PsychCentral. Calling into the show today we have Yolo Akili Robinson. Mr. Robinson is an award winning writer, healing justice worker, yogi and the founder and executive director ofBEAM, Black Emotional and Mental HealthCollective. He is also the author of the social justice themed affirmation book, “Dear Universe: Letters of Affirmation & Empowerment for All of Us.” Most recently, he has an essay featured in Tarana Burke and Dr. Brene Brown’s latest anthology, “You Are Your Best Thing.” Mr. Robinson, welcome to the show. Yolo Akili Robinson:Thank you. I’m excited to be here. Gabe Howard:Now, as a white male, my understanding of how mental health issues impact the black community is limited at best. Would it be OK if we started off with an explanation of how to approach mental health in black communities? Yolo Akili Robinson:Absolutely, it’s a great place to start. So to talk about approaching the concept of mental health in black communities, particularly from the perspective that BEAM takes, we use a framework we call healing justice. Healing justice, essentially believes that in order for our communities to heal, we have to consider the historical, ancestral, spiritual, emotional context and political context of how our traumas happened, but also how healing can happen. So with that being said, I think it’s important when we talk about black mental health to begin to understand the roots of what we now know as mental health, or western mental health. We have to take a little bit of a time warp and go back and look at the roots of how our current kind of understanding of mental health, which is used to be called mental hygiene, is really informed by this kind of really deep seated pathology, often rooted in the pathology that was more about helping people produce and that people who were not efficient producers were the folks who were labeled as mentally ill and how that particular legacy is also deeply connected to racism and sexism, particularly for black folks in this country who were subject to a variety of different harms under the context of the medical industrial complex. But often the course and the history of psychology and Western mental health, we’re considered not capable of having mental illness because mental illness is considered to be something that was a consequence of a higher consciousness or cognitive function, right? So Africans,people of Africandescent, our brains were thought to be smaller. I share those pieces because it’s really important to hold racism and ableism in the history of mental health because it gives us the context as to why our communities now are so hesitant and reticent around the framework. Gabe Howard:There’s a very interesting quote on your website that I’d like to discuss for a moment, and I’m going to read it verbatim, “BEAM realized that we could not, in good confidence, teach black folks about mental health without addressing the legacy of harm inflicted on black bodies historically through psychiatry and psychology. We also could not teach mental health without helping our communities expand and create models of care beyond traditional mental health systems.” This is really tough, right? Because it leaves me wondering what the best choice is. How have you managed to wrap all of this understanding into a path forward? Yolo Akili Robinson:So first off, there’s a variety of different ways in which we approach addressing mental health, and so one is we try to give people the tools and skills to advocate for themselves when navigating these systems. That we recognize that when black folks go into, whether it’s psychiatric care or any kind of medical care, that the bias deeply embedded by this country, of racism, sexism and misogyny go with them. We talk about black folks going to get psychiatric care and not being monitored in the same way that white folks are monitored in terms of those things like, you know, not even being monitored by the psychiatrist. We talk about the ways in which the disproportionate diagnoses of black folks are more likely to be diagnosed with schizophrenia as opposed to bipolar, right. And often receive mis-diagnoses. And so it’s not about saying don’t get care, but it is about how do we engage the system with the understanding that unfortunately a lot of the parts of the system have not always centered the interests of black folks and are deeply aware of the racism and sexism, misogyny and the transphobia that inform how they approach care. And so it’s one part of exposing that and giving people tools and skills. And a lot of our folks already have the skills and tools already because we’ve had to navigate this for so long. So we have insight about how we’re going to be perceived by white doctors, how people are going to think about when I show up in my black body with this condition. Yolo Akili Robinson:So, that’s one dimension. The other dimension that we’re talking about developing other systems of care. We talk about building out the fact that in many parts of the country, if you call for a mental health crisis, you’re going to get the police to come to your home. And we have so many examples. Korryn Gaines is one of many examples of when black people were going through a mental health crisis and the police were called, they ended up dead or they ended up severely harmed because unfortunately, those two systems are intertwined and the police don’t always have skills, or tools, or strategies to really de-escalate a mental health crisis without the use of violence and harm. And so when we talk about other systems, think about what would it look like? And we already have models that exist in many parts of the country where when someone is in a mental health crisis, the police don’t arrive because too often too many of the folks in our community talk about how when they want to set themselves into psychiatric care. They were like this is indistinguishable from a prison. Why are the institutions in our country that are supposed to support people who are mentally in distress, why are they designed like prisons? Why are the people treated as if they did something bad or wrong for existing? There is a need for us to reimagine mental health care, not only black folks will benefit from this, but all of us will benefit when we create and construct a new system. I would say that piece is not about discouraging people from getting care, but given the practical reality of what happens when you go into these systems, it’s also about helping us to reimagine the systems that we have developed as well. Gabe Howard:At the beginning of this episode, you spoke briefly about a concept called Healing Justice. Yolo Akili Robinson:Healing justice is a framework that was really created by Cara Page and the Kindred Healing Justice Collective. So this framework comes out of the work of mostly black, Latino, Asian, disabled, queer and trans folks who are really trying to move beyond the Western model that often suggested pick one person of their community and you take them to therapy. And somehow that alone is going to be enough for the transformation of their mental health. In order for our communities to be well, we have to transform the systems that we have to interrogate the legacy of untreated trauma for our folks. We have to change systems of incarceration, the prison industrial complex, systems of low wages, lack of access to care. We have to look at the entire model and really of the country and see that life change. And that is a mental health intervention. That there has to be community and systemic level healing for a new world to be possible. Right? It really turns, or challenges, a lot of concepts that are kind of inherent in some of the Western medicine kind of approaches. They really tend to like divorce or minimize racism, misogyny or transphobia as a really powerful and omnipotent structural and psychological forces they are. Yolo Akili Robinson:They really impede upon our everyday mental health. Healing justice is, it’s really is like a lens into looking at the world, the real issues. So, for example, if I am a black queer person in this country, a mental health intervention for our community, my community, might be multiple things, right. It might be getting access to clean water, which we know many black communities do not have. And maybe also when Black Lives Matter and different activities are shutting down bridges because of police brutality, that’s a mental health intervention. It’s saying, guess what? This is creating so much distress and trauma for our community that we need to do everything necessary to let you see that until you see that so this can stop. So it’s not just about individualized care, while that is an important piece of it, of course, the psychological and the behavioral. But it’s also about the systemic piece as well. And we have to address those alongside each other for our community to really cultivate wellness. Gabe Howard:Mr. Robinson as the executive director of BEAM, can you explain what role Healing Justice plays in the work that your organization does? Yolo Akili Robinson:BEAM is a national training movement, building and grant-making institution dedicated to the healing, wellness and liberation of black and marginalized communities. Our work really falls into three buckets. The first bucket is training and support. We are primarily a training institution. Our work is built on the premise that we just can’t rely on social workers and therapists for our communities to heal. We need everybody in the village or everyone in our community to have tools and skills to respond to mental health crises, but also to learn skills to help cultivate everyday wellness in their lives. And so a lot of our training and our support program, which is called Black Mental Health and Healing Justice, that peer support program really trains stylists, barbers, activists, parents, coaches, teachers, pastors who in our communities tend to be on the front line of responding to mental health distress or potentially helping to support people who may be on the path to mental distress. Recognizing when those folks have more skills and tools and knowledge to support our communities, as well as the discernment to be able to see that someone needs broader psychological interventions that our communities can be overall well and can cultivate wellness collectively as opposed to relying on a select professional class of people to understand these concepts. So a story that I often tell is of one advocate who shared a story about living with bipolar. Getting the diagnosis and her faith community and family telling her it wasn’t real and for years struggling because she believed that. Yolo Akili Robinson:And then one day sitting down with her stylist, getting her hair done, and the topic of mental health comes up. And she said, you know, I got this diagnosis, but I don’t believe in it. You know, I have my faith, etc. The stylist responded to her by saying, I hear that. I hear that about your faith. I’m a believer. I’m a Christian, too. And I also know that bipolar is real. And let me tell you what I know from my own family members. Let me tell you about somebody I actually know who’s a therapist that comes through here. She talks about how that moment changed her life. The second piece is our grant-making in which we give out money to support resources and efforts across the country. The first one is a black parent support fund. We get economic and other resources to black parents who are living with mental conditions or supporting children living with conditions. During the pandemic we have been especially concerned about focusing on that who are navigating being in close quarters with their children or themselves and their conditions and not being able to have the traditional coping strategies. And so to give them economic resources as well as access to other educational materials to support them. We also have a Southern support fund which gives money and resources to black folks who are living in the South who are doing innovative wellness work. Yolo Akili Robinson:And the last not least, we have a black world innovation fund, which really is about finding innovative strategies in black communities around mental health, everything from building more peer support circles to building out mental health literacy to developing alternative crisis response to the police. That is a big part of our work. But we also work with many organizations and many grassroots movements to kind of like build power and help address the other systemic structural issues. That’s kind of the short version of what we do and how we take it in terms of healing justice. We are very mindful that when we say black communities, we are not monolithic, that black means people of African descent, people who are African across the world. And we have people from everywhere, from Soweto to Vancouver, Canada, who come to our virtual programs that are part of our virtual community, which we love. But we also like to know we named it queer and trans, and our folks are also central to our communities. And so we try to create programing that doesn’t assume heterosexuality. Doesn’t assume the cognitive capacity, but really able to engage people wherever they are and help them feel included wherever they are in the training and education we create. Gabe Howard:We’ll be right back after a word from our sponsors. Sponsor Message:Is there something interfering with your happiness or preventing you from achieving your goals? I know managing my mental health and a busy recording schedule seemed impossible until I found Better Help online therapy. They can match you with your own licensed professional therapist in under 48 hours. Just visitBetterHelp.com/PsychCentralto save 10 percent and get a week free. That’sBetterHelp.com/PsychCentral. Join the over one million people who have taken charge of their mental health. Sponsor Message:Hey everyone, my name is Rachel Star Withers and I live with schizophrenia. I’m also the host ofInside Schizophrenia, a podcast that dives deep into all things schizophrenia. Featuring personal experiences and experts to help you better understand and navigate schizophrenia,Inside Schizophreniais a Psych Central and Healthline Media podcast and we are available right now on your favorite podcast player. Check us out! Gabe Howard:And we’re back with Yolo Akili Robinson discussing mental health in the black community. Mr. Robinson, let’s stay on peer support for a moment. What is the premise of the peer support model and then specifically, how does that model apply to the black community? Yolo Akili Robinson:Well, you know, I always tell people that peer support, of course, is nothing new in the United States or the world. Often in the West, peer support is often traced to, I believe, the 17th century France, or various different places, often in European history, talking about patients supporting patients. Well, I’ll tell you one thing. I don’t trace, for the United States. I don’t trace black people’s legacy of peer support, the concept of peer support to those institutions. I don’t trace it to the 1970s self-help movement. I think for black people, we trace our first cultivation of what we call peer support to really the time we landed here during our enslavement. And why I do that is because I think we have yet to interrogate the dimension of psychological and emotional support that had to be necessary for the black folks, African folks who landed here to discern what was going on to support themselves and the people they were with to survive this desolate and destructive and violent landscape that they entered into under American enslavement. What does it mean for crying and support and not speaking the language? What did it mean for emotional support? And so I trace our legacy of peer support really starts there because we had to build up communities of care and villages of care to get through that. Yolo Akili Robinson:And the fact that I am here is evidence that somehow something in us learned how to heal, learned how to thrive, learned how to create collective care and peer support. And when it comes to our concept of peer support is just what I said earlier. It’s about village care. It’s about the village has heightened understanding of mental health and wellness and is able to cultivate spaces and communities that center healing. And that is a radical intervention. The grass at the root, as opposed to once again focusing on an elite class of individuals who have select knowledge that no one else has access to who don’t share that knowledge. And so it’s like once again, it’s not about getting rid of therapists and psychologists, we’re always gonna need those levels and dimensions of professionals and people who are educated as well and those pieces. But we also can bolster the mental health literacy of our folk. We can lift up the education so that we know more so that we can advocate more for ourselves. That’s a big part of our peer support is building those communities of care and uplifting them. Gabe Howard:In the interest of full disclosure, I’m a certified peer supporter in the state of Ohio and I happen to know that many peer supporters look at their work as the way to help heal the traumas from their own past and their own journeys. But I’m also keenly aware that the work itself can reactivate that trauma. How does your organization deal with that? Yolo Akili Robinson:So a part of our training is that we take people through, there’s a recognition that we do talk about countertransference being activated as I like to use the language of that. Of course, when you are supporting people who are in distress, there will be moments in which you will be activated potentially by their distress. They may awaken an experience that you’ve had in the past. It may lead you to engage in something like something emotionally that you weren’t prepared to engage in and giving them ongoing tools and strategies to be able to discern when that’s happening and how to actually enforce a boundary and get other support to fill in the places where you’re not able to show up. If you have a village, the village means that there are multiple people who are present who can fill in where you can’t go in. And so what we have is this one tool on our website called the Community Care Map, and we’ll always tell people, we tell them all the time we can’t be the superhero for everybody. People need wraparound systems of care. So who are the people who can support this person or support you beyond just one person so that when you are activated, when you are no longer at capacity, when you are at your compassion fatigue, that you actually were able to call on other people, hopefully to help support that person, support yourself in those moments that are so important. I mean, we’re activated all the time. And this kind of cultural moment right now on the television, turn on Twitter, everything is so increasingly sensationalized, I would say. And sometimes we’re increasingly aware of the nature of how deeply embedded into the fabric of this country violence and harm are. It’s very important to make sure that peer support folks or anybody doing care and wellness work, really develop skills to practice discernment as much as possible and enforce boundaries on the collective care. Gabe Howard:Mr. Robinson, one of the things that I’m thinking about is the phrase cultural competency. We’ve heard a lot about that from the media. But your group takes it a bit further and talks about social justice informed mental health literacy. Is this just an extension of cultural competency or how does it go further? Yolo Akili Robinson:Yeah, I think you can just call me Yolo, as well. Gabe Howard:Oh, thank you, Yolo. Yolo Akili Robinson:Cultural competency for us is a little bit like we’re not sure if you ever really become competent in someone else’s cultural experience. And so cultural competency and social justice informed mental health literacy, not necessarily super connected, I think, about cultural competency and cultural humility being connected. And we definitely think cultural humility is a good framework where it really encourages us to understand that we will never have competence from a culture and that we need to learn to practice the skills of listening, be in a constant state of perpetual unlearning as well as learning and being willing to be wrong. And acknowledge like when they do come up like that and take efforts and behaviors to move forward to actually address those harms. Cultural humility for me over cultural competency. Social justice informed mental health literacy is really just our response to kind of what in this country has become mental health literacy. Much of the peer support programs, the education that we see in this country does not have an element of social justice to it, does not talk about the history of the DSM, the history of the ways in which black people and women and queer and trans folks have been treated by the psychiatric and mental health industrial complex. Yolo Akili Robinson:It doesn’t take into consideration the fact that many of our different identities can engage the institution even differently. Right. And so we had to build a framework that looked like under the umbrella of healing justice that was saying, hey, our mental health education has to be grounded and realistic. It cannot be divorced from the political social context because our people are not going to respond to that. We’re not going to talk about mental health if you’re not willing to talk about the fact that the first time I learned about mental health was when a social worker took away my cousin because of some mental condition, they ended up being in prison as opposed to being in care. So we don’t talk about those things. We’re not having conversations in our community. So social justice mental health literacy is really saying this is what we need. We need skills and tools and we need to kind of focus on the political and social context when we do that to make sure our people are getting what they need to be safe and supported, but also to be grounded and rooted. Gabe Howard:Yolo, I’m thinking about stigma and discrimination just a lot right now, because there’s stigma and discrimination toward the black community. There’s stigma and discrimination toward the mental health community. It’s just a lot to deal with. How does the stigma and discrimination against mental illness manifest specifically in the black community and how does it affect your work? Yolo Akili Robinson:One of our core concepts that we teach in any of our trainings is the idea of we all have internalized isms and so let me explain a little bit what that means. We, in our programs, we don’t ask the question, are you racist, sexist or transphobic, or ablest or do you have mental health stigma? We don’t ask that question. We think it’s a silly question because we don’t believe that any of us are exempt from having internalized these forces that deeply inform the nature of our reality from the media to our schools to everything. And so the question that is more useful is where is the racism and sexism and homophobia and the mental health stigma that you have learned all your life living in this culture, where is it showing up in your ideas, behaviors and choices? Asking from a place of not judgmental condemnation, but curiosity. Where is it? Because I’m not asking if it’s there? I know for myself, 39 years old, lived in a body, been perceived as a male all my life, in a world that is deeply misogynistic and has deeply deep hatred towards women, that shows up in systems and structures and media and a variety of other mechanisms. So I can live my 39 years in my body, in this body that’s privileged in relationship to many women and for a variety of different things. Yolo Akili Robinson:And I can have all the best politics in the world. But the reality is in some ways, those ideas are going to seep into my consciousness and into my behaviors. The curious thing is about where is it and how did it show up? Same thing for mental health. We think about the history of mental health, particularly in black communities. Or even just in American communities. What we’ve seen in the media, from Sybil to other kind of representations that have often not been humanizing. Those things inform how we think about mental health. And that means that they will inform how we’re able to offer peer support or how we talk about mental health or how we talk to ourselves when we are living with conditions. And so it’s really important for us to unpack that and to make sure it’s clear for all of our participants of our programs. Hey, you have mental health stigma internalized. I don’t care if you’re living with bipolar. I don’t care if you have family all your life with X, Y, Z. This country is deeply ableist and deeply committed to this idea of normal as opposed to neurocognitive diversity. This commitment to this idea of normal and normal often tends to be white and cis-gender and man and functioning a specific kind of way and give people the opportunity to kind of like engage that question and begin to integrate with their lives, hopefully help facilitate more consciousness of that so they don’t act and show up in their behavior or their ideas and their choices. Yolo Akili Robinson:But when it does, they’re able to redirect, take responsibility for that and hopefully address any harm. It’s not an easy thing. Many people come to our programs without a formal diagnosis. Diagnosis is a privilege, particularly for this country, for black folks, as many of us are not going to get access to care to get a diagnosis. Or we’re going to get a misdiagnosis. It’s really important to hold that and to continue to interrogate that. And we get a lot of pushback because we’re very unapologetic about the fact that the voices of black people living bipolar, black people living with borderline, black people living with schizophrenia, not just the ones that are kind of more comfortable for the mainstream conversations right now, which are often depression and anxiety. They are more common, completely understandable. But even when we discuss them tends not always to dive into the depth of complications. And now let’s dive into some of the most stigmatized conditions in this country, which tend to be like the personality disorders and bipolar and schizophrenia. So that’s a little bit how we handle it. Gabe Howard:Yolo, do you believe a better world is possible or are we just stuck this way? Yolo Akili Robinson:And that’s the one thing I would like to say and leave people with is that really another world is possible. If we decide that we want to center healing in our world, how that can transform our schools, how that would transform the way we work, how that would transform the way we relate to each other, the way we relate to the Earth, all these different pieces. And I think that for me at least, is a big part of what healing justice is calling us to do. It’s calling us to take care of folks who show up in a variety of different neurocognitive differences, but care for them in a way that is not centered on pathology and criminalization, but centered on care. And I really believe that healing justice is one useful framework and tool to help us get closer to the possibility, that world. And I encourage everyone listening to think about how your life could change if you center healing, whether in relationship to yourself or to the world, to the systems that you are part of and just know that healing can look so much more radical and more loving than what we have been told is the only opportunity for healing. So just be open and continue your path and do your work and struggle and love and do all those things but know that another world is possible. Gabe Howard:Yolo, thank you so much for agreeing to be on the podcast, it’s enlightening and it’s an important discussion and it’s one that I wish could continue. Where can folks find you and your organization, BEAM, online? Yolo Akili Robinson:So you can go to our website, which isBEAM.community, we are dot community, no dot com is there, justBEAM.community. You can also find us on Instagram at@_BEAMorg. There are tools and resources there, tools you can download and share and discuss and engage with your community. Gabe Howard:Yolo, thanks again for being here and to all of our listeners. Thank you for being here. Wherever you downloaded the show, follow, subscribe, it’s absolutely free and it will ensure that you don’t miss any upcoming episodes. My name is Gabe Howard and I am the author of “Mental Illness Is an Asshole and Other Observations,” as well as a nationally recognized public speaker. And I think that it would be awesome to be at your next event. You can grab a signed copy of my book with free swag or learn more about me just by heading over togabehoward.com. I will see everybody next Thursday on Inside Mental Health. Announcer:You’ve been listening to Inside Mental Health: A Psych Central Podcast from Healthline Media. Have a topic or guest suggestion? E-mail us atshow@PsychCentral.com. Previous episodes can be found atPsychCentral.com/Showor on your favorite podcast player. Thank you for listening. **RELATED** BEAM: Meeting Mental Health Needs in Communities of Color Inside Mental Health Podcast: Women of Color and Online Mental Health Inside Mental Health Podcast: LGBTQ+ Youth Suicide Prevention Black Lives Matter: Supporting Black Americans Against Systemic Racism Inside Mental Health Podcast: Transgender and LGBTQIA+ Mental Health **Read this next** BEAM: Meeting Mental Health Needs in Communities of ColorMedically reviewed byNicole Washington, DO, MPHBEAM is dedicated to breaking down barriers to mental health and wellness in communities of color.READ MORE BEAM is dedicated to breaking down barriers to mental health and wellness in communities of color. BEAM is dedicated to breaking down barriers to mental health and wellness in communities of color. Inside Mental Health Podcast: Women of Color and Online Mental HealthDiscussing disparities for women of color in mental healthcare on this episode of the Inside Mental Health podcast.READ MORE Discussing disparities for women of color in mental healthcare on this episode of the Inside Mental Health podcast. Discussing disparities for women of color in mental healthcare on this episode of the Inside Mental Health podcast. Inside Mental Health Podcast: LGBTQ+ Youth Suicide PreventionDid you to know that the risk of suicide among LGBTQ+ youth is almost 4 times higher than for non-LGTBQ+ youth? Listen to this podcast to learn more…READ MORE Did you to know that the risk of suicide among LGBTQ+ youth is almost 4 times higher than for non-LGTBQ+ youth? Listen to this podcast to learn more… Did you to know that the risk of suicide among LGBTQ+ youth is almost 4 times higher than for non-LGTBQ+ youth? Listen to this podcast to learn more… Black Lives Matter: Supporting Black Americans Against Systemic RacismEveryone at Psych Central is outraged against the continued violence against African Americans and those proteREAD MORE Everyone at Psych Central is outraged against the continued violence against African Americans and those prote Everyone at Psych Central is outraged against the continued violence against African Americans and those prote Inside Mental Health Podcast: Transgender and LGBTQIA+ Mental HealthAre you familiar with the concept of gender affirming care in medical treatment? Learn more in today’s podcast episode.READ MORE Are you familiar with the concept of gender affirming care in medical treatment? Learn more in today’s podcast episode. Are you familiar with the concept of gender affirming care in medical treatment? Learn more in today’s podcast episode. Moving Away from the Bias of the 'Broken Windows Theory'It was a sociological theory that led to systematic oppression in underprivileged communities. Here are details.READ MORE It was a sociological theory that led to systematic oppression in underprivileged communities. Here are details. It was a sociological theory that led to systematic oppression in underprivileged communities. Here are details. How Critical Race Theory May Help Inform Trauma-Sensitive TeachingTrauma-informed teaching including critical race theory could help create a more holistic and inclusive approach.READ MORE Trauma-informed teaching including critical race theory could help create a more holistic and inclusive approach. Trauma-informed teaching including critical race theory could help create a more holistic and inclusive approach. How Acknowledging the Past Can Help Black Women Protect Their FuturesGaping health disparities persist for Black women who are often under-treated and not taken seriously by medical health professionals. There are ways…READ MORE Gaping health disparities persist for Black women who are often under-treated and not taken seriously by medical health professionals. There are ways… Gaping health disparities persist for Black women who are often under-treated and not taken seriously by medical health professionals. There are ways… Substance Use, Incarceration, and the Black CommunityMedically reviewed byNicole Washington, DO, MPHDisproportionate incarceration rates involving substance-related offenses are prevalent in the Black community. But there are ways to address this…READ MORE Disproportionate incarceration rates involving substance-related offenses are prevalent in the Black community. But there are ways to address this… Disproportionate incarceration rates involving substance-related offenses are prevalent in the Black community. But there are ways to address this… Depression in Puerto Ricans: Exploring Mental Health DisparitiesMedically reviewed byKarin Gepp, PsyDPuerto Ricans have one of the highest rates of depression in the United States. Colonialism, racism, and unique challenges in acculturation may be…READ MORE Puerto Ricans have one of the highest rates of depression in the United States. Colonialism, racism, and unique challenges in acculturation may be… Puerto Ricans have one of the highest rates of depression in the United States. Colonialism, racism, and unique challenges in acculturation may be… About Us Contact Us Terms of Use Privacy policy Privacy Settings Advertising Policy Medical Affairs Content Integrity Newsletter Find a Therapist Your Privacy Choices © 2025 Psych Central, a Healthline Media Company. All rights reserved. Healthline Media is an RVO Health Company. Our website services, content, and products are for informational purposes only. Psych Central does not provide medical advice, diagnosis, or treatment.See additional information. OUR BRANDS"}