{"id": 326, "name": "The Daily Northwestern", "domain": "dailynorthwestern.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://dailynorthwestern.com/2024/11/06/featured-stories/in-focus-students-and-staff-report-some-dining-workers-for-harassment-compass-transfers-them-and-misconduct-continues/", "title": "In Focus Students And Staff Report Some Dining Workers For Harassment Compass Transfers Them And Misconduct Continues", "content": "Arts & Entertainment Campus City Opinion Sports Print Advertise Awards Classifieds Contact Donate Editorial Board Former Daily Editors Join The Daily SPC More **The Daily Northwestern** **The Daily Northwestern** Arts & Entertainment Campus City Opinion Sports Games AboutAdvertiseAwardsClassifiedsContactDonateEditorial BoardFormer Daily EditorsJoin UsSocial MediaStudents Publishing Company Advertise Awards Classifieds Contact Donate Editorial Board Former Daily Editors Join Us Social Media Students Publishing Company Advertise Awards Classifieds Contact Donate Editorial Board Former Daily Editors Join Us Social Media Students Publishing Company MultimediaAudioPhotoVideo Audio Photo Video Audio Photo Video PrintPast IssuesPrint Archives Past Issues Print Archives Past Issues Print Archives More **The Daily Northwestern** **The Daily Northwestern** Arts & Entertainment Campus City Opinion Sports Games AboutAdvertiseAwardsClassifiedsContactDonateEditorial BoardFormer Daily EditorsJoin UsSocial MediaStudents Publishing Company Advertise Awards Classifieds Contact Donate Editorial Board Former Daily Editors Join Us Social Media Students Publishing Company Advertise Awards Classifieds Contact Donate Editorial Board Former Daily Editors Join Us Social Media Students Publishing Company MultimediaAudioPhotoVideo Audio Photo Video Audio Photo Video PrintPast IssuesPrint Archives Past Issues Print Archives Past Issues Print Archives More **The Daily Northwestern** **The Daily Northwestern** **In Focus: Students and staff report some dining workers for harassment. Compass transfers them — and misconduct continues.** Content warning: This story mentions sexual harassment and racism. McCormick junior Yaa returned to her dorm in tears on Feb. 11. She recalled grabbing a tub of ice cream and spending the rest of the day under her covers. Three days later, Yaa accused an Allison dining hall worker of a pattern of sexual harassment in a written complaint. Her report detailed a series of sexualizing comments and interactions that spanned months. “The shift in the nature of (the employee’s) compliments and him hugging me have caused me much uneasiness and discomfort,” Yaa wrote in the complaint. She asked to go by a pseudonym for fear of retribution from the worker. Compass Group, the company that runs Northwestern’s food service, placed the employee on leave after receiving the report, according to dining hall workers familiar with the situation. After filing, Yaa said she didn’t encounter him in Allison again, and she began to feel comfortable dining there. But later, she recalled seeing the employee working at MOD Pizza in Norris University Center. His reappearance came as a shock, she said, because no one had told her he was returning to work. And since she was working in Norris just a floor above the restaurant, she found it difficult to avoid him. “I don’t know if blindsided is the right word,” Yaa said. “But then it’s like, I was transparent and I’d opened up about something that was difficult to talk about, so I expected a lot more.” Yaa’s experience is not unique.Interviews with and written complaints from over a dozen students and dining hall employees reveal a lack of transparency about Compass’ complaint process, including for allegations of abuse and sexual harassment. In addition, Compass quietly shifted employees accused of misconduct to different facilities on several occasions. A Compass spokesperson told The Daily these transfers are not an attempt to avoid disciplinary action or termination, but “a deliberate effort to resolve the situation in a fair and equitable manner.” However, transfers are frequent enough that some dining workers said they have come to view employees moved into their workplace with suspicion. Workers saw getting moved as one step closer to getting fired, as one Allison employee put it. But often, these individuals were not fired, at least not until they had been moved several times. And abusive behaviors often followed the employees to their new locations, several workers told The Daily. “What the f— is the point?” asked one Foster-Walker Complex dining hall employee, who asked to remain anonymous for fear of retribution from management. “You remove the abusive person here so she can go abuse other people? What problem does that solve?” ‘I was just shocked’ The employee Yaa filed a complaint against was a cook at the Pure Eats station in Allison, where cooks hand food to diners over a glass divider. For Yaa, the food also often came with one of the cook’s comments. They started out small, Yaa said. A compliment about her skin. Another about how pretty she looked that day. Yaa’s friend, who requested anonymity for fear of retribution from the Allison cook, recalled receiving similar remarks. For months, Yaa viewed the comments as innocent, even when they started making her uncomfortable. For example, she remembered thinking it was odd when he called her a “beautiful Nubian queen” while he walked by her table. The cook did not deny making the comments about Yaa and her friend but said he wanted “encourage them” and said the students misconstrued his words. “There was nothing lewd,” he said. “I don’t say things to make them uncomfortable.” But the employee’s actions became more explicit as Fall Quarter 2023 passed, Yaa said. Once, while Yaa was waiting for the cook to serve her food, he commented on the gloss of her lips. Then, he asked her to walk around the divider separating them and to give him a kiss on the cheek, she recalled. In her complaint, Yaa wrote that the cook asked for a kiss jokingly. But combined with his prior string of comments, Yaa said she began to feel uncomfortable in the cook’s presence. “It’s either he doesn’t say anything, or if he does say something, it’s something crazy,” Yaa said. Yaa spent the rest of the quarter avoiding Allison’s Pure Eats station whenever possible. She said she recruited friends who would scout out Allison before meals and send her a text if they saw the cook. And when she did visit the dining hall, she grabbed food from the other stations and took it to go to avoid the cook. On occasion, particularly when the cold grew more biting and walks to farther dining halls grew less appealing, Yaa found herself spending money on delivery services to avoid going to Allison. Then, about a month after returning from Winter Break, while Yaa and her friend were sitting at a table in Allison, the cook approached Yaa from behind. He placed his arm around her shoulder and eyed her face, according to Yaa and several witnesses. “You know what you’re doing,” he said to her, according to Yaa’s complaint. The comment wasn’t explicitly sexual, but the way he said it — “provocative,” as Yaa recalled — made it seem so. “I was stationary,” Yaa said. “I was just shocked.” The cook said the only time he had physical contact with a student was after one sold him a box of Girl Scout cookies. He thanked her with a hug. Yaa said she has never been a part of Girl Scouts or sold cookies for the organization. “They’re calling me a sexual assaulter,” the cook said. “I’m not gonna wear that badge.” Mary Flemming, an Allison employee known to students as Ms. Mary, said she and a coworker watched the incident with Yaa from a nearby table. “Shocked” and twisted into a frown is also how Flemming remembered Yaa’s face when the cook’s arm was around her. “She’s going to report him,” Flemming recalled her coworker saying. Flemming said she also had a series of negative encounters with the same Pure Eats cook who Yaa reported. She said he would snap at her for talking with students, or he would call her a “b—-” under his breath or even in front of students. It boiled over in May 2023, when Flemming said she found herself just outside Allison, ready to fight the Pure Eats cook. The way she tells it, he called her a “b—-” for greeting a student during breakfast. When Flemming confronted him about it, he pressed a spatula against her cheek and threatened to fight her outside, she said. The cook said he did not start the fight with Flemming but acknowledged calling her a“b—-.” Harassment toward women is commonplace in NU kitchens, according to Plex dining hall workers Emily and Corey, who requested pseudonyms, fearing retribution from supervisors. A Compass Group spokesperson said the company conducts comprehensive sexual harassment training for all associates and new hires on an annual basis. But Emily said she experienced sexual harassment in 2022, just a few months after joining Compass. Her supervisor at Elder dining hall would make suggestive comments toward her, she said. One evening, as they were closing for the night, Emily said he grabbed her by the wrist and pulled her into a nook near the salad bar. Emily, who said she has trauma from previous sexual harassment, remembered going into shock. “You’re so pretty,” she remembered the supervisor saying. “Tell your boyfriend he’s lucky and to tell you that daily.” The way he said it, and the wink he gave her afterward, made Emily fear the supervisor was insinuating something more, she said. “I just kind of froze up,” Emily said. “The rest of the conversation is just blank.” She also remembered hearing the supervisor make sexual comments toward students, she said. Soon after he cornered her, she filed a written complaint against him. The supervisor then disappeared, Emily said. But like the Pure Eats employee whom Yaa reported, he later began working for Norris. ‘Brush it under the rug’ Flemming and her coworker were right. Yaa would go on to file a complaint against the cook. But it wouldn’t happen the day the employee put his arms around her. Yaa said she had a chance to verbally recount her experience to an Allison manager that day. She first approached Flemming about reporting the cook just a few minutes after their interaction. However, Flemming told her the complaint would be better handled by a manager. When the manager and Yaa found a table in Allison to chat, the Pure Eats employee brought his lunch to a table just a few feet behind them. Yaa said she suspected him of listening in on her attempt to report his behavior, so she left and instead sent the complaint in an email to the manager. However, not everyone pursues their complaint through Compass’ reporting system, which some dining hall employees described as taxing on victims. When Compass employees report a coworker, they often opt to file a written complaint with managers, similar to what Yaa did. Complaints, either written or verbal, are processed in-house, often by managers and sometimes by HR. The University administration has little access to this process since it’s Compass that conducts the reviews. While the complaint system is Compass policy, dining workers can also file a grievance as outlined in the workers’ union contract with UNITE HERE Local 1. The contracthas been under tense renegotiationssince it expired in August. But workers only have seven days after an incident to file a grievance, and filing one requires making a trip to Chicago, deterring employees from using the process. Instead, many turn to Compass’ complaint system. But once workers file their complaints, they seldom hear much about them, several workers told The Daily. This lack of transparency can make it difficult for workers to deduce what evidence Compass has reviewed when it decides to sanction workers. It can also catch employees off guard when the person they reported suddenly returns to work. To some, it also feels like this hazy process enables Compass to cover up its employees’ problematic behavior. A Compass spokesperson said the company is committed to transparent processes as well as government and union obligations. “Bad habits (have) been going on for a long time here, and they brush it under the rug because they don’t want to deal with it,” Flemming said. “And it’s not just here — it’s at all of these dining halls.” The most informal of these complaints within Compass’ system are verbal ones, which involve alerting managers to problems and letting those managers sort out the issue themselves. For example, Flemming said she filed numerous verbal complaints with managers against the Pure Eats cook in the year before Yaa reported him.But managers kept them working next to each other, and the cook continued his comments toward her, Flemming said. While they are the easiest to file, verbal complaints can be the most unpredictable form of redress for employees. Many employees, including Flemming, said they felt like their personal relationship with their supervisor determined how seriously their complaint was taken. Several employees said they tend not to disclose problems to managers with whom they’re on bad terms, fearing the manager might squash their complaint or retaliate against them for it. Mia Harris, a former employee at the Starbucks inside Norris, said she had been left working by herself for seven hours without a break and ignored by her floor supervisor.This was one of many instances in which Harris remembered having to work while the shop was understaffed during her tenure from September 2023 to May 2024. “It’s been hell,” Harris said. “I come home, and I’m totally exhausted.” In April, she told Compass HR about being left alone for hours. In a meeting that HR arranged later on, Harris gave a step-by-step account of her story, only to be sent away with an apology for the “poor experience,” she said. Feeling unsatisfied with how her complaint was handled, she quit her job. “You can tell somebody, ‘Oh, this isn’t right,’” said one Allison employee, who asked to remain anonymous to avoid retribution from coworkers. “But if they have people backing them up, and they have people behind them and protecting them, what’s the point of even wasting your energy?” Managers don’t always act as filters for complaints though, Flemming said. She used to work as a supervisor at Sargent dining hall and said she was expected to write out every complaint that she received verbally and submit them to Compass. A Compass spokesperson said managers document each complaint and report it to the appropriate HR representative. “Compass Group takes all associate concerns seriously, addressing each formally and with thoroughness. Investigations are conducted for any verbal or written complaint submitted, and disciplinary actions are taken based on findings,” the spokesperson said. But now, Flemming said she suspects managers and supervisors aren’t filing the paperwork for these complaints. It takes time to write up an employee’s complaint, and she said Compass isn’t holding managers accountable for failing to do so nowadays. “The people that they are bringing in now, it seems like they don’t care,” Flemming said. Some workers said verbal complaints can also find their way into gossip channels, circulating around the dining hall and to the subject of the complaint. “If you speak up, call out a problem, you will be the one punished,” Corey said. ‘Keep it hush’: written complaints Last academic year, Corey said she had thought about filing a different set of complaints about her manager at Plex dining hall. It came to a head when Corey’s manager, angry that Corey came to the dining hall on a day off, pulled her down one of the kitchen’s hallways and into an office. “You people aren’t allowed to do that,” Corey and Emily remembered the manager saying to Corey. Both Emily and Corey, who is Black, described the comment as “racist,” alleging that the manager, who is white, aimed “you people” at Black workers generally. “It made me question her as a manager,” Corey said. “It made me question her as a person. I felt very attacked.” Corey’s manager referred The Daily to Compass, which did not comment on the specific allegations against her. Corey said she’d heard other employees complain about the manager’s language being racist, so she considered filing a complaint of her own, she said: a written one. Uncertain if managers are doing the paperwork for their complaints, employees sometimes opt to submit documentation themselves. They can submit complaints in writing, delivering them to a manager or Compass’ HR, who then conducts an investigation. It’s more formal than a verbal complaint, and it’s the process through which many harassment cases are handled. But when workers do end up filing a written complaint, the ensuing process is often opaque. At the end of the process, employees may see the subject of their complaint reappear at a new location without prior notice. “I also do feel like HR is also part of the problem,” Corey said. “As you can see, they just move management from one place to another instead of actually doing something.” After the altercation with the Pure Eats cook in May 2023, Flemming decided that verbal complaints wouldn’t cut it anymore. She said she also filed a written report. In a letter to HR, she said she detailed all of the interactions that led to the near fight in her mind: the times he called her a “b—-,” how he stuck a spatula in her face, how he proposed the fight. Flemming remembered HR meeting with her and the cook separately to get their perspectives on the experience. But after those meetings, Flemming said she didn’t hear anything else until she got a letter from HR placing her on probation for one year.Flemming doesn’t have the letter anymore — she said she tossed it in the trash in a fit of anger.But she remembered it chastising her for being “aggressive” during the encounter with the Pure Eats cook. Since her complaint was reviewed internally by Compass, Flemming doesn’t know what evidence led it to that conclusion.Compass declined to comment on the specific investigation. “I don’t know what happened to him because he went from being a villain to being a victim,” Flemming said. Yaa said she also heard nothing back from Compass during its investigation into the Pure Eats cook. Not when he was suspended, nor when he came back to work at Norris. Instead, Yaa and her friends discovered his return on their own. The cook denied the veracity of Yaa’s complaint. It was a similar story when Emily first reported her supervisor at Elder. She said she initially approached her manager about the supervisor cornering her next to the Elder salad bar, and the manager encouraged her to file a written complaint.Emily said she submitted a handwritten note detailing her experience and the name of a coworker who agreed to corroborate her experience. Though Emily’s manager delivered her complaint to Compass’ HR, she said she didn’t hear anything about an investigation afterward. Somewhere during the process, someone in HR reportedly made the decision to move the supervisor to Norris and to bar him from interacting with Emily.But she said it was her manager who told her that, not HR. She added that she was not entirely sure who had made that decision, or even if her manager had reported it to her correctly. “They were trying to keep it hush, now that I think about it,” she said. ‘Pick your battles’ Later in 2022, after she had filed the complaint against her supervisor, Emily found herself hiding in one of the back rooms in Plex.One of her coworkers told her they had seen the supervisor in a hallway. Despite his purported instructions to stay away from Emily, who had left Elder for Plex, he was looking for her. Emily remembered trying to alert her manager about the supervisor.But the manager rebuffed her, Emily said, explaining that she was too busy to do anything about the situation. “I was just there waiting, and I would come out to see if he was still there,” Emily said. Employees may get moved to new facilities after complaints against them, but their patterns of problematic behavior often continue. For workers at the employee’s new facility, this often means giving them a wide berth. And for those who reported the worker, it often means continuously checking over their shoulder, even long after their complaint has supposedly been resolved. “You learn to ignore some of it,” Corey said. “You learn to pick your battles.” By the end of Spring Quarter, Corey’s manager was working alongside NU Dining peers, this time at Shake Smart. Shake Smart employee Sasha, who asked to go by a pseudonym for fear of retribution from the manager, was one of several employees who asked for the manager’s reassignment when they both worked at Plex. For Sasha, fruitless email exchanges with the HR office became a routine. She and several Plex employees soon asked to be transferred to escape their manager. But just when Sasha accepted her new position at Shake Smart and thought she had moved on for good, the manager was also assigned there. “I was just like, ‘out of all locations,’” Sasha said. “It is frustrating because I left that place because of her.” Shortly after hiding in the back room, Emily said she was approached by the union to write a new complaint against her former supervisor.This time, it would join allegations from other female workers of similar behavior from the supervisor after he was moved to Norris, Emily said. Emily didn’t end up filing her complaint, but the chorus of allegations was enough for Compass to fire him, according to several workers familiar with the situation. “We have to protect ourselves, each other,” Emily said. The worker Yaa reported is no longer a cook and is currently working at MOD Pizza. While he does not know who reported him, he said a complaint led to his “bulls—” removal from Allison. He told The Daily that he has been in talks with Compass to regain a cook-level position in Chicago. For the first few weeks of Spring Quarter, Yaa said she returned to relying on her rotation of friends to report when he was working. Other times, she would send friends to grab pizza from MOD for her. It wasn’t enough to keep her from bumping into the cook in the Norris hallways. In Spring Quarter, that happened about once per week, she estimated. Yaa said he called out comments about her appearance whenever they crossed paths, similar to the ones that led her to file a complaint.He seemed unaware that she was the one who reported him, so Yaa said she had to find ways to scamper away whenever they interacted. But Yaa said she’s done filing complaints. She said she feels jaded by how little her circumstances have changed and the opaque process that it took to accomplish even that much. “I’m not going to do this again,” Yaa said. “I don’t want to go through this process again.” Email:[email protected] X:@charcole27 Email:[email protected] X:@Jerrwu **The Daily Northwestern** **The Daily Northwestern** AboutContactEditorial BoardFormer Daily EditorsAwardsStudents Publishing Company Contact Editorial Board Former Daily Editors Awards Students Publishing Company Contact Editorial Board Former Daily Editors Awards Students Publishing Company AdsAdvertiseClassifieds Advertise Classifieds Advertise Classifieds MoreDonateToday’s PaperPrint ArchivesConnectComment policyTerms of Use Donate Today’s Paper Print Archives Connect Comment policy Terms of Use Donate Today’s Paper Print Archives Connect Comment policy Terms of Use **The Daily Northwestern** **The Daily Northwestern** **The Daily Northwestern** **The Daily Northwestern**"}