{"id": 2217, "name": "News Biscuit", "domain": "newsbiscuit.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://www.newsbiscuit.com/post/london-council-announces-groundbreaking-plan-to-ignore-new-petition-of-100-000-signatures", "title": "London Council Announces Groundbreaking Plan To Ignore New Petition Of 100 000 Signatures", "content": "Home Home Home Home Podcast Podcast Podcast Podcast Captions Captions Captions Captions Writers' Room Writers' Room Writers' Room Writers' Room All News All News All News All News Writer of the Month Writer of the Month Writer of the Month Writer of the Month Shop Shop Shop Shop About About About About More More More NewsBiscuit The UK’s original fake news All Posts Front Page News in Brief Headlines Features From the Archive Caption Competition Cartoons Politics Sport/Entertainment Lifestyle Science/Business Local News Promotional material Podcast **London Council Announces Groundbreaking Plan to Ignore New Petition of 100,000 Signatures** Guest Author 6 days ago 1 min read Updated:5 days ago A well-known London Council, celebrated for persistently ignoring residents’ opinions on matters that deeply affect them has launched an innovative plan to completely ignore a new petition supported by 100.000 people. “We are very excited to announce that we will be ignoring the petition of 100,000 signatures. But that's not all —we’ll also be ignoring any court result, public activism, environmentalists, and, in general... everyone.” The council reassures that a comprehensive review process has been undertaken to ensure nobody has been listened to, no opinions have been considered and no voices have been heard. “We will keep engaging with all residents to create more dialogue opportunities where no listening will be involved” , said the lead councillor. “This has only been possible thanks to all the public feedback initiatives that have been hosted with a deep sense of indifference” “We really need to hear what community groups and local businesses have to say so we can be more precise when it comes to completely ignore them and implement our already made decisions” “Even if some people may want to be heard, most of the people certainly want to be ignored, we can’t please everyone, can we” , said the councillor. The governing body has also communicated the new plans for public consultations, where all community input will be recorded on scented paper and cute stationery, then used as wallpaper in the Town Hall, to ensure everyone feels a deep sense of belonging. image frompixabay author: Alba Late www.newsbiscuit.com Tags: London Opinion Council Planning Permission Survey News in Brief Local News Lifestyle **Recent Posts** **Back to Top** **Subscribe for updates** Thanks for submitting! Home Podcast Captions Writers' Room All News Writer of the Month Shop About **NewsBiscuit on Flipboard** © 2023 NewsBiscuit"}