{"id": 2047, "name": "Minding the Campus", "domain": "mindingthecampus.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.mindingthecampus.org/2025/06/10/after-years-of-anti-asian-bias-harvard-crowns-anti-semitic-asian-professor-with-honorary-degree-right-after-denying-anti-semitism/", "title": "After Years Of Anti Asian Bias Harvard Crowns Anti Semitic Asian Professor With Honorary Degree Right After Denying Anti Semitism", "content": "Home Latest American Revolution Minding the Sciences Minding the World Donate **After Years of Anti-Asian Bias, Harvard Crowns Anti-Semitic Asian Professor with Honorary Degree—Right After Denying Anti-Semitism** By Ian Oxnevad June 10, 2025 zero comment In Boston’s Beacon Hill, there are gaslampsthat appear to be quaint vestiges of the city’s Victorian past. Harvard, located three miles away, is giving the district a run for its money when it comes to gas lighting. Look no further than Harvard’s honorary degree recipient,Elaine Kimfrom the University of California, Berkeley, to see the Ivy League attempt to disavow anti-Semitism while embracing someone who embodies it on campus. Amid Harvard University’s fight to protect its foreign students from the Trump administration’svisarestrictions, to combat ongoing anti-Semitisminvestigations, and moves to defund the school through the government’s cancellation of grants and major donors’ withholding of donations, the university showed its true colors. In granting Elaine Kim an honorary degree, Harvard exemplifies the irony and moral decrepitude that have come to characterize higher education. After Secretary of State Marco Rubioannouncedthat the Department of Homeland Security would begin revoking student visas from China due to national security concerns, Harvard did the predictable thing and sued the government on the grounds that it violated the First Amendment, the Due Process Clause, and the Administrative Procedure Act. Certainly, not all Chinese students are spies for the Chinese Communist Party; however, even students who may love the West and hate Beijing are subject topressureand threats from their homeland. American intelligence agencies havelong warnedabout the threat of student spies. The recentcaseof Chinese spies at Stanford University confirms that the threat is real. Harvard has over 1,000 Chinesestudentswho might face their visas getting revoked. [RELATED: Harvard Sets the Tone—And It’s Off-Key for Jews] To signal its disdain for Trump, Harvardchosea Chinese student to give the commencement address, while the university’s salutatorian spoke in Latin anddeclared, “Neither powers nor princes can change the truth and deny that diversity is our strength.” That Harvard is keen to protect students from China while having recently suffered a legal blow over systematic discrimination against Asian-American students over the course of years exemplifies ideological double standards in higher education. In 2013, well before the drama of the Trump years, Harvard wassuedby the nonprofit group, Students for Fair Admissions (Students for Fair Admissions Inc. v.President and Fellows of Harvard College)for violating the Fourteenth Amendment and discriminating against Asian students in admissions. After a decade-long legal battle that made its way to the Supreme Court, justices ruled in a 6-2 ruling that indeed Harvard illegally and unconstitutionally discriminated against students based on race. When examining student records, Students for Fair Admissions claimed itdiscoveredthat Harvard ranked Asian-American students as “lower in personality and likability ratings” compared to other students. According to theopinionof the Supreme Court, the university’s main response to criticism that it was racist in its admissions was simply “trust us.” The courtstatedthat Harvard’s “race-based admissions systems … fail to comply with the twin commands of the Equal Protection Clause that race may never be used as a ‘negative’ and that it may not operate as a stereotype.” Harvard’s commencement was already built upon irony, but it turned its graduation ceremony into a full opera of hypocrisy when it awarded Elaine Kim, aprofessorof Asian American cultural studies and feminism, an honorary degree. Kim was a controversial choice given her opensupportfor the United States Campaign for the Academic and Cultural Boycott of Israel (USACBI) and the overall Boycott, Divestment, and Sanctions (BDS) movement. Despite being an emeritus professor, Kim is active in her animosity towards Israel, having openlyendorsedboycotting the Batsheva Dance Company’s U.S. tour just this year. Kim’s support for BDS and the anti-Semitism it represents is not unusual. [RELATED: Harvard’s ‘Abysmal’ Year Continues] The National Association of Scholarsdemonstratedhow ethnic studies and various identity groups coalesce around BDS and justify their actions through frameworks of critical theory. What is unusual is why Harvard chose to bestow an honorary degree on an anti-Semitic emeritus professor. Harvarddefendedits choice by declaring that “recipients are chosen based on a candidate’s overall lifetime contributions and accomplishments.” On the question of anti-Semitism, Harvard turned up the gaslight to a full glow when itassertedthat the university “strongly opposes academic boycotts.” In other words, Harvard wants you to know it does not condone anti-Semitism, but overlooks the anti-Semites it needlessly awards. Added up, Harvard’s commencement on the surface is the stuff of dark comedy about a school tossing Molotov cocktails on its own reputation while it is already burning. Last year, polls revealed that the public’sperceptionof Harvard was already at a record low. Megadonor hedge fund billionaire Bill Ackmanassertedrecently that it would be worth revoking Harvard’s tax-exempt status. Even Harvard’s enrollment isdown, and not due to falling birth rates. Defending student visas from Communist China after discriminating against Asian-Americans and awarding anti-Semites whiledeclaringit is working against anti-Semitism would be hilarious if it were not so twisted. Harvard’s dark, gaslit comedy highlights everything that is wrong with higher education. The identity politics, virtue signaling, and racism when it is conducive to higher-ed’s own ideological interests are what make today’s American universities run. If universities did not have double standards, they would have none at all. Image: “Harvard University graduation seating” by Caroline Culler onWikimedia Commons **Author** Ian OxnevadIan Oxnevad is senior fellow of foreign affairs and security studies at the National Association of Scholars.View all posts Ian Oxnevad is senior fellow of foreign affairs and security studies at the National Association of Scholars. Ian Oxnevad is senior fellow of foreign affairs and security studies at the National Association of Scholars. **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Δ **Sign Up for Our Weekly Newsletter, “Top of Mind”** Δ **Education Roundup** “Why Does American Higher Education Work So Poorly?” —James G. Martin Center for Academic Renewal, 6/11/25 “U of Utah Partnership With Institution in Occupied West Bank Draws Opposition” —Inside Higher Ed, 6/11/25 “At least 3 Louisiana universities force future teachers to take DEI classes: report” —College Fix, 6/11/25 “These Scientists Are Attacking Biology” —City Journal, 6/11/25 “How Harvard lost America” —Spectator World, 6/10/25 “House Committee To Investigate Harvard’s Hiring Practices for Racial Discrimination” —Harvard Crimson, 6/10/25 “University of Minnesota eyes steep tuition hikes and budget cuts” —Higher Ed Dive, 6/10/25 “The Emotionally Intelligent Classroom” —RealClear Education, 6/09/25 “In Public, Harvard Is Fighting Trump. Quietly, It’s Dismantling a Program the White House Doesn’t Like.” —Chronicle of Higher Education, 6/09/25 “Foreign Funding’s Questionable Odor” —James G. Martin Center for Academic Renewal, 6/09/25 “In Texas, University Presidents May Soon Control Faculty Senates” —Inside Higher Ed, 6/09/25 “SIU med school dean urges resistance to Trump executive orders” —College Fix, 6/09/25 “The DEI-Fueled Collapse of a Virginia Magnet School” —American Conservative, 6/09/25 “The top choice for UF president was rejected. What’s next?” —Independent Florida Alligator, 6/09/25 “Visa to Harvard Postdoc Was Denied Under Trump’s Proclamation in Breach of Judge’s Temporary Halt” —Harvard Crimson, 6/08/25 “Top takeaways from OCR nominee’s Senate confirmation hearing” —Higher Ed Dive, 6/07/25 “Judge Approves Landmark Settlement Changing the Way College Sports Are Run” —Chronicle of Higher Education, 6/07/25 “U.S. Department of Education to Implement New Identity Validation Processes to Combat Student Aid Fraud” —U.S. Department of Education, 6/06/25 “Defund The NAS!” —Manhattan Contrarian, 6/07/25 “Thousands of College Students Could Soon Lose Their Pell Grants” —Chronicle of Higher Education, 6/06/25 “Northwestern’s Silence: How Campus Antisemitism Thrives” —RealClear Education, 6/05/25 “Trump Is Right About Affirmative Action” —Atlantic, 6/05/25 “Can India create its own Ivy League?” —Economist, 6/05/25 “If Harvard Is Serious About Combating Racial Discrimination, She Will Immediately Dismantle DEI Programs” —Harvard Salient, 6/04/25 “Trump Wants to Cut Tribal College Funding by Nearly 90%, Putting Them at Risk of Closing” —ProPublica, 6/03/25 “Duke University Press Stays Woke” —James G. Martin Center for Academic Renewal, 6/02/25 “The Commencement Address Harvard Needs” —National Review, 6/01/25 “Don’t Let Trump’s Brutality Fool You. The Internationalization of American Schools Is a Real Issue.” —New York Times, 6/01/25 “Freedom from Exam Hell” —Plough, 5/26/25 **Article Archives** **MTC** About Us Apply to Minding the Campus’s Internship Program Donate Privacy Policy Terms of Service Write for MTC"}