{"id": 1087, "name": "Patriotic Millionaires", "domain": "patrioticmillionaires.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://patrioticmillionaires.org/perspectives/dont-fall-for-the-idea-that-the-rich-pay-their-fair-share/", "title": "Dont Fall For The Idea That The Rich Pay Their Fair Share", "content": "The Millionaires PrioritiesTax the RichPay the PeopleSpread the Power Tax the Rich Pay the People Spread the Power Tax the Rich Pay the People Spread the Power Perspectives MediaIn the NewsPress ReleasesSpeakers Bureau In the News Press Releases Speakers Bureau In the News Press Releases Speakers Bureau AboutBoardCareersTeam Board Careers Team Board Careers Team The Millionaires PrioritiesToggleTax the RichPay the PeopleSpread the Power Tax the Rich Pay the People Spread the Power Tax the Rich Pay the People Spread the Power Perspectives MediaToggleIn the NewsPress ReleasesSpeakers Bureau In the News Press Releases Speakers Bureau In the News Press Releases Speakers Bureau AboutToggleBoardCareersTeam Board Careers Team Board Careers Team **Don’t fall for the idea that the rich pay their fair share** May 29, 2025 Emily McCloskey When you’re in a war and expecting your enemy to attack, sometimes you have to launch a preemptive strike. That’s exactly what we’re going to do with conservatives’ ideas on tax fairness now that we’re fully engaged in the 2025 tax war. Whenever the topic of tax avoidance by the rich comes up, conservatives like to trot out numbers that appear to indicate the wealthy do the heavy lifting when it comes to paying taxes in America. In fact, last September, when our Senior Vice President for Tax Policy, Bob Lord, testified before theSenate Finance Committeeat a hearing about tax avoidance strategies, it was one of the first arguments he encountered from Daniel Bunn, a fellow witness and the President and CEO of the conservative-leaning Tax Foundation. We won’t deny that, in absolute terms, wealthy people like us do pay the most actual dollars in tax. In 2021, the top 50% of earners in America paid 97.7% of all federal income taxes, while the bottom 50% paid 2.3%; that’s certainly progressive, considering that the top 50% took home “only” 90% of all income, leaving a 10% scrap behind for the bottom half. But that’s only a tiny, tiny part of the story and doesn’t prove that rich folks like us are paying anything remotely close to our fair share in taxes. Because the truth is, when you look at the bigger picture and run the numbers on theratesof tax we’re paying compared to everyone else, you’ll reach the inescapable conclusion that they’re not all that progressive, and clearly not progressive enough to stop the extreme concentration of American wealth that’s taken place over the past four decades. For this week’s Closer Look, we’d like to explore why and how the rich fail to pay their fair share in taxes. Specifically, we’ll discuss the problems involved in using adjusted gross income to demonstrate the progressivity of the federal income tax system; highlight the regressive nature of the American tax code as a whole; and present an easy way to see just how unfair our tax code really is. What’s wrong with adjusted gross income? Last August, the Treasury Department commissioned astudy, conducted by UC Berkeley economists Akcan Balkir, Emmanuel Saez, Danny Yagan, and Gabriel Zucman, to estimate the income and tax payments of different wealth groups in the US in 2019. They analyzed all of America’s 183.7 million taxpayer units—i.e. individuals and married couples that file tax returns (or would file tax returns) on behalf of themselves and their dependents—but particularly focused on the upper range. They divided the affluent into eight separate categories, ranging from the top 10% all the way to the top .00005%. Among other things, Balkir and his colleagues provided estimates of the adjusted gross incomes (AGI) that each wealth group earned. Your AGI is your gross income from all sources minus certain adjustments. They also provided estimates for a variety of the average taxes paid by each wealth group. Remember how earlier in this piece we mentioned the Tax Foundation? That same group took the data from the Treasury report and calculated the effective tax rates that each wealth group paid. Except they did something kind of sneaky to convince the public that, as their headline puts it,“The Super-Rich Pay Super-Amounts of Taxes.”Instead of running the numbers on the group’s tax payments as a proportion of their wealth, they instead used AGI. In doing so, they got exactly the kind of “progressive” figures they were after. For example, they found that the top .001% of taxpayers had an effective federal income and payroll tax rate of 28%, which was higher than the 22% effective rate that all taxpayers on average faced. Using AGI to calculate effective tax rates is problematic, particularly with regard to the ultra-wealthy. This is because AGI is not necessarily the same thing as someone’strueeconomic income. For the majority of Americans that earn a living through their labor, their AGI can be taken as their true economic income. But it’s a different story for wealthy people like us that make most of our money passively from capital gains, i.e. the growth in value in assets like stocks, mutual funds, real estate holdings, etc. Capital gains are only included in AGI when investors decide to sell assets, which is also the point at which they become subject to taxes. Until then, “unrealized” capital gains, as they’re called, are neither included in AGI nor are they taxed. It’s a common argument among rich people (and their elected official defenders!) that unrealized capital gains shouldn’t count as income because they exist only “on paper.” In other words, they believe that they don’t really “have” their wealth until they decide to sell, since most of their wealth is tied up in illiquid assets. This could not be further from the truth. The wealthy absolutely “have” every cent of their wealth at their disposal at all times thanks to a little scheme known as“buy, borrow, die.”It goes like this: they take out low-interest loans against their many assets to fund their extravagant lifestyles, and then eventually die and pass those assets onto their heirs tax-free. In short, unrealized capital gains definitely should count as income, particularly for the wealthy as they have most of their worth tied up there. THAT is why it’s a problem when AGI is used to calculate effective tax rates like the Tax Foundation did–because it’s misleading and doesn’t paint the whole picture of their true wealth. When you run the numbers on the Treasury study using wealth—which includes unrealized capital gains—to calculate effective tax rates, you get a very different story in terms of how progressive the tax code really is. For federal income and payroll taxes, all taxpayers face an average effective tax rate of 2.9% (compared to 22% using AGI); the top .001% face an average effective tax rate of 1.2% (compared to 28% using AGI); and the top .00005% face an average effective tax rate of just 0.3% (compared to 18% using AGI). That’s the opposite of progressive, but it sure does fit the bill for being regressive. There are so many other ways that the tax code privileges income from wealth over work that are relevant to this discussion about how the wealthy fail to pay their fair share in taxes. Watch the video below of our Chair, Morris Pearl, and President, Erica Payne, to learn more: The rest of the tax code isn’t much better Federal income and payroll taxes aren’t the only taxes that people pay. There are also state and local taxes, estate and gift taxes, corporate taxes, and even foreign taxes, among others. But the sad truth is that these other kinds of taxes aren’t all that progressive either—or, they are so riddled with loopholes that they don’t stand a chance of being progressive. State and local taxes provide a good example here. A2024 studyfrom the Institute on Taxation and Economic Policy found that 41 states tax the top 1% less than every other income group and, on average, the lowest 20% of earners face a state and local tax rate that is nearly 60% higher than the one paid by the top 1%. In their 2019 book,The Triumph of Injustice: How the Rich Dodge Taxes and How to Make Them Pay, economists Emmanuel Saez and Gabriel Zucman—the same ones from the Treasury study—revealed that things weren’t always this bad in America. In the mid-20th century, the top 400 wealthiest Americans paid far higher tax rates than working people. But in 2018, the year after the passage of the GOP’s Tax Cuts and Jobs Act (TCJA), for the first time ever, billionaires paid a lower total tax rate (on all their federal, state, and local taxes) than all other income groups. There’s an easy way to tell that our tax code is unfair When it comes to taxes, what constitutes a “fair share” is arguably pretty subjective. We say that phrase a lot, but we admit that it’s hard to pinpoint what that actually is. Is it when the wealthiest Americans pay a70% total tax rate, like they did back in 1950? Is it when all unrealized capital gains are taxed on a regular basis and tax rates on ordinary labor and investment income are equalized? This question is still up for debate and something we have to decide together as a nation. For now, even though we don’t have definitive numbers to point to, suffice it is to say that a “fair share” is an amount of tax that prevents the share of the country’s wealth from concentrating at the top. And while we may struggle with the idea of what is a “fair share,” we have no issue determining that, at this moment, our tax code isunfair. We can spot that from a mile away. If the 400 richest Americans pay a lower total tax rate than all other income groups, our tax code is unfair. If Jeff Bezos canpay $0 in federal income taxes and claim a $4,000 Child Tax Creditwhen he’s worth $18 billion, our tax code is unfair. If the top .00005% of taxpayers face an average effective tax rate of just 0.3% on their federal income and payroll taxes while working people can be taxed into (or further into) poverty, our tax code is unfair. If Elon Musk candump a quarter of $1 billioninto the 2024 election and subsequently join the administration and hacksaw the federal government, our tax code is unfair. If Katy Perry and her friends can take a 11-minute ride to space andemit the equivalent of a lifetime’s worth of carbon emissionsin the process, our tax code is unfair. Should we keep going? Because the truth is, you don’t even need an accountant to understand how unfair our tax code is. All you need to do is look around and see the harm that extreme wealth—the extraordinary growth of which has been enabled by our backwards tax code—is wreaking on our economy, our democracy, and our planet. There is a lot at stake with the current battle over the expiring provisions of the TCJA. We fully expect Republicans to wave around the Tax Foundation’s numbers when they’re accused of giving wealthy people like us another round of massive tax breaks—but don’t fall for it. There’s no getting around the fact that wealthy Americans do NOT pay our fair share in taxes, and that the GOP’s plan in its current form will make our already unfair tax code even more unfair and push our nation further down its slide into oligarchy. With Republicans in control on Capitol Hill and in the White House, we recognize that it will be a long, uphill battle in getting them to come around to our point of view and take meaningful action on reforming our tax code so that it helps all people. But in the meantime, that won’t stop us from fighting to get the truth out about how unfair our tax code is and the need to tax the rich. The Millionaires Priorities Perspectives Media About Careers Contact Patriotic Millionaires CA Patriotic Millionaires UK The Great Economy Project Store"}