{"id": 1792, "name": "Real Climate Science", "domain": "realclimatescience.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://realclimatescience.com/2025/06/we-have-to-vote-for-it-so-that-you-can-see-whats-in-it/#comments", "title": "We Have To Vote For It So That You Can See Whats In It", "content": "Home “Earth Is Cooling, Return of Ice Age Is Feared” 1871 Climate Superstition 1970s Global Cooling Scare 1970s Global Cooling Scare About Alterations To Climate Data Alterations To The US Temperature Record Bad Weather Below350.org Climate Racketeering CRU Temperature Fraud Data Tampering At USHCN/GISS Fifty Years Of Failed Apocalyptic Forecasts GHCN Code Glacial Retreat Before 1910 Greenland Meltdown Hansen – The Climate Chiropractor Hide The Decline Historical References Ice Free Arctic Forecasts Ice-Free Arctic Forecasts Maps and Graphs NASA Sea Level Fraud Northwest Passage Origin Of The Global Warming Threat Polar Meltdown Predictions By The World’s Greatest Scientists Scientific Consensus For Life On Mars Search Results Spectacularly Poor Climate Science At NASA The Bottom Line The Definitive Data On The Global Warming/Climate Change Scam The Holocaust Began With Gun Control – After A Shooting There Is No Climate Crisis Tips And Suggestions Tracking Climate Fraud USHCN Code Who Is Tony Heller? **“We Have To Vote For It So That You Can See What’s In It”** “Full transparency, I did not know about this section on pages 278-279 of the OBBB that strips states of the right to make laws or regulate AI for 10 years.I am adamantly OPPOSED to this and it is a violation of state rights and I would have voted NO if I had known this was in there.” (8) Rep. Marjorie Taylor Greene?? on X: “Full transparency, I did not know about this section on pages 278-279 of the OBBB that strips states of the right to make laws or regulate AI for 10 years. I am adamantly OPPOSED to this and it is a violation of state rights and I would have voted NO if I had known this was in https://t.co/bip3hztSGq” / X **About Tony Heller** **3 Responses to“We Have To Vote For It So That You Can See What’s In It”** Bob Gsays:June 4, 2025 at 4:28 amI have to agree with Musk. the obbb is just more government as usual…. it is an abomination. I think it’s apparent that both the Democrat and the Republican Congress people think they can’t get reelected unless they bring pork back to their district. it’s very sad and so irresponsible. okay Powell fire up those printing presses! hard assets and real estate are going to love it! that said, at least Trump and his advisors are trying to grow the private sector as opposed to Biden and his Auto pen which only grew the largely parasitic public sector.Reply I have to agree with Musk. the obbb is just more government as usual…. it is an abomination. I think it’s apparent that both the Democrat and the Republican Congress people think they can’t get reelected unless they bring pork back to their district. it’s very sad and so irresponsible. okay Powell fire up those printing presses! hard assets and real estate are going to love it! that said, at least Trump and his advisors are trying to grow the private sector as opposed to Biden and his Auto pen which only grew the largely parasitic public sector. I have to agree with Musk. the obbb is just more government as usual…. it is an abomination. I think it’s apparent that both the Democrat and the Republican Congress people think they can’t get reelected unless they bring pork back to their district. it’s very sad and so irresponsible. okay Powell fire up those printing presses! hard assets and real estate are going to love it! that said, at least Trump and his advisors are trying to grow the private sector as opposed to Biden and his Auto pen which only grew the largely parasitic public sector. conrad zieflesays:June 4, 2025 at 5:25 amSounds just like the mRNA stuff; give them full reign with impunity. F that!Reply Sounds just like the mRNA stuff; give them full reign with impunity. F that! Sounds just like the mRNA stuff; give them full reign with impunity. F that! arnsays:June 4, 2025 at 8:49 amI’m always baffled by the fact that things like that or the Autopan are not 100% illegal but they already tried this with the TTIP and TPP where the crucial content(including an establishment of kangaroo courts to subvert national laws in favor of corporations)was unknown.And it seems that AI besides CBDC’s plays a crucial role in the globalist plans.(a completely controlled and officially 100% independent Ai is a way more reliable proxy than even a demented Joe Biden and Epsteins close relations to AI pioneer Minsky and his AI funding via VI Foundation were pure coincidental and,as serial billionaire criminals use to call it,philanthropic )It is of importance to know who was pushing and lobbying for this and who made it even possible to hide the law.Then we will know a few more swamp names.Reply I’m always baffled by the fact that things like that or the Autopan are not 100% illegal but they already tried this with the TTIP and TPP where the crucial content(including an establishment of kangaroo courts to subvert national laws in favor of corporations)was unknown. And it seems that AI besides CBDC’s plays a crucial role in the globalist plans.(a completely controlled and officially 100% independent Ai is a way more reliable proxy than even a demented Joe Biden and Epsteins close relations to AI pioneer Minsky and his AI funding via VI Foundation were pure coincidental and,as serial billionaire criminals use to call it,philanthropic )It is of importance to know who was pushing and lobbying for this and who made it even possible to hide the law.Then we will know a few more swamp names. I’m always baffled by the fact that things like that or the Autopan are not 100% illegal but they already tried this with the TTIP and TPP where the crucial content(including an establishment of kangaroo courts to subvert national laws in favor of corporations)was unknown. And it seems that AI besides CBDC’s plays a crucial role in the globalist plans.(a completely controlled and officially 100% independent Ai is a way more reliable proxy than even a demented Joe Biden and Epsteins close relations to AI pioneer Minsky and his AI funding via VI Foundation were pure coincidental and,as serial billionaire criminals use to call it,philanthropic )It is of importance to know who was pushing and lobbying for this and who made it even possible to hide the law.Then we will know a few more swamp names. **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. Disrupting the Borg is expensive and time consuming! **Disrupting the Borg is expensive and time consuming!** **Disrupting the Borg is expensive and time consuming!** Google Search **Google Search** **Google Search** Search for: Recent Posts“Climate dread is everywhere”“The Atmosphere Is ‘Thirstier.’”Skynet Becomes Self Aware“We Have To Vote For It So That You Can See What’s In It”Diversity Is Our Strength“even within the lifetime of our children”60 Years Of Progress in LondonThe Anti-Greta“a persistent concern”Deadliest US Tornado DaysThe Other Side Of The Pond“HEMI V8 Roars Back”Big Pharma Sales ToolYour Tax Dollars At Work622 billion tons of new iceFossil Fuels To Turn The UK Tropical100% Tariffs On Chinese EV’sFossil Fuels Cause FungusProphets Of DoomThe Green New Deal Lives OnMission Accomplished!45 Years Ago TodaySolution To Denver HomelessnessCrime In ColoradoEverything Looks Like A Nail **Recent Posts** “Climate dread is everywhere” “The Atmosphere Is ‘Thirstier.’” Skynet Becomes Self Aware “We Have To Vote For It So That You Can See What’s In It” Diversity Is Our Strength “even within the lifetime of our children” 60 Years Of Progress in London The Anti-Greta “a persistent concern” Deadliest US Tornado Days The Other Side Of The Pond “HEMI V8 Roars Back” Big Pharma Sales Tool Your Tax Dollars At Work 622 billion tons of new ice Fossil Fuels To Turn The UK Tropical 100% Tariffs On Chinese EV’s Fossil Fuels Cause Fungus Prophets Of Doom The Green New Deal Lives On Mission Accomplished! 45 Years Ago Today Solution To Denver Homelessness Crime In Colorado Everything Looks Like A Nail **Recent Posts** “Climate dread is everywhere” “The Atmosphere Is ‘Thirstier.’” Skynet Becomes Self Aware “We Have To Vote For It So That You Can See What’s In It” Diversity Is Our Strength “even within the lifetime of our children” 60 Years Of Progress in London The Anti-Greta “a persistent concern” Deadliest US Tornado Days The Other Side Of The Pond “HEMI V8 Roars Back” Big Pharma Sales Tool Your Tax Dollars At Work 622 billion tons of new ice Fossil Fuels To Turn The UK Tropical 100% Tariffs On Chinese EV’s Fossil Fuels Cause Fungus Prophets Of Doom The Green New Deal Lives On Mission Accomplished! 45 Years Ago Today Solution To Denver Homelessness Crime In Colorado Everything Looks Like A Nail June 2025MTWTFSS123456789101112131415161718192021222324252627282930« May Recent Commentsconrad ziefleon“Climate dread is everywhere”Peter Carrollon“Climate dread is everywhere”Gordon Vigurson“The Atmosphere Is ‘Thirstier.’”Bob Gon“Climate dread is everywhere”conrad ziefleon“The Atmosphere Is ‘Thirstier.’”Gordon Vigurson“The Atmosphere Is ‘Thirstier.’”Billyjackon“Climate dread is everywhere”arnon“Climate dread is everywhere”Gordon Vigurson“Climate dread is everywhere”conrad ziefleon“The Atmosphere Is ‘Thirstier.’” **Recent Comments** conrad ziefleon“Climate dread is everywhere” Peter Carrollon“Climate dread is everywhere” Gordon Vigurson“The Atmosphere Is ‘Thirstier.’” Bob Gon“Climate dread is everywhere” conrad ziefleon“The Atmosphere Is ‘Thirstier.’” Gordon Vigurson“The Atmosphere Is ‘Thirstier.’” Billyjackon“Climate dread is everywhere” arnon“Climate dread is everywhere” Gordon Vigurson“Climate dread is everywhere” conrad ziefleon“The Atmosphere Is ‘Thirstier.’” **Recent Comments** conrad ziefleon“Climate dread is everywhere” Peter Carrollon“Climate dread is everywhere” Gordon Vigurson“The Atmosphere Is ‘Thirstier.’” Bob Gon“Climate dread is everywhere” conrad ziefleon“The Atmosphere Is ‘Thirstier.’” Gordon Vigurson“The Atmosphere Is ‘Thirstier.’” Billyjackon“Climate dread is everywhere” arnon“Climate dread is everywhere” Gordon Vigurson“Climate dread is everywhere” conrad ziefleon“The Atmosphere Is ‘Thirstier.’”"}