{"id": 839, "name": "Lethbridge Herald", "domain": "lethbridgeherald.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://lethbridgeherald.com/entertainment/entertainment-news/2025/06/11/carole-king-keith-richard-john-cusack-and-more-celebs-react-to-the-death-of-brian-wilson/", "title": "Carole King Keith Richard John Cusack And More Celebs React To The Death Of Brian Wilson", "content": "e-Edition Obituaries Special Sections Special Occasions Contact Us Subscribe Login to CommentRegister Register Register Home News Sports Entertainment Commentary Classifieds Hockey Pool Entertainment News **Poll** Have you suffered any health effects from recent wildfire smoke in the air? Yes No View Results **Sunny Escapes** Step Into the Past and Beat the Heat: Why Galt Museum Is Your Summer Must-Visit! This Giant Chess Set Is Alberta’s Most Unexpected Summer Photo Op **Sponsored** **Carole King, Keith Richard, John Cusack and more celebs react to the death of Brian Wilson** By Canadian Press on June 11, 2025. Notable reaction to thedeath of the Beach Boys’ Brian Wilsonat age 82. ___ “Brian Wilson was my friend and my brother in songwriting. We shared a similar sensibility, as evidenced by his 4 over 5 chord under ‘Aaaah!’ in ‘Good Vibrations’ and mine under ‘I’m Into Something Good.’ We once discussed who used it first, and in the end we decided it didn’t matter. The world will miss Brian, but we are so lucky to have his music.” — Carole King,on Facebook. ___ “I know Orbison is the king of emo, but man if there was a human being who made art out of inexpressible sadness….damn it was Brian Wilson.” — Questlove,on Instagram. ___ “The maestro has passed — the man was a open heart with two legs — with an ear that heard the angels. Quite literally. Love and Mercy for you and yours tonight. RIP Brian.” — John Cusack, who played Wilson in the 2014 biopic “Love & Mercy,”on X. ___ “Rest in Peace!” — Rolling Stones guitarist Keith Richards,on Instagram. ___ “Oh no Brian Wilson and Sly Stone in one week – my world is in mourning. so sad.” — Rolling Stones guitarist Ronnie Wood,on X. ___ “Anyone with a musical bone in their body must be grateful for Brian Wilson’s genius magical touch !! And greatly saddened of this major worldly loss!! My thoughts go out to his family and friends.” — Fleetwood Mac drummer Mick Fleetwood,on X. ___ “First Sly, now Brian … this is really just …” — Maggie Rogers wrote on her Instagram Story, adding a heartbreak emoji. ___ “Anyone who really knows me knows how heart broken I am about Brian Wilson passing. Not many people influenced me as much as he did. I feel very lucky that I was able to meet him and spend some time with him. He was always very kind and generous. He was our American Mozart. A one of a kind genius from another world.” — Sean Ono Lennon,on X. ___ “SO very sad to hear that our dear friend, inspiration and mentor for decades has passed away. Rest In Peace BRIAN WILSON…with love, Dewey & Gerry” — Dewey Bunnell and Gerry Beckley, the only remaining founding members of the band America,on Instagram. ___ “His cherished music will live forever as he travels through the Universe and beyond. God bless you, sweet Brian. One of the biggest thrills of my life was singing “California Girls” with Brian.” — Nancy Sinatra,on Instagram. ___ “To me, Brian Wilson was not merely about surf music, rather a true musical genius toiling away at melding POP into startling sophistication. He will he be missed mightily. xx jc” — John Cale, Velvet Underground musician and producer,on X. ___ “Brian Wilson was a musical and spiritual giant. His melodies shaped generations, & his soul resonated in every note. I was fortunate to know him; we all were blessed by his genius. Rest peacefully, Brian.” — Micky Dolenz of The Monkees,on X. ___ “We lost one of the greatest composers and messengers who took jazz harmony, put it to a Chuck Berry beat and made a new genre of music. Some of the best singles in the world. Dennis, Carl and Brian are all together now. Other worlds to sing in.” — Randy Bachman, co-founder of Bachman-Turner Overdrive,on X. The Associated Press **More ways to get to us** ePaper Login Subscribe Subscription Services Archive **About Us** The Lethbridge Herald Other Publications Contact Us Careers **Contact the Lethbridge Herald** 504 - 7th Street SouthLethbridge, AB T1J 3Z7 [P](403) 328-4411[F](403)328-4536 Advertising Terms and Conditions & Privacy Policy"}