{"id": 208, "name": "Center for Democracy and Technology", "domain": "cdt.org", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://cdt.org/insights/cdt-comment-to-house-ec-argues-federal-comprehensive-privacy-framework-should-protect-against-harms-and-bolster-consumer-trust/", "title": "Cdt Comment To House Ec Argues Federal Comprehensive Privacy Framework Should Protect Against Harms And Bolster Consumer Trust", "content": "Who We AreAboutCDT EuropeCDT AI Governance LabCDT ResearchStaffBoardAdvisory CouncilNon-Resident FellowsCareers About CDT Europe CDT AI Governance Lab CDT Research Staff Board Advisory Council Non-Resident Fellows Careers About CDT Europe CDT AI Governance Lab CDT Research Staff Board Advisory Council Non-Resident Fellows Careers Latest Areas of FocusAI Policy & GovernanceCybersecurity & StandardsElections & DemocracyEquity in Civic TechFree ExpressionGovernment SurveillanceOpen InternetPrivacy & Data AI Policy & Governance Cybersecurity & Standards Elections & Democracy Equity in Civic Tech Free Expression Government Surveillance Open Internet Privacy & Data AI Policy & Governance Cybersecurity & Standards Elections & Democracy Equity in Civic Tech Free Expression Government Surveillance Open Internet Privacy & Data Collections CDT Europe Press Events Keep in Touch Donate Privacy & Data **CDT Comment to House E&C Argues Federal Comprehensive Privacy Framework Should Protect Against Harms and Bolster Consumer Trust** April 7, 2025/Ridhi Shetty,Eric Null,Nathalie Maréchal,Samir Jain CDT submitted these comments in response to the House Energy & Commerce Committee Privacy Working Group’s request for information (RFI) regarding a federal comprehensive privacy and security framework. We appreciate the opportunity to comment and the committee’s desire to gather more information from stakeholders about their privacy viewpoints and evidence of data practices and their harms. In our comments, we urge the Working Group to build upon the significant amount of work done in the past several years to achieve bipartisan consensus on key elements of a federal privacy framework. We highlight that any effective federal privacy law must place limits on companies’ collection, use, processing, and sharing of data to protect individuals from harm. These harms include fraud and other economic injury, discrimination, reputational harm, harassment, and government surveillance that circumvents the Fourth Amendment and other legal protections. Because many of these risks increasingly arise from the use of artificial intelligence (AI) such as in automated decision-making systems, an effective 21st century privacy framework should account for AI. It should also provide meaningful transparency and require companies to regularly examine their data practices to mitigate risks to consumers. Protecting privacy will bolster consumer trust in our increasingly data-centric economy and thereby enable greater innovation. Read the full comments. Share Resources Full Comments **Related Reading** **EU Tech Policy Brief: June 2025** **EU Tech Policy Brief: June 2025** **Google’s Privacy Sandbox is Dead. The Fight for Real Online Privacy Continues.** **Google’s Privacy Sandbox is Dead. The Fight for Real Online Privacy Continues.** **Op-ed – Clocked In: How Surveillance Wage-Setting Can Affect People with Disabilities** **Op-ed – Clocked In: How Surveillance Wage-Setting Can Affect People with Disabilities** CDT works to strengthen individual rights and freedoms by defining, promoting, and influencing technology policy and the architecture of the internet that impacts our daily lives. The content throughout this website that originates with CDT can be freely copied and used as long as you make no substantive changes and clearly give us credit. More on CDT's content reuse policy is availablehere. CDT’s generative AI usage policy is availablehere. **People** CDT Europe CDT AI Governance Lab CDT Research Staff Board Advisory Council CDT’s Non-Resident Fellows Collaborating Attorney Networks CDT Alumni Network **Organization** 2023 Annual Report Financials Press Events Donate Careers CDT's Tech Talk **Areas of Focus** AI Policy & Governance Cybersecurity & Standards Elections & Democracy Equity in Civic Tech Free Expression Government Surveillance Open Internet Privacy & Data Privacy Policy Contact Us Keep in Touch Copyright © 2025 by Center for Democracy and Technology. Created bynclud. **CenDemTech** **CDT Europe**"}