{"id": 1685, "name": "Christian Apologetics & Research Ministry (CARM)", "domain": "carm.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://carm.org/christianity/an-argument-in-favor-of-justification-by-faith-alone-in-christ-alone/", "title": "An Argument In Favor Of Justification By Faith Alone In Christ Alone", "content": "DONATE Home ApologeticsApostasyChristian ApologeticsCut and Paste InfoDebatesChristian Apologetic DialoguesEvidence and AnswersChristian HeresiesLost BooksPreachers and TeachersResponding to CriticsTables and Word AnalysisVerses Examined OTVerses Examined NTWomen in MinistryWomen’s Issues Apostasy Christian Apologetics Cut and Paste Info Debates Christian Apologetic Dialogues Evidence and Answers Christian Heresies Lost Books Preachers and Teachers Responding to Critics Tables and Word Analysis Verses Examined OT Verses Examined NT Women in Ministry Women’s Issues Apostasy Christian Apologetics Cut and Paste Info Debates Christian Apologetic Dialogues Evidence and Answers Christian Heresies Lost Books Preachers and Teachers Responding to Critics Tables and Word Analysis Verses Examined OT Verses Examined NT Women in Ministry Women’s Issues The BibleBible DevotionsBible GeneralBible StudiesBible Verses by Topic Bible Devotions Bible General Bible Studies Bible Verses by Topic Bible Devotions Bible General Bible Studies Bible Verses by Topic Bible DifficultiesGenesis – DeuteronomyJoshua – EstherJob – Song of SolomonIsaiah – MalachiMatthew – MarkLuke – ActsRomans – PhilemonHebrews – Revelation Genesis – Deuteronomy Joshua – Esther Job – Song of Solomon Isaiah – Malachi Matthew – Mark Luke – Acts Romans – Philemon Hebrews – Revelation Genesis – Deuteronomy Joshua – Esther Job – Song of Solomon Isaiah – Malachi Matthew – Mark Luke – Acts Romans – Philemon Hebrews – Revelation Christian LivingEvangelismHomeschoolingPersecutionSermonsTo the Christian Church Evangelism Homeschooling Persecution Sermons To the Christian Church Evangelism Homeschooling Persecution Sermons To the Christian Church Christian TheologyAnswers for SeekersCreeds and ConfessionsDoctrine and TheologyEschatologyEternal SecurityMiscellaneous TopicsParables Answers for Seekers Creeds and Confessions Doctrine and Theology Eschatology Eternal Security Miscellaneous Topics Parables Answers for Seekers Creeds and Confessions Doctrine and Theology Eschatology Eternal Security Miscellaneous Topics Parables Early Church FathersQuotes by TopicQuotes by Verse Quotes by Topic Quotes by Verse Quotes by Topic Quotes by Verse Minor Groups & IssuesTopics – ATopics – BTopics – CTopics – DTopics – ETopics – FTopics – GTopics – HTopics – ITopics – JTopics – KTopics – LTopics – MTopics – NTopics – OTopics – PTopics – QTopics – RTopics – STopics – TTopics – UTopics – VTopics – WTopics – XTopics – YTopics – Z Topics – A Topics – B Topics – C Topics – D Topics – E Topics – F Topics – G Topics – H Topics – I Topics – J Topics – K Topics – L Topics – M Topics – N Topics – O Topics – P Topics – Q Topics – R Topics – S Topics – T Topics – U Topics – V Topics – W Topics – X Topics – Y Topics – Z Topics – A Topics – B Topics – C Topics – D Topics – E Topics – F Topics – G Topics – H Topics – I Topics – J Topics – K Topics – L Topics – M Topics – N Topics – O Topics – P Topics – Q Topics – R Topics – S Topics – T Topics – U Topics – V Topics – W Topics – X Topics – Y Topics – Z QuestionsAngelsApologeticsBaptismBibleBible VersesChristianityThe ChurchDemonsDoctrine & TheologyEnd TimesEthicsEvangelismThe FamilyGodHeresiesThe Holy SpiritJesusMankindMarriageThe OccultOtherPastorsPeoplePhilosophyPrayerReligionsSalvationSanctificationScienceSexualitySinSkeptics AskTheology Angels Apologetics Baptism Bible Bible Verses Christianity The Church Demons Doctrine & Theology End Times Ethics Evangelism The Family God Heresies The Holy Spirit Jesus Mankind Marriage The Occult Other Pastors People Philosophy Prayer Religions Salvation Sanctification Science Sexuality Sin Skeptics Ask Theology Angels Apologetics Baptism Bible Bible Verses Christianity The Church Demons Doctrine & Theology End Times Ethics Evangelism The Family God Heresies The Holy Spirit Jesus Mankind Marriage The Occult Other Pastors People Philosophy Prayer Religions Salvation Sanctification Science Sexuality Sin Skeptics Ask Theology Secular IssuesAbortionAtheismCovidCreation-EvolutionGovernmentHomosexuality and LGBTQ+RelativismSocial Justice Abortion Atheism Covid Creation-Evolution Government Homosexuality and LGBTQ+ Relativism Social Justice Abortion Atheism Covid Creation-Evolution Government Homosexuality and LGBTQ+ Relativism Social Justice World ReligionsBaháʼíBuddhismHinduismIslamJehovah’s WitnessesKingdom of Jesus ChristMormonismOneness PentecostalEastern Orthodox ChurchRoman CatholicismSeventh Day AdventismWicca Baháʼí Buddhism Hinduism Islam Jehovah’s Witnesses Kingdom of Jesus Christ Mormonism Oneness Pentecostal Eastern Orthodox Church Roman Catholicism Seventh Day Adventism Wicca Baháʼí Buddhism Hinduism Islam Jehovah’s Witnesses Kingdom of Jesus Christ Mormonism Oneness Pentecostal Eastern Orthodox Church Roman Catholicism Seventh Day Adventism Wicca One Minute VideosOne Minute Videos: Christianity One Minute Videos: Christianity One Minute Videos: Christianity ———————————- AboutAbout CARMStatement of FaithOur TeamCARM Authors & Writers About CARM Statement of Faith Our Team CARM Authors & Writers About CARM Statement of Faith Our Team CARM Authors & Writers Resources & MediaMatt Slick LIVEKeyword & Category IndexBook & Movie ReviewsTestimoniesApologetics Videos Matt Slick LIVE Keyword & Category Index Book & Movie Reviews Testimonies Apologetics Videos Matt Slick LIVE Keyword & Category Index Book & Movie Reviews Testimonies Apologetics Videos Calendar Radio Forums SchoolsCARM Online SchoolsLoginSignup CARM Online Schools Login Signup CARM Online Schools Login Signup SupportDonateWant to help CARM? Donate Want to help CARM? Donate Want to help CARM? StoreShop PageDonationsMy Account Shop Page Donations My Account Shop Page Donations My Account ContactContact UsSpeaking Requests Contact Us Speaking Requests Contact Us Speaking Requests Subscribe to Newsletter **An Argument in favor of Justification by Faith alone in Christ alone** byMatt Slick|May 15, 2025|Doctrine and Theology,Christian Theology A lot of people in the Roman Catholic and the Eastern Orthodox Churches deny the biblical doctrine of justification by faith alone in Christ alone. Generally speaking, they say that it must be a faith that has works. In light of this, many quote James 2:24 in order to argue against Romans 3:28, 4:5, Galatians 2:16, etc. They set scripture against scripture and fail to analyze contexts. Therefore, this article is a defense of justification by faith alone.I hope it helps you stand firm in the truth of God’s word. Justification before God is either by faith alone or it is not by faith alone.By ‘faith’ alone is meant the belief/trust that is granted by God (Phil. 1:29) that is in Jesus (John 6:29). Because this faith is granted by God and is in Jesus, the faith is real and genuine. It is not mere mental assent. It accompanies regeneration.Phil. 1:29, “For to you it has been granted for Christ’s sake, not only to believe in Him, but also to suffer for His sake.”John 6:29, “Jesus answered and said to them, ‘This is the work of God, that you believe in Him whom He has sent.'”By ‘justification’ is meant the crediting of righteousness that is received by faith (Rom. 4:5) apart from the works of the Law (Rom. 3:28; Gal. 2:16; Phil. 3:9).Rom. 4:5, “But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.”Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.”Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.”Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,”Note: Roman Catholics and Eastern Orthodox often claim that the “Law” in Romans 3:28, 4:5, and Galatians 2:16 refers to the ceremonial law. However, this interpretation is flawed for several reasons.First, Romans 3:20 states that “through the Law comes the knowledge of sin.” The ceremonial law does not define sin (Rom. 5:20; 1 John 3:4); it responds to it. Romans 7:7 reinforces this by citing the command “You shall not covet,” which comes from the Ten Commandments (Exodus 20:17). This is moral law, not ceremonial law.Second, Rom. 3:19 says the Law makes “all the world accountable to God.” The ceremonial law was given only to Israel and cannot universally condemn the world. Only the moral law can apply to all humanity.Third, in Rom’. 4:1-5, Paul presents Abraham as the exemplar of justification by faith, and Abraham lived before the ceremonial law was instituted through Moses.Finally, Rom. 5:13-14 says, “sin is not imputed when there is no law,” yet “death reigned from Adam to Moses.” This implies that people were still judged for sin before the ceremonial law existed; therefore, another kind of law must have been in effect besides the ceremonial law, namely the moral law. Therefore, the broader context shows that Paul’s references to “the Law” in these chapters cannot be restricted to the ceremonial law, but must refer to the moral law which condemns all humanity.Short:All the world is accountable to God not by the ceremonial law, but by the moral law (Rom. 3:19). It is through the moral law that we have the knowledge of sin (Rom. 3:20). Therefore it cannot be the ceremonial law that brings wrath (Rom. 4:15) since not all people had the ceremonial law. Death reigned from Adam to Moses before the ceremonial law was given, so the moral law must have been in effect (Rom. 5:13-14). Paul refers to the moral law (Rom. 7:7). So, Romans 3:28; 4:5; Gal. 2:16; Phil. 3:9, etc., cannot be about the ceremonial law.Exodus 20:17, “You shall not covet your neighbor’s house; you shall not covet your neighbor’s wife or his male servant or his female servant or his ox or his donkey or anything that belongs to your neighbor.”Rom. 3:19, “Now we know that whatever the Law says, it speaks to those who are under the Law, so that every mouth may be closed and all the world may become accountable to God.”Rom. 3:20, “because by the works of the Law no flesh will be justified in His sight; for through the Law comes the knowledge of sin.”Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.”Rom. 4:1–5, “What then shall we say that Abraham, our forefather according to the flesh, has found? 2 For if Abraham was justified by works, he has something to boast about, but not before God. 3 For what does the Scripture say? “Abraham believed God, and it was credited to him as righteousness.” 4 Now to the one who works, his wage is not credited as a favor, but as what is due. 5 But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.”Rom. 4:15, “for the Law brings about wrath, but where there is no law, there also is no violation.”Rom. 5:13–14, “for until the Law sin was in the world, but sin is not imputed when there is no law. 14 Nevertheless, death reigned from Adam until Moses, even over those who had not sinned in the likeness of the offense of Adam, who is a type of Him who was to come.”Rom. 5:20, “The Law came in so that the transgression would increase; but where sin increased, grace abounded all the more,”Rom. 7:7, “What shall we say then? Is the Law sin? May it never be! On the contrary, I would not have come to know sin except through the Law; for I would not have known about coveting if the Law had not said, “You shall not covet.”Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.”Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,”1 John 3:4, “Everyone who practices sin also practices lawlessness; and sin is lawlessness.” By ‘faith’ alone is meant the belief/trust that is granted by God (Phil. 1:29) that is in Jesus (John 6:29). Because this faith is granted by God and is in Jesus, the faith is real and genuine. It is not mere mental assent. It accompanies regeneration.Phil. 1:29, “For to you it has been granted for Christ’s sake, not only to believe in Him, but also to suffer for His sake.”John 6:29, “Jesus answered and said to them, ‘This is the work of God, that you believe in Him whom He has sent.'” Phil. 1:29, “For to you it has been granted for Christ’s sake, not only to believe in Him, but also to suffer for His sake.” John 6:29, “Jesus answered and said to them, ‘This is the work of God, that you believe in Him whom He has sent.'” By ‘justification’ is meant the crediting of righteousness that is received by faith (Rom. 4:5) apart from the works of the Law (Rom. 3:28; Gal. 2:16; Phil. 3:9).Rom. 4:5, “But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.”Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.”Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.”Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,” Rom. 4:5, “But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.” Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.” Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.” Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,” Note: Roman Catholics and Eastern Orthodox often claim that the “Law” in Romans 3:28, 4:5, and Galatians 2:16 refers to the ceremonial law. However, this interpretation is flawed for several reasons.First, Romans 3:20 states that “through the Law comes the knowledge of sin.” The ceremonial law does not define sin (Rom. 5:20; 1 John 3:4); it responds to it. Romans 7:7 reinforces this by citing the command “You shall not covet,” which comes from the Ten Commandments (Exodus 20:17). This is moral law, not ceremonial law.Second, Rom. 3:19 says the Law makes “all the world accountable to God.” The ceremonial law was given only to Israel and cannot universally condemn the world. Only the moral law can apply to all humanity.Third, in Rom’. 4:1-5, Paul presents Abraham as the exemplar of justification by faith, and Abraham lived before the ceremonial law was instituted through Moses.Finally, Rom. 5:13-14 says, “sin is not imputed when there is no law,” yet “death reigned from Adam to Moses.” This implies that people were still judged for sin before the ceremonial law existed; therefore, another kind of law must have been in effect besides the ceremonial law, namely the moral law. Therefore, the broader context shows that Paul’s references to “the Law” in these chapters cannot be restricted to the ceremonial law, but must refer to the moral law which condemns all humanity. Short:All the world is accountable to God not by the ceremonial law, but by the moral law (Rom. 3:19). It is through the moral law that we have the knowledge of sin (Rom. 3:20). Therefore it cannot be the ceremonial law that brings wrath (Rom. 4:15) since not all people had the ceremonial law. Death reigned from Adam to Moses before the ceremonial law was given, so the moral law must have been in effect (Rom. 5:13-14). Paul refers to the moral law (Rom. 7:7). So, Romans 3:28; 4:5; Gal. 2:16; Phil. 3:9, etc., cannot be about the ceremonial law.Exodus 20:17, “You shall not covet your neighbor’s house; you shall not covet your neighbor’s wife or his male servant or his female servant or his ox or his donkey or anything that belongs to your neighbor.”Rom. 3:19, “Now we know that whatever the Law says, it speaks to those who are under the Law, so that every mouth may be closed and all the world may become accountable to God.”Rom. 3:20, “because by the works of the Law no flesh will be justified in His sight; for through the Law comes the knowledge of sin.”Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.”Rom. 4:1–5, “What then shall we say that Abraham, our forefather according to the flesh, has found? 2 For if Abraham was justified by works, he has something to boast about, but not before God. 3 For what does the Scripture say? “Abraham believed God, and it was credited to him as righteousness.” 4 Now to the one who works, his wage is not credited as a favor, but as what is due. 5 But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.”Rom. 4:15, “for the Law brings about wrath, but where there is no law, there also is no violation.”Rom. 5:13–14, “for until the Law sin was in the world, but sin is not imputed when there is no law. 14 Nevertheless, death reigned from Adam until Moses, even over those who had not sinned in the likeness of the offense of Adam, who is a type of Him who was to come.”Rom. 5:20, “The Law came in so that the transgression would increase; but where sin increased, grace abounded all the more,”Rom. 7:7, “What shall we say then? Is the Law sin? May it never be! On the contrary, I would not have come to know sin except through the Law; for I would not have known about coveting if the Law had not said, “You shall not covet.”Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.”Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,”1 John 3:4, “Everyone who practices sin also practices lawlessness; and sin is lawlessness.” Exodus 20:17, “You shall not covet your neighbor’s house; you shall not covet your neighbor’s wife or his male servant or his female servant or his ox or his donkey or anything that belongs to your neighbor.” Rom. 3:19, “Now we know that whatever the Law says, it speaks to those who are under the Law, so that every mouth may be closed and all the world may become accountable to God.” Rom. 3:20, “because by the works of the Law no flesh will be justified in His sight; for through the Law comes the knowledge of sin.” Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.” Rom. 4:1–5, “What then shall we say that Abraham, our forefather according to the flesh, has found? 2 For if Abraham was justified by works, he has something to boast about, but not before God. 3 For what does the Scripture say? “Abraham believed God, and it was credited to him as righteousness.” 4 Now to the one who works, his wage is not credited as a favor, but as what is due. 5 But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.” Rom. 4:15, “for the Law brings about wrath, but where there is no law, there also is no violation.” Rom. 5:13–14, “for until the Law sin was in the world, but sin is not imputed when there is no law. 14 Nevertheless, death reigned from Adam until Moses, even over those who had not sinned in the likeness of the offense of Adam, who is a type of Him who was to come.” Rom. 5:20, “The Law came in so that the transgression would increase; but where sin increased, grace abounded all the more,” Rom. 7:7, “What shall we say then? Is the Law sin? May it never be! On the contrary, I would not have come to know sin except through the Law; for I would not have known about coveting if the Law had not said, “You shall not covet.” Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.” Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,” 1 John 3:4, “Everyone who practices sin also practices lawlessness; and sin is lawlessness.” By ‘faith’ alone is meant the belief/trust that is granted by God (Phil. 1:29) that is in Jesus (John 6:29). Because this faith is granted by God and is in Jesus, the faith is real and genuine. It is not mere mental assent. It accompanies regeneration.Phil. 1:29, “For to you it has been granted for Christ’s sake, not only to believe in Him, but also to suffer for His sake.”John 6:29, “Jesus answered and said to them, ‘This is the work of God, that you believe in Him whom He has sent.'” Phil. 1:29, “For to you it has been granted for Christ’s sake, not only to believe in Him, but also to suffer for His sake.” John 6:29, “Jesus answered and said to them, ‘This is the work of God, that you believe in Him whom He has sent.'” Phil. 1:29, “For to you it has been granted for Christ’s sake, not only to believe in Him, but also to suffer for His sake.” John 6:29, “Jesus answered and said to them, ‘This is the work of God, that you believe in Him whom He has sent.'” By ‘justification’ is meant the crediting of righteousness that is received by faith (Rom. 4:5) apart from the works of the Law (Rom. 3:28; Gal. 2:16; Phil. 3:9).Rom. 4:5, “But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.”Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.”Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.”Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,” Rom. 4:5, “But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.” Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.” Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.” Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,” Rom. 4:5, “But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.” Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.” Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.” Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,” Note: Roman Catholics and Eastern Orthodox often claim that the “Law” in Romans 3:28, 4:5, and Galatians 2:16 refers to the ceremonial law. However, this interpretation is flawed for several reasons.First, Romans 3:20 states that “through the Law comes the knowledge of sin.” The ceremonial law does not define sin (Rom. 5:20; 1 John 3:4); it responds to it. Romans 7:7 reinforces this by citing the command “You shall not covet,” which comes from the Ten Commandments (Exodus 20:17). This is moral law, not ceremonial law.Second, Rom. 3:19 says the Law makes “all the world accountable to God.” The ceremonial law was given only to Israel and cannot universally condemn the world. Only the moral law can apply to all humanity.Third, in Rom’. 4:1-5, Paul presents Abraham as the exemplar of justification by faith, and Abraham lived before the ceremonial law was instituted through Moses.Finally, Rom. 5:13-14 says, “sin is not imputed when there is no law,” yet “death reigned from Adam to Moses.” This implies that people were still judged for sin before the ceremonial law existed; therefore, another kind of law must have been in effect besides the ceremonial law, namely the moral law. Therefore, the broader context shows that Paul’s references to “the Law” in these chapters cannot be restricted to the ceremonial law, but must refer to the moral law which condemns all humanity. Short:All the world is accountable to God not by the ceremonial law, but by the moral law (Rom. 3:19). It is through the moral law that we have the knowledge of sin (Rom. 3:20). Therefore it cannot be the ceremonial law that brings wrath (Rom. 4:15) since not all people had the ceremonial law. Death reigned from Adam to Moses before the ceremonial law was given, so the moral law must have been in effect (Rom. 5:13-14). Paul refers to the moral law (Rom. 7:7). So, Romans 3:28; 4:5; Gal. 2:16; Phil. 3:9, etc., cannot be about the ceremonial law.Exodus 20:17, “You shall not covet your neighbor’s house; you shall not covet your neighbor’s wife or his male servant or his female servant or his ox or his donkey or anything that belongs to your neighbor.”Rom. 3:19, “Now we know that whatever the Law says, it speaks to those who are under the Law, so that every mouth may be closed and all the world may become accountable to God.”Rom. 3:20, “because by the works of the Law no flesh will be justified in His sight; for through the Law comes the knowledge of sin.”Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.”Rom. 4:1–5, “What then shall we say that Abraham, our forefather according to the flesh, has found? 2 For if Abraham was justified by works, he has something to boast about, but not before God. 3 For what does the Scripture say? “Abraham believed God, and it was credited to him as righteousness.” 4 Now to the one who works, his wage is not credited as a favor, but as what is due. 5 But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.”Rom. 4:15, “for the Law brings about wrath, but where there is no law, there also is no violation.”Rom. 5:13–14, “for until the Law sin was in the world, but sin is not imputed when there is no law. 14 Nevertheless, death reigned from Adam until Moses, even over those who had not sinned in the likeness of the offense of Adam, who is a type of Him who was to come.”Rom. 5:20, “The Law came in so that the transgression would increase; but where sin increased, grace abounded all the more,”Rom. 7:7, “What shall we say then? Is the Law sin? May it never be! On the contrary, I would not have come to know sin except through the Law; for I would not have known about coveting if the Law had not said, “You shall not covet.”Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.”Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,”1 John 3:4, “Everyone who practices sin also practices lawlessness; and sin is lawlessness.” Exodus 20:17, “You shall not covet your neighbor’s house; you shall not covet your neighbor’s wife or his male servant or his female servant or his ox or his donkey or anything that belongs to your neighbor.” Rom. 3:19, “Now we know that whatever the Law says, it speaks to those who are under the Law, so that every mouth may be closed and all the world may become accountable to God.” Rom. 3:20, “because by the works of the Law no flesh will be justified in His sight; for through the Law comes the knowledge of sin.” Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.” Rom. 4:1–5, “What then shall we say that Abraham, our forefather according to the flesh, has found? 2 For if Abraham was justified by works, he has something to boast about, but not before God. 3 For what does the Scripture say? “Abraham believed God, and it was credited to him as righteousness.” 4 Now to the one who works, his wage is not credited as a favor, but as what is due. 5 But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.” Rom. 4:15, “for the Law brings about wrath, but where there is no law, there also is no violation.” Rom. 5:13–14, “for until the Law sin was in the world, but sin is not imputed when there is no law. 14 Nevertheless, death reigned from Adam until Moses, even over those who had not sinned in the likeness of the offense of Adam, who is a type of Him who was to come.” Rom. 5:20, “The Law came in so that the transgression would increase; but where sin increased, grace abounded all the more,” Rom. 7:7, “What shall we say then? Is the Law sin? May it never be! On the contrary, I would not have come to know sin except through the Law; for I would not have known about coveting if the Law had not said, “You shall not covet.” Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.” Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,” 1 John 3:4, “Everyone who practices sin also practices lawlessness; and sin is lawlessness.” Exodus 20:17, “You shall not covet your neighbor’s house; you shall not covet your neighbor’s wife or his male servant or his female servant or his ox or his donkey or anything that belongs to your neighbor.” Rom. 3:19, “Now we know that whatever the Law says, it speaks to those who are under the Law, so that every mouth may be closed and all the world may become accountable to God.” Rom. 3:20, “because by the works of the Law no flesh will be justified in His sight; for through the Law comes the knowledge of sin.” Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.” Rom. 4:1–5, “What then shall we say that Abraham, our forefather according to the flesh, has found? 2 For if Abraham was justified by works, he has something to boast about, but not before God. 3 For what does the Scripture say? “Abraham believed God, and it was credited to him as righteousness.” 4 Now to the one who works, his wage is not credited as a favor, but as what is due. 5 But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.” Rom. 4:15, “for the Law brings about wrath, but where there is no law, there also is no violation.” Rom. 5:13–14, “for until the Law sin was in the world, but sin is not imputed when there is no law. 14 Nevertheless, death reigned from Adam until Moses, even over those who had not sinned in the likeness of the offense of Adam, who is a type of Him who was to come.” Rom. 5:20, “The Law came in so that the transgression would increase; but where sin increased, grace abounded all the more,” Rom. 7:7, “What shall we say then? Is the Law sin? May it never be! On the contrary, I would not have come to know sin except through the Law; for I would not have known about coveting if the Law had not said, “You shall not covet.” Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.” Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,” 1 John 3:4, “Everyone who practices sin also practices lawlessness; and sin is lawlessness.” Regarding salvation, scripture routinely mentions the relationship between faith and works and separates them regarding justification/salvation.Paul routinely contrasts faith and works and separates them. This is an important point in light of the idea that the RC and EO combine them in order to achieve salvation. (For the documentation on there doctrine of adding works of salvation see below).Faith apart from works,Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.”Faith apart from works,Rom. 4:5, “But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.”Faith apart from works, Romans 9:30–32, “What shall we say then? That Gentiles, who did not pursue righteousness, attained righteousness, even the righteousness which is by faith; 31 but Israel, pursuing a law of righteousness, did not arrive at that law. 32 Why? Because they did not pursue it by faith, but as though it were by works. They stumbled over the stumbling stone,”Faith apart from works,Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,”Faith apart from works,Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.”Faith apart from works, Gal. 3:10–11, “For as many as are of the works of the Law are under a curse; for it is written, “cursed is everyone who does not abide by all things written in the book of the law to perform them.” 11 Now that no one is justified by the Law before God is evident; for, ” the righteous man shall live by faith.”Faith apart from works, Eph. 2:8–9, “For by grace you have been saved through faith; and that not of yourselves, it is the gift of God; 9 not as a result of works, so that no one may boast.” Paul routinely contrasts faith and works and separates them. This is an important point in light of the idea that the RC and EO combine them in order to achieve salvation. (For the documentation on there doctrine of adding works of salvation see below).Faith apart from works,Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.”Faith apart from works,Rom. 4:5, “But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.”Faith apart from works, Romans 9:30–32, “What shall we say then? That Gentiles, who did not pursue righteousness, attained righteousness, even the righteousness which is by faith; 31 but Israel, pursuing a law of righteousness, did not arrive at that law. 32 Why? Because they did not pursue it by faith, but as though it were by works. They stumbled over the stumbling stone,”Faith apart from works,Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,”Faith apart from works,Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.”Faith apart from works, Gal. 3:10–11, “For as many as are of the works of the Law are under a curse; for it is written, “cursed is everyone who does not abide by all things written in the book of the law to perform them.” 11 Now that no one is justified by the Law before God is evident; for, ” the righteous man shall live by faith.”Faith apart from works, Eph. 2:8–9, “For by grace you have been saved through faith; and that not of yourselves, it is the gift of God; 9 not as a result of works, so that no one may boast.” Faith apart from works,Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.” Faith apart from works,Rom. 4:5, “But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.” Faith apart from works, Romans 9:30–32, “What shall we say then? That Gentiles, who did not pursue righteousness, attained righteousness, even the righteousness which is by faith; 31 but Israel, pursuing a law of righteousness, did not arrive at that law. 32 Why? Because they did not pursue it by faith, but as though it were by works. They stumbled over the stumbling stone,” Faith apart from works,Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,” Faith apart from works,Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.” Faith apart from works, Gal. 3:10–11, “For as many as are of the works of the Law are under a curse; for it is written, “cursed is everyone who does not abide by all things written in the book of the law to perform them.” 11 Now that no one is justified by the Law before God is evident; for, ” the righteous man shall live by faith.” Faith apart from works, Eph. 2:8–9, “For by grace you have been saved through faith; and that not of yourselves, it is the gift of God; 9 not as a result of works, so that no one may boast.” Paul routinely contrasts faith and works and separates them. This is an important point in light of the idea that the RC and EO combine them in order to achieve salvation. (For the documentation on there doctrine of adding works of salvation see below).Faith apart from works,Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.”Faith apart from works,Rom. 4:5, “But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.”Faith apart from works, Romans 9:30–32, “What shall we say then? That Gentiles, who did not pursue righteousness, attained righteousness, even the righteousness which is by faith; 31 but Israel, pursuing a law of righteousness, did not arrive at that law. 32 Why? Because they did not pursue it by faith, but as though it were by works. They stumbled over the stumbling stone,”Faith apart from works,Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,”Faith apart from works,Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.”Faith apart from works, Gal. 3:10–11, “For as many as are of the works of the Law are under a curse; for it is written, “cursed is everyone who does not abide by all things written in the book of the law to perform them.” 11 Now that no one is justified by the Law before God is evident; for, ” the righteous man shall live by faith.”Faith apart from works, Eph. 2:8–9, “For by grace you have been saved through faith; and that not of yourselves, it is the gift of God; 9 not as a result of works, so that no one may boast.” Faith apart from works,Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.” Faith apart from works,Rom. 4:5, “But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.” Faith apart from works, Romans 9:30–32, “What shall we say then? That Gentiles, who did not pursue righteousness, attained righteousness, even the righteousness which is by faith; 31 but Israel, pursuing a law of righteousness, did not arrive at that law. 32 Why? Because they did not pursue it by faith, but as though it were by works. They stumbled over the stumbling stone,” Faith apart from works,Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,” Faith apart from works,Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.” Faith apart from works, Gal. 3:10–11, “For as many as are of the works of the Law are under a curse; for it is written, “cursed is everyone who does not abide by all things written in the book of the law to perform them.” 11 Now that no one is justified by the Law before God is evident; for, ” the righteous man shall live by faith.” Faith apart from works, Eph. 2:8–9, “For by grace you have been saved through faith; and that not of yourselves, it is the gift of God; 9 not as a result of works, so that no one may boast.” Faith apart from works,Rom. 3:28, “For we maintain that a man is justified by faith apart from works of the Law.” Faith apart from works,Rom. 4:5, “But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness.” Faith apart from works, Romans 9:30–32, “What shall we say then? That Gentiles, who did not pursue righteousness, attained righteousness, even the righteousness which is by faith; 31 but Israel, pursuing a law of righteousness, did not arrive at that law. 32 Why? Because they did not pursue it by faith, but as though it were by works. They stumbled over the stumbling stone,” Faith apart from works,Phil. 3:9, “and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,” Faith apart from works,Gal. 2:16, “nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.” Faith apart from works, Gal. 3:10–11, “For as many as are of the works of the Law are under a curse; for it is written, “cursed is everyone who does not abide by all things written in the book of the law to perform them.” 11 Now that no one is justified by the Law before God is evident; for, ” the righteous man shall live by faith.” Faith apart from works, Eph. 2:8–9, “For by grace you have been saved through faith; and that not of yourselves, it is the gift of God; 9 not as a result of works, so that no one may boast.” Regarding faith and works, justification is either by faith alone or not by faith alone. This is a true dichotomy.A true dichotomy is when there are only two possibilities. So, our justification is by the faith that God grants us alone or is not the case that is by the faith that God grants us alone.James 2:24, “You see that a man is justified by works and not by faith alone.”The context of James 2:24 begins in verse 14, where James talks about a faith that has no works, and he says, “Can that faith save him?” What faith? The faith that is dead (ascentia – mental acknowledgment), v. 17. Furthermore, James is talking about works presented to people, not before God, because in verse 18 he says, “Show me your faith without the works, and I will show you my faith by my works.” This is dealing with the horizontal, that is, between people. This is talking about justification before people, not before God. James declares that even the demons have faith (v. 19). He again is mentioning false faith; that is, faith that has no true manifestation of good works. V. 21 is where Paul says Abraham was justified by works. Now, no Roman Catholic would say that works justify before God. Paul, of course, contradicts that as well (Rom. 3:28; 4:5, etc.) Again, since this is about justification before people, not before God (v. 18) as is consistent with other Scriptures (Rom. 3:28; 4:1-5; Gal. 2:16, 21), we can then understand that the works that James is talking about are not works that save you or contribute to salvation, but works that are the manifestation of true faith (fiducia – heartfelt faith and trust). Furthermore, when it says that “a man it is justified by works and not by faith alone, the context is justification before people (v. 18), not before God (Rom. 4:1-5). In other words, “show me your faith without the works, and I will show you my faith by my works” (James 2:18). So, James is consistent with the rest of Scripture. All you need to do is look at the context.In light of this, many people appeal to James 2:24 to state that justification before God is by works, and not faith alone.Furthermore, if they use James 2:24 as a statement in support of their position that works and faith save, then,from their perspective, they must be consistent and say that their justification before God is by works, as the text says, and not by faith alone. So then, do they agree that they are justified before God by their works of faith and good works? They would have to say that works justify us before God, along with our faith. But that, of course, contradicts what is clearly taught above in point 1. For more on this, see the CARM article “Are we justified by faith (Romans) or by works (James)?“ A true dichotomy is when there are only two possibilities. So, our justification is by the faith that God grants us alone or is not the case that is by the faith that God grants us alone.James 2:24, “You see that a man is justified by works and not by faith alone.”The context of James 2:24 begins in verse 14, where James talks about a faith that has no works, and he says, “Can that faith save him?” What faith? The faith that is dead (ascentia – mental acknowledgment), v. 17. Furthermore, James is talking about works presented to people, not before God, because in verse 18 he says, “Show me your faith without the works, and I will show you my faith by my works.” This is dealing with the horizontal, that is, between people. This is talking about justification before people, not before God. James declares that even the demons have faith (v. 19). He again is mentioning false faith; that is, faith that has no true manifestation of good works. V. 21 is where Paul says Abraham was justified by works. Now, no Roman Catholic would say that works justify before God. Paul, of course, contradicts that as well (Rom. 3:28; 4:5, etc.) Again, since this is about justification before people, not before God (v. 18) as is consistent with other Scriptures (Rom. 3:28; 4:1-5; Gal. 2:16, 21), we can then understand that the works that James is talking about are not works that save you or contribute to salvation, but works that are the manifestation of true faith (fiducia – heartfelt faith and trust). Furthermore, when it says that “a man it is justified by works and not by faith alone, the context is justification before people (v. 18), not before God (Rom. 4:1-5). In other words, “show me your faith without the works, and I will show you my faith by my works” (James 2:18). So, James is consistent with the rest of Scripture. All you need to do is look at the context.In light of this, many people appeal to James 2:24 to state that justification before God is by works, and not faith alone. James 2:24, “You see that a man is justified by works and not by faith alone.” The context of James 2:24 begins in verse 14, where James talks about a faith that has no works, and he says, “Can that faith save him?” What faith? The faith that is dead (ascentia – mental acknowledgment), v. 17. Furthermore, James is talking about works presented to people, not before God, because in verse 18 he says, “Show me your faith without the works, and I will show you my faith by my works.” This is dealing with the horizontal, that is, between people. This is talking about justification before people, not before God. James declares that even the demons have faith (v. 19). He again is mentioning false faith; that is, faith that has no true manifestation of good works. V. 21 is where Paul says Abraham was justified by works. Now, no Roman Catholic would say that works justify before God. Paul, of course, contradicts that as well (Rom. 3:28; 4:5, etc.) Again, since this is about justification before people, not before God (v. 18) as is consistent with other Scriptures (Rom. 3:28; 4:1-5; Gal. 2:16, 21), we can then understand that the works that James is talking about are not works that save you or contribute to salvation, but works that are the manifestation of true faith (fiducia – heartfelt faith and trust). Furthermore, when it says that “a man it is justified by works and not by faith alone, the context is justification before people (v. 18), not before God (Rom. 4:1-5). In other words, “show me your faith without the works, and I will show you my faith by my works” (James 2:18). So, James is consistent with the rest of Scripture. All you need to do is look at the context.In light of this, many people appeal to James 2:24 to state that justification before God is by works, and not faith alone. Furthermore, if they use James 2:24 as a statement in support of their position that works and faith save, then,from their perspective, they must be consistent and say that their justification before God is by works, as the text says, and not by faith alone. So then, do they agree that they are justified before God by their works of faith and good works? They would have to say that works justify us before God, along with our faith. But that, of course, contradicts what is clearly taught above in point 1. For more on this, see the CARM article “Are we justified by faith (Romans) or by works (James)?“ A true dichotomy is when there are only two possibilities. So, our justification is by the faith that God grants us alone or is not the case that is by the faith that God grants us alone.James 2:24, “You see that a man is justified by works and not by faith alone.”The context of James 2:24 begins in verse 14, where James talks about a faith that has no works, and he says, “Can that faith save him?” What faith? The faith that is dead (ascentia – mental acknowledgment), v. 17. Furthermore, James is talking about works presented to people, not before God, because in verse 18 he says, “Show me your faith without the works, and I will show you my faith by my works.” This is dealing with the horizontal, that is, between people. This is talking about justification before people, not before God. James declares that even the demons have faith (v. 19). He again is mentioning false faith; that is, faith that has no true manifestation of good works. V. 21 is where Paul says Abraham was justified by works. Now, no Roman Catholic would say that works justify before God. Paul, of course, contradicts that as well (Rom. 3:28; 4:5, etc.) Again, since this is about justification before people, not before God (v. 18) as is consistent with other Scriptures (Rom. 3:28; 4:1-5; Gal. 2:16, 21), we can then understand that the works that James is talking about are not works that save you or contribute to salvation, but works that are the manifestation of true faith (fiducia – heartfelt faith and trust). Furthermore, when it says that “a man it is justified by works and not by faith alone, the context is justification before people (v. 18), not before God (Rom. 4:1-5). In other words, “show me your faith without the works, and I will show you my faith by my works” (James 2:18). So, James is consistent with the rest of Scripture. All you need to do is look at the context.In light of this, many people appeal to James 2:24 to state that justification before God is by works, and not faith alone. James 2:24, “You see that a man is justified by works and not by faith alone.” The context of James 2:24 begins in verse 14, where James talks about a faith that has no works, and he says, “Can that faith save him?” What faith? The faith that is dead (ascentia – mental acknowledgment), v. 17. Furthermore, James is talking about works presented to people, not before God, because in verse 18 he says, “Show me your faith without the works, and I will show you my faith by my works.” This is dealing with the horizontal, that is, between people. This is talking about justification before people, not before God. James declares that even the demons have faith (v. 19). He again is mentioning false faith; that is, faith that has no true manifestation of good works. V. 21 is where Paul says Abraham was justified by works. Now, no Roman Catholic would say that works justify before God. Paul, of course, contradicts that as well (Rom. 3:28; 4:5, etc.) Again, since this is about justification before people, not before God (v. 18) as is consistent with other Scriptures (Rom. 3:28; 4:1-5; Gal. 2:16, 21), we can then understand that the works that James is talking about are not works that save you or contribute to salvation, but works that are the manifestation of true faith (fiducia – heartfelt faith and trust). Furthermore, when it says that “a man it is justified by works and not by faith alone, the context is justification before people (v. 18), not before God (Rom. 4:1-5). In other words, “show me your faith without the works, and I will show you my faith by my works” (James 2:18). So, James is consistent with the rest of Scripture. All you need to do is look at the context.In light of this, many people appeal to James 2:24 to state that justification before God is by works, and not faith alone. James 2:24, “You see that a man is justified by works and not by faith alone.” The context of James 2:24 begins in verse 14, where James talks about a faith that has no works, and he says, “Can that faith save him?” What faith? The faith that is dead (ascentia – mental acknowledgment), v. 17. Furthermore, James is talking about works presented to people, not before God, because in verse 18 he says, “Show me your faith without the works, and I will show you my faith by my works.” This is dealing with the horizontal, that is, between people. This is talking about justification before people, not before God. James declares that even the demons have faith (v. 19). He again is mentioning false faith; that is, faith that has no true manifestation of good works. V. 21 is where Paul says Abraham was justified by works. Now, no Roman Catholic would say that works justify before God. Paul, of course, contradicts that as well (Rom. 3:28; 4:5, etc.) Again, since this is about justification before people, not before God (v. 18) as is consistent with other Scriptures (Rom. 3:28; 4:1-5; Gal. 2:16, 21), we can then understand that the works that James is talking about are not works that save you or contribute to salvation, but works that are the manifestation of true faith (fiducia – heartfelt faith and trust). Furthermore, when it says that “a man it is justified by works and not by faith alone, the context is justification before people (v. 18), not before God (Rom. 4:1-5). In other words, “show me your faith without the works, and I will show you my faith by my works” (James 2:18). So, James is consistent with the rest of Scripture. All you need to do is look at the context.In light of this, many people appeal to James 2:24 to state that justification before God is by works, and not faith alone. Furthermore, if they use James 2:24 as a statement in support of their position that works and faith save, then,from their perspective, they must be consistent and say that their justification before God is by works, as the text says, and not by faith alone. So then, do they agree that they are justified before God by their works of faith and good works? They would have to say that works justify us before God, along with our faith. But that, of course, contradicts what is clearly taught above in point 1. For more on this, see the CARM article “Are we justified by faith (Romans) or by works (James)?“ **Roman Catholic documentation** Heaven is a reward for good works“In every circumstance, each one of us should hope, with the grace of God, to persevere ‘to the end’ andto obtain the joy of heaven, as God’s eternal reward for the good works accomplished with the grace of Christ”(Catechism of the Catholic Church 1821). Attain salvation through commandments“…the mission of teaching all peoples, and of preaching the Gospel to every creature, sothat all men may attain salvation through faith, Baptism and the observance of the Commandments”(CCC 2068). Keeping the 10 commandments is necessary for salvation“The authority of the Magisterium extends also tothe specific precepts of the natural law [i.e., 10 Commandments, CCC 2070], because their observance, demanded by the Creator, is necessary for salvation”(CCC 2036). **Eastern Orthodoxy documentation** Not by faith alone, but through faith and works“We believe a man to be not simply justified through faith alone, but through faith which works through love, that is to say, through faith and works.But [the idea] that faith can fulfill the function of a hand that lays hold on the righteousness which is in Christ, and can then apply it unto us for salvation, we know to be far from all Orthodoxy…we rather believe that it is not the correlative of faith, but the faith which is in us, justifies through works” (Confession of Dositheus, 1672, Decree 13). Salvation by persevering in faith and good works“To wit, thatif we persevere with constancy in faith and good works, we shall finally become partakers of salvation and eternal life.(Confession of Mogila, 1642, Part 1, Question 101). Good works are necessary to save your soul.“What is necessary in order to please God and to save one’s own soul? In the first place, a knowledge of the true God, and a right faith in him; in the second place, a life according to faith,and good works.”(Longer Catechism Q. 3, pravoslavieto.com/docs/eng/Orthodox_Catechism_of_Philaret.htm) **Related Articles** Go to the Doctrine and Theology main page What are the core beliefs of Christianity? What is the Trinity? Who is God? Who is Jesus? Federal Headship What is regeneration in Christianity? Benefits of learning Christian theology Salvation: What Does it Mean to Be a Christian? Blue Letter Bible on Christianity Thank you for your interest in supporting CARM. We greatly appreciate your consideration! **Join Our Newsletter** We'd love to keep you up to date with what is happening at CARM. **Success!** Email Subscribe We hate SPAM and promise to keep your email address safe. If you have any issues, please call the office at 385-246-1048 or email us at[email protected]. Call in with your questions at: **877-207-2276** 3-4 p.m. PST; 4-5 p.m. MST;6-7 p.m. EST Watch on Facebook Watch on Youtube Watch on Rumble **Statement of Faith** **Our Team** **Authors & Writers** **Calendar of Events** **Copying & Linking** **Help CARM** **Donate/My Account** **Forums** **Radio Show** **Online Schools** **Store** **Join Our Newsletter** CARM is a nonprofit, non-denominational, multi-staffed Christian Apologetics Ministry that supports evangelism, radio outreach, and provides full-time support for several foreign missionaries. CARM|P.O. Box 1353 | Nampa, ID 83653 USA1-800-803-8093 Home Matt Slick LIVE Privacy Terms Donate Contact"}