{"id": 819, "name": "Los Angeles Sentinel", "domain": "lasentinel.net", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://lasentinel.net/new-orleans-holds-burial-of-repatriated-african-americans-whose-skulls-were-used-in-racist-research.html", "title": "New Orleans Holds Burial Of Repatriated African Americans Whose Skulls Were Used In Racist Research.html", "content": "Home About UsContact UsAbout the Publisher, Danny J. Bakewell, Sr.Brenda Marsh-MitchellArchivesMedia Kit Contact Us About the Publisher, Danny J. Bakewell, Sr. Brenda Marsh-Mitchell Archives Media Kit Contact Us About the Publisher, Danny J. Bakewell, Sr. Brenda Marsh-Mitchell Archives Media Kit NewsCalendar/EventsLocalNationalCaliforniaPoliticalEntertainmentBook ReleasesComedyMoviesExclusive (Entertainment)MusicTVTheaterSportsBaseballBasketballBoxingFootballHigh SchoolNews (Sports)History (Sports)SoccerOpinionAntonio MooreArdena Joy CotaASK DR. JEANETTE, SUCCESS ON THE WAYCharlene CrowellDr. Ben ChavisDr. Firpo W. CarrDr. Maulana KarengaEditorialsJasmyne CannickJohn WarrenJulianne MalveauxLarry AubryMarc MorialOp-EdReggie Jones-SawyerRev. Jesse JacksonThe LobbyWENDY’S WINDOWFamilyFashionHealthLifestyleNews (Family)SafetyCrenshaw & AroundA Taste of SoulMetroReligionBusinessEconomyFinanceNews (Business)Real EstateRestaurant Calendar/Events Local National California Political EntertainmentBook ReleasesComedyMoviesExclusive (Entertainment)MusicTVTheater Book Releases Comedy Movies Exclusive (Entertainment) Music TV Theater SportsBaseballBasketballBoxingFootballHigh SchoolNews (Sports)History (Sports)Soccer Baseball Basketball Boxing Football High School News (Sports) History (Sports) Soccer OpinionAntonio MooreArdena Joy CotaASK DR. JEANETTE, SUCCESS ON THE WAYCharlene CrowellDr. Ben ChavisDr. Firpo W. CarrDr. Maulana KarengaEditorialsJasmyne CannickJohn WarrenJulianne MalveauxLarry AubryMarc MorialOp-EdReggie Jones-SawyerRev. Jesse JacksonThe LobbyWENDY’S WINDOW Antonio Moore Ardena Joy Cota ASK DR. JEANETTE, SUCCESS ON THE WAY Charlene Crowell Dr. Ben Chavis Dr. Firpo W. Carr Dr. Maulana Karenga Editorials Jasmyne Cannick John Warren Julianne Malveaux Larry Aubry Marc Morial Op-Ed Reggie Jones-Sawyer Rev. Jesse Jackson The Lobby WENDY’S WINDOW FamilyFashionHealthLifestyleNews (Family)Safety Fashion Health Lifestyle News (Family) Safety Crenshaw & AroundA Taste of SoulMetro A Taste of Soul Metro Religion BusinessEconomyFinanceNews (Business)Real EstateRestaurant Economy Finance News (Business) Real Estate Restaurant Calendar/Events Local National California Political EntertainmentBook ReleasesComedyMoviesExclusive (Entertainment)MusicTVTheater Book Releases Comedy Movies Exclusive (Entertainment) Music TV Theater Book Releases Comedy Movies Exclusive (Entertainment) Music TV Theater SportsBaseballBasketballBoxingFootballHigh SchoolNews (Sports)History (Sports)Soccer Baseball Basketball Boxing Football High School News (Sports) History (Sports) Soccer Baseball Basketball Boxing Football High School News (Sports) History (Sports) Soccer OpinionAntonio MooreArdena Joy CotaASK DR. JEANETTE, SUCCESS ON THE WAYCharlene CrowellDr. Ben ChavisDr. Firpo W. CarrDr. Maulana KarengaEditorialsJasmyne CannickJohn WarrenJulianne MalveauxLarry AubryMarc MorialOp-EdReggie Jones-SawyerRev. Jesse JacksonThe LobbyWENDY’S WINDOW Antonio Moore Ardena Joy Cota ASK DR. JEANETTE, SUCCESS ON THE WAY Charlene Crowell Dr. Ben Chavis Dr. Firpo W. Carr Dr. Maulana Karenga Editorials Jasmyne Cannick John Warren Julianne Malveaux Larry Aubry Marc Morial Op-Ed Reggie Jones-Sawyer Rev. Jesse Jackson The Lobby WENDY’S WINDOW Antonio Moore Ardena Joy Cota ASK DR. JEANETTE, SUCCESS ON THE WAY Charlene Crowell Dr. Ben Chavis Dr. Firpo W. Carr Dr. Maulana Karenga Editorials Jasmyne Cannick John Warren Julianne Malveaux Larry Aubry Marc Morial Op-Ed Reggie Jones-Sawyer Rev. Jesse Jackson The Lobby WENDY’S WINDOW FamilyFashionHealthLifestyleNews (Family)Safety Fashion Health Lifestyle News (Family) Safety Fashion Health Lifestyle News (Family) Safety Crenshaw & AroundA Taste of SoulMetro A Taste of Soul Metro A Taste of Soul Metro Religion BusinessEconomyFinanceNews (Business)Real EstateRestaurant Economy Finance News (Business) Real Estate Restaurant Economy Finance News (Business) Real Estate Restaurant Podcasts Videos E-Paper Classifieds Subscribe Signup for E-Paper Home About UsContact UsAbout the Publisher, Danny J. Bakewell, Sr.Brenda Marsh-MitchellArchivesMedia Kit Contact Us About the Publisher, Danny J. Bakewell, Sr. Brenda Marsh-Mitchell Archives Media Kit Contact Us About the Publisher, Danny J. Bakewell, Sr. Brenda Marsh-Mitchell Archives Media Kit NewsCalendar/EventsLocalNationalCaliforniaPoliticalEntertainmentBook ReleasesComedyMoviesExclusive (Entertainment)MusicTVTheaterSportsBaseballBasketballBoxingFootballHigh SchoolNews (Sports)History (Sports)SoccerOpinionAntonio MooreArdena Joy CotaASK DR. JEANETTE, SUCCESS ON THE WAYCharlene CrowellDr. Ben ChavisDr. Firpo W. CarrDr. Maulana KarengaEditorialsJasmyne CannickJohn WarrenJulianne MalveauxLarry AubryMarc MorialOp-EdReggie Jones-SawyerRev. Jesse JacksonThe LobbyWENDY’S WINDOWFamilyFashionHealthLifestyleNews (Family)SafetyCrenshaw & AroundA Taste of SoulMetroReligionBusinessEconomyFinanceNews (Business)Real EstateRestaurant Calendar/Events Local National California Political EntertainmentBook ReleasesComedyMoviesExclusive (Entertainment)MusicTVTheater Book Releases Comedy Movies Exclusive (Entertainment) Music TV Theater SportsBaseballBasketballBoxingFootballHigh SchoolNews (Sports)History (Sports)Soccer Baseball Basketball Boxing Football High School News (Sports) History (Sports) Soccer OpinionAntonio MooreArdena Joy CotaASK DR. JEANETTE, SUCCESS ON THE WAYCharlene CrowellDr. Ben ChavisDr. Firpo W. CarrDr. Maulana KarengaEditorialsJasmyne CannickJohn WarrenJulianne MalveauxLarry AubryMarc MorialOp-EdReggie Jones-SawyerRev. Jesse JacksonThe LobbyWENDY’S WINDOW Antonio Moore Ardena Joy Cota ASK DR. JEANETTE, SUCCESS ON THE WAY Charlene Crowell Dr. Ben Chavis Dr. Firpo W. Carr Dr. Maulana Karenga Editorials Jasmyne Cannick John Warren Julianne Malveaux Larry Aubry Marc Morial Op-Ed Reggie Jones-Sawyer Rev. Jesse Jackson The Lobby WENDY’S WINDOW FamilyFashionHealthLifestyleNews (Family)Safety Fashion Health Lifestyle News (Family) Safety Crenshaw & AroundA Taste of SoulMetro A Taste of Soul Metro Religion BusinessEconomyFinanceNews (Business)Real EstateRestaurant Economy Finance News (Business) Real Estate Restaurant Calendar/Events Local National California Political EntertainmentBook ReleasesComedyMoviesExclusive (Entertainment)MusicTVTheater Book Releases Comedy Movies Exclusive (Entertainment) Music TV Theater Book Releases Comedy Movies Exclusive (Entertainment) Music TV Theater SportsBaseballBasketballBoxingFootballHigh SchoolNews (Sports)History (Sports)Soccer Baseball Basketball Boxing Football High School News (Sports) History (Sports) Soccer Baseball Basketball Boxing Football High School News (Sports) History (Sports) Soccer OpinionAntonio MooreArdena Joy CotaASK DR. JEANETTE, SUCCESS ON THE WAYCharlene CrowellDr. Ben ChavisDr. Firpo W. CarrDr. Maulana KarengaEditorialsJasmyne CannickJohn WarrenJulianne MalveauxLarry AubryMarc MorialOp-EdReggie Jones-SawyerRev. Jesse JacksonThe LobbyWENDY’S WINDOW Antonio Moore Ardena Joy Cota ASK DR. JEANETTE, SUCCESS ON THE WAY Charlene Crowell Dr. Ben Chavis Dr. Firpo W. Carr Dr. Maulana Karenga Editorials Jasmyne Cannick John Warren Julianne Malveaux Larry Aubry Marc Morial Op-Ed Reggie Jones-Sawyer Rev. Jesse Jackson The Lobby WENDY’S WINDOW Antonio Moore Ardena Joy Cota ASK DR. JEANETTE, SUCCESS ON THE WAY Charlene Crowell Dr. Ben Chavis Dr. Firpo W. Carr Dr. Maulana Karenga Editorials Jasmyne Cannick John Warren Julianne Malveaux Larry Aubry Marc Morial Op-Ed Reggie Jones-Sawyer Rev. Jesse Jackson The Lobby WENDY’S WINDOW FamilyFashionHealthLifestyleNews (Family)Safety Fashion Health Lifestyle News (Family) Safety Fashion Health Lifestyle News (Family) Safety Crenshaw & AroundA Taste of SoulMetro A Taste of Soul Metro A Taste of Soul Metro Religion BusinessEconomyFinanceNews (Business)Real EstateRestaurant Economy Finance News (Business) Real Estate Restaurant Economy Finance News (Business) Real Estate Restaurant Podcasts Videos E-Paper Classifieds Subscribe Signup for E-Paper Westchester Softball Wins City Section Championship Odie Hawkins: A Life That’s One for the Books ‘It Just Doesn’t Make Sense’: Seniors Protest Trump’s ‘Big Beautiful Bill’ in Leimert Park ‘He Sure Fought Like Hell for Us’ – Californians Gather to Honor Trailblazer Nate Holden Misty Copeland broke barriers in ballet. Now she’s retiring and moving to ‘the next stage’ Judge Accept’s Ye’s Challenge to Recently Appointed Discovery Referee ‘Purpose’ Wins Big at 2025 Tony Awards Paul Tazewell Joins Oscar-Tony Club With Historic Win for ‘Death Becomes Her’ **New Orleans holds burial of repatriated African Americans whose skulls were used in racist research** By STEPHEN SMITH and JACK BROOK Associated Press NEW ORLEANS (AP) — New Orleans celebrated the return and burial of the remains of 19 African American people whose skulls had been sent to Germany for racist research practices in the 19th century. On Saturday, a multifaith memorial service including a jazz funeral, one of the city’s most distinct traditions, paid tribute to the humanity of those coming home to their final resting place at the Hurricane Katrina Memorial. “We ironically know these 19 because of the horrific thing that happened to them after their death, the desecration of their bodies,” said Monique Guillory, president of Dillard University, a historically Black private liberal arts college, which spearheaded the receipt of the remains on behalf of the city. “This is actually an opportunity for us to recognize and commemorate the humanity of all of these individuals who would have been denied, you know, such a respectful send-off and final burial.” The 19 people are all believed to have passed away from natural causes between 1871 and 1872 at Charity Hospital, which served people of all races and classes in New Orleans during the height of white supremacist oppression in the 1800s. The hospital shuttered following Hurricane Katrina in 2005. The remains sat in 19 wooden boxes in the university’s chapel during a service Saturday that also included music from the Kumbuka African Drum and Dance Collective. A New Orleans physician provided the skulls of the 19 people to a German researcher engaged phrenological studies — the debunked belief that a person’s skull could determine innate racial characteristics. “All kinds of experiments were done on Black bodies living and dead,” said Dr. Eva Baham, a historian who led Dillard University’s efforts to repatriate the individuals’ remains. “People who had no agency over themselves.” In 2023, the University of Leipzig in Germany reached out to the City of New Orleans to find a way to return the remains, Guillory said. The University of Leipzig did not immediately respond to a request for comment. “It is a demonstration of our own morality here in New Orleans and in Leipzig with the professors there who wanted to do something to restore the dignity of these people,” Baham said. Dillard University researchers say more digging remains to be done, including to try and track down possible descendants. They believe it is likely that some of the people had been recently freed from slavery. “These were really poor, indigent people in the end of the 19th century, but … they had names, they had addresses, they walked the streets of the city that we love,” Guillory said. “We all deserve a recognition of our humanity and the value of our lives.” **South LA Leaders Join Smallwood-Cuevas to Launch Historic Black Cultural District** **Black History in Los Angeles Unified School District** **Black History Month: Sports Profiles** **L.A. Sentinel Goes One-On-One with U.S. Education Secretary Miguel Cardona**"}