{"id": 751, "name": "KHNS - NPR - Haines", "domain": "khns.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://khns.org/proposed-ordinance-would-stop-mayor-from-participating-in-discussion-during-assembly-meetings/", "title": "Proposed Ordinance Would Stop Mayor From Participating In Discussion During Assembly Meetings", "content": "NewsNewsLynn Canal VoiceListener CommentaryAbout NewsMorning Mayor Interviews News Lynn Canal Voice Listener Commentary About News Morning Mayor Interviews News Lynn Canal Voice Listener Commentary About News Morning Mayor Interviews ProgrammingProgrammingProgram GuideCurrent Show PlaylistStream ArchiveMorning InterviewsQuestion Corner Programming Program Guide Current Show Playlist Stream Archive Morning Interviews Question Corner Programming Program Guide Current Show Playlist Stream Archive Morning Interviews Question Corner DJ Calendar Listener Submissions About KHNSAbout KHNSAbout NewsStation UpdatesKHNS Board of DirectorsKHNS StaffKHNS – On Air TalentKHNS Community Advisory BoardJob OpportunitiesStation Documents About KHNS About News Station Updates KHNS Board of Directors KHNS Staff KHNS – On Air Talent KHNS Community Advisory Board Job Opportunities Station Documents About KHNS About News Station Updates KHNS Board of Directors KHNS Staff KHNS – On Air Talent KHNS Community Advisory Board Job Opportunities Station Documents Support KHNSBecome a MemberUpdate My Membership InfoPlanned GivingUnderwritersVolunteerPurchase Annual Art Prints Become a Member Update My Membership Info Planned Giving Underwriters Volunteer Purchase Annual Art Prints Become a Member Update My Membership Info Planned Giving Underwriters Volunteer Purchase Annual Art Prints Contact Us Select Page **Proposed ordinance would stop mayor from participating in discussion during assembly meetings** By Melinda Munson | June 9, 2025 The Haines Assembly will address a proposed rule change at its next meeting that would stop the mayor from engaging in discourse once motions are made to discuss agenda items. The suggested change may not align with the boroughcode. At the last Haines Borough Assembly meeting on May 27, Assembly members Richard Clement and Mark Smith expressed frustration with Mayor Tom Morphet. Here’s a snippet of the conversation, which starts off with the mayor talking about accessory dwelling units. Morphet: “You know, if we want to get into building standards… Clement: Point of order. Morphet: What’s your point? Clement: Chair is engaging in debate. Morphet: That’s right, that’s allowed, that’s allowed. If we want to get into building design questions and zoning, we can go there. But… Smith: Point of order. I agree with Mr. Clement.” Now, Assembly member Clement has proposed anordinancefor the June 10 meeting that would disallow the mayor from participating in debate. It reads, the mayor “shall only speak when needed to recognize Assembly members during debate.” This contradicts the town’s charter. The HainesCharterstates that, “The mayor may participate in all assembly meeting discussions.” Again, Assembly member Smith and Mayor Morphet at the May 27 meeting. Smith: “You just sounded very opinionated, Mr. Mayor.” Morphet: “Well, the mayor has opinions. Yes, he does.” The agenda for the next assembly meeting on June 10 is lengthy. Along with Clement’s proposal, it includes approval of a police chief hire and adoption of the FY26 budget. Update: Assembly member Richard Clement withdrew the ordinance at the beginning of the June 10 meeting, stating he would find other ways to shorten the length of meetings. Share: **Related Posts** April 9, 2025 July 25, 2024 December 9, 2022 May 17, 2024 **Leave a replyCancel reply** Your email address will not be published.Required fields are marked* COMMENT Name Email Website Δ Serving Haines, Skagway and Klukwan on 102.3 and 91.9 FM LOCATIONChilkat Center for the ArtsOne Theatre Dr, Haines, AK 99827 MAILING ADDRESSP.O. Box 1109, Haines, AK 99827 TELEPHONE907-766-2020 in Haines907-983-2853 in Skagway EMAILContact us via email NewsAbout News About News About News Programming Shop Station Documents Contact Us FCC Public Files"}