{"id": 31, "name": "KMIZ - Columbia News", "domain": "abc17news.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://abc17news.com/news/national-world/cnn-national/2025/06/11/trumps-pick-to-lead-faa-grilled-by-senators-over-air-traffic-control-system-safety-at-reagan-national-airport/", "title": "Trumps Pick To Lead Faa Grilled By Senators Over Air Traffic Control System Safety At Reagan National Airport", "content": "Home NewsFull April 2025 Election ResultsEducationColumbiaCrimeJefferson CityMissouriUS/WorldDownload Our AppsQuestion of the Day Full April 2025 Election Results Education Columbia Crime Jefferson City Missouri US/World Download Our Apps Question of the Day Full April 2025 Election Results Education Columbia Crime Jefferson City Missouri US/World Download Our Apps Question of the Day ABC 17 Investigates WeatherABC 17 Stormtrack Doppler RadarABC 17 Stormtrack Insider BlogStormtrack Insider OutdoorsABC 17 Stormtrack Weather Alert DaysForecastCamerasClosings and DelaysDownload Our Apps ABC 17 Stormtrack Doppler Radar ABC 17 Stormtrack Insider Blog Stormtrack Insider Outdoors ABC 17 Stormtrack Weather Alert Days Forecast Cameras Closings and Delays Download Our Apps ABC 17 Stormtrack Doppler Radar ABC 17 Stormtrack Insider Blog Stormtrack Insider Outdoors ABC 17 Stormtrack Weather Alert Days Forecast Cameras Closings and Delays Download Our Apps SportsSuper Bowl 2025High School SportsMizzou TigersSportsZone Football FridaySportsZone Basketball Super Bowl 2025 High School Sports Mizzou Tigers SportsZone Football Friday SportsZone Basketball Super Bowl 2025 High School Sports Mizzou Tigers SportsZone Football Friday SportsZone Basketball Columbia City Government Jefferson City Government VideosLivestream Special CoverageLivestream Newscasts Livestream Special Coverage Livestream Newscasts Livestream Special Coverage Livestream Newscasts LifeMother’s DayVolunteeringFuel FinderHouse & HomeHealthy PetsYour MoneyTaxes Mother’s Day Volunteering Fuel Finder House & Home Healthy Pets Your Money Taxes Mother’s Day Volunteering Fuel Finder House & Home Healthy Pets Your Money Taxes Go MO Places Show-Me Health A Family For Me On Her Mind Community Calendar PlayContestsEntertainment Contests Entertainment Contests Entertainment ShareSubmit Tips, Pics and Video Submit Tips, Pics and Video Submit Tips, Pics and Video FOX 22Community Calendar Community Calendar Community Calendar JobsWork for KMIZExplore Local JobsIntern with KMIZ Work for KMIZ Explore Local Jobs Intern with KMIZ Work for KMIZ Explore Local Jobs Intern with KMIZ About UsDownload Our AppsAdvertise With UsMeet the TeamContact UsJobs/InternshipsClosed CaptioningEEO Public FilingFCC Public FileTV Listings Download Our Apps Advertise With Us Meet the Team Contact Us Jobs/Internships Closed Captioning EEO Public Filing FCC Public File TV Listings Download Our Apps Advertise With Us Meet the Team Contact Us Jobs/Internships Closed Captioning EEO Public Filing FCC Public File TV Listings News Weather Sports FOX 22 Life Events Play Share **Video Forecast** **Tracking humid air, more clouds and a few storms Thursday** **Top Stories** **Law enforcement arrests man accused of trying to take deputy’s gun during traffic stop** **Sedalia man accused of demanding family at park to ‘show their papers’** **Missouri House passes Kansas City stadium bill** **‘No Kings’ rallies planned across Mid-Missouri** **Brian Wilson, music icon and creative force behind The Beach Boys, dead at 82** **Trump’s pick to lead FAA grilled by senators over air traffic control system, safety at Reagan National Airport** By Alexandra Skores, CNN Washington, DC (CNN) —President Trump’s nominee to lead the Federal Aviation Administration was grilled by senators Wednesday on critical safety-related issues, including the required hours needed for pilots, the outdated air traffic control system and the ongoing problems at Ronald Reagan Washington National Airport. At a hearing held by the Senate Committee on Commerce, Science and Transportation, senators raised questions about the current state of the country’s aviation system to airline executive Bryan Bedford. The FAA administrator role has been filled by Chris Rocheleau on an interim basis since the departure of former Administrator Mike Whitaker on Inauguration Day. Top of the mind for senators was safety. If confirmed, Bedford would oversee the country’s airspace system, which has dealt with several issues over the last six months, including fatal air travel incidents and an outdated air traffic control system that has experienced technology outages. “The system that manages our skies is showing its age,” Bedford testified. “The stresses of this antiquated system truly came into view as we all returned to the skies after Covid. Chronic understaffing, controller fatigue, outdated facilities and telecommunications technology has placed a significant strain on the men and women at the FAA, and it has absolutely frustrated travelers with excessive delays and cancellations and has caused the public to question whether it’s truly safe to fly.” Senators pressed Bedford on major challenges facing the FAA as it grapples with repeat air traffic control systemsfailuresat the approach control facility for Newark Liberty International Airport; aging air traffic controlinfrastructurenationwide; and ashortageof 3,000 air traffic controllers. ‘We need to shine a light on this’ **‘We need to shine a light on this’** **‘We need to shine a light on this’** In attendance at Wednesday’s hearing were the parents of Sam Lilley, the first officer killed in the midair collision at Reagan National Airport in January that killed 67 people. Bedford said he met with the families that lost loved ones in the tragedy. The crash led to aban on helicopter trafficon a four-mile stretch over the Potomac River. “We need to shine a light on this,” Bedford said. “Transparency is going to help us find permanent solutions.” Bedford reiterated his top priority “will be public safety and restoring the public’s confidence in flying.” With regard to the crash, Sen. Jerry Moran, a Republican from Kansas, brought up legislation recently introduced involving ADS-B. Civilian and military aircraft use ADS-B, which helps an aircraft broadcast its location, altitude and other key factors while monitoring other aircraft aroundit. ADS-B Out broadcasts aircraft information, while ADS-B In allows aircraft to receive that information. “ADS-B In can be a significant safety improvement for the visibility of traffic because it incorporates the traffic that’s on the ground,” Bedford said. “So, when we look at the alerting systems that we have and we’re relying on, even when we’re using surface radars, it still requires the controller to be in the loop.” But theArmy often turned it off while flying on missions in Washington. The NTSB previously confirmed the Army’s Black Hawk helicopter involved in January’s collision had the necessary equipment and was capable of transmitting, but investigators still do not know why it wasn’t. A closed-door roundtable is expected later Wednesday among lawmakers regarding the safety troubles at Reagan National Airport. In May,some helicopter flights to the Pentagon were put on hold by the US Army pending an investigation after two planes at Reagan National Airport were forced to abort landings as a US Army Black Hawk helicopter approached the Pentagon nearby. Those Army helicopters were from the same unit as the one that crashed. At 4:15 p.m., the members of the Senate Subcommittee on Aviation will meet with Brig. Gen.Matthew Braman, director of Army Aviation; Rocheleau and Jennifer Homendy, chairwoman of the National Transportation Safety Board. Changing the required hours for pilots **Changing the required hours for pilots** **Changing the required hours for pilots** Bedford has long opposed a requirement for new pilots at commercial air carriers to obtain 1,500 flight hours, which many senators brought up during Wednesday’s hearing. The rule was created after the crash ofContinental Connection Flight 3407near Buffalo, New York, which left 50 people dead. The NTSB found pilot error was to blame. His opposition to the ruledates as far back as 2014, when he testified at a hearingfor the House Subcommittee on Aviation. He called the rule “a largely inflexible and arbitrary” in his opening remarks. The rule left regional air carriers such as Republic Airways in a pilot shortage at the time. The families of those killed in the 2009 crash expressed “serious concerns” about Bedford’s nomination, specifically citing his effort to circumvent the rule as CEO of Republic Airways. Bedford joined Republic in 1999 as president and CEO,according to the airline’s website. Sen. Tammy Duckworth, a Democrat from Illinois and ranking member of the Aviation Subcommittee said Bedford was “leaving the door open” for changes to the FAA’s required 1,500-flight-hour rule for first-time commercial airline pilots. “I’ve asked you four questions on whether or not you will unilaterally reduce the 1,500-hour rule … at no point have you answered yes, so you are leaving the door open,” Duckworth said. Bedford did not outright say he was committing to maintaining the 1,500-hour rule, a pilot training requirement. During questioning, Bedford said reducing the flight hours was not his priority, stressing that he was more focused on “fixing the air traffic control system.” “There won’t be safety loopholes, I commit to you,” Bedford said. “We will never do anything to reduce the safety and competency of our pilots.” CNN’s Pete Muntean asked Bedford after the hearing about the 1,500-hour rule, but he did not comment further. Air traffic control system **Air traffic control system** **Air traffic control system** A top priority for the FAA is the dated air traffic control system. Paper strips and floppy discs — technology still used by controllers today — have become a talking point on Capitol Hill. The system, which has technology in use since the 1970s and ‘80s, has been in the spotlight recently because of at least four outages that occurred late this spring at Newark Liberty International Airport, where controllers lost sight of planes and technology went dark. Since then, Newark Airport has seen a number of fixes, butthe FAA doesn’t expect it to be back to normal until October. The FAA announced plans in Mayto replace core infrastructure including radar, software, hardware and telecommunications networks to manage modern travel. Duffy has not yet disclosed how much the project would cost but is counting on Congress to deliver funding. “I believe the agency can get back on the right track if we can all agree first that the air traffic control system needs significant investment,” Bedford said. The agency recently issued aRequest for Informationfor a company to implement a “brand new air traffic control system over the next three years.” It has identified five areas of interest for a new system: telecommunications, radio communications, surveillance, automation and facilities. It’s unclear how this will impact Verizon’s contract with the FAA to modernize the system.Verizon has a massive $2.4 billion contractto provide a long-sought upgrade to the FAA’s communications system, known as the FAA Enterprise Network Services, or FENS, program. Sen. John Hickenlooper, a Democrat from Colorado, asked Bedford what ideas he had to address the air traffic control problems. “I think one of the challenges have is a lack of trust,” Bedford said,echoing written remarks he submitted to senators ahead of the hearing. “There’s a lack of trust issues within the FAA and between the FAA and some of the stakeholders, and it’s been explained to me why some of those issues there are, but we have to move past that. We will have to embrace transparency and accountability as we move forward this process.” CNN’s Pete Muntean contributed to this report. The-CNN-Wire™ & © 2025 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved. Jump to comments ↓ **CNN Newsource** **Related Articles** **5 things to know for June 11: LA protests, FEMA, Tariffs, Gun laws, Pesticides** **5 things to know for June 11: LA protests, FEMA, Tariffs, Gun laws, Pesticides** **Trans rights are under attack. These trans elders say they ‘aren’t afraid’** **Education Dept. considering cuts for California universities while making ‘progress’ with Harvard and Columbia, McMahon says** ABC 17 News is committed to providing a forum for civil and constructive conversation. Please keep your comments respectful and relevant. You can review our Community Guidelines byclicking here If you would like to share a story idea, please submit ithere. Terms of Service|Privacy Policy|Community Guidelines|KMIZ-TV FCC Public File|FCC Applications| Do Not Sell My Personal Information **Subscribe to our Email Lists** Breaking NewsSevere WeatherDaily News & Weather UpdatesContests & Promotions **Download Our Apps** Accessibility Tools Increase TextIncrease Text Decrease TextDecrease Text GrayscaleGrayscale High ContrastHigh Contrast Negative ContrastNegative Contrast Light BackgroundLight Background Links UnderlineLinks Underline Readable FontReadable Font ResetReset"}