{"id": 1398, "name": "The Local (Spain)", "domain": "thelocal.es", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thelocal.es/20250605/even-spaniards-who-exactly-would-have-to-pay-spains-100-property-tax/#article-comments", "title": "Even Spaniards Who Exactly Would Have To Pay Spains 100 Property Tax", "content": "**Advertisement** Spanish NewsLatest newsTravel newsStrikesMadridBarcelonaAndalusiaValenciaPolitics Latest news Travel news Strikes Madrid Barcelona Andalusia Valencia Politics Latest news Travel news Strikes Madrid Barcelona Andalusia Valencia Politics GuidesMoving to SpainVisasTaxesJobsBuying a propertyRentingRetirementHealthcare Moving to Spain Visas Taxes Jobs Buying a property Renting Retirement Healthcare Moving to Spain Visas Taxes Jobs Buying a property Renting Retirement Healthcare EssentialsCitizenshipVisasPensionsTaxesLiving costsReader questionsDriving licences Citizenship Visas Pensions Taxes Living costs Reader questions Driving licences Citizenship Visas Pensions Taxes Living costs Reader questions Driving licences Discover SpainMoving to SpainLiving in SpainSpain explainedDiscover SpainSpanish Food and DrinkSpanish traditionsSpanish habits Moving to Spain Living in Spain Spain explained Discover Spain Spanish Food and Drink Spanish traditions Spanish habits Moving to Spain Living in Spain Spain explained Discover Spain Spanish Food and Drink Spanish traditions Spanish habits LanguageLanguage LessonsLearning SpanishSpanish Word of the day Language Lessons Learning Spanish Spanish Word of the day Language Lessons Learning Spanish Spanish Word of the day HomesPropertyRentingProperty SalesFind rentals Property Renting Property Sales Find rentals Property Renting Property Sales Find rentals JobsWorking in SpainFind jobs in Spain Working in Spain Find jobs in Spain Working in Spain Find jobs in Spain Spanish NewsLatest newsTravel newsStrikesMadridBarcelonaAndalusiaValenciaPolitics Latest news Travel news Strikes Madrid Barcelona Andalusia Valencia Politics Latest news Travel news Strikes Madrid Barcelona Andalusia Valencia Politics GuidesMoving to SpainVisasTaxesJobsBuying a propertyRentingRetirementHealthcare Moving to Spain Visas Taxes Jobs Buying a property Renting Retirement Healthcare Moving to Spain Visas Taxes Jobs Buying a property Renting Retirement Healthcare EssentialsCitizenshipVisasPensionsTaxesLiving costsReader questionsDriving licences Citizenship Visas Pensions Taxes Living costs Reader questions Driving licences Citizenship Visas Pensions Taxes Living costs Reader questions Driving licences Discover SpainMoving to SpainLiving in SpainSpain explainedDiscover SpainSpanish Food and DrinkSpanish traditionsSpanish habits Moving to Spain Living in Spain Spain explained Discover Spain Spanish Food and Drink Spanish traditions Spanish habits Moving to Spain Living in Spain Spain explained Discover Spain Spanish Food and Drink Spanish traditions Spanish habits LanguageLanguage LessonsLearning SpanishSpanish Word of the day Language Lessons Learning Spanish Spanish Word of the day Language Lessons Learning Spanish Spanish Word of the day HomesPropertyRentingProperty SalesFind rentals Property Renting Property Sales Find rentals Property Renting Property Sales Find rentals JobsWorking in SpainFind jobs in Spain Working in Spain Find jobs in Spain Working in Spain Find jobs in Spain spainAll EditionsAustriaDenmarkFranceGermanyItalyNorwaySpainSwedenSwitzerland All Editions Austria Denmark France Germany Italy Norway Spain Sweden Switzerland All Editions Austria Denmark France Germany Italy Norway Spain Sweden Switzerland Become a member Newsletters Help Centre Gift Vouchers Educational Access Corporate Access About Us Contact Us News Archive Search articles All topics Advertise with us Post a job ad The Local Europe ABVästmannagatan 43113 25 StockholmSweden **Who exactly would have to pay Spain's 100 percent property tax?** 3 comments Recent news that Spain's government is pushing ahead with plans to impose a 100 percent tax on some foreign property buyers has worried many with plans to move to Spain or buy a second home here. So which foreigners exactly would be affected by this? In late May, Spain’s ruling Socialistsconfirmed their plans to introduce a 100 percent property taxon home buyers from overseas as a means of addressing the country’s housing crisis. The measure was initially suggested by Prime Minister Pedro Sánchez in January, but what many believed was just political posturing at the time seems to be closer to reality now that the PSOE government has officially registered the proposal in the Spanish Congress (it will still require parliamentary approval). **Advertisement** When it was first announced at the start of the year, nobody knew exactly how this 100 percent tax would work as there was no legal text to go on. Now that the proposal is in writing and available for all to see, we’ve been able to confirm that the 100 percent would be applied to the taxable base of the property (the value of the property) and is not a 100 percent tax on the existing property tax on second homes (ITP) as many wrongly assumed. FACT CHECK:Yes, Spain's proposed 100% tax doubles property price The same doubts have arisen when it comes to who exactly would have to pay the tax. Is it just non-EU foreigners who don’t reside in Spain? How about third-country nationals who live in another EU country? What about EU nationals who don't live in the EU? Now we know exactly who would have to pay this tax. The ruling Socialists’ proposal reads: “The State Complementary Tax on the Transfer of Real Estate to Non-Residents of the European Union is created.” “This indirect tax will be levied on the onerous transfer of real estate located in Spanish territory and the creation and transfer of property rights in such assets to individuals and entities not resident in the European Union.” Therefore, EU residency is the deciding factor rather than EU citizenship. As an example, a UK national who is a resident in Germany would be able to avoid the proposed 100 percent tax, but a German national who lives in the UK would have to pay it. In this sense, even Spanish nationals who don’t live in the EU would have to pay the levy if they wanted to buy a home in their own home country. American and British nationals who live in Spain or any other EU nation would be exempt from paying the 100 percent tax, but if they live in either the US or the UK they would have to cough up double the amount to buy a second home in Spain. READ ALSO:Foreigners could avoid Spain's 100% tax by buying new builds **More** **Comments (3)** Join the conversation in our comments section below.Share your own views and experience and if you have a question or suggestion for our journalists then email us atnews@thelocal.es.Please keep comments civil, constructive and on topic – and make sure to read ourterms of usebefore getting involved. Please log inhereto leave a comment. Anonymous2025/06/06 10:09Hi, this would be for new property buyers, not existing homeowners. And it's still a proposal that will need parliamentary approval, nothing confirmed yet. Un saludo, Alex (The Local Spain editor). **See Also** **Advertisement** The Local Europe ABVästmannagatan 43113 25 StockholmSweden By signing up you agree to ourTerms of UseandPrivacy Policy.We will use your email address to send you newsletters as well as information and offers related to your account. 2025 The Local, All Rights Reserved."}