{"id": 2236, "name": "The Poke", "domain": "thepoke.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://www.thepoke.com/2025/06/11/this-american-woman-asking-their-british-friend-when-its-okay-to-start-drinking-is-fabulously-done-and-so-on-the-money-it-hurts/", "title": "This American Woman Asking Their British Friend When Its Okay To Start Drinking Is Fabulously Done And So On The Money It Hurts", "content": "News Politics Celebrity Life Videos Entertainment Sport Animals Science US USBritsdrinking **This American woman asking their ‘British friend’ when it’s okay to start drinking is fabulously done and so on the money it hurts** Poke Staff. Updated June 11th, 2025 No-one nails British culture from an outsider’s perspective better than@yorkshirepeachover on TikTok. Lisa Dollan is an American, from Georgia, living in Yorkshire with her family and she went wildly viral in 2021 with her video of things that are common in the UK but just wouldn’t work in the US. And now she’s gone and done it again with this fabulous video of an American asking their ‘British friend’ when it’s okay to have a drink. And it’s very funny and totally –totally– spot on. We’ll drink to that. And here are just a few of the things people were saying about it over on TikTok. Follow@yorkshirepeachon TikTok here! READ MORE This American on why he can’t live in Blighty fabulously nails the transatlantic cultural divide in 20 seconds flat Source TikTok@yorkshirepeach **Trending** A Maga trolled the ‘peaceful left’ for being nothing of the sort and was schooled into next year Trump threatens ‘very big force’ against anyone who protests at his $45 million birthday parade, and the First Amendment has entered the chat Donald Trump is basically grooming the military now and these troops appear to be disturbingly up for it Donald Trump appeared to think the US fought Japan in WW1 and was fact-checked to the moon and back ‘What’s something a toxic coworker did that made the whole office go silent?’ – 17 times colleagues crossed the line **Latest** How women wore (and applied) make up in the ’90s – A comprehensive guide People shared the most successful and enduring lies ever told and these 17 whoppers have all stood the test of time People have been sharing ‘instinctive things’ from 15 years ago that would bamboozle today’s youngsters – 17 early Noughties relics 17 times panoramic photos went spectacularly wrong – or right This American on why he can’t live in Blighty fabulously nails the transatlantic cultural divide in 20 seconds flat What’s a ‘waste of money purchase’ that you absolutely stand by? – 17 zero-regrets expenses News Politics Celebrity Life Videos Entertainment Sport Animals Science US ©2025 The Poke. All rights reserved.Operated by Digitalbox Publishing Ltd.Digitalbox Publishing Ltd. Co Reg No. 09909897T&C's|Cookie Policy|Privacy Policy|Consent Settings|Copyright Notice|Editorial Policies & Contact Information|Meet the Team"}