{"id": 594, "name": "Giffords Law Center to Prevent Gun Violence", "domain": "giffords.org", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://giffords.org/lawcenter/report/partnering-for-peace-the-vital-role-of-coalitions-in-the-movement-to-end-community-violence/", "title": "Partnering For Peace The Vital Role Of Coalitions In The Movement To End Community Violence", "content": "**The Issue** Gun violence is a complex problem that must be met with a range of solutions. We’re fighting every day for the laws, policies, and programs proven to save lives and bring an end to this uniquely American epidemic. **Gun Laws** Giffords Law Center works in all 50 states to change policies and challenge injustice. We won’t rest until every state has strong gun safety laws and every community is free from the fear of gun violence. **Intervention** Gun violence brings heartbreak to far too many communities. Giffords Center for Violence Intervention champions the strategies and organizations that break cycles of violence. **Resources** Giffords seeks to arm activists, legislators, and the general public with the facts about our country’s gun violence epidemic and the most effective ways to address it. **Take Action** We can’t beat our country’s gun violence epidemic if we don’t work together. This fight requires our time and energy, our voices and our votes. Don’t sit this one out—join us. **About** Giffords is an organization dedicated to saving lives from gun violence. Led by former Congresswoman Gabrielle Giffords, we inspire the courage of people from all walks of life to make America safer. Report **Partnering for Peace** **The Vital Role of Coalitions in the Movement to End Community Violence** Kim Gutierrez Mike McLively May 29, 2025 “Power concedes nothing without a demand. It never did and it never will.”—Frederick Douglass **Introduction: Coalitions Are a Powerful Force for Social Change** In the history of great social movements, it is coalitions—groups of people and organizations working together toward a common cause—that make the most significant impact. An individual organization can only do so much by itself, but when organizations combine forces to push in the same direction, it becomes possible to move mountains. As a report on coalitions by the Climate Advocacy Lab describes, “Research confirms that for many major policy changes, it is the work of coalitions that explains whether or not change endures.”1 In other words, coalitions can be societal game-changers. **The Inspiring Success of the Movement to End Domestic Violence** In the US, one of the great policy success stories is the change in national attitudes and laws regarding domestic and sexual violence, and the corresponding reduction in both forms of violence over the last few decades. As recently as 1978, very few domestic violence programs existed in this country. Only one or two states had an organized coalition to address an issue that was broadly considered to be a “private matter,” rather than a societal crisis.2 **Executive Summary: The Vital Role of Coalitions in the Movement to End Community Violence** Despite the fact that millions of people—mostly women and children—were being harmed in their homes every single year, the issue “remained largely unrecognized and virtually ignored in the legal, medical, and social spheres.”3America was mostly in denial about what became labeled the “silent epidemic.”4 As Susan Schechter recalled inWomen and Male Violence, her book on the evolution of the domestic violence movement, “battered women truly had nowhere to go. Shelters were almost nonexistent, and medical, social service, and law enforcement agencies rarely provided battered women with the kind of support they needed… leading many women to conclude: ‘No one wants to get involved.’”5 However, in the middle of the 1970s, a group of grassroots women’s rights activists and survivors of violence came together to create the Battered Women’s Movement in order to bring the issue of domestic violence to the forefront of society, help shelter and support those impacted by it, and demand change.6In the ensuing years, domestic violence coalitions organized and proliferated, engaging in countless efforts to raise awareness of this issue at the local, state, and national level. As an example, one such coalition in Illinois “spoke to hundreds of community groups and professional agencies about battered women’s stories, explained the significance of violence, detailed how violence becomes sanctioned, dispelled common myths, and challenged community members to provide funding and other support to assist abused women. The coalition mobilized around passage of a state law to protect women and require police training on domestic violence, among other accomplishments.”7 Source Susan B. Sorenson and Rebecca A. Schut, “Nonfatal Gun Use in Intimate Partner Violence: A Systematic Review of the Literature,”Trauma, Violence, & Abuse19, no. 4 (2018): 431–442. Susan B. Sorenson and Rebecca A. Schut, “Nonfatal Gun Use in Intimate Partner Violence: A Systematic Review of the Literature,”Trauma, Violence, & Abuse19, no. 4 (2018): 431–442. Susan B. Sorenson and Rebecca A. Schut, “Nonfatal Gun Use in Intimate Partner Violence: A Systematic Review of the Literature,”Trauma, Violence, & Abuse19, no. 4 (2018): 431–442. Domestic violence coalitions around the country engaged in similar efforts, leveraging new national coalitions such as the National Network to End Domestic Violence to discuss challenges and share best practices with one another across state lines.8 By the early 1990s, this movement had enough collective power and influence to successfully push the federal government to pass the landmark Violence Against Women Act (VAWA),9which celebrated its 30th anniversary in the fall of 2024. VAWA brought unprecedented federal resources to bear on the issue of domestic violence, including direct support for statewide domestic violence coalitions, and also helped establish anti-violence infrastructure and expertise in both the Department of Health and Human Services’s Office of Family Violence Prevention and Services, as well as the Department of Justice’s Office of Violence Against Women. This cultural and political shift brought about tremendous positive change and measurable results:“Annual rates of domestic violence dropped by 67% between 1993 and 2022. Rapes and sexual assaults declined by 56%. The National Domestic Violence Hotline, which was created by VAWA in 1996, has received more than 7 million calls.”10 For both outside observers and members of the domestic violence movement, it was coalitions that played a uniquely important role in bringing about this change. “Coalition purposes are multiple, and their structures and accomplishments diverse,” Schechter wrote, “But their importance to the movement as a whole has been immeasurable.”5 **MEDIAREQUESTS** Our experts can speak to the full spectrum of gun violence prevention issues. Have a question? Email us at media@giffords.org. **The Community Violence Intervention Movement and the Rise of CVI Coalitions** “Community violence” refers to acts of violence that occur between individuals outside the context of an intimate relationship and most often in public places. Thus, community violence is very much related to domestic violence, and yet distinct—with a unique set of causes and solutions. Community violence intervention (CVI) refers to a set of non-punitive, community-led strategies that are designed to interrupt the transmission of this violence by engaging those at highest risk through the provision of individually tailored and culturally responsive support services.11 **What Is Community Violence Intervention?** All too often, community violence—and some of its most successful solutions—fail to factor into the policy debate about public safety. At their core, CVI approaches are built around the idea that in any given community, it is actually a very small number of high-risk individuals that drive the majority of homicides and shootings, and that by identifying and effectively intervening with this population, huge strides in public safety are possible. Unlike law enforcement approaches to public safety, which are reactive and punitive in nature (generally, a law enforcement response is only activated after a crime has occurred), CVI is proactive and service-oriented, leveraging skilled community members and trained service providers to prevent acts of violence before they occur by directly addressing an individual’s risk factors, from housing insecurity to unemployment to addressing underlying trauma. CVI work can take place across the community, from hospitals to jails to schools and more. In the last few years, there’s been an effort to organize CVI coalitions similar to those established in the domestic violence field, as described above.In many ways, the movement to end community violence is in a similar position as the domestic violence movement was in the 1980s, with a number of important wins under its belt and growing organizational power, but with much still left to do when it comes to building infrastructure, influence, and recognition. As of the publication of this report, there were at least a dozen statewide CVI coalitions in existence—compared to none just a few short years ago—and at least one national CVI coalition, Invest In Us,12created with the specific goal of reducing community violence through expanding resources for effective public health and community-based violence intervention strategies. The State CVI Coalition Alliance (SCCA), launched in 2024 with the express purpose of fostering the rise of statewide CVI coalitions through networking, information sharing, policy development, and advocacy. Although relatively new, these coalitions have already notched several important wins. At the national level, Invest In Us and its allies pushed to bring about the federal government’s largest-ever investment in community-based violence intervention and prevention programs in the early 2020s via the American Rescue Plan Act (APRA),13with support from the Biden administration. In addition, the Bipartisan Safer Communities Act (BSCA)—the first major gun violence prevention legislation at the federal level in three decades—included a five-year, $250 million investment in CVI that funded the new Community-Based Violence Intervention and Prevention Initiative (CVIPI).14The BSCA was passed by Congress and signed by President Biden in 2022.15 In 2023, California’s statewide CVI coalition, known as the CalVIP Coalition, succeeded in passing the nation’s first state-level excise tax on the sale of firearms and ammunition, with proceeds funding violence reduction programs. This policy faced tremendous pushback from the gun lobby and hunting interests,16but after more than a decade of defeat, it was the organized effort of the CalVIP Coalition that finally pushed it across the finish line. This was much more than a symbolic victory: The tax is estimated to generate tens of millions of dollars every single year for violence reduction programming, creating a sustainable funding baseline in a field where resources are still too scarce. **California’s Landmark Violence Prevention Legislation Deserves to Become Law** Mike McLively—Sep 14, 2023 The rise and continued growth of local, statewide, and federal CVI coalitions is an important development that should be understood by anyone interested in effectively addressing America’s gun violence epidemic.A large percentage of overall gun violence in the United States—which accounts for tens of thousands of deaths and injuries annually17—is attributable to the day-to-day shootings that CVI solutions are specifically designed to interrupt. Against this backdrop, CVI coalitions have proven capable of advocating for critical policy wins and building out the connective tissue between disparate stakeholders in the growing movement to expand community-based public safety strategies. As with the more established domestic violence movement, coalition building has already shown itself to be of immeasurable value to the emerging CVI movement. There are now certified domestic violence coalitions in all 56 states and territories of the US,18which is a remarkable achievement. It will take intentional policies, as well as both public and private support, for CVI coalitions to reach their full potential—just as it did with domestic violence coalitions. That’s why GIFFORDS Center for Violence Intervention is exploring all aspects of CVI coalition work at the local, state, and federal levels, from supportive policy to the nuts-and-bolts best practices of starting and running such coalitions. Our vision is for America to have robust and thriving CVI coalitions in all the jurisdictions where community violence is an ongoing threat to public safety. **Donald Trump Cut Hundreds of Millions of Dollars for Public Safety. It Will Cost Lives.** Sabine Bredesen—May 07, 2025 While we believe that support for CVI strategies—which have literally nothing to do with regulating firearms—can and should receive consistent bipartisan support on the basis of their efficacy alone, we also recognize that the Trump administration’s Department of Justice recently cut hundreds of millions of dollars in federal grants for public safety. These cuts include the termination of dozens of active Community Based Violence Intervention and Prevention Initiative (CVIPI) grants, representing more than $150 million in support for the CVI field.19 The Trump administration does not appear to believe in a role for community-based public safety, which is a grave threat to the nationwide homicide reductions achieved in the second half of the Biden administration. Given these cuts, our federal recommendations are intended as longer-term, normative goals, while those pertaining to state, local, and private actors can and should be pursued immediately. The remainder of this report reviews the current state of CVI coalitions, examines policies that supported the successful expansion of domestic violence coalitions, and makes the case that public and private support for the growth of CVI coalitions is critical in the overall fight against gun violence in the US. By encouraging CVI coalitions to develop and thrive, policymakers in both parties and at all levels of government, as well as private funders, can help save lives from community violence—just as we’ve seen in the domestic violence space. **CVI Coalitions: What They Are and Why They Matter** GIFFORDS Center for Violence Intervention defines a “state CVI coalition” as a group of organizations and individuals working together to build community, share best practices, and advance policies at the state level, with the goal of expanding resources and support for the effective implementation of local CVI strategies. As with other social movements, state CVI coalitions largely emerged organically in the mid-to-late 2010s in response to a commonly perceived need: the lack of funding for CVI work and the absence of meaningful coordination between groups working on various aspects of community violence.20 The origin and growth of California’s state CVI coalition, known as the CalVIP Coalition, is a helpful case study of both the basic characteristics of state CVI coalitions and their tremendous potential for impact. **A State CVI Coalition Case Study: The CalVIP Coalition** **California Has Built a Lifesaving Gun Safety Model for the Nation** Nov 17, 2023 The CalVIP Coalition, named after California’s flagship CVI grant program, the California Violence Intervention and Prevention (CalVIP) Grant Program,21originated on an organic, ad hoc basis, and then grew exponentially as members quickly realized their collective potential for bringing about meaningful change. In 2017, GIFFORDS conducted a nationwide research project in order to assess and document levels of public support for CVI strategies. The data showed that only a small number of states were investing directly in CVI work, including Connecticut, Massachusetts, and New York, all of which had homicide rates below the national average.20 To the surprise of many, California’s only investment in community-based violence intervention came from a tiny program known as the California Gang Reduction Intervention and Prevention program (CalGRIP), a gang-reduction initiative started by the Schwarzenegger administration in 2007. Despite CalGRIP’s strong preference for law enforcement approaches, the program was still funding some notable community-based public safety projects—namely, CVI efforts in Los Angeles, Oakland, and Richmond. In 2017, at the conclusion of the research project and as GIFFORDS employees were beginning to build relationships with some of CalGRIP’s funded entities—such as the Richmond Office of Neighborhood Safety—then Governor Jerry Brown announced the program’s funding would be eliminated entirely. This created a unique opportunity for collective advocacy. “We called around to the small number of partners we knew at the time who were doing this kind of work and asked them what they thought about trying to organize to save CalGRIP in some way,” said Ari Freilich, who helped launch this initiative as a staff attorney for GIFFORDS Law Center and is now the director of California’s first Office of Gun Violence Prevention. “The consensus response was, ‘Absolutely, we’ll work with you to save CalGRIP, but only if we can also push the program in a new direction, with an emphasis on community-based approaches.’ Everyone agreed this was a great idea and we rolled up our sleeves and got to work.”22 With that, a small group of individuals from five organizations around California, along with GIFFORDS and our contracted California lobbyists, made the case to the California legislature for both preserving and redirecting CalGRIP funds. As a report by the California Partnership for Safe Communities details, “Early on, their collective influence was sufficient not only to save CalGRIP from elimination but also to see the program’s focus change as it was renamed the California Violence Intervention and Prevention (CalVIP) Grant Program. Even if the grants remained modest—cumulatively only about $9 million annually from the state’s general fund—this marked the first of a number of early victories that strengthened the group, which called itself the CalVIP Coalition.”16 That early victory, which included opening CalVIP grants up to community-based organizations for the very first time—with an emphasis on services for high-risk individuals—built trust and relationships between the small group of advocates. It also emphasized the need to remain connected and organized for years to come, in order to push for an increasingly ambitious agenda to make California a national leader in supporting local CVI work. From 2017 to 2024, the CalVIP Coalition grew in size and influence, putting together an advocacy agenda that included getting CalVIP reforms placed into statute (achieved in 2019 with the passage of AB 1603, the Break the Cycle of Violence Act); significantly increasing overall funding for the program (achieved with a record-setting, three-year investment of $227 million in 2021); opening up Medicaid as a source of reimbursement for services provided by violence prevention professionals; and building relationships with CalVIP’s administering agency so community voices could be part of a feedback loop between the agency providing the funds and the groups doing the work on the ground. **Champions for Peace: A Conversation with Kenneth Andrews Jr.** Mar 22, 2024 The coalition also hosted press conferences to highlight CalVIP-funded work, convenings to share lessons learned, and meetings at the district offices of legislators, where frontline workers could directly explain the importance and impact of their work. More awareness of the lifesaving work being supported by CalVIP and increased funding made it easier to attract new membership. By 2021, the CalVIP Coalition had more than 80 organizational members and, in looking for a way to create long-term sustainable funding, the coalition “launched a specialized working group (the CalVIP Policy Committee) charged with diving deep into the financing question and developing recommendations for pursuing a permanent, more reliable funding source.”16 This process led the coalition to undertake an ambitious effort: the pursuit of the nation’s first state-level excise tax on the sale of firearms and ammunition, with revenues directed to violence prevention programs like CalVIP.The CalVIP Coalition was the force leading the charge in crafting this legislation and implementing the strategy to advocate for this bill’s successful passage. The bill, known as AB 28, was authored and championed by Assemblymember Jesse Gabriel. Over a period of months in 2023, coalition members wrote letters, made phone calls, and filled legislative hearing rooms to the brim with supporters for AB 28. In the words of Julius Thibodeaux, leader of the CVI organization Movement 4 Life in Sacramento, “Through the partnership with Moms Demand Action and GIFFORDS we learned how to tune our message to legislators. This is critical for small organizations because this is a language we don’t typically use but is necessary for the advocacy work. You need both a bird’s eye view and a boots-on-the-ground view to achieve these public safety goals.”16 This effort culminated in a dramatic vote on the Senate floor in September 2023, with AB 28 passing by a single vote, which came from a senator in a conservative-leaning district who stood in the chamber and dedicated her vote to two young people who had lost their lives in a shooting in her district. “I am a firm supporter of our Second Amendment, but this is a little different. AB 28 is something that California needs, it’s something that my Senate District needs,” said Senator Melissa Hurtado, standing to cast her decisive vote. “This is not an attack on guns…this is a bill that is going to address an issue that is out there and really when it comes to our children, we need to be doing everything we can to protect them.”23 As the authors of the California Partnership for Safe Communities report wrote, “Earning that vote took a disciplined and strategic approach that combined the efforts of every practitioner, every community advocate and violence prevention expert, all of the local public officials who had been involved in successful gun violence reduction work, and all of the statewide education and awareness raising over several years, as well as the work of many determined lobbyists.”23 This kind of coordination, and a policy win of this magnitude, could only have taken place within the context of a coalition, which created the platform to combine all of these disparate actors in a single and powerful voice. As it stands today, the CalVIP Coalition has dozens of organizational members and hundreds of individual members. The coalition is led by a diverse steering committee and monthly coalition meetings are hosted by a rotating roster of facilitators, helping to create shared ownership over meetings. Decision-making has always been by consensus and the coalition is increasingly relying on affinity committees to help move different bodies of work forward. The CalVIP Coalition continues to operate on a volunteer basis and does not exist as a formal 501(c)(3) or any other form of legal entity, although that is an ongoing point of strategic consideration among members. The CalVIP Coalition clearly demonstrates the role that state CVI coalitions can play when it comes to building the power of the community-based public safety movement and creating a policy environment that is supportive of the growth and development of CVI strategies in impacted communities. **National Forces Spur State CVI Coalition Growth** California was likely the first such statewide CVI coalition, but others quickly followed and a number of national events helped to catalyze that growth. The combination of the US grappling with the effects of the COVID-19 pandemic, including devastating spikes in homicide levels across the country, and the reckoning of social justice activism responding to police brutality with the murder of George Floyd in 2020, are both factors that contributed to the nationwide spotlight to alternative approaches to violence intervention and prevention. In addition, in 2021 the federal government passed a legislative package called the American Rescue Plan Act (ARPA), which focused on providing investments in prevention and relief to states and local governments from the detrimental impacts of COVID-19. Upon the release of the ARPA funds, the Biden administration also released guidance to local and state municipalities on how they should designate and implement these funds. Included in this guidance was a clear call to local and state municipalities to use ARPA funds for improving gun violence prevention and intervention efforts.24 State CVI coalitions began to proliferate in part as the result of these historic investments. Between 2019 and 2024, state CVI coalitions took form in Connecticut, Louisiana, Maryland, Massachusetts, Minnesota, New Jersey, New Mexico, New York, North Carolina, Oregon, Texas, and Wisconsin, among other states. These coalitions feature CVI practitioners, state-based gun violence prevention organizations, national gun violence prevention organizations, state government agencies, local government agencies, healthcare workers, law enforcement, and academic researchers. There are several core goals and functions of CVI coalitions that are shared across these states, including the following: AccountabilityMany state CVI coalitions formed to provide an accountability mechanism to state legislators and governmental agencies regarding how to best implement their investments to community violence intervention programs. Coalitions have worked to ensure that the voices of impacted communities are reflected in government-level decisions, and that investments are reaching the grassroots organizations and individuals doing the work on the ground. AdvocacyMost, if not all, state CVI coalitions were formed to amplify the need for states and cities to robustly invest in CVI strategies and to address a lack of funding in this particular area. In addition, this advocacy agenda has generally included policies to help facilitate the effective implementation of these investments, including through the creation of offices of violence prevention at the state and local levels, the elimination of the longstanding match requirement for CalVIP, and reforms allowing community-based organizations and tribal entities to apply directly for violence intervention funding. Community BuildingState CVI coalitions are a platform for the creation of a beloved community25and a place for individuals doing difficult and emotionally challenging work to find camaraderie, solidarity, and healing. EducationState CVI coalitions engage their community members, legislators, and the public at large on what CVI strategies are and how these strategies function in their cities, often serving as a bridge for frontline workers to speak directly with policymakers about the importance and impact of their work. Since their inception, many state CVI coalitions have been credited with achieving historic state investments and other policy wins:26 California appropriated $227 million for CalVIP in the California 2021 budget27and amended the MediCal reimbursement for violence intervention professionals in 2022.28 The Wisconsin CVI coalition successfully advocated for Governor Evers to enact a statewide office of violence prevention.29 In Maryland, the state CVI coalition successfully advocated for $8 million in CVI funding and the establishment of the Center for Firearm Violence Prevention and Intervention.30 New Jersey allocated $10 million in American Rescue Plan Act funds to support hospital-based violence intervention programs in the state and passed the Seabrooks-Washington Community Crisis Response Act, which leverages trauma-informed community crisis response teams to support individuals experiencing mental health crises.31 Virginia invested an all-time high of more than $72 million for CVI in 2023, with support from Republican Governor Glen Youngkin. It also created the Office of Safer Communities and Youth Services.32 In 2023, North Carolina created its first-ever Office of Gun Violence Prevention and invested in the expansion of hospital-based violence intervention programs.33 Policy advocacy happens at the local, state, and national levels, and several years ago a national coalition was created to focus on federal CVI policy: the Invest in Us coalition. In 2020, as a response to the momentum of community violence intervention and the need to grow investments to these programs, the organization Community Justice formed the Invest In Us coalition. Community Justice is a policy and advocacy organization focused on ending gun violence in Black and Brown communities by empowering those closest to the pain to build political power, amplify their voices, change the narrative, and advocate for policy change.34The Invest in Us coalition regularly convenes national, state, and local organizations committed to building support to fund evidence-informed community solutions to gun violence and to educate leaders and the general public about proactive solutions to make our communities safer. A focal policy of this coalition is securing a $5 billion federal investment in CVI and passing theBreak the Cycle of Violence Actthrough the House of Representatives in 2022.35 Since its inception, Invest in Us convened groups across social justice causes with a shared commitment to ensure the federal government was forging pathways to support community violence intervention work.The Invest In Us coalition leads efforts to educate and involve the CVI field and allied organizations in the federal appropriations process each year, including circulating organizational sign-on letters with specific CVI-related asks for appropriations legislation, recruiting congressional staff to share updates and guidance about federal appropriations during monthly meetings, and working closely with members of Congress to broaden support for CVI work. Invest in Us directly engaged the White House and members of Congress to expand federal grants to be inclusive of CVI programs, and advocated for President Biden to incorporate funding for CVI programs into his budget. Following these advocacy efforts, President Biden released guidance instructing localities to invest ARPA funds in violence intervention and prevention programs leading five federal agencies to alter 26 grant programs to incorporate CVI in their criteria.36A majority of the Invest in Us coalition’s federal advocacy efforts were led by former Executive Director of Community Justice Greg Jackson. In September 2023, the Biden administration established the first-ever White House Office of Gun Violence Prevention with Jackson and Rob Wilcox as its deputy directors.37 Local and regional CVI coalitions also have an important role to play when it comes to breaking down silos between organizations and amplifying the impact of local advocacy efforts. An example of this is the Los Angeles Violence Intervention Coalition (LAVIC), which represents Black and Brown-led organizations that support the most violence-impacted communities in Los Angeles. LAVIC is a coalition made up of local organizations that provide community violence intervention and prevention services.While Los Angeles has had different iterations of CVI coalitions over the years, LAVIC, convened by the Urban Peace Institute, came together a few weeks prior to the pandemic. For the first time, the Urban Peace Institute had gathered leaders of local community-based organizations providing frontline CVI services across the city together for in-person fellowship. **How Counties Can Help Stop Community Violence** Mike McLively—Jun 06, 2024 Fernando Rejon, executive director of the Urban Peace Institute, reflects, “We broke bread and we had people that hadn’t been in the same room for a long time, together in the same room and we knew immediately that we needed to move on this.”38 After Los Angeles faced shelter-in-place mandates as a result of the COVID-19 pandemic, the Urban Peace Institute continued to convene this group virtually. Initially, these meetings were focused on CVI practitioners offering moral support to one another and assessing their urgent needs—for example, when it became clear that personal protective equipment was necessary for CVI work, this group found a nail salon through their connections that would ship them the gear, where it was distributed to violence intervention groups across Los Angeles. The group continued to convene and form an agenda to advocate for funding in order to help CVI groups during the surge in gun violence in 2020 and 2021. In October 2022, Urban Peace Institute and the LAVIC coalition published the LA Peace Plan representing the group’s 10 year vision for comprehensive safety throughout the city.39This plan included policy recommendations in four key areas: public leadership, community violence intervention, law enforcement, and partnerships and collaboration. The LAVIC engaged county and city representatives in the drafting and promoting of the public safety framework embedded in the LA Peace Plan. As a testament to the collective power built by the coalition and the momentum of the LA Peace Plan, once Karen Bass won the mayoral election, she enacted three major policy priorities included in the plan: Mayor Bass designated a Los Angeles Office of Community Safety, hired a deputy mayor of community safety, and increased the wage of CVI workers from $40,000 to $60,000.40This also led to the establishment of the LA Peacemakers Initiative, which funds 18 frontline CVI organizations utilizing $7.4 million in federal earmarks and $4 million in private dollars over a two-year period to strengthen Los Angeles’s community safety infrastructure.41 As this section has described, the rise of CVI coalitions is an important development in the broader movement to address community violence. So far, these coalitions have developed organically, with little to no formal support or direct resources from public or private sources. The next section of this report looks at how public policy in the US has intentionally fostered the development of domestic violence coalitions, which provides a roadmap for policymakers to provide similar support to CVI coalitions in the years to come. **Lessons Learned from Coalition Building in the Domestic Violence Movement** In just a few decades, America went from a nation where domestic violence was considered a “private issue,” with a small handful of scattered shelters for women, to one where every state and the federal government has invested billions of dollars to support a host of solutions to combat this issue. **Domestic Violence** The combination of intimate partner violence and access to guns is an especially deadly mix. Domestic violence (DV) and sexual assault (SA) coalitions played a pivotal role in this cultural and political shift, and in the 1990s, it became the formal policy of the federal government to fund statewide DV and SA coalitions. In the early days of the domestic violence movement, as one activist describes, “we had no real data to understand it, and felt that creating a coalition of people who cared about it and wanted to reduce the violence in our communities was our best strategy.”5In those initial years of development, coalitions were informal spaces of relationships between (mostly) women committed to a common cause. One of their primary functions was to provide a space for connection and the sense of doing incredibly demanding and draining work within a connected and supportive community instead of in isolation. One woman who was a participant in the Pennsylvania Coalition Against Domestic Violence (PCADV) in the late 1970s described her experience this way: “It was an amazing emotional release to hear we weren’t working in a vacuum. We spent hours just listening to each other. We all stayed in each other’s homes; this was key, people had no money. We would drive through snowstorms. We wanted to stop violence against women. We formed committees; we worked hard. Magic was created.”5 Early statewide domestic violence coalitions usually had two primary goals: 1) giving intimate partner violence workers, advocates, and survivors across the state a platform for relationship-building and problem-solving, and 2) pushing for a shared policy agenda. For example, PCADV’s early goal was the successful implementation of the Pennsylvania Protection from Abuse Act. Emerging coalitions around the country took on tasks like “gathering information about existing services, assisting communities that were seeking ways to start non-profits to provide services, identifying allied agencies and organizations that would be good partners and then tasking those people with improving and enhancing services and outcomes for those in danger.”2 All of these activities—many of which have direct parallels with the movement to address community violence—were designed to improve the services available to victims and survivors by identifying gaps and then taking active steps to fill them through a combination of new relationships, new policies, and new resources. Initially, this coalition building work was done with little to no public support. “In the first decade, few state coalitions had funding, so they charged a membership fee to allow the coalition to have the resources needed to build and expand the network of services.”2Some coalitions were formally incorporated as 501(c)(3) nonprofit organizations in order to receive tax-deductible donations from private sources, which also brought along the benefit of additional infrastructure and organizational capacity. **STAYCONNECTED** Interventions are most effective when they are supported by strong community networks. Sign up for Giffords Center for Violence Intervention’s newsletter to learn more about what’s happening in the field, relevant legislation, and funding opportunities. **Join our Team Today!** **Financial Support for Domestic Violence Coalitions** As coalitions continued their vital work, however, more and more decisionmakers recognized their value and started pushing for direct support, including at the federal level, the state level, and through private funding. Momentum in the movement to address domestic violence reached a new zenith in 1984 when US Attorney General Benjamin Civiletti created the nation’s first Task Force on Family Violence, which issued a landmark report on the scope and impact of domestic violence in the United States.42“Violence in the home strikes at the heart of our society,” the report declared. “To tolerate family violence is to allow the seeds of violence to be sown into the next generation.”43 That report prompted Congress to hold a series of hearings in 1984 about how the federal government could best respond to the crisis of domestic violence. After taking testimony throughout the year from advocates, victims, and many other stakeholders, Congress ultimately enacted the Family Violence Prevention and Services Act (FVPSA).44 **Gun Law Trendwatch: Protecting Domestic Violence Survivors from Gun Violence** Lindsay Nichols—Mar 17, 2025 FVPSA was a huge win for the movement to end intimate partner violence.It created a formal infrastructure for providing services to victims by funding both state governments and local domestic violence programs. The impact of this investment is difficult to overstate—in celebrating the 40th anniversary of FVPSA at the end of 2024, those gathered in attendance in Washington DC noted that the number of domestic violence shelters grew from just over 100 nationwide in the 1970s, to more than 1,500 shelters and 1,300 nonresidential sites in operation as of 2024—a 1,400% increase in the number of shelters. The Office of Family Violence Prevention and Services leads the Department of Health and Human Services’s (HHS’s) domestic violence prevention work,45which includes State Domestic Violence Coalitions Formula Grants.46HHS is responsible for designating domestic violence coalitions in each state and territory.47 At the same time that direct services were expanding, statewide domestic violence coalitions continued to proliferate. When FVPSA was reauthorized in 1992, Congress expressly recognized and invested in the expansion of statewide coalitions as part of its strategy to reduce domestic violence. In its present iteration, FVPSA defines state domestic violence coalitions and provides a funding formula for such coalitions in all 50 states and six territories.48A “state domestic violence coalition” includes the following characteristics: Membership that includes a majority of the domestic violence service providers in the state. A board that is representative of domestic violence service providers (and that may include representatives from communities receiving services). A purpose of providing education, support, and technical assistance to domestic violence service providers to help such providers establish shelters and other supportive services for victims. Serves as an information clearinghouse and resource center on domestic violence for the state and supports the development of policies, protocols, and procedures to enhance domestic violence intervention and prevention in the state.47 The secretary of the Department of Health and Human Services is in charge of awarding funding grants to these coalitions, and FVPSA identifies a nonexhaustive list of activities that state domestic violence coalitions can conduct using these funds, including providing educational information to the public; collaborating with entities in fields like housing, law enforcement, and healthcare to develop protocols and policies to address the needs of domestic violence victims; and providing technical assistance and other forms of support to providers of domestic violence services.49 Of note, these funds cannot be used by state domestic violence coalitions to engage in lobbying activity (actions to influence the outcome of specific legislation). However, there are some critical exceptions, including: 1) when formally requested to do so by a legislative body, or 2) in connection with legislation or appropriations directly affecting the activities of the entity.49This second exception allows coalitions to participate in the policymaking process as it pertains to issues that touch on their broadly-defined functions of improving service delivery to victims of intimate partner violence. In addition to directly funding coalition activities, FVPSA grants also support the provision of shelters and other direct services for victims. These grants require recipients to make a plan for how they will consult with their designated state and tribal domestic violence coalitions in the administration and distribution of FVPSA funds.50This additional incentive helps solidify a central role of state DV coalitions, which are given pass-through grantmaking responsibility in many states. Thanks to this ongoing federal support, in a period of just a few decades, America went from a country with almost no domestic violence coalitions to having certified and federally funded state domestic violence coalitions in all 50 states and six territories.Supporting both services and coalition building was an intentional strategy of the federal government, and one that has yielded tremendous success. In addition to FVPSA, the other major pillar of federal policy is the landmark Violence Against Women Act, which includes direct support for state sexual assault and domestic violence coalitions. Even with the passage of FVPSA in the 1980s, the growing domestic violence movement recognized a need to engage other sectors, including the many mechanisms of the criminal justice system, from the courts to police practices.51With significant effort and sustained advocacy, the movement ultimately persuaded Congress to pass the landmark Violence Against Women Act (VAWA) in 1994, which “included the first federal criminal law against battering and a requirement that every state afford full faith and credit to orders of protection issued anywhere in the United States.”51 Substantively, a key difference between VAWA52and FVPSA is that VAWA is focused on legal protections and the criminal justice aspects of intimate partner violence (e.g., VAWA has provisions regarding rape kits and law enforcement grant programs), while FVPSA primarily offers support to shelters and organizations providing direct servies to victims and survivors. VAWA-authorized grant programs are administered by the Office on Violence Against Women (OVW)within the Department of Justice,53which has awarded more than $6 billion in grants and cooperative agreements to help combat violence against women since its inception in 1995.54 Just as FVPSA provides direct support to statewide DV coalitions, VAWA gives similar support to both domestic violenceandsexual assault coalitions, and gives authority to the Centers for Disease Control and Prevention (CDC) to designate a sexual assault coalition for each state and territory.55In several states, these two different types of coalitions (DV and SA) have merged into a single entity, such as the Michigan Coalition to End Domestic and Sexual Violence.56 To support coalition work, OVW administers the State and Territory Domestic Violence and Sexual Assault Coalitions Program,57which “provides grants to each state domestic violence coalition (determined by the Department of Health and Human Services) and sexual assault coalition (determined by the Centers for Disease Control and Prevention) for the purposes of coordinating victim services activities and collaborating and coordinating with federal, state, and local entities engaged in addressing violence against women.”58 OVW materials describe how coalitions play a critical role in carrying out the goals and mission of VAWA by serving as hubs of coordination that connect local, state, and federal efforts. Historically, these coalition funds, which OVW estimated in 2024 to be more than $18 million for over 80 grantees, have supported activities including technical assistance provision, hiring staff, and identifying and filling gaps in underserved communities.59 In its 2022 biannual report to Congress on the effectiveness of grant programs under the Violence Against Women Act, OVW concluded that coalitions play a number of roles in responding to domestic and sexual violence: “They serve as organizing bodies for local agencies; advocate for policy, legislation, or practice changes; and support collaboration between agencies building community relationships.”60All of these valuable activities help move the field forward and explain the dramatic downward trend in rates of domestic violence in the US over the last few decades. In addition to the primary coalition support grants of FVPSA and VAWA, a variety of other federal funding sources exist that can and have been used to support intimate partner violence coalitions. This includes victim services grants through the Victims of Crime Act (VOCA), discretionary grants from the CDC’s Division of Violence Prevention (especially the DELTA AHEAD program, which is specifically designed to support state-level coalitions),61and discretionary (i.e., awarded on a competitive basis) grants from programs ranging from VAWA’s Engaging Men in Prevention, Rural Grants, and Transitional Housing programs to the VOCA Assistance Grant program that supports the provision of services to survivors of crime.62 In recent years, Congress has also resumed what is known as congressionally directed spending, also called “earmarks,” which are projects individually funded in the jurisdictions of individual members of the House and Senate. New Jersey Senator Cory Booker, for example, put in a request for $700,000 for the New Jersey Coalition to End Domestic Violence to support the Legal Access Project to improve the provision of legal services to survivors.63This is one-time, one-year funding that can be subject to tremendous delays as Congress conducts appropriation negotiations, but is still a viable route for obtaining additional support for coalition efforts. Taken together, federal support for state coalitions from FVPSA, VAWA, and other federal programs demonstrate a strong federal commitment to the idea that healthy coalitions are an essential part of the national strategy to end intimate partner violence. Although federal funds are the single largest source of public funding for state intimate partner violence coalitions, many state governments have directly funded these coalitions as part of a statewide strategy to reduce domestic violence, providing support through grants, programs, and line-item appropriations. In a 2016 national survey, for example, at least 20 state sexual assault coalitions received support directly from state line-items, and 17 reported receiving state funding from various other sources, including victim assistance, criminal justice departments, injury prevention, health departments, training and technical assistance, and state surcharges.62 Just over a quarter of the annual budget for the Delaware Coalition Against Domestic Violence comes directly from the state,64according to its 2024 Annual Impact Report, while Violence Free Minnesota, that state’s domestic violence coalition, lists the Minnesota Department of Health and Department of Public Safety as directly providing support in the form of grants and contracts.65In California, the Office of Emergency Services posted a noncompetitive grant for its designated statewide domestic violence coalition, the CA Partnership to End Domestic Violence, to support the development of a “domestic violence resource center.”66 It is beyond the scope of this report to analyze funding levels in all 50 states, but the key point is that states regularly use line-item appropriations, as well as grants and contracts, to directly support the work of statewide domestic violence coalitions. Even in the best of times, public funding is not a panacea, and it can present significant challenges even as new resources are made available. Federal funding, for example, can be vulnerable to administration changes and subject to serious delays during budget negotiations and the government shutdowns that occur when those negotiations fail. Moreover, public grants are often on a reimbursement basis, which can present a cash flow problem particularly for smaller organizations, and reporting requirements are often onerous.67This is why the CVI movement should seek highly diversified funding streams as it continues to build coalition capacity, including both public and private sources of support. **2025CVI CONFERENCE** Giffords Center for Violence Intervention will host the 2024 Community Violence Intervention Conference in Los Angeles on June 16 & 17. Private support for the intimate partner violence movement in the US, although still far from where it needs to be to meet existing demand, has shifted dramatically upward in recent decades—in many ways mirroring and most likely catalyzed by landmark successes on the public policy front, especially the passage of VAWA at the federal level in the early 1990s. A 2010 report by the Ms. Foundation for Women examined foundation support for gender-based violence issues from 1994 to 2008 and found that “the number of foundations supporting gender-based violence issues increased 143 percent over that time period, while the dollar amount of funding increased three-and-a-half fold,” from $16 million to $80 million.68 This upward trend in private support continued into the 2010s and 2020s. A 2021 report by Inside Philanthropy examined publicly available data and found that, from 2014 to 2018, private funding for abuse prevention and domestic violence shelters averaged $540 million per year.69A 2024 article by Brett J. Barnes, the chief development officer at the National Domestic Violence Hotline, noted that “in 2020, the most recent year for which data is available, family and gender-based violence organizations received just $1.3 billion in philanthropic dollars.”70 While those investments, in absolute terms, are incredible increases from earlier years, it’s also important to consider the broader context: Overall philanthropic giving in the US also increased exponentially during that same period. Indeed, as Barnes points out, the $1.3 billion of family and gender-based organizations in 2020 was “less than 1 percent of the $88.55 billion spent in foundation grantmaking that same year.”71 While the majority of private funds have been for on-the-ground services and shelters for victims, domestic violence coalitions have also received increased direct support from private philanthropy.The 2024 Annual Report of the Delaware Coalition Against Domestic Violence, for example, shows that just under 10% of the coalition’s financial support comes from foundations.69Similarly, the 2023–2024 Annual Report of the California Partnership to End Domestic Violence shows that 10% of the coalition’s budget comes from private grants.72 **Where Funding for Community Violence Intervention Coalitions Stands** As the above sections have shown, DV coalitions have received direct support in recent decades from a combination of public and private sources, which has fueled the successful development of such coalitions in all 50 states and several US territories. It is the express policy of the federal government and many states to support DV coalitions as a way of improving the overall response to domestic violence. In the context of community violence, although a number of coalitions have begun to form in recent years, there are still many gaps in terms of both public and private support. Federally, there is not a policy or program for the development of statewide CVI coalitions. The only example of such federal support the GIFFORDS Center for Violence Intervention team is aware of is a one-year, one-time earmark awarded to the Maryland Violence Prevention Coalition (MDVPC) in 2023.73Similarly, at the state level, we could only identify a single statewide coalition working on CVI issues that receives direct support from its state government. **The Economic Cost of Gun Violence in America** Sophie Yap—May 13, 2025 As for private funding, support for CVI broadly lags behind support for domestic violence, as does direct support for the development of CVI coalitions. An Inside Philanthropy report looking at foundation support for various causes found that, from 2014 to 2018, “total funding for the gun control subcategory within crime prevention was around $127 million, almost half of which came in 2018 on the heels of the Parkland shooting.”74At an annualized rate, that’s just over $25 million per year, compared to $540 million given to gender-based violence issues during that same five-year period. When it comes to community violence specifically, the numbers are even smaller. “While no public data exists that quantifies private investment in CVI specifically,” concluded the authors of the National CVI Action Plan, “suffice it to say that the figure is a small fraction of what these critical social movements received.”75 Private support for CVI that is specific to coalition building efforts is just getting started, with major philanthropies like the Joyce Foundation providing direct support to coalitions in states like Minnesota and Wisconsin, but this is the exception rather than the rule.There is tremendous opportunity to increase private support for the CVI field in general, and specifically for coalitions, which are one of the most effective vehicles for building the power and connectivity of the movement for community-based public safety. **JOINTHE FIGHT** Gun violence costs our nation 40,000 lives each year. We can’t sit back as politicians fail to act tragedy after tragedy. Giffords Law Center brings the fight to save lives to communities, statehouses, and courts across the country—will you stand with us? **Join our Team Today!** **Recommendations** America must better support CVI coalition development as part of a broader strategy for reducing community violence in the US. Analyzing domestic violence coalition growth and support helps identify the gaps and opportunities that exist when it comes to community violence coalitions. There are many steps that leaders in the public and private sectors should take to help facilitate the continued development and expansion of CVI coalitions, as outlined below. **For Policymakers** As this report has discussed in detail, for several decades now, it has been the policy of the federal government to directly fund and support domestic violence and sexual assault coalitions as part of an overall commitment to reducing domestic violence. This is operationalized through language in the Family Violence Prevention and Services Act (FVPSA) and the Violence Against Women Act (VAWA), both of which provide grants directly to federally-certified state DV and SA coalitions. With VAWA, this is done primarily through the State and Territory Domestic Violence and Sexual Assault Coalitions Program, administered by the Department of Justice’s Office on Violence Against Women (OVW). For FYPSA, the main mechanism for this support is through the State Domestic Violence Coalitions Formula Grants, administered by the Department of Health and Human Service’s Office of Family Violence Prevention and Services. In its 2022 biannual report to Congress regarding the efficacy of VAWA grant programs, OVW staff noted the critical role that coalitions play in improving the nation’s overall response to domestic violence. Federal policy reflects a commitment to supporting coalitions, and several grants in this space require applicants to describe how they will coordinate with the state DV and SA coalition that are formally certified by the Department of Health and Human Services. **Opportunities for Innovation in Community Violence Intervention** Jordan Costa,Brittany Nieto,Rigel Robinson—Feb 20, 2025 In recent years the federal government has begun funding violence intervention work at record levels, especially through DOJ’s Community Violence Intervention and Prevention Initiative (CVIPI), but direct support for CVI coalitions is not yet part of federal policy in any meaningful way. The support provided to domestic and sexual violence coalitions through FYPSA and VAWA provide a ready-made roadmap for what this can and should look like at the federal level. Congress should pass legislation that affirms a federal commitment to reducing community violence, including through coalition building, and begin a pilot program to certify and support an initial cohort of state CVI coalitions.One important difference between community violence and domestic violence is that community violence is not necessarily a pressing concern in all 50 states the way domestic violence is. As such, a formula grant that funds CVI coalitions in all 50 states and territories does not make sense, nor is it advisable. Instead, eligible jurisdictions should be determined based on levels and rates of homicide and aggravated assault, and/or self-selected through an application process. Nothing in federal law prevents DOJ leadership from incorporating this support for coalitions into the discretionary funding available through CVIPI, although additional direction and support from Congress would help solidify this policy and demonstrate bipartisan support for the role of community-based solutions and the importance of coalition building when it comes to improving public safety. Future CVIPI grants should also include language encouraging or otherwise incentivizing recipients to collaborate with CVI coalitions in their jurisdiction. At the state level, there is also need for states to fund community violence coalitions with line-item appropriations in the same way that many are already funding domestic violence and sexual assault coalitions.In states where CVI coalitions already exist, legislative leaders should consult with coalition members to determine their needs. In states where no such coalition exists, states should provide seed funding to help foster coalition development in the first instance. Finally, state and federal leaders can take steps to incentivize private investment in the community violence movement and CVI coalitions.In 2021, the Biden administration, building on historic federal investments in CVI, partnered with more than a dozen national philanthropies to support a network of 14 cities around the county to reduce violence “by deploying CVI experts to provide training and technical assistance, identify best practices, integrate proven and innovative public-health approaches, and help local community-based organizations scale CVI efforts this summer and beyond.”76Among this group of private funders were philanthropic organizations like Arnold Ventures, the California Endowment, and Annie E. Casey Foundation, as well as corporate entities like Microsoft. Recent results from that group of cities receiving a combination of federally-induced private/public support includes the following: Baltimore:In 2024, the city saw a 23% decrease in homicides on top of the 20% drop in homicides from 2023. Additionally, nonfatal shootings declined 34%, and juvenile victims of homicides and nonfatal shootings dropped 74%.77 Detroit:Detroit ended 2024 with 203 criminal homicides, 19% lower than the previous year’s 57-year low and down 33% since 2022.78 Newark:Homicides dropped in 2023 and 2024 to levels not seen since the 1940s.79 Philadelphia:The city saw its lowest homicide level in a decade in 2024.80 St. Louis:In 2024, St. Louis had its lowest number of homicides in 11 years.81 By making support for CVI coalitions a specific and intentional policy to help reduce levels of homicides and shootings, American policymakers at all levels of government can help improve public safety and incentivize further support from the private sector on this issue, which is discussed in the next recommendation. **For Philanthropies and Corporations** The recommendation for private funders is simple: Invest more in CVI as part of a broader strategy to improve the health of American communities. As discussed in detail in this report, in most parts of the country, private funding for community-based solutions to violence lag far behind what is necessary to see transformational gains to public safety. In some cases, private donors may be hesitant because of the political nature of the national gun violence debate, butCVI strategies offer a safe haven: They in no way involve the regulation of guns and completely bypass the politically charged and polemic Second Amendment debate. For funders new to this issue, theNational CVI Action Planwas written with input from dozens of CVI organizations around the country and with the funding community as a primary audience. It provides an excellent starting place to understand the state of the CVI field and areas where investments are likely to have the greatest impact.75Another helpful starting point is Inside Philanthropy’s 2024 reportThe State of American Philanthropy: Giving for Violence Prevention.69Given the importance of safety to the thriving of local economies and the ability to attract new businesses, this is an investment that should be attractive to business leaders around the country. CVI strategies give private funders a unique way to take an effective stand on this issue. A few recent developments show how private philanthropy may engage more deeply and effectively when it comes to addressing community violence. In Chicago, the philanthropic community organized itself in 2016 with a mission to work collectively “to identify and support community-led, evidence-based solutions that the public sector can scale as part of a comprehensive approach to addressing gun violence.”82That effort, known as the Partnership for Safe and Peaceful Communities (PSPC), has grown to include more than 50 foundations and funders, and has committed more than $140 million over a seven-year period (2017 to 2024) to reduce gun violence in Chicago.82An important feature of this investment is the long-term nature of the commitment, which has gained momentum and scope over time. The business community of Chicago has also organized itself around a similar set of goals. The leaders of the Civic Committee of the Commercial Club of Chicago, whose members include the city’s largest companies, launched the Public Safety Task Force in October 2022. This group worked with consultants over an 18-month period to develop a comprehensive and ambitious strategy for significantly reducing homicides and shootings in Chicago over the next 10 years, with a $400 million fundraising goal. The pillars of this strategy include investment and direct hiring opportunities in the hardest-hit neighborhoods, as well as improving law enforcement infrastructure, with an emphasis on community policing.83Another pillar is providing support to the Scaling Community Violence Intervention for a Safer Chicago (SC2) initiative, an effort to scale CVI programming in Chicago’s most impacted neighborhoods with a specific, five-year goal of serving at least half of the estimated 20,000 Chicagoans at highest risk of shooting or being shot. SC2 represents an innovative consensus between CVI practitioners, the business community, philanthropy, and government around the idea that reaching a critical number of the highest risk individuals in key neighborhoods is a shared strategy worthy of collective investment and support. In a statement regarding the launch of SC2, Vaughn Bryant, the executive director of the Metropolitan Peace Initiative (MPI), which trains and supports CVI groups in Chicago, said, “This kind of alignment across all sectors, and among all stakeholders, is rare, if not unprecedented. No other city in America has put together such a broad partnership to achieve a transformative reduction in gun violence.”84 Between PSPC, SC2, and the Public Safety Taskforce, Chicago has created several vehicles for long-term investment in community-based public safety infrastructure that has helped to also attract public support. Part of this was an intentional commitment on the part of investors to build out the evidence base for CVI work with rigorous, research-based evaluation, including influential work done by the University of Chicago and Northwestern University.85That “proof of concept” is what helped to win public sector and business sector buy-in, by making the case that this is a sound investment. As the SC2 semi-annual report states, “A growing body of research suggests that CVI in Chicago is highly effective in reducing the risk factors among individuals most impacted by violence. Initial independent evaluations of three citywide CVI programs by the University of Chicago Crime Lab and Northwestern University CORNERS have shown promising evidence of impact: READI Chicago participants have 79% fewer arrests for a shooting or homicide; Chicago CRED participants have experienced a 50% reduction in victimization and are 73% less likely to be re-arrested for violent crime; and Communities Partnering 4 Peace (CP4P) outreach participants have 31% fewer gunshot injuries in the following 24 months.”86 Chicago provides a striking example of the power of private investment to attract public resources to a particular issue, which in turn helps drive additional private support, creating a virtuous cycle. The below chart shows the breakdown of public and private funding for CVI in Chicago from 2018 to 2024, and it demonstrates how private support has helped drive an increase in public investment—and how both have increased in absolute terms since 2018, although the public increase is much more dramatic in scope. Through this dynamic, private investments of $150 million have attracted more than $300 million in public funding to Chicago to address homicides and shootings in recent years.87As a 2022 article from theChronicle of Philanthropydescribed, thanks to this combined public-private funding, “Chicago’s decades-old violence-intervention field is enjoying a stability it could only imagine previously.”87At the end of 2024, the city saw homicides decline to a half-decade low as these investments reached the ground and took effect.88 **Champions for Peace: A Conversation with Tina Padilla Zamora** Mar 21, 2025 As noted in a recent GIFFORDS Center for Violence Intervention’s report,Opportunities for Innovation in Community Violence Intervention,“In many ways, philanthropic efforts can pave the way for public sector adoption of successful interventions that reduce violence and improve quality of life, serving as a testing ground for innovative strategies that save lives.”89 Finally, as part of an increased investment in CVI, private funders should look to specifically support the growth and expansion of CVI coalitions, just as they have done in the domestic violence space. As this report has demonstrated, CVI coalitions have the unique potential to quickly and effectively build power and connections between organizations that are either doing CVI work themselves or that otherwise care deeply about the success of this work in their communities. There are at least a dozen states that would benefit from the creation of a statewide CVI coalition and many regions that could use a local coalition. Private support can help to fill these gaps and take this important work to the next level. **For Advocates and Practitioners** CVI and violence prevention advocates and practitioners at all levels of government should add direct support for coalitions to their list of policy priorities, and push both public and private stakeholders to increase their support for CVI coalition building efforts. When determining how much funding to push for in a state’s given fiscal year, support for coalition work should be factored in the equation. Using the information in this report, advocates and practitioners can help lawmakers understand that this investment might be new in the CVI field, but has been a tried-and-true investment in the related field of domestic violence prevention—and one that has proved its worth over decades. Extending this support to CVI coalitions is simply a natural extension of that policy and helps to fill an important gap when it comes to addressing community violence. Advocates and practitioners should also seek out and join CVI coalitions where they already exist and continue to educate lawmakers on the vital role that coalitions play in improving the efficacy of the field.For federal advocates, this meansjoining the Invest in Us coalition. For state-level advocates, a new resource is the State CVI Coalition Alliance (SCCA), which is a voluntary membership organization of individuals who lead state CVI coalitions. As a “coalition of coalitions,” SCCA’s mission is to foster coalition growth by building networks, sharing best practices and lessons learned, and creating informational materials for public consumption. To find out if there is a state CVI coalition in your home state, you cancontact the SCCA at sccainformation@gmail.com. If there is not a CVI coalition in your state and/or region, it’s time to think about getting one started.This is a time-intensive and relationship-driven process that depends on high levels of trust between members. Yet the potential results more than justify the costs, as this report has demonstrated. The SCCA has a number of resources available upon request about the coalition building process, and GIFFORDS Center for Violence Intervention is working on detailed guidance about how to start and maintain a state CVI coalition. **Conclusion** The ultimate takeaway of this report is simple, yet powerful: The experiences of the domestic violence movement and many others in the US show definitively that coalitions are one of the most important drivers of social change. Over the last few decades, as the domestic violence movement grew, many levels of government and the private sector intentionally included support for coalitions as part of an intentional strategy to reduce intimate partner violence. As a result, such coalitions now exist in every single state—and as this movement has grown, overall levels of domestic violence have dropped significantly: down 67% from the early 1990s to the early 2020s.10 The movement to end community violence is starting down a similar path, with coalitions beginning to emerge at the local, state, and federal levels, although this has largely not been part of any intentional or strategic public policy choice. It’s time for that to change.The success of coalitions like theInvest in Uscoalition at the national level and the CalVIP Coalition at the state level demonstrate the utility and impact of CVI coalitions beyond a shadow of a doubt. Continuing the forward momentum will require intentional investment and support on the part of all levels of government and the private sector, just as it has in the domestic violence space. **State CVI Coalition Alliance Factsheet** There should truly be nothing partisan about the concept of community-based public safety. It’s an effective approach to violence reduction that has everything to do with providing services and interventions to high-risk individuals and nothing whatsoever with the Second Amendment or regulating access to firearms. Yet on April 22, 2025, dozens of community-based organizations and some government entities received notices from the US Department of Justice notifying them that their grants from the Community Based Violence Intervention and Prevention Initiative (CVIPI) had been terminated—instantly ending tens of millions of dollars in investment in public safety. This was part of a broader set of more than $800 million in cuts to DOJ programs for victim services, mental health support, and even domestic violence prevention. President Trump’s budget for fiscal year 2026 proposes to strip away historic funding for community-based public safety. After several years of significant progress on the issue of community violence, with double digit reductions in homicide levels during the final years of the Biden administration, the federal government now appears ready to turn its back on CVI. In short, there is little reason to think that the Trump administration will support the growth of CVI coalitions. Nevertheless, the rest of the nation must lean in to protect this lifesaving work, or risk undoing many years’ worth of effort and progress. This is the right public policy—and we at GIFFORDS Center for Violence Intervention will continue calling on national leaders to do the right thing until they either act, or until America elects a new set of leaders willing to do what it takes to save lives. In the meantime, progress is still possible at the state level.Now more than ever, local leaders and the private sector must rise to the occasion as the stewards of community-based public safety. Every sector has a role to play. GIFFORDS Center for Violence Intervention is supporting the growth of CVI coalitions through our advocacy and organizing efforts, but also with the creation of theState CVI Coalition Alliance (SCCA), which is a platform for coalition leaders to discuss challenges, share information, and continue to build organizing and advocacy capacity for the community-based public safety movement. For more information, please contact us atsccainformation@gmail.com. We would like to acknowledge and thank everyone who contributed to this report, and to extend a special thank you to those in the movement to end domestic violence and sexual assault who contributed their thoughts and partnership. **SPOTLIGHT** **TRACKINGCVI LEGISLATION** Community violence intervention is a crucial approach to fighting gun violence. Keep up to date on the latest CVI legislation in your state with the Giffords Community Violence Intervention Policy Analysis & Tracking Hub—CVI-PATH. **The Latest** **State Blueprints: Restoring Gun Industry Accountability** **SCOTUS refuses to grant gun industry unfettered immunity in decision in Mexico case** **Voters oppose selling silencers without background checks in Trump’s “big, beautiful bill”** Lynsy Smithson-Stanley and Jack Zhou, “Blueprint for a Multiracial, Cross-Class Climate Movement, The Report on Coalitions,” Climate Advocacy Lab, October 4, 2023,https://climateadvocacylab.org/system/files/2023-10/MRXCClimateBlueprint_Report.pdf.[↩] Rita Smith, “History and Purpose of Domestic Violence Coalitions,” DomesticShelters.org, March 10, 2020,https://www.domesticshelters.org/articles/domestic-violence-op-ed-column/history-and-purpose-of-domestic-violence-coalitions.[↩][↩][↩] Catherine Jacquet, “Domestic Violence in the 1970s,” National Library of Medicine, October 15, 2015,https://circulatingnow.nlm.nih.gov/2015/10/15/domestic-violence-in-the-1970s.[↩] “Fighting the ‘Silent Epidemic,’” Catholic Health Association of the United States, March 1996,https://www.chausa.org/publications/health-progress/archive/article/march-april-1996/fighting-the-silent-epidemic-.[↩] Susan Schechter,Women and Male Violence: The Visions and Struggles of the Battered Women’s Movement(South End Press, 1982).[↩][↩][↩][↩] Whitney Derman, “Shifts in Cultural Attitudes towards Domestic Violence Through the Last Century,” Abuse Refuge Org, October 13, 2021,https://abuserefuge.org/shifts-in-cultural-attitudes-towards-domestic-violence-through-the-last-century.[↩] Kara Clifford Billings, “Family Violence Prevention and Services Act (FVPSA): Background and Funding,” Congressional Research Service, July 27, 2022,https://sgp.fas.org/crs/misc/R42838.pdf;See alsoSusan Schechter,Women and Male Violence: The Visions and Struggles of the Battered Women’s Movement(South End Press, 1982), 71–72.[↩] National Network to End Domestic Violence, last accessed April 10, 2025,https://nnedv.org.[↩] 34 USC §§ 12291, et seq; “History of VAWA,” The Women’s Legal Defense and Education Fund, last accessed April 10, 2025,https://www.legalmomentum.org/history-vawa.[↩] Claire Goudreau, “Looking back at the Violence Against Women Act after 30 years of protection,” Johns Hopkins University Hub, September 27, 2024,https://hub.jhu.edu/2024/09/27/violence-against-women-act-30th-anniversary.[↩][↩] GIFFORDS Center for Violence Intervention, “What Is Community Violence Intervention?” last accessed April 10, 2025,https://giffords.org/intervention/what-is-community-violence-intervention.[↩] Invest in Us, last accessed April 10, 2025,https://investinuscoalition.org.[↩] Akua Amaning, “The American Rescue Plan Has Helped State and Local Governments Invest in Community Safety,” Center for American Progress, August 15, 2022,https://www.americanprogress.org/article/the-american-rescue-plan-has-helped-state-and-local-governments-invest-in-community-safety; “Using ARPA Dollars to Support Community Violence Interventions: Where Are We Now?” Covid Funds for Violence Intervention, December 2, 2024,https://covidfundsforviolenceintervention.com/2024/12/02/using-arpa-dollars-to-support-community-violence-interventions-where-are-we-now.[↩] “CVIPI Factsheet,” Community Based Violence Intervention and Prevention Initiative, Department of Justice, last accessed April 10, 2025,https://www.ojp.gov/sites/g/files/xyckuh241/files/media/document/cvipi_factsheet.pdf.[↩] US Department of Justice (Archives), “Fact Sheet: Two Years of the Bipartisan Safer Communities Act,” news release, June 25, 2024,https://www.justice.gov/opa/pr/fact-sheet-two-years-bipartisan-safer-communities-act.[↩] Vaughn Crandall, Reygan Cunningham, and Robin Campbell, “Breaking the Cycle: Making Violence Prevention and Intervention A Permanent Policy Commitment of the State of California,” California Partnership for Safe Communities, 2024,https://thecapartnership.org/wp-content/uploads/2024/04/CalVIP-AB28-Brief_CPSC_FINAL-REV.pdf.[↩][↩][↩][↩] “Gun Violence Statistics,” GIFFORDS, last accessed April 10, 2025,https://giffords.org/lawcenter/resources/gun-violence-statistics.[↩] “FVPSA Grants for State and Territorial Domestic Violence Coalitions,” Office of Family Violence Prevention and Services, last accessed on April 10, 2025,https://www.acf.hhs.gov/ofvps/programs/fvpsa/fvpsa-grants-state-and-territorial-domestic-violence-coalitions.[↩] “DOJ Funding Update: A Deeper Look at the Cuts,” Council on Criminal Justice, May, 2025,https://counciloncj.org/doj-funding-update-a-deeper-look-at-the-cuts.[↩] Mike McLively, “Investing in Intervention: The Critical Role of State-Level Support in Breaking the Cycle of Urban Gun Violence,” GIFFORDS Law Center to Prevent Gun Violence, December 18, 2017,https://giffords.org/lawcenter/report/investing-intervention-critical-role-state-level-support-breaking-cycle-urban-gun-violence.[↩][↩] “California Violence Intervention and Prevention Program,” California Board of State and Community Corrections, last accessed April 10, 2025,https://www.bscc.ca.gov/s_cpgpcalvipgrant.[↩] Ari Freilich (California Office of Gun Violence Prevention), interviewed by Mike McLively (GIFFORDS Center for Violence Intervention), February 11, 2025.[↩] CalMatters, “Hearings, Senate Floor, Bill AB 28,” September 7, 2023,https://calmatters.digitaldemocracy.org/hearings/257109?t=1151&f=005f4b4c02977c53224f684928f5f3e2.[↩][↩] The White House, “FACT SHEET: President Biden Issues Call for State and Local Leaders to Dedicate More American Rescue Plan Funding to Make Our Communities Safer – And Deploy These Dollars Quickly,” news release, May 13, 2022,https://bidenwhitehouse.archives.gov/briefing-room/statements-releases/2022/05/13/fact-sheet-president-biden-issues-call-for-state-and-local-leaders-to-dedicate-more-american-rescue-plan-funding-to-make-our-communities-safer-and-deploy-these-dollars-quickly.[↩] “The King Philosophy,” the King Center, last accessed May 16, 2025,https://thekingcenter.org/about-tkc/the-king-philosophy/.[↩] Brittany Nieto et al., “2024 Community Violence Intervention Legislative Year in Review,” GIFFORDS, January 9, 2025,https://giffords.org/analysis/2024-community-violence-intervention-legislation-year-in-review.[↩] Board of State and Community Corrections California, “Governor Newsom Announces Record $156 Million in Grants to Proactively Prevent Gun Violence in California,” news release, June 9, 2022,https://www.bscc.ca.gov/news/governor-newsom-announces-record-156-million-in-grants-to-proactively-prevent-gun-violence-in-california.[↩] Scott Bain, “Assembly Bill Policy Committee Analysis: AB 1929,” Assembly Committee on Health, California legislature, April 5, 2022,https://trackbill.com/s3/bills/CA/2021/AB/1929/analyses/assembly-health.pdf.[↩] Wisconsin Governor Tony Evers, “Gov. Evers Signs Executive Order Creating Wisconsin Office of Violence Prevention, Directs $10 Million to Support Violence Prevention Efforts Statewide,” news release, January 14, 2025,https://content.govdelivery.com/accounts/WIGOV/bulletins/3cc7c74.[↩] Budget Bill (Fiscal Year 2025), SB 360, Maryland General Assembly, (2024) (approved by governor),https://mgaleg.maryland.gov/mgawebsite/Legislation/Details/sb0360?ys=2024RS.[↩] New Jersey Governor Phil Murphy, “Governor Murphy Signs Seabrooks-Washington Community-Led Crisis Response Act,” news release, January 12, 2024,https://www.nj.gov/governor/news/news/562024/20240112d.shtml.[↩] “Office of Safer Communities,” Virginia Department of Criminal Justice Services, last accessed April 10, 2025,https://www.dcjs.virginia.gov/safer-communities-youth-services/office-safer-communities.[↩] Exec. Order No. 279, North Carolina Governor Roy Cooper, March 14, 2023,https://governor.nc.gov/executive-order-no-279/open.[↩] “Invest in Us,” Community Justice, last accessed April 10, 2025,https://thecommunityjustice.net/invest-in-us.[↩] Break the Cycle of Violence Act, S. 2638, 118th Congress, (2023) (introduced),https://www.congress.gov/bill/118th-congress/senate-bill/2638.[↩] The White House, “FACT SHEET: President Biden Issues Call for State and Local Leaders to Dedicate More American Rescue Plan Funding to Make Our Communities Safer – And Deploy These Dollars Quickly,” news release, May 13, 2022,https://bidenwhitehouse.archives.gov/briefing-room/statements-releases/2022/05/13/fact-sheet-president-biden-issues-call-for-state-and-local-leaders-to-dedicate-more-american-rescue-plan-funding-to-make-our-communities-safer-and-deploy-these-dollars-quickly/.[↩] “Year One Progress Report,” White House Office of Gun Violence Prevention, September 2024,https://bidenwhitehouse.archives.gov/wp-content/uploads/2024/09/Year-One-Report-Final.pdf.[↩] Fernando Rejón (Urban Peace Institute), interviewed by Kim Gutierrez (GIFFORDS Center for Violence Intervention), December 11, 2024.[↩] Urban Peace Institute, “LA Peace Plan: The Case to Revise, Revitalize, & Relaunch LA City’s Comprehensive Safety Strategy,” 2022,https://urbanpeaceinstitute.org/wp-content/uploads/2025/05/UPI-LA-Peace-Plan.pdf.[↩] Los Angeles Mayor Karen Bass, “Mayor Bass commends City Council’s approval of increased investments in violence reduction program,” news release, June 27, 2023,https://mayor.lacity.gov/news/mayor-bass-commends-city-councils-approval-increased-investments-violence-reduction-program.[↩] “LA Peacemakers Initiative,” Urban Peace Institute, last accessed April 10, 2025,https://urbanpeaceinstitute.org/la-peacemakers-initiative.[↩] Office of Family Violence Prevention and Services, “Commemorating the Family Violence Prevention and Services Act (FVPSA) 40th Anniversary: Supporting Pathways to Safety and Support for All Survivors,” news release, October 31, 2024,https://web.archive.org/web/20241220222443/https://www.acf.hhs.gov/ofvps/news/ofvps/fvpsa-40th-anniversary.[↩] “Attorney General’s Task Force on Family Violence – Final Report,” Office of Justice Programs, US Department of Justice, 1984,https://www.ojp.gov/ncjrs/virtual-library/abstracts/attorney-generals-task-force-family-violence-final-report.[↩] 42 USC §§ 10401 et seq., the Family Violence Prevention Services Act (FVPSA).See alsoChild Abuse Amendments of 1984, H.R. 1904, 98th Congress (1983–1984) (enacted),https://www.congress.gov/bill/98th-congress/house-bill/1904?q=%7B%22search%22%3A%22Family+Violence+Prevention+and+Services+Act%22%7D&s=7&r=7.[↩] “About OFVPS,” Office of Family Violence Prevention and Services, last accessed April 19, 2025,https://www.acf.hhs.gov/ofvps/about-ofvps.[↩] “Standing Announcement for Family Violence Prevention and Services/ Grants to State Domestic Violence Coalitions,” Administration on Children, Youth and Families (ACYF)/Family and Youth Services Bureau (FYSB), US Department of Health and Human Services, last accessed April 19, 2025,https://acf.gov/sites/default/files/documents/fysb/2023%20NOFO%20HHS-2021-ACF-ACYF-SDVC-1963_Coalitions%20FINAL.pdf.[↩] 45 CFR § 1370.20, last accessed April 19, 2025,https://www.ecfr.gov/current/title-45/subtitle-B/chapter-XIII/subchapter-H/part-1370/subpart-C.[↩][↩] 42 U.S.C. §§ 10401 et seq., the Family Violence Prevention Services Act (FVPSA).[↩] 42 U.S. Code § 10411,https://www.law.cornell.edu/uscode/text/42/10411.[↩][↩] “Standing Notice of Funding Opportunity for Family Violence Prevention and Services/Domestic Violence Shelter and Supportive Services/Awards to States,” Administration for Children and Families Office of Family Violence Prevention and Services (OFVPS), US Department of Health and Human Services, last accessed April 19, 2025,https://www.acf.hhs.gov/sites/default/files/documents/ofvps/OFVPS%20Notice%20of%20Standing%20Funding%20Opportunity%20States%20and%20Territories%202024%20-%202026.pdf.[↩] “History of VAWA,” the Women’s Legal Defense and Education Fund, last accessed April 10, 2025,https://www.legalmomentum.org/history-vawa.[↩][↩] 34 USC § 12511,https://www.law.cornell.edu/uscode/text/34/12511.[↩] “Office on Violence Against Women (OVW),” US Department of Justice, last accessed April 19, 2025,https://www.justice.gov/ovw.[↩] “About the Office on Violence Against Women,” Office on Violence Against Women, US Department of Justice, last accessed April 19, 2025,https://www.justice.gov/ovw/media/858106/dl?inline=.[↩] “Program: Rape Prevention and Education Program,” Centers for Disease Control, November 15, 2024,https://www.cdc.gov/sexual-violence/programs/index.html#:~:text=The%20term%20state%20sexual%20assault,approved%20state%20sexual%20assault%20coalitions.[↩] Michigan Coalition to End Domestic & Sexual Violence, last accessed April 19, 2025,https://mcedsv.org.[↩] “OVW Fiscal Year 2024 State and Territory Domestic Violence and Sexual Assault Coalitions Program – Solicitation,” Office on Violence Against Women, US Department of Justice, April 24, 2024,https://www.justice.gov/ovw/media/1349281/dl?inline;See also34 U.S.C. § 10441(c) and 34 U.S.C. § 12511(d).[↩] “State Coalitions Program,” Violence Against Women Act Measuring Effectiveness Initiative, last accessed April 19, 2025,https://www.vawamei.org/grant-program/stat-coalitions-program.[↩] “Grants to State Sexual Assault and Domestic Violence Coalitions Program,” Violence Against Women Act Measuring Effectiveness Initiative, last accessed April 19, 2025,https://www.vawamei.org/wp-content/uploads/2020/07/2018ReportToCongressStateCoalitionsChapter.pdf.[↩] “2022 Biennial Report, The 2022 Biennial Report to Congress on the Effectiveness of the Grant Funds under the Violence Against Women Act,” Office on Violence Against Women, US Department of Justice, 2022,https://www.justice.gov/ovw/media/1348091/dl?inline.[↩] Ashleigh Klein-Jimenez, “CDC’s DELTA AHEAD Recipients Announced,” PreventConnect, May 9, 2023,https://www.preventconnect.org/2023/05/cdcs-delta-ahead-recipients-announced.[↩] “Coalition Funding,” Resource Sharing Project, National Sexual Assault Coalition, 2016,https://resourcesharingproject.org/wp-content/uploads/2021/11/Factsheet_CoalitionFunding.pdf.[↩][↩] “Congressionally Directed Spending Requests FY2024,”United States Senate Committee on Appropriations, last accessed April 19, 2025,https://www.appropriations.senate.gov/congressionally-directed-spending-requests-fy2024-chart.[↩] Delaware Coalition Against Domestic Violence, “2024 Annual Impact Report,” last accessed April 19, 2025,https://dcadv.org/file_download/inline/5b959ce0-6ef1-49ee-b1df-176f35d3b9f9.[↩] Violence Free Minnesota, “Annual Report 2020,” last accessed April 19, 2025,https://www.vfmn.org/_files/ugd/f4bdb8_7d15d8e48cfd44cb85f66ab3581dbbfb.pdf.[↩] “Statewide Domestic Violence Prevention Resource Center (PV) Program,” Governor’s Office of Emergency Services, April 17, 2024,https://www.caloes.ca.gov/wp-content/uploads/Grants/Documents/RFA/PV24-RFA-FINAL.pdf.[↩] Erin Scott, “Funding for Domestic Violence in California,” Family Violence Law Center, commissioned by Blue Shield of California Foundation, September 2016,https://blueshieldcafoundation.org/sites/default/files/covers/DV_Funding_in_CA_2016___Final.pdf.[↩] Ms. Foundation for Women, “Efforts to Address Gender-Based Violence: A Look at Foundation Funding, 2010,https://www.nsvrc.org/sites/default/files/2021-04/Ms_Gender-BasedViolenceReport_2010.pdf.[↩] Katherine Don, “The State of American Philanthropy: Giving for Violence Prevention,” Inside Philanthropy, 2021,https://www.insidephilanthropy.com/state-of-american-philanthropy-pdfs/giving-for-violence-prevention.[↩][↩][↩] Brett J. Barnes, “SCOTUS Decision Doesn’t End the Growing Dangers Domestic Violence Victims Face. Where’s Philanthropy?” The Chronicle of Philanthropy, June 4, 2024,https://www.philanthropy.com/article/expected-scotus-decisions-could-endanger-domestic-violence-victims-wheres-philanthropy#:~:text=Organizations%20lack%20adequate%20funding%20to,classified%20as%20a%20women%27s%20issue.[↩] Brett J. Barnes, “SCOTUS Decision Doesn’t End the Growing Dangers Domestic Violence Victims Face. Where’s Philanthropy?” The Chronicle of Philanthropy, June 4, 2024,https://www.philanthropy.com/article/expected-scotus-decisions-could-endanger-domestic-violence-victims-wheres-philanthropy#:~:text=Organizations%20lack%20adequate%20funding%20to,classified%20as%20a%20women%27s%20issue;See alsoIUPUI Women’s Philanthropy Institute, “The Women & Girls Index 2023: Measuring Giving to Women’s and Girls’ Organizations,” October 2023,https://scholarworks.indianapolis.iu.edu/server/api/core/bitstreams/3362cb58-af76-4838-9217-c0f9a7cc920b/content.[↩] California Partnership to End Domestic Violence, “The Partnership’s Annual Report, A Year of Innovation,” last accessed April 19, 2025,https://capartnershipannualreport2020-2021.my.canva.site/2023-2024-annual-report.[↩] US Senator Chris Van Hollen, “FY22 Community Funding Projects Secured,” last accessed April 10, 2025,https://www.vanhollen.senate.gov/investing-in-md/community-funding-projects-secured.[↩] Katherine Don, “The State of American Philanthropy: Giving for Violence Prevention,” Inside Philanthropy,https://www.insidephilanthropy.com/state-of-american-philanthropy-pdfs/giving-for-violence-prevention.[↩] “Community Violence Intervention Action Plan: Mapping Transformation for the Field Fall 2024,” last accessed April 20, 2025,https://static1.squarespace.com/static/66ba86a03840716e574eab29/t/66bc16d24ba9b012a1f55aac/1723602646179/CVI_Action+Plan_Full+Report_v10.pdf.[↩][↩] The White House, “Fact Sheet: Biden-⁠Harris Administration Announces Comprehensive Strategy to Prevent and Respond to Gun Crime and Ensure Public Safety,” news release, June 23, 2021,https://web.archive.org/web/20250108041338/https://www.whitehouse.gov/briefing-room/statements-releases/2021/06/23/fact-sheet-biden-harris-administration-announces-comprehensive-strategy-to-prevent-and-respond-to-gun-crime-and-ensure-public-safety.[↩] Baltimore Mayor Brandon Scott, “Mayor Scott, City of Baltimore Mark Historic Violence Reductions,” news release, January 8, 2025,https://mayor.baltimorecity.gov/news/press-releases/2025-01-08-mayor-scott-city-baltimore-mark-historic-violence-reductions.[↩] City of Detroit Mayor’s Office, “Detroit partnerships result in another historic drop in violent crime in 2024; fewest homicides since 1965, shootings & carjackings plummet,” news release, January 3, 2025,https://detroitmi.gov/news/detroit-partnerships-result-another-historic-drop-violent-crime-2024-fewest-homicides-1965-shootings.[↩] Toni Yates, “Newark sees decrease in murders, but increase in overall violent crime in 2024: officials,“ ABC 7 NY, December 30, 2024,https://abc7ny.com/post/newark-crime-stats-city-decrease-murders-rise-violent-2024-officials-say/15729127/#:~:text=NEWARK%2C%20New%20Jersey%20(WABC),lowest%20level%20since%20the%201940s.[↩] Claudia Vargas, “Philly saw its lowest homicide rate in a decade in 2024,” NCB 10 Philadelphia, December 31, 2024,https://www.nbcphiladelphia.com/news/local/philly-saw-its-lowest-homicide-rate-in-a-decade-in-2024/4066099.[↩] St. Louis Metropolitan Police Department, “2024: Crime Remains on Downward Trend,” January 14, 2025,https://slmpd.org/2024-crime-remains-on-downward-trend/#:~:text=Crime%20remains%20on%20a%20downward,down%2031%25%20compared%20to%202022.[↩] “About Us,” Partnership for Safe and Peaceful Communities, last accessed April 20, 2025,https://safeandpeaceful.org/about-us.[↩][↩] “Public Safety Task Force Call to Action,” “Civic Committee, Commercial Club of Chicago, last accessed April 20, 2025,https://civiccommittee.org/pstf.[↩] Chicago CRED, “Philanthropic, Business, Government Leaders Join Community Violence Intervention Groups to Expand Neighborhood Collaboratives to Reduce Gun Violence in Chicago,” February 21, 2024,https://www.chicagocred.org/blog/philanthropic-business-government-leaders-join-community-violence-intervention-groups-to-expand-neighborhood-collaboratives-to-reduce-gun-violence-in-chicago.[↩] See, e.g., Marisa C. Ross, Erin M. Ochoa, and Andrew V. Papachristos, “Evaluating the impact of a street outreach intervention on participant involvement in gun violence,”Proceedings of the National Academy of Sciences of the United States of America120, no. 46 (November 2023),https://doi.org/10.1073/pnas.2300327120; Center for Neighborhood Engaged Research & Science (Corners), “Research Brief: Neighborhood-Level Impact of Communities Partnering 4 Peace,” March 2023,https://assets.website-files.com/630fc70085c3ed55d3d41d54/6410b7efba46b47e1a4a4462_CP4P%20Neighborhood%20Impact%20Brief_3.13.2023.pdf; Monica P Bhatt et al., “Predicting and Preventing Gun Violence: An Experimental Evaluation of READI Chicago,”the Quarterly Journal of Economics139, (no. 1): 1–56,https://doi.org/10.1093/qje/qjad031.[↩] SC2 Semi-Annual Report, March 2025, on file with GIFFORDS Center for Violence Intervention.[↩] Drew Lindsay, “How a Philanthropic Bet on Violence Intervention Is Winning Public Dollars,” the Chronicle of Philanthropy, October 4, 2022,https://www.philanthropy.com/article/how-a-philanthropic-bet-on-violence-intervention-is-winning-public-dollars.[↩][↩] Craig Wall, “Chicago sees fewer than 600 murders in 2024 for 1st time since 2019; shootings, carjackings down,” ABC 7 Eyewitness News, January 1, 2025,https://abc7chicago.com/post/chicago-violence-city-sees-fewer-600-murders-2024-1st-time-2019-shootings-carjackings-down/15738569.[↩] Jordan Costa, Brittany Nieto, and Rigel Robinson, “Opportunities for Innovation in Community Violence Intervention,” GIFFORDS Center for Violence Intervention, February 20, 2025,https://giffords.org/lawcenter/report/opportunities-for-innovation-in-community-violence-intervention.[↩] About Donate Contact Stories Careers Press SupportGiffords **Join our Team Today!** © 2025 GIFFORDS Law Center to Prevent Gun Violence. All Rights Reserved. Terms & Conditions Privacy Policy Accessibility By continuing on our website, you agree to our use of cookies.Terms & Conditions.Privacy Policy."}