{"id": 2172, "name": "Wait But Why", "domain": "waitbutwhy.com", "bias": "center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://waitbutwhy.com/2014/12/the-teen-years-9-cringe-inducing-realizations.html#comments", "title": "The Teen Years 9 Cringe Inducing Realizations.html#comments", "content": "Home **** Homepage aboutwait but whofaqcontact wait but who faq contact wait but who faq contact archive minis the shed dinner table storestore homenew releasespostersphone casescards & wrapping papersquishy thingsmen’s teeswomen’s teescoffee mugsstore support store home new releases posters phone cases cards & wrapping paper squishy things men’s tees women’s tees coffee mugs store support store home new releases posters phone cases cards & wrapping paper squishy things men’s tees women’s tees coffee mugs store support support wbw book #7246 (no title) Finn’s Cave **The Teen Years: 9 Cringe-Inducing Realizations** Yesterday, home for the holidays and assigned an attic chore, I stumbled upon a box—well-taped up, covered in dust, and clearly labeled as “TIM’S STUFF” with two underlines. Ohyeah. Thatbox. When I graduated high school, I decided to gather up everything I owned that had meaning to me and put it in a big cardboard box. That was 14 years ago. With almost no memory of what was in the box, I decided to open it up. Inside I found old schoolwork, report cards, things I had written, things my friends had written, pictures, audio and video recordings, tickets of things I had gone to, and a ton of letters. It quickly turned into a very weird day for me. First, it’s been fascinating—it’s amazing how many things you remember incorrectly, and I’ve been doing a lot of revising of off-base memories. Second, I’m a slight emotional wreck—right on the edge of doingthis. But mostly, I spent seven straight hours cringing. Looking at yourself from the outside always has the potential to be mortifying, but looking at yourself and your friends as teenagers is like watching the least endearing, most excruciating reality show ever made. Here’s why: Anyone who knows 9 to 23-year-olds knows that they tend to detract more value from the world than they add, but as you can see on this graph, the teen years, and especially ages 12 to 16, are a full train wreck. The reason we sometimes forget this is that the only people who spend time with teens are other, equally un-self-aware teens, parents of teens (whose judgment is clouded by their love for their kid), and professionals who have chosen to work with teens because they have an inexplicable soft spot for them. All the people in a position to see teenagers for who they actually are don’t come into much contact with them, so we often forget what kind of people they are. But there was no forgetting yesterday, as I pored through this mound of primary sources—especially since in this case, it brought back all the inner thinking behind the way my friends and I were. So all teens reading this, especially those on the younger side: You have a right to live your life, but at least do so with the knowledge that you’re probably bringing down the general quality of the world by being the way you are. I can’t fix you—no one can—but I’ll try to offer some basic suggestions that will help you minimize the amount of embarrassment you’re causing to our species and to your future self: 1) Don’t attempt to be profound, for any reason whatsoever.Profound is not for teenagers, and you’re 100% not an exception. In particular, if one day at the age of 16, you decide to write a short philosophical story in red ink in all tiny capital letters and you’re quivering by the end with a sense of sublime connection to something bigger than yourself, what you should do is A) stop feeling this way, B) keep this whole experience to yourself, and C) throw the story away, since reading it later in life, once you have clarity, will shatter the incorrect, more impressive image you have of yourself as a teen. 2) Don’t be such a dick to your parents, you entitled little shit.You live in a world where 99.9999999% of humans care more about how their hair looks than whether you live or die, and then there’s this person, or two if you’re lucky, who’d give theirlivesfor you. And how do you feel about all this? You feel the exact levels of entitlement and gratitude of this horse: 3) Girls between 11 and 13 and boys between 13 and 15 should implement a strict no-photography policy.For your future self, it’s like being reminded how the hot dog was made. 4) 13-14-year old boys: Your newfound sexuality is extremely icky and upsetting to everyone else. Just a year or two ago, you had a high voice, a microscopic penis, and people found you endearing. A lot of changes have happened in your life since then, and none of them are appealing to the rest of the world. Even your parents are kind of sickened by your whole vibe these days. Here’s the issue: There’s not really anything you can do to shield humanity from what you’re thinking about, since everyone can see it on your greasy little face, so I’m not sure there’s any advice here—just try not to hurt yourself. 5) 12-14-year-old girls: Try to form one notch less of a medieval empire of sadism and tears.There are a few people crueler to their peers than 12-14-year-old girls— —but not many. One of the things I found in the cardboard box was a photo of some Play-Doh creation of a human head with a bunch of little red spheres stuck to it, which at the time was made by an acne-ridden girl’s peers and passed around the entire 7th grade at school. Another finding was a letter a friend had written me while I was away the summer after 8th grade, telling me that a girl we knew had been crying yesterday because a bunch of people had been hanging out at a house, but they hadn’t invited this one ostracized member of the group, and the girl whose house it was wouldn’t let her in the door when she showed up. No one else can quite understand the psychology of a 12-14-year-old girl, just like we can’t understand the way medieval dictators thought—all you can do is remain wary when you’re around them and be careful never to show weakness. 6) Be aware that there are no winners when a 14-year-old boy decides to grow his hair into a shoulder-length bowl cut. 7) 16-18-year-olds: You’re not in love.You’re insomething—I understand that—but that thing you’re in is very likely not love. What’s happening is that you’re a basket of hormones that has become infatuated with another basket of hormones, and that’s fine—go for it. But if you find yourself tempted to do something like sever an old, otherwise-strong friendship of yours over it, or alter your college-application plans in order to go to college together as a couple, or write some horrifying love note about this person in your high school yearbook—the thing you need to be made clear on is that friends, and college, and paper are real, and your relationship is fictional: This is a graph of a group of sample relationships I created based on no actual data (the graph seemed like a good idea in my head, but then when I made it, it came out totally weird and confusing. Luckily, that’s your problem and not mine). Anyway the point is, when it comes to high school couples, a vast majority of them who are still together after high school ends will be finished by Thanksgiving (late November) of their freshman year of college—the high school relationship wall. The problem is, lots of high school couples are pretty sure that theyjust mightbe that one outlier couple on the graph who actually will end up together forever—except then they won’t make it past the wall. So keep this in mind and try not to bump something over in the realm of long-lasting things for the sake of this relationship. And if,for someincredible reason, you decide to write a song related to this situation of yours, and you choose to write the lyrics on a physical piece of long-lasting paper, and before you graduate you decide to put a bunch of things into a box for the future,understand that you’re only hurting yourself by putting the paper with the lyrics on it into the box, because it’ll cause you to read them when you’re 33 when you had otherwise completely forgotten about the incident. 8) You’re not a Communist, you’re not a Marxist, you’re not an Anarchist, you’re not a Nihilist.No one likes a teenage zealot. Just stop. 9) When your 7th grade girlfriend gives you this note— —realize that A) it means she’s incredibly not into you, and B) if she has to write her last name, it means your relationship was lacking in the first place. You should also explain to her how to do the “It’s not you, it’s me” thing correctly, instead of basically saying, “It’s not you, it’s me—me not liking you.” Whatever you do, don’t convince her to get back together with you, since that’ll just result in you going through all the pain again two weeks later— If someone you’ve spoken to no more than three times in your life A) is acting like she’s divorcing you after 20 years of marriage, averaging 2.5 sorry’s per note, because of how devastated she thinks you’ll be when you read this, and B) feels the need to use the word “look” with you, which is the step right below a restraining order—and all this from someone who thinks it’s okay to hyphenate the word “would”—you need to make some big changes. So, teenagers, I suggest you take a long look in the mirror and understand the perils you face by being you. Your entire existence is like a drunk person dancing at a wedding—fun from the inside, horrifying from the outside—so just think about that when you’re choosing what to put in writing, put online, and gather into the box at the end of high school. Your future self might be better off without all the details. Related Wait But Why Posts 11 Awkward Things About Email7 Ways To Be Insufferable On FacebookAll the Weird Toys From Your Childhood _______ If you like Wait But Why, sign up for ouremail listand we’ll send you new posts when they come out. To support Wait But Why, visit ourPatreon page. **RECOMMENDED POSTS** The 2024 Trump-Biden DebateJune 28, 2024 10 Thoughts From the Fourth TrimesterMay 23, 2023 A Short History of My Last Six YearsFebruary 17, 2023 Post (219) Forum Topic (85) Page (44) Mandarin (10) Uncategorized (129) Dinner Table Topics (84) Category #1 (59) Minis (43) The Shed (31) funny (39) science (30) society (22) psychology (21) selfhelp (16) 2024 (5) 2023 (43) 2021 (2) 2020 (4) 2019 (2) Join 601K other humans and have new posts emailed to you. Popular Posts The AI RevolutionJanuary 22, 20151,177 Why Procrastinators ProcrastinateOctober 30, 2013599 The Fermi ParadoxMay 21, 20141,429 How (and Why) SpaceX Will Colonize MarsAugust 16, 2015992 How to Pick a Life PartnerFebruary 12, 2014319 Why Gen Y Yuppies Are UnhappySeptember 9, 20131,246 Putting Time In PerspectiveAugust 22, 2013568 How to Name a BabyDecember 11, 2013333 Why You Should Stop Caring What Other People ThinkJune 13, 2014367 Religion for the NonreligiousOctober 19, 2014850 From Muhammad to ISIS: Iraq's Full StorySeptember 12, 2014329 The Tail EndDecember 11, 2015321 Endnotes Why I Lugged My 27-Pound Toddler to a Rocket Launch The 2024 Trump-Biden Debate Tales From the Eclipse All My Thoughts After 40 Hours in the Vision Pro The Ant-Honey Problem 10 Thoughts From the Fourth Trimester Idea Labs Opt-Out Audiobook A Short History of My Last Six Years Homepage aboutwait but whofaqcontact wait but who faq contact wait but who faq contact archive minis the shed dinner table storestore homenew releasespostersphone casescards & wrapping papersquishy thingsmen’s teeswomen’s teescoffee mugsstore support store home new releases posters phone cases cards & wrapping paper squishy things men’s tees women’s tees coffee mugs store support store home new releases posters phone cases cards & wrapping paper squishy things men’s tees women’s tees coffee mugs store support support wbw book #7246 (no title) Finn’s Cave"}