{"id": 2095, "name": "People's Policy Project", "domain": "peoplespolicyproject.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.peoplespolicyproject.org/2025/02/25/trumps-freeze-on-clean-energy-funding-harms-states-and-nonprofits-most/", "title": "Trumps Freeze On Clean Energy Funding Harms States And Nonprofits Most", "content": "**People’s Policy Project** About Issues Contact Support Facebook Twitter RSS **** About Issues Contact Support Facebook Twitter RSS **Trump’s Freeze on Clean Energy Funding Harms States and Nonprofits Most** Trump can stop Direct Pay grants but not tax credits. climate The past month, Trumpfroze federal grantsfor clean energy that came from the Bipartisan Infrastructure Law and Inflation Reduction Act (IRA), on top ofblocking wind and solaron public lands andwithdrawingfrom the Paris Agreement. Trump has resisted orders fromfederal judgesto restore clean energy funds, and he will most likely enact new limits once the freeze officiallyexpires. But corporations and investors with positions in clean power claim to be unconcerned. Multinationals building wind turbines in the US insist that Trump hasno impacton their business, and that electrification is inevitable. Some analysts claim similarly that despite Trump’s rollback of IRA tax credits for renewables, recent wind and solar projects areunstoppablebecause of theircost-competitiveness. This optimistic picture is misleading because it relies on confusion about the kinds of renewable projects we’re talking about. Trump’s executive order is uniquely harmful to renewable projects initiated by state governments and nonprofits. Under the IRA, nonprofits could receive funding through clean energy tax credits converted into grants. This method of“direct pay”helped nonprofits finance renewable power through tax credits that would otherwise be unhelpful (because nonprofits are tax-exempt). Cities, tribes, schools, hospitals, and public utilities had already initiated solar projects with the expectation of receiving tens of millions in reimbursements from direct pay. States like Michigan, Nebraska, and Minnesota have committed to 100% clean energy, and partnerships with institutions eligible for direct pay arenecessary to meet those targets. Some have argued that Trump cannot rollback IRA tax credits because they were enacted by Congress. Yet Trump’s order to“immediately pause the disbursement of funds”from the IRA, including for EV infrastructure, guts the direct pay system and leaves corporations relatively unscathed. Public and nonprofit clean energy initiatives are most at risk because even a temporary pause in funding threatens the survival of those programs. Trump’s freeze on IRA grants has directly threatened several projects, not only for wind and solar but also for related climate goals: The $7 billionSolar for Allprogram, which supported states and nonprofits installing solar panels in low-income neighborhoods Environmental justice programs by nonprofits tosupport disaster recovery,monitor emissions, andexpand community solarin neighborhoods of color $1 billion inUSDA grantsto assist rural businesses and farms with transitioning to wind and solar, and upgrades for energy efficiency $400 million forbattery storage and rooftop solarin Harris County, TX, the largest county in the state (Houston is its seat) Programs of the Nevada Clean Energy Fund, anonprofit green bankcreated by state government, to expand clean energy to disadvantaged communities including tribes IRA-funded programs in Pennsylvania toreduce emissions from factories, andplug oil and gas wellsto stop methane leaks. While not a renewables program, grants for mitigation ensure that fossil fuels don’t offset the benefits of clean power. Some IRA funds were just partially un-frozen, such as forelectric school buses. But there will not be a back-to-normal scenario where innovative renewable projects become immune to Trump. He will continue to push the limits of executive power, and enlist Republicans in Congress, to limit the clean power projects of states and nonprofits. Grant-funded programs by states and nonprofits ensure that increases inrenewable power generation capacitycan be accessible to all communities, and achieve nationwide emissions reductions. Private sector renewables projects do not need to be expressly climate-focused to attract investors. In fact, corporations like CleanCapital (a solar and storage-focused company) have tried appealing to Trump by presenting themselves as job creators interested in“energy dominance.”The CEO of Montana Renewables (a subsidiary of manufacturing company Calumet)declared, “We don’t have to say climate change.” This is not a sign that renewables companies are being smart, but rather that they’re putting profit first, and climate action second. Leaving the energy mix up to the short-term decisions of companies leads tocoordination problemsthat could be solved by green subsidies. The IRA grants for states and nonprofits are not traditional subsidies, but they might change companies’ expectations of consumer demand, as well as state and local support for transmission infrastructure down the road. Trump has significantly limited the federal government’s ability to throw its weight behind renewables, and thereby convince fossil fuel companies to adjust their investment decisions. While projects like “Solar for All” and nonprofit “green banks” don’t appear to be market movers, these state/nonprofit projects could have spurred larger interventions. Renewables companies will undoubtedly reduce emissions just by providing their services, regardless of their intentions. But there is no free-market incentive for clean energy companies to try to replace fossil fuels. If they achieve sufficient returns on investment while coexisting with fossil fuels, they will happily cater to Trump’s visions of “energy dominance.” “Energy dominance” under Trump gives us no path to net-zero by 2050, and supposedly unstoppable market trends can’t get us there either. The near future of scattered renewables projects is akin to letting companies build roads without an ounce of urban planning to map things out. Renewables must be treated like civil infrastructure and receive the coordination and funding we expect in that sector. Multinationals like Siemens may continue to build turbines, but these investments will never result in net-zero absent substantial funding and planning outside the private sector. The projects most essential to long-term emissions reductions are not fromprivate equityor corporations acting alone. The outlook that “renewables will survive Trump” is incomplete because it only looks at clean energy from an investment angle, and not as an issue of infrastructure. FacebookShare TwitterTweet **A think tank for the develop­ment of an econ­omic system that serves the many, not the few.** People's Policy Project is supported by over 1,800 small donors pledging $5–15 per month. This funding source allows us to do our work without being compromised by the corporate money other think tanks rely on.Learn more. Supporton Patreon Supporton ActBlue Original analysis, delivered straight to your inbox. **Latest** Abundance Has a Theory of PowerI don't know why this is being so obfuscated. **Abundance Has a Theory of Power** I don't know why this is being so obfuscated. **Abundance Has a Theory of Power** I don't know why this is being so obfuscated. **Abundance Has a Theory of Power** I don't know why this is being so obfuscated. Is There Really an Epidemic of Workless Medicaid Recipients?A deep dive into the Survey of Income and Program Participation. **Is There Really an Epidemic of Workless Medicaid Recipients?** A deep dive into the Survey of Income and Program Participation. **Is There Really an Epidemic of Workless Medicaid Recipients?** A deep dive into the Survey of Income and Program Participation. **Is There Really an Epidemic of Workless Medicaid Recipients?** A deep dive into the Survey of Income and Program Participation. Success Sequence Followers Do Not Follow the Success SequenceMore on this fake thing. **Success Sequence Followers Do Not Follow the Success Sequence** More on this fake thing. **Success Sequence Followers Do Not Follow the Success Sequence** More on this fake thing. **Success Sequence Followers Do Not Follow the Success Sequence** More on this fake thing. The Employment of Young MenThe flimsiest of possible excuses for cutting Medicaid. **The Employment of Young Men** The flimsiest of possible excuses for cutting Medicaid. **The Employment of Young Men** The flimsiest of possible excuses for cutting Medicaid. **The Employment of Young Men** The flimsiest of possible excuses for cutting Medicaid. **Tagged** Climate **More inClimate** Natural Gas Is Destroying the Climate and Our LungsGas cooking and heating need to be phased out quickly.Jun 11th, 2020 **Natural Gas Is Destroying the Climate and Our Lungs** Gas cooking and heating need to be phased out quickly. **Natural Gas Is Destroying the Climate and Our Lungs** Gas cooking and heating need to be phased out quickly. **Natural Gas Is Destroying the Climate and Our Lungs** Gas cooking and heating need to be phased out quickly. Fining Corporations That Pollute Carbon Is Quite PopularOver two-thirds of Americans with an opinion support a carbon fine.Sep 28th, 2019 **Fining Corporations That Pollute Carbon Is Quite Popular** Over two-thirds of Americans with an opinion support a carbon fine. **Fining Corporations That Pollute Carbon Is Quite Popular** Over two-thirds of Americans with an opinion support a carbon fine. **Fining Corporations That Pollute Carbon Is Quite Popular** Over two-thirds of Americans with an opinion support a carbon fine. Bernie Sanders Raises the Bar on Climate Transfers to Global SouthAmong other things, Sanders proposes sending $200 billion to the UN Green Climate Fund.Aug 22nd, 2019 **Bernie Sanders Raises the Bar on Climate Transfers to Global South** Among other things, Sanders proposes sending $200 billion to the UN Green Climate Fund. **Bernie Sanders Raises the Bar on Climate Transfers to Global South** Among other things, Sanders proposes sending $200 billion to the UN Green Climate Fund. **Bernie Sanders Raises the Bar on Climate Transfers to Global South** Among other things, Sanders proposes sending $200 billion to the UN Green Climate Fund. Sanders Endorses “Green TVA” Approach to Green New DealSanders proposes a massive build out of publicly owned clean energy production.Aug 22nd, 2019 **Sanders Endorses “Green TVA” Approach to Green New Deal** Sanders proposes a massive build out of publicly owned clean energy production. **Sanders Endorses “Green TVA” Approach to Green New Deal** Sanders proposes a massive build out of publicly owned clean energy production. **Sanders Endorses “Green TVA” Approach to Green New Deal** Sanders proposes a massive build out of publicly owned clean energy production. **Subscribe to 3P** Keep up with our original analysis,delivered straight to your inbox. **A think tank for the dev­elopment of an economic system that serves the many, not the few.** People's Policy Project is supported by over 1,800 small donors pledging $5–15 per month. This funding source allows us to do our work without being compromised by the corporate money other think tanks rely on. Supporton Patreon Supporton ActBlue **© 2025 People’s Policy Project** Facebook Twitter RSS"}