{"id": 1917, "name": "Citizen Free Press", "domain": "citizenfreepress.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://citizenfreepress.com/column-2/citizen-free-press-passes-wsj-politico-and-breitbart-in-september-traffic-race/", "title": "Citizen Free Press Passes Wsj Politico And Breitbart In September Traffic Race", "content": "**Citizen Free Press dominates WSJ, Politico and Breitbart in October news traffic race…** Posted by Kane on October 1, 2021 1:25 amNEWS JUNKIES -- CHECK OUT OUR HOMEPAGE This is yourCitizen Free Press **Share:** Facebook Twitter Email Congratulations, love CFP, thanks Kane, you are doing an outstanding job. We are so proud of you, your wonderful headlines and intelligent selections. You give 110% to this enterprise! Thank you for posting the last Christmas Program of Rush Limbaugh. It was so refreshing to hear something so positive and hopeful. Outstanding Job !!!!!!!!!!!!!!! KANE! You Magnificent Bastard!!!!! I hate using the word bastard but you are the Patton of Free Press. Congrats. Just heard the Kane/Raheem Kassam interview. Awesome! Glad there are people out there digging for truth. Just 4 years ago nobody heard of Citizen Free Press.Now it’s one of the 10 leading news websites in AmericaStarted going to CFP in October 2020 Do this every month, please! AWESOME! This is PROOF the old USofA is still a very conservative country besides everything we hear about and is vomited by the woke MSM. CFP wins! Nicely Done. Wow! #5, Not bad Kane.Your continued determination is paying off.Keep it up and don’t look back. Congratulations!!!!!!!! Fruits of your labor. Congrats Kane! That is really awesome! CFP is the best! Plus, all the people that comment on here are pretty great, too. I don’t see the arguments like I do on some other sites I visit here and there. Keep up the great work! CONGRATS KANE ! Your tireless effort IS appreciated. No one else has a champagne room! Best site on the internet. Congrats Kane!! I wonder that myself. Kane you the man!!! Great job and keep up the good work, we are all with you and rooting for you! CAN WE ALL SHOUT… WINNNNNING BIGLY!!!KANE! KANE! KANE!🤩🤩🤩🤩🤩US! US! US! US! Congrats, Kane! Congratulations Kane! If I remember correctly you posted a chart with the “stickiness” of CFP a couple months ago. The people on this site spend more time here and interact with more stories than any other site out there. It would be nice to see that chart again. Awesome! Congrats! Keep up the good work! Good Work man News you can use …..🇺🇸🇺🇸🇺🇸True Patriots behind this !!! Thank you CFP! You are my #1 go to for accurate breaking news! I love my CFP👍🏼👍🏼👍🏼 Congrats Kane! CONGRATULATIONS Kane & Co – You’ve earned it! This is the first news page I pull up every day, numerous times a day! FWIW please put a donate button on your homepage…. I’m doing my part, multiple times a day.CFP is great!! FJB Congratulations!!! Accolades for Kane are well deserved and earned. We appreciate your hard work and dedication to the site and getting messages of truth out to the world. You are the G.O.A.T. Kane! And we all love ya !!! Congrats Kane! First read in the morning. Best aggregate for critical thinkers. After we beat back this round of communists, Kane needs another one of those Spain studying abroad trips. THANK YOU KANE! We will win this! Congrats Kane! Great achievement, keep up the good work. Yours is my go-to page every morning and several times a day. LOVE IT!! Spectacular growth and a testament to the hard work Kane puts in on this. Not to throw cold water, but I am concerned that 600MIL still visit the NYT. When that commie rag is down in the list, way down, I will rejoice! Congrats. The truth shall set us free. First I check my personal email, then CFP. Every morning. Congratulations CFP! 🎉🇺🇸🎉🇺🇸🎉🇺🇸 < CITIZEN FREE PRESS -- HOMEPAGE"}