{"id": 1940, "name": "Daily Signal", "domain": "dailysignal.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.dailysignal.com/2025/06/10/heritage-continues-battle-against-woke-corporations-sues-airbnb-for-excluding-proposal-to-depoliticize-company/", "title": "Heritage Continues Battle Against Woke Corporations Sues Airbnb For Excluding Proposal To Depoliticize Company", "content": "Featured Border China Congress Election Integrity Israel Podcasts Victor Davis Hanson Virginia Topics Economy Education Energy Health Care International Law Politics Security Society Must Reads Border China Congress Election Integrity Israel Podcasts Victor Davis Hanson Virginia PoliticsCommentary **New Jersey GOP Gubernatorial Nominee Eyes Judicial Openings and Targets Sanctuary Laws** Commentary **Ukraine’s Blitz Launches War in Dangerous New Direction** PoliticsNews **House Rescissions Seen as a Make-Or-Break Chance to Codify DOGE** PoliticsNews **Newsom’s Threat That California Might Withhold Federal Taxes Called ‘Reckless,’ ‘a New Low’** PoliticsNews **Trump’s Deportation Efforts Backed by Wide Margin, Poll Finds** PoliticsNews **Democrats Make Political Gamble by Supporting Sanctuary States** LawCommentary **What Governors Newsom and Faubus Have in Common** PoliticsNews **GOP Whip Emmer Blasts Tim Walz: ‘Challenged Human Being’** InternationalNews **Iran Turns to China for Ballistic Missile Materials as Nuclear Threat Grows** SecurityNews **FBI Says Chinese Nationals Smuggling Dangerous Biological Fungus Into US** EnergyNews **US Manufacturing Victim to ‘Giant Sucking Sound’ Created by China** InternationalNews **W.Va. Lawmaker Aims to Ban Chinese Nationals From Student Visas** PoliticsNews **House Rescissions Seen as a Make-Or-Break Chance to Codify DOGE** PoliticsNews **Newsom’s Threat That California Might Withhold Federal Taxes Called ‘Reckless,’ ‘a New Low’** PoliticsNews **House Panel’s Republicans, Democrats Concur on Scourge of Antisemitism, but Not on What to Do About It** PoliticsNews **Democrats Make Political Gamble by Supporting Sanctuary States** PoliticsNews **Federal Immigration Database Reveals How Many Noncitizens Potentially Voted in Texas** LawNews **Marc Elias Moves to Thwart Trump DOJ’s Litigation Over Alleged Voter Inaccuracies** PoliticsNews **Even Democrats in This Battleground State Back Voter ID. But There’s a Catch.** LawNews **Supreme Court to Take on Illinois Late Ballot Case With Far-Reaching Election Integrity Implications** PoliticsNews **House Panel’s Republicans, Democrats Concur on Scourge of Antisemitism, but Not on What to Do About It** InternationalNews **Trump Announces Trade Deal and Drops Plans to Revoke Chinese Student Visas** PoliticsNews **Greta Thunberg Should ‘Go to an Anger Management Class,’ Trump Says** EconomyNews **Heritage Foundation Sues Airbnb in Continuing Battle Against Politicized Corporations** PoliticsCommentary **WATCH: Kilmar Abrego Garcia Returns to Be Democrats’ Albatross** SocietyCommentary **In the Swim of Things, Is America Ditching LGBTQ for Traditional?** PoliticsCommentary **What Trump and Musk’s Feud Means for You** PoliticsCommentary **Victor Davis Hanson: Is the Age of American Empire Over or Just Beginning?** Commentary **Ukraine’s Blitz Launches War in Dangerous New Direction** Commentary **Biden Dismantled Basic Immigration Law. Now, Americans Are Suffering.** Commentary **Gavin Newsom’s ‘Reckless’ Surrender of LA to Foreign National Riots** EconomyCommentary **The Quiet Economic Boom of Trump 2.0** Health CareCommentary **Virginia’s Nursing Shortage Persists, but Targeted Strategies Have Brought Growth** EnergyCommentary **The ‘Californication’ of Virginia’s Power Grid Brings Increased Costs, Less Reliability** Health CareAnalysis **Virginia Researchers May Have Found Key to Alzheimer’s** SecurityCommentary **Virginia Municipalities Dispute Their ‘Sanctuary’ Designation** EconomyNews **Heritage Foundation Sues Airbnb in Continuing Battle Against Politicized Corporations** (Mario Tama via Getty Images) Carrie Sheffield Carrie Sheffield is the author of \"Motorhome Prophecies: A Journey of Healing and Forgiveness.” It’s well-documented that corporate America in recent years took a hard left turn, andThe Heritage Foundationcontinues to battle back and depoliticize business. Heritage fileda lawsuitagainst Airbnb earlier this month after the company excluded a Heritage proposal from its annual shareholder meeting. Heritage, an Airbnb shareholder, filed its proposal for the housing rental giant to reject politicized, antisemitic activist demands to divest from vendors in locations like Israel. Unfortunately, corporate America—even before the Oct. 7, 2023, Hamas attacks in Israel—started to fall captiveto the anti-Israel boycott, divestment, and sanctions movement. This lawsuit comes after a series of efforts in recent years by Heritage and other groups, including education, publicity, and pressure campaigns, to highlight the risks corporations face when ideology overtakes accountability. Heritage reports in its filing that it followed all requirements and time stipulations for submitting its shareholder proposal. Airbnb claims it never received the shareholder proposal packet, despite Heritage receiving a FedEx delivery receipt with the signature of an Airbnb employee confirming delivery. Airbnb refuses all knowledge of the proposal and—shockingly—even suggested FedEx forged the signature of its own employee who confirmed delivery. Heritage filed the lawsuit together with American Conservative Values ETF, another shareholder of Airbnb, which also submitted a proposal that Airbnb excluded. Heritage is represented by Boyden Gray and American Conservative Values ETF is represented by Alliance Defending Freedom. “Airbnb broke the law—plain and simple. [Securities and Exchange Commission] rules require companies to notify shareholders and allow a response if a proposal is excluded,” Andrew Olivastro, chief advancement officer at The Heritage Foundation,said in a statement. “Airbnb ignored those rules and ignored the law. It makes you wonder what other legal corners Airbnb may have cut. Heritage and ADF are suing to make one thing clear: shareholder rights aren’t subject to mood or politics—they’re protected by law.” Under SEC regulations, Airbnb is required to include proposals in its materials for its annual shareholder meeting—unless the company notifies those submitting the proposals that the materials will be excluded, provides reasons for its exclusion, and gives filing shareholders a chance to respond. Airbnb did not notify Heritage of its proposal’s exclusion or allow Heritage to take any action. Airbnb did, however, include a proposal from Connecticut Retirement Plans and Trust Funds, a liberal-leaning fund that openly supports initiatives like the environmental, social, and governance scorecard for “socially conscious” investing. This appears to be blatant viewpoint discrimination by Airbnb. The December proposal submitted by Heritage highlighted the fact that Airbnb caved to antisemitic political demands in the past—including its announcement in 2018 to remove 200 “Israeli settlements in the occupied West Bank,” noting strong views of “historic and intense disputes between Israelis and Palestinians in the West Bank” from those who “believe companies should not profit on lands where people have been displaced.” While Airbnb reversed its decision a year later, the precedent for caving to political demands had been set. When the exclusion of the proposals was brought to Airbnb’s attention in April, the company refused to include it in materials for its June meeting, nor would the company agree to include the proposal in materials for the 2026 meeting. Heritage works closely with the State Financial Officers Foundation, where I previously served as an economic research fellow. Heritageawarded Innovation Prizesto the foundation, Alliance Defending Freedom, and others, including the Independent Women’s Forum, to fight woke capitalism. The State Financial Officers Foundation is a coalition of 39 financial leaders from 28 states. During the Biden administration, the groupmarshaled its market muscle—roughly $3 trillion in public assets under management—to force banks and other financial institutions to quit targeting conservatives and imposing far-left ideologies on taxpayers. The goal of these efforts is to restore objectivity and neutrality to business. By calling for transparency and fairness, Heritage and its partners are rallying Americans to demand that businesses prioritize merit, ethics and unity over divisive, politicized agendas. Now it’s time for the court of law to enact justice toward this end. Carrie Sheffield is a senior policy analyst for the Center for Economic Opportunity atIndependent Women’s Forum. We publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal. **Related posts:** Why Jews Need Their Christian Allies More Than Ever Trump Administration Targets Harvard in Crackdown on Campus Antisemitism ‘Will Not Surrender’: Harvard Scoffs at Trump Admin’s Demands to Address Antisemitism **Read the first chapter ofThe Woketopusright now for FREE** Today, even with President Trump’s victory, leftist elites have their tentacles in every aspect of our government. The Daily Signal’s own Tyler O’Neil exposes this leftist cabal in his new book,The Woketopus: The Dark Money Cabal Manipulating the Federal Government. In this book, O’Neil reveals how the Left’s NGO apparatus pursues its woke agenda, maneuvering like an octopus by circumventing Congress and entrenching its interests in the federal government. You can read the first chapter of this new book for FREE in this eBook,The Woketopus: Chapter One using the secure link below. Twitter Facebook LinkedIn Email Print About Our Story Authors Careers Get In Touch Contact Us Submissions Corrections Podcasts The Tony Kinnett Cast Problematic Women The Signal Sitdown The Daily Signal Podcast © 2025 The Daily Signal Media Group, Inc. All rights reserved. We use cookies on our website. By using our website, you consent to cookies.Learn More."}