{"id": 764, "name": "Knight Foundation", "domain": "knightfoundation.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://knightfoundation.org/press/releases/charlene-bradley-joins-knight-foundation-as-program-director-in-st-paul-bringing-expertise-in-community-development-and-strategic-leadership/", "title": "Charlene Bradley Joins Knight Foundation As Program Director In St Paul Bringing Expertise In Community Development And Strategic Leadership", "content": "**Knight Foundation** Programs Newsroom Research Events About ProgramsJournalismCommunitiesArtsInformation and Society Journalism Communities Arts Information and Society Journalism Communities Arts Information and Society Our CommunitiesAkronCharlotteDetroitMaconMiamiPhiladelphiaSan JoseSt. PaulCommunity Foundations Program Akron Charlotte Detroit Macon Miami Philadelphia San Jose St. Paul Community Foundations Program Akron Charlotte Detroit Macon Miami Philadelphia San Jose St. Paul Community Foundations Program NewsroomArticlesPress ReleasesSpeeches Articles Press Releases Speeches Articles Press Releases Speeches TopicsArts and TechnologyDiverse Asset ManagersElections and VotingFreedom of ExpressionKnight Research NetworkLibrariesLocal JournalismPublic SpacesSmart CitiesTechnology and DemocracyTrust in News Arts and Technology Diverse Asset Managers Elections and Voting Freedom of Expression Knight Research Network Libraries Local Journalism Public Spaces Smart Cities Technology and Democracy Trust in News Arts and Technology Diverse Asset Managers Elections and Voting Freedom of Expression Knight Research Network Libraries Local Journalism Public Spaces Smart Cities Technology and Democracy Trust in News Research GrantsFunding Opportunities Funding Opportunities Funding Opportunities Events AboutBoard of TrusteesStaffHistoryJobsInternship ProgramFinancial InformationContact Board of Trustees Staff History Jobs Internship Program Financial Information Contact Board of Trustees Staff History Jobs Internship Program Financial Information Contact **Charlene Bradley joins Knight Foundation as Program Director in St. Paul, bringing expertise in community development and strategic leadership** Facebook Twitter LinkedIn Email ST. PAUL– The John S. and James L. Knight Foundation announced the appointment of Charlene Bradley as Director in St. Paul. A seasoned corporate executive with over 20 years of experience in organizational development, change management and operational strategy, Bradley brings a deep expertise in driving sustainable business growth. Since 2000, Knight Foundation has invested more than $50 million in St. Paul, focusing on downtown revitalization and supporting local entrepreneurship. A St. Paul native, Bradley previously held senior leadership roles at Target Corporation, where she spearheaded initiatives to strengthen community connections and support local development. During her tenure at Thomson Reuters, she led technology-driven efforts to optimize business operations, driving efficiency and enhancing internal collaboration. Her dedication to service and commitment to building meaningful partnerships have been evident throughout her career, and her customer-focused approach to investment will shape Knight’s work in St. Paul. “Charlene brings a rare blend of strategic vision, operational excellence and deep community understanding,” said Kelly Jin, Knight Foundation’s Chief of Staff and Vice President for Communities. “Her leadership reflects the kind of thoughtful, locally grounded approach we believe drives lasting change. I’m thrilled to see what her partnership with the community will unlock.” Recently in St. Paul, Knight Foundation has invested $1,000,000 in ReConnect Rondo, growing community engagement efforts and organizational capacity to revitalize the historic Rondo community. Knight Foundation has also supported the Greater River Passage Conservancy’s plan to activate and reconnect the Mississippi waterfront with downtown and the St. Paul Downtown Alliance to establish a downtown development corporation. Reflecting on her new role at Knight Foundation, Bradley shared her excitement: “St. Paul is a city rich with history, culture and community spirit. I am eager to collaborate with local partners and residents to amplify the ideas and initiatives that make our community stronger and more connected.” Bradley emphasized that her approach will focus on fostering meaningful partnerships and leveraging local insights to create sustainable impact. “I believe that listening to community voices and building on existing strengths are key to making a lasting difference. I’m committed to ensuring that our efforts reflect the aspirations of St. Paul’s residents,” she added. About Knight Foundation We are social investors who support a more effective democracy by funding free expression and journalism, arts and culture in community, research in areas of media and democracy, and the success of American cities and towns where the Knight brothers once published newspapers. Contact Terms Privacy Subscribe FAQ Facebook Twitter Instagram Vimeo Copyright © 2006-2025 John S. and James L. Knight Foundation. Other copyrights apply where noted.This work is licensed under a Creative Commons Attribution-NonCommercial 4.0 International License."}