{"id": 902, "name": "Metro", "domain": "metro.us", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.metro.us/knicks-head-coach-search-hitting-continuous-roadblocks/", "title": "Knicks Head Coach Search Hitting Continuous Roadblocks", "content": "Home Pros JobsNew York CityPhiladelphia New York City Philadelphia New York City Philadelphia NewsPhillyNew YorkAllEntertainmentLifestyleSports Philly New York All Entertainment Lifestyle Sports Philly New York All Entertainment Lifestyle Sports Things to DoEvents in New YorkEvents in PhiladelphiaBusiness EventsGames Events in New York Events in Philadelphia Business Events Games Events in New York Events in Philadelphia Business Events Games Contact Us Webinars Podcasts Home Pros JobsNew York CityPhiladelphia New York City Philadelphia New York City Philadelphia NewsPhillyNew YorkAllEntertainmentLifestyleSports Philly New York All Entertainment Lifestyle Sports Philly New York All Entertainment Lifestyle Sports Things to DoEvents in New YorkEvents in PhiladelphiaBusiness EventsGames Events in New York Events in Philadelphia Business Events Games Events in New York Events in Philadelphia Business Events Games Contact Us Webinars Podcasts Home Pros JobsNew York CityPhiladelphia New York City Philadelphia New York City Philadelphia NewsPhillyNew YorkAllEntertainmentLifestyleSports Philly New York All Entertainment Lifestyle Sports Philly New York All Entertainment Lifestyle Sports Things to DoEvents in New YorkEvents in PhiladelphiaBusiness EventsGames Events in New York Events in Philadelphia Business Events Games Events in New York Events in Philadelphia Business Events Games Contact Us Webinars Podcasts Search: Jobs New York City Philadelphia News Philly New York All Entertainment Lifestyle Sports Things to Do Events in New York Events in Philadelphia Business Events Games Home Pros Contact Us Webinars Podcasts **Knicks’ head coach search hitting continuous roadblocks** The rest of the NBA is not making the New York Knicks’ search for their next head coach any easier.Team president Leon Rose requested a formal interview with Dallas Mavericks head coach Jason Kidd, but was denied by the Western Conference team, as first reported byESPN’sShams Charania.Reports had surfaced in recent days that there was mutual interest between Kidd and the Knicks, which at least offered a glimmer of hope for the franchise after firing Tom Thibodeau just days after its elimination from the Eastern Conference Finals by the Indiana Pacers.Instead, Kidd is now added to the growing list of head coaches who have not been allowed to interview with the Knicks by their current teams, one that already includes Minnesota Timberwolves head coach Chris Finch and Houston Rockets head coach Ime Udoka.CloseGet the Full StoryNews, events, culture and more — delivered to you.Thank you for subscribing!EmailSign UpFormer Villanova head coach Jay Wright, who helped develop Jalen Brunson, Josh Hart, and Mikal Bridges, has already made it known that he does not want to come out of retirement. UConn’s Dan Hurley responded to a question about the Knicks’ vacant position with, “Not another summer of that,” after he was linked to the Los Angeles Lakers’ job last summer.If Kidd, Finch, and Udoka were plans A, B, and C, the Knicks will now have to pivot with some haste, considering they have yet to interview a single candidate.They could be waiting for the NBA Finals to wrap up for an opportunity to speak with Oklahoma City Thunder lead assistant Dave Bliss, but there has to be much more due diligence than that.Former Nuggets head coach Michael Malone, a Queens native and former Knicks assistant, does not appear to be a candidate for the job. Veteran coach Mike Brown, former Lakers and Kings coach Luke Walton, and former Bucks head coach Mike Budenholzer are available. Both he and Malone won championships in the last five years. James Borrego and Kenny Atkinson are former head coaches who are currently working as assistants, too.The options are out there, but the radio silence coming from the Knicks’ search is deafening two weeks in.For more on the Knicks, visitAMNY.com Team president Leon Rose requested a formal interview with Dallas Mavericks head coach Jason Kidd, but was denied by the Western Conference team, as first reported byESPN’sShams Charania. Reports had surfaced in recent days that there was mutual interest between Kidd and the Knicks, which at least offered a glimmer of hope for the franchise after firing Tom Thibodeau just days after its elimination from the Eastern Conference Finals by the Indiana Pacers. Instead, Kidd is now added to the growing list of head coaches who have not been allowed to interview with the Knicks by their current teams, one that already includes Minnesota Timberwolves head coach Chris Finch and Houston Rockets head coach Ime Udoka. **Get the Full Story** Former Villanova head coach Jay Wright, who helped develop Jalen Brunson, Josh Hart, and Mikal Bridges, has already made it known that he does not want to come out of retirement. UConn’s Dan Hurley responded to a question about the Knicks’ vacant position with, “Not another summer of that,” after he was linked to the Los Angeles Lakers’ job last summer. If Kidd, Finch, and Udoka were plans A, B, and C, the Knicks will now have to pivot with some haste, considering they have yet to interview a single candidate.They could be waiting for the NBA Finals to wrap up for an opportunity to speak with Oklahoma City Thunder lead assistant Dave Bliss, but there has to be much more due diligence than that.Former Nuggets head coach Michael Malone, a Queens native and former Knicks assistant, does not appear to be a candidate for the job. Veteran coach Mike Brown, former Lakers and Kings coach Luke Walton, and former Bucks head coach Mike Budenholzer are available. Both he and Malone won championships in the last five years. James Borrego and Kenny Atkinson are former head coaches who are currently working as assistants, too.The options are out there, but the radio silence coming from the Knicks’ search is deafening two weeks in.For more on the Knicks, visitAMNY.com They could be waiting for the NBA Finals to wrap up for an opportunity to speak with Oklahoma City Thunder lead assistant Dave Bliss, but there has to be much more due diligence than that.Former Nuggets head coach Michael Malone, a Queens native and former Knicks assistant, does not appear to be a candidate for the job. Veteran coach Mike Brown, former Lakers and Kings coach Luke Walton, and former Bucks head coach Mike Budenholzer are available. Both he and Malone won championships in the last five years. James Borrego and Kenny Atkinson are former head coaches who are currently working as assistants, too.The options are out there, but the radio silence coming from the Knicks’ search is deafening two weeks in.For more on the Knicks, visitAMNY.com Former Nuggets head coach Michael Malone, a Queens native and former Knicks assistant, does not appear to be a candidate for the job. Veteran coach Mike Brown, former Lakers and Kings coach Luke Walton, and former Bucks head coach Mike Budenholzer are available. Both he and Malone won championships in the last five years. James Borrego and Kenny Atkinson are former head coaches who are currently working as assistants, too. The options are out there, but the radio silence coming from the Knicks’ search is deafening two weeks in.For more on the Knicks, visitAMNY.com Team president Leon Rose requested a formal interview with Dallas Mavericks head coach Jason Kidd, but was denied by the Western Conference team, as first reported byESPN’sShams Charania. Reports had surfaced in recent days that there was mutual interest between Kidd and the Knicks, which at least offered a glimmer of hope for the franchise after firing Tom Thibodeau just days after its elimination from the Eastern Conference Finals by the Indiana Pacers. Instead, Kidd is now added to the growing list of head coaches who have not been allowed to interview with the Knicks by their current teams, one that already includes Minnesota Timberwolves head coach Chris Finch and Houston Rockets head coach Ime Udoka. **Get the Full Story** Former Villanova head coach Jay Wright, who helped develop Jalen Brunson, Josh Hart, and Mikal Bridges, has already made it known that he does not want to come out of retirement. UConn’s Dan Hurley responded to a question about the Knicks’ vacant position with, “Not another summer of that,” after he was linked to the Los Angeles Lakers’ job last summer. If Kidd, Finch, and Udoka were plans A, B, and C, the Knicks will now have to pivot with some haste, considering they have yet to interview a single candidate.They could be waiting for the NBA Finals to wrap up for an opportunity to speak with Oklahoma City Thunder lead assistant Dave Bliss, but there has to be much more due diligence than that.Former Nuggets head coach Michael Malone, a Queens native and former Knicks assistant, does not appear to be a candidate for the job. Veteran coach Mike Brown, former Lakers and Kings coach Luke Walton, and former Bucks head coach Mike Budenholzer are available. Both he and Malone won championships in the last five years. James Borrego and Kenny Atkinson are former head coaches who are currently working as assistants, too.The options are out there, but the radio silence coming from the Knicks’ search is deafening two weeks in.For more on the Knicks, visitAMNY.com They could be waiting for the NBA Finals to wrap up for an opportunity to speak with Oklahoma City Thunder lead assistant Dave Bliss, but there has to be much more due diligence than that.Former Nuggets head coach Michael Malone, a Queens native and former Knicks assistant, does not appear to be a candidate for the job. Veteran coach Mike Brown, former Lakers and Kings coach Luke Walton, and former Bucks head coach Mike Budenholzer are available. Both he and Malone won championships in the last five years. James Borrego and Kenny Atkinson are former head coaches who are currently working as assistants, too.The options are out there, but the radio silence coming from the Knicks’ search is deafening two weeks in.For more on the Knicks, visitAMNY.com Former Nuggets head coach Michael Malone, a Queens native and former Knicks assistant, does not appear to be a candidate for the job. Veteran coach Mike Brown, former Lakers and Kings coach Luke Walton, and former Bucks head coach Mike Budenholzer are available. Both he and Malone won championships in the last five years. James Borrego and Kenny Atkinson are former head coaches who are currently working as assistants, too. The options are out there, but the radio silence coming from the Knicks’ search is deafening two weeks in.For more on the Knicks, visitAMNY.com They could be waiting for the NBA Finals to wrap up for an opportunity to speak with Oklahoma City Thunder lead assistant Dave Bliss, but there has to be much more due diligence than that.Former Nuggets head coach Michael Malone, a Queens native and former Knicks assistant, does not appear to be a candidate for the job. Veteran coach Mike Brown, former Lakers and Kings coach Luke Walton, and former Bucks head coach Mike Budenholzer are available. Both he and Malone won championships in the last five years. James Borrego and Kenny Atkinson are former head coaches who are currently working as assistants, too.The options are out there, but the radio silence coming from the Knicks’ search is deafening two weeks in.For more on the Knicks, visitAMNY.com Former Nuggets head coach Michael Malone, a Queens native and former Knicks assistant, does not appear to be a candidate for the job. Veteran coach Mike Brown, former Lakers and Kings coach Luke Walton, and former Bucks head coach Mike Budenholzer are available. Both he and Malone won championships in the last five years. James Borrego and Kenny Atkinson are former head coaches who are currently working as assistants, too. The options are out there, but the radio silence coming from the Knicks’ search is deafening two weeks in.For more on the Knicks, visitAMNY.com Former Nuggets head coach Michael Malone, a Queens native and former Knicks assistant, does not appear to be a candidate for the job. Veteran coach Mike Brown, former Lakers and Kings coach Luke Walton, and former Bucks head coach Mike Budenholzer are available. Both he and Malone won championships in the last five years. James Borrego and Kenny Atkinson are former head coaches who are currently working as assistants, too. The options are out there, but the radio silence coming from the Knicks’ search is deafening two weeks in.For more on the Knicks, visitAMNY.com **About the Author** **More inNew York** Legal team for alleged crypto torturers in Soho say victim was ‘having the time of his life’ Kevin Durant trade rumors:Conflictingreports have Knicks on fringe ofsweepstakes Solidarity PAC launches 2025 NYC voter guide for Democratic primary; ranks Cuomo, opposes Mamdani Massive anti-Trump protests planned in NYC for national ‘No Kings Day’ **Jobs in New York** MDG Design & Construction LLCM/WBE Job Opportunity Susquehanna Printing CompanySales Account Manager GreenMax Capital GroupAdministrative/Bookeeping Assistant for Park Slope/ Gowanus climate action company **Things to do in NYC** Post an Event **THE MUSEUM OF MODERN ART PRESENTS Rosa Barba: The Ocean of One’s Pause MAY 3 – JULY 6, 2025The Museum of Modern Art** **Anne Frank The ExhibitionCenter for Jewish History** **Van Gogh’s FlowersNew York Botanical Garden** **Shaping American Art: A Celebration of the Art Students League of New York at 150Arts Students League** **Speakeasy, Die Softly: Immersive Murder Mystery Dinner Theater at Carmine’sCarmine’s Italian Restaurant – Times Square** **Smooth Voice ProjectionsRipley Grier Studios** View All Events… **Sports** Report: Sixers, Tyrese Maxey meet with top prospect VJ Edgecombe Kevin Durant trade rumors:Conflictingreports have Knicks on fringe ofsweepstakes USMNT readies for Gold Cup, the finalcompetitionbefore World Cup 2026, looking for its grit anddetermination Eagles Rumors: Does Vic Fangio have his eyes set on a prized free agent? Knicks’ head coach search hitting continuous roadblocks **News** Legal team for alleged crypto torturers in Soho say victim was ‘having the time of his life’ Solidarity PAC launches 2025 NYC voter guide for Democratic primary; ranks Cuomo, opposes Mamdani Philly police clash with anti-ICEprotesters,asimmigrationdemonstrationsspread Massive anti-Trump protests planned in NYC for national ‘No Kings Day’ Dead toddler found near Whitestone Bridge believed to be missing Bronx boy, police sources say **Sign up for our daily newsflashes** Subscribe **More from our Sister Sites** **Tribeca Film Festival rolls out more than two dozenqueer movies** **Vybz Kartel’s hype man MC Nuffy signs NJ reggae artist to exclusivebooking deal** **Invested in NYC: Citizens Bank’s Vision for Business and Community with RebeccaO’Connell** **MLB Over/Under Bet of the Day: June 13, Royalsvs Giants** **Don’t miss a beat** Sign up for our daily news explosion. **Home Pros** **Home Pros** **Things to do in NYC** **Things to do in NYC** Calendar MetroBet MetroPlay Games Jobs Contact Us Advertise © 2025 Schneps Media Privacy Policy Terms of Use Sections NY Edition Philly Games Advertise Sign Up"}