{"id": 1989, "name": "Hello Magazine", "domain": "hellomagazine.com", "bias": "center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.hellomagazine.com/celebrities/836832/katie-holmes-looks-radiant-in-latest-outing-after-receiving-exciting-news-close-to-her-heart/", "title": "Katie Holmes Looks Radiant In Latest Outing After Receiving Exciting News Close To Her Heart", "content": "UK USA Canada Australia CelebritiesCelebrity babiesCelebrity couples Celebrity babies Celebrity couples Celebrity babies Celebrity couples RoyaltyKing Charles IIIQueen ConsortKate MiddletonMeghan MarklePrince WilliamPrince HarryPrince GeorgePrincess CharlottePrince LouisBritish Royals King Charles III Queen Consort Kate Middleton Meghan Markle Prince William Prince Harry Prince George Princess Charlotte Prince Louis British Royals King Charles III Queen Consort Kate Middleton Meghan Markle Prince William Prince Harry Prince George Princess Charlotte Prince Louis British Royals U.S. FashionTrending FashionCelebrity StyleRoyal Style Trending Fashion Celebrity Style Royal Style Trending Fashion Celebrity Style Royal Style LifestyleMenopauseHomesFoodWeddingsParentingSafer SpacesSecond ActHealth & FitnessTravelPlanet PositiveHELLO! London Menopause Homes Food Weddings Parenting Safer Spaces Second Act Health & Fitness Travel Planet Positive HELLO! London Menopause Homes Food Weddings Parenting Safer Spaces Second Act Health & Fitness Travel Planet Positive HELLO! London BeautyMakeupSkincareHair Makeup Skincare Hair Makeup Skincare Hair EntertainmentTV & FilmMusicPodcasts TV & Film Music Podcasts TV & Film Music Podcasts HappinessHELLO! HappinessEmpowerment HELLO! Happiness Empowerment HELLO! Happiness Empowerment ShoppingGet the LookBeauty ProductsSalesAmazon Must Haves Get the Look Beauty Products Sales Amazon Must Haves Get the Look Beauty Products Sales Amazon Must Haves LUXE Home Celebrity News **Katie Holmes looks radiant in latest outing after receiving exciting news close to her heart** **The Old Town actress looked incredible at the Tony Awards** Katie Holmeswas all smiles as she graced the red carpet at the 78th Annual Tony Awards on Sunday, June 8, lighting up New York City's Radio City Music Hall with her elegant, offbeat glamour. The 46-year-old actress made a rare public appearance following the exciting news that her Broadway show, Our Town, had received a coveted Tony nomination. Dressed in a vibrant emerald satin blouse paired with a pastel pink beaded column skirt,Katiegave a masterclass in playful sophistication. Suri Cruise closes chapter that will please mom Katie Holmes Katie Holmes embraces the dark side with edgy new look Her look, which fans lovingly dubbed her \"Elphaba meets Glinda\" moment, was completed with a sleek updo and subtle jewels, allowing the bold colour contrast to take centre stage. Katie's return to Broadway as Mrs. Webb in Our Town has been met with widespread acclaim, and now with the show up for Best Revival of a Play, it marks a full-circle moment in the actress’s career. Speaking about the nomination, Katie couldn’t hide her delight. \"I am so grateful for our Our Town family and so very excited that Our Town was nominated for a Tony this morning,\" she wrote in a heartfelt Instagram post. \"What an honour.\" Joining her in the celebrated cast were Zoe Deutch and Jim Parsons, both of whom attended the awards ceremony alongside Katie. The revival has struck a chord with audiences and critics alike, competing this year against Yellow Face, Romeo + Juliet, and Eureka Day. Katie, who also presented an award during the ceremony, has openly shared how much this role has meant to her. When the production wrapped in January, she commemorated the end of the run by signing a piece of wood in her dressing room at the Ethel Barrymore Theatre. She captioned the photo of her farewell note with: \"Dressing room farewell.\" Adding an extra layer of meaning to her Broadway stint, Katie’s daughter Suri Cruise, now 19, flew home from university to see her mom perform—attending multiple shows, including on Katie’s birthday last December. The mother-daughter duo share a famously close bond, and Katie was visibly moved when Suri and the Our Town cast surprised her with a birthday serenade backstage. \"Love you all,\" Katie captioned the video of the touching moment. Suri, who graduated from LaGuardia High School in 2024—alma mater to the likes of Jennifer Aniston and Liza Minnelli—is now studying at Carnegie Mellon University. Katie, ever the proud mom, opened up to Town & Country about the bittersweet transition. \"Of course, I will miss the close proximity,\" she said of her daughter leaving for college. \"But I'm really proud of her and I'm happy.\" **Join HELLO! Daily and get the latest celebrity news, exclusive interviews, and top stories** By entering your details, you are agreeing to HELLO! Magazine UserData Protection Policy. You can unsubscribe at any time. For more informationplease click here. Katie Holmes About Us Advertising Contact FAQs Subscription T&Cs Topics Index Disclaimers Cookies Policy Whistleblowing channel Privacy Policy Notification Settings Competition terms Editorial Guidelines HELLO!’S APPLICANT PRIVACY POLICY Careers Product Review Guidelines"}