{"id": 1702, "name": "Daily Grail", "domain": "dailygrail.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.dailygrail.com/2025/04/forbidden-sketches-hand-drawn-artwork-inspired-by-the-published-journals-of-jacques-vallee-vol-6-part-4/", "title": "Forbidden Sketches Hand Drawn Artwork Inspired By The Published Journals Of Jacques Vallee Vol 6 Part 4", "content": "CategoriesAlien NationArtComputer GamesConspiranoiaCryptozoologyDarkloreForteanaFresh ScienceHidden HistoryHumanity PlusInformationMagick CircleMind MysteriesMusicMyths and FolkloreNews BriefsReligion & SpiritualitySacred SitesShamanismSkepticismSpeculative FictionSpirit WorldStraight ScienceTV and Movies Alien Nation Art Computer Games Conspiranoia Cryptozoology Darklore Forteana Fresh Science Hidden History Humanity Plus Information Magick Circle Mind Mysteries Music Myths and Folklore News Briefs Religion & Spirituality Sacred Sites Shamanism Skepticism Speculative Fiction Spirit World Straight Science TV and Movies Alien Nation Art Computer Games Conspiranoia Cryptozoology Darklore Forteana Fresh Science Hidden History Humanity Plus Information Magick Circle Mind Mysteries Music Myths and Folklore News Briefs Religion & Spirituality Sacred Sites Shamanism Skepticism Speculative Fiction Spirit World Straight Science TV and Movies Contact **Forbidden Sketches: Hand-Drawn Artwork Inspired by the Published Journals of Jacques Vallée (Vol. 6/Part 4)** Greetings, Coppertops! It is time to sayAu Revoirto the‘Forbidden Sketches’, as we are about to cover the last few images left which were inspired by Jacques Vallée’sForbidden Science Vol. 6.I hope this silly little project of mine managed to entertain you, but above all I wish it encouraged you to grab a copy of Vallée’s wonderful memoirs, which are not only required reading for any serious student of ufology, but also a truly inspiring life lesson from a man who traveled far and wide through many sojourns—some through the varied landscapes of our world, and others through landscapes of the imagination which allow you to get glimpses from theGreat Beyond. As for me, reading the Forbidden Science journals allowed me to get a glimpse of Vallée as a man enamored with the passion for discovery, and the intelligence to appreciate the beauty in life, despite the many horrors he witnessed—one Great War, the shadow of nuclear annihilation, Vietnam, 9/11 and the War on Terror, etc— and the personal sorrows he endured. This is greatly illustrated by his great love for classical music—particularly what we would call ‘sacred’ or religiously inspired—and his interest inmedieval stained glass art, which inspired him to learn it as a personal hobby with some of the great Masters which have preserved this ancient craft to this day. As he writes inFS Vol. 5: The aesthetic shock I feel whenever I look at Chartres has two powerful causes: sheer admiration and empathy for the achievement of the craftsmen who dedicated their lives to such marvels in the primitive conditions of a rugged era and, more importantly, the realization that the glass, interposed between man and the unknown, or rather the unknowable splendor of the sky, acts as a translator, a compiler of infinities, a mediator, a vector for the soul. Reading that passage, while keeping in mind Jacques’s trajectory as a cybernetic scientist, made me realize that stained glass and a computer microchip arebasically made of the same material. And both technologies, though separated by centuries of technological development, are nonetheless connected by a common purpose ofstoring knowledge—either by artistic symbolism, or the efficient 0s and 1s of our digital era. Not only that, but thanks to the work of Vallée and his colleagues who developedArpanet(the precursor to the modern Internet) that knowledge can now be shared with the masses, just like the stained glass windows of the great European cathedrals were designed to transmit their message to all the visitors who made the pilgrimage inside these magical vectors oftransfigured light. Here in lies the often forgotten common link between Art and Science:Both are meant to transform humans from within—and perhaps,thatis also the ultimate purpose behind the UFO mystery as well… But enough with the philosophical meanderings. You came here to see some funny pictures, so here they are. Oh, and remember the images are meant to represent my own personal opinion, and no one else’s. Enjoy! Vallée managed to end his journals on a positive note, and a heeding to those who will come after him:There is still time. Donotjust sit around waiting for‘Disclosure’, when you could use what little precious time you have on this Earth searching for answers by yourself! Chances are you’ll end up with evenmorequestions than when you first started; but if you do, then that meansyou did it right. **Forbidden Sketches: Hand-Drawn Artwork Inspired by the Published Journals of Jacques Vallée (Vol. 6/Part 2)** **Not So (Go)Fast! UAP Government Office Presents Analysis of Navy Video** **Leave a ReplyCancel reply** You must belogged into post a comment. This site uses Akismet to reduce spam.Learn how your comment data is processed. **Recent articles** **How to Investigate UFOs Using Science—and Magic** **The Mirror of Your Dreams: Review of Fourth Wall Phantoms, by Joshua Cutchin** **The Sci-Fi Delusions of the Tech Billionaires: A Review of Adam Becker’s ‘More Everything Forever’** We are also on Mastodon, come join us! Copyright Daily Grail Publishing - All rights reserved CategoriesAlien NationArtComputer GamesConspiranoiaCryptozoologyDarkloreForteanaFresh ScienceHidden HistoryHumanity PlusInformationMagick CircleMind MysteriesMusicMyths and FolkloreNews BriefsReligion & SpiritualitySacred SitesShamanismSkepticismSpeculative FictionSpirit WorldStraight ScienceTV and Movies Alien Nation Art Computer Games Conspiranoia Cryptozoology Darklore Forteana Fresh Science Hidden History Humanity Plus Information Magick Circle Mind Mysteries Music Myths and Folklore News Briefs Religion & Spirituality Sacred Sites Shamanism Skepticism Speculative Fiction Spirit World Straight Science TV and Movies Alien Nation Art Computer Games Conspiranoia Cryptozoology Darklore Forteana Fresh Science Hidden History Humanity Plus Information Magick Circle Mind Mysteries Music Myths and Folklore News Briefs Religion & Spirituality Sacred Sites Shamanism Skepticism Speculative Fiction Spirit World Straight Science TV and Movies Contact **ROBOTS SUBSCRIPTION**"}