{"id": 2195, "name": "Alternative Science", "domain": "alternative-science.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://alternative-science.com/nasa-confirms-in-space-reverse-cowgirl-and-doggystyle-same-thing/", "title": "Nasa Confirms In Space Reverse Cowgirl And Doggystyle Same Thing", "content": "Latest Popular Hot Trending Follow us facebook twitter instagram pinterest youtube byDan BroadbentinSpace **NASA confirms: In space, ‘reverse cowgirl’ and ‘doggystyle’ are the same thing** **In a press conference today, administrators at NASA announced the much-anticipated results of recent research on the International Space Station into definitions of different sexual positions in space.** CAPE CANAVERAL, FL –In a press conference today, administrators at NASA announced the much-anticipated results of recent research on the International Space Station into definitions of different sexual positions in space. For decades, researchers pondered how humans will have sex in space, and what the future of sexting will be once humans are living for extended periods of time without gravity. To help investigate this, Congress allocated $5 million in the 2018 budget specifically for research into how humans will have sex in space. “I spent a year on the thing, and you get lonely sometimes,” said astronaut Kelly Scott. “So I was excited to hear that we’d finally be getting some action!” The results of the study were published today in the journalNature: Astronomy. The astronauts started off simple with their experiment, with the basic “Missionary” sexual position. But it quickly became clear that the “basic” positions were a bit different while in space. “It was hard to decide who was on top and who was on bottom” said Kelly. “Since there’s no gravity, there’s no up or down, which means it’s really a matter of interpretation. So we just called it ‘Schrodinger’s Missionary’ instead.” The same issue came up when the astronauts went with more exotic positions, such as “doggystyle” and “reverse cowgirl.” “It was hard to decide what was going on. I mean, I got behind her, but we couldn’t decide which position we were trying.” The astronauts completed an exhaustive list of common and uncommon sexual positions, ranging from reverse cowgirl to the Panamanian Petting Zoo, all the way to the Alabama Hot Pocket. NASA insisted toAlternative-Science.comthat this was “important research,” adding that it was “groundbreaking.” Barr Writes Four Page Summary of Book of Genesis Exonerating God for Great Flood The International Space Station flies through space at a blistering pace of 17,000 miles per hour in order to stay in orbit just 200 miles above the Earth. On clear nights, you can see the station flying overhead. **Share this:** Click to share on Twitter (Opens in new window) Click to share on Facebook (Opens in new window) **Related** International Space StationNASASexSpace See more Previous articleThis Cat ‘Pretty Sure’ He’d Be a Better President Than Donald Trump **Newsletter** **Want more stuff like this?** Get the best content delivered straight into your inbox! Email address: Don't worry, we don't spam **You may also like** Popular71.1kSharesNASA confirms: In space, ‘reverse cowgirl’ and ‘doggystyle’ are the same thinginSpace Popular 71.1kShares **NASA confirms: In space, ‘reverse cowgirl’ and ‘doggystyle’ are the same thing** inSpace Popular 71.1kShares **NASA confirms: In space, ‘reverse cowgirl’ and ‘doggystyle’ are the same thing** inSpace 19.1kSharesNASA Scientists Still Unable To Locate Edge Of Trump’s StupidityinUncategorized 19.1kShares **NASA Scientists Still Unable To Locate Edge Of Trump’s Stupidity** inUncategorized 19.1kShares **NASA Scientists Still Unable To Locate Edge Of Trump’s Stupidity** inUncategorized 4.5kSharesTrump Asks Ben Carson if He’s ‘Friends With’ the Black Hole in NASA’S PictureinSpace 4.5kShares **Trump Asks Ben Carson if He’s ‘Friends With’ the Black Hole in NASA’S Picture** inSpace 4.5kShares **Trump Asks Ben Carson if He’s ‘Friends With’ the Black Hole in NASA’S Picture** inSpace 20.1kSharesTomi Lahren Says NASA’s Black Hole Picture is ‘Reverse Racism’ Because #AllHolesMatterinSpace 20.1kShares **Tomi Lahren Says NASA’s Black Hole Picture is ‘Reverse Racism’ Because #AllHolesMatter** inSpace 20.1kShares **Tomi Lahren Says NASA’s Black Hole Picture is ‘Reverse Racism’ Because #AllHolesMatter** inSpace 421SharesNASA Releases Amazing First Ever Pictures of a Black HoleinSpace 421Shares **NASA Releases Amazing First Ever Pictures of a Black Hole** inSpace 421Shares **NASA Releases Amazing First Ever Pictures of a Black Hole** inSpace 3.4kSharesTrump Wants His New Space Force’s Guns To Go “PEW PEW!”inGovernment 3.4kShares **Trump Wants His New Space Force’s Guns To Go “PEW PEW!”** inGovernment 3.4kShares **Trump Wants His New Space Force’s Guns To Go “PEW PEW!”** inGovernment **More From:Space** 768SharesPervy Conspiracy Theorist Storms Area 69 InsteadbyJames SchlarmannSeptember 20, 2019, 4:03 pm 768Shares **Pervy Conspiracy Theorist Storms Area 69 Instead** byJames SchlarmannSeptember 20, 2019, 4:03 pm 768Shares **Pervy Conspiracy Theorist Storms Area 69 Instead** byJames SchlarmannSeptember 20, 2019, 4:03 pm 1.1kSharesTrump: Space Force Will Put Base on Shared Earth/Mars MoonbyJames SchlarmannJune 7, 2019, 3:49 pm 1.1kShares **Trump: Space Force Will Put Base on Shared Earth/Mars Moon** byJames SchlarmannJune 7, 2019, 3:49 pm 1.1kShares **Trump: Space Force Will Put Base on Shared Earth/Mars Moon** byJames SchlarmannJune 7, 2019, 3:49 pm 1.2kSharesTrump Says Space Force Has Begun Work on Converting Moon into Death StarbyJames SchlarmannMay 4, 2019, 2:06 pm 1.2kShares **Trump Says Space Force Has Begun Work on Converting Moon into Death Star** byJames SchlarmannMay 4, 2019, 2:06 pm 1.2kShares **Trump Says Space Force Has Begun Work on Converting Moon into Death Star** byJames SchlarmannMay 4, 2019, 2:06 pm 4.5kSharesTrump Asks Ben Carson if He’s ‘Friends With’ the Black Hole in NASA’S PicturebyJames SchlarmannApril 11, 2019, 11:05 am 4.5kShares **Trump Asks Ben Carson if He’s ‘Friends With’ the Black Hole in NASA’S Picture** byJames SchlarmannApril 11, 2019, 11:05 am 4.5kShares **Trump Asks Ben Carson if He’s ‘Friends With’ the Black Hole in NASA’S Picture** byJames SchlarmannApril 11, 2019, 11:05 am 267SharesAmericans Disappointed To Find Out Trump Won’t Be On Falcon Heavy LaunchbyJames SchlarmannApril 10, 2019, 6:03 pm 267Shares **Americans Disappointed To Find Out Trump Won’t Be On Falcon Heavy Launch** byJames SchlarmannApril 10, 2019, 6:03 pm 267Shares **Americans Disappointed To Find Out Trump Won’t Be On Falcon Heavy Launch** byJames SchlarmannApril 10, 2019, 6:03 pm 20.1kSharesTomi Lahren Says NASA’s Black Hole Picture is ‘Reverse Racism’ Because #AllHolesMatterbyJames SchlarmannApril 10, 2019, 12:50 pm 20.1kShares **Tomi Lahren Says NASA’s Black Hole Picture is ‘Reverse Racism’ Because #AllHolesMatter** byJames SchlarmannApril 10, 2019, 12:50 pm 20.1kShares **Tomi Lahren Says NASA’s Black Hole Picture is ‘Reverse Racism’ Because #AllHolesMatter** byJames SchlarmannApril 10, 2019, 12:50 pm **Don't Miss** **Trending Now** Sorry. No data so far. **Find us on Facebook!** © 2018 Not Narrow or Straight, LLC"}