{"id": 1742, "name": "Iowa Climate Science Education", "domain": "iowaclimate.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://iowaclimate.org/2025/06/09/french-mps-from-left-and-right-vote-to-ditch-low-emission-zones-and-bans-on-older-cars/", "title": "French Mps From Left And Right Vote To Ditch Low Emission Zones And Bans On Older Cars", "content": "Twitter Facebook **Iowa Climate Science Education** Twitter Facebook Twitter Facebook **French MPs from Left and Right vote to ditch “low emission zones” and bans on older cars** **French MPs from Left and Right vote to ditch “low emission zones” and bans on older cars** There is one less hyper-complex, pointless, car-hate program in the world via CFACT https://ift.tt/F6xzlZa June 9, 2025 at 01:26PM **Share this:** Click to print (Opens in new window)Print Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to share on LinkedIn (Opens in new window)LinkedIn Click to email a link to a friend (Opens in new window)Email Click to share on Pinterest (Opens in new window)Pinterest Click to share on Tumblr (Opens in new window)Tumblr **Related** **Post navigation** **Leave a commentCancel reply** Δ UAH v6.1 Global Temperature Update for May, 2025: +0.50 deg. C Ivanpah Solar Plant: The Flaming Failure That’s Finally Being Put Out of Our Misery Dutch Cancel Offshore Wind Auction Due To Lack Of Interest UK Worse Place In World To Put Solar Power GROAN! [expletive deleted] Open Thread Botley West campaigners join national walk against solar farms 794,782 Twitter Facebook Comment Reblog SubscribeSubscribedIowa Climate Science EducationJoin 1,427 other subscribersSign me upAlready have a WordPress.com account?Log in now. Iowa Climate Science Education Already have a WordPress.com account?Log in now. Iowa Climate Science Education Already have a WordPress.com account?Log in now. Iowa Climate Science EducationSubscribeSubscribedSign upLog inCopy shortlinkReport this contentView post in ReaderManage subscriptionsCollapse this bar Iowa Climate Science Education SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Iowa Climate Science Education SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar"}