{"id": 106, "name": "Atlantic Council", "domain": "atlanticcouncil.org", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.atlanticcouncil.org/blogs/new-atlanticist/carneys-hinge-moment-is-about-more-than-just-canadian-defense-spending-what-does-that-mean-for-washington/", "title": "Carneys Hinge Moment Is About More Than Just Canadian Defense Spending What Does That Mean For Washington", "content": "InsightIssue briefs and reportsIssue briefs and reportsOur programs and centers deliver in-depth, highly relevant issue briefs and reports that break new ground, shift opinions, and set agendas on public policy, with a focus on advancing debates by integrating foundational research and analysis with concrete policy solutions.Fast ThinkingFast ThinkingWhen major global news breaks, the Atlantic Council’s experts have you covered—delivering their sharpest rapid insight and forward-looking analysis direct to your inbox.New AtlanticistNew AtlanticistNew Atlanticist is where top experts and policymakers at the Atlantic Council and beyond offer exclusive insight on the most pressing global challenges—and the United States’ role in addressing them alongside its allies and partners.Inflection PointsInflection PointsA weekly column by Atlantic Council President and CEO Frederick Kempe, Inflection Points focuses on the global challenges facing the United States and how to best address them.UkraineAlertUkraineAlertUkraineAlert is a comprehensive online publication that provides regular news and analysis on developments in Ukraine’s politics, economy, civil society, and culture. UkraineAlert sources analysis and commentary from a wide-array of thought-leaders, politicians, experts, and activists from Ukraine and the global community.MENASourceMENASourceMENASource offers the latest news from across the Middle East, combined with commentary by contributors, interviews with emerging players, multi-media content, and independent analysis from fellows and staff.EconographicsEconographicsEconographics provides an in-depth look at trends in the global economy utilizing state-of-the-art data visualization tools.More sectionsAfricaSourceEnergySourceGeoTech CuesIranSourceTurkeySource Issue briefs and reportsIssue briefs and reportsOur programs and centers deliver in-depth, highly relevant issue briefs and reports that break new ground, shift opinions, and set agendas on public policy, with a focus on advancing debates by integrating foundational research and analysis with concrete policy solutions. Our programs and centers deliver in-depth, highly relevant issue briefs and reports that break new ground, shift opinions, and set agendas on public policy, with a focus on advancing debates by integrating foundational research and analysis with concrete policy solutions. Fast ThinkingFast ThinkingWhen major global news breaks, the Atlantic Council’s experts have you covered—delivering their sharpest rapid insight and forward-looking analysis direct to your inbox. When major global news breaks, the Atlantic Council’s experts have you covered—delivering their sharpest rapid insight and forward-looking analysis direct to your inbox. New AtlanticistNew AtlanticistNew Atlanticist is where top experts and policymakers at the Atlantic Council and beyond offer exclusive insight on the most pressing global challenges—and the United States’ role in addressing them alongside its allies and partners. New Atlanticist is where top experts and policymakers at the Atlantic Council and beyond offer exclusive insight on the most pressing global challenges—and the United States’ role in addressing them alongside its allies and partners. Inflection PointsInflection PointsA weekly column by Atlantic Council President and CEO Frederick Kempe, Inflection Points focuses on the global challenges facing the United States and how to best address them. A weekly column by Atlantic Council President and CEO Frederick Kempe, Inflection Points focuses on the global challenges facing the United States and how to best address them. UkraineAlertUkraineAlertUkraineAlert is a comprehensive online publication that provides regular news and analysis on developments in Ukraine’s politics, economy, civil society, and culture. UkraineAlert sources analysis and commentary from a wide-array of thought-leaders, politicians, experts, and activists from Ukraine and the global community. UkraineAlert is a comprehensive online publication that provides regular news and analysis on developments in Ukraine’s politics, economy, civil society, and culture. UkraineAlert sources analysis and commentary from a wide-array of thought-leaders, politicians, experts, and activists from Ukraine and the global community. MENASourceMENASourceMENASource offers the latest news from across the Middle East, combined with commentary by contributors, interviews with emerging players, multi-media content, and independent analysis from fellows and staff. MENASource offers the latest news from across the Middle East, combined with commentary by contributors, interviews with emerging players, multi-media content, and independent analysis from fellows and staff. EconographicsEconographicsEconographics provides an in-depth look at trends in the global economy utilizing state-of-the-art data visualization tools. Econographics provides an in-depth look at trends in the global economy utilizing state-of-the-art data visualization tools. More sectionsAfricaSourceEnergySourceGeoTech CuesIranSourceTurkeySource AfricaSource EnergySource GeoTech Cues IranSource TurkeySource Issue briefs and reportsIssue briefs and reportsOur programs and centers deliver in-depth, highly relevant issue briefs and reports that break new ground, shift opinions, and set agendas on public policy, with a focus on advancing debates by integrating foundational research and analysis with concrete policy solutions. Our programs and centers deliver in-depth, highly relevant issue briefs and reports that break new ground, shift opinions, and set agendas on public policy, with a focus on advancing debates by integrating foundational research and analysis with concrete policy solutions. Our programs and centers deliver in-depth, highly relevant issue briefs and reports that break new ground, shift opinions, and set agendas on public policy, with a focus on advancing debates by integrating foundational research and analysis with concrete policy solutions. Our programs and centers deliver in-depth, highly relevant issue briefs and reports that break new ground, shift opinions, and set agendas on public policy, with a focus on advancing debates by integrating foundational research and analysis with concrete policy solutions. Fast ThinkingFast ThinkingWhen major global news breaks, the Atlantic Council’s experts have you covered—delivering their sharpest rapid insight and forward-looking analysis direct to your inbox. When major global news breaks, the Atlantic Council’s experts have you covered—delivering their sharpest rapid insight and forward-looking analysis direct to your inbox. When major global news breaks, the Atlantic Council’s experts have you covered—delivering their sharpest rapid insight and forward-looking analysis direct to your inbox. When major global news breaks, the Atlantic Council’s experts have you covered—delivering their sharpest rapid insight and forward-looking analysis direct to your inbox. New AtlanticistNew AtlanticistNew Atlanticist is where top experts and policymakers at the Atlantic Council and beyond offer exclusive insight on the most pressing global challenges—and the United States’ role in addressing them alongside its allies and partners. New Atlanticist is where top experts and policymakers at the Atlantic Council and beyond offer exclusive insight on the most pressing global challenges—and the United States’ role in addressing them alongside its allies and partners. New Atlanticist is where top experts and policymakers at the Atlantic Council and beyond offer exclusive insight on the most pressing global challenges—and the United States’ role in addressing them alongside its allies and partners. New Atlanticist is where top experts and policymakers at the Atlantic Council and beyond offer exclusive insight on the most pressing global challenges—and the United States’ role in addressing them alongside its allies and partners. Inflection PointsInflection PointsA weekly column by Atlantic Council President and CEO Frederick Kempe, Inflection Points focuses on the global challenges facing the United States and how to best address them. A weekly column by Atlantic Council President and CEO Frederick Kempe, Inflection Points focuses on the global challenges facing the United States and how to best address them. A weekly column by Atlantic Council President and CEO Frederick Kempe, Inflection Points focuses on the global challenges facing the United States and how to best address them. A weekly column by Atlantic Council President and CEO Frederick Kempe, Inflection Points focuses on the global challenges facing the United States and how to best address them. UkraineAlertUkraineAlertUkraineAlert is a comprehensive online publication that provides regular news and analysis on developments in Ukraine’s politics, economy, civil society, and culture. UkraineAlert sources analysis and commentary from a wide-array of thought-leaders, politicians, experts, and activists from Ukraine and the global community. UkraineAlert is a comprehensive online publication that provides regular news and analysis on developments in Ukraine’s politics, economy, civil society, and culture. UkraineAlert sources analysis and commentary from a wide-array of thought-leaders, politicians, experts, and activists from Ukraine and the global community. UkraineAlert is a comprehensive online publication that provides regular news and analysis on developments in Ukraine’s politics, economy, civil society, and culture. UkraineAlert sources analysis and commentary from a wide-array of thought-leaders, politicians, experts, and activists from Ukraine and the global community. UkraineAlert is a comprehensive online publication that provides regular news and analysis on developments in Ukraine’s politics, economy, civil society, and culture. UkraineAlert sources analysis and commentary from a wide-array of thought-leaders, politicians, experts, and activists from Ukraine and the global community. MENASourceMENASourceMENASource offers the latest news from across the Middle East, combined with commentary by contributors, interviews with emerging players, multi-media content, and independent analysis from fellows and staff. MENASource offers the latest news from across the Middle East, combined with commentary by contributors, interviews with emerging players, multi-media content, and independent analysis from fellows and staff. MENASource offers the latest news from across the Middle East, combined with commentary by contributors, interviews with emerging players, multi-media content, and independent analysis from fellows and staff. MENASource offers the latest news from across the Middle East, combined with commentary by contributors, interviews with emerging players, multi-media content, and independent analysis from fellows and staff. EconographicsEconographicsEconographics provides an in-depth look at trends in the global economy utilizing state-of-the-art data visualization tools. Econographics provides an in-depth look at trends in the global economy utilizing state-of-the-art data visualization tools. Econographics provides an in-depth look at trends in the global economy utilizing state-of-the-art data visualization tools. Econographics provides an in-depth look at trends in the global economy utilizing state-of-the-art data visualization tools. More sectionsAfricaSourceEnergySourceGeoTech CuesIranSourceTurkeySource AfricaSource EnergySource GeoTech Cues IranSource TurkeySource AfricaSource EnergySource GeoTech Cues IranSource TurkeySource EventsUpcoming eventsAC Front PageGalas and flagship events Upcoming events AC Front Page Galas and flagship events Upcoming events AC Front Page Galas and flagship events ACTV IssuesPolitics & DiplomacySub-issuesAll Politics & DiplomacyCorruptionDemocratic TransitionsElectionsFreedom and ProsperityG20International NormsMediaPolitical ReformRule of LawInternational OrganizationsUnited NationsSecurity & DefenseSub-issuesAll Security & DefenseArms ControlConflictDefense IndustryDefense PolicyDefense TechnologiesExtremismIntelligenceNational SecurityNATONon-Traditional ThreatsNuclear DeterrenceNuclear NonproliferationPeacekeeping and PeacebuildingSecurity PartnershipsTerrorismEconomy & BusinessSub-issuesAll Economy & BusinessDigital CurrenciesDigital PolicyEconomic SanctionsEurozoneFinancial Crimes & Illicit TradeFinancial RegulationFiscal and Structural ReformFuture of WorkInclusive GrowthInternational Financial InstitutionsInternational MarketsMacroeconomicsTrade & TariffsEnergy & EnvironmentSub-issuesAll Energy & EnvironmentClimate Change & Climate ActionEnergy Markets & GovernanceEnergy TransitionsGeopolitics & Energy SecurityNuclear EnergyOil & GasRenewables & Advanced EnergyResilience & SocietySub-issuesAll Resilience & SocietyCivil SocietyCoronavirusEducationHuman RightsMigrationNationalismPopulismResilienceWomenYouthTechnology & InnovationSub-issuesAll Technology & InnovationCybersecurityDisinformationDronesEntrepreneurshipInternetInternet of ThingsSpace Politics & DiplomacySub-issuesAll Politics & DiplomacyCorruptionDemocratic TransitionsElectionsFreedom and ProsperityG20International NormsMediaPolitical ReformRule of LawInternational OrganizationsUnited Nations All Politics & Diplomacy Corruption Democratic Transitions Elections Freedom and Prosperity G20 International Norms Media Political Reform Rule of Law International Organizations United Nations Security & DefenseSub-issuesAll Security & DefenseArms ControlConflictDefense IndustryDefense PolicyDefense TechnologiesExtremismIntelligenceNational SecurityNATONon-Traditional ThreatsNuclear DeterrenceNuclear NonproliferationPeacekeeping and PeacebuildingSecurity PartnershipsTerrorism All Security & Defense Arms Control Conflict Defense Industry Defense Policy Defense Technologies Extremism Intelligence National Security NATO Non-Traditional Threats Nuclear Deterrence Nuclear Nonproliferation Peacekeeping and Peacebuilding Security Partnerships Terrorism Economy & BusinessSub-issuesAll Economy & BusinessDigital CurrenciesDigital PolicyEconomic SanctionsEurozoneFinancial Crimes & Illicit TradeFinancial RegulationFiscal and Structural ReformFuture of WorkInclusive GrowthInternational Financial InstitutionsInternational MarketsMacroeconomicsTrade & Tariffs All Economy & Business Digital Currencies Digital Policy Economic Sanctions Eurozone Financial Crimes & Illicit Trade Financial Regulation Fiscal and Structural Reform Future of Work Inclusive Growth International Financial Institutions International Markets Macroeconomics Trade & Tariffs Energy & EnvironmentSub-issuesAll Energy & EnvironmentClimate Change & Climate ActionEnergy Markets & GovernanceEnergy TransitionsGeopolitics & Energy SecurityNuclear EnergyOil & GasRenewables & Advanced Energy All Energy & Environment Climate Change & Climate Action Energy Markets & Governance Energy Transitions Geopolitics & Energy Security Nuclear Energy Oil & Gas Renewables & Advanced Energy Resilience & SocietySub-issuesAll Resilience & SocietyCivil SocietyCoronavirusEducationHuman RightsMigrationNationalismPopulismResilienceWomenYouth All Resilience & Society Civil Society Coronavirus Education Human Rights Migration Nationalism Populism Resilience Women Youth Technology & InnovationSub-issuesAll Technology & InnovationCybersecurityDisinformationDronesEntrepreneurshipInternetInternet of ThingsSpace All Technology & Innovation Cybersecurity Disinformation Drones Entrepreneurship Internet Internet of Things Space Politics & DiplomacySub-issuesAll Politics & DiplomacyCorruptionDemocratic TransitionsElectionsFreedom and ProsperityG20International NormsMediaPolitical ReformRule of LawInternational OrganizationsUnited Nations All Politics & Diplomacy Corruption Democratic Transitions Elections Freedom and Prosperity G20 International Norms Media Political Reform Rule of Law International Organizations United Nations All Politics & Diplomacy Corruption Democratic Transitions Elections Freedom and Prosperity G20 International Norms Media Political Reform Rule of Law International Organizations United Nations Security & DefenseSub-issuesAll Security & DefenseArms ControlConflictDefense IndustryDefense PolicyDefense TechnologiesExtremismIntelligenceNational SecurityNATONon-Traditional ThreatsNuclear DeterrenceNuclear NonproliferationPeacekeeping and PeacebuildingSecurity PartnershipsTerrorism All Security & Defense Arms Control Conflict Defense Industry Defense Policy Defense Technologies Extremism Intelligence National Security NATO Non-Traditional Threats Nuclear Deterrence Nuclear Nonproliferation Peacekeeping and Peacebuilding Security Partnerships Terrorism All Security & Defense Arms Control Conflict Defense Industry Defense Policy Defense Technologies Extremism Intelligence National Security NATO Non-Traditional Threats Nuclear Deterrence Nuclear Nonproliferation Peacekeeping and Peacebuilding Security Partnerships Terrorism Economy & BusinessSub-issuesAll Economy & BusinessDigital CurrenciesDigital PolicyEconomic SanctionsEurozoneFinancial Crimes & Illicit TradeFinancial RegulationFiscal and Structural ReformFuture of WorkInclusive GrowthInternational Financial InstitutionsInternational MarketsMacroeconomicsTrade & Tariffs All Economy & Business Digital Currencies Digital Policy Economic Sanctions Eurozone Financial Crimes & Illicit Trade Financial Regulation Fiscal and Structural Reform Future of Work Inclusive Growth International Financial Institutions International Markets Macroeconomics Trade & Tariffs All Economy & Business Digital Currencies Digital Policy Economic Sanctions Eurozone Financial Crimes & Illicit Trade Financial Regulation Fiscal and Structural Reform Future of Work Inclusive Growth International Financial Institutions International Markets Macroeconomics Trade & Tariffs Energy & EnvironmentSub-issuesAll Energy & EnvironmentClimate Change & Climate ActionEnergy Markets & GovernanceEnergy TransitionsGeopolitics & Energy SecurityNuclear EnergyOil & GasRenewables & Advanced Energy All Energy & Environment Climate Change & Climate Action Energy Markets & Governance Energy Transitions Geopolitics & Energy Security Nuclear Energy Oil & Gas Renewables & Advanced Energy All Energy & Environment Climate Change & Climate Action Energy Markets & Governance Energy Transitions Geopolitics & Energy Security Nuclear Energy Oil & Gas Renewables & Advanced Energy Resilience & SocietySub-issuesAll Resilience & SocietyCivil SocietyCoronavirusEducationHuman RightsMigrationNationalismPopulismResilienceWomenYouth All Resilience & Society Civil Society Coronavirus Education Human Rights Migration Nationalism Populism Resilience Women Youth All Resilience & Society Civil Society Coronavirus Education Human Rights Migration Nationalism Populism Resilience Women Youth Technology & InnovationSub-issuesAll Technology & InnovationCybersecurityDisinformationDronesEntrepreneurshipInternetInternet of ThingsSpace All Technology & Innovation Cybersecurity Disinformation Drones Entrepreneurship Internet Internet of Things Space All Technology & Innovation Cybersecurity Disinformation Drones Entrepreneurship Internet Internet of Things Space RegionsAfricaSub-regionsAll AfricaAngolaDemocratic Republic of the CongoEast AfricaEritreaEthiopiaGeneral AfricaMoroccoNigeriaNorth & West AfricaSahelSouth & Central AfricaSouth AfricaSudanSomaliaAmericasSub-regionsAll AmericasUnited States and CanadaLatin AmericaBrazilCaribbeanColombiaCubaMexicoNorthern TriangleVenezuelaEurope & EurasiaSub-regionsAll Europe & EurasiaEuropean UnionThe BalkansBelarusThe CaucasusFranceGermanyGreeceHungaryItalyMoldovaPolandRussiaTurkeyUkraineUnited KingdomIndo-PacificSub-regionsAll Indo-PacificAfghanistanAustraliaBangladeshChinaIndiaJapanKoreaPakistanTaiwanMiddle EastSub-regionsAll Middle EastThe GulfNorth AfricaIranIraqIsraelLebanonLibyaSaudi ArabiaSyriaYemen AfricaSub-regionsAll AfricaAngolaDemocratic Republic of the CongoEast AfricaEritreaEthiopiaGeneral AfricaMoroccoNigeriaNorth & West AfricaSahelSouth & Central AfricaSouth AfricaSudanSomalia All Africa Angola Democratic Republic of the Congo East Africa Eritrea Ethiopia General Africa Morocco Nigeria North & West Africa Sahel South & Central Africa South Africa Sudan Somalia AmericasSub-regionsAll AmericasUnited States and CanadaLatin AmericaBrazilCaribbeanColombiaCubaMexicoNorthern TriangleVenezuela All Americas United States and Canada Latin America Brazil Caribbean Colombia Cuba Mexico Northern Triangle Venezuela Europe & EurasiaSub-regionsAll Europe & EurasiaEuropean UnionThe BalkansBelarusThe CaucasusFranceGermanyGreeceHungaryItalyMoldovaPolandRussiaTurkeyUkraineUnited Kingdom All Europe & Eurasia European Union The Balkans Belarus The Caucasus France Germany Greece Hungary Italy Moldova Poland Russia Turkey Ukraine United Kingdom Indo-PacificSub-regionsAll Indo-PacificAfghanistanAustraliaBangladeshChinaIndiaJapanKoreaPakistanTaiwan All Indo-Pacific Afghanistan Australia Bangladesh China India Japan Korea Pakistan Taiwan Middle EastSub-regionsAll Middle EastThe GulfNorth AfricaIranIraqIsraelLebanonLibyaSaudi ArabiaSyriaYemen All Middle East The Gulf North Africa Iran Iraq Israel Lebanon Libya Saudi Arabia Syria Yemen AfricaSub-regionsAll AfricaAngolaDemocratic Republic of the CongoEast AfricaEritreaEthiopiaGeneral AfricaMoroccoNigeriaNorth & West AfricaSahelSouth & Central AfricaSouth AfricaSudanSomalia All Africa Angola Democratic Republic of the Congo East Africa Eritrea Ethiopia General Africa Morocco Nigeria North & West Africa Sahel South & Central Africa South Africa Sudan Somalia All Africa Angola Democratic Republic of the Congo East Africa Eritrea Ethiopia General Africa Morocco Nigeria North & West Africa Sahel South & Central Africa South Africa Sudan Somalia AmericasSub-regionsAll AmericasUnited States and CanadaLatin AmericaBrazilCaribbeanColombiaCubaMexicoNorthern TriangleVenezuela All Americas United States and Canada Latin America Brazil Caribbean Colombia Cuba Mexico Northern Triangle Venezuela All Americas United States and Canada Latin America Brazil Caribbean Colombia Cuba Mexico Northern Triangle Venezuela Europe & EurasiaSub-regionsAll Europe & EurasiaEuropean UnionThe BalkansBelarusThe CaucasusFranceGermanyGreeceHungaryItalyMoldovaPolandRussiaTurkeyUkraineUnited Kingdom All Europe & Eurasia European Union The Balkans Belarus The Caucasus France Germany Greece Hungary Italy Moldova Poland Russia Turkey Ukraine United Kingdom All Europe & Eurasia European Union The Balkans Belarus The Caucasus France Germany Greece Hungary Italy Moldova Poland Russia Turkey Ukraine United Kingdom Indo-PacificSub-regionsAll Indo-PacificAfghanistanAustraliaBangladeshChinaIndiaJapanKoreaPakistanTaiwan All Indo-Pacific Afghanistan Australia Bangladesh China India Japan Korea Pakistan Taiwan All Indo-Pacific Afghanistan Australia Bangladesh China India Japan Korea Pakistan Taiwan Middle EastSub-regionsAll Middle EastThe GulfNorth AfricaIranIraqIsraelLebanonLibyaSaudi ArabiaSyriaYemen All Middle East The Gulf North Africa Iran Iraq Israel Lebanon Libya Saudi Arabia Syria Yemen All Middle East The Gulf North Africa Iran Iraq Israel Lebanon Libya Saudi Arabia Syria Yemen ExpertsFind an expertRequest a media interview Find an expert Request a media interview Find an expert Request a media interview AboutProgramsScowcroft Center for Strategy and SecurityClimate Resilience CenterAdrienne Arsht Latin America CenterRafik Hariri Center & Middle East programsAfrica CenterDigital Forensic Research LabEurasia CenterEurope CenterGeoEconomics CenterGeoTech CenterGlobal Energy CenterMillennium Leadership ProgramSouth Asia CenterAtlantic Council in TurkeyGlobal China HubFreedom and Prosperity CenterVisit or contact usAbout the Atlantic CouncilGet involvedLeadership & governanceFor mediaSubscribe by emailFind job opportunities ProgramsScowcroft Center for Strategy and SecurityClimate Resilience CenterAdrienne Arsht Latin America CenterRafik Hariri Center & Middle East programsAfrica CenterDigital Forensic Research LabEurasia CenterEurope CenterGeoEconomics CenterGeoTech CenterGlobal Energy CenterMillennium Leadership ProgramSouth Asia CenterAtlantic Council in TurkeyGlobal China HubFreedom and Prosperity Center Scowcroft Center for Strategy and Security Climate Resilience Center Adrienne Arsht Latin America Center Rafik Hariri Center & Middle East programs Africa Center Digital Forensic Research Lab Eurasia Center Europe Center GeoEconomics Center GeoTech Center Global Energy Center Millennium Leadership Program South Asia Center Atlantic Council in Turkey Global China Hub Freedom and Prosperity Center Visit or contact us About the Atlantic Council Get involved Leadership & governance For media Subscribe by email Find job opportunities ProgramsScowcroft Center for Strategy and SecurityClimate Resilience CenterAdrienne Arsht Latin America CenterRafik Hariri Center & Middle East programsAfrica CenterDigital Forensic Research LabEurasia CenterEurope CenterGeoEconomics CenterGeoTech CenterGlobal Energy CenterMillennium Leadership ProgramSouth Asia CenterAtlantic Council in TurkeyGlobal China HubFreedom and Prosperity Center Scowcroft Center for Strategy and Security Climate Resilience Center Adrienne Arsht Latin America Center Rafik Hariri Center & Middle East programs Africa Center Digital Forensic Research Lab Eurasia Center Europe Center GeoEconomics Center GeoTech Center Global Energy Center Millennium Leadership Program South Asia Center Atlantic Council in Turkey Global China Hub Freedom and Prosperity Center Scowcroft Center for Strategy and Security Climate Resilience Center Adrienne Arsht Latin America Center Rafik Hariri Center & Middle East programs Africa Center Digital Forensic Research Lab Eurasia Center Europe Center GeoEconomics Center GeoTech Center Global Energy Center Millennium Leadership Program South Asia Center Atlantic Council in Turkey Global China Hub Freedom and Prosperity Center Visit or contact us About the Atlantic Council Get involved Leadership & governance For media Subscribe by email Find job opportunities Donate InsightIssue briefs and reportsFast ThinkingNew AtlanticistInflection PointsUkraineAlertMENASourceEconographicsMore sections Issue briefs and reports Fast Thinking New Atlanticist Inflection Points UkraineAlert MENASource Econographics More sections Issue briefs and reports Fast Thinking New Atlanticist Inflection Points UkraineAlert MENASource Econographics More sections EventsUpcoming eventsAC Front PageGalas and flagship events Upcoming events AC Front Page Galas and flagship events Upcoming events AC Front Page Galas and flagship events ACTV IssuesPolitics & DiplomacySecurity & DefenseEconomy & BusinessEnergy & EnvironmentResilience & SocietyTechnology & Innovation Politics & Diplomacy Security & Defense Economy & Business Energy & Environment Resilience & Society Technology & Innovation Politics & Diplomacy Security & Defense Economy & Business Energy & Environment Resilience & Society Technology & Innovation RegionsAfricaAmericasEurope & EurasiaIndo-PacificMiddle East Africa Americas Europe & Eurasia Indo-Pacific Middle East Africa Americas Europe & Eurasia Indo-Pacific Middle East ExpertsFind an expertRequest a media interview Find an expert Request a media interview Find an expert Request a media interview AboutProgramsVisit or contact usAbout the Atlantic CouncilGet involvedLeadership & governanceFor mediaSubscribe by emailFind job opportunities Programs Visit or contact us About the Atlantic Council Get involved Leadership & governance For media Subscribe by email Find job opportunities Programs Visit or contact us About the Atlantic Council Get involved Leadership & governance For media Subscribe by email Find job opportunities Donate New Atlanticist June 11, 2025 • 3:35pm ET **Carney’s ‘hinge moment’ is about more than just Canadian defense spending. What does that mean for Washington?** ByImran Bayoumi It’s not just the money. On Monday, Mark Carney gave his first major defense and security speech as Canadian prime minister. In thespeech, Carney pledged that Canada would reach the NATO benchmark of spending 2 percent of gross domestic product (GDP) on defense this year, well ahead of the previous government’s 2032 deadline. While this announcement garneredheadlines, less attention went to Carney’s reasoning for the increase, which included both an unraveling international order and an increasingly unreliable United States. What might Carney’s view of the current moment and of Washington mean for the United States? Below,Imran Bayoumi, an associate director with the GeoStrategy Initiative in the Scowcroft Center for Strategy and Security, puts the new spending in its full context. **Why is Carney calling for changes now?** Speaking at the University of Toronto, Carneydescribedthe current era as a “hinge moment” in Canada’s history. As “threats from a more dangerous and divided world are unraveling the rules-based international order,” Carney is doing what many leaders of all political stripes in Canada havepledged and failedto do—increase military and defense spending. Recognizing the increasingly volatile international security environment that Canada finds itself in, Carneyannouncedsweeping plans for the government of Canada to increase its defense spending to the NATO target of 2 percent of its GDP by March 2026, ahead of the goal set by the government of former Prime Minister Justin Trudeau. Canada’s lagging defense spending haslongdrawn the ire of the United States and other NATO allies and served as atargetfor US President Donald Trump earlier this year. Carney likely timed this announcement for this weekend’s G7 Summit, during which Trump will travel to Alberta, and in advance of the NATO Summit in the Hague later this month. Aside from addressing short-term priorities with this month’s summitry, Carney also framed his announcement around the threats to Canada at this moment in history,stating, “a new imperialism threatens. Middle powers must compete for interests and attention, knowing that if they’re not at the table, they’re on the menu.” **What exactly is Canada doing on defense spending?** Canadacurrentlyspends 1.37 percent of its GDP on defense, but the low spending numbers do not tell the full story of Canada’s defense woes. Ottawaonlyhas one operational submarine, out of four, and only half of the Canada’s maritime and land vehicles are operational. Questions surround Canada’s ability to ramp up its domestic defense production at a scale needed to meet Carney’s new goals. Theequipmentused by the Canadian Armed Forces and Canada’s broader defense production as a whole are closely integrated with the United States. Despite this, Carney haspledgedto diversify future defense spending away from an overreliance on the United States and look towards new partners, including Europe, as well as boosting its own capacity for domestic production. **Where will this increased spending go?** In fiscal year 2025-26 alone, the Carney government willinvestan additional $6.5 billion across the Department of National Defence (DND), the Canadian Armed Forces, and the Communications Security Establishment (Canada’s signals intelligence agency). The Canadian governmentaimsto increase the number of full-time armed forces members and reservists alongside investing in the civilian workforce. Part of the spending increase will also come frommovingthe oversight of Canadian Coast Guard from the Ministries of Fisheries and Oceans to the DND. The investment strategy calls forfurthermodernizing Canada’s military capabilities with a focus on the Arctic, such as Canada’srecentacquisition of a new over-the horizon radar system from Australia. To further Canada’s domestic defense production and innovation, the government plans toestablishBOREALIS, the Bureau of Research, Engineering, and Advanced Leadership in Science, which will focus on focus on furthering research in frontier technologies such as artificial intelligence and quantum computing. **How should the United States view Canada’s plans?** Washington has already welcomed Ottawa’s announcement, with US Ambassador to Canada Pete Hoekstrapostingon X that the plan is “an important step toward strengthening the Alliance and reinforcing our shared security.” However, a key part of Carney’s strategy is to diversify Canada’s defense investments and partnerships away from the United States. The purchase of the JORN radar system from Australia was Canberra’sbiggestever defense export and took the United States bysurprise. Ottawa is considering bids from bothSouth Koreaand ajointGerman and Norwegian bid to purchase new submarines. Canada’s planned purchase of eighty-eight F-35 fighter jets from the United States is also beingreconsidered, with the DND now potentially looking toward European suppliers. While Washington will welcome Ottawa’s clear, if long-delayed, commitment to investing in its national defense and security, the era when Canada buys heavily from the United States is likely over. As Carneystated, “it is time for Canada to chart its own path and assert itself on the international stage,” and Washington should not take for granted its potential role in Canada’s defense future. Tue, Jun 10, 2025 New AtlanticistByAtlantic Council experts Atlantic Council experts break down the details of the European Commission's proposed eighteenth sanctions package against Russia for its war on Ukraine. Thu, Mar 27, 2025 Issue BriefByKimberly Donovan,Maia Nikoladze,Lize de Kruijf To address threats from Russia and China and reduce trade overdependence on the United States, Canada’s federal government will need to consolidate economic power and devise an economic statecraft strategy that will leverage Canada’s economic tools to mitigate economic threats and vulnerabilities. Mon, Mar 10, 2025 New AtlanticistByAtlantic Council experts As the next prime minister of Canada prepares to take office, Atlantic Council experts look at what’s ahead for Ottawa and its relationship with Washington. Image: Canada’s Prime Minister Mark Carney walks with the Chief of the Defence Staff Jennie Carignan and Minister of National Defence David McGuinty prior to making a speech about defense and security at Fort York Armoury, in Toronto, Ontario, Canada June 9, 2025. REUTERS/Arlyn McAdorey Sign up to receive expert analysis from our community on the most important global issues, rapid insights on events as they unfold, and highlights of the Council's best work. © 2025 Atlantic CouncilAll rights reserved. Privacy Policy Cookie Policy Terms and conditions of use Intellectual Independence Policy Government Funding Review Process Policy on donor acceptance and disclosure Modern Day Slavery and Anti-Human Trafficking Policy Photo credits **Oops...** **It looks like we're having a technical issue.** If refreshing the page doesn't resolve the issue you could try clearing the sites browser cache."}