{"id": 2004, "name": "Institute for Policy Studies", "domain": "ips-dc.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://ips-dc.org/report-wealth-expands-after-higher-state-taxes-on-high-income-earners/", "title": "Report Wealth Expands After Higher State Taxes On High Income Earners", "content": "Issue AreasPeace & Foreign PolicyEconomic JusticeClimate JusticeRacial & Gender JusticeLeadership Programs Peace & Foreign Policy Economic Justice Climate Justice Racial & Gender Justice Leadership Programs Peace & Foreign Policy Economic Justice Climate Justice Racial & Gender Justice Leadership Programs ResearchReportsArticlesResourcesBooks Reports Articles Resources Books Reports Articles Resources Books EventsLetelier-Moffitt Human Rights AwardsMarcus Raskin Award for Civic and Intellectual Courage Letelier-Moffitt Human Rights Awards Marcus Raskin Award for Civic and Intellectual Courage Letelier-Moffitt Human Rights Awards Marcus Raskin Award for Civic and Intellectual Courage About UsOur HistoryStaff, Board, and ExpertsCareers and InternshipsProjectsPressContactOur Financials Our History Staff, Board, and Experts Careers and Internships Projects Press Contact Our Financials Our History Staff, Board, and Experts Careers and Internships Projects Press Contact Our Financials SupportPlanned Giving Planned Giving Planned Giving Issue AreasPeace & Foreign PolicyEconomic JusticeClimate JusticeRacial & Gender JusticeLeadership Programs Peace & Foreign Policy Economic Justice Climate Justice Racial & Gender Justice Leadership Programs Peace & Foreign Policy Economic Justice Climate Justice Racial & Gender Justice Leadership Programs ResearchReportsArticlesResourcesBooks Reports Articles Resources Books Reports Articles Resources Books EventsLetelier-Moffitt Human Rights AwardsMarcus Raskin Award for Civic and Intellectual Courage Letelier-Moffitt Human Rights Awards Marcus Raskin Award for Civic and Intellectual Courage Letelier-Moffitt Human Rights Awards Marcus Raskin Award for Civic and Intellectual Courage About UsOur HistoryStaff, Board, and ExpertsCareers and InternshipsProjectsPressContactOur Financials Our History Staff, Board, and Experts Careers and Internships Projects Press Contact Our Financials Our History Staff, Board, and Experts Careers and Internships Projects Press Contact Our Financials SupportPlanned Giving Planned Giving Planned Giving **Wealth Expands After Higher State Taxes on High-Income Earners** ByOmar Ocampo Introduction Key Findings Massachusetts and Washington Succeed in Raising Revenue Rhode Island and Income Concentration Wealth Tax in Washington and Revenue Estimates in Four States Conclusion Share It On Social To speak with an expert, contact IPS Deputy Communications Director Olivia Alperstein at (202) 704-9011 orolivia@ips-dc.org. For recent press statements,visit our Press page. **Introduction** Over the past fifty years, the US economy has experienced a significant increase in inequality. The share of national income that goes to the working-class has been on a gradual decline and, in 2022, reached its lowest level since the Great Depression. This process of labor share decline was accompanied by a wave of tax cuts at the state and federal level that overwhelmingly benefited the rich, ushering in a new era of extreme inequality and wealth concentration. These current levels of economic disparity and tax regression are both unsustainable and harmful to society. Many studies show that lowering the marginal tax rates for those at the top of the income distribution does not lead to more economic growth or the creation of good paying jobs. If anything, it squeezes the living standards of working families and deprives state governments of the revenue it needs to deliver essential public goods and services. Progressive taxation and a wealth tax on the ultrarich are both effective policy tools that can help reverse inequality and ensure that communities have the health care, schools, and infrastructure they need to thrive. New data produced and analyzed by the Institute for Policy Studies and the State Revenue Alliance show that Massachusetts and Washington State have seen tremendous growth in the number of people with more than $1 million in total wealth since raising taxes on higher earners. The revenue generated from these tax payments exceeded expectations and is helping fund essential programs that expand economic opportunity for all. **Key Findings** The number of wealthy individuals and their cumulative wealth grew after the enactment of higher taxes on high earners in Massachusetts and a progressive capital gains tax on high-wealth Washingtonians. Progressive taxation on million-dollar incomes in Massachusetts and capital gains in Washington succeeded in collecting additional revenue. A wealth tax that targets ultra-high net worth individuals – those with $50 million or more – puts a minor constraint on their rate of accumulation, but has the potential to raise significant revenues that can be used to support broad healthcare, economic, and educational programs that benefit all state residents. Two years into Massachusetts’ millionaires’ tax and a higher tax rate on $250,000 in capital gains in Washington state shows that the millionaire class grew by 38.6 percent in Massachusetts and 46.9 percent in Washington, respectively. Their wealth grew by more than $580 billion in current dollars in Massachusetts and $748 billion in Washington state between 2022 and 2024. In New York and Rhode Island, the total wealth of those with at least $1 million in assets grew as well. From 2010 to 2024, these four states saw a total wealth increase of about 200 percent, from $3.7 trillion to $11.2 trillion. The top 0.7 percent of tax return filers in New York received a greater share of the gross adjusted income than the bottom 76 percent of filers in 2022. A two percent wealth tax on individuals with a net worth of $50 million or more has the potential to raise $7.4 billion in Massachusetts, $21.9 billion in New York, $700 million in Rhode Island, and $8.2 billion in Washington. **Massachusetts and Washington Succeed in Raising Revenue** Massachusetts serves a model for states interested in progressive taxation. In November of 2022, the Massachusetts electorate voted to amend its state constitution to adopt a 4 percent surtax on all income above one million dollars. The purpose of the surtax proposal, known as the Fair Share Amendment, is to provide the state with extra revenue to help fund education and public transportation. Opponents of the surtax warned of an imminent exodus of Bay State millionaires to friendlier tax jurisdictions and the subsequent shrinking of the Massachusetts tax base. The academic literature, however, does not support many of the assertions of the anti-tax movement. Research shows that high net worth individuals tend to be less mobile and exhibit lower rates of migration compared to the general public. Their family, business, and social networks deeply root them to amenity rich locales, thus higher income taxes do not compel the overwhelming majority of millionaires to move across state lines. It is two years into the progressive taxation experiment in Massachusetts, and the evidence supports the academic literature and pro-surtax policy arguments. The revenue collected from the surtax has exceeded expectations: in the fiscal year of 2024, it raised close to $2.2 billion, almost a billion dollars more than what was originally projected. And in the first three-quarters of the current budget year, the Massachusetts Department of Revenue reported that it is $786 million above its benchmark with the millionaires’ surtax being responsible for a “significant portion” of the surplus. This additional revenue is being put towards university scholarships, school meals for young children, and necessary road and rail system repairs. Data from the IRS’ Statistics of Income program demonstrate that the number of tax returns that reported an adjusted gross income (AGI) of a million dollars or more in Massachusetts has grown by 36 percent between 2018 and 2022 – from 20k to 27k. Tax stats from the IRS for 2023 are currently not available. Our wealth data reveals that the number of millionaires by net worth in Massachusetts rose by 38.6 percent between 2022 and 2024, from 441,610 individuals to 612,109. In current dollars, their collective wealth increased from $1.6 trillion to $2.2 trillion or 37.3 percent. Millionaires in Washington state are equally doing well. There were more than 463 thousand millionaires in the Evergreen State the year a capital gains tax was introduced. Two years later, there were more than 681 thousand millionaires with a wealth increase of more than $748 billion, or 45.2 percent. The introduction of a 7 percent tax on capital gains above $250,000 did not hamper the millionaire class’ rate of accumulation, but it did succeed in raising more than $1.2 billion. This revenue has expanded public investment into education and, at the time of writing, lawmakers in Washington state are considering a 9.9 percent tax on capital gains over a million dollars. The success of Massachusetts and Washington in expanding their state’s coffers with new revenue stands in stark contrast to the failure of supply-side economics in Kansas. In 2012, Republican Governor Sam Brownback instituted one of the largest tax cuts in Kansas history. The tax reform bill, designed with the help of economist Arthur Laffer, was justified under the pretense that it would stimulate growth and be revenue neutral. However, the conservative experiment failed to achieve all of its stated objectives, and five years later, the Kansas state legislature reversed Brownback’s tax cuts because the cuts failed to stimulate private sector job growth, the Kansan economy lagged, and the cuts led to harmful and continuous revenue shortfalls. **Rhode Island and Income Concentration** A coalition of Rhode Islanders are currently following in the footsteps of Massachusetts. Encouraged by the Fair Share Amendment, they are recommending a 3 percent surtax on the top one percent of earners – about 5,700 filers – in their state. They estimate that their tax proposal will raise about $190 million in additional revenue in its first year of implementation. Predictably, the proposal has been met with opposition from both the political and business class who disseminate the unsubstantiated claim that a modest income tax increase on high income earners would cause a large-scale flow of outward migration of the wealthy. Rhode Islanders earned a total of $47.9 billion in adjusted gross income in 2022 with million-dollar filers, representing 0.3 percent of Ocean Staters, capturing 12.5 percent of AGI. Meanwhile 76 percent of all filers captured a little over one-third of all adjusted gross income. Massachusetts, New York, and Washington followed similar patterns of concentrated distribution. Million-dollar earners represented less than one percent of all filers yet captured a significant share of the AGI generated in their respective states. New York is the most brazen example of income concentration. Households in the Empire State with an AGI of a million dollars or more represented only 0.7 percent of all tax filers in 2022, yet they earned 26.3 percent of all the adjusted gross income generated for a total of $267.9 billion. The vast majority of tax filers, 75 percent, earned less than that income group, only 25.8 percent of total AGI, or $263.3 billion. At the time of writing, Maryland became the latest state to raise taxes on incomes over a million dollars, adding a new tax bracket of 6.5 percent for seven figure earners. Marylanders who reported an AGI of a million dollars or more in 2022 were only a fraction of all tax filers, 0.4 percent, yet they captured 12 percent of all AGI. Year: 2022 **Wealth Tax in Washington and Revenue Estimates in Four States** It is a widely known fact that wealth is more unevenly distributed than income and a wealth tax is one way that disperses wealth concentration. For a wealth tax to work, design is very important. It needs to exclusively target ultra-high net worth individuals (UHNW), defined here as any affluent person with more than $30 million in wealth. The rationale for such a high wealth threshold is straightforward. This is a group of individuals who have the resources and liquidity to pay. A wealth tax does not significantly impact their lives or alter their consumption habits. It merely lowers their rate of capital accumulation. In our example, we decided to model this tax on individuals with $50 million or more in wealth, $20 million above our UHNW threshold and about 260 times higher than the median household income. The revenue potential is significant across the four states we surveyed and modeled. A two percent wealth tax on this group of UHNW individuals has the potential to raise $7.4 billion in Massachusetts, $21.9 billion in New York, $700 million in Rhode Island, and $8.2 billion in Washington. Year: 2024 Revenue Estimate, $bn Advocates and policymakers in Washington state continue to go back and forth about using a wealth tax to raise revenue and close the state’s $16 billion deficit. A one-time 3 percent wealth tax on less than 3,000 people in Washington would raise $12.3 billion and bring down their budget deficit by 76.9 percent. **Conclusion** Regressive taxation and lower tax rates for those at the top of income distribution worsens inequities in the tax code and reduces revenues available for states to invest in essential health, economic, and education programs, which contributes to poorer socioeconomic outcomes. When high-income earners and UHNW individuals acquire more resources, they do not let their money sit idly in their bank accounts. Instead, they purchase financial assets that expand their economic pie even further. The economic and speculative activity of the ultra-wealthy drives up the prices of these assets, thereby squeezing the household budgets of the working-class. This trend can only be reversed with a tax regime that targets concentrated wealth and income. The positive impact of progressive and wealth taxation cannot be overstated. If well designed and targeted to those at the very top of the income and wealth distribution, it has the potential to not only improve economic and racial equity in the tax code, but also to raise significant revenue that can help balance budgets, spur productive public investment, grow existing social programs, and create new economic initiatives that empower the working-class. **Share It On Social** A post shared by Institute for Policy Studies (@ips_dc) **Subscribe to our newsletter** **Further reading** IPS is a progressive organization dedicated to building a more equitable, ecologically sustainable, and peaceful society. In partnership with dynamic social movements, we turn transformative policy ideas into action. Subscribe to our newsletter Issue AreasPeace & Foreign PolicyEconomic JusticeClimate JusticeRacial & Gender JusticeLeadership Programs Peace & Foreign Policy Economic Justice Climate Justice Racial & Gender Justice Leadership Programs Peace & Foreign Policy Economic Justice Climate Justice Racial & Gender Justice Leadership Programs ResearchReportsArticlesResources Reports Articles Resources Reports Articles Resources EventsLetelier-Moffitt Human Rights AwardsMarcus Raskin Award for Civic and Intellectual Courage Letelier-Moffitt Human Rights Awards Marcus Raskin Award for Civic and Intellectual Courage Letelier-Moffitt Human Rights Awards Marcus Raskin Award for Civic and Intellectual Courage About UsOur HistoryStaff, Board, and ExpertsCareers and InternshipsProjectsPressContactOur Financials Our History Staff, Board, and Experts Careers and Internships Projects Press Contact Our Financials Our History Staff, Board, and Experts Careers and Internships Projects Press Contact Our Financials © 2025 Institute for Policy Studies Terms of Use"}