{"id": 1575, "name": "WGBH - NPR - Boston", "domain": "wgbh.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wgbh.org/news/politics/2025-06-10/local-veterans-react-to-presidents-use-of-military-force-in-immigration-crackdown-protests", "title": "Local Veterans React To Presidents Use Of Military Force In Immigration Crackdown Protests", "content": "TVAll TV ShowsTV ScheduleWatch GBH 2Watch GBH WORLDWatch GBH KidsGBH Passport All TV Shows TV Schedule Watch GBH 2 Watch GBH WORLD Watch GBH Kids GBH Passport All TV Shows TV Schedule Watch GBH 2 Watch GBH WORLD Watch GBH Kids GBH Passport Radio & PodcastsAll Radio ShowsAll PodcastsRadio ScheduleWays to listen All Radio Shows All Podcasts Radio Schedule Ways to listen All Radio Shows All Podcasts Radio Schedule Ways to listen News Music & Culture Events Support GBHMembershipCorporate SponsorshipDirected GivingPlanned GivingOther Ways to Support Membership Corporate Sponsorship Directed Giving Planned Giving Other Ways to Support Membership Corporate Sponsorship Directed Giving Planned Giving Other Ways to Support TVAll TV ShowsTV ScheduleWatch GBH 2Watch GBH WORLDWatch GBH KidsGBH Passport All TV Shows TV Schedule Watch GBH 2 Watch GBH WORLD Watch GBH Kids GBH Passport All TV Shows TV Schedule Watch GBH 2 Watch GBH WORLD Watch GBH Kids GBH Passport Radio & PodcastsAll Radio ShowsAll PodcastsRadio ScheduleWays to listen All Radio Shows All Podcasts Radio Schedule Ways to listen All Radio Shows All Podcasts Radio Schedule Ways to listen News Music & Culture Events Support GBHMembershipCorporate SponsorshipDirected GivingPlanned GivingOther Ways to Support Membership Corporate Sponsorship Directed Giving Planned Giving Other Ways to Support Membership Corporate Sponsorship Directed Giving Planned Giving Other Ways to Support CRB Classical 99.5 CAI GBH 89.7 **Local veterans react to president’s use of military force in immigration crackdown protests** Share Email Facebook Twitter rgoulston robertgoulstonnews RobertGoulstonReporter robert.goulston@gbh.org Thousands of National Guard troops were deployed to Los Angeles by President Donald Trump to thwart protesters driven by anger over immigration enforcement. The military activation comes after objections from California’s governor and local leaders who contend the protests in the country’s second-largest city were mostly peaceful. Gov. Gavin Newsom is asking the courts to intervene andhalt broad National Guard deploymentin his state. “Personally, I don’t like to see military personnel deployed within our states because we’re trained for foreign adversaries,” said George MacMasters, a combat veteran with two decades of service in the U.S. Marines and Army. “Sure, we’ve taken an oath to protect the Constitution from foreign and domestic threats, but it just strikes me as more third world–type behavior.” MacMasters, a Watertown resident who served in Guantanamo Bay, Iraq and Afghanistan, believes there is an urgent need to address immigration policy in the United States — but he doesn’t believe it’s a military issue. “It needs to be addressed by Congress. They need to finally sit down and work together and come up with a comprehensive plan, how to deal humanely with the millions of immigrants that have come to this country,” he said. Boston-area veterans like MacMasters — at the nonprofit Operation American Soldier in Watertown, the Dedham VFW organization and a grocery store in Westwood that offers a discount to veterans — are concerned about how the military is being used. Paul Nascenzi, of Sharon, was a member of the Norwood National Guard for six years during the Vietnam War. He was never activated but trained for years knowing he raised his right hand to serve and protect the country. “When they tell us to do what you do, you follow orders. Whatever the orders are — when your superiors tell you to do, you do,” Nascenzi said. He didn’t want to specifically talk about the Trump order but says he would only support the use of military as a last resort to ensure public safety. U.S. Marine veteran Bruce Collins, of Quincy, said the military can have an effective role on domestic soil if the need rises to the point where community safety is at risk. “They should use some soldiers,” he said. In this case, though, Collins said he does not have enough information about Trump’s decision to have an opinion if the National Guard is the most effective response. But he said the military has been an effective response tool historically, citing an incident in 1965 involving civil unrest in the Watts neighborhood of Los Angles sparked by police brutality. “If it was a riot, like the Watts riot or something like that, then that’s a different story,” he said. “Then combat soldiers have to go there.” Collins pointed out — military training is far different than police training, so any activation has to be a last resort. “A lot of us are trained as riflemen. I could shoot 500 yards and kill somebody. That’s the whole idea of it,” he said. MacMasters said the country will always agree to disagree but he is convinced the American process still works. “I’m very thankful for our Constitution because it gives us the right to free speech and the right to assemble peacefully. And that’s the key. I think too many people forget that.” rgoulston robertgoulstonnews RobertGoulstonReporter robert.goulston@gbh.org **Explore Topics:** **Subscribe to GBH Daily** Your essential daily newsletter delivering trusted news, local insights, ways to connect, and can't miss programs from Boston and beyond. All Newsletters Privacy Policy In 1775, Boston’s Prince Hall broke Freemasonry’s racial barrier. His global movement marches on. AJR’s Adam Met connects music with movement building in his new book After staffer’s public accusations, Boston launches new investigation GBH Daily: What veterans think about LA Local leaders count on $1 billion boost from next year’s World Cup Mass General Brigham primary care physicians continue push to unionize despite hurdles Local veterans react to president’s use of military force in immigration crackdown protests **More Politics** Misconduct hearing underway for judge accused of helping immigrant avoid ICE arrest Trump is trying to ban states from regulating AI. State lawmakers are pushing back. Wu bucks back at campaign misconduct allegations Boston’s Haitian community on edge after Trump bans travel from their country About GBH GBH Education Services Careers Press Support GBH Donate Membership Corporate Sponsorship Directed Giving Planned Giving Other Ways to Support Terms of use Editorial Guidelines Privacy Policy Accessibility Statement Reports & Filings EEO Public File Assistance with Public Files All FCC Public FilesWGBH-TVWGBX-TVWFXZ-CDWGBH-FMWCRB-FM WGBH-TV WGBX-TV WFXZ-CD WGBH-FM WCRB-FM WGBH-TV WGBX-TV WFXZ-CD WGBH-FM WCRB-FM Contact GBH Contact GBH News Media Inquiries Newsletters Visit Us"}