{"id": 1481, "name": "TorrentFreak", "domain": "torrentfreak.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://torrentfreak.com/google-wins-copyright-claim-dismissal-in-publishers-textbook-piracy-lawsuit-250608/", "title": "Google Wins Copyright Claim Dismissal In Publishers Textbook Piracy Lawsuit 250608", "content": "News▼PiracyPiracy ResearchLaw and PoliticsLawsuitsAnti-PiracyTechnology Piracy Piracy Research Law and Politics Lawsuits Anti-Piracy Technology Piracy Piracy Research Law and Politics Lawsuits Anti-Piracy Technology Contact Subscribe **Google Wins Copyright Claim Dismissal in Publishers’ Textbook Piracy Lawsuit** Home>Lawsuits>Apps and Sites> A lawsuit filed by educational publishers in 2024 accuses Google of profiting from textbook piracy. At the heart of the complaint are claims that Google's ‘systemic and pervasive advertising’ of infringing copies promotes pirated copies sold by third parties. In its recent motion to dismiss, Google argued that the publishers' vicarious liability claim fails to meet the legal standard. In an opinion and order handed down this week, the judge agreed - but not on everything. In common with many services provided by Google, its search engine is wide open and free of charge at the point of delivery. Thequid pro quois the user’s consumption of Google ads, placed by millions of advertisers for all kinds of products. Given the scale, it’s no surprise that some offer products of dubious origin. The question is who can be held liable beyond the seller, and under what specific circumstances. **Textbook Pirates** In June 2024, some of the world’s largest publishers came together in ajoint lawsuittargeting Google. In a complaint filed at a New York federal court, companies including Cengage Learning, Macmillan Learning, Elsevier, and McGraw Hill bemoaned Google’s ‘systemic and pervasive advertising’ of infringing copies of their copyrighted textbooks. The publishers’ allegations concerning Google Shopping describe ads that use unauthorized images of the publishers’ genuine textbooks, some with visible trademarks, to promote sales of pirated copies. A ‘bait-and-switch’ by Google, the publishers allege. More generally, the publishers claim that Google searches for their textbook titles return piracy-heavy results, making their original products more difficult to find. The publishers claim ‘pirate’ ad takedown notices were sent repeatedly to Google, but to little effect. Notifications identifying specific ‘pirate sellers’ as repeat infringers didn’t lead to Google terminating their accounts “within a reasonable time, if at all.” **Google’s Motion to Dismiss** In a recent motion to dismiss, Google sought to thin out the publishers’ claims, which include vicarious copyright infringement, trademark infringement, and violation of New York’s deceptive business practices law. In an opinion and order handed down this week, United States District Judge Jennifer L. Rochon analyzes the publishers’ claims and relevant legal precedents. Google believes the publishers’ vicarious copyright infringement claim should be dismissed; the Judge put that to the test. A vicarious copyright infringement claim must contain two elements: • The right and ability to supervise the infringing conduct and• Direct financial interest in the infringing activity Google moved to dismiss based on the publishers’ alleged failure to plead both elements. The Court had no need to go further than the first. **Ability to Supervise or Control** A finding of vicarious liability in this case turns on Google’s relationship to the pirate textbook sellers (direct infringers), not just the infringement itself. The first element must show that Google had the ability to supervise or control the third parties’ infringing activity yet failed to do so. Google says that because the alleged direct infringement (sales of pirated textbooks) took place on the pirate sellers’ third-party websites, it’s clear that its ability to supervise or control doesn’t extend that far. Citing precedents such as Perfect 10 v. Amazon and Perfect 10 v. Visa, Judge Rochon agrees with Google. In these cases, the ability to terminate an advertising or payment processing relationship, which might indirectly reduce infringement on third-party websites, was not considered to be the ‘direct control’ over infringing activity required for a claim of vicarious liability. In cases including Napster, the opposite was true due to the infringement taking place on a system under Napster’s control, where it had the right to terminate access. **Indirect Effect is Insufficient** The Court accepts that the removal of infringing ads and the termination of accounts may have an indirect effect by reducing traffic to the pirate sellers’ websites. However, that doesn’t mean that Google has any control over the websites where the infringement takes place, or that any measures applied to search would change that. “The fact that ‘search engines [can] effectively cause a website to disappear by removing it from their search results’ is not enough to give rise to vicarious liability,” the order reads. “Plaintiffs have not adequately pleaded that Google has sufficient ability to control or supervise the Pirate Sellers’ infringement, and therefore, Plaintiffs’ vicarious copyright infringement claim fails to state a claim.” **Court Denies Request to Dismiss Trademark Claim** Google’s request to dismiss the publishers’ trademark claim was rejected. The publishers’ claim under15 U.S.C. § 1114(1)(b)relates to “advertisements intended to be used in commerce upon or in connection with the sale, offering for sale, distribution, or advertising of goods or services” when such use is likely to “cause confusion or deceive.” The plaintiffs claim that Google included unauthorized reproductions of their trademarks in the pirate sellers’ ads, having acquired the images containing the marks from the sellers themselves. Google denied that, insisting that it only displayed images where the marks were already applied. The Court found that the publishers had sufficiently pleaded their direct trademark infringement claim, so this element of Google’s motion to dismiss was denied. The case will continue with the trademark claim intact, alongside a contributory copyright infringement claim that was not included in Google’s motion to dismiss. Judge Rochon’s opinion and order is availablehere(pdf) Next Post Previous Post **Tagged In:** Cengage google publishers **You Might Also Like:** Anti-Piracy **Wrong Logo, No Piracy Proof: French Court Rejects DNS Piracy Blocking Bids** May 15, 2025, 12:07by Ernesto Van der Sar Anti-Piracy **Wrong Logo, No Piracy Proof: French Court Rejects DNS Piracy Blocking Bids** May 15, 2025, 12:07by Ernesto Van der Sar Anti-Piracy **AI-Powered News Piracy Site Blocked By ISPs After Court Sides With Publishers** May 14, 2025, 08:19by Andy Maxwell Anti-Piracy **AI-Powered News Piracy Site Blocked By ISPs After Court Sides With Publishers** May 14, 2025, 08:19by Andy Maxwell Anti-Piracy **DNS Piracy Blocking Orders: Google, Cloudflare, and OpenDNS Respond Differently** May 11, 2025, 14:23by Ernesto Van der Sar Anti-Piracy **DNS Piracy Blocking Orders: Google, Cloudflare, and OpenDNS Respond Differently** May 11, 2025, 14:23by Ernesto Van der Sar Submit a correction or tip. Which VPN Providers Really Take Privacy Seriously? TorrentGalaxy Has a Rough Start Under New Owners (Update) Iconic Torrent Site RARBG Shuts Down, All Content Releases Stop ‘U.S. Authorities Seize Z-Library Domain Names’ House of The Dragon Season Finale Leaks Early on Pirate Sites 15554Breaking news stories **15554** Breaking news stories **15554** Breaking news stories **15554** Breaking news stories 179kSocial media followers **179k** Social media followers **179k** Social media followers **179k** Social media followers 19.9kRSS subscribers **19.9k** RSS subscribers **19.9k** RSS subscribers **19.9k** RSS subscribers Copyright·Privacy Policy·VPN Providers·About TorrentFreak"}