{"id": 1884, "name": "Asian Dawn", "domain": "asian-dawn.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.asian-dawn.com/2022/05/08/her-name-was-rina-shimabukuro-and-she-was-raped-and-killed-by-a-former-u-s-marine/", "title": "Her Name Was Rina Shimabukuro And She Was Raped And Killed By A Former U S Marine", "content": "June 11, 2025 TrendingTrendingNowWeekMonthHer Name Was Kim Pham & She Was Beaten to Death for PhotobombingViral Video in Korea Shows Korean Man Abusing His Russian Wife10+ Teens Brutally Rape and Beat Asian Woman to Death **Her Name Was Kim Pham & She Was Beaten to Death for Photobombing** **Viral Video in Korea Shows Korean Man Abusing His Russian Wife** **10+ Teens Brutally Rape and Beat Asian Woman to Death** **Her Name Was Kim Pham & She Was Beaten to Death for Photobombing** **Viral Video in Korea Shows Korean Man Abusing His Russian Wife** **10+ Teens Brutally Rape and Beat Asian Woman to Death** Home NewsNewsMan Arrested For Raping and Murdering 61-Yr-Old Asian WomanMan Who Stabbed 94-Year-Old Asian Woman Multiple Times Gets ProbationHate Crime Charges Added For Black Home Invasion Suspects Targeting Asians **Man Arrested For Raping and Murdering 61-Yr-Old Asian Woman** **Man Who Stabbed 94-Year-Old Asian Woman Multiple Times Gets Probation** **Hate Crime Charges Added For Black Home Invasion Suspects Targeting Asians** **Man Arrested For Raping and Murdering 61-Yr-Old Asian Woman** **Man Who Stabbed 94-Year-Old Asian Woman Multiple Times Gets Probation** **Hate Crime Charges Added For Black Home Invasion Suspects Targeting Asians** EntertainmentEntertainmentHong Kong Model Body Parts Discovered, Ex-Husband and Relatives Charged‘Yu-Gi-Oh’ Creator Died Trying to Save a Woman and ChildFood Critic Claims Korean Fried Chicken Originated from Black People **Hong Kong Model Body Parts Discovered, Ex-Husband and Relatives Charged** **‘Yu-Gi-Oh’ Creator Died Trying to Save a Woman and Child** **Food Critic Claims Korean Fried Chicken Originated from Black People** **Hong Kong Model Body Parts Discovered, Ex-Husband and Relatives Charged** **‘Yu-Gi-Oh’ Creator Died Trying to Save a Woman and Child** **Food Critic Claims Korean Fried Chicken Originated from Black People** SportsSportsOhtani’s Translator Accused of Stealing $16 Million from HimChinese Man Finishes Marathon in 3 ½ hrs While Chain-SmokingHarmony Tan Defeats Serena Williams in First Round of Wimbledon **Ohtani’s Translator Accused of Stealing $16 Million from Him** **Chinese Man Finishes Marathon in 3 ½ hrs While Chain-Smoking** **Harmony Tan Defeats Serena Williams in First Round of Wimbledon** **Ohtani’s Translator Accused of Stealing $16 Million from Him** **Chinese Man Finishes Marathon in 3 ½ hrs While Chain-Smoking** **Harmony Tan Defeats Serena Williams in First Round of Wimbledon** **Her Name Was Rina Shimabukuro and She Was Raped and Killed by a Former U.S. Marine** May 8, 2022 OKINAWA, Japan—This horrific act occurred in April/May 2017. Kenneth Shinzato, 33, was working as a civilian contractor at Kadena Air Base in Okinawa. He was later charged with murder, rape, and illegal disposal of a body in the death of 20-year-old Rina Shimabukuro. Kenneth Shinzato, aka Kenneth Gadson—who is originally from New York—took his Japanese wife’s last name and attempted to assimilate into Japanese culture. 20-year-old Shimabukuro went missing on April 28, 2017, after going for a walk. Her body was found three weeks later. Gadson pleaded guilty to rape resulting in death and abandoning of the body, however, he denied he murdered Shimabukuro, reports theDaily Mail. Gadson revealed to Japanese investigators that he’d fantasized about suicide and rape for years, in statements transcribed by his lawyer and first reported byStars and Stripes. The 33-year-old ex-U.S. Marine claims to have heard voices in his head since he was eight. He accused his foster mother of abuse, which she has denied, and says he fantasized about killing her. Gadson said he had fantasies of abducting, restraining, and raping women throughout his high school and adult years. Gadson even claimed he told Marine recruiters back in 2007 that he wanted to join the military primarily because he“wanted to kill people.” “When she passed my car and I saw her more clearly, I heard the voice in my head to tell me, ‘It’s her’ and that she’s the one that will fulfill my fantasy,”Gadson explained, describing how he abducted Shimabukuro. “I wasn’t 100 percent sure that she was the right one, but when I looked up, I saw a red, full moon and I just knew that that was a sign.” Gadson says he hit Shimabukuro over the head with a stick. “I intended to hit her with the stick and make her lose consciousness, then put her in the suitcase, take her to a hotel and then rape her,”Gadson continued. He claims the plan was to release the victim alive after having his way with her and didn’t fear being caught because of the low reporting rate of sex crimes in Japan. Gadson further explained the headlights of an oncoming car forced him to drag Shimabukuro back from the road, accidentally hitting her head. As Shimabukuro tried to speak, Gadson choked her in a panic, and then went on to fetch a suitcase. Gadson allegedly stopped“assaulting”the victim when he believed she was dead. Gadson took the victim to a wooded area in Onna Village’s Afuso district, where he dumped her body. “When I disposed of her, I thought she may have said something,”the statements said.“I thought that she may be alive, so I stabbed her with a knife to find out.” **South Korean Companies Coming to America’s Rescue** The victim was stabbed multiple times and Gadson claimed she didn’t make a sound. “During the drive home, I was thinking that the effort required to play out my fantasy was more than I expected and the fatigue and stress was not worth it”Gadson said. “I was expecting the police to come for me in a few days, but since they didn’t I stopped worrying about it. I continued with my daily routine and went to work as usual. I didn’t really think about the girl.” Gadson later became a suspect when surveillance footage spotted him purchasing salt and sprinkling it on his car, apparently, in an attempt to get rid of the bloodstains, reports theDaily Mail. Gadson eventually led investigators to the location of Shimabukuro’s body. He was later sentenced to life in prison. The case sparked outrage in Okinawa, where about 47,000 U.S. troops are stationed. The murder led to a bilateral pact limiting immunity from Japanese prosecution for civilian workers at American bases, according to theDaily Mail. Feature Images viaFacebook **Follow us!** Like80kFans Follow5kFollowers Follow6kFollowers **Most Recent** Man Arrested For Raping and Murdering 61-Yr-Old Asian Woman Ohtani’s Translator Accused of Stealing $16 Million from Him Man Who Stabbed 94-Year-Old Asian Woman Multiple Times Gets Probation Hate Crime Charges Added For Black Home Invasion Suspects Targeting Asians Oakland DA Pamela Price Hit with Discrimination Lawsuit **Trending** **Archives** April 2024 March 2024 December 2023 November 2023 October 2023 September 2023 August 2023 July 2023 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 December 2022 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 **Categories** Culture Entertainment News Sports **Search** **Widget** **Man Arrested For Raping and Murdering 61-Yr-Old Asian Woman** **Ohtani’s Translator Accused of Stealing $16 Million from Him** **Man Who Stabbed 94-Year-Old Asian Woman Multiple Times Gets Probation** **Hate Crime Charges Added For Black Home Invasion Suspects Targeting Asians** Terms and Conditions Privacy Policy News Sports Entertainment Shop Welcome to Asian Dawn. Please enter an answer in digits:seventeen − 8 = Enter something special: Please enter an answer in digits:18 − 7 = Terms and Conditions-Privacy Policy"}