{"id": 2088, "name": "Page Six", "domain": "pagesix.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://pagesix.com/2025/06/11/celebrity-news/blake-livelys-proud-sister-robyn-sends-love-to-actress-after-justin-baldoni-countersuit-dismissed/", "title": "Blake Livelys Proud Sister Robyn Sends Love To Actress After Justin Baldoni Countersuit Dismissed", "content": "News Entertainment TV Virtual Reali-Tea Movies Music Awards Sports Lifestyle Travel Real Estate Style Fashion Beauty Shopping Royal Family Parents SocietyLos AngelesMiamiNew York CityPalm BeachWashington, DC Los Angeles Miami New York City Palm Beach Washington, DC Los Angeles Miami New York City Palm Beach Washington, DC PhotosVideoPodcastsEmail Newsletters Photos Video Podcasts Email Newsletters Photos Video Podcasts Email Newsletters NY PostDecider NY Post Decider NY Post Decider **Blake Lively’s ‘proud’ sister Robyn sends love to actress after Justin Baldoni countersuit dismissed** Blake Lively’s older sister Robyn showed the actress some love afterJustin Baldoni’s countersuit was tossed. The “Gossip Girl” alum, 37, re-shared several photos posted by her 57-year-old sibling to her Instagram Story Tuesday. Robyn shared a throwback photo in which she was seen hugging her little sister when she was just a child. **Explore More** **Where Blake Lively and Taylor Swift reportedly stand after Justin Baldoni lawsuit gets tossed** **Blake Lively drags Scooter Braun into Justin Baldoni legal battle** **Julia Fox picks a side in Blake Lively and Justin Baldoni’s legal battle: ‘So inhumane’** “I held you then…” Robyn captioned the photo. In a more recent snap captioned “…now,” Robyn and Blake were seen giving soft smiles. She then shared a third image in which Robyn and Blake were holding hands and smiling at each other. “And always,” she captioned the photo along with a red heart emoji. “No one knows you quite like I do, and man am I ever proud of you,” Robyn continued. “I love you sister.” Blake echoed her sister’s loving words with her own message beneath the re-post. “I love you more,” Blake wrote. “Always. Forever. Near or far. Closer together.” The “Simple Favor” star then included a heart-shaped sticker etched with the words, “I love you so, so hard. Like the most. Ever.” Blake re-shared the images along with Donna Lewis’ 1996 song “I Love You Always Forever.” Robyn’s show of support for Blake came a day after a judge granted the motion to dismiss Baldoni’s $400 million countersuit against Blake and husband Ryan Reynolds, along with his $250 millionlibel lawsuit against the New York Times. According to documents obtained by Page Six Monday, Judge Lewis J. Liman wrote that Baldoni and his production company, Wayfarer Studios, “have not alleged that Lively is responsible for any statements other than the statements in her [California Civil Rights Department] complaint, which are privileged.” Baldoni’s complaint, Liman said, “alleged that Reynolds and [publicist Leslie] Sloane made additional statements accusing Baldoni of sexual misconduct and that the ‘Times’ made additional statements accusing the Wayfarer Parties of engaging in a smear campaign.” “The Wayfarer Parties have not alleged that Reynolds, Sloane or the ‘Times’ would have seriously doubted these statements were true based on the information available to them, as is required for them to be liable for defamation under applicable law,” he continued. Lively’s team of lawyers from Esra Hudson & Mike Gottlieb called the rulinga “total victory and a complete vindication”in a statement to Page Six. “As we have said from day one, this ‘$400 million’ lawsuit was a sham, and the Court saw right through it,” the statement said. However, Baldoni’s attorneydenied that the latest legal twist was a victory for Blake, telling Page Six in a statement Tuesday that the fight is far from over. “Ms. Lively and her team’s predictable declaration of victory is false, so let us be clear about the latest ruling,” the actor’s attorney, Bryan Freedman, said. “While the Court dismissed the defamation related claims, the Court has invited us to amend four out of the seven claims against Ms. Lively, which will showcase additional evidence and refined allegations,” he continued. “This case is about false accusations of sexual harassment and retaliation and a nonexistent smear campaign, which Ms. Lively’s own team conveniently describes as ‘untraceable’ because they cannot prove what never happened.” Freedman dubbed Lively’s allegations “no truer today than they were yesterday.” “And with the facts on our side, we march forward with the same confidence that we had when Ms. Lively and her cohorts initiated this battle and look forward to her forthcoming deposition, which I will be taking,” he said. “We are grateful for the organic show of support from the public and for the dedication of the Internet sleuth community who continue to cover the case with discernment and integrity.” **Want more celebrity and pop culture news?** Start your day with Page Six Daily. **Thanks for signing up!** Please provide a valid email address. By clicking above you agree to theTerms of UseandPrivacy Policy. Want celebrity news as it breaks? Hooked on Housewives? A source told the Daily Mail Tuesday that Baldoni, 41, was feeling confident, yet he also “feels this is a huge kick to the guts.” “He is looking to figure out how to move forward from this current setback,” the source said. Baldoni’s lawyers have until June 23 to amend their claims for breach of implied covenant. Rumors that Blake and Baldoni were feudingsurfaced in August 2024 after their movie, “It Ends With Us,” premiered in New York City. The film’s director and Blake notably did not pose together and avoided talking about each other while doing press for the film adaptation of Colleen Hoover’s book of the same name. Last December, Livelysued Baldoni for sexual harassment, retaliation, breach of contract, infliction of emotional distress, invasion of privacy and lost wages. Baldoniresponded with a $400 million countersuitaccusing Blake and Reynolds of defamation. He also accused the New York Times (the first outlet to report on Blake’s lawsuit) of libelin a $250 million suit. The “Jane The Virgin” alum has repeatedly denied any wrongdoing and has accused Blake of commandeering his directorial responsibilities. If you or someone you know is affected by any of the issues raised in this story, call the Sexual Assault Hotline at 1-800-330-0226. blake lively celebrity families celebrity lawsuits celebrity siblings justin baldoni 6/11/25 These Father’s Day gifts will have Dad looking stylish all summer long Hurry to shop 27 last-minute Amazon Father’s Day gift ideas that are celeb-approved Dolly Parton’s second Kendra Scott collection is inspired by one of her most iconic songs Suni Lee just shared her ‘everyday makeup’ routine — and her favorite products start at $13 Taylor Swift can’t get enough of this ‘symbolic and meaningful’ jewelry brand This story has been shared 23,514 times.23,514Kim Zolciak and Kroy Biermann forced to move out of foreclosed mansion by US Marshals **Kim Zolciak and Kroy Biermann forced to move out of foreclosed mansion by US Marshals** **Kim Zolciak and Kroy Biermann forced to move out of foreclosed mansion by US Marshals** This story has been shared 13,214 times.13,214Julia Fox picks a side in Blake Lively and Justin Baldoni's legal fight **Julia Fox picks a side in Blake Lively and Justin Baldoni's legal fight** **Julia Fox picks a side in Blake Lively and Justin Baldoni's legal fight** This story has been shared 13,031 times.13,031Tarek El Moussa, Christina Haack celebrate daughter's graduation in blended family snaps after his Vegas altercation **Tarek El Moussa, Christina Haack celebrate daughter's graduation in blended family snaps after his Vegas altercation** **Tarek El Moussa, Christina Haack celebrate daughter's graduation in blended family snaps after his Vegas altercation** This story has been shared 8,546 times.8,546Kanye West changes his name for a second time **Kanye West changes his name for a second time** **Kanye West changes his name for a second time** **Now onDecider** Kristin Cavallari Says She Wants To Have Paige DeSorbo On Her ‘Let’s Be Honest’ Podcast After Coming Clean About Craig Conover Romance: “We’re All Girl’s Girls” **Kristin Cavallari Says She Wants To Have Paige DeSorbo On Her ‘Let’s Be Honest’ Podcast After Coming Clean About Craig Conover Romance: “We’re All Girl’s Girls”** **Kristin Cavallari Says She Wants To Have Paige DeSorbo On Her ‘Let’s Be Honest’ Podcast After Coming Clean About Craig Conover Romance: “We’re All Girl’s Girls”** These Father’s Day gifts will have Dad looking stylish all summer long Getting ready for the BET Awards 2025 with Yung Miami Hurry to shop 27 last-minute Amazon Father’s Day gift ideas that are celeb-approved Dolly Parton’s second Kendra Scott collection is inspired by one of her most iconic songs Suni Lee just shared her ‘everyday makeup’ routine — and her favorite products start at $13 **** Advertisement **More Stories** **Page Six** **NYPost** Facebook Twitter Instagram Email YouTube Sections & FeaturesVideoPhotos Video Photos Video Photos Newsletters & FeedsEmail NewslettersPodcastsRSS Feeds Email Newsletters Podcasts RSS Feeds Email Newsletters Podcasts RSS Feeds Contact UsAbout Page SixEditorial StandardsTipsAdvertise/Media KitSelf Service AdvertisingContactLicensing & ReprintsVulnerability Disclosure Program About Page Six Editorial Standards Tips Advertise/Media Kit Self Service Advertising Contact Licensing & Reprints Vulnerability Disclosure Program About Page Six Editorial Standards Tips Advertise/Media Kit Self Service Advertising Contact Licensing & Reprints Vulnerability Disclosure Program"}