{"id": 1959, "name": "Ethics and Public Policy Center (EPPC)", "domain": "eppc.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://eppc.org/publication/eppc-scholar-files-amicus-brief-urging-eleventh-circuit-to-protect-parents-constitutional-rights-against-schools-imposition-of-gender-support-plan/", "title": "Eppc Scholar Files Amicus Brief Urging Eleventh Circuit To Protect Parents Constitutional Rights Against Schools Imposition Of Gender Support Plan", "content": "ABOUTAnnual ReportOur MissionNewsBoard of DirectorsStaffEmployment OpportunitiesContact EPPC SCHOLARSALL SCHOLARSRyan T. AndersonErika BachiochiNathanael BlakeJames BowmanPatrick T. BrownJennifer BrysonEric CohenAlexandra DeSanctisNatalie DodsonTheresa FarnanMary FioRitoMichael FragosoDevorah GoldmanCarrie GressJamie Bryan HallMary HassonAaron KheriatyEric KniffinStanley KurtzFrancis X. MaierJohn McCormackNoelle MeringClare MorellRachel N. MorrisonJohn MuellerHenry OlsenJennifer PattersonAlexander RaikinAaron RothsteinLuma SimmsCarter SneadCarl R. TruemanAlgis ValiunasAndrew T. WalkerEdward WhelanGeorge WeigelStephen P. White PROGRAMSALL PROGRAMSAdministrative State Accountability ProjectBioethics and American DemocracyCatholic StudiesCatholic Women’s ForumThe Constitution, the Courts, and the CultureEconomics and EthicsEducation and American IdealsEvangelicals in Civic LifeLife and Family InitiativePerson and Identity ProjectRichard John Neuhaus FellowshipTechnology and Human Flourishing ProjectTheTertio MillennioSeminarTheology of Home Project PUBLICATIONS MOREEventsMediaBooksPodcastsAmicus BriefsEngagement on Agency ActionsBranding SUBSCRIBE DONATE **EPPC Scholar Files Amicus Brief Urging Eleventh Circuit to Protect Parents’ Constitutional Rights Against School’s Imposition of “Gender Support Plan”** Published April 23, 2025 PDF ByEric Kniffin On April 23, 2025, Ethics and Public Policy Center fellowEric Kniffinfiled anamicus briefinLittlejohn v. School Board of Leon County, Florida. This case was brought by Florida parents after school district officials secretly met with their middle school daughter to develop a “gender support plan” that let her choose what name, pronouns, and restrooms she would use, and with what sex she would be housed on overnight trips. The Eleventh Circuit’s panel held that the Littlejohns failed to state a claim. It also reasoned that the application of the school’s “gender support plan” through its “LGBTQ+ Guide” did not “shock the conscience” because the school meant to “help the child.” Kniffin’samicus brief, filed in support of the Littlejohns’ petition to rehear the case en banc, argues that the Eleventh Circuit’s panel decision incorrectly applies prior precedent and fails to recognize the violation of the Littlejohns’ fundamental constitutional right to direct the care of their child — regardless of whether that violation passes a subjective test of “shock[ing] the conscience.” Eric Kniffin is a fellow at the Ethics and Public Policy Center, where he works on a range of initiatives to protect and strengthen religious liberty as part of EPPC’sAdministrative State Accountability Project. Most Read 1 **Can Congressional Republicans Be Big, Beautiful — and Pro-Family?** **Can Congressional Republicans Be Big, Beautiful — and Pro-Family?** Δ Sign up to receive EPPC's biweekly e-newsletter of selected publications, news, and events. Your support impacts the debate on critical issues of public policy. More in Administrative State Accountability Project 1 **EPPC Scholars Submit Comment Urging Administration to Rescind Harmful Regulations** **EPPC Scholars Submit Comment Urging Administration to Rescind Harmful Regulations** 2 **Terminology and Definition: Replacing “Gender-Affirming Care”with “Sex-Rejecting Procedures”** **Terminology and Definition: Replacing “Gender-Affirming Care”with “Sex-Rejecting Procedures”** 3 **Dobbs, Equality and the Contested Meaning of Women’s Rights** **Dobbs, Equality and the Contested Meaning of Women’s Rights** 4 **EPPC Scholar Submits Public Comment Supporting Fair Housing Rule** **EPPC Scholar Submits Public Comment Supporting Fair Housing Rule** **Related Publications** Stanley Kurtz This past Sunday’s New York Times opinion section featured a long op-ed by Harvard psychologist Steven Pinker in defense of his university. A frequent… Articles Stanley Kurtz This past Sunday’s New York Times opinion section featured a long op-ed by Harvard psychologist Steven Pinker in defense of his university. A frequent… Articles National Review/ May 28, 2025 Henry Olsen Thursday’s U.K.-U.S. trade deal may give hope to Canadian Prime Minister Mark Carney that his nation could score a similarly rapid… Articles Henry Olsen Thursday’s U.K.-U.S. trade deal may give hope to Canadian Prime Minister Mark Carney that his nation could score a similarly rapid… Articles National Review Online/ May 24, 2025 Luma Simms Letting them in is consistent with U.S. interests and Trump’s security priorities. Articles Luma Simms Letting them in is consistent with U.S. interests and Trump’s security priorities. Articles Wall Street Journal/ May 21, 2025 Michael Fragoso The Supreme Court recently heard arguments in Trump v. CASA, Inc., a case that could decide the future of so-called universal or “non-party”… Articles Michael Fragoso The Supreme Court recently heard arguments in Trump v. CASA, Inc., a case that could decide the future of so-called universal or “non-party”… Articles City Journal/ May 20, 2025 Are you enjoying this article? Share with a Friend! Always see the latest fromEric Kniffinand other EPPC Scholars. Sign up for EPPC Briefly! Learn Publications Programs Scholars Connect Events Support Contact Explore Appearances News Releases EPPC Briefly Disclaimer The views expressed by EPPC scholars in their work are their individual views only and are not to be imputed to EPPC as an institution. Copyright © 2025 Ethics and Public Policy Center"}