{"id": 2114, "name": "RedState", "domain": "redstate.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://redstate.com/sister-toldjah/2025/06/11/massive-setback-for-rioters-democrats-after-dhs-announces-results-of-latest-la-immigration-sweep-n2190347", "title": "Massive Setback For Rioters Democrats After Dhs Announces Results Of Latest La Immigration Sweep N2190347", "content": "JOIN VIP LOGIN MY ACCOUNTunread messagesAccount SettingsMessagesNewsletter SubscriptionsComment SettingsLog Out Authors Columns Videos Podcasts Store Massive Setback for Rioters, Democrats After DHS Announces Results of Latest LA Immigration Sweep JOIN VIP LOGIN **Massive Setback for Rioters, Democrats After DHS Announces Results of Latest LA Immigration Sweep** As I've noted before, implicit in what we're seeing take place in California from the violent woketivists and their Democrat/media accomplices is that if they keepat itlong enough, President Trump is going to get ICE to back down from the immigration sweeps that Democrats like Gov. Gavin Newsom and LA Mayor Karen Bass have blamed for the start of the riots. Now, obviously, that's not going to happen, considering the National Guard is already on the ground in Los Angeles at his order, and the Marines arereportedlyon their way as well. Nevertheless, the rioters kept proceeding with the arson, the rock throwing, and the Molotov cocktail hurling, though ultimately it resulted in some of them getting identified and with their images beingplasteredon \"most wanted\" posters by the DOJ, while some of the other criminal illegals who allegedly participated in the chaos and violence have been arrested and charged with attempted murder. READ MORE:Another Violent LA Riots Illegal Gets Nabbed by ICE, and This Guy's Gonna Wish He Stayed in Mexico But though Newsom and Bass have continued to demand that the immigration sweeps stop, they haven't, with DHSannouncingon Wednesday information on some of the illegal immigrants whom they had taken into custody during the sweeps, and as the rioters were trying to hamper them: Today, the Department of Homeland Security (DHS) released more information about some of the worst of the worst criminal illegal aliens arrested during the ongoing Immigration and Customs Enforcement (ICE) operation in Los Angeles (LA), California (CA). These arrests occurred June 9 and 10 despite prolonged violent riots and assaults on ICE and other federal law enforcement officers. “Murderers, pedophiles, and drug traffickers. These are the types of criminal illegal aliens that rioters are fighting to protect. How much longer will Governor Newsom and Mayor Karen Bass continue to prioritize these criminal illegal aliens over their own citizens?”said Assistant Secretary Tricia McLaughlin.“Secretary Noem has a message to the LA rioters: you will not stop us or slow us down. ICE will continue to enforce the law and arrest criminal illegal aliens.” The names include: Gerardo Antonio-Palacios, an illegal alien from Mexico, was arrested by ICE Los Angeles. He has criminal convictions for homicide and burglary. He was previously deported. Mab Khleb -ICE Los Angeles arrested Mab Khleb, a 53-year-old illegal alien from Cambodia. Khleb’s criminal history includes a conviction for transport of a controlled substance, possession of controlled substance, lewd action with a child, and battery. Sang Louangprasert -ICE Los Angeles arrested Sang Louangprasert, a 66-year-old illegal alien from Laos. Louangprasert’s criminal history includes a conviction for lewd or lascivious acts with a child under 14 in Fresno, CA and inflicting corporal injury, spouse or cohabitant in Santa Barbara, CA. Antonio Benitez-Ugarte, an illegal alien from Mexico, was arrested by ICE Los Angeles and has been convicted of drug trafficking. Read the more complete listhere. Fox News national correspondent Bill Melugin shared some of the photos: NEW: DHS announces that some of the illegal aliens ICE LA arrested in the Los Angeles area yesterday & Monday include a convicted murderer, multiple pedophiles, and a drug trafficker. ICE sources tell me they've made 300+ arrests since their LA operation began on Friday. Some of…pic.twitter.com/CwiYRj2weT Incredibly, advocates for illegal immigrants were trying to suggest that some of the ones nabbed shouldn't have been arrested... ICE's \"public safety\" narrative often collapses after scrutiny:The guy on the left was a prison firefighter, a job not available to safety threats. He was granted bond from ICE detention in 2022.Similarly, the man on the right was paroled by CA in 2022 for good behavior.https://t.co/1mDzDdlZhjpic.twitter.com/kgeqeZNmCb ...which prompted this response from Melugin: You can’t be serious? The guy on the right is a convicted murderer & the guy on the left has convictions for shooting into an occupied house, willful child cruelty, DUI, assault with a firearm, & has had a deportation order since 2020.Youre saying ICE should *NOT* arrest them?https://t.co/P9K4Ma6lZs On Monday, Bill Essayli, U.S. Attorney for the Central District of California,confirmedwith Fox News that immigration enforcement effortswould not beslowing down and that the riots had, in fact, galvanized federal law enforcement to press on: He said absolutely not - and that the riots will have the opposite effect, leading to more military and federal resources being sent into LA. Nothing will stop their federal immigration operations, he said. It's something Essayli reiterated during an interview with \"Ingraham Angle\" host Laura Ingraham on Tuesday: If you do the crime, you’ll do the time. Interim U.S. Attorney Bill Essayli isn’t letting the riots deter immigration enforcement and is going after the agitators.“We are making arrests and they will face federal charges…We got to get hard time on these people.”pic.twitter.com/hcu6vHtxSg To keep up with the latest developments on the LA riots, pleaseclick here. Editor’s Note:Thanks to President Trump, illegal immigration into our great country has virtually stopped. Despite the radical left's lies, new legislation wasn't needed to secure our border, just a new president. Please help us continue to report the truth about the president's border policies and mass deportations. Join RedState VIP and use promo codeFIGHTto get 60% off your membership. North Carolina-based Stacey Matthews, a former liberal who also writes under the name \"Sister Toldjah,\" has been writing about media bias, social issues, and the culture wars since 2003. You can follow her on Twitterhere. **Join the conversation as a VIP Member** **TRENDING ON TOWNHALL MEDIA** Copyright Redstate.com/Salem Media. All Rights Reserved. Terms under which this service is provided to you."}