{"id": 1599, "name": "WMNF - NPR - Tampa", "domain": "wmnf.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wmnf.org/desantis-administrations-cease-and-desist-letter-sent-to-reporter-raises-freedom-and-ethics-concerns/", "title": "Desantis Administrations Cease And Desist Letter Sent To Reporter Raises Freedom And Ethics Concerns", "content": "ListenHow to ListenScheduleChannelsPlaylistsPodcastsShow HostsProgrammer Application How to Listen Schedule Channels Playlists Podcasts Show Hosts Programmer Application How to Listen Schedule Channels Playlists Podcasts Show Hosts Programmer Application MusicMusic BlogSong of the DayTop 10 on WMNFSubmit Music Music Blog Song of the Day Top 10 on WMNF Submit Music Music Blog Song of the Day Top 10 on WMNF Submit Music NewsLatest NewsHurricane seasonFlorida Legislature2024 electionsFlorida Voter GuideThe ScoopBlogWeatherStation Updates Latest News Hurricane season Florida Legislature 2024 elections Florida Voter Guide The Scoop Blog Weather Station Updates Latest News Hurricane season Florida Legislature 2024 elections Florida Voter Guide The Scoop Blog Weather Station Updates EventsWMNF EventsCommunity EventsConcert CalendarConcert Calendar EventWMNF Station Calendar WMNF Events Community Events Concert Calendar Concert Calendar Event WMNF Station Calendar WMNF Events Community Events Concert Calendar Concert Calendar Event WMNF Station Calendar AboutDiscover WMNFAbout WMNFSupportVolunteerStaffLeadershipApplication for Board of DirectorsCareersPublic ReportsCommunity PartnersContact Info Discover WMNF About WMNF Support Volunteer Staff Leadership Application for Board of Directors Careers Public Reports Community Partners Contact Info Discover WMNF About WMNF Support Volunteer Staff Leadership Application for Board of Directors Careers Public Reports Community Partners Contact Info SupportDonatePlanned GivingWMNF EndowmentGift MatchingDonate a CarDonate PropertyMembershipVolunteerRent Our StudiosUnderwrite and SponsorStart a Fundraiser Donate Planned Giving WMNF Endowment Gift Matching Donate a Car Donate Property Membership Volunteer Rent Our Studios Underwrite and Sponsor Start a Fundraiser Donate Planned Giving WMNF Endowment Gift Matching Donate a Car Donate Property Membership Volunteer Rent Our Studios Underwrite and Sponsor Start a Fundraiser ListenHow to ListenScheduleChannelsPlaylistsPodcastsShow HostsProgrammer Application How to Listen Schedule Channels Playlists Podcasts Show Hosts Programmer Application How to Listen Schedule Channels Playlists Podcasts Show Hosts Programmer Application MusicMusic BlogSong of the DayTop 10 on WMNFSubmit Music Music Blog Song of the Day Top 10 on WMNF Submit Music Music Blog Song of the Day Top 10 on WMNF Submit Music NewsLatest NewsHurricane seasonFlorida Legislature2024 electionsFlorida Voter GuideThe ScoopBlogWeatherStation Updates Latest News Hurricane season Florida Legislature 2024 elections Florida Voter Guide The Scoop Blog Weather Station Updates Latest News Hurricane season Florida Legislature 2024 elections Florida Voter Guide The Scoop Blog Weather Station Updates EventsWMNF EventsCommunity EventsConcert CalendarConcert Calendar EventWMNF Station Calendar WMNF Events Community Events Concert Calendar Concert Calendar Event WMNF Station Calendar WMNF Events Community Events Concert Calendar Concert Calendar Event WMNF Station Calendar AboutDiscover WMNFAbout WMNFSupportVolunteerStaffLeadershipApplication for Board of DirectorsCareersPublic ReportsCommunity PartnersContact Info Discover WMNF About WMNF Support Volunteer Staff Leadership Application for Board of Directors Careers Public Reports Community Partners Contact Info Discover WMNF About WMNF Support Volunteer Staff Leadership Application for Board of Directors Careers Public Reports Community Partners Contact Info SupportDonatePlanned GivingWMNF EndowmentGift MatchingDonate a CarDonate PropertyMembershipVolunteerRent Our StudiosUnderwrite and SponsorStart a Fundraiser Donate Planned Giving WMNF Endowment Gift Matching Donate a Car Donate Property Membership Volunteer Rent Our Studios Underwrite and Sponsor Start a Fundraiser Donate Planned Giving WMNF Endowment Gift Matching Donate a Car Donate Property Membership Volunteer Rent Our Studios Underwrite and Sponsor Start a Fundraiser **DeSantis administration’s cease-and-desist letter sent to reporter raises freedom and ethics concerns** **Listen:** Governor Ron DeSantis’s administration sent a cease-and-desist letter to an Orlando Sentinel journalist reporting onHOPE Florida, Casey DeSantis’s charity under criminal investigation. The letter is raising eyebrows from First Amendment and ethicsadvocates. On June 6, the state’s Department of Children and Families sent the letter, claiming the reporter intimidated foster families into speaking negatively about the charity. It’s a claim that the Orlando Sentinel executive editor says is completely false, and media ethics expert Kelly McBride calls inappropriate. “This is not at all within the way the constitution or the law is supposed to work, and the governor is operating way outside his authority,” McBride told WMNF. McBride is the chair of the Craig Newmark Center for Ethics and Leadership at Poynter, a media institute. “I don’t think it will have a chilling effect. It may have the exact opposite effect, which is reporters may be emboldened to challenge the governor because its so clearly not appropriate to request that reports stop reporting,” McBride said. She said the letter will bring more attention to the case. “I think most of the public sees the reporting that’s been done already, right? And sees that like, oh, ten million dollars was transferred to your wife’s private charity. We should know more about that,” McBride said. In a statement to WMNF, DCF says the Orlando Sentinel can “report on whatever they want”, but don’t have a right to “harass foster families.” “The grounds were laid out in the letter: Mr. Schweers threatened and harassed multiple Florida foster families, and we received complaints from those families. The Orlando Sentinel can report on whatever they want, but they do not have a right to harass foster families.” DCF wrote in a statement sent to WMNF. Orlando Sentinel Executive Editor Roger Simmons told WMNF they stand by their stories and the letter was an attempt to chill free speech. “We stand by our stories and reject the state’s attempt to chill free speech and encroach on our First Amendment right to report on an important issue. The state’s characterization of our reporter’s conduct is completely false,” Simmons wrote in a statement. **OneResponse to “DeSantis administration’s cease-and-desist letter sent to reporter raises freedom and ethics concerns”** Nino De SantisJune 11th, 2025Ron De Santis betrayed Florida and USA. He has done nothing to implement our OIL ALTERNATIVE GAZ AQUAHOL 0 Co2 emissions that received US NEWS for DOUBLING the fuel mileage on a Hollywood FL POLICE CAR with water and alcohol in 1979.Reply Ron De Santis betrayed Florida and USA. He has done nothing to implement our OIL ALTERNATIVE GAZ AQUAHOL 0 Co2 emissions that received US NEWS for DOUBLING the fuel mileage on a Hollywood FL POLICE CAR with water and alcohol in 1979. Ron De Santis betrayed Florida and USA. He has done nothing to implement our OIL ALTERNATIVE GAZ AQUAHOL 0 Co2 emissions that received US NEWS for DOUBLING the fuel mileage on a Hollywood FL POLICE CAR with water and alcohol in 1979. **Leave a Reply** Click here to cancel reply. Name (required) Mail (required)(will not be published) Website XHTML:You can use these tags:<a href=\"\" title=\"\"> <abbr title=\"\"> <acronym title=\"\"> <b> <blockquote cite=\"\"> <cite> <code> <del datetime=\"\"> <em> <i> <q cite=\"\"> <s> <strike> <strong> Δ **Recent Articles** FPRENWednesday, June 11th 2025The terminology you need to know for hurricane season The terminology you need to know for hurricane season The terminology you need to know for hurricane season BlogWednesday, June 11th 2025Public Media Faces Existential Threat as Congress Prepares Critical Vote Public Media Faces Existential Threat as Congress Prepares Critical Vote Public Media Faces Existential Threat as Congress Prepares Critical Vote journalismWednesday, June 11th 2025DeSantis administration’s cease-and-desist letter sent to reporter raises freedom and ethics concerns DeSantis administration’s cease-and-desist letter sent to reporter raises freedom and ethics concerns DeSantis administration’s cease-and-desist letter sent to reporter raises freedom and ethics concerns EnvironmentWednesday, June 11th 2025Florida ghost orchids could get stronger protections Florida ghost orchids could get stronger protections Florida ghost orchids could get stronger protections EnvironmentWednesday, June 11th 2025The Scoop: Wed. June 11, 2025, Tampa Bay and Florida headlines by WMNF The Scoop: Wed. June 11, 2025, Tampa Bay and Florida headlines by WMNF The Scoop: Wed. June 11, 2025, Tampa Bay and Florida headlines by WMNF **Current Weather Conditions** Donate Volunteer Planned Giving Employer Gift Matching Start A Fundraiser Donate a car You may also like Official tropical weather advisories come from the National Hurricane Center... This is happening now! Public media stations across America are... The U.S. Fish and Wildlife Service is now moving to... WMNF headlines including Pasco deputies, deputy shooting, Gwen Henderson death,... **Ways to listen** WMNF is listener-supported. That means we don't advertise like a commercial station, and we're not part of a university. **Ways to support** WMNF volunteers have fun providing a variety of needed services to keep your community radio station alive and kickin'. Δ Listen News Schedule Events Discover About Support Donate Planned Giving WMNF Endowment Employer Gift Matching Car donations Membership Volunteer Rent Our Studios Start a Fundraiser Facebook Twitter YouTube Linkedin Proud member ofProject Galileoand protected by Cloudflare WMNF is a registered 501(с)3 charitable organization - The Nathan B. Stubblefield Foundation, Inc. |Online Public File 2025 WMNF 88.5 FM Privacy Policy **** **** Nothing Found Donate Contact DJ Full schedule Have a request?Or if you just wanna let our DJ know you’re enjoying their show. Call the DJ:813-239-9663Email the DJ:[email protected]Text the DJ:813-433-0885 Signup below to get The Scoop delivered every weekday to your email inbox. Δ WMNF advises you to check with the individual venues or event planners listed before heading to anything posted here. There is a high likelihood that many events have been or will be canceled or postponed. Thank you for visiting wmnf.org ~ Please read theSubmission Guidelinesbefore submitting your event. Name*FirstLast Email* Phone Event Name* Event Date*MM slash DD slash YYYY Start Time*:HoursMinutesAMPMAM/PM End Time*:HoursMinutesAMPMAM/PM Event LocationStreet AddressAddress Line 2CityState / Province / RegionZIP / Postal CodeAfghanistanAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntigua and BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBonaire, Sint Eustatius and SabaBosnia and HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCabo VerdeCambodiaCameroonCanadaCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos IslandsColombiaComorosCongoCongo, Democratic Republic of theCook IslandsCosta RicaCroatiaCubaCuraçaoCyprusCzechiaCôte d'IvoireDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEswatiniEthiopiaFalkland IslandsFaroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island and McDonald IslandsHoly SeeHondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic ofKorea, Republic ofKuwaitKyrgyzstanLao People's Democratic RepublicLatviaLebanonLesothoLiberiaLibyaLiechtensteinLithuaniaLuxembourgMacaoMadagascarMalawiMalaysiaMaldivesMaliMaltaMarshall IslandsMartiniqueMauritaniaMauritiusMayotteMexicoMicronesiaMoldovaMonacoMongoliaMontenegroMontserratMoroccoMozambiqueMyanmarNamibiaNauruNepalNetherlandsNew CaledoniaNew ZealandNicaraguaNigerNigeriaNiueNorfolk IslandNorth MacedoniaNorthern Mariana IslandsNorwayOmanPakistanPalauPalestine, State ofPanamaPapua New GuineaParaguayPeruPhilippinesPitcairnPolandPortugalPuerto RicoQatarRomaniaRussian FederationRwandaRéunionSaint BarthélemySaint Helena, Ascension and Tristan da CunhaSaint Kitts and NevisSaint LuciaSaint MartinSaint Pierre and MiquelonSaint Vincent and the GrenadinesSamoaSan MarinoSao Tome and PrincipeSaudi ArabiaSenegalSerbiaSeychellesSierra LeoneSingaporeSint MaartenSlovakiaSloveniaSolomon IslandsSomaliaSouth AfricaSouth Georgia and the South Sandwich IslandsSouth SudanSpainSri LankaSudanSurinameSvalbard and Jan MayenSwedenSwitzerlandSyria Arab RepublicTaiwanTajikistanTanzania, the United Republic ofThailandTimor-LesteTogoTokelauTongaTrinidad and TobagoTunisiaTurkmenistanTurks and Caicos IslandsTuvaluTürkiyeUS Minor Outlying IslandsUgandaUkraineUnited Arab EmiratesUnited KingdomUnited StatesUruguayUzbekistanVanuatuVenezuelaViet NamVirgin Islands, BritishVirgin Islands, U.S.Wallis and FutunaWestern SaharaYemenZambiaZimbabweÅland IslandsCountry Event DescriptionAnything else we should know? (website/event contact information) CAPTCHA EmailThis field is for validation purposes and should be left unchanged. Δ WMNF is non-commercial community conscious radio– we survive only due to the generosity of listeners like you. Please consider a sustaining monthly contribution and receive annual coupons for swag when youJoin the WMNF Circle of Friends."}