{"id": 982, "name": "ERR News (Estonia Public Broadcasting)", "domain": "news.err.ee", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://news.err.ee/1609719408/bulgaria-s-stiliana-nikolova-dominates-european-rhythmic-gymnastics-championships-in-tallinn", "title": "Bulgaria S Stiliana Nikolova Dominates European Rhythmic Gymnastics Championships In Tallinn", "content": "Kultuur AK Eesti uudised Sport Värsked raadiouudised Välisuudised Eeter rus.err.ee Majandus Teadus news.err.ee Arvamus EP valimised Ilm Viipekeelsed ETVOtseTelekava Otse Telekava Otse Telekava ETV2OtseTelekavaLasteekraan Otse Telekava Lasteekraan Otse Telekava Lasteekraan ETV+Прямой эфирТелепрограмма Прямой эфир Телепрограмма Прямой эфир Телепрограмма VikerraadioOtseJärelkuulamineSaatekavaPodcastidRaadioteater Otse Järelkuulamine Saatekava Podcastid Raadioteater Otse Järelkuulamine Saatekava Podcastid Raadioteater Raadio 2OtseJärelkuulamineSaatekavaR2.EXTRA veebijaamadAastahittAastahitt ajalugu Otse Järelkuulamine Saatekava R2.EXTRA veebijaamad Aastahitt Aastahitt ajalugu Otse Järelkuulamine Saatekava R2.EXTRA veebijaamad Aastahitt Aastahitt ajalugu KlassikaraadioOtseJärelkuulamineSaatekavaPodcastidKlaRa KlassikaKlaRa JazzKlara Nostalgia Otse Järelkuulamine Saatekava Podcastid KlaRa Klassika KlaRa Jazz Klara Nostalgia Otse Järelkuulamine Saatekava Podcastid KlaRa Klassika KlaRa Jazz Klara Nostalgia Raadio 4Прямой эфирЭфир за неделюПрограммаПодкасты Прямой эфир Эфир за неделю Программа Подкасты Прямой эфир Эфир за неделю Программа Подкасты Raadio TallinnOtse Otse Otse JupiterJupiter+Jupiter IoLasteekraanRaadioteater Jupiter+ Jupiter Io Lasteekraan Raadioteater Jupiter+ Jupiter Io Lasteekraan Raadioteater EST RUS ENG UudisedKultuurAKEesti uudisedSportVärsked raadiouudisedVälisuudisedEeterrus.err.eeMajandusTeadusnews.err.eeArvamusEP valimisedIlmViipekeelsed TVETVETV2ETV+ RaadioVikerraadioRaadio 2KlassikaraadioRaadio 4Raadio Tallinn Lastele JupiterJupiter Arhiiv LatestLatestLast 24 hoursTallinnTartu Last 24 hoursTallinnTartu Last 24 hours Tallinn Tartu Last 24 hoursTallinnTartu Last 24 hours Tallinn Tartu Last 24 hours Tallinn Tartu PoliticsPolitics EconomyEconomy DefenseDefense OpinionOpinion CultureCulture ScienceScience SportsSports FeaturesFeaturesExplainersFeaturesInterviews ExplainersFeaturesInterviews Explainers Features Interviews ExplainersFeaturesInterviews Explainers Features Interviews Explainers Features Interviews HelpHelp LatestLast 24 hoursTallinnTartu Last 24 hours Tallinn Tartu Last 24 hours Tallinn Tartu Politics Economy Defense Opinion Culture Science Sports FeaturesFeaturesExplainersFeaturesInterviews Features Explainers Features Interviews Features Explainers Features Interviews Help UudisedKultuurAKEesti uudisedSportVärsked raadiouudisedVälisuudisedEeterrus.err.eeMajandusTeadusnews.err.eeArvamusEP valimisedIlmViipekeelsed TVETVETV2ETV+ RaadioVikerraadioRaadio 2KlassikaraadioRaadio 4Raadio Tallinn Lastele JupiterJupiter Arhiiv **Bulgaria's Stiliana Nikolova dominates European Rhythmic Gymnastics Championships in Tallinn** Bulgaria's Stiliana Nikolova shone brightly at the European Rhythmic Gymnastics Championships in Tallinn last week, winning three golds and one silver. \"The audience was amazing,\" Nikolova told ERR afterwards. \"I am really grateful for the support. It helped me a lot. The crowd was wonderful, not only today but throughout the whole competition.\" With the championship taking place from June 4-8 in the Estonian capital, Nikolova took silver in all-round individual event, before claiming gold in the individual hoop, ball and clubs. \"It's a competition and of course I feel nervous, but that's normal in sport,\" she said. Nikolova, who lived in Egypt for the first 13 years of her life, appears to have inherited her natural sporting talent from her parents. Her father, Iliya Dyakov, was part of the Bulgarian men's national football squad for the 1986 World Cup in Mexico, and her mother, Paulina Nikolova was one of the \"Golden Girls of Bulgaria,\" who dominated rhythmic gymnastics in the 1980s. Affectionately known as \"Stilito,\" Nikolova has now won a total of 10 individual medals at the European Championships over the course of her career, with three of her four golds won in Tallinn. --- Follow ERR News onFacebook,BlueskyandXand never miss an update! Editor:Michael Cole, Anders Nõmm **Related** **Estonian group routine team just outside European championships medals in Tallinn** **Estonia's junior rhythmic gymnastics team just outside European medals** **First ever European rhythmic gymnastics champs held in Estonia get underway** **Estonian rhythmic gymnastics team gives media demo ahead of European champs** **Olympic gold medalist to compete in next month's Rhythmic Gymnastics Euros in Tallinn** **news in simple estonian** **Lihtsad uudised 6. juunil** **Lihtsad uudised 6. juunil** **listen: radio tallinn** **** **** **watch: jupiter** **watch: jupiter** **** **** **About us** **About us** ERR News is the English-language service of Estonian Public Broadcasting, run by a fully independent editorial team.To read up on ERR News' comments rules and to contact ERR's other services, please follow the link below.Staff, contacts & comments **Latest news** **Fourth grade students struggling with transition to Estonian-language education** **Bulgaria's Stiliana Nikolova dominates European Rhythmic Gymnastics Championships in Tallinn** **EJL signs agreement with Norway to develop women's football and artificial pitches** **Tartu festival to celebrate World Refugee Day this Saturday** **Justice chancellor still waiting on requested car tax amendment** **Estonian line judge's French Open final a poignant one this year** **MP asks data watchdog to investigate classified gender equality bill** **TV 10 youth olympics: Highlights from girls' and boys' events in Tallinn** **Institute head: Estonia fueling soaring price level with tax hikes** **Heiko Rannula's Legia Warsaw lose in heartbreaking fashion in Polish finals opener** **be prepared!** **Download the 'Ole valmis!' crisis preparedness app** **Download the 'Ole valmis!' crisis preparedness app** **Most Read articles** **Fall mushrooms popping up in Estonia's forests after erratic spring weather** **Estonian journalist convicted of treason in Russian media case** **Gallery: US star Justin Timberlake defies the rain to wow Estonian crowd** **Estonia among six EU nations voting against flight compensation regulation** **Estonian authority stops illegal sheep slaughter in Lääne-Viru County** **Harri Tiido: On the nature of Russian power** **Researcher: Palestinian foreign minister's visit to Estonia was 'surprising'** **Study: More and more people cannot afford to buy a home in Tallinn** **public broadcasters launch news portal** **European public broadcasters launch joint trusted news portal** **European public broadcasters launch joint trusted news portal** **useful information** **Commenting on ERR News articles** **Commenting on ERR News articles** **ERR News materials terms of use** **ERR News materials terms of use** Arhiiv Üldinfo Avalik teave Kontaktid Pressiteated Eetikanõunik Tule tööle/praktikale Ajalugu In English По-русски Arhiivide üldinfo arhiiv.err.ee Koopiad ja kasutamine Muuseum Kostüümilaenutus Tehnilised teenused Helistuudiod Kultuuriteated Uudised Sport Kultuur Novaator Eeter Ilm rus.err.ee news.err.ee ETV ETV2 ETV+ Vikerraadio Raadio 2 Klassikaraadio Raadio 4 Raadio Tallinn Jupiter Vaegkuuljatele ja -nägijatele Kasutustingimused Isikuandmete töötlemisest Jupiter+ Jupiter IO Lasteekraan Raadioteater"}