{"id": 1034, "name": "Now Entertainment", "domain": "nowentertainment.net", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://nowentertainment.net/how-streaming-services-have-transformed-television-leading-movie-producer-and-actor-scott-hamm-duenas-explains/", "title": "How Streaming Services Have Transformed Television Leading Movie Producer And Actor Scott Hamm Duenas Explains", "content": "Home Music Video In the news Shop Submissions Donate **How Streaming Services Have Transformed Television: Leading Movie Producer and Actor Scott Hamm Duenas Explains** All views and opinions expressed in this article are the author’s own and are not endorsed by or reflective of Now Entertainment. As a reader-supported publication, we may receive compensation for the products and services mentioned in this story. Learn more about how wemake moneyand oureditorial policies. The days of the American public gathering around the television at the same time to watch a handful of shows on primetime may be coming to an end. According tothe latest numbers, streaming services Netflix, Amazon Prime, Hulu, and others account for 36 percent of all television viewership. In contrast, cable television accounted for 27.9 percent of viewership; broadcast television, 24.2 percent. According to Scott Hamm Duenas, a leading independent movie producer and renowned actor (“Final Wager,” “ReBroken”), the rise of streaming services has had significant consequences for how television gets made. “The entertainment industry has changed massively, especially how television shows are developed and cast,” he says. In particular, television “pilot season” has undergone a fundamental transformation. **From “pilot season” to a constant demand for new content** “In the past, pilot season was usually from January to March,” Hamm Duenas says. “Networks cast and filmed pilot episodes for potential new series for mainly the big four networks: ABC, NBC, CBS, and Fox. This used to be a huge time for actors — they would flock to Los Angeles from all over the country, hoping to land roles in these pilots. If a network liked a pilot, it would order a full season. This provided a huge break, possible stardom, and a big payday for those who were booked.” Streaming services have deviated from this conventional timeline, however. “Streaming services release shows throughout the year rather than just having a fall premiere schedule with a summer hiatus,” Hamm Duenas says. “This means the demand for new content has become constant. It’s now a year-round thing.” Since streaming services are always hunting for appealing new content, the schedule for auditions has also changed. **The rise of remote casting** According to Hamm Duenas, new film and television projects are always looking for cast members, not just during the usual pilot season. “This has led to a more continuous casting process,” he explains. Another factor changing how actors get hired is the widespread adoption of digital and remote technologies. “Self-taping has become the norm, allowing actors to audition from anywhere,” Hamm Duenas says. “This eliminates the need to travel into town and visit random casting offices. The self-tape method is more convenient and cost-effective for actors and casting directors. It has been a game-changer — much of the casting process can now be done remotely.” There are some exceptions to this new trend, however. “In-person auditions and chemistry reads are still needed for certain roles, especially leads or series regular roles,” Hamm Duenas explains. Hamm Duenas had initially been skeptical about this casting method’s effectiveness, but then the COVID-19 pandemicmade it a necessity. “I thought I would hate it at first, but I’ve embraced it,” he says. “I don’t think we are ever going back, which is fine by me.” Indeed, many casting directors credit video calls and self-taped auditions for enabling them to consider a larger range of talent and include people from all over the world.According to Emmy-winning casting director Robert Sterne(“The Crown”), for instance, using self-taped auditions is “more inclusive economically as well as geographically. In terms of opening more doors to a wider range of actors, especially when all the creative industries have been so beleaguered, it’s a force for good.” Another difference between traditional television and today’s streaming services is the number of episodes that shows require. **Shorter seasons, fewer writers** Hamm Duenas explains that the conventional television industry had an “old-school mandatory 22-episode season.” These days, however, television executives are often only willing to finance fewer episodes. “Nowadays, a season can be as little as six to eight episodes,” Hamm Duenas says. The proper length of shows’ seasons continues to be asource of controversy. While many people like the tighter storylines and sustained momentum of shorter seasons, some miss the so-called “filler” episodes, considering them vital for character development and world-building. According to Hamm Duenas, another consequence of these shorter seasons is the much smaller writers’ rooms. Indeed, the decline of writing positions for television was one of the mainreasons the Writers Guild of America (WGA) went on strikein 2023. **The future of streaming services** In 2015, only 52 percent of U.S. households subscribed to streaming services. Today, that figure has risen to 83 percent, with streaming services boasting 1.8 billion subscriptions in a market worth more than $670 billion. Moreover, this industry is expected to reach a value of $2.49 trillion over the next seven years. Given the popularity of these platforms, it’s clear that “pilot season” is over, and the era of constant new content is here to stay. **Related Posts** **Bezlikiy Takes Professional Gaming To Greater Heights** **Mario “Wizzo” Fernandez Share His Experience As Engineer For Rapper Nipsey Hussle** **Add us on Flipboard** **Recent Posts** Bone Thugs-N-Harmony Drop New Track “Ahh Shit”: A Return to Their Roots The Monster Jam event at Macon Coliseum for 2025 promises an absolute blast of fun for the whole family. ASAP Rocky Possibly To Face 24 Years in Prison Drank Babies 4Life by DC2Trill: A Solid, Laid-Back Ride with Room for Growth Bad Bunny’s New Album ‘DeBÍ TiRAR MáS FOToS’: A Nostalgic Masterpiece Honoring Puerto Rican Culture **Categories** Album reviews(1) Books(2) Community(149) Entrepreneur(11) Fashion(2) Food(1) Health and Fitness(5) In the news(34) Interview(10) Lifestyle(32) Marketing(8) Model(1) Music(42) Podcast(1) Sports(2) Technology(3) Video(44) **Subscribe** Please select all the ways you would like to hear from : You can unsubscribe at any time by clicking the link in the footer of our emails. For information about our privacy practices, please visit our website. We use Mailchimp as our marketing platform. By clicking below to subscribe, you acknowledge that your information will be transferred to Mailchimp for processing.Learn moreabout Mailchimp's privacy practices. Home Music Video In the news Shop Submissions Donate Home Music Video In the news Shop Submissions Donate **Company** About us Contact Privacy Policy Editorial Policy Terms of Use Advertise Sitemap RSS **Categories** Album reviews Books Community Entrepreneur Fashion Food Health and Fitness In the news Interview Lifestyle Marketing Model Music Podcast Sports Technology Video Copyright © 2025 Now Entertainment Magazine"}