{"id": 854, "name": "L'Observateur", "domain": "lobservateur.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://lobservateur.com/2025/05/16/body-recovered-from-bonnet-carre-spillway-after-witnesses-report-shooting-authorities-say/", "title": "Body Recovered From Bonnet Carre Spillway After Witnesses Report Shooting Authorities Say", "content": "Home E-Edition News Sports Lifestyle Opinion Obituaries Contests Special Sections Classifieds Public Notices Home News Sports Opinion Obituaries Lifestyle Contests ServicesAbout UsPolicies About Us Policies About Us Policies Special Sections Classifieds Public Notices E-Edition **Body recovered from Bonnet Carré Spillway after witnesses report shooting, authorities say** Published 3:37 pm Friday, May 16, 2025 ByAmos Abba A man’s body was recovered from the Bonnet Carre Spillway on Friday after witnesses on Interstate 10 reported seeing him take his own life along the roadside, according to the St. Charles Parish Sheriff’s Office. The sheriff’s office was first notified about the suspected suicide at 11:30 a.m., according to Sgt. Jenni Barrette, spokesperson for the department. Passersby reported that a man standing on the shoulder of the westbound lanes of I-10 shot himself before falling into the waternear mile marker 212, she said. A heavy police presence was reported around 11:30 a.m. on the Bonnet Carre Spillway. Before 2 p.m., the sheriff’s office announced the recovery of a body matching the man’s description seen on the roadway. As investigators searched the area, traffic congestion extended back five miles, according to the DOTD. Eastbound traffic on I-10 also experienced delays. All lanes of I-10 westbound on the spillway reopened just after 2 p.m. However, the DOTD reported that the right lane of the interstate was blocked by a disabled tractor-trailer at mile marker 216 at 2:25 p.m.. According to the DOTD, another disabled vehicle blocked the left travel lane on I-10 West at mile marker 218. The St. Charles Parish Sheriff’s Office also states that the incident is confirmed to be unrelated to the escaped inmates from Orleans Parish Jail on Friday morning. **You Might Like** **Month-long drug investigation leads to three arrests in St. John the Baptist Parish** **Month-long drug investigation leads to three arrests in St. John the Baptist Parish** **St. Charles Parish Sheriff investigates repeat prostitution at Destrehan spa** **St. Charles Parish Sheriff investigates repeat prostitution at Destrehan spa** **75-year-old pedestrian dies in car crash while crossing Airline Highway in LaPlace** **75-year-old pedestrian dies in car crash while crossing Airline Highway in LaPlace** **Traffic stop leads to drug bust, manhunt in St. James Parish** **Traffic stop leads to drug bust, manhunt in St. James Parish** StatePoint Media **StatePoint Media** **StatePoint Media** Special SectionsMore special sections **Special Sections** **Special Sections** Home News Sports Opinion Lifestyle Health Classifieds Small Business E-Edition Subscribe Submit a News Tip Submit a Photo Public Notices About Us"}