{"id": 227, "name": "Chinook Observer", "domain": "chinookobserver.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://chinookobserver.com/sponsored-content/celebrating-the-cedar-and-sea-of-the-pacific-northwest-at-the-columbia-river-maritime-museum/", "title": "Celebrating The Cedar And Sea Of The Pacific Northwest At The Columbia River Maritime Museum", "content": "Home Weather ServicesSubscribeAbout UsContact UsCareersContributeNewslettersNewspapers In Education Subscribe About Us Contact Us Careers Contribute Newsletters Newspapers In Education Subscribe About Us Contact Us Careers Contribute Newsletters Newspapers In Education eEditionSpecial Sections Special Sections Special Sections NewsSouth County NewsNorthwest South County News Northwest South County News Northwest ObituariesSubmit An Obit Submit An Obit Submit An Obit Sports OpinionEditorials Editorials Editorials LifeHistory History History Discover Our CoastEventsSubmit An Event Events Submit An Event Events Submit An Event Area GuideHotelsRestaurantsServicesShoppingThings To DoVacation Rentals Hotels Restaurants Services Shopping Things To Do Vacation Rentals Hotels Restaurants Services Shopping Things To Do Vacation Rentals Sponsored Content Contests ClassifiedsPlace An AdReal EstateJobsPublic NoticesStatewide Public Notices Place An Ad Real Estate Jobs Public Notices Statewide Public Notices Place An Ad Real Estate Jobs Public Notices Statewide Public Notices Puzzles & GamesClassic SudokuDaily Commuter CrosswordFutoshikiHitoriJumble CrosswordJumble Crossword SundayJumble DailyJumble For KidsKiller SudokuLA Times CrosswordLA Times Sunday CrosswordTV CrosswordTV Jumble Classic Sudoku Daily Commuter Crossword Futoshiki Hitori Jumble Crossword Jumble Crossword Sunday Jumble Daily Jumble For Kids Killer Sudoku LA Times Crossword LA Times Sunday Crossword TV Crossword TV Jumble Classic Sudoku Daily Commuter Crossword Futoshiki Hitori Jumble Crossword Jumble Crossword Sunday Jumble Daily Jumble For Kids Killer Sudoku LA Times Crossword LA Times Sunday Crossword TV Crossword TV Jumble News ObituariesSubmit An Obit Submit An Obit Submit An Obit Sports Opinion Life Area GuideHotelsRestaurantsServicesShoppingThings To DoVacation Rentals Hotels Restaurants Services Shopping Things To Do Vacation Rentals Hotels Restaurants Services Shopping Things To Do Vacation Rentals ClassifiedsPlace An AdReal EstateJobsPublic NoticesStatewide Public Notices Place An Ad Real Estate Jobs Public Notices Statewide Public Notices Place An Ad Real Estate Jobs Public Notices Statewide Public Notices eEditionSpecial Sections Special Sections Special Sections **Celebrating the “Cedar and Sea” of the Pacific Northwest at the Columbia River Maritime Museum** Published 9:04 am Saturday, November 16, 2024 byColumbia River Maritime Museum Step into the heart of the Columbia River Maritime Museum and learn about the deep-rooted maritime traditions and artistry of the Indigenous peoples who have lived in harmony with our coastal waters for thousands of years. Our “Cedar and Sea” exhibit, which highlights contemporary Indigenous artists and their work, opened to the public on Nov. 1, coinciding with the beginning of Native American History Month. Upon entering the exhibit, visitors are greeted by a quote from Iljuwas Bill Reid, an artist who belonged to Raven-Wolf Clan of the Haida Nation: “Oh, the cedar tree! If humankind in its infancy has prayed for the perfect substance for all materials and aesthetic needs, an indulgent god could have provided nothing better.” The immersive exhibition illustrates and celebrates the intimate cycle of life between cedar, salmon and sea, as well as the people who’ve made—and continue to make—their living along the Pacific Coast, from Oregon to Alaska. Throughout the exhibit, visitors get to “meet,” and learn from, six Knowledge Givers in film portraits shot on location in their native homelands. These include present day Washington; Alaska; and Vancouver Island, British Columbia. Indigenous master carvers, a weaver, a gatherer of forest materials, and a fisherman all share their work and speak about their knowledge as a continuum passed from generation to generation over millennia. **Illustrating the Living Traditions of Indigenous Artisans** “Cedar and Sea” was inspired, in part by the work of author and illustrator Hilary Stewart, whose book, “Cedar: Tree of Life to the Northwest Coast Indians,” provides an understanding of the tree itself, the people of the cedar, and the tools and processes they historically and currently use to support their daily lives. In her book, “The People of Cascadia: Pacific Northwest Native American History,” researcher and educator Heidi Bohan expanded upon Stewart’s ideas and provided a more expansive overview of the Indigenous people of Cascadia. Storyline Studio, out of Bothell, Washington, who designed the exhibit, wanted to include some process illustrations—or line art drawings—that would help visitors understand how cedar is harvested and used. They selected Seattle-based illustrator Karen Lewis to do the artwork. The resident cartoonist for “Cobblestone,” an American history magazine for children, Lewis strives to make her art accessible and accurate. She drew inspiration from Stewart and Bohan but added her own interpretation to create visuals that would add context to the textual content of the exhibit. “Hillary Stewart’s illustrations provide prehistoric insight,” museum curator Jeff Smith says. “The Knowledge Giver videos illuminate contemporary processes, weaving a rich tapestry of understanding across eras.” Additionally, the exhibit includes film of Chief Mungo Martin, a Kwakwaka’wakw Northwest Coast artist whose mastery encompasses painting, carving, singing and songwriting. Contributed by University of California Berkeley, the film “reveals an historical narrative,” according to Smith. **From Cedar Forest to Ocean’s Depths** British Columbia-based Three Dimensional Services (3DS) assisted with the installation, while our museum staff collaborated closely with them about the vision, intention, and layout for the “Cedar and Sea” exhibit. It organized into four distinct areas. First, there’s The Forest, which features a visual walk through a cathedral forest and an introduction to the cedar, along with a mask created by First Nations artist Karver Everson, who is one of the Knowledge Givers featured in the exhibit. Next, you make your way to the Gathering Basket. In this area, reminiscent of a woven cedar basket, you find a treasure trove of natural materials that people have used and still use to fashion homes, clothing, tools and canoes. From there, visitors can move onto the Traditional Arts section, a huge circular space bounded by cedar forest on one side and glorious ocean shore on the other. Above is a circular ceiling cloud inspired by traditional Salish designs. This space displays an array of beautiful objects—some functional, some decorative—that are mostly fashioned from cedar. In the center sits a canoe crafted by Tutakwisnapšiƛ Joe Martin, a member of the Tla-o-qui-aht First Nation. Canoe paddles from various tribal nations, which differ size and design from community to community, hang from the walls. The final area, Fishing, takes the visitor “out to sea,” so to speak, where you can learn how people used Ingenious tools and methods to harvest the ocean waters by using their intimate understanding of the natural world. The array of hooks, rakes, floats, harpoons, traps, weirs, and other artifacts that are on display are replicas created by Indigenous artists. They encapsulate incredible craftsmanship, while still being practical and durable for day-to-day use. “Cedar and Sea” is a long-term exhibit, with no foreseeable end date, and it is included with museum admission. The Columbia River Maritime Museum is open daily from 9:30 a.m. to 5 p.m., except Thanksgiving and Christmas. For more information, call (503) 325-2323 or visitwww.crmm.org. **Ocean Beach Options Academy grads take road ‘paved in perseverance’** **Coast Chronicles: The Game of Shrooms** **Raymond lottery player wins $550,000 in Hit 5 game** **Jail Bookings** News Obituaries Sports Opinion Life Discover Our Coast Weather Subscribe eEdition Submission Forms Contribute Newsstand Returns Advertising Rate Card Classifieds Newsletters Newspapers In Education Reset Password Manage My Account About Us Contact Us Careers The Astorian Seaside Signal Discover Our Coast Capital Press Rogue Valley Times The Bulletin Redmond Spokesman The Other Oregon East Oregonian Hermiston Herald Wallowa County Chieftain The Observer Baker City Herald Blue Mountain Eagle Oregon Capital Insider"}