{"id": 1774, "name": "Nutritionfacts.org", "domain": "nutritionfacts.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://nutritionfacts.org/blog/skip-the-salt-and-shake-on-potassium-chloride/", "title": "Skip The Salt And Shake On Potassium Chloride", "content": "ENES Video LibraryLatest VideoRandom VideoAll VideosBrowse Videos by TopicLive Q&AsDr. Greger's Live Presentations BooksHow Not to AgeHow Not to DieHow Not to DietHow Not to Age CookbookHow Not to Die CookbookHow Not to Diet CookbookHow to Survive a PandemicOzempicView All Books ResourcesExplore NutritionFacts.orgAudio PodcastWebinarsBlogRecipesGuides and HandoutsSpeaking DatesDr. Greger's Daily DozenEmail SeriesHost a ScreeningOptimum Nutrient Recommendations SubscribeE-Mail SubscriptionsVolunteer NewsletterFacebookTwitterInstagramPinterestYouTubeVimeo DonateDonateYear in ReviewVolunteerOur SupportersDonor Rewards and Recognition AboutAbout NutritionFacts.orgMeet the TeamFrequently Asked QuestionsOur Values ENES **Skip the Salt and Shake on Potassium Chloride?** Written ByMichael Greger M.D. FACLM•June 10, 2025Last updated:June 10, 2025• 5 min read Worldwide, physical inactivity accounts for more than 10 million years of healthy life lost, but what weeataccounts fornearly 20 timesthat. As I discuss in my videoFewer Than 1 in 5,000 Meet Sodium and Potassium Recommended Intakes, unhealthy diets shave hundreds of millions of disability-free years off people’s lives every year. What are the worst aspects of our diets? Four out of the five of thedeadliestdietary traps involve not eating enough of certain foods—not eating enough whole grains, fruits, nuts, seeds, and vegetables—but our most fatal flaw is getting too much salt. To put things into perspective, our overconsumption of salt is on the order of 15 times deadlier than diets too high in soda. Our bodies are meant to have a certain balance of sodium and potassium intake, yet many people, including the majority in the United States, get vastly more sodium and far less potassium than the recommended amounts. Indeed, sodium and potassium goals are currently met by less than 0.015 percent of the U.S. population—close to 99.99 percent noncompliance, with only1 in 6,000 Americanshitting the recommended guidelines. **What’s So Bad About Salt?** Of all the terrible things about our diets, high dietary sodium intake—that is, high salt intake—is the leading risk, estimated to be causingmillions of deathsevery year mainly through adverse effects on blood pressure and increased risks of stroke, heart attack, and kidney damage. Hypertension,known commonlyas high blood pressure, is called the “silent and invisible killer” because it rarely causes symptoms but is one of the most powerful independent predictors of some of our leading causes of death. I discuss this in my videoAre Potassium Chloride Salt Substitutes Effective?. **How Much Sodium Is Healthy in a Day?** Our bodiesevolvedto handle only about 750 milligrams of sodium a day. Nevertheless, the American Heart Association calls for us to stay under 1,500 milligrams,twicethat amount. However, we’re consuming more thanfour timeswhat’s natural, and it’s onlygettingworse, having increased over the last couple of decades. An eye-opening 98.8 percent of Americansexceedeven that elevated 1,500 milligrams threshold. **Daily Potassium Intake** While many of us are consuming too much sodium, we may also be getting too little potassium, a mineral that lowers blood pressure. Less than 2 percent of U.S. adults, for instance, consume the recommended daily minimum intake of potassium based on chronic disease prevention. So,more than 98 percentof Americans may eat potassium-deficient diets. This deﬁciency is even more striking whencomparingour current intake with that of our ancestors, who consumed large amounts of dietary potassium. We evolved probably getting more than 10,000 milligrams of potassium a day. The recommendation was to get about half that amount, yet most of us don’t come anywhere close. **Why Are So Many of Us Lacking in Potassium?** Weevolvedconsuming a diet very rich in potassium and low in sodium, but, today, this pattern has been reversed. The flip reﬂects a shift away from traditional plant-based diets high in potassium and low in sodium towards the standard American diet. I’m talking about ashiftaway from fruits, greens, roots, and tubers to an eating pattern filled with salty, processed foods stripped of potassium. **Why Do We Need Potassium?** Low potassium intake has been implicated in high blood pressure and cardiovascular disease, and severalmeta-analyseshave conﬁrmed that high potassium intake appears to reduce the risk of stroke. It follows that potassium is now considered a “nutrient of public health concern” because most Americans don’t reach the recommendedminimumdaily intake. **What Is the Best Substitute for Salt?** Potassium chloride, which is often found in zero-sodium salt substitutes. We know from randomized controlled trials thatsodium reductionleads to blood pressure reduction andincreasing potassiumintake can also lower blood pressure. So should we be “salting” our food with potassium chloride instead of sodium chloride? **What Is Potassium Chloride? Is It a Viable (and Tasty) Salt Substitute?** Potassium chloride is anaturally occurringmineral salt, which is obtained the same way we get regular sodium salt. Since we get too much sodium and not enough potassium, this would seem to make potassium chloride a win-win solution. Consider these examples: In a randomized controlled trial, households had just 25 percent of the sodium chloridesalt replacedwith potassium chloride. At that level,most peopleeither can’t tell the difference or even prefer the salt with the potassium mixed in. The findings? The use of the salt substitute with one-quarter potassium chloride was associated with cutting the risk of developing hypertension inhalf. In anotherstudy, five kitchens in a veterans’ retirement home were randomized into two groups for about two and a half years. They either salted their meals with regular salt or, unbeknownst to the cooks and the diners alike, a 50/50 blend of potassium chloride. Those in the half-potassium group cut their risk of dying from cardiovascular disease by about 40 percent and lived up to nearly one year longer. The life expectancy difference at age 70 was equivalent to that which would have naturally occurred in 14 years––meaning that just switching to half potassium salt appeared to effectively make people more than a decade younger when it came to risk of death. **Side Effects of Potassium Chloride?** As I discuss in my videoPotassium Chloride Salt Substitute Side Effects, potassium chloride is “generally regarded as safe” by the U.S. Food and Drug Administration.Healthy individualsdon’t have to worry about getting too much potassium because their kidneys excrete any excess in urine, but that’s withpotassium in food. What about supplements?No adverse effectshave been shown for long-term intakes of potassium supplements as high as 3,000 milligrams a day, and blood levels of potassium are maintained in the normal range byhealthy kidneys, even when potassium intake is increased to approximately 15,000 milligrams a day. This isn’t surprising, given that we evolved eating so many healthy plant foods, so many fruits and vegetables, rich in potassium. Thenormal rangefor potassium levels in the blood is between 3.5 and 5.0. There are asmall number of individualswho may run into problems, primarily those with severely impaired kidney function. That’s why there’s been such a reluctance to push potassium‐based salt substitutes on a population level. Serious issues may arise if your kidneys can’t regulate your potassium. There may beconcernif you have known kidney disease, diabetes (diabetes can lead to kidney damage), severe heart failure, or adrenal insufficiency, or if you’re an older adult or on medications that impair potassium excretion. If you aren’t sure if you’re at risk, ask your doctor about getting your kidney function tested. **Conclusion** National and international health organizations havecalled for warninglabels on salt packets and salt shakers, with messages like “too much sodium in the diet causes high blood pressure and increases risk of stomach cancer, stroke, heart disease, and kidney disease. Limit your use.” So, pass (on) the salt shaker and try some potassium chloride instead. **Related Posts:** **Archives** **About the Author** Michael Greger M.D. FACLM A founding member and Fellow of the American College of Lifestyle Medicine, Michael Greger, MD, is a physician, New York Times bestselling author, and internationally recognized speaker on nutrition. Dr. Greger has lectured at the Conference on World Affairs, testified before Congress, and was invited as an expert witness in the defense of Oprah Winfrey in the infamous “meat defamation” trial. **Subscribe** Subscribe to our free newsletter and receive “In Dr. Greger’s Kitchen,” an excerpt fromThe How Not to Age Cookbook. **Speaking Tour** Catch up with Dr. Greger at one of his live speaking engagements: English Spanish **Nutrition Videos** Browse Topics Introductory Videos Latest Videos Dr. Greger's Live Presentations **Blog and Resources** Blog Recipes Webinars Speaking Dates Guides and Handouts Nutrition FAQs Optimum Nutrient Recommendations COVID-19 Resources **Get the Books** How Not to Age How Not to Die How Not to Diet The How Not to Age Cookbook The How Not to Die Cookbook The How Not to Diet Cookbook How to Survive a Pandemic **Get the App** Daily Dozen iOS Daily Dozen Android Daily Dozen Daily Dozen Challenge **Support Us** Donate Our Supporters Donor Rewards & Recognition Merch **Get Involved** Volunteer Opportunities Internship Opportunities Employment Opportunities Open Source Initiative Share Your Story Host a Screening **Get Social** Facebook Twitter Pinterest Instagram YouTube Vimeo NutritionFacts.org 中文 **Subscribe** E-Mail Subscriptions Volunteer Newsletter Video RSS Feed Blog RSS Feed **Help** About NutritionFacts.org Help Get Support FAQ Copyright Guidelines Privacy Policy Terms of Service **Get in Touch** Contact Us Press Speaking Inquiries Interview Inquiries Charity ID:05-0559626 Weour volunteers!Apply Now! **Pin It on Pinterest** Facebook Twitter"}