{"id": 1820, "name": "The Washington Standard", "domain": "thewashingtonstandard.com", "bias": "fake-news", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://thewashingtonstandard.com/terror-generation-muslim-american-society-islamic-center-in-philadelphia-shows-children-dressed-as-terrorists-chanting-we-will-chop-off-their-heads/", "title": "Terror Generation Muslim American Society Islamic Center In Philadelphia Shows Children Dressed As Terrorists Chanting We Will Chop Off Their Heads", "content": "Top News US Politics Commentary Constitution & Law World Economy Gun News World News Vids About Us Top News US Politics Commentary Constitution & Law World Economy Gun News World News Vids About Us **Related Articles** Commentary **DOJ Employee Arrested For Dosing Girlfriend To Murder His Unborn Child** Commentary **Has The U.K. Just Signed Its Own Death Warrant?** Videos Commentary **Posse Comitatus & What’s Taking Place In LA (Video)** Videos Commentary **How to Resist the Emerging Techno-Prison Planet (Video)** Commentary **FDA Confirms Their Approval Of OxyContin Was Illegal!** Videos Commentary **Neverland Nation: Students Can’t Grow Up (Video)** Commentary **TERROR GENERATION: Muslim American Society Islamic Center in Philadelphia Shows Children Dressed as Terrorists Chanting, “We Will Chop Off Their Heads.”** Shocking new footage from the Muslim American Society Islamic Center in Philadelphia shows children dressed as terrorists, chanting: “We will sacrifice our bodies without hesitation. We will chop off their heads.” The Muslim American Society Islamic Center in Philadelphia (MAS Philly) just uploaded this video of their “Ummah Day” celebration to their public Facebook page. In the past, this video of jihad indoctrination appeared, a spokesperson for the national MAS Phillyinsistedthe video “does not represent our understanding of Islam, nor the understanding of the mainstream Muslim community.” They know what they are doing and they know they can count on the left to carry their water. These chickens are coming home to roost. You can run but you cannot hide. SHOCKING: Teaching kids to hate in Philadelphia! Muslim American Society Islamic Center in Philadelphia (MAS Philly) uploaded this video of their “Ummah Day” celebration to their public Facebook page! WATCH what is being taught to impressionable young children in the US!pic.twitter.com/MwnyZ0BSN2 — Canary Mission (@canarymission)June 7, 2025 A generation of Muslim children were raised on this. Related:Philadelphia Muslim student: These days ‘the pinnacle of Islam is realized – jihad for the sake of Allah’ Not Philly “Fanatics”—U.S. Muslim Children (And Adults) Are Taught “Classical” Islamic Jew-Hatred Media IGNORES Philly Muslim Children Taught About Chopping Off Heads But They Wrote THOUSANDS Of Articles On Covington Catholic Students Fake News Smirk Chilling videos surfaced this past week (here;here) sponsored by the mainstream, traditionalistMuslim American Society(MAS)—“one of the nation’s majorIslamicgroups”—at their Islamic Center in Philadelphia. Dubbed “Ummah [Global Muslim Community] Day,” the celebrations featured Muslim childrenintoning“you need force and the Koran,” then payingtributeto jihad murder martyrdom—sacrificing their “bodies and souls…without hesitation”—to kill “Zionists”, i.e., Jews. These “liberating” murderous actions—beheadings [Koran8:12;47:4]—would further cause their Jewish victims eternal Koranic [4:54–55, and98:5–6; glossed,4:54–55and98:5–6] damnation: We will chop off their heads, and we will liberate the sorrowful and exalted Al-Aqsa Mosque. We will lead the army of Allah fulfilling His promise, and we will subject them to eternal torture. Only on May 3rd, after exposure of these videos in thenational pressdid the MAS provide astatement, transparent in its mendacity. The songs and declarations recorded for posterity and placed triumphantly on the MAS Philadelphia affiliate’s Facebook page, in all their ugliness,were“not properly vetted.” A spokesperson for the national MASinsistedon Sunday May 5ththe video “does not represent our understanding of Islam, nor the understanding of the mainstream Muslim community,” and in response to media backlash, its Philadelphia affiliate’s Facebook page wasshut down. However, on May 6, 2019 the Middle East Media Research Institute revealedanother videofrom the MAS Philadelphia affiliate’s Facebook page, uploaded two years earlier, May 28, 2017, with children also calling for jihad murder “martyrdom.” The unchanged toxic reality of how U.S. Muslim children are educated, vis-à-vis Jews, can be gleaned by re-examining a March 30, 2003New York Daily Newsexposé(free full-texthere), entitled, appositely, “Sewing the seeds of hatred.” Article posted with permission fromPamela Geller **The Washington Standard** **The Agenda: Their Vision – Your Future (2025) | Full Documentary** **The Agenda: Their Vision – Your Future (2025) | Full Documentary** **5 Food Additives that Destroy Your Gut** **5 Food Additives that Destroy Your Gut** **Latest Articles** Commentary **5 Food Additives that Destroy Your Gut** Commentary **DOJ Employee Arrested For Dosing Girlfriend To Murder His Unborn Child** **Arrest California’s Representatives & The Riots Will Stop** Commentary **Has The U.K. Just Signed Its Own Death Warrant?** Videos Commentary **Posse Comitatus & What’s Taking Place In LA (Video)** **The Agenda: Their Vision – Your Future (2025) | Full Documentary** **The Agenda: Their Vision – Your Future (2025) | Full Documentary** **5 Food Additives that Destroy Your Gut** **5 Food Additives that Destroy Your Gut** Copyright © 2025 The Washington Standard"}