{"id": 464, "name": "WJBK - Fox 2 - Detroit", "domain": "fox2detroit.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.fox2detroit.com/news/fox-news-sunday-with-shannon-bream", "title": "Fox News Sunday With Shannon Bream", "content": "Live Weather Things to Do Sports Email Contests Health Works More Local National Hall of Shame Let It Rip Crimestoppers The Interview Business Things to Do FOX News Sunday Stream FOX 2 on FOX LOCAL LiveNOW from FOX FOX Soul Tigers fan photos Today's Poll - vote now! Send your pics Congrats Grads! Closings Weather App Weather Alerts Traffic Airport Delays Fox Weather Animal House The Nine The Noon Mug Contest Health Works Cooking School Get Fit Money Saver Doctor is In Weekend Mornings Links on FOX 2 The Pulse Donald Trump First & North Lions Wolverines Spartans Pistons Tigers Red Wings FOX Shows CriticLEE Speaking TV Listings Contests FOX 2 Staff Contact Us Work at FOX 2 FOX 2 News App Job Shop Community FCC Public File FCC Applications Closed Captions Problem Solvers Resources Wallside Windows Weather Quiz Gardner White Dream Team Mug Contest Exposed Personal Finance Business Stock Market Small Business Chicago News - FOX 32 Chicago Milwaukee News - FOX 6 News Minneapolis News - FOX 9 **FOX News Sunday with Shannon Bream: How and when to watch on FOX 2** Share Copy Link Email Facebook Twitter LinkedIn Reddit Watch FOX News Sunday with Shannon Bream on FOX 2 starting at 9 a.m. on Sundays. DETROIT-Shannon Bream has ushered in a new era of Sunday morning talk shows as she interviews the biggest newsmakers of the week on FOX News Sunday. You can catch all the action ofFOX News Sunday with Shannon Breamon FOX 2 from 9 a.m. to 10 a.m. on Sundays. Leading guests in providing context and analysis of the issues facing Americans, Bream’s weekly guest roster is among the most diverse in Sunday morning talk, featuring interviews with political, business and public affairs newsmakers from the U.S. and abroad. Before becoming the first woman to host FOX News Sunday in its nearly three-decade history, Bream served as anchor of FOX News @ Night for five years. In addition to her new role, she also continues to serve as the network’s chief legal correspondent. WatchFOX News Sunday with Shannon Breamon FOX 2 starting at 9 a.m. on Sundays. **BREAKING NEWS** Breaking news delivered fast By clicking Sign Up, I confirmthat I have read and agreeto thePrivacy PolicyandTerms of Service. **Top videos** **Detroit high schooler loses appeal to prevent deportation** **Remembering longtime Wayne County Commissioner Irma Clark-Coleman** **Detroiters protesting ICE operations in the city** **Pine Knob concert season kicks off** **Detroit police investigate fatal east side shooting** **Trending** Local National Hall of Shame Let It Rip Crimestoppers The Interview Business Things to Do FOX News Sunday Stream FOX 2 on FOX LOCAL LiveNOW from FOX FOX Soul Tigers fan photos Today's Poll - vote now! Send your pics Congrats Grads! Closings Weather App Weather Alerts Traffic Airport Delays Fox Weather Animal House The Nine The Noon Mug Contest Health Works Cooking School Get Fit Money Saver Doctor is In Weekend Mornings Links on FOX 2 The Pulse Donald Trump First & North Lions Wolverines Spartans Pistons Tigers Red Wings FOX Shows CriticLEE Speaking TV Listings Contests FOX 2 Staff Contact Us Work at FOX 2 FOX 2 News App Job Shop Community FCC Public File FCC Applications Closed Captions Problem Solvers Resources Wallside Windows Weather Quiz Gardner White Dream Team Mug Contest Exposed Personal Finance Business Stock Market Small Business Chicago News - FOX 32 Chicago Milwaukee News - FOX 6 News Minneapolis News - FOX 9 facebook twitter instagram email About Us New Privacy Policy Updated Terms of Use Your Privacy Choices Work at FOX 2 FCC Public File EEO Public File This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"}