{"id": 2080, "name": "OnCuba News", "domain": "oncubanews.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://oncubanews.com/mundo/medio-oriente/gaza-supera-los-55-000-muertos-mientras-persisten-los-bombardeos-y-la-ayuda-alimentaria-llega-bajo-fuego/#comments", "title": "Gaza Supera Los 55 000 Muertos Mientras Persisten Los Bombardeos Y La Ayuda Alimentaria Llega Bajo Fuego", "content": "Cuba Cuba-EE.UU. Economía Cultura Cartelera Deportes Opinión Podcasts Videos Especiales Cuba Cuba-EE.UU. Economía Cultura Cartelera Deportes Opinión Podcasts Videos Especiales **Se superan los 55 mil muertos en Gaza mientras persisten los bombardeos y la ayuda alimentaria llega bajo fuego** **A finales de mayo, las autoridades sanitarias locales estimaban que unos 18 mil niños habían muerto en los ataques, y que el 60 % de las víctimas eran mujeres o menores.** Redacción OnCuba Un hombre lleva el cuerpo de un niño recuperado de entre los escombros de una casa destruida tras un ataque aéreo israelí contra el barrio de Al Sabra en la ciudad de Gaza, Franja de Gaza. Foto: EFE/EPA/MOHAMMED SABER Un hombre lleva el cuerpo de un niño recuperado de entre los escombros de una casa destruida tras un ataque aéreo israelí contra el barrio de Al Sabra en la ciudad de Gaza, Franja de Gaza. Foto: EFE/EPA/MOHAMMED SABER La cifra demuertos provocados por la ofensiva israelí sobre Gaza desde el 7 de octubre de 2023 asciende ya a 55 104 personas, según informó el Ministerio de Sanidad del Gobierno de Hamás. Solo en la jornada del martes, se contabilizaron 123 nuevas víctimas mortales y 474 heridos, elevando a 127 394 el número total de personas lesionadas en casi ocho meses de bombardeos y operaciones militares. Entre los fallecidos, los menores de edad representan una fracción alarmante.A finales de mayo, las autoridades sanitarias locales estimaban que unos 18 mil niños habían muerto en los ataques, y que el 60 % de las víctimas eran mujeres o menores. Además, más de 2 500 núcleos familiares completos han sido eliminados de los registros civiles, lo cual implica que ningún integrante sobrevivió a los ataques. La cifra de víctimas continúa creciendo también entre quienes buscanayuda humanitaria, de acuerdo con un despacho deEFE. **Alrededor de 224 muertos en Gaza en menos de un mes** Desde el 27 de mayo, al menos 224 personas han muerto por disparos israelíes cuando intentaban acceder al reparto de alimentos organizado por la Fundación Humanitaria Gaza. Se trata de una organización respaldada por Israel y Estados Unidos, pero rechazada por varios organismos humanitarios por su presunta militarización de la asistencia. Solo este miércoles,57 personas fallecieron por disparos mientras esperaban su turno en los puntos de distribución de comida. La situación agrava aún más una emergencia humanitaria caracterizada por el hambre, la desnutrición y el colapso de servicios básicos. La Agencia de las Naciones Unidas para los Refugiados Palestinos (UNRWA) denunció el miércoles que se han diagnosticadomás de 2 700 niños menores de cinco años con desnutrición aguda, mientras que al menos 58 personas han muerto por inanición, de las cuales 53 eran niños. **Israel y el exterminio masivo de la población palestina** El conflicto se desató tras el ataque de milicianos deHamássobre territorio israelí el 7 de octubre de 2023, que dejó unos 1 200 muertos y 251 personas secuestradas, según cifras del Gobierno israelí. En represalia, Israel lanzó una ofensiva militar de grandes proporciones sobre Gaza, con un impacto desproporcionado sobre la población civil, lo cual generó fuertes críticas. A pesar de los intentos diplomáticos y de las múltiples resoluciones de organismos internacionales,la violencia no ha cesado y la ayuda humanitaria sigue siendo insuficiente, irregular y en muchos casos riesgosa, tanto para quienes la reciben como para quienes la entregan. La comunidad internacional ha expresado su preocupación por el costo humano del conflicto. Sin embargo, la falta de un alto al fuego efectivo y el bloqueo de corredores humanitarios seguros continúa poniendo en peligro a millones de personas atrapadas en la Franja, dondela vida cotidiana se ha vuelto una lucha por la supervivencia en medio del genocidio. **Musicalia 2025 reunirá a jóvenes pianistas y maestros internacionales en La Habana** **Musicalia 2025 reunirá a jóvenes pianistas y maestros internacionales en La Habana** **Sancti Spíritus reporta la tasa de mortalidad infantil más baja del país** **Sancti Spíritus reporta la tasa de mortalidad infantil más baja del país** **Redacción OnCuba** **ArtículosRelacionados** **Reino Unido y otros países sancionan a dos ministros de Israel por su retórica “atroz” sobre Gaza** ... **Israel intercepta barco con voluntarios internacionales y ayuda humanitaria para Gaza** ... **Irán estudia propuesta nuclear de EEUU, pero rechaza “exigencias radicales” y pide fin de sanciones** ... **“¿Cuántos niños más morirán?”: Unicef acusa a Israel de matar o herir a más de 50 mil menores en Gaza** ... **Netanyahu asegura que Israel abatió a Mohammed Sinwar, líder de Hamás en Gaza** ... **Sancti Spíritus reporta la tasa de mortalidad infantil más baja del país** **Deja una respuestaCancelar la respuesta** La conversación en este espacio está moderada según las pautas de discusión de OnCuba News. Por favor, lea laPolítica de Comentariosantes de unirse a la discusión. Tu dirección de correo electrónico no será publicada.Los campos obligatorios están marcados con* Comentario* Nombre* Correo electrónico* Δ **Suscríbete** Lo mejor de OnCuba, cada semana. ¡Únete a nuestra comunidad! Boletín semanalEconomía y negocios Boletín semanalEconomía y negocios Boletín semanalEconomía y negocios **Más Leído** Buque ruso “Vladimirsky” arriba a La Habana con ayuda tecnológica y regalos escolares347 compartidoComparte139Tweet87 **Buque ruso “Vladimirsky” arriba a La Habana con ayuda tecnológica y regalos escolares** **Buque ruso “Vladimirsky” arriba a La Habana con ayuda tecnológica y regalos escolares** Facultad universitaria de La Habana da marcha atrás al paro contra el tarifazo de Etecsa502 compartidoComparte201Tweet126 **Facultad universitaria de La Habana da marcha atrás al paro contra el tarifazo de Etecsa** **Facultad universitaria de La Habana da marcha atrás al paro contra el tarifazo de Etecsa** Crisis energética: regresan las averías en termoeléctricas y aumentan los apagones202 compartidoComparte81Tweet51 **Crisis energética: regresan las averías en termoeléctricas y aumentan los apagones** **Crisis energética: regresan las averías en termoeléctricas y aumentan los apagones** Los parques solares crecen en potencia, pero salen más unidades por mantenimiento373 compartidoComparte149Tweet93 **Los parques solares crecen en potencia, pero salen más unidades por mantenimiento** **Los parques solares crecen en potencia, pero salen más unidades por mantenimiento** Cambios en Nauta Hogar en medio de la desaprobación popular por el tarifazo de Etecsa697 compartidoComparte279Tweet174 **Cambios en Nauta Hogar en medio de la desaprobación popular por el tarifazo de Etecsa** **Cambios en Nauta Hogar en medio de la desaprobación popular por el tarifazo de Etecsa** **Más comentado** En medio del rechazo a las nuevas tarifas, Etecsa lanza su primera recarga internacional1416 compartidoComparte566Tweet354 **En medio del rechazo a las nuevas tarifas, Etecsa lanza su primera recarga internacional** **En medio del rechazo a las nuevas tarifas, Etecsa lanza su primera recarga internacional** Chispa en pasto seco237 compartidoComparte95Tweet59 **Chispa en pasto seco** **Chispa en pasto seco** Un barrio habanero llamado Lawton655 compartidoComparte262Tweet164 **Un barrio habanero llamado Lawton** **Un barrio habanero llamado Lawton** Existe una cosa llamada Cuba212 compartidoComparte85Tweet53 **Existe una cosa llamada Cuba** **Existe una cosa llamada Cuba** Cambios en Nauta Hogar en medio de la desaprobación popular por el tarifazo de Etecsa697 compartidoComparte279Tweet174 **Cambios en Nauta Hogar en medio de la desaprobación popular por el tarifazo de Etecsa** **Cambios en Nauta Hogar en medio de la desaprobación popular por el tarifazo de Etecsa** Cannabidiol Sobre nosotros Trabajar con OnCuba Política de privacidad Términos de uso Política de Comentarios Contáctenos Anunciarse en OnCuba OnCuba y el logotipo de OnCuba son marcas registradas deFuego Enterprises, Inc, sus subsidiarias o divisiones.© Copyright OnCubaFuego Enterprises, IncTodos los derechos reservados. Cuba Cuba-EE.UU. Economía Cultura Cartelera Deportes Opinión Podcasts Videos Especiales OnCuba y el logotipo de OnCuba son marcas registradas deFuego Enterprises, Inc, sus subsidiarias o divisiones.© Copyright OnCubaFuego Enterprises, IncTodos los derechos reservados. Para brindar las mejores experiencias, utilizamos tecnologías como cookies para almacenar y/o acceder a información del dispositivo. Dar su consentimiento a estas tecnologías nos permitirá procesar datos como el comportamiento de navegación o identificaciones únicas en este sitio. No dar o retirar el consentimiento puede afectar negativamente a determinadas características y funciones."}