{"id": 1943, "name": "Dawn (Pakistan0", "domain": "dawn.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.dawn.com/news/1916502/fact-check-video-of-ptis-barrister-gohar-calling-for-washington-protest-against-army-chief-is-a-deepfake", "title": "Fact Check Video Of Ptis Barrister Gohar Calling For Washington Protest Against Army Chief Is A Deepfake", "content": "**E-Paper| June 12, 2025** **Subscribe to notifications** Get the latest news and updates from Dawn **Fact check: Video of PTI’s Barrister Gohar calling for Washington protest against army chief is a deepfake** Posts from PTI supporters on multiple social media platforms on Tuesday shared a clip of PTI’s interim Chairman Barrister Ali Gohar allegedly urging overseas Pakistanis to participate in a protest on June 14 against the army chief, Field Marshal Asim Munir. However, the video is a deepfake and he has not issued any such message. A senior trade delegation from Pakistan isdue in Washingtonthis week for talks with United States officials on the recently imposed American tariffs and related economic issues, diplomatic sources toldDawn. The PTI claims that Field Marshal Asim Munir would visit Washington around the same time, something that neither the US nor Pakistani officials have confirmed. While official dates for these visits are being withheld due to political sensitivities, the PTI, which has long opposed the current Pakistani establishment, has announced plans to stage large-scale demonstrations during the visit. In a tweet posted over the weekend, PTI’s Secretary for Overseas Affairs, Sajjad Burki, called for a protest outside the Pakistan embassy in Washington on June 14, coinciding with the expected presence of senior Pakistani officials in the US capital. On Tuesday, an X user shared an 18-secondclipallegedly showing Barrister Gohar urging overseas Pakistanis to participate in a protest on June 14 against the army chief. The caption of the post read: “Barrister Gohar’s major announcement. Call for a protest demonstration on June 14.” In the clip, Gohar says: “As the chairman of PTI, I appeal to all overseas Pakistanis living in the US and the West to actively participate in the protest being held on June 14 in front of the Pakistan Embassy in Washington, DC, so that the true face of Field Marshal Munir can be exposed before the world.” The post gained 61,000 views and was shared 619 times. Gohar’s alleged speech wassharedin written form by another X user alongside a photo of his, garnering 46,000 views. The same video was shared by other users on X as can be seenhere,here,hereandhere. The same viral clip was also found on Facebook as can be seenhere,hereandhere, accumulating 12,490 views. The clip was also shared onTikTok. A fact-check was initiated to determine the veracity of the claim due to its high virality and keen public interest in Imran, the PTI’s protest call, the party’s relationship with the military leadership and all related developments. Observing the timeline of the X account that first shared the video showed that the user has the following written in their bio: “AI, memes and satire exposing fascism & corruption in PK.” The user had also shared many other AI-generated images andvideoson their timeline. Observing the video showed inconsistencies such as the lack of direct eye contact with the camera, the line of sight not syncing up with the direction of the face and unnaturally high swaying throughout while speaking, which is not how the PTI leader talks in his addresses and videos. Interestingly, avideoshared by the account of Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur of the exact same message, calling for the protest in Washington against the army chief, displayed the same inconsistencies. Analysis of Gohar’s video using tools to detect manipulation showed that Attestiv assigned it a suspicion rating of 57 per cent while the results from Hive Moderation and Deepware were inconclusive. A reverse image search and keyword search for “Barrister Gohar”, “protest call”, “June 14” and “Washington” led to no news articles from mainstream media outlets that reported on any such alleged video address by the PTI leader, nor was any recent video message of Gohar found speaking with the same background. Neither result was obtained for CM Gandapur saying anything like that. Instead, avideo clipposted on X the same day by Usman Chaudhry, a researcher and environmental journalist according to his bio, showed Gohar responding to a question about the PTI issuing a protest call during the army chief’s visit to the United States. His response is transcribed below: “The PTI has not given any protest call and nor does the PTI do it. If people abroad do anything then it is their choice. There has been no such press release from the PTI and nor has the PTI said to anyone to do any protest so from our side, we have not given any such call.” Contacted for comment viaDawncorrespondent Nadir Guramani about the video, Gohar said: “Fake and AI-generated”. Therefore, the fact-check determined that the claim that a video shows PTI Chairman Barrister Gohar for a protest in Washington on June 14 against the army chief isfalse. The video is a deepfake and no credible news outlet has reported on any such alleged call by Gohar. This fact check was originallypublishedby iVerify Pakistan — a project of CEJ-IBA and UNDP. **Email** **Read more** **Pakistan, US to resume tariff talks within days** **Army chief’s elevation to field marshal splits PTI** **Imran asks masses to prepare for nationwide protest** **لو گُرو: وہ فلم جس میں کئی بھارتی فلموں کی جھلک نظر آئی** **ریویو: دیمک ایسی ہارر فلم جو ہر گھر کی کہانی لگتی ہے** **دوستوں کےساتھ ‘باربی کیو پارٹی’ کا پلان ہے؟ تو یہ ترکیب آزمائیں** **Russia-Ukraine Roundup: Deadly Drone Strikes and Prisoner Exchanges** **Gaza-Israel Roundup: Sanctions on Israeli Ministers and US Diplomatic Rift** **Pakistan Roundup: Bilawal Criticizes India, US Centcom Praises Counter-Terrorism Efforts** **Your Online Shopping Just Got Taxed** **Budget 2025-26 Offers No Relief To Common Man, Just More Burden** **Pakistan’s Budget 2025-26: Haroon Sharif On Structural Gaps In Policy** **Gaza-Israel Roundup: US Envoy Says He Does Not Think A Palestinian State Is US Policy Goal** **Sponsored** **Taptap Send launches in-app donation feature for overseas Pakistanis** **Aeon & Trisl secures Emaar’s Top Broker Title for Q1 2025, making it seven in a row** **5th Pillar Family Takaful: Helping people save for Hajj the right way** **Latest Stories** **Harvey Weinstein convicted of sex crime amid contentious jury deliberations** **Punjab govt accords high priority to Hafizabad gang-rape case** **US favourability tumbles since Trump return: global survey** **Board of US Fulbright programme quits, citing Trump interference** **Punjab police arrest suspect for allegedly killing wife in Okara** **Detained Madleen activists advocating for free Palestine honoured in Karachi protest** **** **Sana Mir says her ICC Hall of Fame inclusion is for ‘every girl who picks up a bat or ball’** **BTS megastars Jimin, Jungkook released from South Korea military service** **Rapper Kendrick Lamar lands the biggest wins at the 2025 BET Awards** **Most Popular** **Income tax calculator 2025-26: How does the new budget affect your salary** **Sana Mir makes history as first Pakistani woman cricketer to make ICC Hall of Fame** **Sindh govt bans parking on Karachi’s ‘Wall Street’ to ease traffic flow** **Budget FY26: Pakistan targets 4.2pc growth, slashes overall spending** **Behind the numbers...** **India a ‘belligerent power spinning out of control’, says Sherry Rehman on Jaishankar’s remarks** **After expanding the net, new budget will focus on increasing tax rates** **Budget FY26: ‘Relief’ for salaried group as govt goes after solar panels, e-commerce** **Trump willing to work on Kashmir issue, confirms US State Dept** **Must Read** **An IMF-mandated balancing act for the budget** **Fact check: Video of PTI’s Barrister Gohar calling for Washington protest against army chief is a deepfake** **Fishing cat: Pakistan’s Indus delta losing its lone surviving predator** **Editorial: FY26 budget shows that stability has returned, but will growth follow suit?** **Income tax calculator 2025-26: How does the new budget affect your salary** **Opinion** **Pak-Afghan thaw** **Digital wishful thinking** **Language debate** **Marching orders** **On to the budget** **Editorial** **Ambitious goals** **Battlefield LA** **Road to stardom** **Behind the numbers...** **High-seas terror** **Bruised innocence** **Exemptions hit record as tax revenue falls short** **Income tax calculator 2025-26: How does the new budget affect your salary** Compunode.com Pvt. Ltd. (www.compunode.com).Designed forDawn. Copyright © 2025, Dawn NewsKit Publishing Platformby Compunode"}