{"id": 666, "name": "Illinois Policy Institute", "domain": "illinoispolicy.org", "bias": "right", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.illinoispolicy.org/illinois-adds-394m-in-taxes-on-airbnb-velo-draftkings-as-it-yanks-property-tax-break/", "title": "Illinois Adds 394m In Taxes On Airbnb Velo Draftkings As It Yanks Property Tax Break", "content": "Our Story Your Story Policy ResearchBudget + TaxJobs + GrowthGood GovernmentLaborPensionsEducationCriminal JusticeCenter for Poverty SolutionsChicago Policy CenterEn Español Budget + Tax Jobs + Growth Good Government Labor Pensions Education Criminal Justice Center for Poverty Solutions Chicago Policy Center En Español Budget + Tax Jobs + Growth Good Government Labor Pensions Education Criminal Justice Center for Poverty Solutions Chicago Policy Center En Español Take Action Illinois’comebackstorystarts here. Home Our StoryLeadershipStaffSenior FellowsJobsAnnual Reports Leadership Staff Senior Fellows Jobs Annual Reports Leadership Staff Senior Fellows Jobs Annual Reports Your Story Take ActionLawmakersContact Your RepJoin the Fight Lawmakers Contact Your Rep Join the Fight Lawmakers Contact Your Rep Join the Fight Policy ResearchCenter for Poverty SolutionsChicago Policy CenterBudget + TaxCriminal JusticeEducationGood GovernmentJobs + GrowthLaborPensions Center for Poverty Solutions Chicago Policy Center Budget + Tax Criminal Justice Education Good Government Jobs + Growth Labor Pensions Center for Poverty Solutions Chicago Policy Center Budget + Tax Criminal Justice Education Good Government Jobs + Growth Labor Pensions Reports Cartoons Press Releases Policy Shop FAQs Contact Newsletter Signup Donate Privacy Policy **Illinois adds $394M in taxes on Airbnb, Velo, DraftKings as it yanks property tax break** Gov. J.B. Pritzker’s record $55.2 billion budget relies on Illinoisans paying over $394 million in new or higher taxes on sports bets, tobacco, short-term rentals and more. At the same time, he’s set to take away a property tax break. Illinois lawmakers approved a record$55.2 billionstate budget for fiscal year 2026 on June 1 that relies on Illinoisans paying over $394 million in new or higher taxes on sports bets, tobacco and other activities. Not included in that total: they also took away a $43 million property tax break, which is the same as boosting property taxes. Analysis of the more than 3,000-page state budget now headed to Gov. J.B. Pritzker shows lawmakers are counting on $800 million in additional revenues to cover a $2 billion increase in spending from the previous budget. State spending is up $16.7 billion since Pritzker took office. Of the $800 million, about half is from new or higher taxes on residents. The remaining revenues will come from $237 million in fund sweeps, the transfer of revenues from a dedicated fund into general revenues and $216 million in funding delays. Here’s more on the tax increases facing Illinoisans. Sports betting: $36 million Lawmakers introduced a25-cent taxon the first20 millionwagers made within the state with licensed sports betting businesses and a 50-cent tax on all wagers made there-after. The tax will go into effect July 1 and the revenues will go to Illinois’ General Revenue Fund. Short-term rentals: $15 million Airbnb and other short-term rentals in Illinois will be taxed at the same rate as hotels under an update to The Hotel Operators’ Occupation Tax Act. Visitors will likely now have to cover an additional6%state tax on their short-term rental in Illinois and one of thehighest tax ratesin the nation when renting in Chicago. Nicotine analogs: no estimate Lawmakers will raise the tax rate on tobacco products, including cigars, cigarettes, vapes, nicotine gum, nicotine pouches and chewing tobacco from 36% of the wholesale price to45%. This excludes nicotine products designed to help individuals quit smoking. While this higher nicotine tax will go into effect on July 1, 2025, lawmakers did not provide an estimate on the total revenue they expect to generate from the tax before voting to pass the costs on to Illinoisans. Corporate tax hike: $72 million All businesses operating in Illinois will now pay sales taxes, including those without a physical presence in the state. Business outside the state will be required to collect sales taxes if they sell at least$100,000worth of goods or services to residents. Businesses that move money to other countries would be required to pay the state’s corporate income tax and businesses that move money out of state will no longer have access to the “safe harbor” exemption. Effective property tax hike: $43 million Pritzker’s new revenue plan also puts a one-yearpauseon Illinois’ Property Tax Relief Grant, effectively hiking property taxes on homeowners by $43 million for fiscal year 2026 despite his promise toveto any budget that increases taxes on individuals, corporations or the sales tax. While this effective property tax hike is not counted in the over $394 million in tax increases to fund the new state budget, taxpayers will still find themselves paying more in property taxes when they are alreadyNo. 2in the nation and double the national average. Tax hikes still on the table Illinois’ 2026 budget continues the state’s habit of patching budget problems using short-sighted fixes with long-term consequences. Despite them adjourning, state lawmakers could come back for a special session and impose some of the taxes they failed to pass during the spring session. In a special session any tax hikes will take athree-fifths majorityand more political will and deals. Taxpayers will need to hope the same lawmakers who couldn’t get their tax ideas passed when they just needed a simple majority will not figure out how to get to the higher threshold. **Want more?Get stories like this delivered straight to your inbox.** Chicago Office|Illinois Policy300 S. Riverside Plaza|Suite 1650|Chicago, IL 60606t312.346.5700f312.346.5700 Copyright © 2025 Illinois Policy|Illinois' comeback story starts here This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply."}