{"id": 1106, "name": "Points of Light", "domain": "pointsoflight.org", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.pointsoflight.org/from-nice-to-necessary-unleashing-the-impact-of-volunteering-through-transformative-investment/", "title": "From Nice To Necessary Unleashing The Impact Of Volunteering Through Transformative Investment", "content": "About Us Contact/Follow Us Blog Our Mission What We DoProducts & ServicesWe create products and services that help volunteers, nonprofits/NGOs and corporations maximize their impact.Learn MoreQuicklinksService EnterpriseCorporate SolutionsRecognitionResearch & InsightsPoints of Light reports and toolkits share best practices and innovative ideas to equip individuals and organizations to make a difference.Learn MoreQuicklinksVolunteer ToolkitsBenchmarking StudiesConvenings & AwarenessWe connect great minds and awaken communities, so that together we evolve to address the world’s changing needs.Learn MoreQuicklinksGeorge H.W. Bush Points of Light AwardsPoints of Light ConferenceDays of ServiceAccelerating People-Powered ChangeAt the core of our philosophy is the belief that the most powerful force in the world is the individual who has realized their power to do good. At Points of Light, we inspire, equip and connect nonprofits/NGOs, businesses and individuals ready to apply their time, talent, voice and resources to solve society’s greatest challenges.Learn More About Our WorkLearn About the Points of Light Global NetworkLearn About Our Corporate PartnershipsSee How We Recognize Individual Volunteers We create products and services that help volunteers, nonprofits/NGOs and corporations maximize their impact. Points of Light reports and toolkits share best practices and innovative ideas to equip individuals and organizations to make a difference. We connect great minds and awaken communities, so that together we evolve to address the world’s changing needs. At the core of our philosophy is the belief that the most powerful force in the world is the individual who has realized their power to do good. At Points of Light, we inspire, equip and connect nonprofits/NGOs, businesses and individuals ready to apply their time, talent, voice and resources to solve society’s greatest challenges. We create products and services that help volunteers, nonprofits/NGOs and corporations maximize their impact. Points of Light reports and toolkits share best practices and innovative ideas to equip individuals and organizations to make a difference. We connect great minds and awaken communities, so that together we evolve to address the world’s changing needs. At the core of our philosophy is the belief that the most powerful force in the world is the individual who has realized their power to do good. At Points of Light, we inspire, equip and connect nonprofits/NGOs, businesses and individuals ready to apply their time, talent, voice and resources to solve society’s greatest challenges. Who We ServeNonprofits/NGOsWe help nonprofits and NGOs recruit, train and manage community volunteers.Learn MoreQuicklinksOur Global NetworkService EnterpriseNonprofit/NGO ResourcesBusinesses/CorporationsWe bring business leaders together to serve and solve global problems.Learn MoreQuicklinksCorporate SolutionsCorporate Service CouncilThe Civic 50 AwardsCorporate ResourcesSocial Impact PlaybookIndividualsWe connect individuals and families with local opportunities to make a difference.Learn MoreQuicklinksFind Volunteer OpportunitiesYouth & Family VolunteeringDaily Point of LightPoints of Light BlogRead stories about extraordinary volunteers, innovative nonprofits and community-minded companies, and get inspired by those who are making a difference in their communities and around the world.Thought Leadership and Stories of InspirationDaily Point of Light StoriesPoints of Light Global NetworkCorporate Social Responsibility We help nonprofits and NGOs recruit, train and manage community volunteers. We bring business leaders together to serve and solve global problems. We connect individuals and families with local opportunities to make a difference. Read stories about extraordinary volunteers, innovative nonprofits and community-minded companies, and get inspired by those who are making a difference in their communities and around the world. We help nonprofits and NGOs recruit, train and manage community volunteers. We bring business leaders together to serve and solve global problems. We connect individuals and families with local opportunities to make a difference. Read stories about extraordinary volunteers, innovative nonprofits and community-minded companies, and get inspired by those who are making a difference in their communities and around the world. Get InvolvedFind a Volunteer Opportunity or Start a ProjectBuild or Grow Your Employee Volunteer ProgramMake a Donation to Support Our WorkTake Part in a Points of Light EventUpcoming EventsApril: Global Volunteer MonthJoin the MovementPoints of Light Conference, June 3–6Register TodayThe George H. W. Bush Points of Light Awards, Oct. 6Learn More April: Global Volunteer MonthJoin the Movement Points of Light Conference, June 3–6Register Today The George H. W. Bush Points of Light Awards, Oct. 6Learn More April: Global Volunteer MonthJoin the Movement Points of Light Conference, June 3–6Register Today The George H. W. Bush Points of Light Awards, Oct. 6Learn More ResourcesBy TypeReportsToolkitsBy TopicFor Nonprofits/NGOsFor CompaniesFeatured ResourceFrom Nice to Necessary: Unleashing the Impact of Volunteering Through Transformative InvestmentDownload the Report Shop About Us Contact/Follow Us Blog **A New Report on the State of Volunteering** Download your copy today. Download your copy today. **Report | Strategic Priorities for the Future of Volunteeringfrom Points of Light** Nonprofits face increasingly challenging times, being asked to do more than ever. The demand for services delivered by volunteers is soaring. However, the systems that make volunteering possible are under-resourced and overstrained. Volunteers don’t just lend a hand; they build stronger communities. Individuals who volunteer are also more likely to vote, join civic organizations, donate and stay engaged. AtPoints of Light, we believe volunteering is one of the most powerful tools we have to strengthen communities. That’s why we commissioned this report —From Nice to Necessary: Unleashing the Impact of Volunteering Through Transformative Investment, informed with research conducted by The Bridgespan Group, a global nonprofit advisory firm. It sheds new light on the essential role volunteers play in nonprofit and social sector success, as well as the urgent need for greater investment in volunteer engagement and infrastructure. **Key Findings** **The impact of volunteers is enormous but hasn’t been sufficiently quantified** While nonprofits often have data on volunteer outputs (e.g., volunteer hours), data showing the true impact of volunteers on social outcomes is very scant. This is particularly true as it relates to broader community and societal impacts. **The full cost of volunteer engagement hasn’t been sufficiently quantified** Effective volunteer engagement is a complex process. Nonprofits rarely have the tools, time and resources to quantify the true costs of recruiting, training, retaining and recognizing volunteers. **Limited impact and cost data fuels a lack of alignment between nonprofits and funders** Limited data makes it harder to articulate costs and benefits of volunteers and for funders to understand how investments in volunteer infrastructure might help achieve the measurable outcomes they are seeking. Many funders see volunteering as a byproduct of nonprofit work rather than a strategic input requiring investment. **This lack of alignment limits funding that flows to volunteer engagement and infrastructure from institutional funders** The top 10 U.S. foundations allocate just 0.07% of their portfolios to volunteer development — severely limiting impact. As a result, critical volunteer infrastructure is undeveloped. **Corporate funders support volunteer efforts at higher levels than foundations, though direct support for volunteer engagement is still limited** Corporations fund volunteer engagement more than foundations, but it remains a small part of their overall giving. Lack of impact data is less of a barrier, as many also see volunteerism as a tool for employee engagement, skill building and community investment. **What We’re Doing Next** In response to the findings, Points of Light is taking action to address the gaps identified in the report and drive a national volunteer movement to increase engagement. We are committed to using the insights gained to drive large-scale change with a multitude of positive ripple effects. With volunteer participation rates stagnating between 20 and 30 percent for decades and only 28 percent of the U.S. population currently engaged in formal volunteering, the report highlights both the challenges of sustaining volunteering as well as the benefits. Bring together a research advisory council on impact to create a comprehensive research agenda, focusing on filling the gaps identified in the report and further understanding the true impact of volunteering. Prioritize investments in nonprofit capacity building to help organizations gather better data and insights, enhancing their ability to measure and demonstrate the value of volunteers. Points of Light will also leverage the deep experience and on-the-ground knowledge of its Global Affiliate Network — comprised of 120 leading nonprofit organizations — to champion, inform, and accelerate volunteer engagement efforts. Build a coalition of partners to develop and implement a national plan for increasing volunteering in the U.S., with the goal of doubling national volunteer rates by 2035. We’re calling on volunteers! Now’s the time to make a difference. Step up, get involved, and lend your time to the causes that matter most to you. Your support can spark real change —volunteer today! **Let’s Connect and Collaborate** Whether you're curious to learn more, exploring partnership opportunities or have success stories to share, we’d love to hear from you. **Spread the Word** **** **Generously supported by** 101 Marietta Street, Suite 3100Atlanta, GA 30303 About Us History Leadership Newsroom Careers For Nonprofits For Corporations For Volunteers Contact Privacy Policy ©2025 Points of Light. All rights reserved. About Us History Leadership Newsroom Careers For Nonprofits For Corporations For Volunteers Contact Privacy Policy 101 Marietta Street, Suite 3100Atlanta, GA 30303 ©2025 Points of Light. All rights reserved."}