{"id": 746, "name": "KEZI - Eugene News", "domain": "kezi.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kezi.com/news/several-power-outages-reported-across-many-areas-in-western-oregon/article_e7057be8-85f8-11ed-a35a-1fd09b61b65b.html", "title": "Several Power Outages Reported Across Many Areas In Western Oregon", "content": "Facebook Twitter YouTube Instagram Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Local Crime Health SchoolWatch Eugene In Crisis Regional National Spanish FireWatch Election Interactive Radar Alerts Maps & Radars WeatherCam9 Ducks Beavers Local Sports National Sports Roundball Wrap Amateur Athlete of the Week On Demand Recipes Cars The American Athlete Watch Live TV Apps YouTube What's On Local Now Community Calendar Contests We're Hiring Special Reports Pet of the Week FireWatch In The Garden Barstool Symphony Keep Oregon Green About Us Advertise With Us Inside KEZI Shows Jobs Meet The Team Digital Marketing Sign Up For Email Alerts Our Apps Site searchSearch Site searchSearch Site searchSearch 68° Search Search Search Open user controlsLog In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Facebook Twitter Instagram News Weather Sports Video Watch Live Community Features Contact Us Deals Contests Weather Latest Weather Forecast WeatherCams KEZI 9 News Obituaries Download Our Apps Several power outages have been reported in areas such as Corvallis, Albany, Coos Bay, Bandon, Sutherlin, and Glide. Facebook Twitter WhatsApp SMS Email Print Copy article link Save Facebook Twitter WhatsApp SMS Email Print Copy article link Save **Several power outages reported across many areas in western Oregon** By: Gillis WIlliamsGillis Williams Dec 27, 2022 Dec 27, 2022UpdatedDec 27, 2022 0 Facebook Twitter WhatsApp SMS Email Several power outages have been reported in areas such as Corvallis, Albany, Coos Bay, Bandon, Sutherlin, and Glide. Facebook Twitter WhatsApp SMS Email Print Copy article link Save EUGENE, Ore. -- Several power outages are being reported in many areas in western Oregon. According toEWEB, around 185 people in Eugene are currently without power, and with the weather changing, that number will continue to change throughout the day. The City of Eugene says the Parks and Open Space Division's Urban Forestry team is handling several downed tree limbs, with one on a house and another on a fence. Officials say residents should report downed trees blocking roadways at 911 if it's an emergency, or 541-682-4800. Lane Electricis reporting more than 1500 people without power along Highway 126 towards Veneta. Pacific Poweris showing several outages in areas such as Corvallis, Albany, Coos Bay, Bandon, Sutherlin, and Glide. Most power companies have their outage information on their websites. Power companies want to remind the public that if you see downed power lines, do not touch them, and call your power provider immediately. Facebook Twitter WhatsApp SMS Email Print Copy article link Save {{description}} Email notifications are only sent once a day, and only if there are new matching items. **More From KEZI 9 News** UpdatedApr 4, 2025 UpdatedAug 21, 2023 UpdatedJun 12, 2024 UpdatedNov 27, 2023 UpdatedOct 9, 2024 UpdatedNov 6, 2024 **Recommended for you** Facebook Twitter Instagram News Weather Sports Video Watch Live Community Features Contact Us Deals Search FCC Public File Assistance FCC Applications FCC Public Inspection File EEO Report Child Programming Advertise with KEZI Advertiser Payments AI Usage Policy Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}