{"id": 504, "name": "Frontiers in Audiology and Otology", "domain": "frontiersin.org/journals/audiology-and-otology", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/audiology-and-otology/articles/10.3389/fauot.2025.1569666/full", "title": "Audiology And Otology", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Auditory Science Clinical Research in Auditory Implants and Hearing Aids Otology and Neurotology Technology and Innovation in Auditory Implants and Hearing Aids Tinnitus Vestibular Disorders Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Auditory Science Clinical Research in Auditory Implants and Hearing Aids Otology and Neurotology Technology and Innovation in Auditory Implants and Hearing Aids Tinnitus Vestibular Disorders Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Auditory Science Clinical Research in Auditory Implants and Hearing Aids Otology and Neurotology Technology and Innovation in Auditory Implants and Hearing Aids Tinnitus Vestibular Disorders Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office SYSTEMATIC REVIEW article Front. Audiol. Otol., 21 May 2025 Sec. Otology and Neurotology Volume 3 - 2025 |https://doi.org/10.3389/fauot.2025.1569666 **Comparison of microscopic vs. endoscopic technique in revision stapes surgery: a systematic literature review** 1Otolaryngology Department, Polytechnic of Marche, Ancona, Italy 2Organ of Sense Department, University La Sapienza of Rome, Rome, Italy 3Otolaryngology Department, University of Salerno, Salerno, Italy 4Section of Otorhinolaryngology, Department of Neurosciences, University of Padova, Padova, Italy 5ENT Department, University of Campania “Luigi Vanvitelli,” Naples, Italy Introduction:In this study, we aimed to evaluate the differences in hearing outcomes and surgical complications after revision stapes procedure using endoscopic and microscopic techniques. Methods:Systematic literature review was performed following the Preferred Reporting Items for Systematic reviews and Meta-Analyses (PRISMA) checklist. A comprehensive search with timeline from January 2010 to May 2024 was performed using PubMed, Scopus, and Google Scholar databases. The following keywords were used: “otosclerosis revision surgery and outcome,” “otosclerosis revision and endoscopic surgery,” “otosclerosis revision surgery and quality of life,” “otosclerosis revision surgery and indication,” “otosclerosis revision surgery and risk,” “otosclerosis revision surgery and results.” Only articles published in English were included. Data on the causes of reintervention, audiological tests, and post-surgical complications were extracted, analyzed, and compared. Results:Fourteen studies, involving 686 patients and 690 procedures, were included. All articles had a retrospective cohort design, with the number of included patients ranging from 6 to 156. Revision surgery was prevalently performed for recurrence of conductive hearing loss (420 cases, 60.8%). Twelve procedures were performed using an endoscopic approach, while 690 surgeries were performed using the traditional microscopic technique. No statistically significant difference was observed in the audiological tests before (p= 0.4; Cohen's d 0.52) and after surgery (p= 0.5; Cohen's, 0.7) between patients treated with endoscopy and microscopy. Statistically significant differences were observed in post-surgical complications. Endoscopic surgery resulted in taste disorders in more patients (p= 0.03), whereas microscopic surgery led to more sensorineural hearing loss (p= 0.02) and tinnitus (p= 0.04) as post-surgical negative outcomes. Conclusion:The two techniques appear equal in terms of audiological results but differed slightly considering surgical complications. However, because the groups were highly unbalanced; therefore, our results must be considered preliminary and interpreted carefully. **1 Introduction** Otosclerosis causes abnormal bone overgrowth around the oval window and clinically manifests as conductive mixed hearing loss (CHL;Blijleven et al., 2019). The first treatment approach is surgical replacement of stapes with a piston (Ricci et al., 2022); in case of failure or recurrence of the disease, treatment includes a combination of reintervention and hearing aids to improve hearing (Ricci et al., 2023). The optimal result is air-bone gap (ABG) closure to ≤ 10 dB (American Academy of Otolaryngology-Head Neck Surgery Foundation, 1995). Currently, due to technological improvements, stapedoplasty can be performed using a traditional microscopic approach or endoscopy (Iannella et al., 2018). Recent meta-analyses have identified overlapping results in first stapes surgery by comparing endoscopic and traditional microscopic approaches (Ho et al., 2021;Bartel et al., 2021;Fang et al., 2021;Koukkoullis et al., 2020). Unfortunately, ~20% of patients who undergo stapes surgery require a revision surgery for progression of otosclerosis into the cochlea or for recurrence of CHL (Luryi et al., 2021). Other causes of reintervention are prosthesis displacement, inadequate stapedotomy, or presence of concomitant reasons for CHL, such as superior semicircular canal dehiscence or lateral chain fixation. In addition, incus necrosis, footplate regrowth, and development of tinnitus or vertigo may require surgical revision. The likelihood of positive and satisfactory outcomes is inversely related to the number of reinterventions; it is estimated that revision outcomes are ~40–80% less satisfactory than primary stapedectomy (Wegner et al., 2018). In particular, there is a higher risk of postoperative sensorineural hearing loss (SNHL; 1–8%) compared to primary surgery (<1%; Wegner et al., 2018). Thus far, original comparative studies or systematic reviews evaluating the differences in audiological outcomes and complications between endoscopic and microscopic approaches remain lacking. In this systematic literature review, we aimed to evaluate audiological results and the occurrence of postoperative complications by comparing endoscopic and microscopic approaches in stapes revision procedures. **2 Materials and methods** **2.1 Search strategy** This study was conducted according to the Preferred Reporting Items for Systematic Reviews and Meta-analyses (PRISMA) checklist and statement recommendations. This review did not require Institutional Review Board approval. A comprehensive search strategy developed in partnership with a medical librarian was performed using PubMed, Scopus, and Google Scholar with a timeline from January 2010 to May 2024. The following combined keywords were used: “otosclerosis and surgery,” “otosclerosis and audiological findings,” “otosclerosis revision surgery,” “otosclerosis revision surgery and indication,” “otosclerosis revision surgery and risk,” “otosclerosis revision surgery and results,” “otosclerosis revision surgery and outcome,” “otosclerosis revision and endoscopic surgery,” and “otosclerosis revision surgery and quality of life.” Only articles published in English language were considered for analysis. Two independent investigators reviewed the articles extracted from literature. Duplicates were removed, and each reviewer individually filled in an Excel data sheet (Microsoft Corporation, Redmond, WA, USA), including information extracted from the articles. The results were compared and disagreements regarding included/excluded papers were debated until a consensus was reached among the researchers (FMG, MR, MRe, and ADS). Only papers with full consensus were considered. **2.2 Study selection criteria** The inclusion criteria were articles on revision surgery for otosclerosis written in English with available full-text, longitudinal, observational, case-control studies, and clinical trial designs. The articles had to report the following information: method of surgery (microscopy or endoscopy), details regarding intraoperative findings observed during revision surgery, post-surgical complications, and audiological outcomes (assessed by comparing presurgical and post-surgical mean ABG levels). Exclusion criteria were articles discussing auditory rehabilitation or medical treatment for otosclerosis, written in languages different from English, including French and Italian, case report, case series, review, systematic review and meta-analyses designs, and papers published before 2010, because “endoscopic middle ear surgery” was not available prior to 2010. The selected articles were read in full to assess the study objectives and results. Details regarding sex, age, type of surgical approach, audiological tests before and after surgery, intraoperative findings, and complications were extracted for statistical analysis. **2.3 Statistical analysis** T-test (τ) was used to compare numerical data such as sample size. Post-surgery outcomes (nominal data) of traditional and endoscopic revision stapedectomy were compared using the chi-square test (χ). Audiological findings before and after surgery were compared using one-way analysis of variance (ANOVA). Cohen's test was used to evaluate the effects of different sample sizes. The value of p was considered significant at <0.05. Analyses were performed using PRISM 10.3. **3 Results** Fourteen studies comprising 686 patients and 690 procedures met the inclusion criteria and were included in the review (Figure 1). The main characteristics of the selected studies are summarized inTable 1. All the included studies had a retrospective cohort design. The number of patients varied among the studies, ranging from 6 to 156. In 60.8% (420 cases) the reason for revision surgery was recurrence of CHL. Figure 1. Flow chart showing study selection. Table 1. Main characteristics of the selected studies. Details of intraoperative findings were reported in 58.5% of cases (404/690 procedures). Twelve studies (85.7%) reported audiological outcomes, as mean (pre and post-surgical) ABG pure-tone audiometry (PTA) values. The mean presurgical ABG-PTA was 32.9 dB while post-surgical ABG-PTA was 13.1 dB. Eleven studies (78.6%) provided information on post-treatment complications. It was not possible to perform a meta-analyses as first for the heterogeneity of the outcome measures, i.e., only 58.5% of the study had details about intra-operative findings, secondly because the the endoscopy sample was too small. None of the studies had overlapping cohort, no great potential bias were identified. **3.1 Comparison between traditional and endoscopic surgery** Considering the two techniques, 620 patients (625 procedures) underwent revision with traditional surgery (microscopy) and 12 patients (12 procedures) with endoscopy. The difference between the patients treated in the two groups was statistically significant (t-test,p< 0.00001). All patients underwent traditional microscopic surgery as the first surgery. In the traditional surgery group, 408 procedures were performed for CHL and 62 for other causes (Table 2), while in the endoscopic surgery group, all procedures were performed for CHL. In the traditional surgery group, we observed the following intraoperative findings: 34.3% prosthesis dislocation (132 cases), 33.3% incus erosion (128 cases), 12.7% adhesion (49 cases), 6.2% incomplete previous surgery (24 cases), 5.4% others (21 cases), 4.1% normal anatomy with good prosthesis placement (16 cases), 2% lateral chain fixation (8 subjects), 1.3% obliterative otosclerosis (5 cases), 0.2% reparative granuloma (1 case).Table 2shows the list of intraoperatory findings.Table 3shows the other causes that conducted patients to re-intervention. Table 2. List of other intraoperative pathological findings. Table 3. List of other reasons for performing surgical revision procedure. Patients treated with endoscopy showed 8.3% incus erosion (1 case), 41.6% prothesis dislocation (5 patients), and 50% lateral chain fixation (6 patients). Presurgical ABG-PTA was 33.1 ± 5.8 in patients who underwent revision surgery with microscope; notably, two studies including 150 patients did not report this detail (Luryi et al., 2021;Ying et al., 2011) and therefore ABG-PTA data were not available for 177 patients. In this group, post-surgical ABG-PTA was 12.6 ± 2.7; however, the same abovementioned studies did not report this data, and consequently the ABG-PTA average was obtained only for 341 patients. The presurgical ABG-PTA was 33 ± 2.7 in the group of patients who underwent endoscopic revision surgery; after revision surgery, the ABG-PTA was 14.5 ± 0.7. The following post-surgical complications were observed in patients treated with microscopic procedure: 2.3% SNHL (10 patients), 0.4% tinnitus (2 cases), 0.1% taste alterations (1 person), and 0.8% vertigo (4 subjects). Three studies, including 23 (Polony et al., 2021), 26 (Rouhani and Lavy, 2019), and 27 patients (Ying et al., 2011), did not include any information on post-surgical outcomes. The percentages were calculated for 442 patients. None of the patients treated endoscopically reported SNHL or tinnitus. Contrarily, taste disorders were observed in 25% (3 cases) and vertigo in 41.6% of patients (5 cases). **3.2 Comparison between the two groups** No statistically significant difference was observed in ABG-PTA before (p= 0.4; Cohen's, 0.52) and after surgery (p= 0.5; Cohen's, 0.7). The comparison of post-surgical complications was statistically significant for SNHL (p= 0.02), tinnitus (p= 0.04), and taste disorders (p= 0.03), but not for vertigo (p= 0.5). SNHL and tinnitus were the most common negative outcomes in patients who underwent revision surgery with microscope; indeed, taste disorders were the most common complications in the endoscopic approach. **4 Discussion** Based on the results of this systematic literature review, the two techniques appear equal in terms of audiological results but differ slightly in terms of postoperative complications. The different incidence of complications might be due to the instruments used; the endoscope touching the canal wall may present a higher risk of damaging the chorda tympany, causing taste disorders, and a microscope providing a limited view might increase the risk of perilymph leak during surgery with consequent SNHL and tinnitus (Figure 2). Figure 2. Images showing the comparison between microscopic and endoscopic views during stapes revision surgery. Because the groups were highly unbalanced, our results must be considered preliminary and interpreted carefully. It is also important to consider additional aspects that can affect the outcomes independent of the approach. First, although most patients in both groups underwent reintervention, the main cause of reintervention could have affected the result. Some aspects, such as the condition of the incus and closure of the oval window, could negatively impact audiological outcomes and even increase the risk of complications after reintervention. Another important aspect that can impact (positively or negatively) the outcomes is the surgical experience of the surgeon. In this systematic review, we included data from different studies with different surgeons, and this aspect could have impacted the results independent of the surgical approach used (microscope or endoscope). It is important to underline that the evidences about using endoscope for re-intervention are very limited; the sample size is minimal—six patients in each study-, there is an important variable related to the two surgeons who performed the surgery and the follow-up post revision surgery is short. However, if we consider the comparison between the two techniques made for primary stapes surgery, the results of the systematic review and meta-analyses support our current results.Koukkoullis et al. (2020)analyzed the odds ratio (OR) of different parameters comparing endoscope and microscope approach for primary stapedoplasty; the authors found an increased risk of damaging chorda tympani (OR:3.51) with taste alteration (OR: 2.36) or post-operative dizziness (OR: 2.15) using the microscope approach vs. the endoscope approach. These results overlap the findings we observed comparing the same technique in revision surgery. A recent systematic review (Mikahail et al., 2024) on the same topic confirmed Koukkoullis's results regarding the chorda tympani damage, but not regarding dizziness and taste disorders. Additionally, the authors found a considerably increased postoperative air–bone gap in the microscopic group. The latter was in contrast with our results. **4.1 Post-surgical audiological outcomes (endoscope vs. microscope)** Our results showed similar mean postoperative ABG for the microscopic and endoscopic revision procedures. This agrees with previously published studies (meta-analyses), where audiological outcomes were compared between endoscope and microscope techniques for primary stapes procedures (Ho et al., 2021;Bartel et al., 2021;Koukkoullis et al., 2020). Cohen's test, used to evaluate the impact of different sample sizes on the statistical results, showed a medium effect (0.52) of different sample sizes on presurgical auditory findings and a medium-large effect (0.7) on post-surgical auditory outcomes. Because the two groups did not present statistically significant differences, the effect of Cohen's test is not relevant to interpret our results. In fact, Cohen's test is generally considered in the case of statistically significant comparisons. However, we believe that our data should be carefully interpreted because of the effect of different sample sizes on the statistical results, although it is non-significant. Nevertheless,Fang et al. (2021)observed better audiological results after surgery (with a statistically significant value) in patients treated with endoscopic procedure compared those treated by microscope. Unfortunately, none of the studies included in this review reported data on ABG closure (<10 dB); however, in all cases, the authors described an ABG <20 dB. Although not excellent, an ABG of ~20 dB could be an acceptable result, particularly for revision surgery (Ricci et al., 2023). However, changes in the ABG must be considered with caution. In fact, both in primary and revision otosclerosis, the surgical procedures can cause SNHL with a worsening of bone conduction, and this might superficially mimic ABG closure. **4.2 Post-surgical complications (endoscope vs. microscope)** Tinnitus or transitory dizziness are frequently reported after revision stapes surgery. This event may be a consequence of lack of perilymph during surgery. Because a minimal loss of perilymph can be replaced in 1 week (Di Stadio et al., 2024), these symptoms are transitory and tend to spontaneously disappear within a week in the majority of cases. In contrast, the post-surgical worsening of bone conduction threshold is a more serious complication. Worsening of the auditory threshold is related to excess perilymph loss during the procedure (Alicandri-Ciufelli et al., 2019). The rate of SNHL tends to be higher after revision stapes surgery compared to primary surgery; up to 20% of SNHL cases have reportedly occurred after revision surgery (Gros et al., 2005). This can result from an alteration in the normal anatomy due to prior surgery and unpredictable bony regrowth of the oval window. The results of our review showed better auditory outcomes with the endoscopic technique, although endoscopy is associated with a high risk of taste disorders. Considering post-surgical complications, the differences we observed were the same as those reported by other authors (Ho et al., 2021;Bartel et al., 2021;Koukkoullis et al., 2020). In literature, only one study favored the endoscopic approach to reduce the risk of chorda tympani lesions (Fang et al., 2021). **4.3 The emerging role of endoscopic approach in stapes surgery** Fifteen years ago, thanks to the development of endoscopy technology, some surgeons began to use this technique to approach the middle ear and perform surgical treatment for chronic otitis and cholesteatoma (Presutti et al., 2014). The use of an endoscope enabled a clear view of the middle ear. In the following years, “endoscopic middle ear surgery” was extended to treat other conditions such as otosclerosis. Several studies, including meta-analyses, have compared the outcomes between endoscopic and microscopic techniques (Ho et al., 2021;Bartel et al., 2021;Fang et al., 2021;Koukkoullis et al., 2020). To date, meta-analyses have only analyzed the results of the primary surgery. The results of this systematic review showed similar audiological outcomes between endoscopic and microscopic techniques, with slightly fewer auditory complications with the endoscopic technique than with the microscopic technique. We believe that the use of an endoscope can also benefit teachers. Stapes surgery performed using traditional non-video-assisted microscope is challenging to be followed by a non-expert in the field (i.e., residents in otolaryngology or first-year fellows in neurotology). Indeed, the second ocular of the microscope only allows a two-dimensional view that makes it difficult to fully understand the details of the procedure. An endoscope that allows direct and complete visualization of the middle ear could be a useful tool to simplify the teaching of this complex procedure, particularly during reintervention. **4.4 Limitations of the study** Our review has several limitations. First, fewer cases were treated using the endoscopic approach than with the microscope. This drawback makes it difficult to reach definitive conclusions regarding the advantages of endoscopy in stapes revision procedures because the groups were highly unbalanced. However, despite the scarcity of cases, our results overlap with those of previous meta-analyses comparing the two techniques in treating primary otosclerosis. Another important limitation was the failure of the primary surgery, which necessitated a revision procedure. Otosclerosis is a progressive condition, and surgery is performed to restore the auditory capacity, which has limited effects on disease progression. Analysis of intraoperative findings could be useful for understanding the cause of recurrent CHL. Moreover, understanding whether prosthesis dislocation or cochlear ossification was the cause of hearing loss could be useful in predicting the auditory outcomes related to different techniques. In addition, the causes of revision surgery differed between the two groups. Further studies should compare homogeneous causes of revision to limit confounding factors, that is, better post-surgical outcomes in piston displacement than in scar adhesion or incus erosion. Every specific condition may represent an enormous confounding factor in the consideration of final outcomes and complications, regardless of the surgical approach. Unfortunately, the number of studies analyzing the final outcomes separately with respect to intraoperative pathological findings remains limited. Finally, other elements can influence the results of the surgery in addition to the surgical approach, such as the use of laser (alone or combined with a microdrill), type of anesthesia, and model of the prosthesis used. These elements were not considered in this systematic review because of missing data. However, all the abovementioned elements can impact both audiological results and complications. **5 Conclusion** This systematic review included a large series of revision stapes surgeries and is the first study to analyze hearin g outcomes and complication rates by comparing microscopic and endoscopic approaches. However, because of the strong important difference in term of cases between microscope and endoscope approach, 620 vs. 12, although the statistical analyses identified overlapping auditory results between the two, with differences in post-surgical complications that could be related to the different approaches, our results must absolutely be considered as preliminary. The data on endoscopic approach in revision stapes surgery are still too limited to make an equal comparison with the microscope; larger prospective studies or clinical trial perfomed by the same surgeon are a must to confirm or not the findings of this systematic review. To reiterate, despite intriguing, our results are only preliminary. **Data availability statement** The data analyzed in this study is subject to the following licenses/restrictions: data are available under reasonable request to the corresponding author. Requests to access these datasets should be directed toYXJpYW5uYWRpc3RhZGlvQGhvdG1haWwuY29t. **Author contributions** FG: Data curation, Investigation, Methodology, Writing – original draft, Conceptualization, Formal analysis. MRa: Data curation, Formal analysis, Writing – review & editing. MRe: Writing – review & editing, Funding acquisition, Resources, Validation. GI: Writing – review & editing. AS: Writing – review & editing, Data curation, Resources. VD: Resources, Writing – review & editing, Visualization. GM: Resources, Writing – review & editing, Data curation, Formal analysis, Validation. ADS: Data curation, Writing – review & editing, Investigation, Methodology, Supervision, Writing – original draft. **Funding** The author(s) declare that no financial support was received for the research and/or publication of this article. **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. The author(s) declared that they were an editorial board member of Frontiers, at the time of submission. This had no impact on the peer review process and the final decision. **Generative AI statement** The author(s) declare that no Gen AI was used in the creation of this manuscript. **Publisher's note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **References** Alicandri-Ciufelli, M, Molinari, G., Rosa, M. S., Monzani, D., and Presutti, L. (2019). Gusher in stapes surgery: a systematic review.Eur. Arch. Otorhinolaryngol. 276, 2363–2376. doi: 10.1007/s00405-019-05538-x PubMed Abstract|Crossref Full Text|Google Scholar American Academy of Otolaryngology-Head and Neck Surgery Foundation Inc.. (1995). Committee on hearing and equilibrium guidelines for the evaluation of results of treatment of conductive hearing loss.Otolaryngol. Head Neck Surg.113, 186–187 doi: 10.1016/S0194-5998(95)70103-6 PubMed Abstract|Crossref Full Text|Google Scholar Bakhos, D., Lescanne, E., Charretier, C., and Robier, A. (2010). A review of 89 revision stapes surgeries for otosclerosis.Eur. Ann. Otorhinolaryngol. Head Neck Dis. 127, 177–182. doi: 10.1016/j.anorl.2010.07.012 PubMed Abstract|Crossref Full Text|Google Scholar Bartel, R., Sanz, J. J., Clemente, I., Simonetti, G., Viscacillas, G., Palomino, L., et al. (2021). Endoscopic stapes surgery outcomes and complication rates: a systematic review.Eur. Arch. Otorhinolaryngol.278, 2673–2679. doi: 10.1007/s00405-020-06388-8 PubMed Abstract|Crossref Full Text|Google Scholar Blijleven, E. E., Wegner, I., Tange, R. A., and Thomeer, H. G. X. M. (2019). Revision stapes surgery in a tertiary referral center: surgical and audiometric outcomes.Ann. Otol. Rhinol. Laryngol.128, 997–1005. doi: 10.1177/0003489419853304 PubMed Abstract|Crossref Full Text|Google Scholar Di Stadio, A., Ralli, M., Kaski, D., Koohi, N., Gioacchini, F. M., Kysar, J. W., et al. (2024). Exploring inner ear and brain connectivity through perilymph sampling for early detection of neurological diseases: a provocative proposal.Brain Sci.14:621. doi: 10.3390/brainsci14060621 PubMed Abstract|Crossref Full Text|Google Scholar Fang, L., Xu, J., Wang, W., and Huang, Y. (2021). Would endoscopic surgery be the gold standard for stapes surgery in the future? A systematic review and meta-analysis.Eur. Arch. Otorhinolaryngol.278, 925–932. doi: 10.1007/s00405-020-06132-2 PubMed Abstract|Crossref Full Text|Google Scholar Gros, A., Vatovec, J., Zargi, M., and Jenko, K. (2005). Success rate in revision stapes surgery for otosclerosis.Otol. Neurotol.26, 1143–1148. doi: 10.1097/01.mao.0000172414.64907.9d PubMed Abstract|Crossref Full Text|Google Scholar Ho, S., Patel, P., Ballard, D., Rosenfeld, R., and Chandrasekhar, S. (2021). Systematic review and meta-analysis of endoscopic vs microscopic stapes surgery for stapes fixation.Otolaryngol. Head Neck Surg.165, 626–635 doi: 10.1177/0194599821990669 PubMed Abstract|Crossref Full Text|Google Scholar House, J. W., Lupo, J. E., and Goddard, J. C. (2014). Management of incus necrosis in revision stapedectomy using hydroxyapatite bone cement.Otol. Neurotol.35, 1312–1316. doi: 10.1097/MAO.0000000000000496 PubMed Abstract|Crossref Full Text|Google Scholar Iannella, G., Angeletti, D., Manno, A., Pasquariello, B., Re, M., and Magliulo, G. (2018). Malleostapedotomy in stapes revision surgery: is an endoscopic approach possible?Laryngoscope128, 2611–2614. doi: 10.1002/lary.27206 PubMed Abstract|Crossref Full Text|Google Scholar Jervis-Bardy, J., Gau, V. L., Allsopp, T., King, D., Page, J. C., and Dornhoffer, J. L. (2020). Outcomes following revision stapes surgery in children: a single-surgeon, single-center 15-year experience.Otol. Neurotol.41, e720–e726. doi: 10.1097/MAO.0000000000002660 PubMed Abstract|Crossref Full Text|Google Scholar Koukkoullis, A., Tóth, I., Gede, N., Szakács, Z., Hegyi, P., Varga, G., et al. (2020). Endoscopic vs. microscopic stapes surgery outcomes: a meta-analysis and systematic review.Laryngoscope130, 2019–2027. doi: 10.1002/lary.28353 PubMed Abstract|Crossref Full Text|Google Scholar Luryi, A. L., Schettino, A, Bojrab, D. I., Babu, S. C., Michaelides, E. M., Bojrab, D.I. 2nd, et al. (2021). Hearing outcomes and complications in stapes surgery for otosclerosis performed under general or local anesthesia.Otolaryngol. Head Neck Surg. 165, 157–162. doi: 10.1177/0194599820972671 PubMed Abstract|Crossref Full Text|Google Scholar Mikahail, P. M., Fawaz, S. A., Elbagory, M. M., and Mady, O. M. (2024). Microscopic vs. endoscopic stapes surgery—a meta-analysis study.Egypt. J. Otolaryngol.40:112. doi: 10.1186/s43163-024-00681-7 Crossref Full Text|Google Scholar Nassiri, A. M., Yawn, R. J., Dedmon, M. M., Tolisano, A. M., Hunter, J. B., Isaacson, B., et al. (2019). Audiologic and surgical outcomes in endoscopic revision stapes surgery.Laryngoscope129, 2366–2370. doi: 10.1002/lary.27786 PubMed Abstract|Crossref Full Text|Google Scholar Pauli, N., Finizia, C., Lundman, L., Björsne, A., and Dahlin-Redfors, Y. (2023). Are there differences in revision stapes surgery outcomes between university and county clinics? A study from the quality register for otosclerosis surgery in Sweden.Eur. Arch. Otorhinolaryngol.280, 2247–2255. doi: 10.1007/s00405-022-07737-5 PubMed Abstract|Crossref Full Text|Google Scholar Polony, G., Gáborján, A., Tamás, L., and Székely, L. (2021). Revision stapedotomies: the role of periprosthetic scar tissue formation in the development of unsatisfactory hearing results after stapedotomy.Int. Arch. Otorhinolaryngol.26, e422–e427. doi: 10.1055/s-0041-1740100 PubMed Abstract|Crossref Full Text|Google Scholar Presutti, L., Gioacchini, F. M., Alicandri-Ciufelli, M., Villari, D., and Marchioni, D. (2014). Results of endoscopic middle ear surgery for cholesteatoma treatment: a systematic review.Acta. Otorhinolaryngol. Ital.34, 153–157. Google Scholar Ricci, G., Ferlito, S., Gambacorta, V., Faralli, M., De Luca, P., Di Giovanni, A., et al. (2023). Treatment of far-advanced otosclerosis: stapedotomy plus hearing aids to maximize the recovery of auditory function-a retrospective case series.Healthcare11:676. doi: 10.3390/healthcare11050676 PubMed Abstract|Crossref Full Text|Google Scholar Ricci, G., Gambacorta, V., Lapenna, R., Della Volpe, A., La Mantia, I., Ralli, M., et al. (2022). The effect of female hormone in otosclerosis. A comparative study and speculation about their effect on the ossicular chain based on the clinical results.Eur. Arch. Otorhinolaryngol.279, 4831–4838. doi: 10.1007/s00405-022-07295-w PubMed Abstract|Crossref Full Text|Google Scholar Rouhani, M. J., and Lavy, J. (2019). Revision stapes surgery: a novel technique of overcoming erosion of the long process of incus using hydroxylapatite cement and shape memory piston.Otol. Neurotol.40, 301–304. doi: 10.1097/MAO.0000000000002150 PubMed Abstract|Crossref Full Text|Google Scholar Skrivan, J., Cada, Z., Kluh, J., Boucek, J., Profant, O., and Betka, J. (2014). Revision operations after previous stapes surgery for persisting hearing loss.Bratisl. Lek. Listy. 115, 442–444. doi: 10.4149/BLL_2014_087 Crossref Full Text|Google Scholar Stucken, E. Z., Brown, K. D., and Selesnick, S. H. (2012). The use of KTP laser in revision stapedectomy.Otol. Neurotol.33, 1297–1299. doi: 10.1097/MAO.0b013e3182634e45 PubMed Abstract|Crossref Full Text|Google Scholar Van Rompaey, V., Claes, G., Somers, T., and Offeciers, E. (2011). Erosion of the long process of the incus in revision stapes surgery: malleovestibular prosthesis or incus reconstruction with hydroxyapatite bone cement?Otol. Neurotol.32, 914–918. doi: 10.1097/MAO.0b013e3182255968 PubMed Abstract|Crossref Full Text|Google Scholar Wegner, I., Vincent, R., Derks, L. S. M., Rauh, S. P., Heymans, M. W., Stegeman, I., et al. (2018). An internally validated prognostic model for success in revision stapes surgery for otosclerosis.Laryngoscope128, 2390–2396. doi: 10.1002/lary.27132 PubMed Abstract|Crossref Full Text|Google Scholar Ying, Y. L., Hillman, T. A., and Chen, D. A. (2011). Patterns of failure in heat-activated crimping prosthesis in stapedotomy.Otol. Neurotol.32, 21–28. doi: 10.1097/MAO.0b013e3182009d10 PubMed Abstract|Crossref Full Text|Google Scholar Keywords:otosclerosis, revision surgery, microscope, endoscope, audiological outcomes, complication Citation:Gioacchini FM, Ralli M, Re M, Iannella G, Scarpa A, Di Pasquale Fiasca V, Motta G and Di Stadio A (2025) Comparison of microscopic vs. endoscopic technique in revision stapes surgery: a systematic literature review.Front. Audiol. Otol.3:1569666. doi: 10.3389/fauot.2025.1569666 Received:01 February 2025;Accepted:29 April 2025;Published:21 May 2025. Edited by: Reviewed by: Copyright© 2025 Gioacchini, Ralli, Re, Iannella, Scarpa, Di Pasquale Fiasca, Motta and Di Stadio. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Arianna Di Stadio,YXJpYW5uYWRpc3RhZGlvQGhvdG1haWwuY29t Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract 1 Introduction 2 Materials and methods 3 Results 4 Discussion 5 Conclusion Data availability statement Author contributions Funding Conflict of interest Generative AI statement Publisher's note References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}