{"id": 973, "name": "New Matilda", "domain": "newmatilda.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://newmatilda.com/2020/06/23/we-see-your-mike-pence-and-raise-you-a-vladimir-putin-a-russian-leaders-take-on-how-the-soviets-beat-the-nazis-with-caveats/", "title": "We See Your Mike Pence And Raise You A Vladimir Putin A Russian Leaders Take On How The Soviets Beat The Nazis With Caveats", "content": "Home Indigenous affairs Politics Special Investigations MoreAssange & WikileaksAsylum SeekersBusiness & ConsumerismCartoonsCivil SocietyEditorialEducationEnvironmentInternational AffairsMedia & CultureThe InsiderWorkers’ Rights Assange & Wikileaks Asylum Seekers Business & Consumerism Cartoons Civil Society Editorial Education Environment International Affairs Media & Culture The Insider Workers’ Rights Assange & Wikileaks Asylum Seekers Business & Consumerism Cartoons Civil Society Editorial Education Environment International Affairs Media & Culture The Insider Workers’ Rights Subscribe My Account **Vladimir Putin: 75th Anniversary Of The Great Victory; Shared Responsibility To History And Our Future** 75 years have passed since the end of the Great Patriotic War. Several generations have grown up over the years. The political map of the planet has changed. The Soviet Union that claimed an epic, crushing victory over Nazism and saved the entire world is gone. Russian president Vladimir Putin weighs in (you can read an explanation of how New Matilda came to publish Putin’s articlehere). Besides, the events of that war have long become a distant memory, even for its participants. So why does Russia celebrate the 9th of May as the biggest holiday? Why does life almost come to a halt on June 22? And why does one feel a lump rise in their throat? They often say that the war has left a deep imprint on every family’s history. Behind these words, there are the fates of millions of people, their sufferings and the pain of loss. Behind these words, there is also the pride, the truth and the memory. For my parents, the war meant the terrible ordeals of the Siege of Leningrad, where my two-year-old brother Vitya died. It was the place where my mother miraculously managed to survive. My father, despite being exempt from active duty, volunteered to defend his hometown. He made the same decision as millions of Soviet citizens. He fought at the Nevsky Pyatachok bridgehead and was severely wounded. The more years pass, the more I feel the need to talk to my parents and learn more about the war period of their lives. But I no longer have the opportunity to do so. This is the reason why I treasure in my heart the conversations I had with my father and mother on this subject, as well as the little emotion they showed. I believe it is important that people of my age, and our children, grandchildren and great-grandchildren, understand the torment and hardships their ancestors had to endure. They need to understand how their ancestors managed to persevere and win. Where did their sheer, unbending willpower that amazed and fascinated the whole world come from? Sure, they were defending their homes, children, loved ones and families. However, what they shared was the love for their homeland, their Motherland. That deep-seated, intimate feeling is fully reflected in the very essence of our nation and became one of the decisive factors in its heroic, sacrificial fight against the Nazis. **New generation, new traditions** People often wonder: What would today’s generation do? How will it act when faced with a crisis situation? I see young doctors, nurses, sometimes fresh graduates that go to the “red zone” to save lives. I see our servicemen fighting international terrorism in the North Caucasus, fighting to the bitter end in Syria. They are so young. Many servicemen who were part of the legendary, immortal 6th Paratroop Company were 19 or 20-years-old. But all of them proved that they deserved to inherit the feat of the warriors of our Motherland that defended it during the Great Patriotic War. This is why I am confident that one of the characteristic features of the peoples of Russia is to fulfil their duty without feeling sorry for themselves when the circumstances so demand. Such values as selflessness, patriotism, love for their home, their family and Fatherland remain fundamental and integral to Russian society to this day. These values are, to a large extent, the backbone of our country’s sovereignty. Nowadays, we have new traditions created by the people, such as the Immortal Regiment. This is the memory march that symbolises our gratitude, as well as the living connection and the blood ties between generations. Millions of people ever year come out to the streets carrying the photographs of their relatives who defended their Fatherland and defeated the Nazis. This means that their lives, the ordeals and sacrifices they endured, as well as the Victory that they passed to us will never be forgotten. We have a responsibility to our past and our future to do our utmost to prevent those horrible tragedies from ever happening again. Hence, I was compelled to come out with an article about World War II and the Great Patriotic War. I have discussed this idea on several occasions with world leaders, and they have showed their support. At the summit of CIS leaders held at the end of last year, we all agreed on one thing: it is essential to pass on to future generations the memory of the fact that the Nazis were defeated first and foremost by the entire Soviet people, and that representatives of all republics of the Soviet Union fought side-by-side together in that heroic battle, both on the frontlines and in the rear. During that summit, I also talked with my counterparts about the challenging pre-war period. That conversation caused a stir in Europe and the world. It means that it is indeed high time that we revisited the lessons of the past. At the same time, there were many emotional outbursts, poorly disguised insecurities and loud accusations that followed. Acting out of habit, certain politicians rushed to claim that Russia was trying to rewrite history. However, they failed to rebut a single fact or refute a single argument. It is indeed difficult, if not impossible, to argue with the original documents that, by the way, can be found not only in Russian, but also in foreign archives. Thus, there is a need to further examine the reasons that caused the world war and reflect on its complicated events, tragedies and victories, as well as its lessons, both for our country and the entire world. And like I said, it is crucial to rely exclusively on archive documents and contemporary evidence while avoiding any ideological or politicised speculations. **Painful truths** I would like to once again recall the obvious fact. The root causes of World War II mainly stem from the decisions made after World War I. The Treaty of Versailles became a symbol of grave injustice for Germany. It basically implied that the country was to be robbed, forced to pay enormous reparations to the Western allies that drained its economy. French Marshal Ferdinand Foch who served as the Supreme Allied Commander gave a prophetic description of that Treaty: “This is not peace. It is an armistice for twenty years.” It was the national humiliation that became a fertile ground for radical and revenge-seeking sentiments in Germany. The Nazis skilfully played on people’s emotions and built their propaganda promising to deliver Germany from the “legacy of Versailles” and restore the country to its former power, while essentially pushing German people into war. Paradoxically, the Western states, particularly the United Kingdom and the United States, directly or indirectly contributed to this. Their financial and industrial enterprises actively invested in German factories and plants which manufactured military products. Besides, many people in the aristocracy and political establishment supported radical, far-right and nationalist movements that were on the rise both in Germany and in Europe. “Versailles world order” caused numerous implicit controversies and apparent conflicts. They revolved around the borders of new European states randomly set by the victors in World War I. That boundary delimitation was almost immediately followed by territorial disputes and mutual claims that turned into ‘time bombs’. **No Light from darkness** One of the major outcomes of World War I was the establishment of the League of Nations. There were high expectations for that international organisation to ensure lasting peace and collective security. It was a progressive idea that, if followed through consistently, could actually prevent the horrors of a global war from happening again. However, the League of Nations dominated by the victorious powers of France and the United Kingdom proved ineffective and was swamped by pointless discussions. The League of Nations and the European continent in general turned a deaf ear to the repeated calls of the Soviet Union to establish an equitable collective security system, and sign an Eastern European pact and a Pacific pact to prevent aggression. These proposals were disregarded. The League of Nations also failed to prevent conflicts in various parts of the world, such as the attack by Italy on Ethiopia, a civil war in Spain, the Japanese aggression against China and the Anschluss of Austria. Furthermore, in case of the Munich Betrayal that, in addition to Hitler and Mussolini, involved British and French leaders, Czechoslovakia was taken apart with the full approval of the League of Nations. **Europe courted Hitler, Russia didn’t** I would like to point out in this regard that, unlike many other European leaders of that time, Stalin did not disgrace himself by meeting with Hitler, who was known among the Western nations as quite a reputable politician and was a welcome guest in the European capitals. Poland was also engaged in the partition of Czechoslovakia, along with Germany. They decided together in advance who would get what Czechoslovak territories. On September 20, 1938, Polish Ambassador to Germany Józef Lipski reported to Poland’s Minister of Foreign Affairs, Józef Beck on the following assurances made by Hitler: “… in case of a conflict between Poland and Czechoslovakia over our interests in Teschen, the Reich would stand by Poland.” Poland was aware that without Hitler’s support, its annexationist plans were doomed to fail. I would like to quote in this regard, a record of the conversation between German Ambassador to Warsaw, Hans-Adolf von Moltke and Józef Beck, which took place on October 1, 1938, and was focused on the Polish-Czech relations and the position of the Soviet Union in this matter. It says: “Mr Beck expressed real gratitude for the loyal treatment accorded to Polish interests at the Munich conference, as well as the sincerity of relations during the Czech conflict. The Government and the public [of Poland]fully appreciated the attitude of the Fuehrer and Chancellor.” The partition of Czechoslovakia was brutal and cynical. Munich destroyed even the formal, fragile guarantees that remained on the continent. It showed that mutual agreements were worthless. It was the Munich Betrayal that served as the ‘trigger’ and made the great war in Europe inevitable. Today, European politicians, and Polish leaders in particular, wish to sweep the Munich Betrayal under the carpet. Why? The fact that their countries once broke their commitments and supported the Munich Betrayal, with some of them even participating in divvying up the take, is not the only reason. Another is that it is embarrassing to recall that during those dramatic days of 1938, the Soviet Union was the only one to stand up for Czechoslovakia. The Soviet Union, in accordance with its international obligations, including agreements with France and Czechoslovakia, tried to prevent the tragedy from happening. Meanwhile, Poland, in pursuit of its interests, was doing its utmost to hamper the establishment of a collective security system in Europe. Foreign Minister Beck wrote about it directly in his letter of September 19, 1938 to the aforementioned Ambassador Józef Lipski before his meeting with Hitler: “…in the past year, the Polish government rejected four times the proposal to join the international interfering in defence of Czechoslovakia.” Britain, as well as France, which was at the time the main ally of the Czechs and Slovaks, chose to withdraw their guarantees and abandon this Eastern European country to its fate. In so doing, they sought to direct the attention of the Nazis eastward so that Germany and the Soviet Union would inevitably clash, and bleed each other white. That was the essence of the western policy of ‘appeasement,’ which was pursued not only towards the Third Reich but also towards other participants of the so-called Anti-Comintern Pact – the fascist Italy and militarist Japan. In the Far East, this policy culminated in the conclusion of the Anglo-Japanese agreement in the summer of 1939, which gave Tokyo a free hand in China. The leading European powers were unwilling to recognise the mortal danger posed by Germany and its allies to the whole world. They were hoping that they themselves would be left untouched by war. The Munich Betrayal showed to the Soviet Union that Western countries would deal with security issues without taking its interests into account. In fact, they could even create an anti-Soviet front, if needed. **The Soviets fight back** Nevertheless, the Soviet Union did its utmost to use every chance to create an Anti-Hitler coalition. Despite – I will say it again – the double-dealing on the part of the Western countries. For instance, the intelligence services reported to the Soviet leadership detailed information on the behind-the-scenes contacts between Britain and Germany in the summer of 1939. The important thing is that those contacts were quite active and practically coincided with the tripartite negotiations between France, Great Britain and the USSR, which were, on the contrary, deliberately protracted by the Western partners. In this connection, I will cite a document from the British archives. It contains instructions to the British military mission that came to Moscow in August 1939. It directly states that the delegation was to proceed with negotiations very slowly, and that the Government of the United Kingdom was not ready to assume any obligations spelled out in detail and limiting their freedom of action under any circumstances. I will also note that, unlike the British and French delegations, the Soviet delegation was headed by top commanders of the Red Army, who had the necessary authority to “sign a military convention on the organisation of military defence of England, France and the USSR against aggression in Europe”. Poland played its role in the failure of those negotiations as it did not want any obligations owed to the Soviet side. Even under pressure from their Western allies, the Polish leadership rejected the idea of joint action with the Red Army to fight against the Wehrmacht. It was only when they learned of the arrival of J. Ribbentrop to Moscow that J. Beck reluctantly and not directly, but through French diplomats, notified the Soviet side: “… in the event of joint action against the German aggression, cooperation between Poland and the Soviet Union, subject to technical conditions which have to be agreed, is not out of the question.” At the same time, he explained to his colleagues: “… I agreed to this wording only for the sake of the tactics, and our core position in relation to the Soviet Union is final and remains unchanged.” In these circumstances, the Soviet Union signed the Non-Aggression Pact with Germany. [Ed’s note:alternative view here]. It was practically the last among the European countries to do so. Besides, it was done in the face of a real threat of war on two fronts – with Germany in the west and with Japan in the east, where intense fighting on the Khalkhin Gol River was already underway. Stalin and his entourage, indeed, deserve many legitimate accusations. We remember the crimes committed by the regime against its own people and the horror of mass repressions. In other words, there are many things the Soviet leaders can be reproached for, but poor understanding of the nature of external threats is not one of them. They saw how attempts were made to leave the Soviet Union alone to deal with Germany and its allies. Bearing in mind this real threat, they sought to buy precious time needed to strengthen the country’s defences. Nowadays, we hear lots of speculations and accusations against modern Russia in connection with the Non-Aggression Pact signed back then. Yes, Russia is the legal successor state to the USSR, and the Soviet period – with all its triumphs and tragedies – is an inalienable part of our thousand-year-long history. However, let me also remind you that the Soviet Union gave a legal and moral assessment of the so-called Molotov–Ribbentrop Pact. The Supreme Soviet in its resolution of December 24, 1989 officially denounced the secret protocols as “an act of personal power” which in no way reflected “the will of the Soviet people who bear no responsibility for this collusion”. [Ed’s note:alternative view here,here, andhere] Yet other states prefer to forget the agreements carrying signatures of the Nazis and Western politicians, not to mention giving legal or political assessments of such cooperation, including the silent acquiescence – or even direct abetment – of some European politicians in the barbarous plans of the Nazis. It will suffice to remember the cynical phrase said by Polish Ambassador to Germany J. Lipski during his conversation with Hitler on September 20, 1938: “… for solving the Jewish problem, we [the Poles]will build in his honour… a splendid monument in Warsaw.” Besides, we do not know if there were any secret “protocols” or annexes to agreements of a number of countries with the Nazis. The only thing that is left to do is to take their word for it. In particular, materials pertaining to the secret Anglo-German talks still have not been declassified. Therefore, we urge all states to step up the process of making their archives public and publishing previously unknown documents of the war and pre-war periods – the way Russia has been doing in recent years. In this context, we are ready for broad cooperation and joint research projects engaging historians. **Back in time** But let us go back to the events immediately preceding the Second World War. It was naïve to believe that Hitler, once done with Czechoslovakia, would not make new territorial claims. This time the claims involved its recent accomplice in the partition of Czechoslovakia – Poland. Here, the legacy of Versailles, particularly the fate of the so-called Danzig Corridor, was yet again used as the pretext. The blame for the tragedy that Poland then suffered lies entirely with the Polish leadership, which had impeded the formation of a military alliance between Britain, France and the Soviet Union and relied on the help from its Western partners, throwing its own people under the steamroller of Hitler’s machine of destruction. [Ed’s note:a wildly alternative view here!]. The German offensive was mounted in full accordance with the blitzkrieg doctrine. Despite the fierce, heroic resistance of the Polish army, on September 8, 1939 – only a week after the war broke out – the German troops were within reach of Warsaw. By September 17, the military and political leaders of Poland had fled to Romania, betraying their people, who continued to fight against the invaders. Poland’s hope for help from its Western allies was vain. After the war against Germany was declared, the French troops advanced only a few tens of kilometres into the German territory. All of it looked like a mere demonstration of vigorous action. Moreover, the Anglo-French Supreme War Council, holding its first meeting on September 12, 1939 in the French city of Abbeville, decided to call off the offensive altogether in view of the rapid developments in Poland. That was when the infamous Phony War started. What Britain and France did was a blatant betrayal of their obligations to Poland. Later, during the Nuremberg Trials, German generals explained their quick success in the East. Former Chief of the Operations Staff of the German Armed Forces High Command General Alfred Jodl admitted: “… we did not suffer defeat as early as 1939 only because about 110 French and British divisions stationed in the west against 23 German divisions during our war with Poland remained absolutely idle.” I asked for retrieval from the archives of the whole body of materials pertaining to the contacts between the USSR and Germany in the dramatic days of August and September 1939. According to the documents, paragraph 2 of the Secret Protocol to the German-Soviet Non-Aggression Pact of August 23, 1939 stated that, in the event of territorial-political reorganisation of the districts making up the Polish state, the border between the spheres of interest of the two countries would run “approximately along the Narew, Vistula and San rivers.” In other words, the Soviet sphere of influence included not only the territories that were mostly home to Ukrainian and Belorussian population, but also the historically Polish lands in the Vistula and Bug interfluve. This fact is known to very few these days. Similarly, very few know that, immediately after the attack on Poland, in the early days of September 1939, Berlin strongly and repeatedly called on Moscow to join the military action. However, the Soviet leadership ignored those calls and planned to avoid engaging in the dramatic developments as long as possible. It was only when it became absolutely clear that Great Britain and France were not going to help their ally and the Wehrmacht could swiftly occupy all of Poland (and thus appear on the approaches to Minsk) that the Soviet Union decided to act. [Ed’s note:alternative view here]. On the morning of September 17, Red Army units moved into the so-called Eastern Borderlines (Kresy), which nowadays form part of the territories of Belorussia, Ukraine and Lithuania. Obviously, there was no alternative. Otherwise, the USSR would face seriously increased risks because – I will say this again – the old Soviet-Polish border ran only within a few tens of kilometres of Minsk. The Soviet Union would have been forced to enter the inevitable war with the Nazis from very disadvantageous strategic positions, while millions of people of different nationalities, including the Jews living near Brest and Grodno, Przemyśl, Lvov and Wilno, would be left to die at the hands of the Nazis and their local accomplices – anti-Semites and radical nationalists. The fact that the Soviet Union sought to avoid engaging in the growing conflict for as long as possible and was unwilling to fight side-by-side with Germany was the reason why the real contact between the Soviet and the German troops occurred much farther east than the borders agreed in the secret protocol. [Ed’s note:Alternative view here] It was not on the Vistula River, but closer to the so-called Curzon Line, which back in 1919 was recommended by the Triple Entente as the eastern border of Poland. As is known, the subjunctive mood can hardly be used when we speak of the past events. I will only say that, in September 1939, the Soviet leadership had an opportunity to move the western borders of the USSR even farther west, all the way to Warsaw, but decided against it. **A new Europe** The Germans suggested formalising the new status quo. In Moscow, on September 28, 1939 J. Ribbentrop and V. Molotov signed the Boundary and Friendship Treaty between Germany and the Soviet Union, as well as the secret protocol on changing the state border, according to which the border was recognised at the demarcation line where the two armies de-facto stood. In autumn 1939, the Soviet Union, pursuing its strategic military and defensive goals, started the process of incorporation of Latvia, Lithuania and Estonia. Their accession to the USSR was implemented on a contractual basis, with the consent of the elected authorities. This was in line with international and state law of that time. [Ed’s note: The Baltic States, as they were known, were considered by the West at the time to be occupied by the USSR. The states themselves – Estonia, Latvia and Lithuania – gained independence from the USSR in 1991. They each still assert to this day that their countries were illegally occupied. An alternative view on this isavailable here. And alsohere.] Besides, in October 1939, the city of Wilno and the surrounding area, which had previously been part of Poland, were returned to Lithuania. The Baltic republics within the USSR preserved their government bodies, language, and had representation in the higher government entities of the Soviet Union. [Ed’s note: an alternative viewhere.] During all these months there was an ongoing invisible diplomatic and politico-military struggle and intelligence work. Moscow understood that it was facing a fierce and cruel enemy, and that a covert war against Nazism was already going on. And there was no reason to take official statements and formal protocol notes of that time as a proof of ‘friendship’ between the USSR and Germany. The Soviet Union had active trade and technical contacts not only with Germany, but with other countries as well. Whereas Hitler tried again and again to draw the Soviet Union into Germany’s confrontation with the UK. But the Soviet government stood firm. **Hitler tries again** The last attempt to persuade the USSR to act together was made by Hitler during Molotov’s visit to Berlin in November 1940. But Molotov accurately followed Stalin’s instructions and limited himself to a general discussion of the German idea of the Soviet Union joining the Tripartite Pact signed by Germany, Italy and Japan in September 1940, and directed against the UK and the USA. No wonder that already on November 17 Molotov gave the following instructions to the London-based Soviet diplomat Ivan Maisky: “For your information… No agreement was signed or was intended to be signed in Berlin. We just exchanged our views in Berlin… and that was all… Apparently, the Germans and the Japanese seem anxious to push us towards the Gulf and India. We declined the discussion of this matter as we consider such advice on the part of Germany to be inappropriate.” On November 25, the Soviet leadership called it a day altogether by officially putting forward to Berlin conditions that were unacceptable to the Nazis, including the withdrawal of German troops from Finland, a mutual assistance treaty between Bulgaria and the USSR, and a number of others. Thus it deliberately excluded any possibility of joining the Pact. Such position definitely shaped the Fuehrer’s intention to unleash a war against the USSR. In December, putting aside the warnings of his strategists about the disastrous danger of having a two-front war, Hitler approved Operation Barbarossa. He did this with the knowledge that the Soviet Union was the major force that opposed him in Europe and that the upcoming battle in the East would decide the outcome of the world war. And he had no doubts as to the swiftness and success of the Moscow campaign. Here I would like to highlight the following: Western countries, as a matter of fact, agreed at that time with the Soviet actions and recognised the Soviet Union’s intention to ensure its national security. Indeed, back on October 1, 1939 Winston Churchill, the First Lord of the Admiralty back then, in his speech on the radio said, “Russia has pursued a cold policy of self-interest… But that the Russian Armies should stand on this line [meaning the new Western border]was clearly necessary for the safety of Russia against the Nazi menace.” On October 4, 1939, speaking in the House of Lords, Britain’s Foreign Secretary Lord Halifax said, “… it should be recalled that the Soviet government’s actions were to move the border essentially to the line recommended at the Versailles Conference by Lord Curzon… I only cite historical facts and believe they are indisputable.” Prominent British politician and statesman David Lloyd George emphasised, “The Russian Armies occupied the territories that are not Polish and that were forcibly seized by Poland after World War I…. It would be an act of criminal insanity to put the Russian advancement on a par with the German one.” In informal communications with Soviet diplomat Ivan Maisky, British high-ranking politicians and diplomats spoke even more openly. On October 17, 1939, Under-Secretary of State for Foreign Affairs R. A. Butler confided to him that the British government circles believed there could be no question of returning Western Ukraine and Belorussia to Poland. According to him, if it had been possible to create an ethnographic Poland of a modest size with a guarantee not only of the USSR and Germany, but also of Britain and France, the British government would have considered itself quite satisfied. On October 27, 1939, Neville Chamberlain’s senior advisor Horace Wilson said that Poland had to be restored as an independent state on its ethnographic basis, but without Western Ukraine and Belorussia. It is worth noting that in the course of these conversations the possibilities for improving British-Soviet relations were also explored. These contacts to a large extent laid the foundation for a future alliance and Anti-Hitler coalition. Winston Churchill stood out among responsible and far-sighted politicians and, despite his infamous dislike for the USSR, had been in favour of cooperating with the Soviets even before. Back in May 1939, he said in the House of Commons, “We shall be in mortal danger if we fail to create a Grand Alliance against aggression. The worst folly… would be to… drive away any natural cooperation with Soviet Russia…” After the start of hostilities in Europe, at his meeting with Ivan Maisky on October 6, 1939 Churchill confided that there were no serious contradictions between the UK and the USSR and, therefore, there was no reason for strained or unsatisfactory relations. He also mentioned that the British government was eager to develop trade relations and willing to discuss any other measures that might improve the relationship. World War II did not happen overnight, nor did it start unexpectedly or all of a sudden. And German aggression against Poland was not out of nowhere. It was the result of a number of tendencies and factors in world politics of that time. All pre-war events fell into place to form one fatal chain. But, undoubtedly, the main factors that predetermined the greatest tragedy in the history of mankind were state egoism, cowardice, appeasement of the aggressor who was gaining strength, and unwillingness of political elites to search for compromise. Therefore, it is unfair to claim that the two-day visit to Moscow of Nazi Foreign Minister J. Ribbentrop was the main reason for the start of World War II. [Ed’s note:Alternative view here]. All the leading countries are to a certain extent responsible for its outbreak. Each of them made fatal mistakes, arrogantly believing that they could outsmart others, secure unilateral advantages for themselves or stay away from the impending global catastrophe. And this short-sightedness, the refusal to create a collective security system, came at a tremendous cost, including the loss of millions of lives. **Let’s not do that again** Saying this, I by no means intend to take on the role of a judge, to accuse or acquit anyone, let alone initiate a new round of international information confrontation in the historical field that could set countries and peoples at loggerheads. I believe that it is academics with a wide representation of respected scholars from different countries of the world who should search for a balanced assessment of what happened. We all need the truth and objectivity. For my part, I have always encouraged my colleagues to build a calm, open and trust-based dialogue, to look at the common past in a self-critical and unbiased manner. [Ed’s note:Alternative view here]. Such an approach will make it possible not to repeat the mistakes committed back then and to ensure peaceful and successful development for years to come. However, many of our partners are not yet ready for joint work. On the contrary, pursuing their goals, they increase the number and the scope of information attacks against our country, trying to make us provide excuses and feel guilty. They adopt thoroughly hypocritical and politically motivated declarations. Thus, for example, the resolution on the Importance of European Remembrance for the Future of Europe approved by the European Parliament on September 19, 2019 directly accused the USSR – along with the Nazi Germany – of unleashing the Second World War. Needless to say, there is no mention of Munich in it whatsoever. [Ed’s note:Alternative view here]. I believe that such ‘paperwork’ – for I cannot call this resolution a document – which is clearly intended to provoke a scandal, is fraught with real and dangerous threats. Indeed, it was adopted by a highly respectable institution. And what did it show? Regrettably, it revealed a deliberate policy aimed at destroying the post-war world order whose creation was a matter of honour and responsibility for the countries, a number of representatives of which voted today in favour of this deceitful resolution. Thus, they challenged the conclusions of the Nuremberg Tribunal and the efforts of the international community after the victorious 1945 universal international institutions. Let me remind you in this regard that the process of European integration itself, leading to the establishment of relevant structures, including the European Parliament, became possible only due to the lessons learnt form the past and its accurate legal and political assessment. Those who deliberately put this consensus into question undermine the foundations of the entire post-war Europe. **A matter of principle** Apart from posing a threat to the fundamental principles of the world order, this also raises certain moral and ethical issues. Desecrating and insulting the memory is mean. Meanness can be hypocritical and pretty much intentional, like when declarations commemorating the 75th anniversary of the end of World War II mention all participants in the Anti-Hitler coalition except for the Soviet Union. Meanness can also be cowardly, like when monuments erected in honour of those who fought against Nazism are demolished and these shameful acts are justified by the false slogans of the fight against an unwelcome ideology and alleged occupation. Meanness can also be bloody, like when those who come out against neo-Nazis and Bandera’s successors are killed and burned. Meanness can have different manifestations, but this does not make it less disgusting. Neglecting the lessons of history inevitably leads to a harsh payback. Russia will firmly uphold the truth based on documented historical facts. We will continue to be honest and impartial about the events of World War II. This includes a broad-scale project to establish Russia’s largest collection of archival records, film and photo materials about the history of World War II and the pre-war period. Such work is already underway. Many new, recently discovered or declassified materials were also used in the preparation of this article. In this connection, I can state with all responsibility that there are no archive documents that would confirm the assumption that the USSR intended to start a preventive war against Germany. Indeed, the Soviet military leadership followed a doctrine according to which, in the event of aggression, the Red Army would promptly confront the enemy, go on the offensive and wage war on enemy territory. However, such strategic plans did not imply any intention to attack Germany first. Of course, military planning documents – letters of instruction of Soviet and German headquarters – are now available to historians. Finally, we know the true course of events. From the perspective of this knowledge, many argue about the actions, mistakes and misjudgement of the country’s military and political leadership. In this regard, I will say one thing: along with a huge flow of misinformation of various kinds, Soviet leaders also received true information about the upcoming Nazi aggression. And in the pre-war months, they took steps to improve the combat readiness of the country, including the secret recruitment for military training of some of those liable for military duty, and the redeployment of units and reserves from internal military districts to western borders. **Germany attacks** The war did not come as a surprise, people were expecting it, preparing for it. But the Nazi attack was truly unprecedented in terms of its destructive power. On June 22, 1941, the Soviet Union faced the strongest, most mobilised and skilled army in the world with the industrial, economic and military potential of almost all of Europe working for it. Not only the Wehrmacht, but also Germany’s satellites, military contingents of many other states of the European continent, took part in this deadly invasion. The most serious military defeats in 1941 brought our country to the brink of catastrophe. Combat power and control had to be restored by extreme means, nation-wide mobilisation and intensification of all efforts of the state and the people. In the summer of 1941, millions of citizens, hundreds of factories and industries began to be evacuated under enemy fire to the east of the country. The manufacture of weapons and munition, that had started to be supplied to the front already in the first military winter, was launched behind the lines in the shortest possible time. By 1943, the rates of military production of Germany and its allies were exceeded. Within 18 months, the Soviet people did something that seemed impossible, both on the front lines and the home front. It is still hard to realise, understand and imagine what incredible effort, courage and dedication these greatest achievements were worth. The tremendous power of Soviet society, united by the desire to protect their native land, rose against the powerful, armed to the teeth, cold-blooded Nazi invading machine. It stood up to take revenge on the enemy, who had broken and trampled peaceful life, and people’s plans and hopes. Of course, fear, confusion and desperation were taking over some people during this terrible and bloody war. There was betrayal and desertion. The harsh splits caused by the revolution and the Civil War, nihilism, mockery of national history, traditions and faith that the Bolsheviks tried to impose, especially in the first years after coming to power – all of this had its impact. But the general attitude of the Soviet citizens and our compatriots who found themselves abroad was different – to save and protect the Motherland. It was a real and irrepressible impulse. People were looking for support in true patriotic values. The Nazi ‘strategists’ were convinced that a huge multinational state could easily be brought to heel. They thought that the sudden outbreak of the war, with all its mercilessness and unbearable hardships, would inevitably exacerbate inter-ethnic relations, and the country could be split into pieces. Hitler clearly stated: “Our policy towards the peoples living in the vastness of Russia should be to promote any form of disagreement and split.” But from the very first days, it was clear that the Nazi plan would fail. The Brest Fortress was protected to the last drop of blood by its defenders representing more than 30 ethnicities. Throughout the war – both in large-scale decisive battles and in the protection of every foothold, every metre of native land – we see examples of such unity. The Volga region and the Urals, Siberia and the Far East, the republics of Central Asia and Transcaucasia became home to millions of evacuees. Their residents shared everything they had and provided all the support they could. Friendship of peoples and mutual help became a real indestructible fortress for the enemy. The Soviet Union and the Red Army, no matter what anyone is trying to prove today, made the main and crucial contribution to the defeat of Nazism. These were heroes who fought to the end surrounded by the enemy at Bialystok and Mogilev, Uman and Kiev, Vyazma and Kharkov. They launched attacks near Moscow and Stalingrad, Sevastopol and Odessa, Kursk and Smolensk. They liberated Warsaw, Belgrade, Vienna and Prague. They stormed Koenigsberg and Berlin. We contend for genuine, unvarnished or whitewashed truth about war. This national, human truth, which is hard, bitter and merciless, has been handed down to us by writers and poets who walked through fire and hell of front trials. For my generation, as well as for many others, their honest and deep stories, novels, piercing trench prose and poems have left their mark on the soul forever. Honouring veterans who did everything they could for the Victory and remembering those who died on the battlefield has become our moral duty. And today, simple and great in their essence, are the lines of Alexander Tvardovsky’s poem ‘I was killed near Rzhev…’, dedicated to the participants of the bloody and brutal battle of the Great Patriotic War in the centre of the Soviet-German front line. In the battles for Rzhev and the Rzhev Salient alone, from October 1941 to March 1943, the Red Army lost 1,342,888 people, including wounded and missing in action. For the first time, I call out these terrible, tragic and far from complete figures collected from archive sources. I do it to honour the memory of known and nameless heroes, whose feats were barely mentioned, or not at all in the post-war years. **Paying their dues** Let me cite another document. This is a report of February 1945 on reparation from Germany by the Allied Commission on Reparations headed by Ivan Maisky. The Commission’s task was to define a formula according to which a defeated Germany would have to pay for the damages sustained by the victor powers. The Commission concluded that “the number of soldier-days spent by Germany on the Soviet front is at least 10 times higher than on all other allied fronts. The Soviet front also had to handle four-fifths of German tanks and about two-thirds of German aircraft.” On the whole, the USSR accounted for about 75 percent of all military efforts undertaken by the Anti-Hitler Coalition. During the war period, the Red Army “ground up” 626 divisions of the Axis states, of which 508 were German. On April 28, 1942, Franklin D. Roosevelt said in his address to the American nation: “These Russian forces have destroyed and are destroying more armed power of our enemies – troops, planes, tanks, and guns – than all the other United Nations put together.” Winston Churchill in his message to Joseph Stalin of September 27, 1944, wrote that “it is the Russian army that tore the guts out of the German military machine….” Such an assessment has resonated throughout the world, because these words are the great truth, which no-one doubted then. Almost 27 million Soviet citizens lost their lives on the fronts or in German prisons, or were starved to death, bombed, died in ghettos and the furnaces of the Nazi death camps. The USSR lost one in seven of its citizens, the UK lost one in 127, and the USA lost one in 320. Unfortunately, this figure of the Soviet Union’s hardest and grievous losses is not exhaustive. The painstaking work should be continued to restore the names and fates of all who have perished – Red Army soldiers, partisans, underground fighters, prisoners of war and concentration camps, and civilians killed by the death squads. It is our duty. And a special role here belongs to members of the search movement, military-patriotic and volunteer associations, projects like the electronic database‘Pamyat Naroda’(Memory of the People), which contains archival documents. And, surely, close international cooperation is needed in such a common humanitarian task. The efforts of all countries and peoples who fought against a common enemy resulted in victory. The British army protected its homeland from invasion, fought the Nazis and their satellites in the Mediterranean and North Africa. American and British troops liberated Italy and opened the Second Front. The US dealt powerful and crushing strikes against the aggressor in the Pacific Ocean. We remember the tremendous sacrifices made by the Chinese people and their great role in defeating Japanese militarists. Let us not forget the fighters of France, who did not fall for the shameful capitulation and continued to resist the Nazis. We will also always be grateful for the assistance rendered by the Allies in providing the Red Army with munition, raw materials, food and equipment. And that help was significant – about 7 percent of the total military production of the Soviet Union. The core of the Anti-Hitler Coalition began to take shape immediately after the attack on the Soviet Union, where the United States and Britain unconditionally supported it in the fight against Hitler’s Germany. At the Tehran Conference in 1943, Stalin, Roosevelt and Churchill formed an alliance of great powers and agreed to elaborate coalition diplomacy and a joint strategy in the fight against a common deadly threat. The leaders of the Big Three had a clear understanding that the unification of industrial, resource and military capabilities of the USSR, the United States and the UK would give unchallenged supremacy over the enemy. The Soviet Union fulfilled its obligations to its allies and always offered a helping hand. Thus, the Red Army supported the landing of the Anglo-American troops in Normandy by carrying out the large-scale Operation Bagration in Belorussia. In January 1945, having broken through to the Oder River, our soldiers put an end to the last powerful offensive of the Wehrmacht on the Western Front in the Ardennes. Three months after the victory over Germany, the USSR, in full accordance with the Yalta agreements, declared war on Japan and defeated the million-strong Kwantung Army. Back in July 1941, the Soviet leadership declared that “the purpose of the war against fascist oppressors was not only the elimination of the threat looming over our country, but also help for all the peoples of Europe suffering under the yoke of German fascism.” By mid-1944, the enemy was expelled from virtually all of the Soviet territory. However, the enemy had to be finished off in its lair. And so the Red Army started its liberation mission in Europe. It saved entire nations from destruction and enslavement, and from the horror of the Holocaust. They were saved at the cost of hundreds of thousands of lives of Soviet soldiers. After the Great Victory It is also important not to forget about the enormous material assistance that the USSR provided to the liberated countries in eliminating the threat of hunger and in rebuilding their economies and infrastructure. This was done at a time when ashes stretched for thousands of miles, all the way from Brest to Moscow and the Volga. For instance, in May 1945, the Austrian government asked the USSR to provide assistance with food, as it “had no idea how to feed its population in the next seven weeks before the new harvest.” State Chancellor of the Provisional Government of the Austrian Republic, Karl Renner described the consent of the Soviet leadership to send food as a saving act that the Austrians would never forget. The Allies jointly established the International Military Tribunal to punish Nazi political and war criminals. Its decisions contained a clear legal qualification of crimes against humanity, such as genocide, ethnic and religious cleansing, anti-Semitism and xenophobia. Directly and unambiguously, the Nuremberg Tribunal also condemned the accomplices of the Nazis, collaborators of various kinds. This shameful phenomenon manifested itself in all European countries. Such figures as Pétain, Quisling, Vlasov, Bandera, their henchmen and followers – though they were disguised as fighters for national independence or freedom from communism – are traitors and butchers. In terms of inhumanity, they often exceeded their masters. In their desire to serve, as part of special punitive groups they willingly executed the most inhumane orders. They were responsible for such bloody events as the shootings of Babi Yar, the Volhynia massacre, burnt Khatyn, acts of destruction of Jews in Lithuania and Latvia. Today as well, our position remains unchanged – there can be no excuse for the criminal acts of Nazi collaborators, there is no period of limitations for them. It is therefore bewildering that in certain countries, those who are smirched with cooperation with the Nazis are suddenly equated with World War II veterans. I believe that it is unacceptable to equate liberators with occupants. And I can only regard the glorification of Nazi collaborators as a betrayal of the memory of our fathers and grandfathers. A betrayal of the ideals that united peoples in the fight against Nazism. At that time, the leaders of the USSR, the United States, and the UK faced, without exaggeration, a historic task. Stalin, Roosevelt and Churchill represented countries with different ideologies, state aspirations, interests and cultures. But they demonstrated great political will, and rose above the contradictions and preferences to put the true interests of peace at the forefront. As a result, they were able to come to an agreement and achieve a solution from which all of humanity has benefited. **The road ahead** The victor powers left us a system that has become the quintessence of the intellectual and political quest of several centuries. A series of conferences – Tehran, Yalta, San Francisco and Potsdam – laid the foundation for a world that, for 75 years, had no global war, despite the sharpest contradictions. Historical revisionism, the manifestations of which we now observe in the West primarily with regard to the subject of the Second World War and its outcome, is dangerous because it grossly and cynically distorts the understanding of the principles of peaceful development, laid down at the Yalta and San Francisco conferences in 1945. The major historic achievement of Yalta and other decisions of that time is the agreement to create a mechanism that would allow the leading powers to remain within the framework of diplomacy in resolving their differences. The 20thcentury brought large-scale and comprehensive global conflicts, and in 1945, nuclear weapons capable of physically destroying the Earth also entered the scene. In other words, the settlement of disputes by force has become prohibitively dangerous. And the victors in the Second World War understood that. They understood and were aware of their own responsibility towards humanity. The cautionary tale of the League of Nations was taken into account in 1945. The structure of the UN Security Council was developed in a way to make peace guarantees as concrete and effective as possible. That is how the institution of the permanent members of the Security Council and the right of the veto as their privilege and responsibility came into being. What is the power of veto in the UN Security Council? To put it bluntly, it is the only reasonable alternative to a direct confrontation between major countries. It is a statement by one of the five powers that a decision is unacceptable to it, and is contrary to its interests and its ideas about the right approach. Other countries, even if they do not agree, take this position as a given, abandoning any attempts to realise their unilateral efforts. It means that in one way or another it is necessary to seek compromise. A new global confrontation started almost immediately after the end of the Second World War and was at times very fierce. The fact that the Cold War did not grow into the Third World War has become a clear testimony of the effectiveness of the agreements concluded by the Big Three. The rules of conduct agreed upon during the creation of the United Nations made it possible to further minimise risks and keep confrontation under control. Of course, we can see that the UN system currently experiences certain tensions in its work, and is not as effective as it could be. But the UN still performs its primary function. The principles of the UN Security Council are a unique mechanism for preventing a major war or a global conflict. The calls that have been made quite often in recent years to abolish the power of veto, to deny special opportunities to permanent members of the Security Council are irresponsible. After all, if that happens, the United Nations would in essence become the League of Nations – a meeting for empty talk without any leverage on the world processes. How the League of Nations ended is well known. That is why the victor powers approached the formation of the new system of the world order with utmost seriousness, seeking to avoid the repetition of mistakes made by their predecessors. The creation of the modern system of international relations is one of the major outcomes of World War II. Even the most insurmountable contradictions – geopolitical, ideological, economic – do not prevent us from finding forms of peaceful coexistence and interaction, if there is the desire and will to do so. Today the world is going through quite a turbulent time. Everything is changing, from the global balance of power and influence to the social, economic and technological foundations of societies, nations and even continents. In the past epochs, shifts of such magnitude have almost never happened without major military conflicts. Without a power struggle to build a new global hierarchy. Thanks to the wisdom and farsightedness of the political figures of the Allied Powers, it was possible to create a system that has been restrained from extreme manifestations of such competition, something which is historically inherent in world development. It is a duty of ours – all those who take political responsibility and primarily representatives of the victor powers in the Second World War – to guarantee that this system is maintained and improved. Today, as in 1945, it is important to demonstrate political will and discuss the future together. Our colleagues – Mr Xi Jinping, Mr Macron, Mr Trump and Mr Johnson – supported the Russian initiative to hold a meeting of the leaders of the five nuclear-weapon states, permanent members of the Security Council. We thank them for this and hope that such face-to-face meetings could take place as soon as possible. **The final vision** What is our vision of the agenda for the upcoming summit? First of all, in our opinion, it would be useful to discuss steps to develop collective principles in world affairs. To speak frankly about the issues of preserving peace, strengthening global and regional security, strategic arms control, about joint efforts in countering terrorism, extremism and other major challenges and threats. A special item on the agenda of the meeting is the situation in the global economy. And above all, overcoming the economic crisis caused by the coronavirus pandemic. Our countries are taking unprecedented measures to protect the health and lives of people and to support citizens who have found themselves in difficult living situations. Our ability to work together and in concert, as real partners, will determine how severe the impact of the pandemic will be, and how quickly the global economy will emerge from the recession. Moreover, it is unacceptable to turn the economy into an instrument of pressure and confrontation. Popular issues include environmental protection and combating climate change, as well as ensuring the security of the global information space. The agenda proposed by Russia for the upcoming summit of the Five is extremely important and relevant, both for our countries and for the entire world. And we have specific ideas and initiatives on all the items. There can be no doubt that the summit of Russia, China, France, the United States, and the UK will play an important role in finding common answers to modern challenges and threats, and will demonstrate a common commitment to the spirit of alliance, to those high humanist ideals and values for which our fathers and grandfathers fought shoulder to shoulder. Drawing on a shared historical memory, wecantrust each other andmustdo so. That will serve as a solid basis for successful negotiations and concerted action for the sake of enhancing the stability and security on the planet, for the sake of prosperity and well-being of all states. Without exaggeration, it is our common duty and responsibility towards the entire world, towards the present and future generations. **Donate To New Matilda** New Matilda is a small, independent media outlet. We survive through reader contributions, and never losing a lawsuit. If you got something from this article, giving something back helps us to continue speaking truth to power. Every little bit counts. Vladimir Putin is the president of the Russian Federation. His article was submitted to New Matilda for publication by the Russian Embassy in Canberra. **Related Stories** An Inconceivable Truth: If You’re Anti-Genocide Then Voting For Kamala Harris Looks Almost Impossible **An Inconceivable Truth: If You’re Anti-Genocide Then Voting For Kamala Harris Looks Almost Impossible** **An Inconceivable Truth: If You’re Anti-Genocide Then Voting For Kamala Harris Looks Almost Impossible** Is The Left Reading The Wrong Room? **Is The Left Reading The Wrong Room?** **Is The Left Reading The Wrong Room?** Sky’s The Limit When You Need To Blame The Deaths Of 72 People On Greens **Sky’s The Limit When You Need To Blame The Deaths Of 72 People On Greens** **Sky’s The Limit When You Need To Blame The Deaths Of 72 People On Greens** Search New MatildaSearch for: This ad has kindly been donated by ananonymous subscriber. Subscribe to Our NewsletterPlease leave this field emptyFREE: Get stories and breaking news alerts as they happen, plus our regular newsletter for the latest news and major investigations.Email Address*Check your inbox or spam folder to confirm your subscription. FREE: Get stories and breaking news alerts as they happen, plus our regular newsletter for the latest news and major investigations. Check your inbox or spam folder to confirm your subscription. FREE: Get stories and breaking news alerts as they happen, plus our regular newsletter for the latest news and major investigations. Check your inbox or spam folder to confirm your subscription. This ad has kindly been donated by ananonymous subscriber. LoginUsernamePasswordRemember MeLost Password Username Password Remember Me Lost Password Username Password Remember Me Lost Password Your Shopping Basket Recent PostsABC’s New Series ‘Eat The Invaders’ Gets 4.5 Stars… And I Haven’t Even Watched It YetBREAKING NEWS: Trump Appoints Look-Alike Cousin To Fill Attorney General Role Vacated By Sex Pest Matt GaetzAn Inconceivable Truth: If You’re Anti-Genocide Then Voting For Kamala Harris Looks Almost ImpossibleEverything’s Perfect NowThe Polls Have Barely Opened, And Already Trump Has Raised The Spectre of A ‘Stolen Election’… Unless He Wins, Of Course ABC’s New Series ‘Eat The Invaders’ Gets 4.5 Stars… And I Haven’t Even Watched It Yet BREAKING NEWS: Trump Appoints Look-Alike Cousin To Fill Attorney General Role Vacated By Sex Pest Matt Gaetz An Inconceivable Truth: If You’re Anti-Genocide Then Voting For Kamala Harris Looks Almost Impossible Everything’s Perfect Now The Polls Have Barely Opened, And Already Trump Has Raised The Spectre of A ‘Stolen Election’… Unless He Wins, Of Course ABC’s New Series ‘Eat The Invaders’ Gets 4.5 Stars… And I Haven’t Even Watched It Yet BREAKING NEWS: Trump Appoints Look-Alike Cousin To Fill Attorney General Role Vacated By Sex Pest Matt Gaetz An Inconceivable Truth: If You’re Anti-Genocide Then Voting For Kamala Harris Looks Almost Impossible Everything’s Perfect Now The Polls Have Barely Opened, And Already Trump Has Raised The Spectre of A ‘Stolen Election’… Unless He Wins, Of Course Contact UsAbout UsAdvertising PolicyFrequently Asked QuestionsWriting for New MatildaPrivacy PolicyTerms And Conditions Of Use Contact Us About Us Advertising Policy Frequently Asked Questions Writing for New Matilda Privacy Policy Terms And Conditions Of Use Contact Us About Us Advertising Policy Frequently Asked Questions Writing for New Matilda Privacy Policy Terms And Conditions Of Use Contact Us About Us Advertising Policy Frequently Asked Questions Writing for New Matilda Privacy Policy Terms And Conditions Of Use"}