{"id": 1267, "name": "Slate", "domain": "slate.com", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://slate.com/podcasts/culture-gabfest/2025/06/pee-wee-as-himself-offers-a-complex-portrait-of-paul-reubens-the-man-behind-the-character", "title": "Pee Wee As Himself Offers A Complex Portrait Of Paul Reubens The Man Behind The Character", "content": "Slate Shop Games Newsletters Sign In AccountActivating this button will toggle the display of additional contentAccountSign out News & Politics Culture Technology Business Life Advice Podcasts **Culture Gabfest** **Pee Wee’s Big Documentary Edition** This week, the panel considers the two-part documentaryPee-wee As Himself, the Owen Wilson golf comedyStick, and is joined by journalist Caity Weaver to discuss her recent Mark Twain-inspired travelogue to Paris. **Listen & Subscribe** Choose your preferred player: Apple Podcasts Spotify Amazon Music TuneIn RSS Feed For questions about subscriptions or your Slate Plus feed,check our FAQ. Please enable javascript to get your Slate Plus feeds. **Get Your Slate Plus Podcast** If you can't access your feeds, please contact customer support. Thanks! Check your phone for a link to finish setting up your feed. Please enter a valid phone number. Listen on your phone:RECOMMENDED Enter your phone number and we'll text you a link to set up the podcast in your app: We'll only text you about setting up this podcast, no spam. Listen on your computer: Apple Podcasts will only work on MacOS operating systems sinceCatalina. We do not support Android apps on desktop at this time. Listen on your device:RECOMMENDED These links will only work if you're on the device you listen to podcasts on. Set up manually: How does this work? We are showing you options for a computer but if you're on a phone or tabletWe are showing you options for a phone or a tablet but if you're on a computer,click here.If you still have questions about subscriptions or your Slate Plus Feed,check our FAQ. Loading... We're sorry, but something went wrong while fetching your podcast feeds. Please contact us atplus@slate.comfor help. **Episode Notes** On this week’s show, the secret word is: Pee-wee. Dana, Steve, and Julia discuss the new documentaryPee-wee as Himself.The fascinating two-part film, directed by Matt Wolf, attempts to reveal the complex man Paul Reubens behind the beloved, surprisingly subversive, goofball that was Pee-wee Herman. Next, they tee off to talk aboutStick, the new comedy series starring Owen Wilson set in the world of professional golf. In the third segment, they’re joined byAtlanticstaff writer Caity Weaver to chat about her recently published, rollicking travel pieceAn Innocent Abroad in Mark Twain’s Paris. In an exclusive Slate Plus segment, inspired by a listener question, the hosts each share their dream city they’d love to live in but have only ever visited. Endorsements: Steve:Sly Lives!the Questlove-directed documentary about the hugely influential pop star Sly Stone who recently passed away. Julia: Season 2 ofPoker Faceand its smorgasbord of incredible guest appearances by beloved character actors. Dana: The delightfully designed single-purpose websiteOracle of Bacon. **This Content is Available for Slate Plus members onlyBonus Episode** **Bonus: Imagining Life in Another City** The hosts take on a listener question about what city they’ve never lived in but could imagine happily resettling. **Bonus: Imagining Life in Another City** The hosts take on a listener question about what city they’ve never lived in but could imagine happily resettling. Comedy Movies Video Games **About the Show** New York Times critic Dwight Garner says, “The Slate Culture Gabfest is one of the highlights of my week.” The award-winning Culturefest features Slate culture critics Stephen Metcalf, Dana Stevens, and Julia Turner debating the week in culture, from highbrow to pop. **Hosts** Dana Stevensis Slate’s movie critic. Dana Stevensis Slate’s movie critic. Dana Stevensis Slate’s movie critic. Julia Turner, former editor in chief of Slate, is a senior fellow at theUSC Annenberg Center on Communication Leadership and Policyand a regular on Slate’sCulture Gabfest podcast. Julia Turner, former editor in chief of Slate, is a senior fellow at theUSC Annenberg Center on Communication Leadership and Policyand a regular on Slate’sCulture Gabfest podcast. Julia Turner, former editor in chief of Slate, is a senior fellow at theUSC Annenberg Center on Communication Leadership and Policyand a regular on Slate’sCulture Gabfest podcast. Stephen Metcalfis Slate’s critic at large. He is working on a book about the 1980s. Stephen Metcalfis Slate’s critic at large. He is working on a book about the 1980s. Stephen Metcalfis Slate’s critic at large. He is working on a book about the 1980s. About Us Work With Us Contact Pitch Guidelines Send Us Tips Corrections Commenting Reprints Subscribe Group Subscriptions Sign In Account Subscription FAQs Podcast FAQs Newsletters Customer Support AdChoices Cookie Preferences Slate is published by The Slate Group, a Graham Holdings Company. User Agreement Privacy Policy All contents © 2025 The Slate Group LLC. All rights reserved."}