{"id": 2128, "name": "American Spectator", "domain": "spectator.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://spectator.org/the-spectacle-ep-225-unraveling-the-democrats-deception-bidens-prostate-cancer/", "title": "The Spectacle Ep 225 Unraveling The Democrats Deception Bidens Prostate Cancer", "content": "About Authors Contact Submissions Foundation Magazine Donate About Authors Contact Submissions Foundation Magazine Donate **The SpectacleEp. 225: Unraveling the Democrats’ Deception: Biden’s Prostate CancerWhy are we only finding out about this now?** Former President Joe Biden’s prostate cancer diagnosis opens up further criticism of the liberal media, the Biden administration, and leftist politicians for being complicit in covering up his health. Jake Tapper is dead. Megyn Kelly just put like ten bullets into him in a row. Well done:pic.twitter.com/89C5N5igDt — Clay Travis (@ClayTravis)May 20, 2025 Join hosts Melissa Mackenzie and Scott McKay on this episode ofThe Spectacle Podcastas they discuss the recent revelation of Biden’s declining health. They also expand on the corruption within the Democratic Party, calling out figures like Barack Obama and Jill Biden for their role in ruining America. Melissa and Scott also explain how the weakened Left provides various advantages and opportunities for the Republican Party.(READ MORE:The Cancerous Lies of the Corporate Joe Biden) Tune in to hear their discussion! Listen toThe Spectaclewith Melissa Mackenzie and Scott McKay onSpotify.WatchThe Spectaclewith Melissa Mackenzie and Scott McKay onRumble. Last week, the U.S. Supreme Court ruled in favor of...Read More There are few phrases in modern capitalist theology more sacred...Read More As Administrator of the Environmental Protection Agency (EPA), Lee Zeldin’s...Read More It’s bad enough that Democrats like Senator Chris Van Hollen of Maryland, Congresswoman...Read More The thoughts herein have been inspired by my Governor Gruesome...Read More About Authors Contact Submissions Foundation Terms of Service Cookie Policy Privacy Policy Email (required)* First Name Last Name Example: Yes, I would like to receive emails from The American Spectator | USA News and Politics. (You can unsubscribe anytime) **Be a Free Market Loving Patriot. Subscribe Today!**"}