{"id": 572, "name": "Frontiers in Health Services", "domain": "frontiersin.org/journals/health-services", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/health-services/articles/10.3389/frhs.2025.1420698/full", "title": "Health Services", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Cost and Resource Allocation Health Policy and Management Health Workforce Implementation Science Mental Health Services Patient Centered Health Systems Patient Safety Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Cost and Resource Allocation Health Policy and Management Health Workforce Implementation Science Mental Health Services Patient Centered Health Systems Patient Safety Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Cost and Resource Allocation Health Policy and Management Health Workforce Implementation Science Mental Health Services Patient Centered Health Systems Patient Safety Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office BRIEF RESEARCH REPORT article Front. Health Serv., 11 June 2025 Sec. Patient Centered Health Systems Volume 5 - 2025 |https://doi.org/10.3389/frhs.2025.1420698 **Patient experience during medical visits in predominately African American rural communities in Alabama** 1Capstone College of Nursing, University of Alabama, Tuscaloosa, AL, United States 2Department of Population Health, College of Community Health Sciences, University of Alabama, Tuscaloosa, AL, United States 3School of Architecture, Carnegie Mellon University, Pittsburgh, PA, United States 4Department of Psychology, Alabama Life Research Institute, University of Alabama, Tuscaloosa, AL, United States Patient experience, specifically, shared decision making, has been demonstrated to significantly affect patient outcomes. The current study examined the clinician-patient communication (CPC) experiences of residents in predominately rural African American communities in Alabama. The 255 participants completed a survey designed to assess aspects of patient experience at their last clinical visit. A third of participants reported not being satisfied with their most recent clinical visit; a majority (55.7%) of participants reported their clinician did not ask their opinion. Participants over age 65 reported greater patient satisfaction and respect compared to younger participants aged 18–45 years. Trending gender effects showed that females reported being listened to more and were more likely to report being treated with respect than male participants. The results of the study show that the clinician-patient experience in rural predominately African American communities represents an opportunity to improve health care outcomes and minimize racial disparities. **Introduction** Alabama has historically ranked near the bottom in most health metrics. For example, the 2022America's Health Rankingsby the United Health Foundation placed Alabama 46th in overall health and 47th in health outcomes (1). These poor rankings are compounded by significant racial disparities. Alabama's diabetes rate stands at 15.1%, compared to the national average of 10.9%, and African American adults in the state face an even higher rate of 18.9% (2). Similarly, hypertension affects 42.7% of Alabamians—10 percentage points above the national average of 32.4%—with African American residents experiencing a rate of 48.4% (3). Additionally, Alabama has the second-highest stroke mortality rate in the U.S. (4). These disparities contribute to increased rates of physical disability and premature death. Multiple structural and interpersonal barriers fuel these disparities, especially in rural African American communities. Limited access to primary care (5) often forces individuals to miss work for medical appointments, further reducing income and adding financial stress. Beyond access issues, a growing body of research links patient experience to health outcomes (6,7). Delayed preventive care complicates the management of chronic illnesses like diabetes and hypertension, often leading to worse outcomes (8). Interpersonal barriers—such as communication breakdowns, perceived disrespect, and lack of involvement in care decisions—can further discourage care-seeking, especially among rural residents (9–11). When financial strain, travel burdens, and a lack of trust in providers combine, patients may feel that pursuing preventive care is not worth the effort, further worsening health outcomes. Patient-centered care offers a potential solution. This model prioritizes the patient's experience, treating individuals as unique partners in their health journey (12). According to Stewart (13), patient-centered care involves: (1) exploring the patient's reasons for the visit; (2) understanding the patient's life context; (3) building shared understanding of problems and treatments; (4) promoting prevention and wellness; and (5) maintaining an ongoing relationship between patient and clinician. This approach aligns with theCrossing the Quality Chasmreport by the National Academy of Medicine, which promotes shared decision-making (SDM) as a standard of care (14). In SDM, patients collaborate with providers and are full partners in decision-making (15). At the heart of SDM and patient-centered care is high-quality clinician-patient communication (CPC) which allows for a trusting relationship. The clinician-patient relationship significantly influences whether low-income and minority patients attend clinical visits (16–18). Effective CPC—marked by patient engagement and information sharing—has been linked to better information retention, adherence to treatment, and improved health outcomes (19–21). Unfortunately, studies show that racial disparities often manifest in these interactions. For example, Johnson et al. (19) found that clinicians were more verbally dominant and less patient-centered with African American patients than with White patients, also showing less positive affect. Additionally, Chapman et al. (16) interviewed low-income residents in rural Western U.S. communities and found that the clinician-patient relationship including agreement with treatment plans and positive interactions, affect their interest in attending a clinic visit. There remains a significant gap in research on patient experience in rural, low-income, predominantly African American communities, particularly in the Deep South. Interestingly, the 2019 Consumer Assessment of Healthcare Providers and Systems survey reported that the Southern U.S. received higher provider communication scores—such as listening carefully, explaining clearly, showing respect, and spending adequate time with patients—compared to other regions (22). Based on existing literature, these scores should correlate with improved health outcomes (23). However, many Southern states, including Alabama, continue to exhibit some of the worst health outcomes in the country. The goal of the current study was to examine the patient experience in rural, low-income, predominantly African American communities in Alabama. **Methods** **Participants** A convenience sample of 255 individuals who lived in rural, predominately African American communities in Alabama participated in the study. Most (67%) were female; 83% were African American. Many of the participants were 18–45 years old (113; 44%); 31% ranged from 46 to 65 and the remaining 70 (27%) were older than 65. The study was approved by the University of Alabama Institutional Review Board. **Participant recruitment** Participants were recruited at community events including health fairs, community festivals, church events, etc. Members of the study team described the survey to participants and those agreeing to participate completed the survey via paper and pencil. No compensation was provided. The communities targeted included five small rural Alabama towns with large African American populations (seeSupplementary Materialsfor descriptions of the towns). Rural was defined using the US Census Bureau's definition (24)—any population, housing, or territory NOT in an urban area. These communities were participating in a health literacy project (25) and had community workers trained to administer surveys and who had completed human ethics training. Efforts were made to recruit a diverse sample within the target communities. **Survey** The survey used was developed by the investigators and was designed to assess patient experience at their most recent medical visit. Survey items were taken from validated patient experience surveys including the CAHPS Clinician and Group Adult Survey (22,26) and the Picker Patient Experience Questionnaire (27). The survey consisted of demographic information as well as simple questions to assess aspects of the patient experience. Questions included multiple choice questions: (1) How would you rate the friendliness/responsiveness of the staff? (2) How long did you have to wait for your appointment to start? (3) Did the care providers ask for your opinions? (4) Did the care providers listen to what you had to say? (5) Did the care providers treat you with respect? (6) Was your privacy respected and maintained? (7) When you asked questions, did you get answers you could understand? and (8) How satisfied were you with your visit? Most of the questions had five response options with either a “neutral” mid-point or “about half the time” mid-point. **Analysis** A logistic regression was performed using SAS 9.4 (28). The dependent variables were questions from the survey. The responses were dichotomized (e.g., Most of the time/Always were combined; Somewhat satisfied/Extremely satisfied were combined; remaining three response options were combined). The independent variables were age (18–45, 46–65, and 65+ which was the comparison) and gender (Male was the comparison). A Spearman Rank correlation was also performed on the full range of ordinal responses. **Results** **Satisfied with visit** 64.3% of participants reported being somewhat or extremely satisfied with their most recent visit. The correlation analysis showed that visit satisfaction was significantly correlated with age (p< 0.001; older participants were more satisfied with the visit. The logistic regression analysis showed that those over the age of 65 had significantly higher visit satisfaction than the 18–45 age group [β= 0.43, SE = 0.18, Wald = 5.84,p= 0.016, 95%CI (1.19, 4.48]; there was no significant difference between 65+ and 46–65. There were no effects of gender or an interaction between gender and age. **Provider asked opinion** 44.3% of participants reported that their clinician asked for their opinion most of the time or always. There were no significant effects of gender or age. **Provider listened** 62.7% of participants reported that their clinician listened to them most of the time or always. The correlation analysis did not reveal an association between being listened to and age. The logistic regression failed to show effects of age when comparing the over age 65 participants to the 18–45 and 46–65 age groups. There was a trend for gender with female participants reporting being listened to more than male participants [β= 0.26, SE = 0.14, Wald = 3.42,p= 0.064, 95%CI (0.97, 2.86)]. **Provider treated with respect** 72.9% of participants reported that their clinician treated them with respect most of the time or always. The correlation analysis showed that respect was significantly correlated with age (p= 0.014; older participants felt more respected). The logistic regression showed a trending effect of age when comparing the over 65 age to the 18–45 age group [β= 0.36, SE = 0.19, Wald = 3.58,p= 0.059, 95% CI (0.36, 1.4)]; there was no significant difference between 65+ and 46–65. There was a trend for gender with female participants reporting being respected more than male participants [β= 0.29, SE = 0.15, Wald = 3.67,p= 0.055, 95% CI (0.99, 3.17)]. **Provider respected privacy** 73.7% of participants reported that their clinician respected their privacy most of the time or always. The correlation analysis showed that respect for privacy was marginally significantly correlated with age (p= 0.059; older participants reported their privacy was respected more than younger adults). The logistic regression analysis showed that the over 65 age group had significantly higher reported privacy than the 18–45 age group [β= 0.5, SE = 0.19, Wald = 6.63,p= 0.01, 95% CI (0.26, 1.06)]; there was no significant difference between 65+ and 46–65. There were no significant gender effects. **Provider answered questions** Many (67.8%) participants reported that their clinician answered their questions most of the time or always. There were no significant effects of gender or age. **Discussion** The primary aim of this study was to examine the patient experience among residents of rural, predominantly African American communities in Alabama. Results indicated that patient experience in this population was significantly lower than national benchmarks. For example, only 72.9% of participants in the current study reported feeling they were always treated with respect by their provider, compared to 91% in the 2019 Consumer Assessment of Healthcare Providers and Systems (CAHPS) survey for the South region. Similarly, just 62.7% of participants reported always being listened to by their provider, vs. 88% reported in the CAHPS data. Notably, more participants felt respected by their provider than felt listened to. One-third (35.7%) reported dissatisfaction with their most recent clinical visit, and over half (55.7%) indicated that their clinician did not ask for their opinion. Age-related effects were observed, with older adults reporting higher satisfaction, greater respect, and more respect for privacy than younger participants. Gender trends emerged as well, with female patients more likely to report being listened to and treated with respect than male patients. The low percentage (62.7%) of participants who felt listened to is concerning. Given the central role of effective clinician-patient communication in patient-centered care, these findings suggest significant gaps in care quality—particularly among male participants. Previous research has suggested that men are less familiar with the healthcare system due to lower utilization rates, both for themselves and as caregivers, which may impact their comfort level and health literacy (29). Furthermore, Connell et al. (30) noted that cultural norms surrounding masculinity often discourage healthcare-seeking behavior in men, leading to delayed care and reduced self-advocacy. These trends may be even more pronounced in African American men, who are reported to seek care infrequently (31). Age also influenced perceptions of respect and satisfaction. Younger patients, especially younger women, felt less respected than older patients. DeVoe et al. (32) similarly found that adults aged 18–64 were less likely to report feeling respected or that their provider spent sufficient time with them. These findings may reflect differing expectations—older adults may have more realistic or tolerant views of healthcare interactions, while younger adults may feel their expectations are unmet (33). Interestingly, respect was reported at higher rates than being listened to. Respect may be influenced by multiple factors, including staff friendliness and wait times. As Cuevas et al. (34) reported, long wait times may trigger feelings of discrimination, impacting perceived respect and satisfaction. Future studies should explore how patients define respect and what they expect from clinician listening behaviors. **Communication, health literacy, and self-advocacy** Miscommunication in healthcare often stems from differences in verbal, non-verbal, and written communication. Health literacy, the ability to access, understand, and use health information, is critical (35). Universal health literacy precautions, such as using plain language for all patients regardless of background, are essential (36). A vital part of health literacy is self-advocacy, defined as representing one's interests in healthcare decisions (37). Studies show that self-advocacy improves satisfaction and health outcomes (38,39). However, disparities exist. Older adults tend to be more passive during medical visits (40,41), and older African Americans may be even less likely to advocate for themselves due to fears of provider retaliation (38,43). This may be particularly true in Alabama where there is a history of medical maltreatment of African Americans (e.g., the U.S. Public Health Service Untreated Syphilis Study in Tuskegee, Alabama). These disparities likely affect clinician-patient communication and shared decision-making. **Implications for practice** Effective clinician-patient communication is critical to improving health outcomes (44). The current study highlights that patients in rural, predominantly African American communities in Alabama often do not receive high-quality communication from providers, signaling a lack of shared decision-making. Addressing this gap requires dual engagement: • Clinicians must be trained to address biases (e.g., racial, gender, socioeconomic) and prioritize respectful, attentive communication. Using plain language and demonstrating cultural awareness are also key. • Patients need education and tools to build self-advocacy skills. Programs teaching patients to prepare for appointments, track their treatment experiences, and articulate concerns can enhance communication (45,46). Teach-back methods and strategies like Ask Me 3 can also empower patients by clarifying their understanding and reinforcing engagement (47). **Implications for further research** Future research should include mixed methods to gather both quantitative and qualitative data for a richer understanding of patient experiences. Further exploration of patient-provider gender and racial dynamics is also warranted, particularly the observed disparities in male patient experience. Additionally, concepts such as “respect” and “listening” require deeper investigation as their definitions may vary from region to region. For example: • Does “being listened to” mean receiving a desired outcome? • Does it mean achieving clarity or understanding by the end of a visit? Research into the use of teach-back techniques and how they correlate with patient perceptions of listening and communication quality would also be valuable. **Conclusions and educational implications** Improving patient experience necessitates change from both providers and patients. Patients benefit from preparation and active participation during visits, while providers must adopt patient-centered approaches such as shared decision-making. Focused listening, plain language, and cultural sensitivity are essential. Ultimately, patient experience must be prioritized by both parties, and the complexity of healthcare communication must be addressed with empathy and clarity. **Limitations** There are some limitations to the current study. First, the convenience sample used may not be representative of all rural communities or all rural African American communities. These Alabama communities have a particular history and culture which likely contribute to the patient experience reported. Also, there may be differences in the patient experience as a function of socioeconomic status, race/ethnicity, or gender identity that was not examined. Like many studies, the participants were not balanced on all demographic variables to allow for comparisons. Secondly, we did not obtain information about healthcare providers including their gender, race, and cultural background in order to examine their influence on communication. Finally, there were some limitations to the survey used. The survey has not been validated or tested for reliability. Also, the use of self-reported assessment of the patient experiences via surveys may be subject to memory bias. **Data availability statement** The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. **Ethics statement** The studies involving humans were approved by University of Alabama Institutional Review Board. The studies were conducted in accordance with the local legislation and institutional requirements. The ethics committee/institutional review board waived the requirement of written informed consent for participation from the participants or the participants' legal guardians/next of kin because there was minimal risk associated with the study. **Author contributions** FW: Writing – original draft, Writing – review & editing. LH: Methodology, Writing – original draft, Writing – review & editing. PP-F: Writing – original draft, Writing – review & editing. SN: Conceptualization, Data curation, Funding acquisition, Project administration, Writing – original draft, Writing – review & editing. MN: Formal analysis, Writing – review & editing. **Funding** The author(s) declare that financial support was received for the research and/or publication of this article. This project is supported by the Office of Minority Health of the U.S. Department of Health and Human Services (HHS) as part of a financial assistance award totaling $2.9M with 100 percent funded by HHS. The contents are those of the author(s) and do not necessarily represent the official views of, nor an endorsement, by HHS, or the U.S. Government. For more information, please visithttps://www.minorityhealth.hhs.gov/. **Acknowledgments** We would like to thank Kimberly Moss, Melonie Pichon, Deborah Scott, Kileema Rogers, and Angela Orr for their support is collecting the data. **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Publisher's note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **Supplementary material** The Supplementary Material for this article can be found online at:https://www.frontiersin.org/articles/10.3389/frhs.2025.1420698/full#supplementary-material **References** 1. United Health Foundation. (2022). America’s Health Rankings 2022 Annual Report. Available at:https://www.americashealthrankings.org/(Accessed July 17, 2023). Google Scholar 2. United Health Foundation. (2021). America’s Health Rankings.Annual Report: Diabetes. Available at:https://www.americashealthrankings.org/explore/annual/measure/Diabetes/state/AL(Accessed July 17, 2023). Google Scholar 3. United Health Foundation. (2021). America’s Health Rankings.Annual Report: Hypertension. Available at:https://www.americashealthrankings.org/explore/annual/measure/Hypertension/state/AL(Accessed July 17, 2023). Google Scholar 4. Centers for Disease Control and Prevention (CDC). (2021).Stroke Mortality by State. Available at:https://www.cdc.gov/nchs/pressroom/sosmap/stroke_mortality/stroke.htm(Accessed July 17, 2023). Google Scholar 5. Jacobs E, Whann H, Corley EG, Bowen J, Keeney N. Healthcare: A Key Challenge in Alabama’s Black Belt (2023). Available at:https://ir-api.ua.edu/api/core/bitstreams/427aece5-bd8a-4a04-b9f3-d41f72e1b7cb/content(Accessed November 05, 2023). Google Scholar 6. Navarro S, Ochoa CY, Chan E, Du S, Farias AJ. Will improvements in patient experience with care impact clinical and quality of care outcomes?: a systematic review.Med Care. (2021) 59(9):843–56. doi: 10.1097/MLR.0000000000001598 PubMed Abstract|Crossref Full Text|Google Scholar 7. Mohammed K, Nolan MB, Rajjo T, Shah ND, Prokop LJ, Varkey P, et al. Creating a patient-centered health care delivery system: a systematic review of health care quality from the patient perspective.Am J Med Qual. (2016) 31(1):12–21. doi: 10.1177/1062860614545124 PubMed Abstract|Crossref Full Text|Google Scholar 8. Handelsman Y, Butler J, Bakris GL, DeFronzo RA, Fonarow GC, Green JB, et al. Early intervention and intensive management of patients with diabetes, cardiorenal, and metabolic diseases.J Diabetes Complicat. (2023) 37(2):108389. doi: 10.1016/j.jdiacomp.2022.108389 PubMed Abstract|Crossref Full Text|Google Scholar 9. Escobedo LE, Cervantes L, Havranek E. Barriers in healthcare for Latinx patients with limited English proficiency—a narrative review.J Gen Intern Med. (2023) 38(5):1264–71. doi: 10.1007/s11606-022-07995-3 PubMed Abstract|Crossref Full Text|Google Scholar 10. Tan TW, Crocker RM, Palmer KN, Gomez C, Armstrong DG, Marrero DG. A qualitative study of barriers to care-seeking for diabetic foot ulceration across multiple levels of the healthcare system.J Foot Ankle Res. (2022) 15(1):56. doi: 10.1186/s13047-022-00561-4 PubMed Abstract|Crossref Full Text|Google Scholar 11. Coombs NC, Campbell DG, Caringi J. A qualitative study of rural healthcare providers’ views of social, cultural, and programmatic barriers to healthcare access.BMC Health Serv Res. (2022) 22(1):438. doi: 10.1186/s12913-022-07829-2 PubMed Abstract|Crossref Full Text|Google Scholar 12. Eklund JH, Holmström IK, Kumlin T, Kaminsky E, Skoglund K, Höglander J, et al. Same same or different?” A review of reviews of person-centered and patient-centered care.Patient Educ Couns. (2019) 102(1):3–11. doi: 10.1016/j.pec.2018.08.029 PubMed Abstract|Crossref Full Text|Google Scholar 13. Stewart M. Towards a global definition of patient centred care.Br Med J. (2001) 322:444–5. doi: 10.1136/bmj.322.7284.444 PubMed Abstract|Crossref Full Text|Google Scholar 14. Institute of Medicine.Crossing the Quality Chasm: A New Health System for the 21st Century. Washington, DC: National Academies Press (2001). Google Scholar 15. Resnicow K, Catley D, Goggin K, Hawley S, Williams GC. Shared decision making in health care: theoretical perspectives for why it works and for whom.Med Decis Making. (2022) 42(6):755–64. doi: 10.1177/0272989X211058068 PubMed Abstract|Crossref Full Text|Google Scholar 16. Chapman KA, Machado SS, van der Merwe K, Bryson A, Smith D. Exploring primary care non-attendance: a study of low-income patients.J Prim Care Community Health. (2022) 13:21501319221082352. doi: 10.1177/21501319221082352 PubMed Abstract|Crossref Full Text|Google Scholar 17. McLean S, Gee M, Booth A, Salway S, Nancarrow S, Cobb M, et al. Patterns and influences on health-care attendance behaviour: a narrative overview of key themes and issues.NIHR J Lib. (2014) 2(34):1–216. doi: 10.3310/hsdr02340 Crossref Full Text|Google Scholar 18. Martin C, Perfect T, Mantle G. Non-attendance in primary care: the views of patients and practices on its causes, impact and solutions.Fam Pract. (2005) 22(6):638–43. doi: 10.1093/fampra/cmi076 PubMed Abstract|Crossref Full Text|Google Scholar 19. Johnson RL, Roter D, Powe NR, Cooper LA. Patient race/ethnicity and quality of patient–physician communication during medical visits.Am J Public Health. (2004) 94(12):2084–90. doi: 10.2105/ajph.94.12.2084 PubMed Abstract|Crossref Full Text|Google Scholar 20. Roter DL, Stewart M, Putnam SM, Lipkin M, Stiles W, Inui TS. Communication patterns of primary care physicians.JAMA Network. (1997) 277(4):350–6. doi: 10.1001/jama.1997.03540280088045 Crossref Full Text|Google Scholar 21. Hall JA, Roter DL, Katz NR. Meta-analysis of correlates of provider behavior in medical encounters.Med Care. (1988) 26:657–75. doi: 10.1097/00005650-198807000-00002 PubMed Abstract|Crossref Full Text|Google Scholar 22. Agency for Healthcare Research and Quality. (2025).CAHPS Clinician & Group Survey. Available at:https://www.ahrq.gov/cahps/surveys-guidance/cg/index.html(Accessed April 24, 2025). Google Scholar 23. Sharkiya SH. Quality communication can improve patient-centred health outcomes among older patients: a rapid review.BMC Health Serv Res. (2023) 23(1):886. doi: 10.1186/s12913-023-09869-8 PubMed Abstract|Crossref Full Text|Google Scholar 24. U.S. Census Bureau. Census Summary File 1 Table P2 and Cartographic Boundary Shapefiles (2010); U.S. Geological Survey, Protected Areas Database of the United States (PADUS). (2010). Google Scholar 25. Newman SD, Moss K, Pichon M, Scott D, Rogers K, Orr A, et al. The health of rural black communities during COVID: some affirmations, some surprises.Front Public Health. (2023) 11:932451. doi: 10.3389/fpubh.2023.932451 PubMed Abstract|Crossref Full Text|Google Scholar 26. Mukherjee S, Rodriguez H, Elliott M, Crane P. Modern psychometric methods for estimating physician performance on the clinician and group CAHPS survey.Health Serv Outcomes Res Method. (2013) 13(2-4):109–23. doi: 10.1007/s10742-013-0111-8 Crossref Full Text|Google Scholar 27. Jenkinson C, Coulter A, Bruster S. The picker patient experience questionnaire: development and validation using data from in-patient surveys in five countries.Int J Qual Health Care. (2002) 14(5):353–8. doi: 10.1093/intqhc/14.5.353 PubMed Abstract|Crossref Full Text|Google Scholar 28. SAS Institute Inc. SAS/ACCESS® 9.4 Interface to ADABAS: Reference (2013). Google Scholar 29. Burkhart Q, Elliott MN, Haviland AM, Weech-Maldonado R, Wilson-Frederick SM, Gaillot S, et al. Gender differences in patient experience across medicare advantage plans.Women’s Health Issues. (2020) 30(6):477–83. doi: 10.1016/j.whi.2020.08.009 PubMed Abstract|Crossref Full Text|Google Scholar 30. Connell CC, Wang SC, Crook L, Yadrick K. Barriers to healthcare seeking and provision among African American adults in the rural Mississippi Delta region: community and provider perspectives.J Community Health. (2019) 44(4):636–45. doi: 10.1007/s10900-019-00620-1 PubMed Abstract|Crossref Full Text|Google Scholar 31. Eley NT, Namey E, McKenna K, Johnson AC, Guest G. Beyond the individual: social and cultural influences on the health-seeking behaviors of African American men.Am J Men’s Health. (2019) 13(1):1557988319829953. doi: 10.1177/15579883198299 Crossref Full Text|Google Scholar 32. DeVoe JE, Wallace LS, Fryer GE. Jr Patient age influences perceptions about health care communication.Fam Med. (2009) 41(2):126.19184691 PubMed Abstract|Google Scholar 33. Bower P, Roland M, Campbell J, Mead N. Setting and standards based on patients’ views on access and continuity: secondary analysis of data from the general practice assessment survey.Br Med J. (2003) 326:258–62. doi: 10.1136/bmj.326.7383.258 Crossref Full Text|Google Scholar 34. Cuevas AG, O'Brien K, Saha S. African American experiences in healthcare: “I always feel like I’m getting skipped over”.Health Psychol. (2016) 35(9):987. doi: 10.1037/hea0000368 PubMed Abstract|Crossref Full Text|Google Scholar 35. Office of Disease Prevention and Health Promotion. (n.d.). Health literacy. Healthy People 2030. U.S. Department of Health and Human Services. Available at:https://health.gov/healthypeople/about/workgroups/health-communication-and-health-information-technology-workgroup(Accessed July 13, 2023). Google Scholar 36. Stormacq C, Van den Broucke S, Wosinski J. Does health literacy mediate the relationship between socioeconomic status and health disparities? Integrative review.Health Promot Int. (2019) 34(5):e1–e17. doi: 10.1093/heapro/day062 PubMed Abstract|Crossref Full Text|Google Scholar 37. Wright KB, Frey L, Sopory P. Willingness to communicate about health as an underlying trait of patient self-advocacy: the development of the willingness to communicate about health (WTCH) measure.Commun Stud. (2007) 58:35–51. doi: 10.1080/1051097060116867 Crossref Full Text|Google Scholar 38. Senders A, Sando K, Wahbeh H, Peterson HA, Shinto L. Managing psychological stress in the multiple sclerosis medical visit: patient perspectives and unmet needs.J Health Psychol. (2016) 21(8):1676–87. doi: 10.1177/1359105314562084 PubMed Abstract|Crossref Full Text|Google Scholar 39. Brashers DE, Basinger ED, Rintamaki LS, Caughlin JP, Para M. Taking control: the efficacy and durability of a peer-led uncertainty management intervention for people recently diagnosed with HIV.Health Commun.(2017) 32:11–21. doi: 10.1080/1041236.2015.1089469 PubMed Abstract|Crossref Full Text|Google Scholar 40. Kahana E, Kahana B, Kelley-Moore J, Adams SA, Hammel R, Kulle D, et al. Toward advocacy in cancer care for older adults: survivors have cautious personal actions but bold advice for others.J Am Geriatr Soc. (2009) 57:s269–71. doi: 10.1111/j.1532-5415.2009.02509.x PubMed Abstract|Crossref Full Text|Google Scholar 41. Ruggiano N, Whiteman K, Shtompel N. “If I don’t like the way I feel with a certain drug, I’ll tell them”. Older Adults’ experiences with self-determination and health self-advocacy.J Appl Gerontol. (2016) 35(4):401–20. doi: 10.1177/0733464814527 PubMed Abstract|Crossref Full Text|Google Scholar 42. Anthony JS. Self-advocacy in health care decision-making among elderly African Americans.J Cult Divers. (2007) 14(2):88–95.19175249 PubMed Abstract|Google Scholar 43. Weaver GD, Gary LE. Correlates of health related behaviors in older African American adults: implications for health promotion.Fam Community Health.(1996) 19(2):43–57. Google Scholar 44. Coleman C, Birk S, DeVoe J. Health literacy and systemic racism—using clear communication to reduce health care inequities.JAMA Intern Med. (2023) 183(8):753–4. doi: 10.1001/jamainternmed.2023.2558 PubMed Abstract|Crossref Full Text|Google Scholar 45. Cegala DJ, Marinelli T, Post D. The effects of patient communication skills training on compliance.Arch Fam Med. (2000) 9(1):57. doi: 10.1001/archfami.9.1.57 PubMed Abstract|Crossref Full Text|Google Scholar 46. Cegala DJ. Emerging trends and future directions in patient communication skills training.Health Commun. (2006) 20(2):123–9. doi: 10.1207/s15327027hc2002_3 PubMed Abstract|Crossref Full Text|Google Scholar 47. Institute for Healthcare Improvement. (n.d.). Ask Me 3: Good questions for your good health. Available at:https://www.ihi.org/resources/tools/ask-me-3-good-questions-your-good-health(Accessed November 13, 2023). Google Scholar Keywords:patient experience, clinician-patient communication, age, gender, African American Citation:Wood F, Hites L, Payne-Foster P, Newman MM and Newman SD (2025) Patient experience during medical visits in predominately African American rural communities in Alabama.Front. Health Serv.5:1420698. doi: 10.3389/frhs.2025.1420698 Received:20 April 2024;Accepted:23 May 2025;Published:11 June 2025. Edited by: Reviewed by: Copyright:© 2025 Wood, Hites, Payne-Foster, Newman and Newman. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Sharlene D. Newman,c2RuZXdtYW5AdWEuZWR1 Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract Introduction Methods Results Discussion Data availability statement Ethics statement Author contributions Funding Acknowledgments Conflict of interest Publisher's note Supplementary material References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}