{"id": 870, "name": "Maplight", "domain": "maplight.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.maplight.org/campaign-finance-software", "title": "Campaign Finance Software", "content": "**Technology for Democracy** **Technology for Democracy** Technology SolutionsCampaign FinanceE-SignaturesCustom Software Technology Solutions Campaign Finance E-Signatures Custom Software Technology Solutions Technology Solutions Campaign Finance E-Signatures Custom Software About UsAbout UsNewsLeadershipBoardFundingCareers About Us About Us News Leadership Board Funding Careers About Us About Us About Us News Leadership Board Funding Careers Donate Donate Donate Donate More More More Technology SolutionsCampaign FinanceE-SignaturesCustom Software Technology Solutions Campaign Finance E-Signatures Custom Software Technology Solutions Technology Solutions Campaign Finance E-Signatures Custom Software About UsAbout UsNewsLeadershipBoardFundingCareers About Us About Us News Leadership Board Funding Careers About Us About Us About Us News Leadership Board Funding Careers Donate Donate Donate Donate More More More **TECHNOLOGY SOLUTIONS** **Campaign Finance** Campaign finance filing and disclosure software, including ethics and lobbying reporting, for state and local government. **Electronic filings eliminate paper forms** **Industry-leading public transparency portal** **Fully hosted SaaS solution** The MapLight campaign finance system is a modern, flexible electronic filing system that supports compliance, staff efficiency, and public transparency. It is a web application for government ethics officials, filers such as candidates, committees, and lobbyists, and the public. We support campaign finance, ethics, and lobbying reporting--just one of these, or any combination of the three. ​ MapLight customizes the system to meet your agency’s laws, regulations, and operational needs. We provide a comprehensive solution, including setup, training, and ongoing support. ​ The MapLight campaign finance system is a hosted, software-as-a-service (SaaS) solution, eliminating setup hassles and conserving your IT resources. The MapLight system is available as an on-premises solution as well. **Key Features** Campaign contribution and expenditures filing Campaign contribution and expenditures filing Campaign contribution and expenditures filing Lobbying registration and reporting Lobbying registration and reporting Lobbying registration and reporting Ethics disclosures Ethics disclosures Ethics disclosures Automatic notifications for reminders and late filings Automatic notifications for reminders and late filings Automatic notifications for reminders and late filings Automated validation and compliance checks Automated validation and compliance checks Automated validation and compliance checks Powerful search portal that provides maximum public transparency Powerful search portal that provides maximum public transparency Powerful search portal that provides maximum public transparency **More Civic Technology Solutions** Thanks for submitting! **Get updates from MapLight** Copyright © 2025 MapLight |Privacy Policy|Terms of Use"}