{"id": 1802, "name": "Shoebat", "domain": "shoebat.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://shoebat.com/2025/06/10/after-twenty-years-of-the-us-being-the-most-hated-nation-in-russia-the-majority-of-russians-see-germany-as-the-biggest-enemy-of-russia/#respond", "title": "After Twenty Years Of The Us Being The Most Hated Nation In Russia The Majority Of Russians See Germany As The Biggest Enemy Of Russia", "content": "**Navigation** **Primary Menu** About MeArticles and Press ReleasesEvidence: The Story of Walid Shoebat. It Really Checks Out.Comments from Walid Shoebat Articles and Press Releases Evidence: The Story of Walid Shoebat. It Really Checks Out. Comments from Walid Shoebat Articles and Press Releases Evidence: The Story of Walid Shoebat. It Really Checks Out. Comments from Walid Shoebat Important InformationObamas’ Wahhabist Fundraising EmpireInnocence of MuslimsHuma AbedinPalestinian JusticeCNN Smear CampaignThe CNN Hatchet JobI ConfessCNN Reporter Drew Griffin is a Proven Liar Obamas’ Wahhabist Fundraising Empire Innocence of Muslims Huma Abedin Palestinian Justice CNN Smear CampaignThe CNN Hatchet JobI ConfessCNN Reporter Drew Griffin is a Proven Liar The CNN Hatchet Job I Confess CNN Reporter Drew Griffin is a Proven Liar Obamas’ Wahhabist Fundraising Empire Innocence of Muslims Huma Abedin Palestinian Justice CNN Smear CampaignThe CNN Hatchet JobI ConfessCNN Reporter Drew Griffin is a Proven Liar The CNN Hatchet Job I Confess CNN Reporter Drew Griffin is a Proven Liar The CNN Hatchet Job I Confess CNN Reporter Drew Griffin is a Proven Liar Donate Contact **After Twenty Years Of The US Being The Most Hated Nation In Russia, The Majority Of Russians See Germany As The Biggest Enemy Of Russia** After twenty years of America being on the top position of being considered the most unfriendly nation by Russians, Germany is now seen as the number one most unfriendly country by Russians. As we read inSCMP: Germany is now considered the most hostile country towards Russia, a survey conducted by the independent Moscow-based polling institute Levada showed. The survey found that 55 per cent of respondents named Germany as the most unfriendly state – a 40 percentage point increase since May 2020. In contrast, the United States, which held the top position for two decades, was named by only 40 per cent of respondents, compared to 76 per cent last year. This shift is attributed to the revival of Russian-American relations under US President Donald Trump, the institute said. The disfavor towards Germany has to do primarily with the latter giving weapons to Ukraine. But it cannot be ignored that hostility from Germany is becoming more and more explicit. Germany’s Foreign Minister, Johann Wadephul, said in April of 2025: “Russia will forever remain an enemy for us”. So its not like the Russians’ concerns about Germany are coming out of nowhere. When Wadephul says that Russia will always be Germany’s enemy, by “always” he is harkening back to World War Two and World War One. The very militaristic spirit of Germany is reviving and manifesting itself. Also in April of 2025, Wadephile made a similar statement: “The most acute threat to us—to our lives, to the legal system, but also to the physical lives of all people in Europe—is now Russia. As supporters of #Ukraine, we have a responsibility to speak out more clearly about the threat it poses.” And then recently a prestigious professor by the name of Egon Flaig,declaredthat parents should be ready to sacrifice their children in a war against Russia. The professorsaid: “Immediately reintroduce conscription, and why not do what they’re doing now in Poland, (…) in the upper grades in Poland (…) shooting exercises (…) are being included in the curriculum – I think that’s the right thing to do. … The unwillingness of parents to see their children as soldiers, that is, as members of the community who may be sacrificed for the community, who may be sacrificed to maintain our lives as we wish to continue to cultivate them, this will to make this sacrifice is a painful one. … Getting out of this situation is a very difficult thing, because it requires the cultural reprogramming of a largely depoliticized society, some call it a post-heroic society.” The major German military industry company, Rheinmetall (which is Europe’s largest producer of munitions) declared that it was going to be profiting big due to Germany’s desire to boost up military spending to make itself more independent of the American security umbrella. While many other types of companies (like Volkswagen) are seeing decline, this has not been the case for Rheinmetall which has been reporting growth since the commencement of the war in Ukraine in 2022. Rheinmetall is also exhibiting the tradition and legacy of German industriousness, building whole facilities in a matter of months and creating thousands of jobs. The company is building facilities in Lithuania, Hungary and Romania. Just to show you how focused Germany has become on military buildup: in a country where it typically takes two years to get permits to just put up a sign on the side of the road, Rheinmetall built a facility in Unterluss in just 13 months. The CEO of Rheinmetall, Armin Papperger, declared: “An era of rearmament has begun”. Such words reflect the zeitgeist we are living in; it is one of militarism. We predicted that the 2020s was going to be a decade of militarism: And we were right. Rheinmetall has been enjoying immense growth. Rheinmetall’s stock has boomed more than 1,000% since the beginning of Russia’s war in Ukraine in 2022. In 2024, Rheinmetall reported that it grew 30%. For 2025, it is projecting as much as 40% growth, because German leaders want to increase military spending as a response to the Trump administration making it clear that Europe is no longer a priority. While car making facilities are in danger of closing down, Rheinmetall is thinking about using such facilities to make military technology. One option that has been suggested is for Rheinmetall to take control of a plant that was once operated by Volkswagen near Osnabruck that barely survived in 2024. The enriching of Rheinmetall is an indication of two things: the advent of the revival of German militarism, and the dawn of a militarily independent Europe. This was seen in the words of the head of the EU Commission, Ursula von der Leyen when she emphasized that 150 billion euros from the planned EU defense fund should be invested solely in European defense corporations in order to strengthen European industry. This desire to have an independent militarism within Germany is agreed to by both the common mainstream parties, such as the Christian Democrats (CDU), and the ultra-nationalist AfD party. The AfD is definitely the most militaristic party in Germany, having military personnel and arms lobbyists among its elected representatives and being the most ardent supporter of bringing back mandatory conscription. Because of this, the AfD will agree with mainstream parties on policies to reinvigorate German military strength. This is why the German Greens, the Social Democrats (SPD) and the Free Democrats (FDP) received the approval of the AfD for military deployments for foreign missions such as the ASPIDES to secure the flow of goods and trade through the Red Sea. The German government wants for deeper ties between civilian life and military life, thus commencing the embryonic stage of a revival of German militarist culture. According to Germany’s Health Minister, Karl Lauterbach, the German healthcare system must become more robust and must be reshaped to prepare for possible “military conflicts.” He further explained: “It would be foolish to say we aren’t preparing for a military conflict, and then it won’t happen … Doing nothing is not an option. A new era is also needed for the healthcare system. Especially since, in the event of an alliance, Germany could become a hub for the care of injured and wounded from other countries, too.” In March of 2024, the Federal Education Minister Bettina Stark-Watzinger advocated for civil defense drills in schools to better prepare students for war. She also advocated for Bundeswehr youth officers to visit schools to gain recruits, saying that schools must develop a “relaxed relationship with the Bundeswehr.” She said in an interview: “Society as a whole must be well prepared for crises – from pandemics to natural disasters to war … The goal must be to strengthen our resilience.” The explosive growth of Rheinmetall reminds us of the massive arms race and boom in military industry that took place before the First World War. For example, before World War One, the biggest business in all of Europe was the German armaments firm Krupp, just as today the German armament company Rheinmetall is the biggest munitions company in Europe. Europe’s biggest business became the preparation for war; it became militarism. Right now it looks like Germany — with its declining car industry — is on its way to becoming a war economy. In 1917, during World War One The Kaiser Wilhelm II wanted to send the German military into the Baltic states to form a special police unit to destroy the Bolsheviks there, stating that such a policy would be like what the Ottomans did to the Armenians (the genocide of the Armenians was widely known by the Germans, so its quite obvious that the Kaiser had butchery on his mind): “Bolsheviki must be disposed of. On this the following suggestion … we should give aid to Estonia. The Baltic must appeal for help against robbers. We will then provide assistance (analogue to Turkey in Armenia). Form a Baltic gendarmerie that will restore order … policing action, but not war.” The quote from Wilhelm II reflects Germany’s historical desire to control the Baltic states. In the aftermath of World War One, on August 27th of 1918, Germany and Russia finalized the Supplementary Treaty of Brest-Litovsk. As part of this deal, the governorates of Livonia and Estonia were formally severed from Russian control, strengthening German power in Baltic region. By removing Russian power, Germany filled the vacuum, which really goes to show that the Baltics is the subject of the struggle between Russia and Germany over who will rule Europe. Today, this struggle is still there. Hence why the German defense minister, Boris Pistorius, declared in January of 2025: “Lithuania’s security is our security.” He said these words in regards to Germany’s ongoing policy of deploying thousands of German troops into Lithuania. Why is Germany sending troops into Lithuania? For the same reason it sent troops into the Baltics in both World Wards: The Russian-German struggle over Europe. Even if there is no war right now between Russia and Germany, this does not mean that there will be no rhyming of history. Before World War Two there was a duration of time in which there was no fighting; in fact, during this time the Germans made a promise not to join Poland in an attack on Russia, and in 1927 the Germans assured the Soviets that Britain and France had no intentions of attacking them. (See Tooze, The Deluge, ch. 25, p. 477). Regardless of these gestures, there was war between Russia and Germany. And even though Germany’s military after World War One was controlled by the Americans, militarism still revived. From April of 1919 to January of 1921, Germany’s military shrank from 800,000 to just 100,000, while 30,000 of 34,000 officers corps were discharged. (See Burleigh, The Third Reich, ch. 1, p. 46). A new international order was put in place, led by the United States, and it had rules to prevent another world war from happening. But Germany’s nationalists scoffed at international law and instead fixated on doctrines that spoke of the inevitability of conflict between different nations and races. A resurgence in volkisch thinking grew by leaps and bounds, foreshadowing the revival of German militarism. One of the major leaders of the nationalist and militarist party, the AfD, Bjorn Hocke, also promotes a volkisch ideology, advancing the idea of German mythology as a way to strengthen the people: To draw inner strength from myths has always been helpful in times of change. And we are undoubtedly living again in a turning point. We have the task of us, our great story again re-appropriating. Whether we succeed in opening up a new feeling, a new myth for our people, that will depend on whether we as AfD can feed this new spirit into the political discussion and enforce it. This resurgence of such an ideology is a sign of not just nationalism. Nationalism is a packaged deal: it comes with militarism. After World War Two the German military was put under the control of the Americans. This does not mean that militarism will not come back. For after World War One, the German military was also placed under control, and this did not prevent Nazi militarism from taking over the country. After World War One, the German military was dissolved and replaced with the Reichswehr (Reich Defense) which was suppose to be a peacekeeping force. They were to be used only as border protection and to keep order. Heavy weapons above certain calibers, armored weapons and submarines and an air force were prohibited. Years before the rise of Hitler, the Germans under the Weimar government were secretly working on rearmament. Once Hitler took power, he amped up the militarization of Germany, out in the open for the whole world to see, flaunting his breaking of the rules. Today, the mainstream parties like the Christian Democrats, Social Democrats and Greens, are working to make Germany’s military stronger. But, if Germany goes far deep into nationalism, it will intensify nationalism as Hitler did. Germany’s military is under the watch of NATO. But, just as the far-right of the post-WW1 era wanted intense militarization, so today Germany’s biggest nationalist party, the AfD, desires for a powerful and independent German military. The most famous leader of the AfD, Bjorn Hocke, does not see the Bundeswehr as a Germany army, but merely a tool of NATO. In his own words: “an objective look at the emergence and development of the Bundeswehr leads to the sobering conclusion: it was never a genuinely German army that wanted to build on the great national military traditions, but consciously forced this break and was always in the service of foreign powers.” Hocke is waiting for Germany to become fully militarily independent so that a truly patriotic German army can be formed; and he even goes so far as to say that if a German wants to serve his country, that he should wait for the US to withdraw from Germany: “Today, as a Bundeswehr soldier, you help to implement foreign great power strategies. That could change after the American withdrawal from Europe and a possible dissolution or reorientation of NATO. But until then, if you’re just looking for a job, you should look around at the Bundeswehr. If you really want to serve your country with arms, you should consider waiting for better times.” Hocke’s party wants to revive German militarism and wants for Germany to run its own nuclear umbrella. The “Two Plus Four Treaty” signed in 1990 after German reunification states that Germany is not allowed to have its own nuclear weapons. German chancellor Friedrich Merz affirmed that Germany “cannot and must not have its own nuclear weapons,” and that Germany has “expressly renounced the possession of nuclear weapons, and that will remain the case”. On March 15th of 2025, DW reported that “Merz wants to discuss nuclear deterrence in Europe with France and the UK, both armed with nuclear weapons. In Paris, that door was already wide open.” On the other hand, the AfD has discussed Germany obtaining its own nuclear weapons. Rudiger Lukassen, a member of the Bundestag’s defense committee, from the German right-wing Alternative for Germany (AfD) party, explicitly stated: “Germany needs its own nuclear weapons and compulsory military service, including for women. To achieve this, it is necessary to change the Basic Law as soon as possible … Germany needs its own nuclear umbrella.” So the AfD not only wants Germany to have nuclear weapons for itself, but for Germany to have its own nuclear umbrella for Europe. This means Germany becoming a massive powerhouse of geopolitical might, rising up as the defender of Europe, with an independent military force leading European auxiliaries and owning its own nuclear weapons. The AfD is now the second most popular party in Germany, which is a reflection of a growing desire for a resurgence of nationalism. Nationalism is a packaged deal; its not just about waving flags, but about an enforced militarism. The rise of German nationalism is really a sign of a coming European war. Right now, the German government under mainstream parties like the Christian Democrats is talking about spending 500 billion euros on defense in the next twelve years. This would not be enough to create a force powerful enough to face an army like Russia’s. But, if Germany becomes a hardcore nationalist country, then you will see the rise of serious militarism the likes of which we have not seen since the Third Reich. The US has expressed support for the AfD, with JD Vance scorning German mainstream parties for “firewalling” the nationalist party, and Elon Musk declaring that the only hope for Germany is the AfD. It looks like the US wants the nationalist fanatics to take over Germany to accelerate the revival of German militarism to use it as a proxy against Russia. **Share this:** Facebook Twitter Reddit LinkedIn Print More Skype WhatsApp Telegram Pocket Pinterest Tumblr **CLICK HERE TO DONATE NOW** **Connect To Us** CLICK HERE TO SIGN UP FOR OUR NEWSLETTER **Highlighted Articles** After Twenty Years Of The US Being The Most Hated Nation In Russia, The Majority Of Russians See Germany As...After twenty years of America being on the top position... The Extremism That Plagues Mankind, Societal Decay, And Christ's War On Israel's Fanaticism... Gaza Is A Dystopian Nightmare... Trump Declares: 'We Are Working With Iran To Make Peace In Gaza.' Meanwhile, The Israelis Are Discussing An Attack On...For the first time ever, we see a US president... Turkey is stronger than Israel... Germany Really Is Trying To Create The Fouth Reich... **Post Calendar** **Login Meta** Log in Entries feed Comments feed WordPress.org"}