{"id": 150, "name": "BNO News", "domain": "bnonews.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://bnonews.com/index.php/2025/06/california-man-sentenced-for-threatening-to-kill-postal-workers-in-u-s-virgin-islands/", "title": "California Man Sentenced For Threatening To Kill Postal Workers In U S Virgin Islands", "content": "Home U.S. News World Politics Legal Health Business Entertainment MenuContact UsE-mail alertsBNO News Wire ServiceENS Alerts Contact Us E-mail alerts BNO News Wire Service ENS Alerts Contact Us E-mail alerts BNO News Wire Service ENS Alerts Live feeds **BNO News** Home U.S. NewsMother lied in Delaware Amber Alert; Nola Dinkins case now a homicide probeDelaware Amber Alert: Nola Dinkins abducted by armed man and womanRep. McIver indicted for blocking ICE arrest of Newark MayorLos Angeles mayor declares local emergency and curfew amid ongoing unrestProtesters clash with police in Chicago during anti-ICE demonstration Mother lied in Delaware Amber Alert; Nola Dinkins case now a homicide probe Mother lied in Delaware Amber Alert; Nola Dinkins case now a homicide probe Delaware Amber Alert: Nola Dinkins abducted by armed man and woman Delaware Amber Alert: Nola Dinkins abducted by armed man and woman Rep. McIver indicted for blocking ICE arrest of Newark Mayor Rep. McIver indicted for blocking ICE arrest of Newark Mayor Los Angeles mayor declares local emergency and curfew amid ongoing unrest Los Angeles mayor declares local emergency and curfew amid ongoing unrest Protesters clash with police in Chicago during anti-ICE demonstration Protesters clash with police in Chicago during anti-ICE demonstration Mother lied in Delaware Amber Alert; Nola Dinkins case now a homicide probe Mother lied in Delaware Amber Alert; Nola Dinkins case now a homicide probe Mother lied in Delaware Amber Alert; Nola Dinkins case now a homicide probe Mother lied in Delaware Amber Alert; Nola Dinkins case now a homicide probe Delaware Amber Alert: Nola Dinkins abducted by armed man and woman Delaware Amber Alert: Nola Dinkins abducted by armed man and woman Delaware Amber Alert: Nola Dinkins abducted by armed man and woman Delaware Amber Alert: Nola Dinkins abducted by armed man and woman Rep. McIver indicted for blocking ICE arrest of Newark Mayor Rep. McIver indicted for blocking ICE arrest of Newark Mayor Rep. McIver indicted for blocking ICE arrest of Newark Mayor Rep. McIver indicted for blocking ICE arrest of Newark Mayor Los Angeles mayor declares local emergency and curfew amid ongoing unrest Los Angeles mayor declares local emergency and curfew amid ongoing unrest Los Angeles mayor declares local emergency and curfew amid ongoing unrest Los Angeles mayor declares local emergency and curfew amid ongoing unrest Protesters clash with police in Chicago during anti-ICE demonstration Protesters clash with police in Chicago during anti-ICE demonstration Protesters clash with police in Chicago during anti-ICE demonstration Protesters clash with police in Chicago during anti-ICE demonstration WorldDeath toll rises to 11 in Austria school shooting, including suspectMunicipal building in western Mexico hit by drone-dropped explosivesLATAM flight aborts takeoff in Santiago, Chile after engine fireBarbara becomes 1st hurricane of Eastern Pacific season2 tropical storms form in Eastern Pacific Death toll rises to 11 in Austria school shooting, including suspect Death toll rises to 11 in Austria school shooting, including suspect Municipal building in western Mexico hit by drone-dropped explosives Municipal building in western Mexico hit by drone-dropped explosives LATAM flight aborts takeoff in Santiago, Chile after engine fire LATAM flight aborts takeoff in Santiago, Chile after engine fire Barbara becomes 1st hurricane of Eastern Pacific season Barbara becomes 1st hurricane of Eastern Pacific season 2 tropical storms form in Eastern Pacific 2 tropical storms form in Eastern Pacific Death toll rises to 11 in Austria school shooting, including suspect Death toll rises to 11 in Austria school shooting, including suspect Death toll rises to 11 in Austria school shooting, including suspect Death toll rises to 11 in Austria school shooting, including suspect Municipal building in western Mexico hit by drone-dropped explosives Municipal building in western Mexico hit by drone-dropped explosives Municipal building in western Mexico hit by drone-dropped explosives Municipal building in western Mexico hit by drone-dropped explosives LATAM flight aborts takeoff in Santiago, Chile after engine fire LATAM flight aborts takeoff in Santiago, Chile after engine fire LATAM flight aborts takeoff in Santiago, Chile after engine fire LATAM flight aborts takeoff in Santiago, Chile after engine fire Barbara becomes 1st hurricane of Eastern Pacific season Barbara becomes 1st hurricane of Eastern Pacific season Barbara becomes 1st hurricane of Eastern Pacific season Barbara becomes 1st hurricane of Eastern Pacific season 2 tropical storms form in Eastern Pacific 2 tropical storms form in Eastern Pacific 2 tropical storms form in Eastern Pacific 2 tropical storms form in Eastern Pacific PoliticsRep. McIver indicted for blocking ICE arrest of Newark MayorNewsom files emergency court request to block troop deployment in L.A.Pentagon deploying additional 2,000 troops to Los AngelesCalifornia sues Trump over federalization of National Guard amid L.A. unrestTimeline of a breakdown: Musk turns on Trump over spending bill Rep. McIver indicted for blocking ICE arrest of Newark Mayor Rep. McIver indicted for blocking ICE arrest of Newark Mayor Newsom files emergency court request to block troop deployment in L.A. Newsom files emergency court request to block troop deployment in L.A. Pentagon deploying additional 2,000 troops to Los Angeles Pentagon deploying additional 2,000 troops to Los Angeles California sues Trump over federalization of National Guard amid L.A. unrest California sues Trump over federalization of National Guard amid L.A. unrest Timeline of a breakdown: Musk turns on Trump over spending bill Timeline of a breakdown: Musk turns on Trump over spending bill Rep. McIver indicted for blocking ICE arrest of Newark Mayor Rep. McIver indicted for blocking ICE arrest of Newark Mayor Rep. McIver indicted for blocking ICE arrest of Newark Mayor Rep. McIver indicted for blocking ICE arrest of Newark Mayor Newsom files emergency court request to block troop deployment in L.A. Newsom files emergency court request to block troop deployment in L.A. Newsom files emergency court request to block troop deployment in L.A. Newsom files emergency court request to block troop deployment in L.A. Pentagon deploying additional 2,000 troops to Los Angeles Pentagon deploying additional 2,000 troops to Los Angeles Pentagon deploying additional 2,000 troops to Los Angeles Pentagon deploying additional 2,000 troops to Los Angeles California sues Trump over federalization of National Guard amid L.A. unrest California sues Trump over federalization of National Guard amid L.A. unrest California sues Trump over federalization of National Guard amid L.A. unrest California sues Trump over federalization of National Guard amid L.A. unrest Timeline of a breakdown: Musk turns on Trump over spending bill Timeline of a breakdown: Musk turns on Trump over spending bill Timeline of a breakdown: Musk turns on Trump over spending bill Timeline of a breakdown: Musk turns on Trump over spending bill LegalMother lied in Delaware Amber Alert; Nola Dinkins case now a homicide probeDelaware Amber Alert: Nola Dinkins abducted by armed man and womanRep. McIver indicted for blocking ICE arrest of Newark MayorCanadian resident extradited to U.S. over ISIS plot targeting Jewish center in NYCCalifornia man sentenced for threatening to kill postal workers in U.S. Virgin Islands Mother lied in Delaware Amber Alert; Nola Dinkins case now a homicide probe Mother lied in Delaware Amber Alert; Nola Dinkins case now a homicide probe Delaware Amber Alert: Nola Dinkins abducted by armed man and woman Delaware Amber Alert: Nola Dinkins abducted by armed man and woman Rep. McIver indicted for blocking ICE arrest of Newark Mayor Rep. McIver indicted for blocking ICE arrest of Newark Mayor Canadian resident extradited to U.S. over ISIS plot targeting Jewish center in NYC Canadian resident extradited to U.S. over ISIS plot targeting Jewish center in NYC California man sentenced for threatening to kill postal workers in U.S. Virgin Islands California man sentenced for threatening to kill postal workers in U.S. Virgin Islands Mother lied in Delaware Amber Alert; Nola Dinkins case now a homicide probe Mother lied in Delaware Amber Alert; Nola Dinkins case now a homicide probe Mother lied in Delaware Amber Alert; Nola Dinkins case now a homicide probe Mother lied in Delaware Amber Alert; Nola Dinkins case now a homicide probe Delaware Amber Alert: Nola Dinkins abducted by armed man and woman Delaware Amber Alert: Nola Dinkins abducted by armed man and woman Delaware Amber Alert: Nola Dinkins abducted by armed man and woman Delaware Amber Alert: Nola Dinkins abducted by armed man and woman Rep. McIver indicted for blocking ICE arrest of Newark Mayor Rep. McIver indicted for blocking ICE arrest of Newark Mayor Rep. McIver indicted for blocking ICE arrest of Newark Mayor Rep. McIver indicted for blocking ICE arrest of Newark Mayor Canadian resident extradited to U.S. over ISIS plot targeting Jewish center in NYC Canadian resident extradited to U.S. over ISIS plot targeting Jewish center in NYC Canadian resident extradited to U.S. over ISIS plot targeting Jewish center in NYC Canadian resident extradited to U.S. over ISIS plot targeting Jewish center in NYC California man sentenced for threatening to kill postal workers in U.S. Virgin Islands California man sentenced for threatening to kill postal workers in U.S. Virgin Islands California man sentenced for threatening to kill postal workers in U.S. Virgin Islands California man sentenced for threatening to kill postal workers in U.S. Virgin Islands Health BusinessTrump signs executive order to lift restrictions on supersonic flights in the U.S.Scaling Your Online Business? Don’t Ignore These Logistics PitfallsWhat are the Insights Every Trader Must Gauge from Intraday Screener?Victoria’s Secret takes website offline after security incidentSpaceX reflies Super Heavy booster for the 1st time; Starship lost on reentry Trump signs executive order to lift restrictions on supersonic flights in the U.S. Trump signs executive order to lift restrictions on supersonic flights in the U.S. Scaling Your Online Business? Don’t Ignore These Logistics Pitfalls Scaling Your Online Business? Don’t Ignore These Logistics Pitfalls What are the Insights Every Trader Must Gauge from Intraday Screener? What are the Insights Every Trader Must Gauge from Intraday Screener? Victoria’s Secret takes website offline after security incident Victoria’s Secret takes website offline after security incident SpaceX reflies Super Heavy booster for the 1st time; Starship lost on reentry SpaceX reflies Super Heavy booster for the 1st time; Starship lost on reentry Trump signs executive order to lift restrictions on supersonic flights in the U.S. Trump signs executive order to lift restrictions on supersonic flights in the U.S. Trump signs executive order to lift restrictions on supersonic flights in the U.S. Trump signs executive order to lift restrictions on supersonic flights in the U.S. Scaling Your Online Business? Don’t Ignore These Logistics Pitfalls Scaling Your Online Business? Don’t Ignore These Logistics Pitfalls Scaling Your Online Business? Don’t Ignore These Logistics Pitfalls Scaling Your Online Business? Don’t Ignore These Logistics Pitfalls What are the Insights Every Trader Must Gauge from Intraday Screener? What are the Insights Every Trader Must Gauge from Intraday Screener? What are the Insights Every Trader Must Gauge from Intraday Screener? What are the Insights Every Trader Must Gauge from Intraday Screener? Victoria’s Secret takes website offline after security incident Victoria’s Secret takes website offline after security incident Victoria’s Secret takes website offline after security incident Victoria’s Secret takes website offline after security incident SpaceX reflies Super Heavy booster for the 1st time; Starship lost on reentry SpaceX reflies Super Heavy booster for the 1st time; Starship lost on reentry SpaceX reflies Super Heavy booster for the 1st time; Starship lost on reentry SpaceX reflies Super Heavy booster for the 1st time; Starship lost on reentry Entertainment MenuContact UsE-mail alertsBNO News Wire ServiceENS Alerts Contact Us E-mail alerts BNO News Wire Service ENS Alerts Contact Us E-mail alerts BNO News Wire Service ENS Alerts Live feeds **Legal** **California man sentenced for threatening to kill postal workers in U.S. Virgin Islands** Published on By Share Share Tweet Tweet A California man has been sentenced to eight months in prison for threatening to kill U.S. Postal Service employees in the U.S. Virgin Islands, federal prosecutors said. The threats stemmed from the alleged non-delivery of marijuana-containing packages. On Friday, Simon Peters, 42, was sentenced to eight months in prison and 30 months of supervised release. He had pleaded guilty on February 18 to one count of making threats against public officials. The U.S. Attorney’s Office for the District of the Virgin IslandssaidPeters called the Ottley Post Office in St. Thomas, USVI, on January 27, 2024, and issued multiple death threats toward a postal carrier. Among the threats, Peters reportedly said: “Make sure the fat boy know, we’re watching him and next time we’re going to kill him behind the building” and “Any more packages from California go missing, you will see what happen to the co-workers dem … one by one.” Two days later, Peters called again and continued making threats. When asked why he wanted to speak to the delivery driver, Peters said, “To let the people know what’s going on in the Virgin Islands. We got people driving around looking for him, and you gon hear him get gun shots in his [expletive] ass.” He also claimed to have been “doing this for over 10 years now.” As a result of the threats, USPS temporarily suspended mail delivery to Kirwan Terrace for two days and brought in agents from other jurisdictions to escort carriers. A private security firm was also hired to provide additional protection at local post offices. The U.S. Postal Inspection Service tracked the calls to California, where Peters was located and arrested before being transferred to the Virgin Islands for prosecution. The investigation was led by USPIS with assistance from the FBI, DEA, HSI, U.S. Marshals Service, U.S. Customs and Border Protection, and the Virgin Islands Police Department. Latest **Mother lied in Delaware Amber Alert; Nola Dinkins case now a homicide probe** **Mother lied in Delaware Amber Alert; Nola Dinkins case now a homicide probe** **Delaware Amber Alert: Nola Dinkins abducted by armed man and woman** **Delaware Amber Alert: Nola Dinkins abducted by armed man and woman** **Rep. McIver indicted for blocking ICE arrest of Newark Mayor** **Rep. McIver indicted for blocking ICE arrest of Newark Mayor** **Los Angeles mayor declares local emergency and curfew amid ongoing unrest** **Los Angeles mayor declares local emergency and curfew amid ongoing unrest** Trending **2 people killed, including YouTuber, in Las Vegas Strip shooting** **2 people killed, including YouTuber, in Las Vegas Strip shooting** **Damaging tornado reported in the Quad Cities region** **Damaging tornado reported in the Quad Cities region** **Observed tornado warning issued for Lubbock, Texas** **Observed tornado warning issued for Lubbock, Texas** Legal3 days ago2 people killed, including YouTuber, in Las Vegas Strip shooting 2 people killed, including YouTuber, in Las Vegas Strip shooting Legal3 days ago2 people killed, including YouTuber, in Las Vegas Strip shooting 2 people killed, including YouTuber, in Las Vegas Strip shooting 2 people killed, including YouTuber, in Las Vegas Strip shooting US News1 week agoDamaging tornado reported in the Quad Cities region Damaging tornado reported in the Quad Cities region US News1 week agoDamaging tornado reported in the Quad Cities region Damaging tornado reported in the Quad Cities region Damaging tornado reported in the Quad Cities region US News6 days agoObserved tornado warning issued for Lubbock, Texas Observed tornado warning issued for Lubbock, Texas US News6 days agoObserved tornado warning issued for Lubbock, Texas Observed tornado warning issued for Lubbock, Texas Observed tornado warning issued for Lubbock, Texas US News3 days agoSkydiving plane carrying 20 people crashes in Tullahoma, Tennessee Skydiving plane carrying 20 people crashes in Tullahoma, Tennessee US News3 days agoSkydiving plane carrying 20 people crashes in Tullahoma, Tennessee Skydiving plane carrying 20 people crashes in Tullahoma, Tennessee Skydiving plane carrying 20 people crashes in Tullahoma, Tennessee US News1 week agoTornado reported near Norman, Oklahoma Tornado reported near Norman, Oklahoma US News1 week agoTornado reported near Norman, Oklahoma Tornado reported near Norman, Oklahoma Tornado reported near Norman, Oklahoma Politics7 days agoTrump signs new travel ban affecting nearly 20 countries Trump signs new travel ban affecting nearly 20 countries Politics7 days agoTrump signs new travel ban affecting nearly 20 countries Trump signs new travel ban affecting nearly 20 countries Trump signs new travel ban affecting nearly 20 countries Legal5 days agoFamily of four found dead in suspected murder-suicide in Virginia Family of four found dead in suspected murder-suicide in Virginia Legal5 days agoFamily of four found dead in suspected murder-suicide in Virginia Family of four found dead in suspected murder-suicide in Virginia Family of four found dead in suspected murder-suicide in Virginia Health1 week agoJapan records lowest-ever birth rate as population decline continues Japan records lowest-ever birth rate as population decline continues Health1 week agoJapan records lowest-ever birth rate as population decline continues Japan records lowest-ever birth rate as population decline continues Japan records lowest-ever birth rate as population decline continues Copyright © 2025 BNO News, B.V. All rights reserved.About Us|Privacy Policy|Terms|BNO en Español|Contact Us"}