{"id": 2230, "name": "The Daily Wasp", "domain": "thedailywasp.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://thedailywasp.com/2024/06/03/vp-harris-presides-over-senate-chamber-because-shes-got-nothing-else-to-do/", "title": "Vp Harris Presides Over Senate Chamber Because Shes Got Nothing Else To Do", "content": "The Daily Wasp Stinging satire. Biting humor. Home “I’ve been very successful in not creating any sort of legacy.” (WASHINGTON, D.C.) Vice President Kamala Harris dropped in the Senate to preside over its proceedings on Monday because she doesn’t have anything else to do. “I’ve got to try and make myself useful because, after all, I’m still getting a taxpayer-paid salary,” the Veep told reporters as she made her way to the chamber where she once served. “I would like to have more to do, but I didn’t feel like waking the president up at noon to assign me something,” she confessed. Asked about her roles in handling the border crisis and being named to head up the National Space Council, Harris said that those were “merely ceremonial” and added that “no one really expected me to do anything in those capacities.” She noted further: “And I’ve been very successful in not creating any sort of legacy for myself.” **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook **Like this:** **Leave a ReplyCancel reply** **Recent Posts** CongressVP Harris Presides Over Senate Chamber Because She’s Got Nothing Else To DoJune 3, 2024 **VP Harris Presides Over Senate Chamber Because She’s Got Nothing Else To Do** **VP Harris Presides Over Senate Chamber Because She’s Got Nothing Else To Do** CongressMaxine Waters Reacts After House Committee Witness Calls Her ‘Sweetest Member Of Congress’June 3, 2024 **Maxine Waters Reacts After House Committee Witness Calls Her ‘Sweetest Member Of Congress’** **Maxine Waters Reacts After House Committee Witness Calls Her ‘Sweetest Member Of Congress’** ElectionsBiden Signs Executive Order Directing His Campaign To Hire Trump’s Campaign ManagersApril 28, 2024 **Biden Signs Executive Order Directing His Campaign To Hire Trump’s Campaign Managers** **Biden Signs Executive Order Directing His Campaign To Hire Trump’s Campaign Managers** **Trending** CongressMaxine Waters Reacts After House Committee Witness Calls Her ‘Sweetest Member Of Congress’Sandra D **Maxine Waters Reacts After House Committee Witness Calls Her ‘Sweetest Member Of Congress’** **Maxine Waters Reacts After House Committee Witness Calls Her ‘Sweetest Member Of Congress’** ElectionsBiden Signs Executive Order Directing His Campaign To Hire Trump’s Campaign ManagersEditorial Staff **Biden Signs Executive Order Directing His Campaign To Hire Trump’s Campaign Managers** **Biden Signs Executive Order Directing His Campaign To Hire Trump’s Campaign Managers** GovernmentVP Harris Makes Biden Call Hubby To Tell Him She’s Working Late AgainSandra D **VP Harris Makes Biden Call Hubby To Tell Him She’s Working Late Again** **VP Harris Makes Biden Call Hubby To Tell Him She’s Working Late Again** WorldUkraine’s Zelensky Inks Deal With Biden To Give Back All Military Equipment Russia Doesn’t DestroyFrank B **Ukraine’s Zelensky Inks Deal With Biden To Give Back All Military Equipment Russia Doesn’t Destroy** **Ukraine’s Zelensky Inks Deal With Biden To Give Back All Military Equipment Russia Doesn’t Destroy** The Daily WaspStinging satire. Biting humor. Home (c) 2022-2024 The Daily Wasp. All rights reserved. **Discover more from The Daily Wasp** Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading"}