{"id": 1905, "name": "California Globe", "domain": "californiaglobe.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://californiaglobe.com/fr/president-trumps-stark-25th-amendment-warning-on-joe-bidens-cognitive-condition-and-vp-kamala-harris-constitutional-obligatory-failure/", "title": "President Trumps Stark 25th Amendment Warning On Joe Bidens Cognitive Condition And Vp Kamala Harris Constitutional Obligatory Failure", "content": "Governor Legislature Local National Hollywood Opinion **President Trump’s Stark 25th Amendment Warning on Joe Biden’s Cognitive Condition and VP Kamala Harris’ Constitutional Obligatory Failure** Vice President Kamala Harris stood by and watched these deadly decisions being made ByKatie Zacharia, June 3, 2025 3:14 pm On January 12, 2021, then-President Donald J. Trump issued a stark warning: “The 25th Amendment is of zero risk to me, but will come back to haunt Joe Biden and the Biden administration. As the expression goes, “Be careful what you wish for”. Nearly four years later, that warning has materialized with disturbing clarity. President Joe Biden’s cognitive decline, operational failures, and policy missteps have deeply damaged American security, global credibility, and have cost countless lives. Vice President Kamala Harris—armed with the constitutional authority to intervene under the 25th Amendment—stood idle. The signs of Biden’s unfitness were never subtle. Surfacing now are reports such as those from Senator Josh Hawley, who relayed a Secret Service agent’s account that Biden would sometimes“get lost in his closet” in the mornings, reflecting a White House operating in quiet crisis. Public appearances were stage-managed at best, if we were lucky enough for then-President Joe Biden to find his way off the stage, press interactions were rare and filtered, and speeches frequently were derailed by confusion or memory lapses. TheHur Reportaudio details a devastating situation that revealed the utter mental collapse of our then-Commander-in-Chief.EvenCNN’s Jake Tapper admitted,“It is a scandal. It is without question – and maybe even worse than Watergate in some ways”. But Harris’s inaction is completely indefensible when viewed through the lens of Biden’s policy disasters. The botched withdrawal from Afghanistan in August of 2021 resulted in the deaths of 13 U.S. service members, the abandonment of American citizens and allies, and the surrender of billions in military equipment to the Taliban. Biden, at the near inception of his presidency, was visibly confused and disengaged in the aftermath and completely failed to project leadership at a moment of international crisis. Where was the mainstream media to hold Biden accountable? Silent. Allegedly, Kamala Harris was busy with her border czar duties…another mess that President Donald J. Trump is having to clean up…and with great resistance from the judiciary! Then came Biden’s rescinding of sanctions of President Donald Trump’s restored U.N. sanctions onIran. Additionally, Biden waived sanctions on the company building the controversial gas pipeline between Russia and Germany, theNord Stream 2 pipeline,and also lifted sanctions on the executive, an ally of Russia’s Vladimir Putin, who led the firm behind the Nord Stream 2 project. For those who have read the infamousBurisma Report, this should come as no shock. These weren’t just geopolitical miscalculations—they were lethal accelerants. Lifting pressure off Tehran empowered a regime that ultimately backed and funded Hamas and Hezbollah, ultimately leading to the barbaric October 7th attacks on Israel. Ending sanctions on Nord Stream 2 emboldened Putin, clearing the path for the invasion of Ukraine, where hundreds of thousands have died. These weren’t coincidences; they were the predictable results of appeasement masquerading as diplomacy—led by a president whose judgment and cognitive capacity were all in serious question. Meanwhile, Vice President Harris stood by and watched these deadly decisions being made. Then there’s the cultural and constitutional confusion that has highlighted more of Biden’s mental incapacity, of which American girls nationwide are suffering from (and yet another problem that President Trump has to fix). On March 22, 2022, during the confirmation hearing for Supreme Court nominee Ketanji Brown Jackson, Sen. Marsha Blackburn asked a straightforward question:“Can you define the word ‘woman’?” Jackson’s reply:“I can’t… I’m not a biologist.” That moment—broadcast for the world—crystallized a seismic issue. If a Supreme Court justice nominee cannot or will not define something as basic and foundational as what a woman is, how can we trust anything that the Biden Administration did without a full and complete investigation intoevery single decision. ​​Further, the open-border disaster has brought consequences far beyond policy miscalculations. Under the Biden-Harris administration, over7.3 million illegal immigrants have crossed into our country—including thousands from known criminal networks such as the Venezuelan-basedTren de Araguagang. Many lives have been lost from Biden’s failures.Laken Riley, a Georgia nursing student, andRachel Morin, a Maryland mother of five—were brutally murdered by illegal aliens. Then there was Travis Wolfe, a 12-year-old boy from Missouri, was riding with his parents when their car was struck head-on by illegal alien from Venezuela.These tragedies, among many others, were avoidable and were the direct result of Biden’s reckless open-border policies and Harris’s refusal to act in her designated role as “border czar” or in her power to invoke the 25thAmendment. This isn’t just about President Biden’s age or verbal slip-ups. It’s about a string of failures—strategic, moral, and constitutional—that have weakened America at home and created chaos abroad. Vice President Kamala Harris, seeing these issues firsthand, had a duty underSection 4 of the 25th Amendmentto act when President Biden became “unable to discharge the powers and duties of his office.” She chosenotto. President Trump did not mince words when he warned the world of Biden’s cognitive decline. The Constitution provided a solution and then-Vice President Kamala Harris ignored both. She preserved political standing at the expense of national security, global stability, and constitutional responsibility. The tragedies that we are facing around the world are the responsibility of those who swore an oath to defend the United States of America and failed to do so. History will not look kindly on this silence. When courage was required, Harris chose complicity. Kamala Harris has no place in politics and she should be held responsible for her failure to invoke the 25th Amendment due to then-President Joe Biden’s mental incapacitation. Author Recent Posts President Trump’s Stark 25th Amendment Warning on Joe Biden’s Cognitive Condition and VP Kamala Harris’ Constitutional Obligatory Failure- June 3, 2025 California’s Leadership Crisis: The Arc of Insanity Continues- January 12, 2025 Why Incumbent Congressional Representatives Michelle Steel and John Duarte Should Have Won- January 6, 2025 **RELATED ARTICLES** Sacramento Mayor Darrell Steinberg Endorses Joe Biden for PresidentMarch 2, 2020 Long Beach Mayor Robert Garcia Endorses Joe Biden for PresidentMarch 3, 2020 President Kamala Harris Would Ban Your GunsMay 15, 2019 **Post navigation** **One thought on “President Trump’s Stark 25th Amendment Warning on Joe Biden’s Cognitive Condition and VP Kamala Harris’ Constitutional Obligatory Failure”** Evan Corstorphinesays:June 7, 2025 at 2:41 pmEveryone, I think the vast majority of reporting since Jan 20 misunderstands and dramatically underestimates the breadth and scope of what happened over the last four years. We all know he was cooked when he took office. This is something I repeatedly discussed in 2019/2020. Now everyone points at it being “Biden” did this, “Biden” did that in 2021-2024, yet what everyone should be figuring out by now is that it was the unelected politburo of handlers surrounding JRB that made the disastrous decisions referred to in this article FROM THE VERY START. What did they have to lose? Use the autopen, feed him his lines, curate what he sees and who he can speak with, and they had all the power of the most powerful office in the world to execute the most radical leftist, destructive set of policies in history, all with zero accountability. Don’t buy into this false narrative that it was just 2023 and 2024. It was this way from the start, and if you accept that, then a lot of the actions “he” took make a lot more sense when put in context with his past statements and positions. And Jill Biden? She has to be one of the most selfish, manipulative people on this planet to play make-believe with her impaired husband on the world stage, and still try to continue the charade for another four years. Unfriggingbelievable.Reply Everyone, I think the vast majority of reporting since Jan 20 misunderstands and dramatically underestimates the breadth and scope of what happened over the last four years. We all know he was cooked when he took office. This is something I repeatedly discussed in 2019/2020. Now everyone points at it being “Biden” did this, “Biden” did that in 2021-2024, yet what everyone should be figuring out by now is that it was the unelected politburo of handlers surrounding JRB that made the disastrous decisions referred to in this article FROM THE VERY START. What did they have to lose? Use the autopen, feed him his lines, curate what he sees and who he can speak with, and they had all the power of the most powerful office in the world to execute the most radical leftist, destructive set of policies in history, all with zero accountability. Don’t buy into this false narrative that it was just 2023 and 2024. It was this way from the start, and if you accept that, then a lot of the actions “he” took make a lot more sense when put in context with his past statements and positions. And Jill Biden? She has to be one of the most selfish, manipulative people on this planet to play make-believe with her impaired husband on the world stage, and still try to continue the charade for another four years. Unfriggingbelievable. Everyone, I think the vast majority of reporting since Jan 20 misunderstands and dramatically underestimates the breadth and scope of what happened over the last four years. We all know he was cooked when he took office. This is something I repeatedly discussed in 2019/2020. Now everyone points at it being “Biden” did this, “Biden” did that in 2021-2024, yet what everyone should be figuring out by now is that it was the unelected politburo of handlers surrounding JRB that made the disastrous decisions referred to in this article FROM THE VERY START. What did they have to lose? Use the autopen, feed him his lines, curate what he sees and who he can speak with, and they had all the power of the most powerful office in the world to execute the most radical leftist, destructive set of policies in history, all with zero accountability. Don’t buy into this false narrative that it was just 2023 and 2024. It was this way from the start, and if you accept that, then a lot of the actions “he” took make a lot more sense when put in context with his past statements and positions. And Jill Biden? She has to be one of the most selfish, manipulative people on this planet to play make-believe with her impaired husband on the world stage, and still try to continue the charade for another four years. Unfriggingbelievable. **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website About Us Terms & Conditions Privacy Policy Advertise with us You can see how this popup was set up in our step-by-step guide: https://wppopupmaker.com/guides/auto-opening-announcement-popups/ You can see how this popup was set up in our step-by-step guide: https://wppopupmaker.com/guides/auto-opening-announcement-popups/"}