{"id": 1233, "name": "Alliance For Securing Democracy", "domain": "securingdemocracy.gmfus.org", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://securingdemocracy.gmfus.org/the-states-of-foreign-information-operations-a-state-by-state-look-at-foreign-information-manipulation-in-the-united-states/", "title": "The States Of Foreign Information Operations A State By State Look At Foreign Information Manipulation In The United States", "content": "About UsMission StatementTeamSupporters Mission Statement Team Supporters Mission Statement Team Supporters Our WorkFocus AreasInformation ManipulationRussia’s War in UkraineElections2024 US Elections2022 US Midterm Elections2022 French Election2021 German ElectionsMalign FinanceEmerging TechnologyCybersecurityThreat ActorsChinaIranRussiaPublicationsInterference Matters BlogPolicy PapersHamilton Reports Focus AreasInformation ManipulationRussia’s War in UkraineElections2024 US Elections2022 US Midterm Elections2022 French Election2021 German ElectionsMalign FinanceEmerging TechnologyCybersecurity Information Manipulation Russia’s War in Ukraine Elections2024 US Elections2022 US Midterm Elections2022 French Election2021 German Elections 2024 US Elections 2022 US Midterm Elections 2022 French Election 2021 German Elections Malign Finance Emerging Technology Cybersecurity Threat ActorsChinaIranRussia China Iran Russia PublicationsInterference Matters BlogPolicy PapersHamilton Reports Interference Matters Blog Policy Papers Hamilton Reports Focus AreasInformation ManipulationRussia’s War in UkraineElections2024 US Elections2022 US Midterm Elections2022 French Election2021 German ElectionsMalign FinanceEmerging TechnologyCybersecurity Information Manipulation Russia’s War in Ukraine Elections2024 US Elections2022 US Midterm Elections2022 French Election2021 German Elections 2024 US Elections 2022 US Midterm Elections 2022 French Election 2021 German Elections Malign Finance Emerging Technology Cybersecurity Information Manipulation Russia’s War in Ukraine Elections2024 US Elections2022 US Midterm Elections2022 French Election2021 German Elections 2024 US Elections 2022 US Midterm Elections 2022 French Election 2021 German Elections 2024 US Elections 2022 US Midterm Elections 2022 French Election 2021 German Elections Malign Finance Emerging Technology Cybersecurity Threat ActorsChinaIranRussia China Iran Russia China Iran Russia PublicationsInterference Matters BlogPolicy PapersHamilton Reports Interference Matters Blog Policy Papers Hamilton Reports Interference Matters Blog Policy Papers Hamilton Reports ToolboxAuthoritarian Interference TrackerHamilton 2.0 DashboardInformation Integrity MapInformation LaundromatWar In Ukraine: Military BloggersInformation Operation Archive Authoritarian Interference Tracker Hamilton 2.0 Dashboard Information Integrity Map Information Laundromat War In Ukraine: Military Bloggers Information Operation Archive Authoritarian Interference Tracker Hamilton 2.0 Dashboard Information Integrity Map Information Laundromat War In Ukraine: Military Bloggers Information Operation Archive PressEventsIn the NewsNewslettersPress Releases Events In the News Newsletters Press Releases Events In the News Newsletters Press Releases Sign Up Donate About Us Our Work In the News Events Toolbox **The State(s) of Foreign Information Operations: A State-by-State Look at Foreign Information Manipulation in the United States** **Introduction** It is easy to dismiss foreign information operations as playing out at the national level, designed to influence federal policymakers and Beltway insiders. But these threats transcend the “Beltway Bubble”. Increasingly, foreign nation-state actors are running operations that exploit trust in local sources and impact state and local communities. US adversaries like Russia, China, and Iran are refining their information tools and tactics to better target individuals and exacerbate divisions within the United States to destabilize the country at home and weaken it on the world stage. These nation states are increasingly exploiting domestic actors to launder and manipulate content that originates in Moscow, Beijing, and Tehran and ultimately reaches American audiences who have no way of knowing they are on the receiving end of foreign information operations. They are also experimenting with generative artificial intelligence (AI), which, according tothe US intelligence community, has allowed nation-state actors to “improve and accelerate” their operations, potentially enabling them to reach more Americans with more targeted content. Adversaries understand that state and local governments and communities are foundational to the strength of American democracy, so it is no surprise that they have targeted individuals and issues at the local level. In some cases, adversarial nations seek favorable outcomes around local policy issues; in others, they use local debates as Trojan horses to advance their broader geopolitical agendas. In others still, they attempt to influence views on the integrity of US elections and institutions or disenfranchise American citizens in specific communities to destabilize and erode trust in American democracy. But in all cases, American democratic discourse and the country’s information space—messy as they can sometimes be—are being used as primary vectors to advance foreign interests. If Americans lack that understanding, their communities—and the country—are left vulnerable. This report outlines an example of a foreign information operation targeting each of the 50 US states and the District of Columbia. Each case study indicates the foreign threat actor (if known) and explains the tools, tactics, and motivations for targeting Americans at the state and local level. Download the PDF **Related Posts** About Us Our Work Policy Papers Interference Matters In the News Events Toolbox Media Inquiries Contact Career Opportunities **You Can HelpSecure Democracy.** Accept"}