{"id": 166, "name": "Encyclopedia Britannica", "domain": "britannica.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.britannica.com/question/When-can-the-U-S-president-deploy-the-National-Guard", "title": "When Can The U S President Deploy The National Guard", "content": "Home History & Society Science & Tech Biographies Animals & Nature Geography & Travel Arts & Culture ProCon Money Games & Quizzes Videos On This Day One Good Fact Dictionary New Articles Lifestyles & Social Issues Philosophy & Religion Politics, Law & Government World History Health & Medicine Science Technology Browse Biographies Birds, Reptiles & Other Vertebrates Bugs, Mollusks & Other Invertebrates Environment Fossils & Geologic Time Mammals Plants Geography & Travel Entertainment & Pop Culture Literature Sports & Recreation Visual Arts Companions Demystified Image Galleries Lists Podcasts Spotlight Summaries Top Questions #WTFact Britannica Kids Has the U.S. National Guard been deployed without a request from a state governor? **When can the U.S. president deploy the National Guard?** Our editors will review what you’ve submitted and determine whether to revise the article. The U.S. president can deploy the National Guard during rebellion and unrest as well as the threat of invasion. Typically, the president invokes the Insurrection Act. However, there is a specific provision in Title 10 of the U.S. Code on Armed Services that allows for the president to activate the National Guard. This clause can be used when: (1) the United States, or any of the Commonwealths or possessions, is invaded or is in danger of invasion by a foreign nation; (2) there is a rebellion or danger of a rebellion against the authority of the Government of the United States; or (3) the President is unable with the regular forces to execute the laws of the United States. However, the provision also states that “orders for these purposes shall be issued through the governors of the States.” In June 2025 U.S. Pres.Donald Trumpcited the provision when he ordered the deployment of some 2,000 National Guard members to Los Angeles, where there were demonstrations against immigration raids. The legality of the order was questioned since it did not come from California GovernorGavin Newsom, who opposed the deployment. Has the U.S. National Guard been deployed without a request from a state governor?"}