{"id": 925, "name": "Monterey Herald", "domain": "montereyherald.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.montereyherald.com/2025/06/11/49ers-bryce-huff-cant-wait-to-get-after-the-quarterback-stop-the-run-and-just-be-violent/", "title": "49ers Bryce Huff Cant Wait To Get After The Quarterback Stop The Run And Just Be Violent", "content": "e-Edition e-Edition NewsNewsLocal NewsNews AlertsCrime and Public SafetyCourtsBusinessBest ReviewsMarijuanaEducation2020 ElectionEnvironmentHealthHousingTransportationCalifornia News News Local News News Alerts Crime and Public Safety Courts Business Best Reviews Marijuana Education 2020 Election Environment Health Housing Transportation California News News Local News News Alerts Crime and Public Safety Courts Business Best Reviews Marijuana Education 2020 Election Environment Health Housing Transportation California News SportsSportsLocal SportsHigh School SportsAT&T Pebble Beach Pro-AmCollege SportsOakland AthleticsRaidersSan Francisco 49ersSan Francisco GiantsSan Jose SharksGolden State Warriors Sports Local Sports High School Sports AT&T Pebble Beach Pro-Am College Sports Oakland Athletics Raiders San Francisco 49ers San Francisco Giants San Jose Sharks Golden State Warriors Sports Local Sports High School Sports AT&T Pebble Beach Pro-Am College Sports Oakland Athletics Raiders San Francisco 49ers San Francisco Giants San Jose Sharks Golden State Warriors LifestyleLifestyleEntertainmentMoviesRestaurants Food and DrinkHome & GardenComicsPuzzlesEvents Lifestyle Entertainment Movies Restaurants Food and Drink Home & Garden Comics Puzzles Events Lifestyle Entertainment Movies Restaurants Food and Drink Home & Garden Comics Puzzles Events ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary OpinionOpinionColumnistsEditorialsLetters to the Editor Opinion Columnists Editorials Letters to the Editor Opinion Columnists Editorials Letters to the Editor Special Sections AdvertisingAdvertise with UsSponsored ContentPublic Notices Advertise with Us Sponsored Content Public Notices Advertise with Us Sponsored Content Public Notices Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Subscribe Log In Logout Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print Subscribe Log In Sign up for email newsletters Subscribe Log In e-Edition e-Edition Local Sports High School AT&T Pebble Beach Pro-Am College Athletics Raiders 49ers Giants Sharks Warriors Trending: Charges in Zogg Fire dismissed Where ex-Californians go Bill targets high rent deposits Coastline will shrink by 2100 Tax would fund affordable housing **49ers’ Bryce Huff ‘can’t wait to get after the quarterback, stop the run and just be violent’** **Coach Kyle Shanahan calls Bryce Huff the 49ers' most explosive pass rusher since Dee Ford, who Huff studied as a NFL neophyte** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print SANTA CLARA – As Brock Purdy spun and reversed course in a signature move, Bryce Huff came bearing into the pocket with backside pressure. Purdy flicked a short-range completion, Huff breezed by, and the 49ers’ final minicamp practice marched on Thursday without much fanfare. Huff’s ability to quickly disrupt a quarterback, however, is whythe 49ers traded for himnearly two weeks ago from Philadelphia. It’s why the Eagles signed him a year ago to a three-year, $51 million deal. Huff’s style didn’t jibe with the Eagles, who deployed him as a stand-up linebacker with little impact on their Super Bowl charge. He thus anticipated his agent’s call informing him of a trade. “Thankfully it was to San Francisco,” Huff said Thursday, “because I’m very familiar with this scheme.” Huff now reunites with Robert Saleh, his former Jets’ coach who is reprising his 2017-20 role as the 49ers’ defensive coordinator. Undrafted out of Memphis, Huff latched onto the 2020 New York Jets, packed on 20 pounds of muscle the next year, and ultimately thrived in 2023 with 10 sacks. That sold the 2024 Eagles, ‘but it just didn’t work out at the end of the day. You live and you learn,” Huff said. “He will beour best get-off-the-ball guywe’ve had since Dee Ford,” coach Kyle Shanahan said. Ford was acquired in a 2019 trade and his explosive first step proved an ideal complement to Nick Bosa, who became the NFL Defensive Rookie of the Year. A back injury hindered then halted Ford’s career in 2021, about the same time Huff was studying his moves. “We did watch a lot of Dee Ford film in my earlier years in this scheme. He’s definitely a guy I’ve watched a long time,” Huff said. “We have the same type of stride, and that’s something (Saleh) showed me so I can work on my timing with some of my moves.” Saleh, who left his 49ers’ post for the Jets in 2021, is enamored with Huff’s speed and win rate off the line of scrimmage. “He is a second-effort pass rusher but he wins so quickly so often that coordinators have to account for his presence,” Saleh said. Left tackle Trent Williams described Huff as a “speed demon,” and the 49ers figure to use him as a pass-rush specialist while first-round pick Mykel Williams starts opposite Bosa at defensive end in the base package before shifting inside on third down. Huff (6-foot-3, 255 pounds) said he’s “always been a twitchy player,” but he enhanced his explosiveness at Memphis alongside Genard Avery, a 2018 fifth-round pick of the Cleveland Browns. Huff’s “get-off” took another step under the Jets’ help, and another could come in 49ers defensive line coach Kris Kocurek’s Wide-9 scheme. “When we got in the building with the Jets, we let him know if he was going to make it, it was as a defensive end,” Saleh said. “He put on 20-plus pounds of muscle. He really reshaped his body and kept plugging away.” Huff had just 2 1/2 sacks and four quarterback hits in 285 defensive snaps last season. A wrist injury kept him out Weeks 12-16, and although he made a 12-snap cameo in the NFC Championship win, he was inactive in the Super Bowl. “I always have that (chip) on my shoulder because of how I came into the NFL (undrafted in 2020),” Huff said. “It’s really more of a feeling of being grateful for having an opportunity to do what I love, and that’s get off the ball, be aggressive and get after the quarterback. “That’s all I’m thinking about right now. I can’t wait to get back out there on game days and get off out of my stance, get after the quarterback, stop the run, and just be violent. All I’m thinking about is having fun out there.” The past two weeks, Huff has been out there soliciting tips from Bosa. “Just being able to hear what he has to say about certain things within the pass rush or scheme, it’s been cool to chop it up with him every day,” Huff added. “I’m looking forward to working with him this year.” McCAFFREY ON TRACK Running back Christian McCaffrey accomplished his offseason goal of not missing a day of the 49ers’ offseason program, after Achilles and knee injuries limited him to four games last season. “I spent a lot of time building back a base from scratch,” McCaffrey said. “A lot of it was rehab. I wanted to put myself in a position where I didn’t miss a day of OTAs and I could practice and play football again and be healthy, and I did that. I did that, now we can kind of kick back up the training again. I feel great.” McCaffrey’s offseason isn’t about to quiet down. “It will be just getting ready for this season, and having a kid. So also that.” He and his wife, Olivia Culpo, are expecting their first child “right around the corner,” though they didn’t intentionally plan for it come during summer break.Related Articles49ers’ Deommodore Lenoir could be in outside role, but he’ll still be in middle of things49ers’ Trent Williams ‘doing everything physically possible’ to extend career into 40s — including minicamp practiceNine dynamic duos to watch as 49ers enter mandatory minicamp49ers relish Navy SEALs’ visit, workout as they seek new bond this offseasonKurtenbach: I see the vision for the 49ers’ much-maligned offensive line and it’s just fine **Related Articles** 49ers’ Deommodore Lenoir could be in outside role, but he’ll still be in middle of things 49ers’ Trent Williams ‘doing everything physically possible’ to extend career into 40s — including minicamp practice Nine dynamic duos to watch as 49ers enter mandatory minicamp 49ers relish Navy SEALs’ visit, workout as they seek new bond this offseason Kurtenbach: I see the vision for the 49ers’ much-maligned offensive line and it’s just fine **Related Articles** 49ers’ Deommodore Lenoir could be in outside role, but he’ll still be in middle of things 49ers’ Trent Williams ‘doing everything physically possible’ to extend career into 40s — including minicamp practice Nine dynamic duos to watch as 49ers enter mandatory minicamp 49ers relish Navy SEALs’ visit, workout as they seek new bond this offseason Kurtenbach: I see the vision for the 49ers’ much-maligned offensive line and it’s just fine PRACTICE NOTES A day after incumbent kicker Jake Moody made 6-of-7 field-goal attempts, Greg Joseph got a turn and made 7-of-7, the longest coming from 55 yards. … Brock Purdy, who had three passes intercepted Tuesday, had only two incompletions Wednesday, and those came on a drop by Patrick Taylor Jr. and miscommunication by Watkins. … Jaylen Mahoney made the day’s lone interception, on a Mac Jones pass to Jordan Watkins. … Rookie running back Jordan James showed nice burst on the play preceding the interception. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print **RevContent Feed** **Most Popular** Pedestrian killed in early morning crash on Highway 1Pedestrian killed in early morning crash on Highway 1 **Pedestrian killed in early morning crash on Highway 1** **Pedestrian killed in early morning crash on Highway 1** Carmel Unified unveils new five-year planCarmel Unified unveils new five-year plan **Carmel Unified unveils new five-year plan** **Carmel Unified unveils new five-year plan** Local protest planned for today at Window on the BayLocal protest planned for today at Window on the Bay **Local protest planned for today at Window on the Bay** **Local protest planned for today at Window on the Bay** 210 fall athletes to watch over 70 days210 fall athletes to watch over 70 days **210 fall athletes to watch over 70 days** **210 fall athletes to watch over 70 days** Monterey community celebrates La MeriendaMonterey community celebrates La Merienda **Monterey community celebrates La Merienda** **Monterey community celebrates La Merienda** Man cited for setting off illegal fireworks in MarinaMan cited for setting off illegal fireworks in Marina **Man cited for setting off illegal fireworks in Marina** **Man cited for setting off illegal fireworks in Marina** Clipboard: Monterey’s Huang to coach Lakers Summer League teamClipboard: Monterey’s Huang to coach Lakers Summer League team **Clipboard: Monterey’s Huang to coach Lakers Summer League team** **Clipboard: Monterey’s Huang to coach Lakers Summer League team** 210 fall athletes to watch over 70 days210 fall athletes to watch over 70 days **210 fall athletes to watch over 70 days** **210 fall athletes to watch over 70 days** **More in San Francisco 49ers** 49ers’ Deommodore Lenoir could be in outside role, but he’ll still be in middle of things **49ers’ Deommodore Lenoir could be in outside role, but he’ll still be in middle of things** **49ers’ Deommodore Lenoir could be in outside role, but he’ll still be in middle of things** 49ers’ Trent Williams ‘doing everything physically possible’ to extend career into 40s — including minicamp practice **49ers’ Trent Williams ‘doing everything physically possible’ to extend career into 40s — including minicamp practice** **49ers’ Trent Williams ‘doing everything physically possible’ to extend career into 40s — including minicamp practice** Nine dynamic duos to watch as 49ers enter mandatory minicamp **Nine dynamic duos to watch as 49ers enter mandatory minicamp** **Nine dynamic duos to watch as 49ers enter mandatory minicamp** 49ers relish Navy SEALs’ visit, workout as they seek new bond this offseason **49ers relish Navy SEALs’ visit, workout as they seek new bond this offseason** **49ers relish Navy SEALs’ visit, workout as they seek new bond this offseason** 2025 June 11 Subscribee-EditionSign Up For Newsletters e-Edition Sign Up For Newsletters e-Edition Sign Up For Newsletters Contact UsBuy PhotosWork With UsSpecial Sections Buy Photos Work With Us Special Sections Buy Photos Work With Us Special Sections About UsSubmit an ObituaryPrivacy PolicyAccessibilitySitemap Submit an Obituary Privacy Policy Accessibility Sitemap Submit an Obituary Privacy Policy Accessibility Sitemap Advertise With UsToday’s AdsMediaNews Group Advertising Today’s Ads MediaNews Group Advertising Today’s Ads MediaNews Group Advertising ClassifiedsLocal GuideJobsOpen House DirectoryLegal Notices Local Guide Jobs Open House Directory Legal Notices Local Guide Jobs Open House Directory Legal Notices Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}