{"id": 1546, "name": "WalesOnline", "domain": "walesonline.co.uk", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.walesonline.co.uk/sport/football/transfer-news/wrexham-paul-mullin-transfer-championship-31835713#comments-wrapper", "title": "Wrexham Paul Mullin Transfer Championship 31835713#comments Wrapper", "content": "**** **** News Rugby Football What's On More Sport Football Wrexham FC **Paul Mullin tipped to make transfer decision after shutting down Wrexham bust-up rumours** **Ex-Wrexham and Swansea star Lee Trundle has given his verdict on whether Paul Mullin will stay with the Red Dragons after losing his starting spot and being linked with Wigan Athletic** Wrexham talisman Paul Mullin has been tipped to stay and fight for his place in the team despite falling down the pecking order. The striker has been a key figure for the Red Dragons since joining in July 2021, scoring 110 goals in 172 appearances across all competitions. The 30-year-old has also enjoyed a huge boost to his profile during his time with the club owned by Hollywood actorsRyan ReynoldsandRob McElhenney. Mullin regularly features in theWelcome to Wrexhamdocuseries, and he waseven given a cameo by Reynoldsin last year's Deadpool & Wolverine movie. However, the Liverpudlian struggled for form in the first half ofWrexham's recent League One campaign after undergoing back surgery last summer. He wasleft out of the matchday squadentirely in the league after January as boss Phil Parkinsonsigned strikers Sam Smith and Jay Rodriguezto improve his frontline. The decision to freeze him out led torumours of a bust-upbetween the player and the manager. While Mullinmoved to quash the speculation, describing it on social media as \"absolute nonsense\", he has strongly been linked witha move to Wigan Athleticduring the summer transfer window. Mullin's place in the team looks increasingly doubtful after the North Wales side gainedpromotion to the Championshipin April. But former Wrexham andSwanseastrikerLee Trundlehas now backed him to regain his spot after praising his impressive scoring record in previous seasons. Speaking on theFearless in Devotionpodcast, he said: \"If you take the goals that Mulls scores and the amount that he scores, you don't just lose that overnight. He had injuries at the start of the season which kept him out. Welcome to Wrexham is back on Disney+ for a fourth season. Fans can watch the series with a£4.99 monthly plan, or get12 months for the price of 10by paying for a year upfront. \"When you're used to scoring that many goals each season, as soon as you go through that little bad patch, it does affect you as a striker, and it would affect him. He's been the talisman for the team and he's been the one who’s scored all the goals. \"Let's be fair, he's been one of the main reasons for Wrexham's success. He did hit that bad patch, but I do think that he could come back next season, because he's got it in him. I do think that he's a quality player.\" Reports of Wigan's alleged interest in Mullin first emerged in April, when it was claimed Wrexham could be willing to allow him to leave without a transfer fee to smooth his exit. His current contract at the Racecourse Ground runs until the summer of 2027, but letting him go could free up money due to his substantial wage packet. Despite the rumours, Parkinson has insisted that both Mullin and his strike partner Ollie Palmer still have a place at Wrexham. **Sign up to our newsletter! Wrexham is the Game is great new way to get top-class coverage** Wrexham AFC is the arguably the fastest-growing club in the world at the moment thanks to a certain Ryan Reynolds and Rob McElhenney. The Dragons have achieved two consecutive promotions and are cheered on by crowds from not only North Wales but also from all over the globe, thanks to the success of the Disney+ documentary 'Welcome to Wrexham'. But does it have a dedicated, quality source of information piped through to your inbox each week, free of ads but packed with informed opinion, analysis and even a little bit of fun each week? That's where Wrexham is the Game steps in... Available every Wednesday, it provides all the insights you need to be a top red. And for a limited time, a subscription to 'Wrexham is the Game' will cost fans just £15 for the first year. Sign up forWrexham is the Game here Speaking toBBC Sport Waleslast month, the ex-Sunderland boss said: \"First of all, everyone's made a contribution. What level that has been doesn't matter because everybody's been together and contributed. \"Of course, there's always players who would have liked to have played more. Equally, contributions can come in many forms, so I'm delighted with everybody as a group. \"Mulls and Ollie will always be legends at this club for what they've done. They're under contract next year and they'll be back in pre-season ready to go again.\" X (Twitter) Instagram News What's On Rugby Football **Follow Wales Online on socials:** InYourArea mynewsassistant Beauty Box Subscription Yimbly Shop Marketplace Contact Us About Us Work for us Download our e-editions Letters To The Editor Echo Home Delivery Magazines Advertise with Us Our Audience Mirror Bingo Buy a photo How to Complain Corrections and Clarifications Public Notices Terms and Conditions Privacy Notice AI Notice Cookie Notice RSS feeds Newsletters Signup Syndication & Licensing Media Wales Ltd **© 2025 a Reach plc subsidiary** AtReach and across our entitieswe and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the sale or sharing of your data, at any time clicking the \"Do Not Sell or Share my Data\" button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in ourPrivacy NoticeandCookie Notice."}