{"id": 507, "name": "Frontiers in Behavioral Economics", "domain": "frontiersin.org/journals/behavioral-economics", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/behavioral-economics/articles/10.3389/frbhe.2025.1596416/full", "title": "Behavioral Economics", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Behavioral Labor Economics Behavioral Microfoundations Behavioral Public Policy Culture and Ethics Health Behaviors Neuroeconomics Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Behavioral Labor Economics Behavioral Microfoundations Behavioral Public Policy Culture and Ethics Health Behaviors Neuroeconomics Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Behavioral Labor Economics Behavioral Microfoundations Behavioral Public Policy Culture and Ethics Health Behaviors Neuroeconomics Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Behav. Econ., 20 May 2025 Sec. Behavioral Microfoundations Volume 4 - 2025 |https://doi.org/10.3389/frbhe.2025.1596416 **Understanding environmental decision-making in forest restoration: the role of latent attitudes, attribute non-attendance, and choice behavior** Economics Division, Stirling Management School, University of Stirling, Stirling, United Kingdom Introduction:As forests face growing threats from fires, pests, and disease, understanding public preferences for restoration policies has become increasingly urgent. This study addresses the need for more behaviorally realistic approaches in environmental valuation. Methods:A discrete choice experiment was conducted in Korea to explore how individuals make environmental decisions. The study incorporates latent environmental attitudes, attribute non-attendance (ANA), and heterogeneous choice behavior using advanced econometric models, including the independent availability logit and latent class analysis. Results:Findings reveal that respondents do not ignore entire attributes but selectively disregard specific attribute levels. Distinct behavioral classes were identified, ranging from deterministic to probabilistic decision types. Latent attitudes significantly influenced willingness to pay (WTP), with some groups showing reluctance to pay due to self-benefit orientation. Discussion:These results highlight the importance of recognizing behavioral subgroups when designing restoration policies. Integrating behavioral insights into valuation enhances the relevance and acceptability of forest restoration programs. This research provides practical guidance for developing targeted, socially accepted environmental policies. **1 Introduction** Environmental challenges to achieve sustainable ecosystem services for our wellbeing that involve wide-ranging and potentially irreversible consequences are of profound importance (Mendelsohn and Binder, 2013). All important environmental management and policy decisions have a wide range of effects. Understanding how people make environmental choices is crucial for implementing effective management and policy decisions. When it comes to environmental policies, implementing them without knowing the relevant stakeholders' environmental attitudes and latent behaviors is highly uncertain. To reduce the uncertainty of environmental policy, therefore, among the environmental non-market valuation methodologies, the choice experiment (CE) methodology (stated preference) is a very relevant methodology for measuring changes in ecosystem services and welfare changes due to environmental policies. However, individuals differ in their preferences and final decision-making processes and influences concerning these environmental issues. This study attempts to test for the presence or absence of latent environmental decisions, environmental attitudes, and the types of choice-making behaviors that may influence these decisions, as well as the presence or absence of attribute non-attendance (ANA) in these choice-making processes. The choice modeling methods from economics, health, and transportation fields have increased in several research contexts over the recent decades (Mariel et al., 2021;Louviere et al., 2000). In the area of ecosystem services, environmental decisions related to them with which we were closely intertwined are directly and indirectly critical and complex, relying on a single overarching policy component focusing on economic variables in economics is limited to understanding the public environmental behavior. Negative anthropogenic factors that undermine the sustainable provision of ecosystem services from healthy ecosystems, including climate change phenomena, continue to increase yearly. On the global forest issues, regarding the main anthropogenic threats, forests face pressures from deforestation; forest degradation continues to take place at alarming rates; and threats from various anthropogenic causes, including forest fires, exotic invasive species (Zenni et al., 2021), and illegal logging, adversely affect their health and vitality and reduce their ability to provide a full range of goods and ecosystem services. In contrast, trees, forests, and sustainable forestry can help the world recover from and combat looming environmental crises, such as climate change and biodiversity loss (FAO, 2020;Górriz-Mifsud et al., 2016;Torres et al., 2021). Both global forest fires and forest pests and diseases are common environmental threats in Korea as well. Recently, Korean forests have been characterized by growing large-scale forest fires and forest pests and diseases, such as pine wilt disease (PWD;Kwon et al., 2011), causing ecosystem disturbances by invasive species; because it is considered a successful greening story, with a remarkable growing stock more than tripling from 38.36m3/ha in 1990 to 168.7m3in 2021 (KFS, 2023;FAO, 2016;Brown, 2005), this has led experts to propose it as a potential model for forest restoration in developing countries. Considering the current situation in Korea, since the 1980s, more than 12 million pine trees have been infected by PWD and removed to prevent the spread of disease, and forest fires continue to have significant impacts nationally, causing the loss of forest activities, built assets, biodiversity and habitats, and production and productivity, disrupting livelihoods. Therefore, these threats are degrading the ecosystem's capacity to provide ecosystem services, despite forest benefits playing critical roles in directly and indirectly supporting various human wellbeing. Measuring what these threats are and how they cause biodiversity losses, as well as their impact on human welfare, poses an urgent scientific challenge (Taghouti et al., 2024). To make choice scenarios more realistic and better aligned with real-world decision-making contexts in the microeconomic foundations, our behavioral approaches will be enhanced by incorporating extensions of latent class attitudes and choice behaviors (Greene and Hensher, 2003;Weller et al., 2020;Lahoz et al., 2023;Hoedemakers et al., 2022;Lowthian et al., 2021), ANA testing (Gonçalves et al., 2022;Nguyen et al., 2015;Weller et al., 2020,2014;Campbell et al., 2011;Espinosa-Goded et al., 2021), and types of choice decision behaviors (Campbell and Erdem, 2019;Frejinger et al., 2009;Campbell et al., 2012;Manski, 1977). This approach transcends comprehensive, context-specific experiments; methodological advancements; interdisciplinary studies; ethical and societal considerations; and the technological integration of discrete choice analysis in the environmental sector. The focus on environmental behavior and choice decisions in the study is grounded in the idea that behavioral aspects have a more significant influence on environmental choices in practice than purely methodological refinements. By emphasizing this, this research aims to contribute to improving discrete CEs, ultimately advancing the field of realistic choice-making. Based on the literature and the theoretical framework of ecosystem services, we hypothesize that distinct latent classes will emerge, reflecting different environmental attitudes and willingness to pay (WTP) for forest restoration. These latent classes will be identified through the latent class model using the independent availability logit (IAL), which is designed to uncover heterogeneity in preferences that may not be apparent using aggregate models. This study tests the effectiveness and significance of various environmental components—such as choice decision types, ANA, and latent environmental attitudes—in influencing choice behavior in CEs. These elements, which aim to provide a realistic representation of behavior responses within the context of choice experimental data, are assessed using 20 items using a 5-point Likert scale (seeAppendix 2for the specific questions). While the previous literature on CEs, due to the classical multinomial logit (MNL) model, has limitations, this research applies CEs using the independent availability logit model, which is a more realistic alternative to previous experimental surveys because it creates environmental conditions that are as similar as possible to those we decide our daily lives; in addition, a latent class approach using principal component analysis is conducted as well. Hence, this research considers and applies these experimental assumptions and situations to a Korean case study about sustainable ecosystem services with deforested and degraded forests and seeks to find more meaningful realistic, reasonable results. The remainder of our study is structured as follows: a literature review is presented in Section 2. Section 3 then explains the design of the study and our empirical study. Next, Section 4 outlines the hypotheses to be tested in this study and the modeling approach, while Section 5 presents the results. Section 6 concludes with a discussion of their implications. **2 Econometric modeling for exploring decision-making choice decision behaviors** Modeling for environmental choice behavior involving latent class, deterministic, and probabilistic data to set up the most realistic scenario reflecting the main environmental threats—forest fire, forest pests and diseases, and forest invasive species to sustainable ecosystem services—in Asia-Pacific region (FAO, 2020;World Economic Forum, 2023), this research uses to test a three assumption relevant to types of choice behaviors based on the positive forest management policies to deforested and degraded forests in our research. When faced with complicated environmental issues, individuals may encounter various methods to make choices and environmental decisions. These can range from a heuristics approach to probabilistic and deterministic methods. However, the preferences for these methods can vary among individuals. To understand this complicated procedure, this section consists of two main parts to account for our case study. A basic understanding of the MNL with random utility theory and latent class analysis is necessary. The first part starts with the conventional utility maximization framework, which is the most widely used framework, and we specify the utilityU, where respondentsnobtains from alternativeiin choice situationzbe denoted in the usual way asUniz=βn'xniz+εniz+ εniz, wherenizis a vector of observed attributes, βnis a corresponding vector of utility coefficients that vary randomly over individual respondents, and εnizis a random term that represents the unobserved component of utility. The vectorxnizcan include 0 and 1 term to allow for alternative-specific constants and for individual attribute levels, as well as continuous attributes. The unobserved term εnizis assumed to be independent and identically distribution type I (iid) extreme value distribution. Under this assumption, the probability that respondentsnchooses alternativeiin choice situationz, conditional on βn, is the MNL formula model (Equation 1): whereyngives the sequence of choices over theZnchoice occasions for participantsn,yn= [in1,in2, …,inz]. However,Equation 1is inappropriate for our study of IAL application with ANA because it is only applicable in case the basic conditions are met (Campbell and Erdem, 2019). These analytical approaches and outcomes demonstrate that respondents engage in diverse decision-making processes, exhibiting latent, deterministic, and probabilistic behaviors, along with attribute and level non-attendance in their choices. This variation not only enhances the model's overall fit but also significantly impacts WTP estimates. It suggests that respondents evaluate each attribute and alternative individually when navigating complex survey choices. However, most prior studies using IAL models have limited their scope to attribute classes alone, neglecting the influence of other variables. Our study addresses this gap by proposing an improved model with greater explanatory power, incorporating additional variables, such as latent environmental attitudes and overlooked statistical assumptions, to capture more realistic choice behaviors. In the context of this research, traditional MNL models generally assume that all respondents evaluate every alternative, attribute, and level presented—even those they may find unacceptable or irrelevant to their actual preference. Given this situation, several decision-making behaviors can be postulated here. First, suppose some participants who tend to be unknown reasons, however, have an overwhelming preference for the status quo (SQ) of our forest issues and that any change from this SQ baseline is perceived to avoid economic and psychological loss. These respondents may only accept the SQ alternative. Conversely, the other opposite participants, for whatever reason, may have a strong dislike of the SQ (and/or opt-out), in which case they adopt a semi-compensatory choice process with the non-opt-out alternatives comprising their actual consideration set. These participants make their choice among the alternatives in this consideration set following a utility maximization compensatory rule. Given these situations, the standard consideration set assumption may be inappropriate for our research. ApplyingManski's (1977)theory, a probabilistic model can be formulated to explain this type of choice behavior to help distinguish between the experimentally designed choice task presented to respondents and the respondents' actual consideration set (Campbell and Erdem, 2019). To gain this formulation, this study considers the IAL (Espinosa-Goded et al., 2021;Campbell and Erdem, 2019;Habib et al., 2013). Under this specification, the choice probability is given byEquation 2, wherePr(yn|Cs,Xn, β, λ = 1) is the conditional probability of the sequence of choice given that the consideration set isCs⊆S, whereSis the set of all subsets and ∅sis the unconditional probability thatCsis the true consideration set. To be specific,Sis the set of all non-empty subsets ofCs(i.e., all the latent choice subsets, which are described later in the context of this practical demonstration). Because a participant's true consideration set cannot be known with certainty, the model assumes that actual choice tasks are latent and vary across theSclasses. While conditional on the consideration set (and hence the class), the choice probability is multinominal logit: In an IAL model, the number of classes,S, is determined as a function of the number of alternatives (e.g., there are 2j−1 possible consideration sets for a universal set withJalternatives). This research aims to explore whether some respondents' choices exhibit probabilistic or deterministic behavior, for example, consistently choosing the status quo or other specific alternatives. In this context,deterministic behaviorrefers to consistently choosing the same type of alternative regardless of attribute levels, whileprobabilistic behaviorreflects the variability in choices that depend on the trade-offs between attributes presented in each scenario. Based on this assumption, four types of environmentally possible behaviors can be identified: (i) A subset (Cs= 1) who always only consider alternatives A and B deterministically (ii) A subset (Cs= 2) who restrict their actual choice task to only the SQ alternatives deterministically (iii) A subset (Cs= 3) who always only choose the alternatives A and B probabilistically (iv) A subset (Cs= 4) who always choose their actual choice task to the alternative SQ probabilistically These four patterns (i.e.,S= {Cs= 1,Cs= 2,Cs= 3,Cs= 4}) can be modeled using an IAL framework with four latent classes. In this setup, each latent class represents a distinct consideration set, capturing how different groups of respondents attend to different subsets of the available alternatives. As noted earlier, the alternatives considered by respondents cannot be known with certainty and therefore remain latent. However, their observed choice behavior helps us to make probabilistic statements about the likelihood of competing consideration sets being their true choice task, with the full probability per participant allocated across allSclasses (i.e.,∑s=1S∅s=1).∅scan be, therefore, considered the unconditional probability associated with observing the latent behavioral rule characterized by classs. Finally, the latent class approach in our research is usually used to explore unobserved constructions in observed choice data. This technique uses multiple variables to identify the presence of underlying classes or groups in the data. A latent class model is performed first to understand the number of classes that generate an optimal solution for the data and analyze heterogeneous preferences by constructing multiple classes and utility functions for each class. In our study, the following three hypotheses (assumptions 1–3) on environmental decision-making behavior are tested using the IAL and latent class models simultaneously, and three models are estimated for three statistical assumptions and compared to search for the specifications that best fit the data: Assumption 1 (types of different choice behaviors): respondents can exhibit either deterministic or probabilistic behavior in their preference choice. In deterministic behavior, respondents always choose from a specific subset of alternatives, regardless of the attribute levels. For example, (1) they always consider only Option A and Option B (class 1), or (2) they always consider only Option SQ (class 2). In probabilistic behavior, respondents also limit their consideration to specific options, but their choices among those options vary depending on the attribute levels. For example, (3) they consider only Option A and Option B but choose between them based on the scenario (class 3), or (4) they consider only option SQ (class 4), but their choice is influenced by how attractive it is relative to the other options. Assumption 2 (restriction of zero parameters; ANA or attribute-level non-attendance): the parameters of the attributes and/or levels ignored by a respondent are restricted to zero. If the respondent ignores an attribute or levels in a choice situation, parameter βijfor that attribute and level is constrained to be zero. Assumption 3 (effect of latent environmental behaviors): the latent environmental attitudes and behaviors of the respondents will influence their choice decisions positively or negatively. If latent environmental class classified by the principal component analysis plays a substantial effect and role in the model, the parameter is not zero and has statistically significant values. **3 Empirical case study** Our questionnaire and hypothetical scenarios are designed to reflect the present status of forests in Korea as much as possible in terms of environmental threats to ecosystem services and sustainable forest management (SFM).1Forests in Korea are highly threatened by forest fires and forest pests and diseases (KFS, 2023). Therefore, making a good choice is necessary to match the theoretical part and realistic assumption on the realistic forest policies in Korea. In the discrete choice methods, the choice of attributes and their levels are a very important part of experimental design (Salvo et al., 2018). Too many attributes and levels are not only confusing for respondents but also have the potential to reduce the experimental design process's efficiency (Mariel et al., 2021). So, the forest policy, the status of forest fire and forest pest and disease management, and the measurement system for those two risks are examined, with attributes and their levels tailored to address forest biodiversity loss and the negative effects of forest outdoor activities. The forest restoration cost variable is designed with a range of accounts for the various intervals of respondents. This section describes the attributes and levels selected, the pilot study, and the questionnaire design procedures (Górriz-Mifsud et al., 2016). This study examines forest fire risks as an attribute, given its significant negative impacts on sustainable ecosystem services both nationally and globally. Direct and critical factors arising from these threats are selected as attributes. To improve clarity, brief definitions of each attribute are included inTable 1alongside their corresponding levels. The forest fire risk in Korea is a growing factor to be continuously concerned with the successful growing stumpage stock simultaneously (Yoo et al., 2018). The frequency of and damage from forest fires have rapidly increased recently, and following theStatistical Yearbook of the Korea Forest Service(KFS, 2023), the main causes include carelessness of visitors (38.1%), weed burning (6.3%), trash burning (7.7%), cigarette littering (9.7%), visitors to ancestral graves (4.6%), children (0.9%), and building fires (5.7%) of the recent wildfire incidents, while 26.9% was attributed to other causes. Even though the event number of forest fires varies slightly from year to year, the damaged area and costs are becoming larger (KFS, 2023). For instance, the area affected by the fire was 24,797ha in 2022, but it was 2,920 ha in 2020, so it has surprisingly increased. Following theStatistical Yearbookand the literature studies, the main attributes and levels here will be described. The KFS provides 4 levels of forest fire alert systems [0 (lower risks) → 100 (higher risk)], such as blue level (lower than 50), yellow level (51–65), orange level (66–85), and red level (higher than 86), according to the data analysis of forest fire alert system by National Institute of Forest Science. Second, forest pest and disease risk with invasive species introduced from Japan, such as PWD,2has been very destructive in Korea since 1988 because more than 12 million pine trees infected with PWD have been urgently removed throughout the nation at a huge treatment cost. The KFS has implemented a forest disease and pest outbreak index and an alert system designed to assess current outbreak conditions and communicate the potential risk of future spread. This system categorizes risk into four levels—Interest (blue: below 50), Caution (yellow: 51–65), Serious (orange: 66–85), and Very Serious (red, above 86)—based on periodic surveillance results. The index evaluates the scale of occurrence, the speed of spread, and the degree of damage, in accordance with Article No. 4 of the Forest Pest Control Regulation. Table 1. Attributes and levels of sustainable forest management scenario. The third attribute is forest biodiversity loss as an impact directly related to and caused by the previously mentioned two risk factors, where it is supposed that the number of pine trees infected by PWD is biodiversity loss; once they are infected by PWD, all pine trees must be chopped down, or pine trees with suspected infections are removed altogether. It is represented by the number of pine trees damaged by two environmental risks, so the possible levels are 0–100,000 trees, 100,000–200,000 trees, 200,000–300,000 trees, and 300,000–400,000 trees. Pine trees in Korea hold a very special place in history as an evergreen tree with the symbol of a long lifespan, making it a symbol for Korean people, which is of significant economic importance worldwide. The fourth attribute is restrictions on forest-related outdoor activities (or forest access restrictions) to control and manage these two risk factors, in which the assumption about restrictions on forest-related outdoor activities is that there are currently no restrictions, which causes forest fires by human activities, so the potential for forest fires and pests to spread is high. Therefore, the direction of forest policy is set to restrict such forest-related outdoor activities to reduce these two risks, because most forest fires are caused by human activities. Forest ecosystem services, such as forest recreation activities and forest healing concerning the fourth attribute, are one of the representative ecosystem services in Korea. There are more than 170 natural recreational forest facilities for national, public, and private running. The number of visitors to forest facilities has continuously increased, from 4 million per year in the 2000s to more than 15 million per year in the 2020s. There are four levels about zero (no restriction), 1 million negatives, 2 million negatives, and 5 million negatives. Finally, a cost-related attribute to create a forest restoration fund (one-time payment for a year) about restoring the damaged forest, and it is divided into 11 levels, ranging from ₩0 up to ₩50,000 (US$38.29)3in increments by ₩5,000 (US$3.8). For the information, a general citizen pays about K₩6,700 (US$5.13) in government taxes for the forest sector (KFS) in 2020. The experimental design, which includes all attributes and levels, is optimized as a discrete choice model followingHensher et al.'s (2005)framework. The attributes and levels were defined based on literature reviews, pilot studies, consultations with subject matter experts, and the relevant forest policies that could be implemented by the KFS. Based on this approach, in total, 200 choice sets were generated using efficient design principles. The efficiency of the design is reflected in a D-error of 0.101, A-error of 0.192, and S-error of 9.67, aiming to minimize the variance of WTP. These values were calculated using priors from a pilot study involving 77 respondents and 770 choice responses. The research survey is divided into four sections: the first section is about an environmental attitude inventory of 20 items selected with a 5-point Likert scale to understand latent environmental behaviors and environmental choices to the public (Milfont and Duckitt, 2010) because it is becoming an increasingly important part of environmental problem research. In the second part of the questionnaire, the scenarios are preferentially described in detail, providing information on forest fires, forest pest and disease damage, and forest restoration management in Korea. The respondents are then provided with detailed attributes and level descriptions and are shown an example of our CE (Appendix 1). The third section consists of 10 choice tasks, and respondents are asked to choose the preferred choice alternative among depicting SQ alternatives and two forest management policies (alternatives A and B) that would restore the deforested and degraded forests by these two forest risks. After selecting the choice sets, respondents answer the follow-up questions such as the reason for WTP resistances, two types of consequentiality questions, the propriety of attributes among five, and general socioeconomic questions. The attributes and levels used in the CE are outlined inTable 1. Visual images are used to represent each attribute level to counter problems of low literacy levels. In this questionnaire, a cheap talk notice is added to prevent respondents from overestimating their WTP (forest restoration fund) and remind them of their disposable income level before selecting the main choice tasks (Haghani et al., 2021,2022). This research mainly includes the first and second risk attributes of forest fires and forest pests and diseases. The third attribute is considered a restriction on forest-related outdoor activities (forest access restriction). A fourth attribute, biodiversity loss, is measured by the number of pine trees infected. Finally, choice sets include a one-time forest restoration fund contribution per household as the payment vehicle. The fund would be managed by a designated public authority (e.g., the KFS), responsible for implementing the restoration measures. All attributes and levels are described to respondents using visual icons and readable images to enhance understanding of risks and trade-offs. Respondents were presented with 10 choice tasks, each with three alternatives and varying attribute levels (e.g.,Appendix 1). The 10 choice tasks, each containing 3 alternatives, are presented to respondents using the visual representations described to them in the second part of the survey. In each choice set, following the Discrete Choice Experiments (DCEs), respondents are asked several follow-up questions. In line with recent studies on incentive compatibility, respondents are asked several questions about their beliefs regarding the survey's consequentiality on a 5-point Likert scale. The techniques applied in our research to easily understand our reasonable scenario include making the choice setting as tangible and relatable as possible for the respondent. This has enhanced graphics and pictures in presenting choice alternatives as opposed to presenting attribute levels in words or numbers. Before designing the final questionnaire, a pilot study was conducted from August–September 2023 via a face-to-face survey with a portable tap book to assist our questionnaire by a professional research company in Korea. For more information on this part, seeJeon (2025). The coefficient derived from this pilot study with 67 pilot studies (670 choice data) would be used a priori for the efficient design of the main research. As a result of the data analysis, some of the attribute and level coefficients were statistically significant with the expected sign, while others were statistically insignificant. Therefore, the partial results were used to derive the final experimental design. Positive responses were received from respondents, indicating that the pilot questionnaire regarding the status of national forest status was not difficult, visually appealing, and well written for ease of understanding, although some found it slightly long. To address this comment, we checked the overall framework of the questionnaire, and some questions that were redundant in the first section were modified, and the content was shortened by clarifying the lengthy information associated with the survey scenario in Section B. Therefore, the questionnaire was finally modified to allow respondents to complete the survey within 15–20 min.Appendix 1is an example of a discrete choice set of experimental choice scenarios. **4 Empirical results** **4.1 The sample demographics of respondents** The sampling design followed a stratified random sampling approach to ensure the demographic representation of the Korean adult population aged 20 and older. Respondents were recruited across all major administrative regions in Korea, including both metropolitan and rural areas, with quotas applied to achieve a balanced distribution in terms of gender, age, and income levels. While metropolitan areas (e.g., Seoul and Gyeonggi) are slightly overrepresented, the sample includes socioeconomic groups to reflect national variations. Data were collected through in-person surveys administered by a professional survey company (ST Innovation), using a tablet-assisted questionnaire for real-time entry and quality control. A total of 1,021 individuals participated, yielding 10,210 valid choice responses, while not formally calculated, benefited from the professional fieldwork approach and face-to-face engagement. Although sampling weights were not applied in the estimation, the demographic breakdown (Table 2) indicates sufficient heterogeneity to support subgroup analysis and the generalizability of findings within the Korean context. Future applications of this methodology may further enhance representativeness by incorporating probability sampling frames or longitudinal panel design (Thompson, 1987). Table 2. Demographic characteristics of respondents (N= 1,021). Of the 1,021 valid participants, 569 (55.7%) were female, and 621 (60.8%) were aged between 30 and 49. More than 70% of respondents held a bachelor's degree, and 60% were employed full-time. Moreover, approximately 40% reported a monthly income exceeding US$3,001. As the questionnaire is administered nationwide, responses were distributed across the following regions: Seoul (345, 33.8%), Incheon/Gyeonggi (290, 28.4%), Busan/Ulsan/Gyeongnam (140, 13.7%), Daegu/Gyeongbuk (100, 9.8%), Chungcheong (57, 5.6%), Jeonla (51, 5.0%), Gangwon (30, 2.9%), and JeJu (8, 0.8%). While metropolitan areas are somewhat overrepresented, the overall distribution suggests adequate national coverage.4 **4.2 Result of latent environmental attitude and environmental behavior through a latent class application** To implement and support forest restoration management policies, understanding the environmental attitudes and behaviors of the public citizens is very important. This is because environmental issues are very closely connected with the public stakeholders. To capture latent environmental behavior types, respondents were asked to evaluate 20 statements on a 5-point Likert scale (seeAppendix 2). These items, adapted fromMilfont and Duckitt (2010), inform the principal component analysis used to derive latent class structure. The 20-item environmental attitude inventory used in this survey is presented inAppendix 2. To investigate how environmental attitudes and behaviors related to forest ecosystem services and forest threats influence willingness to pay (WTP) for forest management policies, we incorporated these measures into our modeling framework. To begin with, this section tests the reliability, validity, and model fit of the structural equation model and analyzes how the latent variables derived affect actual WTP intention behavior through latent class analysis and IAL. As a first step, a principal factor analysis with IBM SPSS Statistics 28 (licensed) is conducted on the responses to the environmental attitude and behavior questions inAppendix 2. Before a principal factor analysis employs principal axis factor analysis, checking the data is necessary to ensure internal consistency and reliability. Cronbach's alpha, one of the reliability statistics, for 20 items shows a better fit of 0.826 than 0.7 criteria values in general, and testing the sampling adequacy, the result of Kaiser–Meyer–Olikin measure and Barlett's test of sphericity shows 0.86, showing the adequacy to be very appropriate, with a significance of 0.000 with Barlett's test of sphericity having 190 degrees of freedom (chi-square = 6,251.30), proving that our data are appropriate for factor analysis. In our data and model, all test statistics are fit and over the critical values, indicating that the structural model of environmental attitudes and behavior variables is adequate to explain the consequences of SFM and WTPs on forest ecosystem services. According toTable 3, a five-factor solution appears appropriate, as the explained variance (58%) drops sharply after the fifth factor, with eigenvalues falling below 1 and factor loadings concentrated in the columns for factors 1–5 (Milfont and Duckitt, 2010;Everitt and Hothorn, 2010;Appendix 3). As summarized inTable 4(Yoon and Ahn, 2020), respondents show a tendency to prioritize personal convenience and economic interests, despite being aware of the importance of the environment and nature (A3_6, A3_4, A2_2, A2_1, A3_5, A3_3). This suggests the existence of a latent class we refer to as the “human self-benefit-centered group,” which places more value on practical and economic benefits than environmental concerns. In contrast, another latent class—labeled the “environmental activity favorite group”—highly values the ecosystem services' role in providing stress relief, wellbeing, and happiness in natural settings (A1_3, A1_2, A1_4, A1_1). A third group, the “ecosystem sensitivity recognition group,” strongly acknowledges that the planet and natural ecosystems are at risk (A2_4, A2_3, A2_5, A1_5). A fourth group, characterized as the “actively environmental protection group,” expresses confidence in the potential of scientific and technological innovations to address environmental problems (A1_7, A3_7, A1_8, A1_6), indicating a pragmatic and solution-oriented mindset. Finally, a fifth group—the “passive environmental behavior group”—recognizes the value of daily energy-saving behaviors, such as electricity conservation and adjusting heating levels, as meaningful contributions to SFM (A3_1, A3_2). While these actions are relatively low effort, they reflect a form of engagement that may span all classes but is most distinct within this group (Appendix 4). Table 3. Total variance explained to environmental attitude and behavior. Table 4. Latent environmental groups derived from principal component analysis. **4.3 Follow-up questions** In this section, the results of responses to the main items in the second half of the questionnaire, along with follow-up questions, are examined. These include resistance to WTP, the rank of attribute prioritization, policy consequentiality, and difficulty of the questionnaire. First, in terms of WTP resistance, there are no unusual responses. For the main items related to forest government and forest policies, respondents emphasize the importance of government responsibility and show moderate response to the policy and tax instrument as a WTP measure. Second, respondents tend to be positive about the monetary value of forest protection and awareness of environmental threats such as forest fires, forest pests and diseases, and difficulty in preventing environmental disasters. Also, they were not interested in forests (Table 5). Table 5. Results of follow-up questions. **4.4 Results for modeling environmental choice behaviors and WTP estimation** To support the hypothesis in Section 2, this study estimates four environmentally oriented choice behavioral models: one basic model (MNL) and three IAL models (IAL I–III), each designed to test specific behavioral assumptions. These include latent class segmentation (IAL I), and ANA (IAL II), and resistance to cost-based attributes such as tax payments (IAL III). In the IAL II model, ANA is explicitly modeled to identify which attributes respondents systematically ignored during the decision-making process. The results reveal that a subset of respondents tended to ignore one or more attributes (levels)—most notably, the biodiversity loss attribute. This suggests that not all attributes were considered equally in the decision process, validating the need for the IAL specification. In addition, the estimated coefficients help interpret behavioral responses toward risk attributes. Because both forest fire and forest pests and diseases are framed as negative outcomes, a negative coefficient indicates risk-averse behavior (Diendere and Kabore, 2023;Reynaud and Nguyen, 2016;Botzen and Bergh, 2012). These risk attributes thus represent disutility: as risk levels decrease, utility (or WTP) increases, confirming an inverse relationship. The MNL model results show that the highest level of the forest fire attribute (Fire 4) is statistically significant at the 5% level, indicating that respondents are willing to pay to achieve the safest possible fire risk reduction. In contrast, for the forest pest and disease risk attribute, respondents' WTP peaks at the mid-level (Pest 3), suggesting a relatively lower valuation compared to fire risk. The third attribute, restriction to forest-related outdoor activities, is statistically significant across all levels, indicating that restricted access to forests as part of forest policy to manage degraded forest restoration is acceptable to respondents. It means that respondents would accept forest access restrictions, strong or weak, to reduce forest fires and pest and disease risks. Although the forest biodiversity loss attribute is not statistically significant, the sign of the coefficient is positive, indicating a positive effect on utility. As expected, the coefficient on the forest restoration cost is negative, indicating that the probability of bid payment decreases as the bidding price increases. Finally, the highly significant and positive ASC coefficient confirms a general preference for new forest restoration policies over the status quo. Next, the IAL I model has better model fitness values [log-likelihood −9,281.022, Akaike Information Criterion (AIC) 18,598.05] than the traditional MNL model (log-likelihood −10,715.15, AIC 21,460.31). In this model assumption 1, assumptions 1 and 2 are assumed to be deterministic, assumptions 3 and 4 are assumed to be probabilistic in the environmental decision-making choice behavior, and the results of the IAL model I show that class 2 and 4 are statistically significant at 1% level, indicating that both deterministic and stochastic behavior exist. However, class 3, choosing only Options A and B stochastically, is not statistically significant, so this hypothesis cannot be rejected. Next is the IAL II model with ANA, which shows a lower fit than the traditional MNL model but is not significantly different from IAL I. The IAL II model is estimated by imposing zero constraints on each attribute to test for ANA. The results indicate no evidence of full ANA. However, when zero constraints were applied to levels 3 and 4 of the biodiversity loss attributes in class 6 of the IAL with ANA II (Table 6), the coefficient for class 6 was not significantly different from zero, suggesting that levels 3 and 4 were characterized by ANA. Next is the IAL III model, which is better than the original MNL model but not significantly different from IAL I and IAL II. It includes more realistic assumptions than the original model, and the assumptions of resistance to the means of paying taxes and the latent environmental attitude group are added to the model, and the results are statistically significant at the 1% level for both variables, indicating that respondents with resistance to the means of paying taxes and latent environmental attitudes of preferring to enjoy the benefits are more WTP negatively. Table 6. Estimation of multinomial logit (MNL) and independent availability (IAL) logit model I–III for environmental choice behaviors. Table 7reports the WTP estimates under four behavioral models, highlighting the superior fit of the IAL III: the forest fire risk attribute has a WTP of ₩4,558.1 (US$3.49)–₩7,160.2 KRW (US$5.48), and the forest pest risk has a WTP of ₩3,452.8 (US$2.64)–₩6,952.5 KRW (US$5.32). The forest access restriction attribute has a WTP of ₩KRW 3,197.0 (US$2.45)–₩KRW 8,014.5 (US$6.14). Forest biodiversity loss does not have a statistically significant value and was characterized by a wide distribution of WTP. It is noteworthy that in the IAL III model, the reluctance to pay taxes shows a WTP of about ₩−18,435.9 KRW (US–$14.12), and the latent environmental attitude variable shows a WTP of about ₩−34,807.2 KRW (–$26.66), which is the largest value among the WTP variables. The results of estimating the WTP for each attribute and level using the four models are shown inFigure 1. Table 7. Willingness-to-pay estimates by various models. Figure 1. Willingness-to-pay (WTP) estimation of attributes and levels by multinomial logit, independent availability logit model I, independent availability logit model II, and independent availability logit model III. Figure 2shows the density distribution of individual WTPs based on the model estimation results inTable 6. The distribution reflects heterogeneity in preferences, including the presence of negative WTP values, which arise from negative utility associated with the forest fire and forest pest attributes.Figure 2highlights these variations, particularly negative WTP existing for tax payments among certain respondent classes. Figure 2. The density distribution of individuals' willingness to pay by different models. WTP, willingness to pay; MNL, multinomial logit model; IAL, independent availability logit. Table 8presents the estimation results for each model—MNL, IAL I, and IAL II—following the segmentation of the total sample into distinct latent environmental classes using principal component analysis. These results highlight notable differences in environmental behavior and decision-making across latent classes. While direct comparison of model coefficients may be limited, the analysis offers meaningful insights into the diverse ways citizens approach environmental decisions on their environmental concerns, values, and preferences. Table 8. Estimate results of multinomial logit and independent availability logit with environmental choice behaviors based on latent class analysis. This research contributes by assessing public attitudes toward key policy instruments and applying advanced statistical methods to better understand and support the environmental decision-making process. The findings can inform policymakers about which groups are more responsive to certain restoration policies, payment mechanisms, or communication strategies. Given the inherent complexity of aligning individual, national, social, economic, and cultural perspectives on environmental issues, a one-size-fits-all policy approach is often ineffective. Instead, segmenting respondents' environmental attitudes and behavioral tendencies—using the latent class model and IAL models—enables the design of targeted, group-specific policies. While this approach introduces analytical complexity, enhancing the relevance, acceptance, and overall success of forest restoration and environmental initiatives is vital. **5 Conclusion** Understanding how individuals make environmental decisions is vital for effective policy design, especially in the context of forest restoration under increasing ecological threats. Using Korea as a case study, this research applied advanced choice modeling approaches—including independent availability logit and latent class models—to assess heterogeneous environmental attitudes, ANA, and WTP. The findings reveal that respondents do not uniformly consider all policy attributes; instead, they selectively ignore certain information or rely on latent preferences, which significantly influence their WTP. Importantly, both deterministic and probabilistic choice behaviors were identified, and these behaviors were linked to underlying environmental attitudes. For example, individuals in the “human self-benefit-centered” group expressed significantly lower WTP for restoration, underscoring the challenge of engaging in less environmentally motivated segments of the population. These insights have direct policy relevance. First, restoration programs should not adopt a one-size-fits-all approach. Tailored strategies—such as targeted messaging, educational outreach, and differentiated payment schemes—should be used to engage different latent attitude groups. Second, the strong resistance to tax-based financing suggests a need to explore alternative funding mechanisms, such as voluntary contribution schemes, corporate partnerships, or ecosystem service credits. Third, the partial presence of ANA highlights the importance of simplifying communication about policy options and using clear, relatable visuals to improve public understanding. In sum, this study emphasizes the critical role of behavioral segmentation in environmental policy and provides a practical framework for integrating public heterogeneity into forest restoration strategies. Future research should continue to explore these dynamics in other contexts and test interventions that can shift latent preferences toward stronger pro-environmental support. **Data availability statement** The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. **Ethics statement** The studies involving human participants were reviewed and approved by University of Stirling. **Author contributions** CJ: Writing – review & editing, Formal analysis, Data curation, Writing – original draft, Conceptualization, Visualization. **Funding** The author(s) declare that financial support was received for the research and/or publication of this article. The publication fee for this article is supported by the University of Stirling. **Conflict of interest** The author declares that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Generative AI statement** The author(s) declare that no Gen AI was used in the creation of this manuscript. **Publisher's note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **Supplementary material** The Supplementary Material for this article can be found online at:https://www.frontiersin.org/articles/10.3389/frbhe.2025.1596416/full#supplementary-material **Footnotes** 1.^Ethical approval procedures are followed, and permission is obtained from the University of Stirling for this research (15/03/2023; seeAppendix 5). 2.^Pine wilt is a dramatic disease that typically kills affected trees within a few months. The causal pathogen is the pine wood nematode. Tree death usually progresses from the top of the tree downward. Needles change from their normal color to a grayish-green color and finally a tan to brown color. The disease is most serious in pine species not native to North America, with the greatest impact in landscape plantings and windbreaks. The tree's age also influences susceptibility, with an increased risk of developing pine wilt when trees are greater than 10 years of age. Worldwide, the problem is an epidemic in Japan and other parts of Asia, where it is the native pine forests that are at risk. 3.^In 2023, US$1 is equal to ₩1,305.8 Korean won (KRW;https://ecos.bok.or.kr/#/SearchStat). 4.^The population distribution is added by region in Korea per 2020 Korea statistics (kssc.kostat.go.kr) as follows: Seoul, 19.2%; Incheon/Gyunggi, 30.1%; Usan/Ulsan/Gyungnam, 15.1%; Daegu/Gyungbuk, 10.0%; Chungcheong, 11.2%; Jeonla, 10.0%; Gangwon, 3.1%; and JeJu, 1.3%. **References** Botzen, W. J. W., and Bergh, J. C. J. M. (2012). Risk attitudes to low-probability climate change risks: WTP for flood insurance.J. Econ. Behav. Organization. 82, 151–166. doi: 10.1016/j.jebo.2012.01.005 Crossref Full Text|Google Scholar Brown, L. R. (2005).Outgrowing the Earth. Earth Policy Institute. Available online at:http://www.earth-policy.org/ Google Scholar Campbell, D., and Erdem, S. (2019). Including opt-out options in discrete choice experiments: issues to consider.Patient12, 1–14. doi: 10.1007/s40271-018-0324-6 PubMed Abstract|Crossref Full Text|Google Scholar Campbell, D., Hensher, D. A., and Scarpa, R. (2011). Non-attendance to attributes in environmental choice analysis: a latent class specification.J. Env. Plan. Manag. 54, 1061–1076. doi: 10.1080/09640568.2010.549367 PubMed Abstract|Crossref Full Text|Google Scholar Campbell, D., Hensher, D. A., and Scarpa, R. (2012). Cost thresholds, cut-offs and sensitivities in stated choice analysis: identification and implications.Resou. Energy. Econ. 34, 396–411. doi: 10.1016/j.reseneeco.2012.04.001 Crossref Full Text|Google Scholar Diendere, A. A., and Kabore, D. (2023). Preferences for a payment for ecosystem services program to control forest fires in Burkina Faso: a choice experiment.For. Pol. Econ. 151:102973. doi: 10.1016/j.forpol.2023.102973 Crossref Full Text|Google Scholar Espinosa-Goded, M., Rodriguez-Entrena, M., and Salazar-Ordóñez, M. (2021). A straightforward diagnostic tool to identify attribute non-attendance in discrete choice experiments.Econ. Anal. Policy. 71, 211–226. doi: 10.1016/j.eap.2021.04.012 Crossref Full Text|Google Scholar Everitt, B. S., and Hothorn, T. (2010).A Handbook of Statistical Analyses Using R (2nd ed.). New York: Chapman & Hall/CRC. Google Scholar FAO (2016).Integrated Policy for Forests, Food Security and Sustainable Livelihoods: Lessons From the Republic of Korea(Working paper). Google Scholar FAO (2020).Global Forest Resources Assessment 2020 Key findings.Rome: Food and Agriculture Organization. Google Scholar Frejinger, E., Bierlaire, M., and Ben-Akiva, M. (2009). Sampling of alternatives for route choice modeling.Transp. Res. Part B: Methodol.43, 984–94. doi: 10.1016/j.trb.2009.03.001 Crossref Full Text|Google Scholar Gonçalves, T., Lourenço-Gomes, L., and Pinto, L. M. C. (2022). The role of attribute non-attendance on consumer decision-making: theoretical insights and empirical evidence.Econ. Analy. Policy.76, 788–805. doi: 10.1016/j.eap.2022.09.017 Crossref Full Text|Google Scholar Górriz-Mifsud, E., Varela, E., Piqué, M., and Prokofieva, I. (2016). Demand and supply of ecosystem services in a Mediterranean forest: computing payment boundaries.Ecosys. Serv. 17, 53–63. doi: 10.1016/j.ecoser.2015.11.006 Crossref Full Text|Google Scholar Greene, W. H., and Hensher, D. A. (2003). A latent class model for discrete choice analysis: contrasts with mixed logit.Transp. Res. Part B: Methodol.37, 681–698. doi: 10.1016/S0191-2615(02)00046-2 Crossref Full Text|Google Scholar Habib, K. N., Morency, C., Trépanier, M., and Salem, S. (2013). Application of an independent availability logit model (IAL) for route choice modelling: considering bridge choice as a key determinant of selected routes for commuting in Montreal.J. Choice. Model. 9, 14–26. doi: 10.1016/j.jocm.2013.12.002 Crossref Full Text|Google Scholar Haghani, M., Bliemer, M. C. J., Rose, J. M., Oppewal, H., and Lancsar, E. (2021). Hypothetical bias in stated choice experiments: Part II. Conceptualisation of external validity, sources and explanations of bias and effectiveness of mitigation methods.J. Choice. Model. 41:100322 doi: 10.1016/j.jocm.2021.100322 Crossref Full Text|Google Scholar Haghani, M., Kuligowski, E., Rajabifard, A., and Kolden, A. C. (2022). The state of wildfire and bushfire science: temporal trends, research divisions and knowledge gaps.Saf. Sci. 153:105797. doi: 10.1016/j.ssci.2022.105797 Crossref Full Text|Google Scholar Hensher, D. A., Rose, J. M., and Greene, W. H. (2005).Applied Choice Analysis: A Primer.Cambridge University Press. Google Scholar Hoedemakers, M., Karimi, M., Jonker, M., Tsiachristas, A., and Rutten-van Molken, M. (2022). Heterogeneity in preferences for outcomes of integrated care for persons with multiple chronic diseases: a latent class analysis of a discrete choice experiment.Qual. Res. 31, 2775–2789. doi: 10.1007/s11136-022-03147-6 PubMed Abstract|Crossref Full Text|Google Scholar Jeon, C. H. (2025). Four essays on valuing non-market ecosystem services of natural resources: Insights from environmental attitudes, perceptions, and choice behaviors [PhD thesis]. Stirling: University of Stirling (In progress). Google Scholar KFS (2023).2023 Statistical Yearbook of Forestry. Korea Forest Services. Google Scholar Kwon, T. S., Shin, J. H., Lim, J. H., Kim, Y. K., and Lee, E. J. (2011). Management of pine wilt disease in Korea through preventative silvicultural control.For. Ecol. Manage.261, 562–569. doi: 10.1016/j.foreco.2010.11.008 Crossref Full Text|Google Scholar Lahoz, L. T., Pereira, F. C., Sfeir, G., Arkoudi, I., Monteiro, M. M., and Azevedo, C. L. (2023). Attitudes and latent class choice models using machine learning.J. Choice. Model. 49:100452, doi: 10.1016/j.jocm.2023.100452 PubMed Abstract|Crossref Full Text|Google Scholar Louviere, J., Hensher, D., and Swait, J. (2000).Stated Choice Methods: Analysis and Application. Cambridge: Cambridge University Press. doi: 10.1017/CBO9780511753831 Crossref Full Text|Google Scholar Lowthian, E., Page, N., Melendez-Torres, G. J., Murphy, S., Hewitt, G., and Moore, G. (2021). Using latent class analysis to explore complex associations between socioeconomic status and adolescent health and well-being.J. Adolescent. Health. 69, 774–781. doi: 10.1016/j.jadohealth.2021.06.013 PubMed Abstract|Crossref Full Text|Google Scholar Manski, C. F. (1977). The structure of random utility models.Theor. Decis.8, 229–254. doi: 10.1007/BF00133443 Crossref Full Text|Google Scholar Mariel, P., Hoyos, D., Meyerhoff, J., Czajkowski, M., Dekker, T., Glenk, K., et al. (2021).Environmental Valuation with Discrete Choice Experiments (Guidance on Design, Implementation and Data Analysis). Springer: New York. doi: 10.1007/978-3-030-62669-3 Crossref Full Text|Google Scholar Mendelsohn, R., and Binder, S. (2013). “Economic value of biodiversity, measurements of,” inEncyclopedia of Biodiversity, 3rd Edn, ed. S. M. Scheiner (Academic Press), 720–723. doi: 10.1016/B978-0-12-822562-2.00220-6 Crossref Full Text|Google Scholar Milfont, T., and Duckitt, J. (2010). The environmental attitudes inventory: a valid and reliable measure to assess the structure of environmental attitudes.J. Environ. Psychol. 30, 80–94. doi: 10.1016/j.jenvp.2009.09.001 Crossref Full Text|Google Scholar Nguyen, H. C., Robinson, J., Whitty, J. A., Kaneko, S., and Nguyen, T. C. (2015). Attribute non-attendance in discrete choice experiments: a case study in a developing country.Econ. Analysis. Policy47, 22–33. doi: 10.1016/j.eap.2015.06.002 Crossref Full Text|Google Scholar Reynaud, A., and Nguyen, M. H. (2016). Valuing flood risk reductions.Environ. Model. Assess21, 603–617. doi: 10.1007/s10666-016-9500-z Crossref Full Text|Google Scholar Salvo, M. D., Kaval, P., Madureira, L., and Mahieu, P. A. (2018).Valuation of Forest Ecosystem Services. A Practical Guide, ed. P. Riera, and G. Signorello. PubMed Abstract|Google Scholar Taghouti, I., Rahmani, D., Guesmi, B., Dhehibi, S., and Gil, J. M. (2024). Connecting forest management priorities and social preferences for aleppo pine ecosystem services.Int. J. Environ. Stud. 81, 1209–1223. doi: 10.1080/00207233.2023.2296768 Crossref Full Text|Google Scholar Thompson, S. K. (1987). Sample size for estimating multinomial proportions.Am. Statistician. 41, 42–46. doi: 10.1080/00031305.1987.10475440 Crossref Full Text|Google Scholar Torres, I., Moreno, M. M., César, M. M., and Arianoutsou, M. (2021).Ecosystem Services Provided by Pine Forests. Springer: New York. Google Scholar Weller, B. E., Bowen, N. K., and Faubert, S. J. (2020). Latent class analysis: a guide to best practice.J. Black Psychol. 46, 287–311. doi: 10.1177/0095798420930932 PubMed Abstract|Crossref Full Text|Google Scholar Weller, P., Malte, O., Petr, M., and Jürgen, M. (2014). Stated and inferred attribute non-attendance in a design of designs approach.J. Choice. Model. 11, 43–56. doi: 10.1016/j.jocm.2014.04.002 Crossref Full Text|Google Scholar World Economic Forum (2023). Available online at:https://www.weforum.org/press/2023/01/successful-pilot-shows-how-artificial-intelligence-can-fight-wildfires/(accessed August 15, 2023). Google Scholar Yoo, J. C., Kim, M. O., Gong, K. S., and Yoo, B. I. (2018). Economic valuation of forest ecosystem services in the Republic of Korea.J. Rural. Economy. 33, 43–62. PubMed Abstract|Google Scholar Yoon, T. K., and Ahn, S. (2020). Clustering Koreans' environmental awareness and attitudes into seven groups: environmentalists, dissatisfieds, inactivators, bystanders, honeybees, optimists, and moderates.Sustainability12:8370. doi: 10.3390/su12208370 Crossref Full Text|Google Scholar Zenni, R. D., Essel, F., Barcia-Berthou, E., and McDermott, S. M. (2021). The economic costs of biological invasions around the world.NeoBiota67:1–9. doi: 10.3897/neobiota.67.69971 Crossref Full Text|Google Scholar Keywords:environmental choice decision-making, attribute non-attendance, independent availability logit model, latent class approach, willingness to pay Citation:Jeon C (2025) Understanding environmental decision-making in forest restoration: the role of latent attitudes, attribute non-attendance, and choice behavior.Front. Behav. Econ.4:1596416. doi: 10.3389/frbhe.2025.1596416 Received:19 March 2025;Accepted:25 April 2025;Published:20 May 2025. Edited by: Reviewed by: Copyright© 2025 Jeon. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Chulhyun Jeon,Y2h1bGh5dW4uamVvbjFAc3Rpci5hYy51aw== Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract 1 Introduction 2 Econometric modeling for exploring decision-making choice decision behaviors 3 Empirical case study 4 Empirical results 5 Conclusion Data availability statement Ethics statement Author contributions Funding Conflict of interest Generative AI statement Publisher's note Supplementary material Footnotes References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}