{"id": 1616, "name": "WSVN", "domain": "wsvn.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://wsvn.com/entertainment/deco-drive/victoria-rowell-and-co-stars-talk-about-making-american-black-film-fest-selections-secret-between-us-love-offside/", "title": "Victoria Rowell And Co Stars Talk About Making American Black Film Fest Selections Secret Between Us Love Offside", "content": "NewsLocalMiami-DadeBrowardFloridaTrendingUS & WorldPoliticsHelp Me Howard7 Spotlight Local Miami-Dade Broward Florida Trending US & World Politics Help Me Howard 7 Spotlight Local Miami-Dade Broward Florida Trending US & World Politics Help Me Howard 7 Spotlight InvestigationsInvestigationsSpecial ReportsHelp Me Howard Investigations Special Reports Help Me Howard Investigations Special Reports Help Me Howard WeatherForecastInteractive RadarVideo ForecastWatches and WarningsForecast ModelsForecast ConeHurricane Tips7Weather AppHurricane Tracker AppSurviving a Storm Forecast Interactive Radar Video Forecast Watches and Warnings Forecast Models Forecast Cone Hurricane Tips 7Weather App Hurricane Tracker App Surviving a Storm Forecast Interactive Radar Video Forecast Watches and Warnings Forecast Models Forecast Cone Hurricane Tips 7Weather App Hurricane Tracker App Surviving a Storm SportsAll SportsMiami DolphinsMiami HeatMiami MarlinsFlorida PanthersInter Miami CFMiami HurricanesFlorida GatorsFlorida State Seminoles All Sports Miami Dolphins Miami Heat Miami Marlins Florida Panthers Inter Miami CF Miami Hurricanes Florida Gators Florida State Seminoles All Sports Miami Dolphins Miami Heat Miami Marlins Florida Panthers Inter Miami CF Miami Hurricanes Florida Gators Florida State Seminoles EntertainmentEntertainmentBite with BelkysDeco Drive Entertainment Bite with Belkys Deco Drive Entertainment Bite with Belkys Deco Drive …Employment OpportunitiesTV Listings7News TeamWatch 7News LiveLinks Mentioned On AirChannel 7 Foundation65 years of Channel 7 Employment Opportunities TV Listings 7News Team Watch 7News Live Links Mentioned On Air Channel 7 Foundation 65 years of Channel 7 Employment Opportunities TV Listings 7News Team Watch 7News Live Links Mentioned On Air Channel 7 Foundation 65 years of Channel 7 **Victoria Rowell and co-stars talk about making American Black Film Fest selections ‘Secret Between Us,’ ‘Love Offside’** Actress Victoria Rowell is bringing the heat to Miami, and we’re not just talking about the weather. She’s doubling down and starring in two films both premiering at the American Black Film Festival. Deco tackled questions with Victoria and her rom-com co-stars. It was a touchdown. The American Black Film Festival is hitting Miami Beach next week with a variety of films. Victoria Rowell: “I’ve been to ABFF many times, and I’m so excited to return 2025.” And actress Victoria Rowell is bringing a twofer this time around. Michael Jai White (as Jack Frazier): “Why would you come here now? And disrupt my family? Victoria Rowell: “‘The Secret Between Us’ is a family drama. I mean, the mystery child shows up at the front door, and how this family deals with it. It’s an amazing script.” She plays Maxine in the film. Victoria Rowell: “I’m very, very grateful. I’m still working here. Forty years in the business.” Character in “Love Offside”: “I just got you your first client: a rugby player.” And she’s Mommy in the Jamaican film “Love Offside.” Victoria Rowell: “How I come into the movie is, I play Judi [Johnson]’s mom, and we are a medical legacy family, and she wants to try some innovative sports medicine techniques.” Judi Johnson: “Being in a project that has hailed from Jamaica, especially with the components of the medicinal benefits that the land offers, it was one those things that was a full circle moment.” In the movie, pulling a muscle can equal pulling on the heartstrings. The flick follows Judi Johnson, a physical therapist, who mixes herbal healing with love for a rugby player played by Mike Merrill. Mike Merrill: “I don’t think you want to miss this movie. I would say it’s more romance, though. It’s more romance. So much passion and love in this story, that is more of a romance to me.” Judi Johnson: “I think, with our characters, we are longing for love and security. I hope that it showcases to individuals who are so focused on work that love still exists in the unknown places.” Judi Johnson (as Camille Hart): “Hi.” For the island native, vibing with her co-star was a no-brainer. Judi Johnson: “Mike is a character. Mike is chemistry. OK, I don’t think Mike cannot have chemistry with anyone.” As for that dance you see in the movie, Mike says it was improvised. Mike Merrill: “I actually don’t know what that dance is called. That was the character, that was Ryan. I don’t know where that came from, but it worked. So I did it the next time, later on in the movie.” Both films premiere at ABFF next Friday, June 13. FOR MORE INFO:American Black Film FestivalJune 11-15, 2025abff.com/miami Copyright 2025 Sunbeam Television Corp. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. **Trending** Florida’s attorney general sends letter to Broward sheriff regarding immigration enforcement Applications for Miami-Dade program helping low-income tenants find rental units to open online Monday South Florida families reel from Trump administration travel bans Man stabbed to death as he slept in Brickell high-rise, sources say; subject fell from construction building WSVN-TVSunbeam Television Corp1401 79th Street CausewayMiami, FL 33141Switchboard: (305) 751-6692Newsroom: (305) 795-2777 Join us PRIVACY POLICY TERMS OF SERVICES TV LISTINGS NEXTGEN TV CHANNEL 7 FOUNDATION CONTACT US INTERNSHIPS EMPLOYMENT OPPORTUNITIES ADVERTISE WITH US WSVN FCC PUBLIC FILE WSVN 3.0 MULTICAST SIGNALS EEO PUBLIC FILE REPORT CHILDRENS PROGRAMMING ED ANSIN All content © Copyright 2000 - 2025 WSVN-TV. WSVN broadcast educational and informational programming for children, and file quarterly reports with the FCC detailing the station's outreach to children. The public may view the reports by going toWSVN.comand clicking on \"FCC Public File\", or by visiting the FCC's website atFCC.org. For more information on this site, please read ourPrivacy Policy, andTerms of Service."}