{"id": 1525, "name": "Vanity Fair", "domain": "vanityfair.com", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.vanityfair.com/style/story/jane-birkins-original-birkin-bag-heads-to-auction#intcid=_vanity-fair-verso-hp-trending_e600967f-00cb-4f3d-b105-6a38f57159ec_popular4-2", "title": null, "content": "Politics Business Hollywood Style Culture Royals Celebrity Video Podcasts Archive VF Shop What Is Cinema? Archive Magazine **The Birkin Bag That Started It All Heads to Auction** If you had to keep just one object to tell the story of the last 40 years of fashion, it could fit in one hand -- or on one arm, worn nonchalantly like its original muse. It's not a bag, it'sthebag. Created following a now mythical Paris-London flight, thevery first Birkin bagimagined by Jean-Louis Dumas (former president ofHermès) forJane Birkinin 1984 will be auctioned by Sotheby's at its first “Fashion Icons” sale in Paris on July 10. More than an accessory, this prototype is a relic. A unique piece with the patina of an icon's life. Marked with her initials \"J.B.\", it features an unexpected detail: nail clippers suspended from a chain. It has to be said that Jane Birkin has never been one to overdo luxury. It was precisely this contrast that forged the Birkin legend. A bag born of chance, from the charming disorder of an airline flight, which became the most coveted model in the history of leather goods. **Well Worn** Before crocodile skin, diamond inlays and endless waiting lists, there was this model. The original Birkin differs from those subsequently marketed. It has the width and height of a Birkin 35 with the depth of a Birkin 40, closed metal rings as on the house's high strap model, gold-plated brass details that would later be replaced by gold, rose gold, palladium or ruthenium jewelry. But also a shoulder strap sewn in one piece (which would never be the case again) and a “vintage zipper.” Each detail recounts a moment of transition between bespoke craftsmanship and standardized luxury goods. The details. The shoulder strap. The inside zipper. The nail clippers. This bag was well worn by Jane Birkin. The singer and actress couldn't stand bags that were too small, and once carried around a bag she didn't think suited her lifestyle. That is, until its contents - diapers, cigarettes, glasses, notebooks - were scattered all over the CEO of Hermès, who happened to be sitting next to her on the plane. He asked her to draw her ideal bag... on a sickness bag. The rest is history. This famous Birkin is not just a prototype, it's ground zero of contemporary luxury fantasy. The skillful blend of rarity, storytelling and heritage that made the myth of the French label. Hermès produces only a limited number each year, sold only to the most loyal (or patient) customers. Obtaining a Birkin is often an initiation process. It's hardly surprising, then, that this very first model should be the object of much envy. It has already been sold twice. The first, by Jane herself, in aid of Solidarité Sida in 1994. Then again in 2000, when it joined the private collection ofCatherine Benier, founder of vintage boutique Les 3 Marches in Paris. **A Fashion Unicorn** MorganeHalimi, head of fashion collections at Sotheby's, believes that it is \"rare [...] for an object to transcend trends and become a legend\": \"Jane Birkin's original Birkin bag is one of those. A true unicorn in the world of fashion and accessories, this iconic handbag stands side by side with other exceptional items of equally dazzling provenance - such asPrincess Diana's symbolic black sheep sweaterand Freddie Mercury's crown and cape. Both set exceptional benchmarks for items of their kind. Like them, the original Birkin has the potential to redefine records, but above all, our priority is to ensure that it finds a new home worthy of its iconic status and legendary history.\" The bag will be on display at Sotheby's in New York from June 6 to 12, then on view in Paris on rue du Faubourg St Honoré from July 3 to 9. It will then be auctioned on the 10th, alongside other iconic fashion items from famous couture shows by Alexander McQueen, Christian Dior, John Galliano, Thierry Mugler and Azzedine Alaïa. Jane Birkin's original Birkin bag (on base) next to the new standard Birkin design. The auction house has not yet given an estimated price. However, precedents such as the Birkin Himalaya sold for $513,000 in Hong Kong in 2017. The original Birkin, with its strong history and provenance, could lay claim to this record. All the more so as the object today transcends its status as an accessory: exhibited at MoMA in New York and the V&A Museum in London, it now belongs to the pantheon of global visual culture. Jane Birkin, who died in 2023, sometimes joked that she might be remembered not for her films orJe t'aime... moi non plus, but for this bag. What she didn't know was that the fashion world hadn't simply adopted the Birkin: it had sanctified it. Originally published in Vanity Fair France **More Great Stories FromVanity Fair** How Private-Equity Billionaires Killedthe American Dream How Private-Equity Billionaires Killedthe American Dream How Private-Equity Billionaires Killedthe American Dream Donald Trump“Wants to Demonstrate Absolute Power” Donald Trump“Wants to Demonstrate Absolute Power” Donald Trump“Wants to Demonstrate Absolute Power” Alex CooperBreaks Her Silence Alex CooperBreaks Her Silence Alex CooperBreaks Her Silence An Exclusive First Look atWicked: For Good An Exclusive First Look atWicked: For Good An Exclusive First Look atWicked: For Good The Chaos InsideJohnny Depp and Amber Heard’s Wedding The Chaos InsideJohnny Depp and Amber Heard’s Wedding The Chaos InsideJohnny Depp and Amber Heard’s Wedding Molly Gordon’s So Much More ThanThe Bear’s Dream Girl Molly Gordon’s So Much More ThanThe Bear’s Dream Girl Molly Gordon’s So Much More ThanThe Bear’s Dream Girl The Dizzying Rise of MAHA WarriorCalley Means The Dizzying Rise of MAHA WarriorCalley Means The Dizzying Rise of MAHA WarriorCalley Means From RFK Jr. to Patrick Schwarzenegger, a Brief Guide tothe Kennedy Family From RFK Jr. to Patrick Schwarzenegger, a Brief Guide tothe Kennedy Family From RFK Jr. to Patrick Schwarzenegger, a Brief Guide tothe Kennedy Family The 42 BestRomantic Comediesof All Time The 42 BestRomantic Comediesof All Time The 42 BestRomantic Comediesof All Time From the Archive:OceanGate’s Last Descent From the Archive:OceanGate’s Last Descent From the Archive:OceanGate’s Last Descent Facebook X Instagram Pinterest YouTube More from Vanity Fair Newsletters Subscribe Digital Edition Inside the Issue About Vanity Fair FAQ Contact Contact VF Manage Account Advertising Careers User Agreement Privacy Policy Your California Privacy Rights Condé Nast Store VF Media Kit Accessibility Help ©2025Condé Nast. All rights reserved.Vanity Fairmay earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad Choices CN Entertainment Italy Spain France"}