{"id": 295, "name": "Crookston Times", "domain": "crookstontimes.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.crookstontimes.com/ten-minnesota-cities-to-receive-active-transportation-planning-assistance/", "title": "Ten Minnesota Cities To Receive Active Transportation Planning Assistance", "content": "Home News Sports Local Events Opinion ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary ClassifiedsSubmit a ClassifiedJobs Submit a Classified Jobs Submit a Classified Jobs LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Calendar Login Contact Us Login Home News Sports Local Events Opinion ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary ClassifiedsSubmit a ClassifiedJobs Submit a Classified Jobs Submit a Classified Jobs LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Calendar Login To The Crookston Times readers, It is with regret that CherryRoad Media announces the closing of The Crookston Times Our company is dedicated to the preservation of community journalism. Since the purchase of our 1st paper in late-2020 to today, we have prided ourselves on our ability to fight the difficult battle that newspapers face in today’s digital society. Unfortunately, that battle cannot always be won. The Crookston Times has struggled in recent years to find its footing in this community. Since purchasing The Crookston Times, CherryRoad Media has been unable to avoid financial losses every month. The paper was losing money when we bought it, and it continued to do so. We must now come to terms with the fact that we do not have a path forward to sustainability. And we thank those who have supported us. **Ten Minnesota cities to receive Active Transportation Planning Assistance** January 23, 2025 LOCAL,News Login Sign Up Now Student Spotlight: Jaxyn Crawford This Week in Pictures Good Neighbor: Marley Melbye Athlete Spotlight: Riley Helgeson Athlete Spotlight: Masyn Arguelles Crookston's Meliyeah Durham-Moore Shines at UND Honor Orchestra, Performing Works by Mozart and Janáček Crookston Youth Wrestlers Crookston Area Special Olympics CANDLELIGHT SKI & OWL PROWL Operation Round Up® Grant Applications due Friday, February 21st **Other News** January 29, 2025 January 29, 2025 January 29, 2025 Home About Accessibility Community Rules Contact Us Cookie Policy Privacy Policy Terms of Service Copyright © 2025 Crookston Times, aCherryRoad MediaNewspaper. All rights reserved."}