{"id": 274, "name": "Cordele Dispatch", "domain": "cordeledispatch.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://cordeledispatch.com/2025/06/04/daughter-follows-in-mothers-footsteps-as-graduate-of-sgtc-early-childhood-care-and-education-program/", "title": "Daughter Follows In Mothers Footsteps As Graduate Of Sgtc Early Childhood Care And Education Program", "content": "Home E-Edition News Sports Opinion Classifieds Obituaries Public Notices Special Sections News Sports OpinionColumns Columns Columns Classifieds Obits Best of the Tri-Counties 2024 About Us Public Notices Special Sections E-Edition **Daughter follows in mother’s footsteps as graduate of SGTC Early Childhood Care and Education Program** Published 4:51 pm Wednesday, June 4, 2025 ByChris Lewis Lakeetha Dawson (left) graduated from South Georgia Technical College in 2015, and her daughter Ja’layshia Daniels followed in 2024. Both earned their diplomas in SGTC’s Early Childhood Care and Education program. Lakeetha Dawson and her daughter Ja’layshia Daniels share more than just a close bond—they share a passion for education that has brought both of them to South Georgia Technical College (SGTC) to pursue their dreams. Dawson, a Cordele native now living in Americus, first came to SGTC seeking a career that would allow her to teach and care for young children. She completed her diploma in Early Childhood Care and Education in 2015. She later earned her associate degree—all while working and raising her children. “It was hard at times, juggling work, motherhood, and school,” Dawson said. “But walking across that stage made it all worth it.” Dawson’s dedication didn’t go unnoticed. Her example became a powerful influence on her daughter, Jalayshia Daniels, who graduated from Sumter County High School in 2023 and enrolled at SGTC that same year. “I’ve always looked up to my mom,” said Daniels. “Seeing her succeed made me want to follow in her footsteps—she’s so confident and motivated in everything she does.” Now pursuing her associate degree in Early Childhood Care and Education, Daniels recently completed her internship and is preparing to take the necessary steps to become a substitute teacher. She hopes to eventually teach second grade and one day open her own daycare. Daniels also has long-term plans to continue her education and earn a specialist degree. “I want to go as far as I can,” she said. Dawson shares that entrepreneurial spirit. After working in a daycare facility in Cordele, she’s now laying the groundwork to open her own center. “I’ve always wanted to create something of my own—to offer a nurturing space for children and give back to my community,” she said. Both women credit SGTC for helping them find direction and opportunity. They were each selected for the National Technical Honor Society for their academic excellence and leadership. Daniels initially considered attending a university but was encouraged by a high school counselor to consider the technical college. She now encourages others not to overlook technical education. “SGTC provides a high-quality education that can help you enter the workforce faster,” said Daniels. “It offers real opportunities—and for people like me who were unsure about their next step, it’s a great place to grow.” Dawson, meanwhile, continues to encourage her youngest child—a rising high school senior—to consider SGTC as well. “He’s interested in welding,” she said. “I’m hoping he gives it a try. It’s right across the street from his high school, and it could give him a great start.” With two generations already graduating from SGTC and a third potentially on the way, the Dawson-Daniels family is a powerful testament to the college’s impact. Their story reflects not only the strength of family, but also the opportunity and inspiration that can be found right here in Southwest Georgia. You Might LikeNews$1000 reward being offeredNewsSouthwest Georgia man sentenced to prison for armed meth traffickingNewsFraud arrest madeNewsWilliams hired as Crisp County’s next schools superintendentPrint Article **You Might Like** **$1000 reward being offered** **Southwest Georgia man sentenced to prison for armed meth trafficking** **Fraud arrest made** **Williams hired as Crisp County’s next schools superintendent** **You Might Like** **$1000 reward being offered** **$1000 reward being offered** **Southwest Georgia man sentenced to prison for armed meth trafficking** **Southwest Georgia man sentenced to prison for armed meth trafficking** **Fraud arrest made** **Fraud arrest made** **Williams hired as Crisp County’s next schools superintendent** **Williams hired as Crisp County’s next schools superintendent** News Sports Opinion Columns Obits Small Business E-Edition Classifieds Public Notices About Us Terms of Use"}