{"id": 1664, "name": "AltHealth Works", "domain": "althealthworks.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://althealthworks.com/theres-one-natural-substance-that-helps-your-body-break-down-carbohydrates-naturally-heres-how-to-get-more-of-it-in-your-diet/", "title": "Theres One Natural Substance That Helps Your Body Break Down Carbohydrates Naturally Heres How To Get More Of It In Your Diet", "content": "Home Browse ArticlesAlternative MedicineAltHealthWORKSGMOsGMO FoodsMonsantoNatural TreatmentsNon GMO foodOrganic FoodOrganic FarmingUncategorized Alternative Medicine AltHealthWORKS GMOs GMO Foods Monsanto Natural Treatments Non GMO food Organic Food Organic Farming Uncategorized Alternative Medicine AltHealthWORKS GMOs GMO Foods Monsanto Natural Treatments Non GMO food Organic Food Organic Farming Uncategorized Nick’s Health BooksAmazon Rainforest Herbs Amazon Rainforest Herbs Amazon Rainforest Herbs Disclaimer About Me Advertise with Us Amazon Rainforest Herbs **Little Known Pancreas and Saliva Based Substance Helps the Human Body Break Down Excess Carbohydrates** Facebook Twitter LinkedIn Pinterest Shares One of the most difficult aspects of keeping weight off is the carbohydrate trap. Eating carbs is delicious and convenient, but too many can cause fat deposits around the waistline and make you feel sluggish. What most people don’t realize is that the “overeating” of carbs might not be their biggest problem —proper digestion of carbsis what most people are actually lacking. There’s one specific type of enzyme we need to break down carbs, but it’s not always the easiest to get, depending on what your diet is like, of course. **Carb Digestion in the Human Body** While simple carbs like fruit are the fastest-digesting ones, starches and breads are different. Carbohydrate digestion begins when these foods are chewed in the mouth and ends with elimination from the colon. Between these first and last steps, carbs are first broken down by thesaliva secreted from your salivary glands,which moistens the food as it’s chewed. This saliva contains digestive enzymes to help the body process carbohydrates, includingamylase, the enzyme responsible for breaking down carbs. Once the digested food reaches the pancreas,it releases pancreatic amylase to break down carbs into dextrin and maltose, which are finally made into glycogen to be stored in the liver. **Amylase — The Enzyme That Breaks Down Carbohydrates** Enzymes like amylase are needed for proper digestion according naturopathic doctor Josh Axe, but most people don’t get enough. As a result their saliva lacks the proper enzymes to break down carbs, and everything from dental problems to gas, digestive problems and more can happen. “Without proper levels of amylase and other digestive enzymes, it really is impossible to have your health be at its best,” Dr. Axesaid on his website. He recommends supplementation with amylase for people who don’t have enough stored within their bodies. Enzymes are held in a bank account of sorts, and when the account starts running low, you need to add more “deposits” to make your digestion work properly. “At this point (the conclusion of the carbohydrate breakdown process), if you don’t have a deficit of digestive enzymes, then most of the work is done,” Axe said. “However, for many people, digestive enzyme supplementation is needed and helps this whole process take place as it should.” **Top Food Sources of Amylase** There are several different food sources of amylase as well. Many of the top sources come from the brassica (cruciferous) vegetable family, including the following: Beets Celery Cauliflower Onions Turnips Other sources of amylase include: All cereal grasses except barley (contains alpha amylase, which breaks down random locations on the “chain” like structure of starches and carbohydrates) Corn (make sure yours is not GMO) Oats Rice Sweet potato (contains beta amylase, which breaks down the ends of the carbohydrate starch chain, including the large polysaccharide structures within the molecules) A molecular model of amylase. Photo via Laguna Design “Enzymes play a key role in every function in the human body,” Dr. Axe said. “These protein-based substances are involved in breathing, eating, digestion, kidney and liver function, reproduction and more.” **Where to Find Digestive Enzyme Supplements** Digestive enzyme supplements aren’t especially popular yet among most everyday health food store companies, as items likeelderberry,vitamin C, vitamin D and zinc (justifiably so) have been among the most widely purchased during the COVID-19 situation. But these supplements are becoming increasingly popular among people who want to support their overall health, and their ability to digest their favorite foods like pizza, pasta, bread and other carbohydrates, in a natural and holistic-minded way. Digestive enzymes are typically taken with large meals as a supplement to help your body digest carbs, proteins, and fats more efficiently. This helps prevent bloating, post-meal fatigue, and may even help prevent weight gain in people whose digestion needs an assist. I am a big fan ofthis protein and digestive enzyme supplement from Touchstone Essentials, whichcontains five different enzymes (including Amylase)to help your body break down everything including fats and carbohydrates. ******* Big Sale Happening Now At Paleo Valley! Take 20% Off For Earth Day – Find DealsHere The BEST Mushroom Capsules, Protein, and More (Plus a Free Pack…) Of Beef Sticks! Find It AllHere ********* When shopping for digestive enzyme supplements, make sure you find one that contains amylase in its formula, especially if you eat carbs even two or three times per week. Speaking of digestive enzymes, I also like the formula from the Global Healing Center calledVeganZymeshown below. The company uses biodynamic, organic ingredients and ships everything in glass bottles for maximum purity and safety. Check them out here, or click on the picture below for more info. Thanks for reading! **You can also find the enzyme mentioned here in thePaleo Valley Supergreens Product.** This is the best tasting organic super greens I have ever had…Bar none… Find it – Here Thanks for installing theBottom of every postplugin by Corey Salzano. Contact me if you needcustom WordPress pluginsor website design. **Comments** comments Nick Meyer is a journalist who's been published in the Detroit Free Press, Dallas Morning News and several other outlets. He founded AltHealthWORKS in 2012 to showcase extraordinary stories of healing and the power of organic living, stories the mainstream media always seemed to miss. Check out Nick's Amazon best-seller'Dirt Cheap Organic: 101 Tips For Going Organic on a Budget' by clicking here, as well as its sequelDirt Cheap Weight Loss. **Leave a ReplyCancel reply** You must belogged into post a comment. **Archives** Facebook Twitter Google+ LinkedIn Pinterest StumbleUpon Tumblr Blogger Myspace Delicious Yahoo Mail Gmail Newsvine Digg FriendFeed Buffer Reddit VKontakte **Pin It on Pinterest**"}