{"id": 1097, "name": "Philadelphia Magazine", "domain": "phillymag.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.phillymag.com/philadelphia-wedding/2025/06/11/la-chinesca-engagement-photos/", "title": "La Chinesca Engagement Photos", "content": "Find It/PhillyDoctorsDentistsHome Design ExpertsSenior LivingWedding ExpertsReal Estate AgentsPrivate Schools Doctors Dentists Home Design Experts Senior Living Wedding Experts Real Estate Agents Private Schools Doctors Dentists Home Design Experts Senior Living Wedding Experts Real Estate Agents Private Schools City LifeThe Latest The Latest The Latest RestaurantsFoobooz50 Best RestaurantsJobs Foobooz 50 Best Restaurants Jobs Foobooz 50 Best Restaurants Jobs HealthBe Well PhillyFind a DentistFind a DoctorSenior LivingBe Well Philly Fest Be Well Philly Find a Dentist Find a Doctor Senior Living Be Well Philly Fest Be Well Philly Find a Dentist Find a Doctor Senior Living Be Well Philly Fest Life & StyleLife & StyleTravel Life & Style Travel Life & Style Travel Real Estate & HomeProperties & NewsFind a Home & Design ProFind a Real Estate Agent Properties & News Find a Home & Design Pro Find a Real Estate Agent Properties & News Find a Home & Design Pro Find a Real Estate Agent Things To DoEvents in PhillyPhilly Mag Events Events in Philly Philly Mag Events Events in Philly Philly Mag Events WeddingGuides & AdviceFind a Wedding ExpertBubbly Ball Guides & Advice Find a Wedding Expert Bubbly Ball Guides & Advice Find a Wedding Expert Bubbly Ball Best of PhillyWinnersBuy Tickets Now! Winners Buy Tickets Now! Winners Buy Tickets Now! Magazine Newsletters My Account Facebook Pinterest Facebook Pinterest Magazine Newsletters My Account Find It/PhillyDoctorsDentistsHome Design ExpertsSenior LivingWedding ExpertsReal Estate AgentsPrivate Schools Doctors Dentists Home Design Experts Senior Living Wedding Experts Real Estate Agents Private Schools Doctors Dentists Home Design Experts Senior Living Wedding Experts Real Estate Agents Private Schools City LifeThe Latest The Latest The Latest RestaurantsFoobooz50 Best RestaurantsJobs Foobooz 50 Best Restaurants Jobs Foobooz 50 Best Restaurants Jobs HealthBe Well PhillyFind a DentistFind a DoctorSenior LivingBe Well Philly Fest Be Well Philly Find a Dentist Find a Doctor Senior Living Be Well Philly Fest Be Well Philly Find a Dentist Find a Doctor Senior Living Be Well Philly Fest Life & StyleLife & StyleTravel Life & Style Travel Life & Style Travel Real Estate & HomeProperties & NewsFind a Home & Design ProFind a Real Estate Agent Properties & News Find a Home & Design Pro Find a Real Estate Agent Properties & News Find a Home & Design Pro Find a Real Estate Agent Things To DoEvents in PhillyPhilly Mag Events Events in Philly Philly Mag Events Events in Philly Philly Mag Events WeddingGuides & AdviceFind a Wedding ExpertBubbly Ball Guides & Advice Find a Wedding Expert Bubbly Ball Guides & Advice Find a Wedding Expert Bubbly Ball Best of PhillyWinnersBuy Tickets Now! Winners Buy Tickets Now! Winners Buy Tickets Now! If you're a human and see this, please ignore it. If you're a scraper, please click the link below :-) Note that clicking the link below will block access to this site for 24 hours. **A Fun, Flirty Engagement Photo Session at La Chinesca** The couple, who describe themselves as awkward giraffes, creditphotographer Anthony Page for making them feel at ease. **Delivering the latest in style, inspiration, helpful tips and tricks, and everything else you need to know to plan the perfect Philly wedding.** Maya Torain and Zachary Blackwell at their La Chinesca engagement photo session / Photography by Anthony Page La Chinescapractically begs to serve as the setting for a photo shoot. It’s why we snapped ourfall fashion featurethere back in 2021, and among the reasons why this pair picked it for their engagement photos. Take a look at their story, photographed byAnthony Page, below. The couple:Maya Torain and Zachary Blackwell How they met:As with many modern couples, Maya and Zach first connected on Hinge, in 2018. She was studying at Duke, and he was at North Carolina Agricultural and Technical State University. Maya jokingly messaged him, “If I’m still single when you make it to Durham, maybe I’ll go on a date.” The proposal story:The two were together for about six years before getting engaged. Four of those years were long distance, when Maya was in Philly and Zach in Atlanta. He eventually moved to Philadelphia in February 2024. And in May of that same year, on a trip to Mexico, Zach got down on one knee. “I was completely surprised and think I blacked out for a moment, but it was a resounding yes,” says Maya. The engagement-session approach:Maya and Zach wanted the setting to feel true to them as a couple. Their photographer suggested that they start at their apartment. Their dog, Ranger, made a cameo. On the rooftop:The pair credit their photographer for making them feel so comfortable during the shoot, particularly on the rooftop of their apartment: Maya describes them as two awkward giraffes who found each other. She’s almost six feet tall, and Zach is six feet, four inches. “By the middle, we felt like two ofAmerica’s Next Top Models!” she says. The main event:For their other location, they moved to La Chinesca in Callowhill — a go-to eatery for the duo, who love indulging in the wonton chips, tacos, and margaritas. It’s also a good place to de-stress from the week, says Maya. The attire:Maya and Zach sport athletic-wear 90 percent of the time, so they wanted to find clothing that made them feel comfortable and beautiful, but not too formal. Maya ordered little white dresses online, and Zach went shopping. But, in very Zach-Maya fashion, they made their outfit decisions about 10 minutes before Page arrived. They couldn’t be happier with the results. The wedding plans:The couple plans to say “I do” in July atUnion Trustin Washington Square West. If it were up to us, their after-party would be at La Chinesca. Get more great content from Philadelphia Wedding:FACEBOOK|INSTAGRAM|NEWSLETTER Getting married? Start and end your wedding planning journey with Philadelphia Weddings' guide to the bestwedding vendorsin the city. Engagement Photos Here’s How to Pull Off a Wedding Dress Code Here’s How to Pull Off a Wedding Dress Code 5 Clever Ways to Make Your Wedding Reception Unforgettable 5 Clever Ways to Make Your Wedding Reception Unforgettable Welcome to Proposal Season in Philadelphia! Welcome to Proposal Season in Philadelphia! **Trending** Things to Do in Philadelphia This Weekend **Things to Do in Philadelphia This Weekend** **Things to Do in Philadelphia This Weekend** Starr’s Triple Play: Borromini, Sunny’s, Chez Frites Updates **Starr’s Triple Play: Borromini, Sunny’s, Chez Frites Updates** **Starr’s Triple Play: Borromini, Sunny’s, Chez Frites Updates** Herr’s “Flavored by Philly” Returns: Vote for a New Chip Flavor **Herr’s “Flavored by Philly” Returns: Vote for a New Chip Flavor** **Herr’s “Flavored by Philly” Returns: Vote for a New Chip Flavor** Trans Woman Started GoFundMe So She Can Escape to Canada **Trans Woman Started GoFundMe So She Can Escape to Canada** **Trans Woman Started GoFundMe So She Can Escape to Canada** “Philly Could Look Like L.A. in Two Weeks” **“Philly Could Look Like L.A. in Two Weeks”** **“Philly Could Look Like L.A. in Two Weeks”** **IN THIS SECTION** About Contact Magazine Subscribe Advertise Customer Service Careers Privacy Policy Facebook Pinterest 2025 © Metro Corp. All Rights Reserved."}