{"id": 879, "name": "The Republican (Masslive)", "domain": "masslive.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.masslive.com/westernmass/2025/06/i-killed-two-people-witness-reports-abrupt-confession-from-a-woman-who-crashed-into-a-trooper-causing-serious-injuries.html", "title": "I Killed Two People Witness Reports Abrupt Confession From A Woman Who Crashed Into A Trooper Causing Serious Injuries.html", "content": "**‘I killed two people’: Witness reports abrupt confession from woman who crashed into trooper, causing serious injuries** Updated:Jun. 11, 2025, 4:47 p.m. |Published:Jun. 11, 2025, 4:05 p.m. Naisha Rodriguez was arraigned in Chicopee District Court on Wednesday morning, represented by defense attorney Daniel Bergin. It is alleged that she struck a Massachusetts State Police trooper who was conducting a traffic stop on the Massachusetts Turnpike on Tuesday. She hid her face from the media in court. (Douglas Hook / The Republican)Douglas Hook Stephanie Barry | sbarry@repub.com CHICOPEE — The Springfield womanwho allegedly plowed into a trooper conducting a traffic stop Tuesday morningtold her employer and the police that she had been attacked at a convenience store by several women and that her car was stolen. This is according to court records associated with the arrest of Naisha L. Rodriguez, 32, of Springfield.She was arraigned in Chicopee District Court Wednesdaymorning after being charged with driving while under the influence of alcohol causing serious injury, intimidating a witness, leaving the scene of a crash and falsely reporting a stolen vehicle. If you purchase a product or register for an account through a link on our site, we may receive compensation.By using this site, you consent to ourUser Agreementand agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with ourPrivacy Policy. **Footer Navigation** Contact MassLive Contact The Republican MassLive.com Newsletters Breaking news push alerts The Republican E-edition Login Subscriptions and Circulation About MassLive Media Advertise with us Sponsor Content Accessibility Statement Facebook Worcester Facebook Red Sox Facebook Patriots Facebook Bruins Facebook Twitter YouTube HS Sports Twitter Sports Twitter Instagram HS Sports Instagram RSS News Sports Entertainment Politics Opinion High School Sports Betting Living Real Estate Obituaries Classifieds Autos Jobs Careers at MassLive Archives Community rules The Republican Archives The Republican Special Sections Place an ad Your Privacy Choices Privacy Policy |User Agreement |Ad Choices **Disclaimer** Use of and/or registration on any portion of this site constitutes acceptance of ourUser Agreement, (updated 8/1/2024) and acknowledgement of ourPrivacy Policy,andYour Privacy Choices and Rights(updated 1/1/2025). ©2025Advance Local Media LLC. All rights reserved (About Us).The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Advance Local. Community Rulesapply to all content you upload or otherwise submit to this site. YouTube's privacy policyis availablehereandYouTube's terms of serviceis availablehere. Ad Choices"}