{"id": 692, "name": "International Press Institute", "domain": "ipi.media", "bias": "center", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://ipi.media/events/autocrats-unleashed-defending-free-journalism-amid-rising-authoritarianism-and-declining-accountability/", "title": "Autocrats Unleashed Defending Free Journalism Amid Rising Authoritarianism And Declining Accountability", "content": "AboutAboutAwardsGovernanceHistorySupporters and PartnersTeam About Awards Governance History Supporters and Partners Team About Awards Governance History Supporters and Partners Team Support Our Work 2025 IPI World Congress: Registration Open Key TopicsSelect a topicRussia-Ukraine WarWorld Press Freedom DayClimate JournalismDigital TransitionSLAPPsJournalist SafetyMedia CaptureDisinformation Russia-Ukraine War World Press Freedom Day Climate Journalism Digital Transition SLAPPs Journalist Safety Media Capture Disinformation Russia-Ukraine War Russia-Ukraine War World Press Freedom Day World Press Freedom Day Climate Journalism Climate Journalism Digital Transition Digital Transition SLAPPs SLAPPs Journalist Safety Journalist Safety Media Capture Media Capture Disinformation Disinformation NetworkBecome a MemberMeet Our MembersExecutive BoardNational CommitteesIPI FellowsIPI auf DeutschHelsingin Sanomat Foundation Journalism Fellowship at IPI Become a Member Meet Our Members Executive Board National Committees IPI Fellows IPI auf Deutsch Helsingin Sanomat Foundation Journalism Fellowship at IPI Become a Member Meet Our Members Executive Board National Committees IPI Fellows IPI auf Deutsch Helsingin Sanomat Foundation Journalism Fellowship at IPI AdvocacyAdvocacy: All News and StatementsAfrica ProgrammeClimate JournalismEurope: Media Freedom Rapid Response (MFRR)Media Capture in EuropeTurkey ProgrammeUkraine War Press Freedom TrackerIPI/IMS World Press Freedom HeroIPI/IMS Free Media Pioneer Advocacy: All News and Statements Africa Programme Climate Journalism Europe: Media Freedom Rapid Response (MFRR) Media Capture in Europe Turkey Programme Ukraine War Press Freedom Tracker IPI/IMS World Press Freedom Hero IPI/IMS Free Media Pioneer Advocacy: All News and Statements Africa Programme Climate Journalism Europe: Media Freedom Rapid Response (MFRR) Media Capture in Europe Turkey Programme Ukraine War Press Freedom Tracker IPI/IMS World Press Freedom Hero IPI/IMS Free Media Pioneer Supporting JournalismIJ4EU (Investigative Journalism for Europe)Decoding and Disarming DisinformationCountering Online HarassmentIPI Workshops Against Online Harassment and DisinformationCentral Europe Independent Media Network IJ4EU (Investigative Journalism for Europe) Decoding and Disarming Disinformation Countering Online Harassment IPI Workshops Against Online Harassment and Disinformation Central Europe Independent Media Network IJ4EU (Investigative Journalism for Europe) Decoding and Disarming Disinformation Countering Online Harassment IPI Workshops Against Online Harassment and Disinformation Central Europe Independent Media Network Media InnovationMedia InnovationMedia Innovation at IPIAbout usMedia Innovation CohortsNewsImpact Report 2024OpportunitiesNew Media Incubator 2025Transition AcceleratorLocal News AcceleratorLocal News and Innovation NetworkMentorship ProgrammeCall for applications: Media ConsultantsMedia Innovation EuropeIPI Media Innovation EuropeValidation Booster 2025Audience-Engaged Journalism Grants 2024Deep-Dive Business ConsultancyMedia Blend HackathonFAQsPartnersEventsIPI Media Innovation Festival 2025Virtual Newsroom VisitsResourcesRevenue Roadmap: A guidebook to diversifying revenue and editorial innovationThe Outlook: Media Innovation UnlockedTraining ResourcesThe local journalism project Media Innovation Media Innovation at IPI About us Media Innovation Cohorts News Impact Report 2024 Opportunities New Media Incubator 2025 Transition Accelerator Local News Accelerator Local News and Innovation Network Mentorship Programme Call for applications: Media Consultants Media Innovation Europe IPI Media Innovation Europe Validation Booster 2025 Audience-Engaged Journalism Grants 2024 Deep-Dive Business Consultancy Media Blend Hackathon FAQs Partners Events IPI Media Innovation Festival 2025 Virtual Newsroom Visits Resources Revenue Roadmap: A guidebook to diversifying revenue and editorial innovation The Outlook: Media Innovation Unlocked Training Resources The local journalism project Media Innovation Media Innovation at IPI About us Media Innovation Cohorts News Impact Report 2024 Opportunities New Media Incubator 2025 Transition Accelerator Local News Accelerator Local News and Innovation Network Mentorship Programme Call for applications: Media Consultants Media Innovation Europe IPI Media Innovation Europe Validation Booster 2025 Audience-Engaged Journalism Grants 2024 Deep-Dive Business Consultancy Media Blend Hackathon FAQs Partners Events IPI Media Innovation Festival 2025 Virtual Newsroom Visits Resources Revenue Roadmap: A guidebook to diversifying revenue and editorial innovation The Outlook: Media Innovation Unlocked Training Resources The local journalism project EventsIPI World Congress and Media Innovation Festival 2025Newsroom VisitsAll Events IPI World Congress and Media Innovation Festival 2025 Newsroom Visits All Events IPI World Congress and Media Innovation Festival 2025 Newsroom Visits All Events AboutAboutAwardsGovernanceHistorySupporters and PartnersTeam About Awards Governance History Supporters and Partners Team About Awards Governance History Supporters and Partners Team Support Our Work 2025 IPI World Congress: Registration Open **Autocrats Unleashed: Defending Free Journalism Amid Rising Authoritarianism and Declining Accountability** April 25, 2025 Join IPI for a parallel event in Brussels, held alongside World Press Freedom Day Share on Facebook Share on X Share on Bluesky Share on LinkedIn Independent journalism across Europe faces a wide range of threats, including media capture, impunity for crimes against journalists, threats to journalists’ safety, vexatious lawsuits, smear campaigns, illegal spyware and increasingly restrictive legislation on content and funding. In recent months the social tension created by the squeezing of democratic norms has seen a wave of protests against autocratic rule. Journalists have been at the heart of developments, struggling to report the events while also being targeted by governments for doing so. Since November 28, 2024, when protests against the Georgian Dream’s decision to pause EU membership negotiations started, Georgia has seenover 90 journalistsbeaten and arrested, Turkeyrecordeddozens of arrests and fines against broadcasters since the arrest of Istanbul Mayor and Presidential Candidate, Ekrem Imamoglu in March. In Serbia, the heavy-handed government response to nationwide student-led protests over the Novi Sad train station collapse has seen a deepening of an existing campaign of pressure andattacks against independent media and critical voices, with increasing smear campaigns from high level politicians,spyware threatsand physical attacks against journalists reporting the streets. Slovakia and Hungary meanwhile seek to further tighten legislation against independent media particularly those reliant on foreign funding to pursue their profession. Yet independent journalists refuse to be silenced. They continue to report critical news and information, shed light on abuses of power and corruption and hold those responsible accountable. **The IPI Weekly Digest** Subscribe for press freedom news and updates, opportunities for journalists, and the latest in media innovation. In these extraordinary times, when the international rules based order is under attack, far-right and illiberal forces are on the rise, and democratic freedoms are being eroded, how can journalists, media freedom groups and the international community, including the EU respond to the multiple crises facing press freedom and democratic governance? We are bringing together journalists and press freedom experts from Hungary, Slovakia, Turkey, Georgia and Serbia to address these challenges to media freedom head on. Together, we will explore the role of international advocacy, examine some of the tools being developed under the EU’s Democracy Shield, and discuss how the international community can act collectively to safeguard media freedom as one of the major pillars of democracy. Speakers: Marton Karpati, CEO, Telex, Hungary Beata Balagova, Editor in chief, SME, Slovakia Dato Parulava, Web Producer, Politico Europe, Georgia Gulsin Harman IPI NC Vice Chair, Turkey Oliver Money-Kyrle, Head of Europe Advocacy, International Press Institute (IPI) Jamie Wiseman, Europe Advocacy Officer, International Press Institute (IPI) Moderator: Scott Griffen, Executive Director, International Press Institute (IPI) **Become a member** IPI membership is open to anyone active in the field of journalism, in news media outlets, as freelancers, in schools of journalism or in defence of press freedom rights, who supports the principle of freedom of the press and desires to co-operate in achieving IPI’s objectives. Become a member **Latest** IPI is a global network of editors, media executives and leading journalists. Our mission is to defend media freedom and support independent journalism wherever they are threatened. **Join the fight for press freedom!** Truth and facts are under threat. Don’t stay silent—stand with IPI for press freedom! Sign up for updates and learn how you can help us make a difference. Contact us! Careers Privacy Policy IPI Newsletters"}