{"id": 292, "name": "Crikey", "domain": "crikey.com.au", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.crikey.com.au/2025/06/05/woodside-north-west-shelf-barossa-scarborough-surat-narrabri-beetaloo-basin-browse-basin/", "title": "Woodside North West Shelf Barossa Scarborough Surat Narrabri Beetaloo Basin Browse Basin", "content": "EOFY sale: unlimited access for just $79/year Log in Log in Search Search News Analysis Opinion Tips and Murmurs Politics Media Justice Environment Economy Business World Got a tip? Crikey Daily Crikey Worm Sign up to our newsletters About Crikey News Analysis Opinion Tips and Murmurs Politics Media Environment Economy Business World Got a tip? Search Search **Create a free account, or log in** **Share this article** If you like this article, share it with your friends. Environment Environment Analysis Analysis Politics Politics **Woodside’s North West Shelf approval isn’t a one-off. Here are six other giant gas projects to watch** Share Share The federal government’sdecision to extend the lifeof Woodside’s North West Shelf gas plant in Western Australia has beencondemned as a climate disaster. The gas lobby claims more gas is needed to secure energy supplies, pointing topredictedgas shortagesin parts of Australia in the short term. But given most proposed gas projects are directed at the export market, the problem is likely to persist. And thescience is clear: no fossil fuel projects can be opened if the world is to avoid catastrophic climate change. Despite this, a slew of polluting gas projects are either poised to begin operating in Australia, or lie firmly in the sights of industry. **How Australia’s gas contributes to climate change** Gas production in Australia harms the climate in two ways. The first is via “fugitive” emissions: leaks and unintentional releases that occur when gas is being extracted, processed and transported. These emissions are typically methane, whichtraps more heat in the atmosphereper molecule than carbon dioxide. Fugitive emissions count towards Australia’s greenhouse gas accounts, comprisingabout 6% of our total emissions. So, government approval for new gas projects undermines Australia’s commitment to reaching net-zero emissions. Labor enshrined this goal in legislation in its previous term of government, and all states and territorieshave also adopted it. The second climate harm occurs when Australia’s gas is burned for energy overseas. Those emissions do not count towards our national emissions accounts, but they substantially contribute to global warming. Under national environment law, the federal government is not required to consider the potential harm a project might cause to the global climate. This loophole means fossil fuel developments can continue to win government backing. Below, I outline six of the biggest gas projects Australia has in the pipeline. **1. Barossa Gas Project** This $5.6 billionprojectby energy giant Santos is located in the Timor Sea, about 300 kilometres north of Darwin. The Australian government’s offshore energy regulatorapproved it in April this year. The project will extract gas from the Barossa field and transport it to a liquified natural gas (LNG) facility in Darwin for processing and export. Theventure would reportedlybe among the worst polluting oil and gas projects in the world. On one estimate, it wouldrelease about 380 million tonnesof climate pollution over its 25-year life. **2. Scarborough Pluto Train 2** Pluto Train 2 is an extension of Woodside’sexisting Scarborough project, centred around a gas field about 375 kilometres off WA’s Pilbara coast. A 430-kilometre pipeline would connect that gas to a second LNG train at a facility near Karratha. “Train” refers to the unit in a plant that turns natural gas into liquid. The project hasfederal and state approval. It is about 80% complete and scheduled to begin operating by next year. According to Climate Analytics, the expansion would create about9.2 million tonnes of carbon dioxide equivalent each year. **3. Surat Phase 2** This coal seam gas projectin Gladstone, Queensland, would be operated by Arrow Energy, a joint venture between Shell and PetroChina. It involves substantially expanding existing gas fields by buildingup to 450 new production wells. The project is expected to supply130 million cubic feetof gas each day at its peak, and has been opposed by environment groups. **4. Narrabri Gas Project** This$3.6 billion Santos projectin northwest New South Wales involves drilling up to 850 coal seam gas wells over 95,000 hectares. The National Native Title Tribunal last month ruled leases for the project could be granted, leaving Santos only a few regulatory barriers to clear. Environmental groups and Traditional Owners say the project threatens water resources, biodiversity and Indigenous sites. However,the tribunal foundthe project’s benefits to energy reliability outweighed those concerns. **5. Beetaloo Basin** The Beetaloo Basin is located 500 kilometres southeast of Darwin. It covers 28,000 kilometres and is estimated to contain up to 500 trillion cubic feet of gas. A number of companies are vying for the right to develop the huge resource. It is predicted to emitup to 1.2 billion tonnes over 25 years. ACSIRO report saysBeetaloo could be tapped without adding to Australia’s net emissions. However,experts saythe report was too optimistic and relies far too heavily on carbon offsets. **6. Browse Basin** Browse Basin, 425 kilometres north of Broome off WA, is considered Australia’s biggest reserve of untapped conventional gas. Woodsideplansto develop the Browse gas fields, but the area is remote and difficult to access.According to the ABC, Woodside’s North West Shelf project is considered the last hope for extracting the valuable resource. Environmental groups say the project, if approved,would emit 1.6 billion tonnes of climate pollution— three times Australia’s current annual emissions. The basin is also located near the pristine Scott Reef, a significant coral reef ecosystem. **A major disconnect** The projects listed above, if they proceed, willweaken Australia’s effortsto reach its emission reduction goals. And their overall climate impact is truly frightening. The reelected Labor government haspledged to revisit attemptsto reform national environment laws. This presents a prime opportunity to ensure the climate harms of fossil fuel projects are key to environmental decision-making. This was republished fromThe Conversation. **About the author** Contributor Samantha Hepburn is a professor of law in Deakin Law School. Previously, Samantha was an associate professor in the Faculty of Law at the Australian National University. Samantha teaches and researches in the area of property and land law, as well as mining, energy and environmental law and has published books and articles in these areas. **Similar topics** **Comments** **Recommended for you** Crikey is an independent Australian source for news, investigations, analysis and opinion focusing on politics, media, economics, health, international affairs, the climate, business, society and culture. Editorial guidelines Submission guidelines Moderation guidelines Frequently Asked Questions About Crikey Crikey Team Contact us Privacy policy Code of Conduct Terms of use Crikey acknowledges the Traditional Owners of the many nations across Australia, and pay our respect to Elders past and present. We recognise that their sovereignty has never been ceded. Copyright © 2025 Private Media Pty Ltd."}