{"id": 1615, "name": "WSLS - 10 News - Roanoke", "domain": "wsls.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wsls.com/station/2024/04/18/how-we-are-using-ai-at-graham-media-group/", "title": "How We Are Using Ai At Graham Media Group", "content": "NewsWatch LiveLocal NewsVirginiaNationalWorldHealthwatchEducationMoneyPoliticsEntertainment News Watch Live Local News Virginia National World Healthwatch Education Money Politics Entertainment News Watch Live Local News Virginia National World Healthwatch Education Money Politics Entertainment WeatherWeather Authority Alert DaySchool ClosingsTrafficPin ItPicture of the DaySkycamsForecasting ChangeKnow Your Zone - Lynchburg AreaKnow Your Zone - RoanokeKnow Your Zone - New River ValleyKnow Your Zone - SouthsideKnow Your Zone - Highlands Weather Weather Authority Alert Day School Closings Traffic Pin It Picture of the Day Skycams Forecasting Change Know Your Zone - Lynchburg Area Know Your Zone - Roanoke Know Your Zone - New River Valley Know Your Zone - Southside Know Your Zone - Highlands Weather Weather Authority Alert Day School Closings Traffic Pin It Picture of the Day Skycams Forecasting Change Know Your Zone - Lynchburg Area Know Your Zone - Roanoke Know Your Zone - New River Valley Know Your Zone - Southside Know Your Zone - Highlands Watch LiveMeet the TeamSolutionariesTV ListingsNEXTGEN TV Watch Live Meet the Team Solutionaries TV Listings NEXTGEN TV Watch Live Meet the Team Solutionaries TV Listings NEXTGEN TV Sports1st and 10High School SportsVirginia TechVirginia Tech StatsAround the Way with EJFoul CheckOlympicsNFL Sports 1st and 10 High School Sports Virginia Tech Virginia Tech Stats Around the Way with EJ Foul Check Olympics NFL Sports 1st and 10 High School Sports Virginia Tech Virginia Tech Stats Around the Way with EJ Foul Check Olympics NFL FeaturesWSLS InsiderContests & RulesTop 10 DealsFind Your MoneyIlluminightsIn Your TownJohn Carlin's OutdoorsLocal Business SpotlightTravelMeTV Features WSLS Insider Contests & Rules Top 10 Deals Find Your Money Illuminights In Your Town John Carlin's Outdoors Local Business Spotlight Travel MeTV Features WSLS Insider Contests & Rules Top 10 Deals Find Your Money Illuminights In Your Town John Carlin's Outdoors Local Business Spotlight Travel MeTV CommunityMy Hometown's BestBlue Ridge GamesEvents Calendar30 Days of HopeHome for GoodClear the SheltersConnecting CommunitiesEducation Impact AwardScholarships Community My Hometown's Best Blue Ridge Games Events Calendar 30 Days of Hope Home for Good Clear the Shelters Connecting Communities Education Impact Award Scholarships Community My Hometown's Best Blue Ridge Games Events Calendar 30 Days of Hope Home for Good Clear the Shelters Connecting Communities Education Impact Award Scholarships Pin ItLog In/Create AccountWeather PhotosMy Hometown's BestBlue Ridge GamesSports Photos Pin It Log In/Create Account Weather Photos My Hometown's Best Blue Ridge Games Sports Photos Pin It Log In/Create Account Weather Photos My Hometown's Best Blue Ridge Games Sports Photos Contact UsHelp CenterCareers at WSLSDigital Transparency GuideWeather Authority Alert DayAdvertise with us Contact Us Help Center Careers at WSLS Digital Transparency Guide Weather Authority Alert Day Advertise with us Contact Us Help Center Careers at WSLS Digital Transparency Guide Weather Authority Alert Day Advertise with us Newsletters Newsletters Newsletters News Weather Watch Live Sports Features Community Pin It Contact Us Newsletters News Weather Watch Live Sports Features Community Pin It Contact Us Newsletters Published:April 18, 2024 at 4:01 PM Updated:April 19, 2024 at 4:28 PM **LATEST NEWS** **Henry Co. Volunteer Fire Departments to charge for services** **Henry Co. Volunteer Fire Departments to charge for services** **The Longest Day: Illuminating the Fight Against Alzheimer’s** **The Longest Day: Illuminating the Fight Against Alzheimer’s** **Woman arrested, man at large after Henry County vehicle pursuit** **Woman arrested, man at large after Henry County vehicle pursuit** **Roanoke City Public Schools updates cell phone policy for 2025-2026 school year** **Roanoke City Public Schools updates cell phone policy for 2025-2026 school year** **How we are using AI at Graham Media Group** **How We Use AI** Content Creation and Curation:We use AI to assist in generating news summaries, identifying trending topics, and curating personalized content for our readers. AI algorithms analyze large volumes of information to highlight relevant news stories based on your interests. Automated Reporting:We utilize AI to produce accurate and immediate coverage for specific types of data-driven stories, such as financial reports or sports results. These algorithms are designed to understand and convert data into readable articles. This content might be used for articles, descriptions or captions for videos, graphics or images, or comments. All automated reporting will be reviewed and edited before it is published. Fact-Checking and Verification:In addition to traditional and rigorous means our journalists use to fact-check content, AI tools help us verify the authenticity of content, including images and videos. They assist in identifying potential misinformation and ensuring the accuracy of the information we publish. Reader Engagement:AI enhances user experience on our website, including chatbots for customer service inquiries and algorithms that recommend articles tailored to individual reading habits. **Our Commitment** Transparency:We are transparent about using AI and its role in our news production process. While AI aids in efficiency and accuracy, our journalists always make final editorial decisions. Ethical Considerations:We adhere to strict ethical guidelines in using AI, ensuring that it is used responsibly and does not compromise journalistic integrity or bias in our reporting. Data Protection:We prioritize the privacy and security of our readers. Any personal data used to train our AI algorithms or to personalize content is handled in strict compliance with ourprivacy policy. Accuracy and Accountability:Our editorial team monitors and reviews all AI-generated content to maintain our high standards of accuracy and reliability. We are committed to correcting any errors and being accountable for the content we publish. Anthropomorphizing AI:We do not anthropomorphize AI. Although attributing human characteristics to AI can be engaging and amusing, such practices may lead to confusion and inadvertently ascribe undue merit to artificial entities. **Continuous Evaluation** We continuously evaluate our use of AI technologies to ensure they align with our mission to inform and delight our communities and maintain the standards of trust our communities have given us. We welcome feedback from our readers and are committed to adjusting our practices to serve you better. Graham Media Group 2024 **TOP 10 DEALS** **Get 8 Japanese Master Chef knives in a gift box for just $109.97!** **Get 8 Japanese Master Chef knives in a gift box for just $109.97!** **Stop what you’re doing—get this MacBook Air for $199.97 (79% off!)** **Stop what you’re doing—get this MacBook Air for $199.97 (79% off!)** TV Listings TV Listings TV Listings Email Newsletters Email Newsletters Email Newsletters RSS Feeds RSS Feeds RSS Feeds Contests and Rules Contests and Rules Contests and Rules Contact Us Contact Us Contact Us Internships at WSLS 10 Internships at WSLS 10 Internships at WSLS 10 Careers at WSLS 10 Careers at WSLS 10 Careers at WSLS 10 Closed Captioning / Audio Description Closed Captioning / Audio Description Closed Captioning / Audio Description Public File Public File Public File Current EEO Report Current EEO Report Current EEO Report Terms of Use Terms of Use Terms of Use Privacy Policy Privacy Policy Privacy Policy Do Not Sell My Info Do Not Sell My Info Do Not Sell My Info FCC Applications FCC Applications FCC Applications Cookie Preferences Cookie Preferences Cookie Preferences If you need help with the Public File, call(540) 512-1512 At WSLS, we are committed to informing and delighting our audience. In our commitment to covering our communities with innovation and excellence, we incorporate Artificial Intelligence (AI) technologies to enhance our news gathering, reporting, and presentation processes.Read our articleto see how we are using Artificial Intelligence. Copyright © 2025 WSLS.com is managed by Graham Digital and published by Graham Media Group, a division of Graham Holdings."}