{"id": 1957, "name": "Cambodia Daily", "domain": "english.cambodiadaily.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://english.cambodiadaily.com/2025/01/18/the-deafening-silence-of-hun-sen-and-the-cambodian-government-following-the-assassination-of-opposition-figure-lim-kimya-in-bangkok/", "title": "The Deafening Silence Of Hun Sen And The Cambodian Government Following The Assassination Of Opposition Figure Lim Kimya In Bangkok", "content": "ភាសាខ្មែរ News Politics Business Environment Lifestyle The Weekly Dispatch Home Support The Daily The Weekly Dispatch About Us Contact Us ភាសាខ្មែរ News Politics Business Environment Lifestyle The Weekly Dispatch **The Deafening Silence of Hun Sen and the Cambodian Government Following the Assassination of Opposition Figure Lim Kimya in Bangkok** On Jan. 7, 2025, the world learned with shock of the broad-daylight assassination of Lim Kimya in Bangkok. RELATED Widow says shooting of former Cambodian lawmaker was ‘definitely political’ This political opposition figure, a former member of parliament for the Cambodia National Rescue Party (CNRP), which had been arbitrarily dissolved by the authorities, was known for his outspoken criticism. He was gunned down in the streets under circumstances that raise numerous questions. The modus operandi of this assassination mirrors that of politically motivated killings in Cambodia. What could have been a moment of reflection for the Cambodian government or a catalyst for political change has instead been met with the frozen silence of Hun Sen and the government in Phnom Penh, adding fuel to the controversy. In full:https://thegeopolitics.com/the-deafening-silence-of-hun-sen-and-the-cambodian-government-following-the-assassination-of-opposition-figure-lim-kimya-in-bangkok/ **Khmer Will Party Amends Charter to Pave Way for Political Alliances** **Observers Dismiss Hun Manet’s Visit to France as Lacking Substance** **Opposition Lawmaker Urges National Unity Amid Tensions with Thailand** **Khmer Will Party Amends Charter to Pave Way for Political Alliances** **Observers Dismiss Hun Manet’s Visit to France as Lacking Substance** **Cambodian Defence Ministry Denies Withdrawing Troops from Disputed Border Area** **Cambodia-US Tariff Dispute Seen as More Than a Trade Deficit** **Cambodian Government Files Border Dispute Case Against Thailand at International Court of Justice** **The biggest news shaping Cambodia delivered to your inbox every Friday at 11:30am.** **The biggest news shaping Cambodia delivered to your inbox every Friday at 11:30am.** **Khmer Will Party Amends Charter to Pave Way for Political Alliances** **Observers Dismiss Hun Manet’s Visit to France as Lacking Substance** **Cambodian Defence Ministry Denies Withdrawing Troops from Disputed Border Area** **Cambodia-US Tariff Dispute Seen as More Than a Trade Deficit** **Cambodia to Host Joint Border Committee Meeting with Thailand in Phnom Penh on June 14** **Cambodia’s ‘lords’ form union under Hun Sen ahead of polls** **UN chief implicitly criticizes Cambodia’s upcoming elections after top opposition party ban** **Foreign Ministry says Anwar unaware of Cambodian opposition figure’s entry** **Cambodia Disqualifies Main Opposition Party Ahead of Election** **SEA Games 2023: It’s time to party, Cambodia** News47514 Business3236 Politics2955 Today’s Top News1800 Health1367 Lifestyle1300 Environment1003 Opinion952 **ABOUT US** The Cambodia Daily is an independent non-profit digital news service for Cambodia and Cambodians. Contact us:editor at cambodiadaily dot com **FOLLOW US** © 2025 The Cambodia Daily LLC Home About Us Support The Cambodia Daily Weekly Dispatch Contact Us"}