{"id": 1501, "name": "TVA Nouvelles", "domain": "tvanouvelles.ca", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.tvanouvelles.ca/2025/06/11/un-abus-de-pouvoir-repugnant-et-inutile--lanimateur-jimmy-kimmel-fustige-donal-trump-pour-avoir-deploye-la-garde-nationale-a-los-angeles", "title": "Un Abus De Pouvoir Repugnant Et Inutile  Lanimateur Jimmy Kimmel Fustige Donal Trump Pour Avoir Deploye La Garde Nationale A Los Angeles", "content": "AccueilPopulaires dans Accueil ActualitésToute l'actualitéTarifs douaniersInfo patrouillePolitiqueInternationalJudiciaireArgentConsommationCultureSantéSociétéEnvironnementVoyagesTechnoFaites la différencePopulaires dans Actualités Toute l'actualité Tarifs douaniers Info patrouille Politique International Judiciaire Argent Consommation Culture Santé Société Environnement Voyages Techno Faites la différence Toute l'actualité Tarifs douaniers Info patrouille Politique International Judiciaire Argent Consommation Culture Santé Société Environnement Voyages Techno Faites la différence Ma régionToutes les régionsTVA MontréalTVA QuébecTVA SherbrookeTVA Trois-RivièresTVA Saguenay-Lac-St-JeanTVA Est-du-QuébecPopulaires dans Ma région Toutes les régions TVA Montréal TVA Québec TVA Sherbrooke TVA Trois-Rivières TVA Saguenay-Lac-St-Jean TVA Est-du-Québec Toutes les régions TVA Montréal TVA Québec TVA Sherbrooke TVA Trois-Rivières TVA Saguenay-Lac-St-Jean TVA Est-du-Québec ArgentToute l'économieTarifs douaniersVos financesPMERetraiteImmobilierDans vos pochesDes idées pour entreprendrePopulaires dans Argent Toute l'économie Tarifs douaniers Vos finances PME Retraite Immobilier Dans vos poches Des idées pour entreprendre Toute l'économie Tarifs douaniers Vos finances PME Retraite Immobilier Dans vos poches Des idées pour entreprendre SportsTous les sportsCanadiensLNHAlouettesMLBArticles récents Tous les sports Canadiens LNH Alouettes MLB Tous les sports Canadiens LNH Alouettes MLB Guide d’achat Vidéos Émissions Infolettre Que cherchez vous ? Accueil / Actualités / Culture **«Un abus de pouvoir répugnant et inutile»: l’animateur Jimmy Kimmel fustige Donald Trump pour avoir déployé la Garde nationale à Los Angeles** Dans le monologue d’ouverture de son émission de mardi soir, l’animateur Jimmy Kimmel s’en est pris à Donald Trump et à sa décision d’avoir envoyé des troupes à Los Angeles pour gérer les manifestations contre sa politique migratoire. L’humoriste, qui a souvent eu maille à partir avec le président républicain, a décrit le geste de Trump comme «un abus de pouvoir répugnant et inutile». Kimmel a commencé son monologue en montrant des images d’une scène de vie normale, filmée devant son studio de Los Angeles, en disant qu’elle pourrait surprendre les téléspectateurs «qui ont regardé les informations télévisées et qui pensent que cette ville est une sorte d’enfer totalitaire en ce moment». «Ce n’est absolument pas le cas», a-t-il insisté en soulignant que Disney organisait même une première de film dans le même quartier. «Mais ne le dites pas à Trump. Il va envoyer les Bérets verts!» a-t-il ajouté. «Je suis très en colère», a poursuivi Kimmel sur un ton plus sérieux. «Je n’arrive pas à croire ce qui se passe. Je savais que ça allait mal tourner. Je ne savais pas que ça allait être aussi grave. Des gens qui vivent ici depuis toujours, des gens qui sont dans cette ville depuis plus longtemps que moi, dont la grande majorité [d’entre eux] n’ont jamais rien fait de mal, sont enlevés – c’est le terme juste – par des agents masqués qui cachent leur identité. Ils arrêtent des gens dans la rue et au travail, et les envoient en centres de détention.» «Protester contre cela n’est pas seulement notre droit en tant qu’Américains, c’est notre responsabilité», a insisté l’animateur de 57 ans. «Les habitants de Los Angeles se sont rassemblés pour manifester et, à de rares exceptions près, ils l’ont fait pacifiquement ​​pour exprimer leur opposition à cet abus de pouvoir répugnant et inutile, fomenté par notre président atteint de troubles mentaux.» **Recommandé pour vous** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **Ailleurs sur le web** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **En collaboration avec nos partenaires** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** **** Vous devez être connecté pour commenter.Se connecter Bienvenue dans la section commentaires! Notre objectif est de créer un espace pour un discours réfléchi et productif. En publiant un commentaire, vous acceptez de vous conformer auxConditions d'utilisation. **Les plus populaires** **** **** **** **** **** **** **** **** **** **** **** **** Nous suivre Profil Bluesky Page Twitter Applications mobiles Android iOS Questions, réactions ou problèmes techniques? Nous joindre **Sections importantes** Accueil **Accueil** **Accueil** Actualité **Actualité** **Actualité** Ma région **Ma région** **Ma région** Argent **Argent** **Argent** Sports **Sports** **Sports** Buzz **Buzz** **Buzz** Dossiers **Dossiers** **Dossiers** Vidéos **Vidéos** **Vidéos** Télé **Télé** **Télé** Grille horaire **Grille horaire** **Grille horaire** État des écoles **État des écoles** **État des écoles** Infolettre **Infolettre** **Infolettre** Groupe TVA Copyright © 1998-2024 - Tous droits réservés. Une réalisation de NumériQ. REGISTRE DES PUBLICITÉS ÉLECTORALES FÉDÉRALES Confidentialité Conditions d'utilisation"}