{"id": 2077, "name": "Offgrid Survival", "domain": "offgridsurvival.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://offgridsurvival.com/national-guard-arrives-in-l-a-amid-curfews-and-looting-concerns-following-devastating-fires/", "title": "National Guard Arrives In L A Amid Curfews And Looting Concerns Following Devastating Fires", "content": "Home Contact About OFFGRIDRobert RichardsonMedia KitBooksSituational SurvivalPrepper Radio Robert RichardsonMedia KitBooksSituational SurvivalPrepper Radio Media Kit BooksSituational SurvivalPrepper Radio Situational Survival Prepper Radio Robert RichardsonMedia KitBooksSituational SurvivalPrepper Radio Media Kit BooksSituational SurvivalPrepper Radio Situational Survival Prepper Radio Media Kit BooksSituational SurvivalPrepper Radio Situational Survival Prepper Radio Situational Survival Prepper Radio Advertising Newsletter Facebook Twitter Pinterest Instagram Youtube NewsEconomic Preparedness Economic Preparedness Economic Preparedness Off the GridSustainable Living BlogAlternative EnergyBuildingFoodHomeschoolHomesteadTravel & RV Sustainable Living BlogAlternative EnergyBuildingFood Alternative Energy Building Food Homeschool Homestead Travel & RV Sustainable Living BlogAlternative EnergyBuildingFood Alternative Energy Building Food Alternative Energy Building Food Homeschool Homestead Travel & RV OutdoorsLifestyleCampingHiking & BackpackingSafetyHiking GearOutdoor TipsProfiles Lifestyle Camping Hiking & BackpackingSafety Safety Hiking Gear Outdoor Tips Profiles Lifestyle Camping Hiking & BackpackingSafety Safety Safety Hiking Gear Outdoor Tips Profiles PreparednessMan-made DisastersNatural DisastersPlanningPrepping Man-made Disasters Natural Disasters Planning Prepping Man-made Disasters Natural Disasters Planning Prepping SurvivalBug OutEmergency CommunicationHam RadioFishing Hunting & TrappingFood & WaterShelterSurvival GearSurvival KnivesSurvival SkillsSurvivalismSHTF ThreatsUrban SurvivalWilderness Bug Out Emergency CommunicationHam Radio Ham Radio Fishing Hunting & Trapping Food & Water Shelter Survival Gear Survival Knives Survival Skills Survivalism SHTF Threats Urban Survival Wilderness Bug Out Emergency CommunicationHam Radio Ham Radio Ham Radio Fishing Hunting & Trapping Food & Water Shelter Survival Gear Survival Knives Survival Skills Survivalism SHTF Threats Urban Survival Wilderness TacticalGunsSelf Defense Guns Self Defense Guns Self Defense [ April 21, 2025 ]Why More Young Men Are Rejecting College—and Going Off-Grid in All Aspects of LifeOff the Grid [ April 18, 2025 ]Rise of the Left-Wing Preppers: From Mockery to Total Buy in?OFFGRID Survival News [ April 5, 2025 ]How the Collapse Will Happen—And Who Will Starve FirstUncategorized [ March 25, 2025 ]Why Preppers Should Be Seriously Concerned About a Cashless SocietyEconomic News: Financial Preparedness Alerts [ March 17, 2025 ]Your Hiking and Backpacking Adventures Await – Are You Prepared?Hiking & Backpacking **National Guard Arrives in L.A. Amid Curfews and Looting Concerns Following Devastating Fires** January 10, 2025OFFGRID SurvivalOFFGRID Survival News,Social Unrest0 Los Angeles is a mess right now. Afterdevastating wildfiresripped through the area, it’s not just the flames causing chaos—it’s people. Looters are hitting evacuation zones hard, and with tensions boiling over, the National Guard has been called in to clean things up. If this doesn’t scream “you’re on your own,” I don’t know what does. **Looters Are Taking Advantage—Don’t Let Them Take Advantage of You** Over 20 arrests have already been made as scumbags have been using the chaos to prey on fire victims. L.A. County Sheriff Robert Luna says the National Guard’s arrival should send a clear message:stay out of these neighborhoods or face the consequences.Curfews are in place from 6 p.m. to 6 a.m., but let’s be real—curfews only work if people follow them. National Guard troops arrived in California on Friday to assist in restoring order as “despicable” looting disrupted some areas, resulting in at least 20 arrests and prompting a strict overnight curfew. The guardsmen were spotted patrolling streets and providing aid to residents in neighborhoods impacted by the devastating fires, now considered the most destructive in Los Angeles history. “The Los Angeles County Sheriff’s Department has officially requested the support of the California National Guard for both fires,” said LA County Sheriff Robert Luna. “They will be assisting us with traffic control and critical infrastructure protection.” Los Angeles woman says 'hundreds' of thieves are looting luxury homes that were evacuated due to firesShe says the police are nowhere in sightpic.twitter.com/mV1cZy2Mw0 You can’t rely on the Guard or the cops to keep your stuff safe. If you live in a disaster-prone area, you’d better have your home locked down and ready to defend. Alarms, cameras, reinforced doors, and yes, something for personal protection, are your best bets. **False Alerts Add to the Chaos** As if things weren’t bad enough, the emergency alert system is screwing up left and right. People in areas miles away from the fires got evacuation warnings—turns out it was a “technical glitch.” Great. Just what we need, more confusion. Reporter: Millions of people in Los Angeles are getting many bogus fire evacuation alerts and are now ignoring them.We still are under Red Flag warnings.There is a real threat here.What are you doing?Mayor Bass: I want the residents to have faith in what we are doing 24/7pic.twitter.com/2r9H9hjEEQ Here’s the takeaway: don’t trust the system to get it right. You need your own plan. Whether that’s a ham radio, a CB, or just knowing what’s going on in your neighborhood, you’ve got to stay informed without relying on government screwups. **Water System Fails—What a Surprise** Then there’s the water problem. While homes and hills were burning, firefighters were stuck dealing with low water pressure because the Santa Ynez Reservoir was offline for repairs. Yeah, you read that right—offlineduring a major wildfire.This kind of failure isn’t just stupid; it’s deadly. Los Angeles refused to fill the water reservoirs and now there’s no water in the fire hydrants to fight the fires.People are fleeing for their lives while watching their homes & businesses burn to the ground.This is incompetence at the highest level.pic.twitter.com/boN1BHI34D A fire captain in Los Angeles is asked how many fire hydrants have water. His answer:“Little to none.”Welcome to the Third World.pic.twitter.com/17cjE1ANRq If this doesn’t make you want to stockpile water and prep your own filtration systems, I don’t know what will. You need to be ready to live without utilities because history proves they’ll fail when you need them most. It also shows the need for a solid Bug Out Plan! **The Bottom Line: Government Will Let You Down** This whole situation is another reminder of a hard truth:help isn’t coming.From looters to bad emergency alerts to water failures, the cracks in the system are everywhere. Sure, the National Guard showing up is something, but by the time they roll in, the damage is done. The unfolding disaster underscores a recurring theme:government systems FAIL in times of crisis. From water shortages to mismanaged emergency alerts, many residents feel let down and are questioning the state’s ability to protect its citizens during emergencies. Former President Trump weighed in, blasting state and federal leadership on Truth Social, saying, “NO WATER IN THE FIRE HYDRANTS, NO MONEY IN FEMA. THIS IS WHAT JOE BIDEN IS LEAVING ME. THANKS JOE!” These issues highlight why individuals need to prioritize personal preparedness. As we’ve previously discussed inThe Aftermath: Preparing for Post-Disaster Problems, survival depends on planning for extended periods without utilities, access to food, or even safety from looters. For those watching the chaos, now is the time to assess your preparedness for future disasters. Whether it’s stocking up on emergency food and water, securing your home against potential looters, or understanding your rights in the face of government-imposed curfews, being self-reliant is not just wise—it’s essential. Prepping for a disaster is only half the battle—what happensaftercan be even more dangerous. Here’s what you need to know: **1. Living Without Utilities** Expect extended outages.Power, water, and gas could be out for weeks or even months. Stockpile water.Have at least two weeks’ worth of drinking water, more if possible. Plan for sanitation.Without sewer systems, sanitation becomes critical—improper waste management can kill more people than the disaster itself. Have off-grid cooking options.Without electricity or gas, you’ll need ways to prepare food. Get geared up.Consider solar generators and water filtration systems. **2. Grocery Store Shutdowns** Stock up on food.Grocery stores will empty out fast, and restocking can take weeks or months. Learn food security.Hunting, fishing, foraging, and gardening are vital skills. Survival garden.Even a small one can provide much-needed resources. **3. Post-Disaster Violence** Social unrest will happen.Riots, looting, and home invasions are almost guaranteed, especially in urban areas. Be ready to defend yourself.Learn self-defense and consider owning a firearm. Fortify your home.Make it harder for criminals to break in. Prepare for desperate neighbors.Even “normal” people can become a threat when they’re desperate. **4. Government Threats** Don’t rely on officials.Many government actions, like evacuation orders or martial law, make things worse. Be cautious of crackdowns.Expect curfews, travel restrictions, and even gun confiscations. Act early.Don’t wait for government orders to leave or prepare. **The Truth Hurts—But It Saves Lives** Disasters like this show how unprepared most people are. If you don’t want to end up as another victim waiting for someone to save you, get your act together now. Start with the basics and build from there. **Leave a ReplyCancel reply** Your email address will not be published. Comment Name* Email* Website Save my name, email, and website in this browser for the next time I comment. Δ Why More Young Men Are Rejecting College—and Going Off-Grid in All Aspects of Life Rise of the Left-Wing Preppers: From Mockery to Total Buy in? How the Collapse Will Happen—And Who Will Starve First Why Preppers Should Be Seriously Concerned About a Cashless Society Your Hiking and Backpacking Adventures Await – Are You Prepared? Facebook Twitter Pinterest Instagram Youtube Survival Websites BUGOUT: 60+ Preparedness Resources for Bugging Out Bug Out Bags - The Ultimate Resource Guide Talking to Family about Preparedness Natural Disasters: Emergency Preparedness Checklist 32 Self-Reliant Resources: Preparedness Skills Everyone Should Know TOP SURVIVAL GEAR © 2023 Off Grid Survival - Your source for Everything Survival Related - Hiking, Backpacking, Urban Survival, Tactical News & Survivalist Gear |Legal & Disclaimers"}