{"id": 990, "name": "NewsCenterMaine.com", "domain": "newscentermaine.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.newscentermaine.com/article/news/community/pen-pals-friends-elementary-students-meet-assisted-living-residents-first-time-maine-lincoln-lakeview-terrace-residential-care-east-grand-elementary/97-2d79ae12-b9ea-431e-9ba9-cf211fe7333d", "title": "Pen Pals Friends Elementary Students Meet Assisted Living Residents First Time Maine Lincoln Lakeview Terrace Residential Care East Grand Elementary", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalCrimeHealth207EducationMaine PoliticsPoliticsNation WorldEntertainmentPolitical BrewMaine Things To DoLatest News StoriesDefense rests in second trial of Karen ReadFire marshal investigating bus fires that damaged Portland building Back Local Crime Health 207 Education Maine Politics Politics Nation World Entertainment Political Brew Maine Things To Do Defense rests in second trial of Karen Read Fire marshal investigating bus fires that damaged Portland building Back Local Crime Health 207 Education Maine Politics Politics Nation World Entertainment Political Brew Maine Things To Do Defense rests in second trial of Karen Read Fire marshal investigating bus fires that damaged Portland building WeatherBackForecastRadarClosings & DelaysHourly10-DayMapsWeather BlogTrafficClosings RegistrationLatest Weather StoriesNEWS CENTER Maine Weather ForecastMaine sees longest stretch of rainy spring weekends in 77 years Back Forecast Radar Closings & Delays Hourly 10-Day Maps Weather Blog Traffic Closings Registration NEWS CENTER Maine Weather Forecast Maine sees longest stretch of rainy spring weekends in 77 years Back Forecast Radar Closings & Delays Hourly 10-Day Maps Weather Blog Traffic Closings Registration NEWS CENTER Maine Weather Forecast Maine sees longest stretch of rainy spring weekends in 77 years SportsBackHigh School SportsPatriotsLocked On Podcast NetworkLatest StoriesFemale athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination lawAnthony's first MLB hit and sliding catch lead Red Sox to victory over Rays Back High School Sports Patriots Locked On Podcast Network Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law Anthony's first MLB hit and sliding catch lead Red Sox to victory over Rays Back High School Sports Patriots Locked On Podcast Network Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law Anthony's first MLB hit and sliding catch lead Red Sox to victory over Rays SearchSearch:Search Maine Things To Do Feed Maine Let's Talk About It Drive Fore Kids Big Ol' Fish Advertise With Us PFAS Varsity Club Priced Out Tick Talk Myler Makes It Gardening with Gutner VERIFY Maine's Changing Climate Closings and Delays TV Listings Closing Registration Gift Shop NCM Jobs Meet The Team **From pen pals to friends: Elementary students meet assisted living residents for the first time** **** To stream NCM on your phone, you need the NCM app. **** **Download the NCM app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video LINCOLN, Maine — The term \"pen pal\" often conjures images of letters sent across time zones or continents. But sometimes, the most meaningful connections come from just a few towns away. AtLakeview Terrace Residential Carein Lincoln, a group of residents recently met their pen pals—students fromEast Grand Elementary School—for the first time. \"This is me and this is my pen pal,\" 63-year-old resident Kathleen Smith said, pointing to a drawing on a letter. The two groups have been exchanging letters for months. What began as simple notes has grown into heartfelt friendships. \"I started writing the best I could,\" Smith said. \"These girls were sending me back pictures. It's like having these two as a sister.\" That bond was felt immediately when the students and residents finally came face-to-face. \"Macy, this is Kathleen!\" fourth-grade teacher Paula Chrone said as one of the pen pals was introduced. \"Every time we write, we get to know each other more,\" Lakeview Terrace resident Christine Bernstein said. \"Now we get to meet in person, and it's even better.\" The pairings had a chance to reflect on the stories they've shared about their lives through the stacks of paper they've sent to one another since last fall. \"She always listens and writes amazing things back,\" student McKenzie Huff said while sharing a moment with her pen pal Kathleen. \"They tell me how they’re doing at school, about their pets and whatnot,\" Bernstein added. Not only reminiscing, but creating new memories face-to-face. \"We've been talking, listening to music, and eating lunch,\" Huff said. \"He never got a picture of me—but now he knows what I look like,\" Bernstein laughed. Staff at Lakeview Terrace and teachers from East Grand say the exchange has become something special for everyone involved. \"The residents love the young energy the children bring,\" Lakeview Terrace Director Ann York said. \"You can see they just liven up—they talk.\" \"Even though they're from different generations, they find so much they have in common,\" Chrone added. For Smith, it's little things like sharing a meal and some laughs with her pen pals Andi Faulkner and McKenzie Huff that remind her that friendships aren't limited by age. \"I feel like I gained a lot of friends here,\" she said. \"These girls will always be my pen pals.\" With plans to keep sending letters, both residents and student says they're excited to continue growing with one another. \"I will write to you when I get a chance,\" she told them. \"I always loved coming into my classroom and seeing a letter on my desk,\" student Nick Marshall added. **Related Articles** New campaign supporting Maine's struggling long-term care system asks Legislature for financial help Report highlights growing need in Maine for residential care facilities 'Glamour Gals' bring joy to seniors in Maine For more local stories continue with us on our NEWS CENTER Maine+ streaming app. For the latest breaking news, weather, and traffic alerts, download the NEWS CENTER Maine mobile app. **More stories from NEWS CENTER Maine** **Before You Leave, Check This Out** Jobs at WCSH Jobs at WLBZ Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}