{"id": 1405, "name": "Them.us", "domain": "them.us", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.them.us/story/how-jupiter-in-cancer-will-steer-your-next-12-months-according-to-your-astrology#intcid=_them-verso-hp-trending_2526e9e0-ffc3-4cec-a628-169f93a416d5_popular4-2", "title": null, "content": "Sign Up News Culture Entertainment Style Community Answers & Advice Shop Video **How Jupiter in Cancer Will Steer Your Next 12 Months, According to Your Sign** X Email X Email The category is:Mother! For the first time since 2013, Jupiter in Cancer will make its celestial rounds — not just the sign of the mother, but of home, family, emotional safety, and belonging — and the zodiac is primed to receive a yearlong success story in these domains. Before we talk about Jupiter in Cancer — which will last until June 30, 2026 — let’s first consider Jupiter as a planet, then Cancer as a sign, and what this pairing can offer, especially for LGBTQ+ people. When astrologers are contextualizing what to look forward to, we look toJupiter. Though Jupiter allegedly prefers certain signs over others, it consistently brings a speedy sense of beneficial experiences: “right time, right place” moments, and positive outcomes in the themes of the sign it travels through for approximately a year. That’s why we look to a Jupiter transit as yearly insight into where we can expect good news. While Jupiter’s success tends to arrive quickly, it isn’t always permanent. You’ll want to look to Saturn for slow, more sustainable success. The longer I study astrology, the more I believe that of all the 12 zodiac signs, Cancer remains dangerously devalued. While I’m convinced that the entire zodiac holds wisdom the culture needs to integrate, Cancer’s wisdom is the only one weneedto survive. We can live — but maybe not thrive — without the other 11. We are neurobiologically hardwired for the gifts of this sign. As research inattachment theoryandpolyvagal theoryshows, safe emotional bonds, belonging, and co-regulation with others are fundamental needs, not secondary ones. They shape our wellbeing at every level. It feels fitting that John Bowlby — whose work illuminated the central role of emotional attachment in human development — was born with Jupiter in Cancer. So too wereFrida Kahloand Maya Angelou, both of whom expanded the world’s understanding of home, memory, and emotional truth. As Angelou wrote, “I long, as does every human being, to be at home wherever I find myself.” The wisdom of this sign continues to shape how we understand what it means to be human. With Jupiter offering good news in the realm of Cancer, ask yourself: Where am I ready to organize my connections around care, commitment, safety, and support — not around convenience? How can I cultivate relationships that nourish both my longing for belonging and my need for autonomy? Where do I need clearer boundaries so that my care does not become enmeshment? As Jupiter starts its transit in Cancer, a sign it allegedly enjoys being in, we also remember that Saturn-Neptune is moving through Aries — a transit that reminds us to differentiate between genuine care and codependence. It asks us to step out of old dynamics — like the roles of victim, rescuer, or persecutor named in theKarpman Drama Triangle— and into more mature, mutual, and boundaried forms of connection. The work ahead is to offer safety and support while sustaining the integrity of our individuality, honoring differentiation, and maintaining the boundaries that prevent care from becoming enmeshment or codependence. **Aries** Visualize the best-case scenario for home, family, and safety! Ready for your soft girl era, Aries? We all know you’re the zodiac’s best fighter — ready to go to war for what you want and what you’re passionate about. But now that Jupiter’s in Cancer, you get to rest into receiving care and support from the people you’ve been fighting for. Who helps the hero, right? Be willing to admit more vulnerably what you may want to feel safer and more connected with your people. You could also encounter out-of-the-blue opportunities for new living situations and healing conversations with your family of origin. Approach both with hope and curiosity, and watch the serendipity of this transit transform the most tender places of your life. **Taurus** Dream into new ways of speaking, listening, and connecting! Expand your language and you expand your world, Taurus! Your words carry more power than you may even realize. With Jupiter in Cancer, you’re invited to dream into new ways of speaking, listening, and building emotional safety through communication. Conversations that once felt stuck or strained may suddenly open. Sibling andchosen family relationshipsmay heal or strengthen through your care and curiosity. Local connections, friendships, and collaborative projects can flourish when you bring more softness and imagination to how you engage. Dare to name the feelings you’ve hesitated to share. The more you speak from the heart, the more aligned and supportive your connections become. **Gemini** Imagine a more nourishing relationship with money, worth, and support! You can only give from your “overlow,” Gemini. With Jupiter in Cancer, it’s time to imagine new ways of resourcing yourself — financially, emotionally, and energetically. Where do you need to feel safer and more supported? Where are you ready to receive more? You could experience unexpected growth in your income, or find new sources of care through community and chosen family. But it all starts with how you value yourself. Dare to ask for what you need. Let the ways you give and receive resources reflect the deeper care you want to build in every part of your life. **Cancer** Dare to dream bigger about who you’re becoming! Who do you want to be, Cancer? With Jupiter now moving through your sign, this is your year to dare — dare to expand, to trust, to show the world more of who you are becoming. Think of it through the lens of Stephen Covey’s Be-Do-Have model: This year asks you to focus first onbeing— cultivating the identity, self-worth, and emotional truth you want to embody. From there, the doing and the having will naturally follow. Opportunities for visibility, leadership, and confidence may arrive, but your foundation is who you are becoming within. Let care and self-trust guide your growth, and this year will reshape your sense of what’s possible. **Leo** Visualize the healing power of rest, reflection, and retreat! Even the Sun needs time below the horizon, Leo. With Jupiter in Cancer, this is your year to visualize the healing power of rest, reflection, and retreat. Your creative energy runs deep, but it needs nourishment. You may feel called to prioritize solitude, deepen your spiritual practices, or gently close old emotional chapters. You’re not giving up but you’re giving over your attachment to certain outcomes to a higher power. Behind the scenes, profound growth is taking place. Dare to honor your need for softness and quiet. The more space you give yourself to reflect and reset, the more powerful your next creative and relational chapter will become. **Virgo** Hope for friendships and communities that truly nourish you! You don’t have to hold it all alone, Virgo. With Jupiter in Cancer, this is your year to hope for friendships, communities, and chosen family that offer meaningful care and connection. You may find new circles where you feel safe to be fully seen, and existing friendships may grow in depth and purpose. Collaborations will thrive when you center relationships rooted in mutual care. Let yourself invest in the spaces and people where support flows naturally. The friendships you tend this year can strengthen your sense of belonging and remind you that care is a shared experience. **Libra** Imagine new possibilities for career, leadership, and public life! Your impact is ready to grow, Libra. With Jupiter in Cancer, this is your year to imagine new possibilities for your career, leadership, and the ways you contribute to the world. You may be called into roles that ask for greater emotional intelligence and relational care. Professional opportunities can unfold through trusted relationships and your ability to create environments of safety and belonging. Let yourself take your place in spaces where your values are honored. The leadership you embody this year can reflect the kind of world you hope to help build — one where care and contribution move side by side. **Scorpio** Visualize a life that expands through learning, trust, and new horizons! Your world is ready to grow, Scorpio. With Jupiter in Cancer, this is your year to visualize a life that expands through new learning, meaningful experiences, and deepened trust in your path. You may feel called toward travel, spiritual exploration, education, or cultural experiences that nourish your inner life. Relationships with teachers, mentors, or wisdom-holders can open new ways of seeing. Let curiosity guide you toward perspectives that stretch your understanding of yourself and the world. The more you welcome experiences that bring emotional depth and insight, the more this year will shape your evolving sense of purpose. **Sagittarius** Hope for a more trusting relationship with the unknown! This is a year to build trust, Sagittarius. With Jupiter in Cancer, you are invited to hope for a more trusting relationship with the unknown — because every act of trust is a risk. As Rachel Botsman teaches, trust is a confident relationship with the unknown. It does not erase doubt; it helps you move with it. This year invites you to strengthen your ability to take thoughtful, grounded risks — especially in intimacy, shared resources, and emotional vulnerability. Building trust means expanding your tolerance for uncertainty, not bypassing it. The more you practice trust as a living skill, the more courageous and connected this year will feel. **Capricorn** Imagine relationships that expand through tension and connection! Every relationship holds a tension of opposites, Capricorn. With Jupiter in Cancer, this is your year to imagine relationships that grow through these paradoxes — through the dialectic of closeness and autonomy, stability and change, privacy and openness. You may encounter partnerships that invite you to explore these tensions with more emotional awareness and curiosity. Learning how to move through these dynamics with care will shape the quality of connection you build. Let your relationships be spaces where differences are welcomed, where trust is built through dialogue, and where mutual growth becomes possible. The more you approach connection as an evolving conversation, the richer this year will become. **Aquarius** Envision small habits that support you through big transitions! Small goals build strong foundations, Aquarius. With Jupiter in Cancer, this is your year to envision daily habits, supportive routines, and care practices that help you move through a time of major transition. With Pluto now beginning its long journey through your sign, your world is shifting in deep ways. The way you care for your body, mind, and emotional world will shape how you navigate these changes. Focus on small, consistent practices that bring steadiness: the meals you prepare, the sleep you protect, the boundaries you honor, the routines that root you. Let this year be about building a container that holds you through the transformation ahead. **Pisces** Visualize joy, creativity and pleasure you feel safe enough to trust! Joy is a skill, Pisces. With Jupiter in Cancer, this is your year to visualize joy, creativity, and pleasure that feel safe enough to trust and sustain. You may be invited into experiences of delight, play, and creative expression — but with that invitation often comes vulnerability. Let yourself move toward joy slowly and consciously. Build your tolerance for feeling good, for receiving attention, and for expressing your emotional truth through art, love, and shared experiences. Small moments of play and pleasure matter. The more you nurture what brings you alive, the more this year will help you expand your capacity to live fully. Get the best of what’s queer.Sign up forThem’s weekly newsletter here. **Got your horoscope? Check out more astrology stories fromThem:** Who You Should U-Haul With, Based on Your Sign Who You Should U-Haul With, Based on Your Sign Who You Should U-Haul With, Based on Your Sign Which Chappell Roan Look Are You Based on Your Sign? Which Chappell Roan Look Are You Based on Your Sign? Which Chappell Roan Look Are You Based on Your Sign? Which Charli XCXBratSong Are You Based on Your Sign? Which Charli XCXBratSong Are You Based on Your Sign? Which Charli XCXBratSong Are You Based on Your Sign? The Best First Date For Every Sign of the Zodiac The Best First Date For Every Sign of the Zodiac The Best First Date For Every Sign of the Zodiac Your Ideal Sex Partner Based on Your Zodiac Sign Your Ideal Sex Partner Based on Your Zodiac Sign Your Ideal Sex Partner Based on Your Zodiac Sign WhichBut I’m a Cheerleader CharacterAre You Based on Your Sign? WhichBut I’m a Cheerleader CharacterAre You Based on Your Sign? WhichBut I’m a Cheerleader CharacterAre You Based on Your Sign? Which Lesbian Period Drama Are You Based on Your Sign? Which Lesbian Period Drama Are You Based on Your Sign? Which Lesbian Period Drama Are You Based on Your Sign? How You Would Die in a Horror Movie Based on Your Sign How You Would Die in a Horror Movie Based on Your Sign How You Would Die in a Horror Movie Based on Your Sign Which Tacky Pride Merch Are You Based on Your Zodiac Sign? Which Tacky Pride Merch Are You Based on Your Zodiac Sign? Which Tacky Pride Merch Are You Based on Your Zodiac Sign? Which Out WNBA Player Are You Based on Your Sign? Which Out WNBA Player Are You Based on Your Sign? Which Out WNBA Player Are You Based on Your Sign? Facebook X Instagram Our Story About Them Contact Careers Media kit User Agreement Privacy Policy Your California Privacy Rights RSS Feeds Condé Nast Store ©2025Condé Nast. All rights reserved.Themmay earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad Choices CN Living"}