{"id": 1597, "name": "WLTX - Columbia News", "domain": "wltx.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wltx.com/article/entertainment/events/from-fireflies-to-chicharrones-broadway-to-hollywood-and-outfest-the-category-is-transformation-things-to-do-columbia-june11/101-db2c946f-ba5a-49a9-b2f9-02175b592419", "title": "From Fireflies To Chicharrones Broadway To Hollywood And Outfest The Category Is Transformation Things To Do Columbia June11", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalCOLAtodayNear MeStreet SquadNation WorldPoliticsLifeInvestigativeEntertainmentJobsFeaturesConnectLatest News StoriesA Cayce officer has been fired and arrested: Here's whyColumbia pauses new short-term rental permits Back Local COLAtoday Near Me Street Squad Nation World Politics Life Investigative Entertainment Jobs Features Connect A Cayce officer has been fired and arrested: Here's why Columbia pauses new short-term rental permits Back Local COLAtoday Near Me Street Squad Nation World Politics Life Investigative Entertainment Jobs Features Connect A Cayce officer has been fired and arrested: Here's why Columbia pauses new short-term rental permits WeatherBackForecastRadar10-Day/HourlyMapsClosings & DelaysTrafficHurricane CentralClimate MattersLatest Weather StoriesClassic summer weather brings chance of storms to South Carolina each dayLocal Forecast Back Forecast Radar 10-Day/Hourly Maps Closings & Delays Traffic Hurricane Central Climate Matters Classic summer weather brings chance of storms to South Carolina each day Local Forecast Back Forecast Radar 10-Day/Hourly Maps Closings & Delays Traffic Hurricane Central Climate Matters Classic summer weather brings chance of storms to South Carolina each day Local Forecast SportsBackHigh School SportsGamecocksClemsonPlayer of the WeekCollege SportsLocked On Podcast NetworkLatest StoriesFemale athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination lawUSC-Clemson football gametime set. It may not be when fans would like Back High School Sports Gamecocks Clemson Player of the Week College Sports Locked On Podcast Network Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law USC-Clemson football gametime set. It may not be when fans would like Back High School Sports Gamecocks Clemson Player of the Week College Sports Locked On Podcast Network Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law USC-Clemson football gametime set. It may not be when fans would like SearchSearch:Search Advertise With Us Teacher of the Week Player of the Week Street Squad Lexington Street Squad Orangeburg Street Squad Sumter Lottery Spotlight TV Listings **From Fireflies to Chicharrones, Disney princesses, and OUTFest, the category is: Transformation.** COLUMBIA, S.C. — Get ready to mix it up this weekend. If there is a theme, it's transformation -- the weather has finally transitioned from spring to nearly-blazing hot and humid summer; the Columbia Fireflies do their annual transformation into Los Chicharrones de Columbia for Copa de la Diversion weekend to honor the Hispanic community; and OUTFest celebrates everything LGBTQ+. There's opportunities to play dress-up at Lexington Blowfish games when they host Star Wars and A League of Their Own appreciation nights, and for the superstitious out there, we're coming off of a full moon and Friday is the 13th, so watch out and be careful. And there's Flag Day on Saturday and Father's Day on Sunday to round out the weekend! Whatever and whoever you choose to celebrate this weekend, if you're planning something outdoors, don't forget the sunscreen, cold beverages, and maybe a fancy hat to keep yourself protected from the sun. Here’s a sample of things to do this weekend: **THURSDAY, June 12** Meeting Street Artisan Market Summer Series,4-8 p.m. Interactive Art Park, 425 Meeting St., West Columbia. Gather with friends and family, or meet new friends and shop for one-of-a-kind handcrafted goods. Jazz Party Thursdays,7-10 p.m., The Aristocrat, 1001 Washington St. Enjoy the sounds of the Amos Hoffman Trio as they open the evening with a jam session following the first set. Lexington County Blowfish vs Forest City Owls,7:05 p.m., Lexington County Baseball Stadium, 474 Ball Park Rd., Lexington. Thirsty Thursday **THURSDAY through SUNDAY, June 12-15** Heroes & Villains: The Art of the Disney Costume,you choose time, SC State Museum, 301 Gervais St., Columbia. Oooh and aah over 70 costumes from beloved Disney characters such as Cinderella, Maleficent, and more worn by actors such as Johnny Depp, Glenn Close, and Angelina Jolie. Tickets available online, select time you wish to enter the exhibition at time of purchase as gallery capacity is limited. Columbia Fireflies (Los Chicharrones de Columbia) vs Kannapolis Cannon Ballershome stand at Segra Park, 1640 Freed St. 7:05 p.m. Thursdsay & Friday, 6:05 p.m. Saturday, 5:05 p.m. Sunday. The Fireflies transform into Los Chicharrones de Columbia for Copa de la Diversion Weekend to celebrate local Hispanic communities. Different promotions each night, postgame fireworks on Saturday. **FRIDAY, June 13** Elder Abuse Awareness Walk,9 a.m., Dept. of Social Services (DSS) State Office, 1535 Confederate Ave. Don your best purple outfit and register to walk to take a stand against abuse and neglect of the elderly in this annual event. The route will go along Bull Street towards Elmwood Avenue. Palmetto Boys and Girls State Parade,9-11 a.m. downtown Columbia. Come out and cheer on the students of Boys and Girls State as they march down Main, from Blanding to Gervais Street. The students will be accompanied by SC Bureau of Protective Services, SC Highway Patrol (SCHP), South Carolina Law Enforcement Division (SLED), Columbia Police Department (CPD), and University of South Carolina Police Department (USCPD) Southeastern Piano Festival: Arthur Fraser Piano Competition,10 a.m.-6 p.m., USC School of Music Recital Hall, 813 Assembly St. Listen in as some of the best pianists in the world compete to perform with the South Carolina Philharmonic in a Masterworks concert and more than $10,000 in cash prizes. Free event. Camden Juneteenth Celebration,4-8 p.m. Camden City Arena, 420 Broad St., Camden. This year, the Camden/Kershaw County community honors five centenarians (folks who have lived 100 years or more) who, together, represent more than 500 years of Black history, survival and wisdom. The 2025 honorees are: Albert Carter, Jessie Mae Cauthen Isaiah, Ruth Kirkland, Hattie McKenney, and James Nelson. Bring a lawn chair and enjoy free hot dogs, fried fish and fries. Nashville Nights: Bre Kennedy duo,6 p.m. Steel Hands Brewing, 2350 Foreman St., Cayce. Free show with Nashville hot chicken sandwiches and Tennessee whiskey ribs while supplies last, and Nashville Nights Summer Shandy on draft Heroes Singer Songwriter Showcase,7-10 p.m. Icehouse Amphitheater, 107 West Main St., Lexington. Come out and enjoy an evening of music featuring Scotty Hasting, Carter Lybrand, Brendan Roberts, and Robert Stevens to benefit veterans and first responders. Proceeds to go to support services provided by The Big Red Barn Retreat. From Stage to Screen: An Evening of Broadway Favorites & Hollywood Classics,7:30 p.m. Koger Center, 1051 Greene St., Columbia. Part of the Varna International Music Academy’s Muzika! Festival, enjoy an evening of musical theater favorites from the past 80 years. Maestro Gregory Buchalter, from the Metropolitan Opera conducts. Friday the 13th @ The Babylon,8-10 p.m., The Babylon, 631 Harden St. The classic 1980 slasher movie follows a group of teenage camp counselors attempting to reopen the camp at Crystal Lake. Introduces Jason Voorhees to the masses. Fantasia & Anthony Hamilton,8 p.m. Colonial Life Arena, 801 Lincoln St., Columbia. The 2004 American Idol winner, Grammy Award winner, and Broadway star Fantasia is touring with fellow North Carolina native Anthony Hamilton **FRIDAY & SATURDAY, June 13-14** Blowfish vs. Catawba Valley Stars,7:05 p.m. first pitch, Lexington County Baseball Stadium, 474 Ball Park Rd., Lexington. Friday is Star Wars night – come battle with lightsabers and join the on-field parade dressed as your favorite Star Wars character. Stay for the post-game fireworks. Saturday is A League of Their Own night, so come dressed in your best 1940s look as the team pays tribute to the iconic women’s baseball movie. **SATURDAY, June 14, Flag Day** Accessibility Morning: Where the Wild Things Are,9-11 a.m., SC State Museum, 301 Gervais St. Families who would benefit from a quieter, sensory-friendly and disability-adapted experience at the museum are welcomed Saturday morning. An American Sign Language interpreter will be available. Free event but online pre-registration is encouraged. Southern Style Exotic Animals,9 a.m.-5 p.m. Jamil Shrine Temple, 206 Jamil Road. Meet breeders from the bird and exotic animal community. This event features a “stunning selection” of parrots and more. $5 for persons age 12 and over, children under age 12 get in free. OUTFest: A Famously Hot Block Party,noon-4 p.m., 1100 Park Street. Celebrate Pride Month in the Midlands with this all-day party in The Vista. Enjoy live music, the exciting Mr. Mx. Ms. OUTfest Drag Pageant, food and beverages and so much more! South Carolina Orchid Society Summer Orchid Auction,noon preview, 1 p.m. auction, Garden Club Council of Greater Columbia, 1605 Park Circle (corner of Pickens and Blossom streets). Around 100 blooming orchids, from seedlings to mature plants, pottery and more. Columbia Classic Chevy Club Cruise In,5-8 p.m. Woodbury Plaza Shopping Center, 3230 Augusta Hwy, West Columbia. Free event open to all street legal makes, models and years. Rhythm on the River: The Gaspumpers,6-9 p.m. Riverwalk Amphitheater, 109 Alexander Rd., West Columbia. Bring a chair, family-friendly, pet friendly, food trucks and more. Southeastern Piano Festival: Arthur Fraser Piano Competition Winners’ Recital,7:30 p.m., USC School of Music Recital Hall, 813 Assembly St. The winners of the piano competition perform with the South Carolina Philharmonic in a Masterworks concert. Tickets $25 **SUNDAY, June 15, Father’s Day** Columbia Fireflies Father’s Day Vintage Car & Motorcycle Show,3:30-7:30 p.m. Segra Park, 1640 Freed St., Columbia. Check out 25 classic cars and 20 vintage motorcycles before the baseball game. Bring a glove and catch some balls with the Chicharrones before they take on Ajolotes de Kannapolis then dads can settle in with a free drink and enjoy Luna Creciente Mexican folk dancing before the first pitch at 5:05 p.m. **** To stream WLTX 19 on your phone, you need the WLTX 19 app. **** **Download the WLTX 19 app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video In Other News **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}