{"id": 794, "name": "KTVZ - Bend News", "domain": "ktvz.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://ktvz.com/news/2025/06/05/problem-solvers-as-think-wild-animal-hospital-raises-the-alarm-on-poisoning-deaths-a-look-at-the-issues-and-benefits-of-using-lead-ammunition/", "title": "Problem Solvers As Think Wild Animal Hospital Raises The Alarm On Poisoning Deaths A Look At The Issues And Benefits Of Using Lead Ammunition", "content": "Home LivestreamKTVZ NewsKTVZ+ | LIVE Events KTVZ News KTVZ+ | LIVE Events KTVZ News KTVZ+ | LIVE Events NewsAsk the Mayor: BendAsk the Mayor: RedmondCentral OregonDecision 2025KTVZ.com PollLocal VideoNational & InternationalPhoto GalleriesProblem SolversRadio PartnerRegional Ask the Mayor: Bend Ask the Mayor: Redmond Central Oregon Decision 2025 KTVZ.com Poll Local Video National & International Photo Galleries Problem Solvers Radio Partner Regional Ask the Mayor: Bend Ask the Mayor: Redmond Central Oregon Decision 2025 KTVZ.com Poll Local Video National & International Photo Galleries Problem Solvers Radio Partner Regional Local Alert WeatherFire AlertFirst Pitch ForecastFutureTrack RadarLocal Alert ForecastLocal Alert Weather DaysLIVE Road ConditionsSchool Closings & DelaysShifting SeasonsWeather Alerts Fire Alert First Pitch Forecast FutureTrack Radar Local Alert Forecast Local Alert Weather Days LIVE Road Conditions School Closings & Delays Shifting Seasons Weather Alerts Fire Alert First Pitch Forecast FutureTrack Radar Local Alert Forecast Local Alert Weather Days LIVE Road Conditions School Closings & Delays Shifting Seasons Weather Alerts SportsBeyond The ScorePrep: BaseballPrep: Softball Beyond The Score Prep: Baseball Prep: Softball Beyond The Score Prep: Baseball Prep: Softball Community21 Cares For KidsCO For KidsCommunity BillboardCommunity ConversationsCommunity LinksFraud Prevention FridaysLet’s TalkOne Class At A TimePay It ForwardSmall Business Spotlight 21 Cares For Kids CO For Kids Community Billboard Community Conversations Community Links Fraud Prevention Fridays Let’s Talk One Class At A Time Pay It Forward Small Business Spotlight 21 Cares For Kids CO For Kids Community Billboard Community Conversations Community Links Fraud Prevention Fridays Let’s Talk One Class At A Time Pay It Forward Small Business Spotlight ContestsBackyard Living Photo ContestBig Ol’ FishFather’s Day GiveawayJunior ForecasterOut & AboutPay It ForwardPet Pics SweepstakesSenior SunriseSunrise Birthdays Backyard Living Photo Contest Big Ol’ Fish Father’s Day Giveaway Junior Forecaster Out & About Pay It Forward Pet Pics Sweepstakes Senior Sunrise Sunrise Birthdays Backyard Living Photo Contest Big Ol’ Fish Father’s Day Giveaway Junior Forecaster Out & About Pay It Forward Pet Pics Sweepstakes Senior Sunrise Sunrise Birthdays JobsCentral Oregon CareersKTVZ CareersNow Hiring Central Oregon Careers KTVZ Careers Now Hiring Central Oregon Careers KTVZ Careers Now Hiring LifestyleEntertainmentEventsHealthMoneyPetsPump PatrolTechnology Entertainment Events Health Money Pets Pump Patrol Technology Entertainment Events Health Money Pets Pump Patrol Technology ShareBig Ol’ FishOut & AboutPictures & Videos Big Ol’ Fish Out & About Pictures & Videos Big Ol’ Fish Out & About Pictures & Videos About UsAdvertiseCareers & InternshipsClosed CaptioningContactDownload Our AppsEEO Public FilingEmail NewslettersFCC Public FileKTVZ News TeamOn-Air StatusReceiving KTVZTV Listings Advertise Careers & Internships Closed Captioning Contact Download Our Apps EEO Public Filing Email Newsletters FCC Public File KTVZ News Team On-Air Status Receiving KTVZ TV Listings Advertise Careers & Internships Closed Captioning Contact Download Our Apps EEO Public Filing Email Newsletters FCC Public File KTVZ News Team On-Air Status Receiving KTVZ TV Listings News Local Alert Weather Sports Problem Solvers Contests Share **Local Alert Weather** **Dry and milder pattern, still above normal temperatures** **Top Stories** **Commute Options, city of Bend launch E-Bike Rebate Program, providing $1,800 to eligible residents** **AutoZone Reportedly Moving Into Former Deschutes Junction Site on NE Third Street** **Avion Water lifts boil water notice for Long Butte, Whispering Pines area, but even-odd watering rules remain** **Bend’s revitalized Second Street reopens; community invited to celebrate Core Area upgrades** **Veteran-led nonprofit’s volunteers from across U.S. helping community south of La Pine reduce wildfire threat** **Problem Solvers: As Think Wild animal hospital raises the alarm on poisoning deaths, a look at the issues, benefits of using lead ammunition** (Update: Adding video) BEND, Ore. (KTVZ) -- Central Oregon's largest hospital for wildlife is encouraging hunters to change to non-lead ammunition, as they've treated over85 animals for poisoningsin the past 4 years, almost all of which passed away from the illness. But the cost, availability, and accuracy of the bullets are major hurdles for hunters. Sally Compton, the executive director for Think Wild, says most poisonings come from eating the carcass of an animal killed by lead ammunition. \"As it permeates through their system, gets to their brain, gets to their internal organs, that's when they start to really feel those symptoms,\" she said. When lead ammunition enters an animal, it usually splinters, sometimes up to 12 feet. When it does this, it infects the animal's carcass with lead, which can sometimes lead to these poisonings. During a visit to Think Wild, the Problem Solvers observed a routine test for the United State's official bird, the bald eagle, whose recovering from lead poisoning. The results brought good news, but for most animals, this isn't the case. \"Usually, they pass away,\" Compton told the Problem Solvers. Of the 85 animals brought to Think Wild for lead poisoning over the years, three of them have been bald eagles. Almost all died from the illness. So why would hunters use lead? Nathan Wismer,who owns a wood and steel company, says lead bullets are more lethal and make for a better shot. He said last time he went hunting he was able to bag a deer with just one shot. Kenneth Brown, who foundedLiberation Firearms training in Redmond, agrees, \"At the end of the day, you're just going to get a better shot. It's going to travel more consistently,\" Brown told the Problem Solvers. The other reason... dollars and cents. Brown, who buys and sells ammunition regularly, says non-lead ammunition is always more expensive, sometimes costing up to 50% more. The Problem Solvers went to his gun range, where non-lead ammunition is used, so customers aren’t exposed to lead fragments. It's similar to why Think Wild says lead bullets can contaminate carcasses. \"Lead is going to be harmful to the body. You know it just is. Non-leads not,\" Brown said, \"You're inside of a shooting platform, inside of the bay, and I don't want you to have a bunch of lead all over the place\". So what's the solution to getting more hunters to make the switch? Most seemed to agree: getting that cost down, and raising awareness. \"Hunters are typically one of the greatest conservationists, like hunters love fish and wildlife,\" Compton said. \"So I think the more that we can educate and make accessible opportunities for not using lead, the better.\" Wismer, who hunts once a year, said, \"If it became more affordable and you could buy them in bulk, yeah, I have no problem with it.\" There is a group out of the Oregon Zoo called theNorth American Non-Lead Partnership. Theyraise awareness and educate hunters on the issue, but bringing down the cost is still a major hurdle States like New York have created incentives for non-lead ammunition, which is something Think Wild would like to see in Oregon. The Federal Fish and Wildlife Service also briefly had an incentive program. The Problem Solvers have reached out to our federal representatives to see what, if anything, they may support. Jump to comments ↓ **Harley Coldiron** **Related Articles** **Win Overland Expo Tickets!** **Ridgeview softball’s Brezlyn Hagemeister leads team to 5A state championship** **Oregon State centerfielder and Summit alum Canon Reeder helps boost Oregon State to the College World Series** **Oregon State walks it off in Game 1 thriller, one win from Omaha** KTVZ NewsChannel 21 is committed to providing a forum for civil and constructive conversation. Please keep your comments respectful and relevant. You can review our Community Guidelines byclicking here If you would like to share a story idea, please submit ithere. Community GuidelinesContact UsEEO Public FileFCC ApplicationsFCC Public FilePrivacy PolicyTerms of ServiceDo Not Sell My Personal Information **Subscribe: KTVZ Newsletters** Breaking NewsContests & PromotionsLocal News UpdatesLocal Alert ForecastLocal Alert Weather Warnings **Download: KTVZ Apps** Accessibility Tools Increase TextIncrease Text Decrease TextDecrease Text GrayscaleGrayscale High ContrastHigh Contrast Negative ContrastNegative Contrast Light BackgroundLight Background Links UnderlineLinks Underline Readable FontReadable Font ResetReset"}