{"id": 1572, "name": "WFMYnews2.com", "domain": "wfmynews2.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wfmynews2.com/article/news/local/yearly-ac-tune-up-if-you-dont-do-it-you-should-air-conditioning-should-have-a-check-up-once-a-year-to-clean-coils-check-for-leaks/83-380c6da8-ba05-46c7-ab82-2e81d1b1d0a2", "title": "Yearly Ac Tune Up If You Dont Do It You Should Air Conditioning Should Have A Check Up Once A Year To Clean Coils Check For Leaks", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalNear MeEntertainmentHealthMoneyNation WorldPoliticsInvestigativeEducationCrimeFeaturesLatest News StoriesHigh Point Theatre reflects on its legacy of culture and community support for 50th anniversarySWAT, police at standoff in Winston-Salem Back Local Near Me Entertainment Health Money Nation World Politics Investigative Education Crime Features High Point Theatre reflects on its legacy of culture and community support for 50th anniversary SWAT, police at standoff in Winston-Salem Back Local Near Me Entertainment Health Money Nation World Politics Investigative Education Crime Features High Point Theatre reflects on its legacy of culture and community support for 50th anniversary SWAT, police at standoff in Winston-Salem WeatherBackForecastRadar10-DayCamsHourlyMapsClosings/DelaysTrafficGas PricesHurricanesLatest Weather StoriesWeather Impact: Scattered storms return each afternoon through the weekendWeather IQ: How does pressure affect the weather? Back Forecast Radar 10-Day Cams Hourly Maps Closings/Delays Traffic Gas Prices Hurricanes Weather Impact: Scattered storms return each afternoon through the weekend Weather IQ: How does pressure affect the weather? Back Forecast Radar 10-Day Cams Hourly Maps Closings/Delays Traffic Gas Prices Hurricanes Weather Impact: Scattered storms return each afternoon through the weekend Weather IQ: How does pressure affect the weather? SportsBackHigh School SportsPanthersGreensboro SwarmNHLNFLCollegeLocked On Podcast NetworkLatest StoriesNCAA announces new rule changes for men's and women's basketballFemale athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law Back High School Sports Panthers Greensboro Swarm NHL NFL College Locked On Podcast Network NCAA announces new rule changes for men's and women's basketball Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law Back High School Sports Panthers Greensboro Swarm NHL NFL College Locked On Podcast Network NCAA announces new rule changes for men's and women's basketball Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law SearchSearch:Search Advertise With Us 2 Wants to Know Most Accurate Weather Weather IQ 2 Your Well-Being What 2 See at the GSC Smart Deals The Good Morning Show 2 The Rescue WFMY History Interactive Radar TV Listings **Yearly A/C tune-up: If you don't do it, you should!** **** To stream WFMY News 2 on your phone, you need the WFMY News 2 app. **** **Download the WFMY News 2 app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video GREENSBORO, N.C. — You're going to hear that sound ofair conditionershumming this week for sure. With temperatures near the 90-degree mark, your A/C is about to get its first real good workout of the season. Here's the expert advice: don't wait for something to go wrong; call now for the annual tune-up. \"It's a small investment to be comfortable during the hottest days of the month. Make sure it's running as efficiently as possible,\" said an A/C repairman. The $100 you spend on the annual tune-up could keep you from paying a lot more later on this season.. The technician will clean and inspect the coils, check refrigerant levels, inspect electrical connections, and replace air filters. Even if you're not increasing your use of power, the price of energy is increasing due to increased demand from summer heat waves, AI data centers, and bitcoin mining, among other things. And when you're talking numbers, 78 degrees is the recommended temperature for saving money in the summer months, but that doesn't mean it's the best temperature for keeping cool. HOW TO BEAT THE HEAT \"If you do convince your family to turn up the AC, using a ceiling fan or box fan can make up the difference; running one will actually make the room feel as much as four or even five degrees cooler,\" said Dan Wrocklawski, Consumer Reports. Add some technology to your home in the form of a smart or programmable thermostat; they make it easy to set a money-saving, energy-conserving schedule. \"Using a programmable thermostat is really the most effective way to save money, and it’ll even help you save money on heating bills in the winter,\" said Wrocklawski. **Related Articles** Who covers the cost? Understanding insurance for car damage and theft How do you get your landlord to make repairs? Best mosquito & tick repellent of 2025 **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}