{"id": 1157, "name": "Reason", "domain": "reason.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://reason.com/2025/06/10/aspiring-barbers-and-cosmetologists-in-iowa-can-now-learn-on-the-job-instead-of-paying-thousands-for-classes/", "title": "Aspiring Barbers And Cosmetologists In Iowa Can Now Learn On The Job Instead Of Paying Thousands For Classes", "content": "Latest MagazineCurrent IssueArchivesSubscribeCrossword Current Issue Archives Subscribe Crossword Current Issue Archives Subscribe Crossword Video PodcastsAll ShowsThe Reason RoundtableThe Reason Interview With Nick GillespieThe Soho Forum DebatesJust Asking QuestionsThe Best of Reason MagazineWhy We Can't Have Nice Things All Shows The Reason Roundtable The Reason Interview With Nick Gillespie The Soho Forum Debates Just Asking Questions The Best of Reason Magazine Why We Can't Have Nice Things All Shows The Reason Roundtable The Reason Interview With Nick Gillespie The Soho Forum Debates Just Asking Questions The Best of Reason Magazine Why We Can't Have Nice Things Volokh Newsletters DonateDonate OnlineDonate CryptoWays To Give To Reason FoundationTorchbearer SocietyPlanned Giving Donate Online Donate Crypto Ways To Give To Reason Foundation Torchbearer Society Planned Giving Donate Online Donate Crypto Ways To Give To Reason Foundation Torchbearer Society Planned Giving SubscribeReason Plus SubscriptionPrint SubscriptionGift SubscriptionsSubscriber Support Reason Plus Subscription Print Subscription Gift Subscriptions Subscriber Support Reason Plus Subscription Print Subscription Gift Subscriptions Subscriber Support **Login Form** Occupational Licensing **Aspiring Barbers and Cosmetologists in Iowa Can Now Learn on the Job Instead of Paying Thousands for Classes** **A new law creates an apprenticeship program allowing unlicensed Iowans to make an income from providing cosmetology and barbering services.** Autumn Billings|6.10.2025 5:15 PM Nearly 20 percent of Iowans must obtain an occupational licensebeforethey can work. A new law is lowering barriers to employment in the Hawkeye State. Last week, Republican Gov. Kim Reynolds signedHouse File 711into law, creating an apprenticeship program that allows unlicensed individuals to provide cosmetology and barbering services under the supervision of someone who is licensed and after completing two hours of education on sanitation rules. Businesses that participate in this program are required to register with the state's Board of Barbering and Cosmetology Arts and Sciences and comply with safety and sanitation requirements. Consumers must also receive written disclosure that the services are performed by an unlicensed provider partaking in an establishment training program. The enactment of this bill will significantly reduce the barriers to working in Iowa's barbering and cosmetology industries. Under previous regulations, an individual required a license before making an income from providing salon and barbering services. But toobtain a license, one had to first graduate from a board-approved cosmetology program (with anaverage tuitionof $19,508), complete 1,550 hours of supervised practice, and pass an examination—all to enter a profession in which half make less than $25,990 a year, according to the Institute for Justice, a nonprofit public interest law firm. But now unlicensed employees will have the opportunity to immediately earn income while learning how to cut, color, shampoo, and style hair under licensed cosmetologists who own the establishment training programs. These businessowners, rather than a board-approved school, are \"responsible for ensuring education, training, skills, and competence of persons who provide services in the owner's establishment.\" And while those in the program may use the experience to take the licensing exam and obtain a license after completing 2,000 hours of supervised practice, it is not a requirement to continue working. Iowa's barbering and cosmetology industries are divided on the impact the legislation will have. Kristen Van Hauen, a stylist and hair salon owner,toldWHO-13, the local NBC affiliate, that \"giving people the opportunity to just start doing hair, [is] not going to help strengthen our industry as a whole.\" She's also concerned that the professionalism of the industry will be diminished. But others disagree. Lindsey Mollenhauer, another hair salon owner, believes the law will offer more specialized education opportunities. \"If anyone had a bad haircut, which a lot of us have. I think we need to consider that it was given by a licensed cosmetologist or a licensed barber,\" she told WHO-13. \"So, the license doesn't necessarily speak to quality or craftsmanship.\" The Professional Beauty Association (PBA), a membershiporganizationfor beauty professionals,opposedthe Iowa legislation, along with a similar deregulatorybillin Arizona that failed earlier this year. The PBA's director of government affairs, Myra Irizarry Reddy,toldAmerican Salon that \"the current licensing process ensures beauty professionals are educated in sanitation, chemical safety, and client protection.\" Lowering cosmetology standards and \"allowing untrained individuals to provide salon services,\" Reddy said, would expose \"businesses to lawsuits, liability, and uninsured workers.\" But business owners are in a better position to know which risks they are willing to take on to meet their customers' demands. Iowa's sweeping change is a good start, and hopefully a sign of more occupational licensing reform to come in the state and across the country. Start your day withReason. Get a daily brief of the most important stories and trends every weekday morning when you subscribe toReason Roundup. Δ NEXT:Gavin Newsom Defends Federalism Against Trump's Unilateral National Guard Deployment Show Comments (5) **Latest** Jacob Sullum|6.11.2025 5:10 PM Autumn Billings|6.11.2025 4:52 PM Joe Lancaster|6.11.2025 4:37 PM Billy Binion|6.11.2025 4:21 PM Emma Camp|6.11.2025 4:09 PM **Recommended** About Browse Topics Events Staff Jobs Donate Advertise Subscribe Contact Media Shop Amazon © 2024 Reason Foundation|Accessibility|Privacy Policy|Terms Of Use This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. Do you care about free minds and free markets? Sign up to get the biggest stories from Reason in your inbox every afternoon. Δ This modal will close in10 Full digital edition access No ads Commenting privileges Just$25per year"}