{"id": 1175, "name": "Religion News Service", "domain": "religionnews.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://religionnews.com/2025/06/11/a-field-guide-to-accelerationism-white-supremacist-groups-using-violence-to-spur-race-war-and-create-social-chaos/", "title": "A Field Guide To Accelerationism White Supremacist Groups Using Violence To Spur Race War And Create Social Chaos", "content": "**RNS | Covering the world of religion.** Home News Opinion FaithsChristianityCatholicsProtestantsBlack ProtestantsEvangelicalsMainline ProtestantsLatter-day SaintsOrthodox ChristiansJudaismIslamHinduismBuddhismSikhismAtheism & AgnosticismUnaffiliated & NonesAlternative FaithsMore Faiths ChristianityCatholicsProtestantsBlack ProtestantsEvangelicalsMainline ProtestantsLatter-day SaintsOrthodox Christians Catholics ProtestantsBlack ProtestantsEvangelicalsMainline Protestants Black Protestants Evangelicals Mainline Protestants Latter-day Saints Orthodox Christians Judaism Islam Hinduism Buddhism Sikhism Atheism & Agnosticism Unaffiliated & Nones Alternative Faiths More Faiths ChristianityCatholicsProtestantsBlack ProtestantsEvangelicalsMainline ProtestantsLatter-day SaintsOrthodox Christians Catholics ProtestantsBlack ProtestantsEvangelicalsMainline Protestants Black Protestants Evangelicals Mainline Protestants Latter-day Saints Orthodox Christians Catholics ProtestantsBlack ProtestantsEvangelicalsMainline Protestants Black Protestants Evangelicals Mainline Protestants Black Protestants Evangelicals Mainline Protestants Latter-day Saints Orthodox Christians Judaism Islam Hinduism Buddhism Sikhism Atheism & Agnosticism Unaffiliated & Nones Alternative Faiths More Faiths Politics World U.S. Life & Culture Spirituality & Wellness Podcasts Photos of the Week News Quiz Subscribe to RNS newsletters Jobs Board About RNS News Opinion Faiths Podcasts Newsletters News Quiz Jobs Board (The Conversation) — A man named Regan Prater was charged with arson for the burning ofHighlander Center in New Market, Tennessee, on May 7, 2025. The nonprofit has a long history of involvement in the Civil Rights Movement. The FBI stated in a court document that Prater participated in neo-Nazi Telegram group chats online. Earlier this year, Brandon Clint Russell, founder ofAtomwaffen Divison, also known as the National Socialist Resistance Front, a onetime neo-Nazi terrorist organization,according to the Department of Justice, wasconvicted of conspiracy to damage an energy facility in Baltimore. In the fall of 2024, a 24-year-old man, Skyler Philippi,targeted the Nashville power grid with an explosive drone. Federal authorities allege that Philippi was motivated by white supremacist ideologies and affiliated with theextremist group the National Alliance. Inmy research on right-wing extremism over 30 years, a disturbing pattern has emerged: White supremacists and white nationalists are increasingly willing to use violence targeting critical infrastructurein an effort to destabilize society. Since the Ku Klux Klan’s resurgence in 1915, white supremacists have pushed for white control of society. In particular, white supremacist and neo-Nazi groupshave long advocated violencetoestablishawhite ethnostate, aproposed political entityor nation-state where residency and citizenship areexclusively limited to whites. In the past several years, extremists have started using the term “accelerationism” to describe their desire to createsocial chaos and societal collapsethat leads to a race war and the destruction of liberal democratic systems, paving the way for a white ethnostate. **What is accelerationism?** The motivating idea behind accelerationism is thatsocial chaos createsan opportunity for extremists to create aracially or ideologically “pure” future. Scholars who study extremism have used the term “accelerationism” since the 1980s, but it wasn’t widely associated with right-wing extremist violence until the late 2010s. People calling themselves “eco-fascists,” for example, often endorse mass violence as a means toreduce population and spark societal collapse. Accelerationism is often connected to the white replacement theory, a white nationalist conspiracy theory that falsely asserts that there is a deliberate plot to diminish the influence and power of white people byreplacing them with nonwhite populations. While not all extremists who advocate violent confrontation use the label, the calls for violent disruption strive for the same results. Brenton Harrison Tarrant, the Australian white supremacist who perpetrated the Christchurch mosque shootings on March 15, 2019, in New Zealand, labeled an entire section of his online manifestoDestabilization and Accelerationism: Tactics for Victory. Members of the neo-Nazi National Socialist Movement salute and shout ‘sieg heil’ during a rally in front of the State House in Trenton, N.J., on April 16, 2011.AP Photo/Mel Evans This primer provides an overview of some of the key groups that have embraced accelerationist thinking, posing significant threats to public safety, democratic institutions and social cohesion. **The Order** One of the first American groups to embody this ideology wasThe Order– also known as Brüder Schweigen, or the Silent Brotherhood – which continues to influence newer generations of extremist organizations, both directly and indirectly. Robert Jay Mathews, who founded The Order in 1983, was inspired by the apocalyptic vision laid out in the novel “The Turner Diaries.” The 1978 book by William Luther Pierce – under the pseudonym Andrew Macdonald – calls for a violent, apocalyptic race war to overthrow the U.S. government and exterminate Jews, nonwhite people and political enemies. Pierce founded the National Alliance – a neo-Nazi, white supremacist organization advocating for awhite ethnostate and violent revolution– in 1974. The call for violent insurrection and radical societal overhaul has since served as a blueprint for white supremacists and right-wing extremists. The Order believed the U.S. federal government was under the control of Jews and other minority groups, and it aimed to overthrow it to create a white ethnostate. The Order funded its activities through robberies, including US$3.6 million taken from an armored car near Ukiah, California,on July 19, 1984. Its criminal and violent actions escalated to murder, most notably the 1984 assassination of Jewish radio host Alan Berg in Denver byOrder member Bruce Pierce. **Atomwaffen Division (AWD)** The Atomwaffen Division, one of the most violent neo-Nazi accelerationist groups in the U.S., was officially founded in October 2015 byBrandon Clint Russell, a former Florida National Guardsman. Russell had been active on a neo-Nazi web forum IronMarch.org since 2014 and announced the group’s formation on the site. He used the handle “Odin” to connect with other far-right extremists. AWD quickly gained notoriety for its violent, neo-Nazi ideology, advocating for a race war and the collapse of the U.S. government through terrorism. The group drew inspiration from the writings of white supremacist James Mason,particularly his collection of essays titled “Siege.” AWD’s activities included recruiting members on university campuses and among military personnel, engaging in paramilitary training, andpromoting accelerationist violence. The group has been linked to multiple murders and plots in the United States and hasinspired offshoots in Europe and other regions. By 2020, AWD unraveled due to law enforcement pressure, prosecutions and internal splits. Though not fully gone, it effectively stopped operating under its name. Members helped formthe National Socialist Order, which continues to promote Mason’s “Siege” and violent accelerationism. **Active Club Network** Active clubsare loosely organized, often regional groups of white supremacists and neofascists who combine fitness, combat training and ideology to promote violence and white nationalist goals. Members protest Pride and multicultual events and recruit membersthrough fighting and combat sports. Active clubs and similar extremist networks use a multipronged recruitment strategy, combiningonline reach via Telegram and other social mediawithin-person, fighting-based community-buildingto attract new members. Neo-Nazi counterdemonstrators shout angrily at the marchers from behind police barricades during the Lesbian and Gay Pride March on Fifth Avenue in New York, on June 25, 1995.AP Photo/Kathy Willens Emerging in2017 from the street-fighting “Rise Above Movement” in Southern Californiaand gaining prominence in the 2020s through the rise ofThe Active Club Network, or ACN, this movement demonstrated a shift from online-only, far-right groups togroups willing to fight. Beginning in December 2020,The Active Club Networkformed as a loosely affiliated, decentralized web of white supremacist, fascist and accelerationist groups that operate under a shared banner promoting physical training, brotherhood and militant white nationalism. **The Base** Founded around 2018,The Baserepresents one of the most explicit modern expressions of white nationalist accelerationism: as it is known by members, its “Siege Culture.” Founded by Rinaldo Nazzaro, an American living in Russia who used the name Roman Wolf, the group recruited ex-military and survivalists preparing for collapse through self-sufficiency, aiming to spark a race war. The Base was directly influenced by James Mason’s book “Siege.” The Base operates as a decentralized network of cells trained in paramilitary tactics, sabotage and guerrilla warfare. Their online propaganda explicitlycalls for violent action to destabilize society. Its members have beeninvolved in plots to murder anti-fascist activists, poison water supplies, derail trains and attack critical infrastructure. In 2020, multiple members were arrested before they could carry out an armed assault at apro-gun rally in Richmond, Virginia, where theyplanned to attack police officers and civilians. Although several members have been arrested and convicted on a variety of crimes, includingconspiracy to commit murder,civil disorder,firearm charges,vandalismand otherviolent crimes, The Base illustrates a fundamental feature of accelerationism: “leaderless resistance,” or a lack of a centralized leadership, whichhelps it survive and thrive. Its ideology and tactics are spread through online forums dedicated to white supremacist propaganda. **Patriot Front** Founded in 2017 by Thomas Rousseau,Patriot Frontis a white supremacist group that emerged from a split with Vanguard America following theUnite the Right rally in Charlottesville, Virginia. Vanguard America was a white supremacist group that opposed multiculturalism and whose membersbelieved America should be an exclusively white nation. The goals of the organizers of the Unite the Right rally included unifying the American white nationalist movement and opposing theproposed removal of the statue of Robert E. Lee, the general who led the Confederate troops of slave states during the Civil War, from Charlottesville’s former Lee Park. The rally sparked a national debate over Confederate iconography, racial violence and white supremacy. The Patriot Front defines itself as an organization of “American nationalists.” According to the Anti-Defamation League, since 2019 the Patriot Front has been responsiblefor a majority of white supremacist propagandadistributed in the United States, using flyers, posters, stickers, banners and the internet to spread its ideology. The group frequently participates inlocalized “flash demonstrations” where it marches near city halls. Such demonstrations have also increasingly made it one of the United States’ most visible white supremacist groups. In 2024, Patriot Front held demonstrations on patriotic holidays such asMemorial Day, the Fourth of July and Labor Day. Although the group claims loyalty to America, the Patriot Front’s ultimate goal is to form a new state that advocates for the “descendants of its creators” – namely, white men. Understanding the motivations and tactics of accelerationist groups and individuals, I believe, is critical to recognizing and countering the dangers they represent. (Art Jipson, Associate Professor of Sociology, University of Dayton. The views expressed in this commentary do not necessarily reflect those of Religion News Service.) News Politics World U.S. Life & Culture Spirituality & Wellness Opinion Podcast Photos of the Week News Quiz Faiths Christianity Judaism Islam Hinduism Buddhism Atheism & Agnosticism Unaffiliated & Nones Alternative Faiths More Faiths Services Article Republication Wire Subscription Image Search Press Releases Sponsored Content Stay in touch Newsletters Contact Us Stay in touch Newsletters Contact Us About RNS Staff Columnists Donors Careers Leadership Media Kit Annual Report 90th Anniversary"}