{"id": 129, "name": "Berlingske", "domain": "berlingske.dk", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.berlingske.dk/kommentarer/folkemoedet-er-ikke-kun-for-eliten-den-rigtige-lukkede-fest-drejer-sig", "title": "Folkemoedet Er Ikke Kun For Eliten Den Rigtige Lukkede Fest Drejer Sig", "content": "**** Samfund Opinion Business Kultur Menu Dette er en kommentar. Den udtrykker skribentens eller skribenternes holdning. Klikher, hvis du ønsker at sende et debatindlæg til Berlingske. **Folkemødet er ikke kun for eliten – den rigtige lukkede fest drejer sig ikke om gæstelister og vagter i døren, men noget helt andet** Det skal ikke ses som en svaghed, hvis en organisation eller et parti har flere synspunkter, og man er i bevægelse mellem flere holdninger. Det kunne vi godt øve os lidt mere på i Allinge. Rammerne er der i hvert fald til at give den demokratiske samtale et boost. Jesper Olsen, formand, Transparency International Danmark og ekstern lektor i offentlig ret Jeg elsker Folkemødet. Jeg har været med næsten fra starten, kun afbrudt af corona-somrene, og derfor kender jeg alle rutinerne og ved efterhånden, hvordan man skal navigere i de mange begivenheder og indtryk. Der er derfor en vis risiko for at være blevet »hjemmeblind«. Men jeg er så heldig, at jeg hvert år i min omgangskreds har nogen, der er på Folkemødet for første gang og kan besvare spørgsmålet om, hvad de så synes om det. Sidste år fik jeg et meget tankevækkende svar: Det var helt tydeligt, at Folkemødet både er en åben og en lukket fest. Folkemødet er ikke – modsat hvad mange, der ikke skal til Bornholm, siger – kun for eliten. Der er rigtig mange deltagere, der ikke er der i en professionel sammenhæng og som ikke kan få refunderet kvitteringerne fra mad- og drikkeboderne. Det er ikke falsk varebetegnelse, at kalde det et folkemøde. Men – og det var måske det mine gode venner fandt provokerende – Folkemødet udstiller også, at den demokratiske samtale foregår i mange rum, hvoraf nogle kun er for de særligt udvalgte. I det ellers meget egalitære Danmark er rammen om den demokratiske samtale et klassesamfund. På den måde er Folkemødet ikke anderledes end dagligdagen i København. Her kan det bare ikke skjules – og godt for det! På mange måder er også hverdagens demokratiske samtale tæt koreograferet – om vi kan lide det eller ej. Måske er det en af de debatter, som vi også skal have på Folkemødet, når vi også mødes og taler sammen uden for de hvide telte og højbordenes scenografi. Denne kommentar er ikke til for at skælde ud på professionelle meningsmaskiner, kommunikationsrådgivere, lobbyister, organisationer og politikere. Ej heller de lukkede arrangementer. Den er til for at rejse debatten om, hvordan vi kan tage noget af den brutale transparens, der trods alt er på Bornholm, med hjem. At vi står ved, hvem der taler med hvem, og at der nogle gange skal skænkes en udsøgt vin i glasset, for at man takker ja til invitationen til at skabe relationer. **Dette kan vi øve os på i Allinge** »Der er ikke noget helt rent sted at stå på spillepladen, så hvor stiller vi os så?«, »Alle lever vi i og til dels af vores netværk – det afgørende er derfor, hvilken betydning netværk har i forhold til kvalifikationer,« og »Jeg ville hade at leve i et land uden lobbyisme, hvor politikere og myndigheder traf beslutning uden at tale med de personer, organisationer og virksomheder, der bliver direkte berørt.« Disse tre sætninger har jeg ikke tal på, hvor ofte jeg har gentaget dem de sidste fem år som formand for Transparency International Danmark og deltager i den offentlige debat. De udtrykker på hver deres måde en forudsætning om, at demokrati i sin kerne er interessevaretagelse. I det sunde demokrati er det min påstand, at det kan – og tør man – godt gøre med en langt større åbenhed, end det sker i dag. Ingenting kommer af ingenting. Og slet ikke politiske beslutninger. I mit LinkedIn-feed begynder Folkemødet i det tidlige forår. Især ser jeg mange opslag om, at man stadig har plads i programmet, hvis der er nogen, der inviterer en op på scenen. Jeg kan ikke sige mig helt fri for, at jeg også selv først er helt folkemøderolig, når der er noget på programmet hver dag. »Den rigtige lukkede fest handler nemlig ikke kun om gæstelister og vagter i døren, men om manglende mod til en reel samtale, at blive klogere og at være i bevægelse,« skriver Jesper Olsen i denne kommentar.Fold sammenLæs mereFoto: Mathias Svold. Hver gang en debat er færdig og man evaluerer for sig selv, er et af punkterne om det var »de rigtige«, der kom og om folk blev hængende. På den måde er Folkemødet også benhårdt. Når vi står i et radio- eller tv-studie, kan vi meningsmaskiner ikke se, når folk zapper eller går ud efter frisk kaffe. Her er det anderledes brutalt. At have tid til at lytte og reflektere er et af de punkter, hvor mine demokratiske kompetencer er mindst stimuleret efter tre dage i mylderet mellem de hvide telte og den særlige lyd af mange debatter, der er i gang på samme tid. Et af de debatvirkemidler, jeg er begyndt at bruge aktivt, er, at jeg er i bevægelse på holdninger. Når man taler med mennesker, man ikke er enig i, så løber man jo den risiko at blive klogere, mere nuanceret eller endda at kunne skifte holdning. Når jeg siger det til en journalist eller en moderator, bliver de oprigtigt nysgerrige, og jeg får automatisk mere taletid. Og det er ikke bare et trick. Det er sådan set oprigtig ment. For mig er det ikke diskvalificerende at være kritisk og vedholdende i sin kritik. Det diskvalificerende er, hvis man er argumentresistent og man ikke evner at lytte og prøve sine argumenter af. Og det er måske det, vi skal øve os i, når det kommer til den demokratiske samtale. At det ikke er breaking news og en svaghed, hvis der i en organisation eller et parti er flere synspunkter, og man er i bevægelse. Jeg tror sådan set, at det vil være en styrke og gøre vores demokrati mere robust over for hurtige bevægelser, når der er nogle med pludselig populistisk gennemslagskraft, hvis vi bliver vant til, at politikere og professionelle meningsmaskiner ikke har svaret på alt. Det kunne vi godt øve os lidt mere på i Allinge. Rammerne er der. De almindelige mennesker er der. Politikerne og deres rockwoollag af rådgivere og lobbyister er der. Meningsmaskinerne er der. Forudsætningerne er der for, at give den demokratiske samtale et boost, hvis vi tør lidt mere, og hvis vi står ved, hvordan de faktiske forhold er i meningsindustrien. Den rigtige lukkede fest handler nemlig ikke kun om gæstelister og vagter i døren, men om manglende mod til en reel samtale, at blive klogere og at være i bevægelse. Jesper Olsen er formand for Transparency International Danmark og ekstern lektor i offentlig ret **LÆS MERE** **Mest læste** Grundlagt 1749 af Ernst Henrich Berling Berlingske Media A/S Berlingske Media A/S Berlingske Media A/S Pilestræde 34 Pilestræde 34 Pilestræde 34 DK-1147 København K, Danmark DK-1147 København K, Danmark DK-1147 København K, Danmark Om Berlingske Kontakt redaktionen Fejl og fakta Etiske regler Ophavsret og vilkår Annoncering Kundeservice Ferieændring Reklamation Mine abonnementer Kundeservice Opsig abonnement Produkter Nyhedsbreve E-avis RSS Tom Jensen, Chefredaktør (Ansv) Pierre Collignon, Chefredaktør Anders Krab-Johansen, Koncernchef og udgiver Følg Berlingske © Berlingske Media |Generelle handelsbetingelser Cookie- og Privatlivspolitik|CookiedeklarationCVR.nr.: 29 20 73 13"}