{"id": 136, "name": "Biotechnology Innovation Organization (BIO)", "domain": "bio.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.bio.org/podcast/how-love-combined-science-leads-hope-rare-disease", "title": "How Love Combined Science Leads Hope Rare Disease", "content": "PolicyGet InvolvedJoin BIOActionView Advocacy ToolkitPatient AdvocacyHuman HealthCost and Value of BiopharmaceuticalsAntimicrobial ResistanceVaccines & BiodefenseDrug Development & ReviewAgriculture & EnvironmentAddressing Climate ChangeStrengthening the BioeconomyGrowing Trust in InnovationInternationalGlobal Markets & TradeMultilateral OrganizationsIntellectual PropertyAll PolicyPatient AdvocacyJoin BIO as we champion for bringing new treatments to patients with serious medical conditions and to support policies that promote innovation and improve patient access. Join BIO as we champion for bringing new treatments to patients with serious medical conditions and to support policies that promote innovation and improve patient access. Join BIO as we champion for bringing new treatments to patients with serious medical conditions and to support policies that promote innovation and improve patient access. Join BIO as we champion for bringing new treatments to patients with serious medical conditions and to support policies that promote innovation and improve patient access. MemberMembership OptionsBecome a BIO MemberMember DirectoryHave a VoiceMembership EligibilityMember ToolkitBenefits By SectorHuman HealthStartupsAgriculture & EnvironmentNon-R&D CompaniesMember SavingsVWR, Part of Avantor75% off Lab SuppliesSave with BIOSave with BIO News & InsightsLatest biotech newsPopular blogsEventsPolicyBIO StatementsPress ReleasesLetters, Testimony & CommentsAmicus BriefsBIO ReportsIndustry Analysis ReportsBiotech JobsEconomic Development Best PracticesBIO BrieflyIssue BriefsBIO.NewsI am BIO PodcastAll News & InsightsSign up for the BIO.News Newsletter > Sign up for the BIO.News Newsletter > Sign up for the BIO.News Newsletter > EventsEvent PortfolioBusiness DevelopmentHealthAgriculture & EnvironmentInternationalProfessional DevelopmentMembers OnlyAll EventsBIO International ConventionJune 16-19, 2025 | Boston, MALearn MoreBioSafe General Membership MeetingApril 7-9, 2025Basel, SwitzerlandPartnering @JPM WeekSan Francisco, CABIO CEO & Investor ConferenceMiami, FL | 2026BIO WebinarsExplore the webinar opportunities for interactive, online learning about emerging issues in biotechnology public policy, scientific progress, and raising capital, plus methods to benefit from BIO’s membership services. June 16-19, 2025 | Boston, MA April 7-9, 2025Basel, Switzerland San Francisco, CA Miami, FL | 2026 Explore the webinar opportunities for interactive, online learning about emerging issues in biotechnology public policy, scientific progress, and raising capital, plus methods to benefit from BIO’s membership services. June 16-19, 2025 | Boston, MA April 7-9, 2025Basel, Switzerland April 7-9, 2025Basel, Switzerland San Francisco, CA San Francisco, CA Miami, FL | 2026 Miami, FL | 2026 Explore the webinar opportunities for interactive, online learning about emerging issues in biotechnology public policy, scientific progress, and raising capital, plus methods to benefit from BIO’s membership services. Explore the webinar opportunities for interactive, online learning about emerging issues in biotechnology public policy, scientific progress, and raising capital, plus methods to benefit from BIO’s membership services. AboutAbout UsLearn about our prioritiesBIO LeadershipMeet BIO's Senior Leadership and Board of DirectorsBiotech BasicsRead about biotechnologyIndustry RecognitionGet to know the outstanding people and companies BIO supportsCareers @ BIOExplore job openings with BIO todayDiversity & Inclusion >Our tools and initiatives on workforce development, diversity and inclusion are designed to advance a more globally competitive industry. Our tools and initiatives on workforce development, diversity and inclusion are designed to advance a more globally competitive industry. Our tools and initiatives on workforce development, diversity and inclusion are designed to advance a more globally competitive industry. Our tools and initiatives on workforce development, diversity and inclusion are designed to advance a more globally competitive industry. Resource HubLatest ResourcesBIO Early-Stage Resources HubBIO Professional DevelopmentBIO Content HubBiotech News (BIO.News)BIO.News NewsletterI am BIO PodcastBIO Advocacy ToolkitResources HubBIO Early-Stage Resources HubBIO Professional DevelopmentBIO WebinarsBIO MicrositesClinical Trials: The Power of ParticipationCovid Vaccine Facts SearchSearch ResultsPreviously SearchedClear Search HistoryClear PolicyHuman HealthPatient AdvocacyAgriculture & EnvironmentInternationalIntellectual PropertyAll Policies MemberBecome a BIO MemberBenefits By SectorHuman HealthAgriculture & EnvironmentStartupsNon-R&D CompaniesMember DirectoryHave a VoiceMembership EligibilitySavings News & InsightsPress ReleasesBio.News BlogLetters, Testimony & CommentsAmicus BriefsIndustry Analysis ReportsBiotech JobsEconomic Development Best PracticesIssue BriefsBIO.NewsVideosAll News & Insights EventsBIO International ConventionBIO Asia-TaiwanAll Events AboutAbout UsBIO LeadershipDiversity & InclusionBiotech BasicsIndustry RecognitionCareers @ BIO Resource HubBiotech News (BIO.News)BIO.News NewsletterI am BIO PodcastBIO Advocacy ToolkitBIO Early-Stage Resources HubBIO Professional DevelopmentBIO WebinarsClinical Trials: The Power of ParticipationCovid Vaccine Facts **I am BIO Podcast** Powerful stories of biotech breakthroughs, the people they help, and the global problems they solve. There are over 7000 rare diseases identified in the U.S. alone. Many of these diseases affect children, leaving families desperate for answers. In this episode, we talk with one of those families and the biotech company offering them new hope. We also talk with an expert on policy that has jump-started R&D for rare diseases. A troubling disconnect between medical expertise and insurance mandates is putting patients' health at risk. Policies like step therapy and prior authorization are forcing individuals into treatments not recommended by their doctors—often with devastating consequences. In this episode, we hear from a patient who endured months of suffering due to her insurer's 'fail-first' requirements. We also talk with a doctor navigating this impossible system and a biotech leader fighting to ensure innovative treatments reach the patients who need them most. David Fajgenbaum was in his third year of medical school when he was diagnosed with a rare and life-threatening disease that began shutting down his organs, bringing him perilously close to death. Although he survived the initial episode, he faced four additional relapses, each pushing him to the brink of death. In this episode, we speak with David about his relentless journey to discover the treatment that ultimately put his disease into remission. We also explore how his personal battle inspired the creation of a groundbreaking approach to help others suffering from rare diseases. Bradley Burnam woke up one morning, looked in the mirror and found one ear twice it’s normal size and his face swollen and discolored. He would spend the next several years in and out of the hospital fighting a relentless infection that would not respond to available treatments. The experience took him from patient to \"mad scientist\" to biotech company founder. In this episode, Bradley takes us through his desperate journey to find a cure. We also talk with the leader of an organization helping to get more antimicrobials to the marketplace. When people were dying from AIDS in the 1980s and 90s, Congress found a way to expedite the drug approval process and saved countless lives. Established in 1992, the Accelerated Approval Program allows the FDA to speed approval of drugs for patients with serious and life-threatening conditions. In this episode we talk with the father of children with a rare disease, a company CEO working to treat rare diseases and two policy experts on Accelerated Approval. Patient Advocates do more than raise money—they are active participants in the drug development process. While the ALS Ice Bucket Challenge garnered global attention, lesser-known patient advocates also flex their expertise to drive new treatments and cures. In this episode, we talk with two moms, one who is a patient herself, about their work as partners in research and development, helping bring treatments for two rare diseases to the market. Contact us"}