{"id": 1460, "name": "Thomasville Times-Enterprise", "domain": "timesenterprise.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://timesenterprise.com/2025/06/04/gabor-financial-solutions-donates-more-than-7000-to-the-vashti-center-through-employee-giving-program/", "title": "Gabor Financial Solutions Donates More Than 7000 To The Vashti Center Through Employee Giving Program", "content": "Home Subscriptions Newsletter Signup E-edition NewsLocal NewsState NewsBusinessEducationFaith and Values Local News State News Business Education Faith and Values Local News State News Business Education Faith and Values Obituaries Multimedia OpinionEditorialsColumnsLetters to the EditorRant & Rave Editorials Columns Letters to the Editor Rant & Rave Editorials Columns Letters to the Editor Rant & Rave Sports CommunityBirthsEngagementsWeddingsAnniversaries Births Engagements Weddings Anniversaries Births Engagements Weddings Anniversaries ClassifiedsJobs Jobs Jobs NoticesLocal Public NoticesGeorgia Public Notices Local Public Notices Georgia Public Notices Local Public Notices Georgia Public Notices Home News Obituaries Opinion Sports Classifieds E-Edition **Gabor Financial Solutions donates more than $7,000 to The Vashti Center through Employee Giving Program** Published 7:43 pm Wednesday, June 4, 2025 ByStaff reports THOMASVILLE — The Vashti Center for Children and Families is thrilled to announce a generous contribution of more than $7,000 made possible through Gabor Financial Solutions’ “Lincoln Cares” employee giving program. This impactful gift was initiated by Christy Worley, VP/Director of Operations at Gabor, who was introduced to Vashti through her friendship with Audrey Copeland, Vashti’s Director of Marketing & Development. Though a more recent supporter, Worley quickly became a raving fan of Vashti’s mission and work. Through the Lincoln Cares program, Gabor employees have the opportunity to nominate a nonprofit organization they are passionate about. Once approved, employee payroll deductions are matched by the company to amplify the impact. Moved by what she saw, Worley nominated Vashti for the vital services it provides to youth and families across Southwest Georgia. “Vashti was an easy choice,” said Worley. “The services they provide in and around Thomasville are critical. I’ve seen firsthand the love, support, and healing they offer to children and families in our community. I’m honored to give back to an organization that gives so much every day.” **Email newsletter signup** Worley and her husband, Kenny, have also taken the opportunity to volunteer with Vashti, supporting various campus and community events. Their hands-on service and heartfelt nomination led to Gabor Financial Solutions matching their generosity in a tangible way—resulting in a total donation of over $7,000 to support Vashti’s mission. “We’re incredibly grateful to Christy, her family, and the entire Gabor Financial Solutions team,” said Copeland. “This gift not only supports our mission—it exemplifies how corporate and community partnerships can work hand-in-hand to make lasting change in the lives of vulnerable children. We especially want to thank Kevin Sokolow, President, and Larry Sokolow, CEO, for their leadership in fostering a company culture that empowers employees to give back in such meaningful ways.” Vashti provides residential foster care, after school enrichment, and community-based counseling services to more than 450 children and families annually across Southwest Georgia—serving youth in schools, in their homes, and within the community. The organization also leads the Resilient Communities of Southwest Georgia coalition in partnership with Resilient Georgia and Georgia State University, bringing together regional leaders to promote trauma-informed practices. Additionally, Vashti provides substance misuse prevention and treatment for adolescents through The Seven Challenges® program, a nationally recognized evidence-based model. Contributions like this help ensure that every child in Vashti’s care is welcomed with dignity, compassion, and hope. To learn more about how to support The Vashti Center, visit www.vashti.org/give. **You Might Like** **Thomas County Schools at the forefront of AI education through AI4GA partnership** **Thomas County Schools at the forefront of AI education through AI4GA partnership** **Juneteenth of Thomasville celebrates ribbon cutting, announces 2025 Freedom Festival** **Juneteenth of Thomasville celebrates ribbon cutting, announces 2025 Freedom Festival** **Grady County splash pad expected to open this summer** **Grady County splash pad expected to open this summer** **Cameras presented to Jack Hadley Black History Museum** **Cameras presented to Jack Hadley Black History Museum** Home News Obituaries Sports Business Opinion Community Multimedia e-Edition Classifieds Jobs About Us Contact Us"}