{"id": 888, "name": "Mediapart", "domain": "mediapart.fr", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.mediapart.fr/journal/international/dossier/la-guerre-russe-contre-l-ukraine-0", "title": "La Guerre Russe Contre L Ukraine 0", "content": "Contenu principal Recherche Pied de page Français English Español Mercredi 11 juin Édition du soir Nous contacter Se connecter S’abonner Rechercher Menu À la Une Vidéos RubriquesEnquêtesDossiersSériesPodcastsInternationalÉcologieÉconomie et socialFrancePolitiqueCulture et idées Enquêtes Dossiers Séries Podcasts International Écologie Économie et social France Politique Culture et idées Enquêtes Dossiers Séries Podcasts International Écologie Économie et social France Politique Culture et idées Le Club Guerre au Proche-Orient Affaire Bayrou-Bétharram Guerre en Ukraine À la UneÉdition du soir Vidéos Enquêtes Dossiers Séries RubriquesInternationalÉcologieÉconomie et socialFrancePolitiqueCulture et idées International Écologie Économie et social France Politique Culture et idées International Écologie Économie et social France Politique Culture et idées Fil d’actualité MultimédiaPodcastsPortfoliosPanoramiquesVidéosDocumentaires Podcasts Portfolios Panoramiques Vidéos Documentaires Podcasts Portfolios Panoramiques Vidéos Documentaires Le Club de MediapartParticipez au débatÀ la Une du ClubDepuis 48hLes blogsLes éditionsL’agendaLa charteParticiper À la Une du Club Depuis 48h Les blogs Les éditions L’agenda La charte Participer À la Une du Club Depuis 48h Les blogs Les éditions L’agenda La charte Participer Newsletters Découvrez notre offre de newsletters Newsletters Découvrez notre offre de newsletters L’application Mediapart Découvrez notre application pour mobile & tablette L’application Mediapart Découvrez notre application pour mobile & tablette Nous suivre Toutes les plateformes pour suivre et écouter Mediapart Nous suivre Toutes les plateformes pour suivre et écouter Mediapart Informer la rédaction Contacter le service abonné·es English Español La Rédaction de Mediapart Notre impact Mentions légales Charte de déontologie Charte de participation CGV Confidentialité **DossierLa guerre russe contre l’Ukraine** La guerre menée par la Russie contre l’Ukraine est entrée le 24 février 2023 dans sa deuxième année. Retrouvez dans ce dossier nos articles, reportages et chroniques sur la poursuite du conflit déclenché par Vladimir Poutine et sur le front diplomatique. Tous nos dossiers sur la guerre en Ukraine : Comprendre la guerre en Ukraine(entretiens et analyses) Le premier anniversaire de la guerre La première année du conflit La rédaction de Mediapart— 219 articles Mis à jour le 5 juin 2025 Le lien vers la page a été copié **« La Russie restera notre voisine » : comment l’Ukraine se bunkérise** Se préparant à une guerre longue, Kyiv développe des infrastructures en sous-sol dans les villes proches du front. La Finlande vient de prendre la tête d’une coalition pour l’aider dans cet effort, déjà visible dans les hôpitaux de Kherson et les écoles souterraines de Zaporijjia. parPierre Alonso **L’Ukraine frappe spectaculairement l’aviation russe et s’offre un coup d’éclat symbolique** Les services secrets de Kyiv ont détruit, dimanche 1er juin, plus d’une dizaine d’avions militaires russes qui stationnaient sur leurs bases. L’opération, complexe et inédite, permettrait de faire se relâcher légèrement la pression de Moscou sur le ciel ukrainien. Et de compter dans le nouveau round de négociations qui s’ouvrait lundi à Istanbul. parJustine Brabant **La Russie tente d’écraser l’Ukraine sous une pluie de drones kamikazes** Faute de percée décisive sur le front, les forces armées de Moscou lancent une quantité de drones jamais vue sur leur voisin. L’Ukraine réplique en tentant de frapper la machine militaire russe, qui préparerait une grande offensive d’été. parJustine Brabant **Faire de la politique en temps de guerre : les dilemmes des députés ukrainiens** Reportage Plus de trois ans après l’invasion russe de février 2022, le Parlement ukrainien n’a jamais cessé de fonctionner. Mais ses députés sont divisés sur leur rôle, entre soutien de l’exécutif au nom de l’unité nationale et critiques plus radicales. parJustine Brabant **En Ukraine, les anarchistes sur le pied de guerre** Reportage Anarchistes mais aussi écoféministes ou punks : les différentes sensibilités de la galaxie antifasciste ukrainienne se sont unies, depuis l’invasion russe de février 2022, pour soutenir matériellement leurs militantes et militants partis au front. Y compris en fabriquant des drones. parJustine Brabant **Une nouvelle attaque massive sur l’Ukraine a fait au moins 12 morts** L’Ukraine a subi une nouvelle attaque aérienne massive dimanche matin, quelques heures avant un dernier échange de prisonniers qui s’est tenu entre la Russie et l’Ukraine. parAgence France-Presse **Aux discussions d’Istanbul, le double visage de la Russie** Analyse Des représentants de l’Ukraine et de la Russie se sont rencontrés en Turquie le 16 mai, une première depuis 2022. Alors que Vladimir Poutine essaie de convaincre Donald Trump qu’il est un homme de paix, sa délégation a multiplié les revendications territoriales fantaisistes et s’est dit prête à « se battre pour toujours ». parJustine Brabant **« Poutine n’ira pas à Istanbul » : les Ukrainiens voudraient la paix mais n’y croient pas** Reportage Même s’ils pensent que rien de concret n’en sortira, les Ukrainiens suivent avec grande attention la possible rencontre entre représentants de la Russie et de l’Ukraine à Istanbul, jeudi 15 mai. Reportage à Sviatochyne, un quartier de la capitale durement touché par les attaques russes. parJustine Brabant Newsletters Découvrez les newsletters de Mediapart Recevez directement l’info de votre choix : Quotidienne, Hebdo, Alerte, À l’air libre, Écologie, Enquête … Tous les articles **Ukraine : « Les tractations actuelles sont du théâtre en direction d’un spectateur, Trump »** Entretien Marie Dumoulin décrypte les rebondissements diplomatiques censés aboutir, jeudi 15 mai à Istanbul, à des pourparlers directs entre l’Ukraine et la Russie. Malgré l’impression d’une accélération des événements, elle souligne que dans le conflit, « rien n’a changé ». parFabien Escalona **Zelensky dit qu’il « attendra » Poutine en Turquie et appelle à un cessez-le-feu complet dès lundi** Le président ukrainien a déclaré dimanche qu’il « attendrait » son homologue russe en Turquie, où ce dernier a proposé plus tôt de tenir des discussions « directes » et « sans condition préalable » entre la Russie et l’Ukraine à partir de jeudi. Mais Vladimir Poutine n’a pas accepté le cessez-le-feu de trente jours exigé par les soutiens de l’Ukraine. parLa rédaction de MediapartetAgence France-Presse **À Kyiv, l’Ukraine et ses alliés proposent un cessez-le-feu « complet et inconditionnel » de 30 jours à la Russie** Au lendemain d’une démonstration de force diplomatique russe, Emmanuel Macron, Friedrich Merz, Keir Starmer et Donald Tusk ont réclamé, de concert avec les États-Unis et depuis Kyiv, un « cessez-le-feu complet et inconditionnel » de 30 jours à Moscou. Le président français et le chancelier allemand menacent de durcir les sanctions contre la Russie si elle n’accepte pas. parLa rédaction de MediapartetAgence France-Presse **Pourquoi l’Ukraine ne veut pas de la « trêve » de Poutine** La Russie a annoncé un cessez-le-feu de trois jours à compter de ce jeudi 8 mai. L’exécutif ukrainien, qui y voit surtout une manière pour Vladimir Poutine de protéger sa grande parade militaire annuelle, ne compte pas s’y plier. parJustine Brabant Audio disponible **Accord sur les minerais ukrainiens : de quoi parle-t-on ?** Le partenariat signé mercredi entre Kyiv et Washington ouvre la voie à l’exploitation, par des sociétés états-uniennes, des minerais, gaz et pétrole ukrainiens. Mais les connaissances sur ces ressources sont sommaires et datent d’une autre époque. parJustine BrabantetAmélie Poinssot **Les États-Unis et l’Ukraine signent l’accord attendu sur l’accès aux ressources naturelles** Le vaste partenariat signé mercredi à Washington prévoit de donner un accès aux États-Unis aux minerais, pétrole et gaz ukrainiens, et la mise en place d’un fonds d’investissement dans la reconstruction du pays. Des frappes russes ont tué deux personnes à Odessa. parAgence France-Presse **Pour mettre fin à la guerre, Trump offre la Crimée à Poutine** Pour la première fois depuis janvier, les États-Unis ont transmis une proposition concrète d’accord de paix à la Russie et à l’Ukraine. Elle tient en moins d’une page, est globalement favorable à Moscou, et l’une de ses mesures, concernant la Crimée, pourrait être dévastatrice. parJustine Brabant **Crimée : « Reconnaître l’occupation russe comme légitime est un tournant »** Les États-Unis envisagent désormais un « plan de paix » en Ukraine qui inclut la reconnaissance, par Washington, de la Crimée (annexée par Moscou en 2014) comme partie intégrante du territoire russe. Le Kyiv Independent donne la parole aux premiers concernés, dont la voix est rare : les Criméens. parKateryna DenisovaetYuliia Taradiuk (The Kyiv Independent) Pagination Page1 Page2 Page3 Page4 Page10 Page13 Page14 Suivez Mediapart : NewslettersRecevez chaque jour les titres à la Une Nous suivreSuivez notre activité sur les réseaux sociaux International Écologie Économie et social France Politique Culture et idées Dossiers Fil d’actualités Vidéos Podcasts Documentaires Portfolios Panoramiques Depuis 48 heures Les blogs Les éditions L’agenda La charte Participez Qui sommes-nous ? Notre impact Besoin d’aide ? Nous contacter Partager des documents Abonnements pros Plan du site Recrutement Mentions légales Charte de déontologie Charte de participation CGV Confidentialité Gestion des cookies Le journal MEDIAPART est édité par la Société Editrice de Mediapart - 127 avenue Ledru-Rollin, 75011 Paris.RCS Paris 500 631 932. Numéro de CPPAP : 1224Y90071 - Directeur de la publication : Carine Fouteau Votre choix pour vos données Pour mettre le site et l’application mobile de Mediapart à votre disposition nous utilisons des cookies ou technologies similaires qui nous permettent de collecter des informations sur votre appareil.Certaines de ces technologies sont nécessaires pour faire fonctionner nos services correctement : vous ne pouvez pas les refuser. D’autres sont optionnelles mais contribuent à faciliter votre expérience de lecteur ou de lectrice et d’une certaine façon à soutenir Mediapart : vous pouvez à tout moment donner ou retirer votre consentement.Acceptez-vous que Mediapart emploie des cookies ou technologies similaires utiles à son fonctionnement ? Paramètres de confidentialité Les cookies et technologies similaires que nous utilisons sur Mediapart sont de différentes natures et nous permettent de poursuivre différentes finalités.Certains sont nécessaires au fonctionnement du site et de l’application mobile (vous ne pouvez pas les refuser). D’autres sont optionnels mais contribuent à faciliter votre expérience de lecteur ou de lectrice et d’une certaine façon à soutenir Mediapart. Vous pouvez les refuser ou les accepter ci-dessous, selon leurs finalités.Acceptez-vous que Mediapart utilise des cookies ou technologies similaires pour les finalités suivantes ?Vous pouvez faire votre choix, pour chaque catégorie, en activant ou désactivant le bouton interrupteur. Nécessaires au fonctionnementdu site ou de l’application Connexion des abonné·es, mesure d’audience anonymisée, envoi des notifications push, suivi des pannes, mise en avant de nos services : ces outils sont nécessaires au suivi de l’activité de nos services et à leur bon fonctionnement. Voici les différents cookies et technologies similaires compris dans cette catégorie : Cookies d’authentification: connexion des abonné·es. AT Internet: mesure d’audience anonymisée Affichage de contenus éditoriaux multimédias: vidéos (YouTube, Dailymotion, Vimeo, INA), réseaux sociaux (Facebook, Instagram, Pinterest, Twitter), documents (Scribd, Document Cloud, Slideshare), sons (SoundCloud, Spotify, Deezer), cartes (Google Maps, Mapbox, CartoDB, uMap), infographies (Highcharts, GitHub, Datawrapper, Flourish, Infogram, ThingLink, jQuery, Google Fonts, Bootstrap), live blogs (24liveblog, CoverItLive), aide à l’intégration de média dans les publications Journal et Club (Embedly). Typeform: questionnaires facultatifs pour recueillir les avis des lecteurs sur nos produits numériques. Datadog (uniquement sur le site web): indicateurs techniques et équilibrage de charge. Selligent (uniquement sur le site web): communication avec l’abonné·e, mise en avant des services, offres et avantages. Batch (uniquement sur l’application): envoi de notifications push et de messages in-app. Firebase Cloud Messaging (uniquement sur l’application): nécessaire au fonctionnement des notifications push sur Android. Microsoft App Center (uniquement sur l’application): système de mise à jour et de suivi des pannes de l’application. Statistiques Ces outils nous permettent de recueillir des statistiques de fréquentation du site et de l’application mobile pour comprendre les usages, détecter d’éventuels problèmes et optimiser l’ergonomie de nos produits. Voici les outils tiers compris dans cette catégorie : AT Internet: mesure d’audience reliée à l’identifiant d’abonné·e. CrazyEggs (uniquement sur le site web): analyse de parcours client. Nonli (uniquement sur le site web): permet à notre équipe des réseaux sociaux de publier les contenus Mediapart sur les réseaux sociaux. Qiota (uniquement sur le site web): gestion du système de datawall. Reciblage publicitaire Il n’y a pas de publicité sur Mediapart. Mais nous faisons la promotion de nos contenus et services sur d’autres sites et réseaux sociaux. Pour cela, nous utilisons les technologies mises à disposition par certains acteurs publicitaires. Voici les outils tiers compris dans cette catégorie : Facebook (uniquement sur le site web): ciblage d’audience sur les réseaux sociaux pour faire la promotion de Mediapart. Gestion de l’accès aux contenus Nous utilisons le service Qiota d’Opper Marketing Suite pour configurer l’activation d’un datawall sur certains de nos contenus (uniquement sur le site web). Ce dispositif destiné aux utilisateur·ices non abonné·es requiert la saisie d’une adresse email pour accéder aux contenus concernés. En fournissant cette information, l’utilisateur consent à sa collecte, son stockage et son utilisation à des fins statistiques. Conformément à la réglementation en vigueur, les utilisateurs disposent d’un droit d’accès, de rectification et de suppression de leurs données, qu’ils peuvent exercer en contactant dpo@opper.io."}