{"id": 1381, "name": "TheGrio", "domain": "thegrio.com", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://thegrio.com/2025/06/10/claressa-shields-shades-angel-reeses-sportswoman-of-the-year-win-at-2025-bet-awards-i-just-thought-accolades-mattered/", "title": "Claressa Shields Shades Angel Reeses Sportswoman Of The Year Win At 2025 Bet Awards I Just Thought Accolades Mattered", "content": "News EntertainmentFilmTelevisionMusicComedySportsEntertainment VideosAll Entertainment Film Television Music Comedy Sports Entertainment Videos All Entertainment Film Television Music Comedy Sports Entertainment Videos All Entertainment LifestyleBook ClubHBCUHealthLGBTQ+TravelLifestyle VideosAll Lifestyle Book Club HBCU Health LGBTQ+ Travel Lifestyle Videos All Lifestyle Book Club HBCU Health LGBTQ+ Travel Lifestyle Videos All Lifestyle BusinessCareerPersonal FinanceAll Business Career Personal Finance All Business Career Personal Finance All Business Opinion PoliticsGerren Keith GaynorNatasha S. AlfordPolitics VideosAll Politics Gerren Keith Gaynor Natasha S. Alford Politics Videos All Politics Gerren Keith Gaynor Natasha S. Alford Politics Videos All Politics Series/VideosByron Allen PresentsBlack MadeChoosing MotherhoodLife HacksMasters of the GameTheGrio Weekly with Natasha AlfordThe Hill with April RyanAll Videos Byron Allen Presents Black Made Choosing Motherhood Life Hacks Masters of the Game TheGrio Weekly with Natasha Alford The Hill with April Ryan All Videos Byron Allen Presents Black Made Choosing Motherhood Life Hacks Masters of the Game TheGrio Weekly with Natasha Alford The Hill with April Ryan All Videos Stream Live! It Takes A Village Facebook Twitter Instagram Linkedin Youtube **Claressa Shields shades Angel Reese’s ‘Sportswoman of the Year’ win at 2025 BET Awards: ‘I just thought accolades mattered’** In a crowded field that also included Dawn Staley, Simone Biles and Coco Gauff, champion boxer Shields felt some type of way that Reese won over her. Share on Facebook Share on Twitter Share via Email Copy LinkLink Copied Share on Facebook Share on Twitter Share via Email Copy LinkLink Copied The 2025 BET Awards seem to be the gift that keeps on giving.Not only has B2Kannounced a 2026 reunion tour following their performance during the “106 & Park” opening segment of the show, but it also seems like we might have some beef brewing between two of the sports world’s most popular figures: world champion boxer Claressa Shields and WNBA superstar Angel Reese. Reese won the 2025 “Sportswoman of the Year” award at this year’s BET Awards, and it would seem that Shields was none too happy about it. It’s hard to tell if Shields was unhappy that she lost or if she was unhappy that she lost to Reese, who also beat out a quite crowded field that included Dawn Staley, A’ja Wilson, Sha’Carri Richardson, Simone Biles, Flau’Jae Johnson, Coco Gauff, and Juju Watkins. Still don’t know how I didn’t win the Sportswoman of the Year for the@BETAwardsbut Congrats to Angel Reese and all the other Nominees 🤷🏽‍♀️ I just thought accolades mattered. In a post on X, Shields said, “I don’t know how I didn’t win the Sportswoman of the Year for the BET Awards but congrats to Angel Reese and all the other nominees. I just thought accolades mattered.” As a point of note, Shields is a 2-time Olympic champion and, according to her X profile, a 17-time world champion and 4-time undisputed champ. Inarguably, she’s as dominant in her sport as a person can be. Reese also has many accolades under her belt, including both a 2023 NCAA women’s basketball championship and that tournament’s “Most Outstanding Player” award, among a litany of other accomplishments across the college and, now, the WNBA world. When folks challenged Shields about Reese, indeed, also having accomplishments and accolades, Shields doubled down. While acknowledging that Reese does have accolades, she pushed back. “Yes she does but who has more accolades? More success in their field…,” she asked in a response post. After continued pushback and allegations that she was messy and a sore loser,Shields kept it real. Ain’t nobody saying Angel Reese don’t have accolades or she not good…. I’m saying I thought the person with “THE MOST” accolades & accomplishments would win the Award. I’m team Angel Reese! “Ain’t nobody saying Angel Reese don’t have accolades or she not good…I’m saying I thought the person with the “MOST” accolades & accomplishments would win the awards. I’m team Angel Reese.” Shields might be team Angel Reese (many are) and having a public moment of frustration. Maybe she thought she was a shoo-in for the award, though one has to wonder if she would feel the same if Simone Biles or A’ja Wilson won. That, we’ll never know. Hopefully, this doesn’t become a social media mess with a back-and-forth between the two women. The world is better when Shields and Reese are just two women doing big things in their respective fields, bigging one another up without the extra sauce on it. More About:SportsEntertainment Weekly New EpisodesStream Now COMPANYAbout usAdvertiseNotice At CollectionPrivacy PolicyTerms of UseDo Not Sell or Share My Information About us Advertise Notice At Collection Privacy Policy Terms of Use Do Not Sell or Share My Information About us Advertise Notice At Collection Privacy Policy Terms of Use Do Not Sell or Share My Information POLITICSGerren Keith Gaynor Gerren Keith Gaynor Gerren Keith Gaynor ENTERTAINMENTFilmTelevisionMusicComedySports Film Television Music Comedy Sports Film Television Music Comedy Sports OPINIONDonna BrazileChristina GreerMichael HarriotPanama JacksonMonique JudgeDavid LoveDeron SnyderJuanita TolliverTouré Donna Brazile Christina Greer Michael Harriot Panama Jackson Monique Judge David Love Deron Snyder Juanita Tolliver Touré Donna Brazile Christina Greer Michael Harriot Panama Jackson Monique Judge David Love Deron Snyder Juanita Tolliver Touré LIFESTYLEBusinessHealthTravelHBCUBooks Business Health Travel HBCU Books Business Health Travel HBCU Books PODCASTSActing UpBeing Black The ’80sBlackest QuestionsDear CultureJudge Kevin RossStar StoriesTheGrio DailyWriting Black Acting Up Being Black The ’80s Blackest Questions Dear Culture Judge Kevin Ross Star Stories TheGrio Daily Writing Black Acting Up Being Black The ’80s Blackest Questions Dear Culture Judge Kevin Ross Star Stories TheGrio Daily Writing Black VIDEOS Facebook Instagram Linkedin Twitter Youtube"}