{"id": 694, "name": "Inter Press Service", "domain": "ipsnews.net", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ipsnews.net/2025/06/waves-of-change-from-the-glittering-shores-of-nice-to-struggling-seaweed-farmers-in-zanzibar/", "title": "Waves Of Change From The Glittering Shores Of Nice To Struggling Seaweed Farmers In Zanzibar", "content": "ESPAÑOL FRANÇAIS DEUTSCH ITALIANO JAPANESE NEDERLANDS PORTUGUÊS SUOMI SVENSKA SWAHILI TÜRKÇE Wednesday, June 11, 2025 **INTER PRESS SERVICE** **News Agency** **News and Views from the Global South** Africa Asia-Pacific Europe Latin America & the Caribbean Middle East & North Africa North America Global Home Development & AidAidEducationEnergyHealthFood & AgricultureHumanitarian EmergenciesPoverty & SDGsPopulation Aid Education Energy Health Food & Agriculture Humanitarian Emergencies Poverty & SDGs Population Aid Education Energy Health Food & Agriculture Humanitarian Emergencies Poverty & SDGs Population Economy & TradeFinancial CrisisGreen EconomyLabourNatural ResourcesTrade & InvestmentCooperatives Financial Crisis Green Economy Labour Natural Resources Trade & Investment Cooperatives Financial Crisis Green Economy Labour Natural Resources Trade & Investment Cooperatives EnvironmentAdvancing DesertsBiodiversityClimate ChangeGreen EconomyWater & Sanitation Advancing Deserts Biodiversity Climate Change Green Economy Water & Sanitation Advancing Deserts Biodiversity Climate Change Green Economy Water & Sanitation Human RightsArmed ConflictsCrime & JusticeDemocracyIndigenous RightsLGBTQMigration & RefugeesPress FreedomReligion Armed Conflicts Crime & Justice Democracy Indigenous Rights LGBTQ Migration & Refugees Press Freedom Religion Armed Conflicts Crime & Justice Democracy Indigenous Rights LGBTQ Migration & Refugees Press Freedom Religion Global GovernanceCivilisations Find AlliancesEye on the IFIsGlobal GeopoliticsGlobalisationPeaceSouth-SouthUnited Nations Civilisations Find Alliances Eye on the IFIs Global Geopolitics Globalisation Peace South-South United Nations Civilisations Find Alliances Eye on the IFIs Global Geopolitics Globalisation Peace South-South United Nations South-SouthG77Regional AlliancesSouthern Aid & Trade G77 Regional Alliances Southern Aid & Trade G77 Regional Alliances Southern Aid & Trade Civil SocietyActive CitizensWorld Social ForumConferences Active Citizens World Social Forum Conferences Active Citizens World Social Forum Conferences GenderGender ViolenceWomen & EconomyWomen & Climate ChangeWomen’s HealthGender IdentityWomen in Politics Gender Violence Women & Economy Women & Climate Change Women’s Health Gender Identity Women in Politics Gender Violence Women & Economy Women & Climate Change Women’s Health Gender Identity Women in Politics **Waves of Change: From the Glittering Shores of Nice to Struggling Seaweed Farmers in Zanzibar** Yachts dock in Port Lympia, Nice, where the 3rd United Nations Ocean Conference is underway. Credit: Kizito Makoye/IPS NICE, France, Jun 10 2025 (IPS)- The late afternoon sun sparkles on the waters of the French Riviera as yachts dock at the Port of Nice with mechanical grace. A tram glides past palm-lined boulevards, where joggers, drenched in sweat, huff past leisurely strollers and sunbathers. Just beside the promenade, a crowd gathers around a young girl. With braided hair bouncing in rhythm, she belts out Beyoncé’s Halo with stunning precision. Her bare feet dance on the cobblestones, her voice echoing against the pastel façades. Tourists smile and drop coins into her hat. She grins, curtsies, and begins again. Her melody, effortless yet soulful, is a momentary respite from the conference halls just a few blocks away, where global leaders in gleaming designer suits dart to and from the United Nations Ocean Conference—a stone throw away. Among those representing Africa is Tanzanian Vice-President Philip Mpango, who reaffirmed his government’s commitment to the sustainable conservation of oceans and marine resources, citing national efforts to combat pollution, overfishing, and the common affliction of climate. “We must take action to protect our oceans and marine ecosystems. The challenges are enormous, but there is always hope for when we build resilience against the harsh impacts of climate change that threaten our coastal communities,” Mpango said in a statement aired back home on national television, TBC. But as policymakers speak of high-level goals, thousands of kilometers away on the sun-scorched coast of Zanzibar, 43-year-old Amina Ali squats barefoot in the muddy shallows of the Indian Ocean. Her weathered hands move through the water with practiced familiarity, adjusting the polyethylene ropes that hold her seaweed crops. “I used to earn enough to send my children to school and buy food,” she tells IPS by WhatsApp call, her voice tinged with quiet desperation. “Now, the weather is so unpredictable, and the sea is eating our farms. Some days, I come home empty-handed.” Amina is among the thousands of women in the Zanzibar archipelago who depend on seaweed farming for survival. Once hailed as a booming green economy venture, seaweed production is now threatened by rising sea temperatures, shifting tides, and erosion—climate change-fueled adversities that have turned once-thriving beaches into battlegrounds. Back in Nice, as the world gathers to chart a course for ocean health, Dr. Immaculate Semesi, Director General of Tanzania’s National Environmental Management Council (NEMC), underscores the stakes. “Our oceans are our economic lifeline for thousands of our people; we must protect them at any cost,” she tells IPS on the sidelines of the conference. Tanzania’s ocean territory spans more than 64,000 square kilometers, rich in biodiversity and crucial for food, transport, and employment. Yet, this “blue economy,” as experts call it, remains heavily underutilized and at risk due to Illegal, Unreported, and Unregulated (IUU) fishing, marine pollution, and poor regulation. IUU fishing, often conducted by foreign-flagged vessels, has long plagued Tanzanian waters. Fishermen employ destructive techniques—blast fishing and banned nets—that decimate marine habitats and undermine lawful fishing operations. “We’ve made huge progress—blast fishing has been reduced by 80 percent through community vigilance and stricter law enforcement,” says Dr. Flower Msuya, a marine biologist at the University of Dar es Salaam, in an interview with IPS in Nice. “But we still face serious challenges. Seaweed farmers are suffering. Corals are bleaching. Fisheries are dwindling. Climate change is accelerating it all.” In recent years, Tanzania has stepped up efforts to curb environmental degradation. It has banned single-use plastic bags, ratified international marine protection conventions, and adopted policies like the National Blue Economy Policy (2024) and the National Action Plan (2024/2025–2025/2026). These frameworks aim to integrate environmental sustainability with economic development across sectors—fisheries, tourism, transport, and renewable energy. Zanzibar, the semi-autonomous archipelago, has become a model in this regard. Under President Hussein Ali Mwinyi, the region has elevated the Blue Economy to a national development priority. Seaweed farming has rebounded, recording over 16,000 tons in 2023, nearly double that of 2020. Fish production reached 80,000 tons last year, thanks to government support including boats, loans, training, and a dedicated Ministry of Blue Economy and Fisheries. Tourism has flourished as well. In 2023, Zanzibar welcomed more than 638,000 international tourists, surpassing pre-pandemic highs. The number of hotels and guesthouses rose to 709, including new eco-friendly lodges that promote marine conservation. “The Zanzibar model shows us that sustainability and economic growth can go hand in hand,” says Dr. Msuya. “But we need more investment, more climate adaptation technologies, and policies that reach grassroots communities—especially women like Amina.” Still, gaps remain. Many seaweed farmers struggle to access modern farming tools, credit, or markets. Amina’s coastal village, once lined with seaweed drying racks, is now dotted with abandoned plots. “We are not asking for charity,” Amina says. “We just want support to adapt. The sea has always fed us and we will always depend on it.” At the United Nations Ocean conference, Mpango acknowledged these vulnerabilities. He stressed the need for global cooperation and regional partnerships to enhance ocean governance and marine security. His call for action resonated with delegates from across the Global South, many of whom face similar crises. Tanzania’s latest marine action plans aim to increase surveillance, foster community engagement, and harness scientific research. These include more patrols to combat IUU fishing, tighter enforcement of fishing licenses, and partnerships with universities to monitor marine ecosystems. Yet, the pace of change is often slower than the rising tides. As the sun dips into the Mediterranean in Nice, casting a golden glow on the port where that young girl sings Beyoncé with raw emotion, her voice seems to echo the silent struggles of women like Amina—unheard yet vital. The ocean, vast and mysterious, connects them. From the gilded shores of France to the salt-sprayed coasts of Tanzania, the fate of the sea is tied to every song sung, every rope tied, and every promise made. And as leaders pack up their speeches and fly home, the real work begins—not in marble halls, but in muddy waters where the ocean meets life. IPS UN Bureau Report **Related Tags** Climate Change Justice Climate Justice France IPS UN Bureau IPS UN Bureau Report Nice UN Ocean Conference 2025 UNOC3 **Editors' choice** **‘A Wake-Up Call from the Womb’—Indigenous People Rally for a Binding Plastics Treaty** **Vanuatu Anticipates New Era With Climate Change Reparations** **Chumbe Island: How Tanzania is Leading the Charge to Save Our Oceans** **Pictures for this story** This story includes downloadable print-quality images -- Copyright IPS, to be used exclusively with this story. Yachts dock in Port Lympia, Nice, where the 3rd United Nations Ocean Conference is underway. Credit: Kizito Makoye/IPS **Most popular** **Noor Mukadam Got Justice, But Why Does Pakistan’s Legal System Fail Its Women?** **Why the UN Staff Union Does Not Agree with the High Commissioner’s Expensive & Poorly-Managed Project** **Hundreds of Cholera Cases Are Declared Per Day in Sudan** **Girls in Kenya Are Repurposing the Invasive Mathenge Tree Into Furniture** **Kazakhstan’s Path From Tragedy to Tolerance: Interfaith Dialogue, Peace, and Disarmament** **The Week with IPS** Africa Asia-Pacific Europe Latin America & the Caribbean Middle East & North Africa North America Global Newsletter RSS Subscribe Reprint / Republish Contact Us Our Partners Donate About Us Our Team Follow IPS Twitter Facebook IPS is an international communication institution with a global news agency at its core,raising the voices of the Southand civil society on issues of development, globalisation, human rights and the environmentCopyright © 2025 IPS-Inter Press Service. All rights reserved.-Terms & Conditions"}