{"id": 461, "name": "WXMI - Grand Rapids News", "domain": "fox17online.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.fox17online.com/news/local-news/michigan/chinese-citizen-arrested-at-dtw-after-allegedly-smuggling-biological-materials-related-to-roundworms-u-m-lab", "title": "Chinese Citizen Arrested At Dtw After Allegedly Smuggling Biological Materials Related To Roundworms U M Lab", "content": "Menu NewsLocal NewsMorning NewsA Path ForwardPay It ForwardMichiganAmerica VotesNational NewsIn-DepthBirthday Shoutouts Local News Morning News A Path Forward Pay It Forward Michigan America Votes National News In-Depth Birthday Shoutouts Local News Morning News A Path Forward Pay It Forward Michigan America Votes National News In-Depth Birthday Shoutouts WeatherToday's ForecastDaily ForecastClosings and DelaysMaps and RadarInteractive RadarAlertsWeather Kids Today's Forecast Daily Forecast Closings and Delays Maps and Radar Interactive Radar Alerts Weather Kids Today's Forecast Daily Forecast Closings and Delays Maps and Radar Interactive Radar Alerts Weather Kids Traffic SportsFOX 17 BlitzIn-MotionHigh SchoolHigh School ScoresNCAAProfessional FOX 17 Blitz In-Motion High School High School Scores NCAA Professional FOX 17 Blitz In-Motion High School High School Scores NCAA Professional Keep Michigan SAFE Morning MixMorning BuzzTrusted AdvisorYour Home MattersClass ActTaste of TownMI VacayThe Golden YearsMorning Mix Brightest and BestWeekly WellnessBeer City Bites Morning Buzz Trusted Advisor Your Home Matters Class Act Taste of Town MI Vacay The Golden Years Morning Mix Brightest and Best Weekly Wellness Beer City Bites Morning Buzz Trusted Advisor Your Home Matters Class Act Taste of Town MI Vacay The Golden Years Morning Mix Brightest and Best Weekly Wellness Beer City Bites Excellence in Education Contests Know the Law Community Events Fox 17 TV Schedule About UsFOX 17 StaffAppsAdvertise With UsJobsClosed Captioning Info FOX 17 Staff Apps Advertise With Us Jobs Closed Captioning Info FOX 17 Staff Apps Advertise With Us Jobs Closed Captioning Info Sign In Newsletters Sign Out Manage Emails Apps Careers Search Local News Grand Rapids Kent Ottawa Muskegon Lakeshore South MI Michigan **Actions** Facebook Tweet Email **Chinese citizen arrested after allegedly smuggling biological materials related to roundworms** A Chinese citizen has been arrested and charged after federal investigators say she smuggled biological materials into the U.S. for her work at a University of Michigan laboratory, and lied about it to investigators. Watch video reports from Darren Cunningham and Ryan Marshall: Chengxuan Han is listed in the criminal complaint. Per that complaint, Han sent four packages to the United States from Wuhan that contained biological material. The packages were addressed to individuals connected to a lab at U-M. RELATED STORY |After call with Xi, Trump says US will resume trade talks with China Han was arrested at Detroit Metro Airport on Sunday, with investigators saying she arrived on a J1 visa. She is being held in law enforcement custody. A detention hearing is scheduled for Wednesday. The feds say that Han made false statements to Customs and Border Protection Officers before ultimately admitting to the FBI that she sent the packages, which contained biological material related to roundworms. The Department of Justice found that the content on Han's phone had been deleted three days before arriving in the U.S. It should be noted that a criminal complaint is not evidence of guilt. Han awaits a trial as investigators determine whether or not to seek a federal indictment. The FBI, CBP, and ICE HSI are investigating the case. “The alleged smuggling of biological materials by this alien from a science and technology university in Wuhan, China—to be used at a University of Michigan laboratory—is part of an alarming pattern that threatens our security. The American taxpayer should not be underwriting a PRC-based smuggling operation at one of our crucial public institutions,\" said United States Attorney Jerome Gorgon Jr. in a statement. This is the second time this monththat a Chinese national connected to biological pathogens and a U-M laboratory has been arrested by the FBI. According to the U.S. Attorney’s Office, 34-year-old Zunyong Liu and 33-year-old Yunqing Jian smuggled in a fungus called Fusarium graminearum whose toxins can cause vomiting, liver damage, and reproductive defects in humans and livestock. It is unclear at this time whether these two cases are connected, and whether or not they are linked to the same U-M lab. This article was written byKellen Voss for the Scripps News Group in Detroit. **Sign up for theBreaking News Newsletterand receive up to date information.** **now signed up to receive theBreaking NewsNewsletter.** News Weather Traffic Sports Problem Solvers Contests About Us Advertise With Us Jobs Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Terms of Use EEO FCC Public FIle FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact fox17online fox17online fox17"}