{"id": 1642, "name": "Yankee Institute for Public Policy", "domain": "yankeeinstitute.org", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://yankeeinstitute.org/2024/09/05/yankee-institute-calls-on-gov-lamont-and-general-assembly-to-address-electric-bill-hikes-in-special-session/", "title": "Yankee Institute Calls On Gov Lamont And General Assembly To Address Electric Bill Hikes In Special Session", "content": "IssuesTaxes & RegulationsLaborEconomyEducationEnergyPensionsLocal ControlState UnionsCampus First Taxes & Regulations Labor Economy Education Energy Pensions Local Control State Unions Campus First Taxes & Regulations Labor Economy Education Energy Pensions Local Control State Unions Campus First ResearchPolicy ResearchPublic Resources Policy Research Public Resources Policy Research Public Resources NewsPress ResourcesPress ReleasesIn the NewsPublic Testimony Press Resources Press Releases In the News Public Testimony Press Resources Press Releases In the News Public Testimony Hartford Portfolio AboutYankee Institute StaffYankee Institute Board Yankee Institute Staff Yankee Institute Board Yankee Institute Staff Yankee Institute Board Events Careers **Stay Up to Date!** **Connecticut’s Legislative Session: Busting the Cap, Losing Local Control, But It Could Have Been Even Worse** **Why Connecticut Has One of the Highest Electric Rates in the United States** **Yankee Institute and CT169Strong Urge Lawmakers: Vote Down “Big and Bad” Housing Omnibus Bill** **Yankee Institute Calls on Gov. Lamont and General Assembly to Address Electric Bill Hikes in Special Session** This summer, Connecticut residents saw seismic increases in their electric bills. Now, the governor and state legislators are considering a special session to address these increases. Yankee Institute President Carol Platt Liebau calls on the General Assembly and Governor Ned Lamont to hold a special session. “Connecticut’s people are routinely burdened with some of the highest energy costs in the nation, and the recent surge in ‘public benefit’ charges has rightly enraged ratepayers across the state,” Liebau said. “Immediate action is needed to reduce our energy costs and make our state more affordable.” “Millions of unspent ARPA funds are still available to address the energy costs that have hit Connecticut’s hardworking families the hardest. Rather than spending those taxpayer funds on pet projects and ‘green’ initiatives, policymakers should use them to correct previous policy mistakes.” “Furthermore, our regulators and legislators should eliminate subsidies for EV charging stations. These subsidies have largely gone to the wealthy, while the broader population struggles to keep lights on and groceries on the table. Redirecting this support could provide much-needed relief to hardworking residents and small businesses.” State lawmakers and Governor Lamont should side with ratepayers and call a special session. For years, policymakers have passed legislation favoring certain types of energy over others for electricity generation, which increases energy prices. Ratepayers can no longer afford to support every petenergy project that legislators envision. To call a special session, the governor or two-thirds of the House and Senate must consent. During the session, legislators should: Consider using some of the federal ARPA (American Rescue Plan Act) funds to bring down the rate increases. Connecticut could have as much as $700 million in ARPA funding still available Include hydro and nuclear power in Connecticut’s Renewable Portfolio Standard, allowing electricity providers to choose the lowest-cost sources of electricity generation available, rather than a mandatory minimum of expensive solar and wind power Require that Public Benefits Charges on electric bills be approved by the General Assembly. Connecticut’s Public Utilities Regulatory Authority (PURA) recently authorized another $80 million to support Electric Vehicle (EV) charging rebates without needing the General Assembly’s approval Restrict Power Purchase Agreements to rates at or below 150% of the wholesale price for electricity About Yankee Institute Yankee Institute is a research and citizen organization founded in 1984 under section 501(c)(3) of the Internal Revenue Service Code. YI is committed to empowering Connecticut’s people to forge a brighter future for themselves and their families. ### **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website **SIGN UP TO RECEIVE OUR NEWSLETTER** **Yankee Institute** Yankee InstitutePO Box 290935Wethersfield, CT 06129[email protected] **FOLLOW US!** **Issues** Taxes Labor Education Pensions Local Control **Research** Policy Research State Unions Public Resources **News** Press Resources Press Releases In the News **About** About Yankee Institute Our Staff Our Board Support Our Mission **Events** **Podcast** **Donate** **Take Action** © 2024 Yankee Institute for Public Policy. All Rights Reserved.Privacy Policy Welcome! The Connecticut State Legislature will begin its 2023 session on January 4thand will adjourn on June 7th. The “long session,” as non-election years are called in Hartford, will be centered around the biennial budget. The Office of the State Comptroller reports that state government found a way to spend $47.11 billion in 2022 and, if trends continue, we can expect that number to grow even more going forward. Concerns over energy prices, inflation, and general cost of living continue to dominate the headlines and the threat of a recession hovers over economic forecasts. What will our elected officials be working on to improve policy outcomes for Connecticut residents? What tax reform proposals will there be? What can be done to lower home heating bills? How will state and local budgets be affected by fewer federal resources? How will schools be implementing to curriculum requirements? While we wait to see the thousands of individual and committee bills that while dominate the myriad policy debates this year, Yankee Institute is hard at work promoting free-market solutions to the problems we face from Stamford to Putnam and Mystic to Salisbury. To that end, we have produced a new edition of our Charter for Change. The Charter provides commonsense reforms to make Connecticut’s government work for its residents. Though the list of reforms may beexhaustingto review, it is far fromexhaustive! And that’s why we want to work with you to build a broad-based coalition to encourage sound policy reforms to enable Connecticut residents to forge a better future for themselves and their families. It’s also imperative that we do so. As we noted in a report andCT Mirrorop-ed last year, the debate over whether we’re in a national recession really misses the point for Connecticut residents. We had more people employed in the private sector in 2007 than we do today. Our economy has grown at one of the slowest rates in the nation for the past decade, and we are getting outpaced year after year. We’re not attracting innovation and industry. We’re losing some of our best and brightest as they seek other parts of the country where it’s easier to make a living. But together, wecanreverse this trend. At Yankee Institute, we know Connecticut is a state with boundless opportunity, and we intend to help make our state more than a place where people are just able to make ends meet! Connecticut should be a place where everyone can thrive – and with your help, it will be. Sincerely, **Bryce Chinault** **SIGN UP TO RECEIVE OUR NEWSLETTER**"}