{"id": 773, "name": "KPAX - Missoula News", "domain": "kpax.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kpax.com/indiancountry/lake-county-rescinds-petition-to-withdraw-from-law-that-divides-law-enforcement-responsibilities-with-cskt", "title": "Lake County Rescinds Petition To Withdraw From Law That Divides Law Enforcement Responsibilities With Cskt", "content": "Menu NewsMissoula CountyFlathead CountyRavalli CountyWestern Montana NewsCrime and CourtsMontana PoliticsMontana NewsIndian CountryMontana Ag NetworkNational News Missoula County Flathead County Ravalli County Western Montana News Crime and Courts Montana Politics Montana News Indian Country Montana Ag Network National News Missoula County Flathead County Ravalli County Western Montana News Crime and Courts Montana Politics Montana News Indian Country Montana Ag Network National News WeatherInteractive RadarDaily ForecastHourly ForecastWeather CamsGet Out Get Fit Forecast Interactive Radar Daily Forecast Hourly Forecast Weather Cams Get Out Get Fit Forecast Interactive Radar Daily Forecast Hourly Forecast Weather Cams Get Out Get Fit Forecast Sports CommunityCommunity SpotlightSalute to ServiceUnsung HeroesPositively MontanaOne Class at a TimeThe Big Sky BlendContests Community Spotlight Salute to Service Unsung Heroes Positively Montana One Class at a Time The Big Sky Blend Contests Community Spotlight Salute to Service Unsung Heroes Positively Montana One Class at a Time The Big Sky Blend Contests VideosOn KPAX and KAJPhoto Galleries On KPAX and KAJ Photo Galleries On KPAX and KAJ Photo Galleries About UsClosed CaptioningCareers at KPAXKPAX News TeamKPAX AppsContact Us Closed Captioning Careers at KPAX KPAX News Team KPAX Apps Contact Us Closed Captioning Careers at KPAX KPAX News Team KPAX Apps Contact Us Sign In Newsletters Sign Out Manage Emails Apps Careers Search News Weather Videos MMIP Sports Montana Ag Network Community Missoula Marathon Contests Find MTN **Actions** Facebook Tweet Email **Lake County rescinds petition to withdraw from law that divides law enforcement duties with CSKT** POLSON — Lake County recently rescinded its petition to withdraw from Public Law 280. The federal law divides law enforcement responsibilities between tribal law enforcement and Lake County law enforcement. The rescission paves the way for both tribal law enforcement and Lake County law enforcement to receive state funding. Watch the full story: “All the commissioners and the tribal council are very optimistic with what's happened so far. I'm not ready to celebrate, we get that first check for $250,000, we know it's real — little, little celebration maybe,” said Lake County Commissioner Bill Barron. Public Law 280,a federal law enacted in 1953, transferred certain law enforcement matters on Indian reservations to federal and state governments. “This was a decision made on leadership back when there weren't the resources to keep the peace as well as we liked,” said Confederated Salish and Kootenai Tribes communications director Robert McDonald. Lake County rescinded its petition to withdraw from PL 280 because if they were not participating in the law enforcement agreement, then new state funding for law enforcement would not be available to them. But first, the county and CSKT must come to an agreement — legally known as a Memorandum of Understanding (MOU) — to receive the funding. “We want to get it worked out as soon as we can because that has to be in place to get the, the rest of the, the money. We get the 250,000 upfront, but to get the rest of it, we have to have the MOU in place,” said Barron. Tribal law enforcement is responsible for tribal members who commit lower-level offenses; minor drug possession is one example. In the past, many criminal charges were handed over to Lake, Sanders, or Missoula County — depending on where the offense took place. Over the years, Tribal law enforcement began to take a more prominent role, mainly when it came to non-felony offenses. “We started approaching the state about something that was called the retrocession, where they roll back jurisdiction. So in 1993, the state legislature said, Okay, we're gonna roll back jurisdiction for primarily civil non-felony cases to the tribes,” McDonald said. Lake Countypetitioned the state to withdraw entirely from PL 280, stating that the costs of splitting law enforcement jurisdiction was costing the county an unsustainable amount of money, mainly when it came to housing inmates at the jail. But with Tribal law enforcement handling more lower-level crimes, the county has rescinded its decision to withdraw. The county will still handle more serious felony charges. “The county will drop back and deal mainly with like homicides, major felonies like aggravated assaults, big thefts, different things like that,\" Barron said. Lake County and Tribal law enforcement arenow eligible to receive state funding for law enforcement— a total of $6 million over the course of several years. More local news from KPAX New proposed Kalispell affordable housing development seeking $8.5M tax creditDerek Joseph **New proposed Kalispell affordable housing development seeking $8.5M tax credit** Derek Joseph **New proposed Kalispell affordable housing development seeking $8.5M tax credit** Derek Joseph **New proposed Kalispell affordable housing development seeking $8.5M tax credit** Derek Joseph Flathead Electric Cooperative plans short power outage for WhitefishMTN News **Flathead Electric Cooperative plans short power outage for Whitefish** MTN News **Flathead Electric Cooperative plans short power outage for Whitefish** MTN News **Flathead Electric Cooperative plans short power outage for Whitefish** MTN News Avelo Airlines restarts seasonal service to LA from KalispellMTN News **Avelo Airlines restarts seasonal service to LA from Kalispell** MTN News **Avelo Airlines restarts seasonal service to LA from Kalispell** MTN News **Avelo Airlines restarts seasonal service to LA from Kalispell** MTN News Amid recruiting challenge, City Attorney’s Office looks to fill vacanciesMartin Kidston - Missoula Current **Amid recruiting challenge, City Attorney’s Office looks to fill vacancies** Martin Kidston - Missoula Current **Amid recruiting challenge, City Attorney’s Office looks to fill vacancies** Martin Kidston - Missoula Current **Amid recruiting challenge, City Attorney’s Office looks to fill vacancies** Martin Kidston - Missoula Current Man arrested following sexual assault incident at Splash MontanaMTN News **Man arrested following sexual assault incident at Splash Montana** MTN News **Man arrested following sexual assault incident at Splash Montana** MTN News **Man arrested following sexual assault incident at Splash Montana** MTN News Wildfire burning outside of Seeley LakeMTN News **Wildfire burning outside of Seeley Lake** MTN News **Wildfire burning outside of Seeley Lake** MTN News **Wildfire burning outside of Seeley Lake** MTN News Bitterroot National Forest fire danger rising to 'high'MTN News **Bitterroot National Forest fire danger rising to 'high'** MTN News **Bitterroot National Forest fire danger rising to 'high'** MTN News **Bitterroot National Forest fire danger rising to 'high'** MTN News Hot Springs man dies in Sanders County crashMTN News **Hot Springs man dies in Sanders County crash** MTN News **Hot Springs man dies in Sanders County crash** MTN News **Hot Springs man dies in Sanders County crash** MTN News **Sign up for theMorning News Headlines Newsletterand receive up to date information.** **now signed up to receive theMorning News HeadlinesNewsletter.** **Coverage of your favorite teams from Montana's Sports Leader** **Coverage of your favorite teams from Montana's Sports Leader** News Weather Sports Community Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public Files FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact kpaxtv kpaxtv kpaxnews"}