{"id": 697, "name": "Iron Mountain Daily News", "domain": "ironmountaindailynews.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ironmountaindailynews.com/news/2025/06/los-angeles-leaders-impose-curfew-as-protests-against-trumps-immigration-crackdown-continue/", "title": "Los Angeles Leaders Impose Curfew As Protests Against Trumps Immigration Crackdown Continue", "content": "NewsLocal NewsBusinessMichigan NewsNational NewsInternational NewsObituaries Local News Business Michigan News National News International News Obituaries Local News Business Michigan News National News International News Obituaries SportsLocal SportsOutdoorsMichigan SportsNational Sports Local Sports Outdoors Michigan Sports National Sports Local Sports Outdoors Michigan Sports National Sports OpinionColumnsEditorialsLetters to the Editor Columns Editorials Letters to the Editor Columns Editorials Letters to the Editor Lifestyles Special Sections Classified-Ads Jobs Garage Sales Contact UsContact UsSubscribeSubmit NewsAdvertiseStatement of ValuesTerms of Service Contact Us Subscribe Submit News Advertise Statement of Values Terms of Service Contact Us Subscribe Submit News Advertise Statement of Values Terms of Service Public NoticesBrowse NoticesPlace Notices Browse Notices Place Notices Browse Notices Place Notices News Sports Opinion Lifestyles Obituaries Jobs Classifieds Garage Sales Place Notices SUBSCRIBE SUBSCRIBE June 11, 2025 | Today's Paper | Submit News | Subscribe Today Today's Paper | Subscribe Today **Los Angeles leaders impose curfew as protests against Trump’s immigration crackdown continue** **** Jun 11, 2025 U.S. National Guard stand protect buildings Tuesday, June 10, 2025, in Los Angeles. (AP Photo Damian Dovarganes) LOS ANGELES (AP) — Los Angeles leaders imposed a downtown curfew Tuesday on the fifth day of protests against President Donald Trump’s immigration crackdown as his use of the National Guard escalated and the governor accused him of drawing a “military dragnet” across the nation’s second-largest city. Democratic Gov. Gavin Newsom asked a court to put an emergency stop to the military helping federal immigration agents, with some guardsmen now standing in protection around agents as they carried out arrests. He said it would only heighten tensions and promote civil unrest. The judge chose not to rule immediately, giving the administration several days to continue those activities before a hearing Thursday. The change moves troops closer to engaging in law enforcement actions like deportations as Trump has promised as part of his administration’s immigration crackdown. The Guard has the authority to temporarily detain people who attack officers but any arrests ultimately would be made by law enforcement. Trump has activated more than 4,000 National Guard members and 700 Marines over the objections of city and state leaders, though the Marines have not yet been spotted in Los Angeles and Guard troops have had limited engagement with protesters. They were originally deployed to protect federal buildings. As the curfew went into effect, a police helicopter flew over downtown federal buildings that have been the center of protests and ordered people to leave the area. Riot police on horses and foot surrounded a group of a few hundred that had gathered in the area, shouting: “Move!” Most of the protesters scattered, with some regrouping and refusing orders to disperse. Officials said the curfew was necessary to stop vandalism and theft by agitators looking to cause trouble. Demonstrations have spread to other cities nationwide, including Dallas and Austin, Texas, Chicago and New York, where a thousand people rallied and multiple arrests were made. In Texas, where police in Austin used chemical irritants to disperse several hundred demonstrators Monday, Republican Gov. Greg Abbott’s office said Texas National Guard troops were “on standby” in areas where demonstrations are planned, Abbott spokesperson Andrew Mahaleris said Tuesday evening. Guard members were deployed to San Antonio, according to assistant police chief Jesse Salame. He said he did not know how many were sent or details on the deployment. LA mayor puts curfew in place Los Angeles Mayor Karen Bass declared a local emergency and said the curfew will run from 8 p.m. Tuesday until 6 a.m. Wednesday. “We reached a tipping point” after 23 businesses were looted, Bass said during a news conference. The curfew covers a 1 square mile section of downtown that includes the area where protests have occurred since Friday. The city of Los Angeles encompasses roughly 500 square miles. The curfew doesn’t apply to residents who live in the designated area, people who are homeless, credentialed media or public safety and emergency officials, according to Los Angeles Police Chief Jim McDonnell. McDonnell said “unlawful and dangerous behavior” had been escalating since Saturday. “The curfew is a necessary measure to protect lives and safeguard property following several consecutive days of growing unrest throughout the city,” McDonnell said. Trump says he’s open to using Insurrection Act Trump left open the possibility of invoking the Insurrection Act, which authorizes the president to deploy military forces inside the U.S. to suppress rebellion or domestic violence or to enforce the law in certain situations. It’s one of the most extreme emergency powers available to a U.S. president. “If there’s an insurrection, I would certainly invoke it. We’ll see,” he said from the Oval Office. Later the president called protesters “animals” and “a foreign enemy” in a speech at Fort Bragg ostensibly to recognize the 250th anniversary of the U.S. Army. Trump has described Los Angeles in dire terms that Bass and Newsom say are nowhere close to the truth. In a public address Tuesday evening, Newsom called Trump’s actions the start of an “assault” on democracy. “California may be first, but it clearly will not end here. Other states are next,” he said. Newsom warned people against inciting violence, but urged them to stand up to the president’s actions. “What Donald Trump wants most is your fealty, your silence. To be complicit in this moment,” he said. “Do not give it to him.” The protests began Friday after federal immigration raids arrested dozens of workers in Los Angeles. Protesters blocked a major freeway and set cars on fire over the weekend, and police responded with tear gas, rubber bullets and flash-bang grenades. The demonstrations have been mostly concentrated downtown in the city of 4 million. Thousands of people have peacefully rallied outside City Hall and hundreds more protested outside a federal complex that includes a detention center where some immigrants are being held following workplace raids. Despite the protests, immigration enforcement activity has continued throughout the county, with city leaders and community groups reporting ICE present at libraries, car washes and Home Depots. School graduations in Los Angeles have increased security over fears of ICE action and some have offered parents the option to watch on Zoom. McDonnell said that police had made 197 arrests on Tuesday, including 67 who were taken into custody for unlawfully occupying part of the 101 freeway. Several businesses were broken into Monday, though authorities didn’t say if the looting was tied to the protests. The vast majority of arrests have been for failing to disperse, while a few others were for assault with a deadly weapon, looting, vandalism and attempted murder for tossing a Molotov cocktail. Seven police officers were reportedly injured, and at least two were taken to a hospital and released. Defense Secretary Pete Hegseth suggested Tuesday that the use of troops inside the U.S. will continue to expand. The Pentagon said deploying the National Guard and Marines costs $134 million. ___ Baldor and Copp reported from Washington. Associated Press writers Dorany Pineda and Christopher Weber in Los Angeles, Amy Taxin in Orange County, California, John Seewer in Toledo, Ohio, Jim Vertuno in Austin, Texas, Hallie Golden in Seattle, and Greg Bull in Seal Beach, California, contributed to this report. **Newsletter** **National News** **National News** **DC prepares for Trump’s military parade with fencing, magnetometers** **DC prepares for Trump’s military parade with fencing, magnetometers** **Los Angeles leaders impose curfew as protests against Trump’s immigration crackdown continue** **Los Angeles leaders impose curfew as protests against Trump’s immigration crackdown continue** **Wisconsin man falsely accused of threats can be released on bond** **Wisconsin man falsely accused of threats can be released on bond** **RFK Jr. ousts entire CDC vaccine advisory committee** **RFK Jr. ousts entire CDC vaccine advisory committee** **US officials: Trump deploys 2K more National Guard troops to LA** **US officials: Trump deploys 2K more National Guard troops to LA** **Some report extra scrutiny at airports as travel ban begins** **Some report extra scrutiny at airports as travel ban begins** MOST READ **Packers receiver Melton works out at cornerback at minicamp** **Packers receiver Melton works out at cornerback at minicamp** **Back to the Present** **Back to the Present** **Iron Mountain VA offers free wellness service for veterans** **Iron Mountain VA offers free wellness service for veterans** **Wisconsin man falsely accused of threats can be released on bond** **Wisconsin man falsely accused of threats can be released on bond** **ABC News’ Moran out two days after suspension over Miller post** **ABC News’ Moran out two days after suspension over Miller post** **Los Angeles leaders impose curfew as protests against Trump's immigration crackdown continue** **Los Angeles leaders impose curfew as protests against Trump's immigration crackdown continue** **Newsletter** **Starting at $3.50/week.** **Subscribe Today** **Subscribe Today** NewsLocal NewsBusinessMichigan NewsObituaries Local News Business Michigan News Obituaries Local News Business Michigan News Obituaries SportsLocal SportsMichigan SportsNational SportsOutdoors Local Sports Michigan Sports National Sports Outdoors Local Sports Michigan Sports National Sports Outdoors OpinionColumnsEditorialsLetters to the Editor Columns Editorials Letters to the Editor Columns Editorials Letters to the Editor Contact InformationContact UsAdvertiseContact Us Contact Us Advertise Contact Us Contact Us Advertise Contact Us Submit News Copyright © 2025 Ogden News Publishing of Michigan, Inc. | https://www.ironmountaindailynews.com | 215 E. Ludington, Iron Mountain, MI 49801 |"}