{"id": 2209, "name": "Genesius Times", "domain": "genesiustimes.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://genesiustimes.com/protesters-firebomb-the-country-they-live-in-and-hate-so-they-arent-deported-and-have-to-go-back-to-the-country-they-love/", "title": "Protesters Firebomb The Country They Live In And Hate So They Arent Deported And Have To Go Back To The Country They Love", "content": "Genesius Times The Most Reliable Source of Fake News on the Planet Genesius Times Home NewsbeatExclusive Politics Business ScienceHealthTech Health Tech Health Tech CultureReligionEntertainmentSportsLifestyle & Beauty Religion Entertainment Sports Lifestyle & Beauty Religion Entertainment Sports Lifestyle & Beauty World SubscribeWhere to Find Us Where to Find Us Where to Find Us SupportBecome a PatronShop Become a Patron Shop Become a Patron Shop Home Newsbeat Protesters firebomb the country they live in and hate so they aren’t deported and have to go back to the country they love Newsbeat Politics **Protesters firebomb the country they live in and hate so they aren’t deported and have to go back to the country they love** LOS ANGELES—In a dazzling display of logic-defying activism, anti-ICE protesters turned the streets of Los Angeles into a blazing paradox yesterday, firebombing the very country they’re desperate to call home—apparently to avoid the heartbreak of returning to the homelands they adore. Armed with Molotov cocktails and a questionable grasp of strategy, the demonstrators torched government buildings while chanting, “Don’t deport us back to paradise!” The protest, dubbed “Operation Burn to Belong,” saw participants hurl flaming bottles at ICE facilities, with one protester, who asked to be called “Patriotic Pyromaniac,” explaining the genius plan: “If we destroy America, they can’t send us back to Mexico, where the food is amazing and the family misses us. It’s self-preservation!” Another added, “Plus, the Wi-Fi here is 5G—back home it’s still carrier pigeons!” Eyewitnesses described a surreal scene as protesters, clad in black and waving “Stay Here, Burn There” banners, lobbed “Love they Neighbor” Molotovs with surprising precision. “I’ve never seen someone light their future on fire with such enthusiasm,” said bystander Jane Smith, ducking behind a mailbox. “It’s like they’re renovating a house by setting it ablaze.” Local authorities reported significant damage, with LAPD Chief Rodriguez noting, “We’re used to protests, but this is the first time someone’s tried to stay in a country by turning it into a bonfire. I’m calling it ‘reverse tourism.’” Firefighters, meanwhile, were seen handing out loyalty cards: “Punch 10 blazes, get a free extinguisher!” The movement’s leaders claim the firebombing is a cry for love, not hate, with one organizer stating, “We’re just showing America how much we want to stay by giving it a warm makeover.” Rumors swirl that the Molotovs were sourced from a bulk discount site, complete with a “Welcome to Chaos” instruction manual. As smoke cleared and sirens wailed, the protesters vowed to escalate, promising more fiery displays until the U.S. agrees to let them remain—presumably to continue their unique redecoration project. Canada, watching from the sidelines, reportedly doubled its border patrol and added a “No Matches” policy. **About Author** Exavier is an excellent writer—tremendous. He’s really very, very talented. And his hair is really great too. He should have a couple Pulitzers under his belt by now if there was any justice. If he brightened your day at all please consider tippinga coffee or a leg of mutton through this link! See author's posts **Congratulations!** **You made it through the woke censors to see this post. Sign up below to get more funny directly to your inbox!** We don’t spam! Read ourprivacy policyfor more info. Thanks for signing up! Check your inbox or spam folder to confirm your subscription. **Post Navigation** **More Stories** Politics **BREAKING: Kyle Rittenhouse searchlight is seen above Los Angeles amid riots** Politics **Anti-ICE protesters hand out “Love Thy Neighbor (Or Else)” Molotov cocktails** Business Culture Newsbeat **Walmart opens new ‘Loot!’ section in all of its California stores** Listen to thealbum that's out of this world! **Hot 5 Today** **Trending** **You may have missed** Politics **BREAKING: Kyle Rittenhouse searchlight is seen above Los Angeles amid riots** Newsbeat Politics **Protesters firebomb the country they live in and hate so they aren’t deported and have to go back to the country they love** Politics **Anti-ICE protesters hand out “Love Thy Neighbor (Or Else)” Molotov cocktails** Business Culture Newsbeat **Walmart opens new ‘Loot!’ section in all of its California stores** Politics World **BREAKING: Hundreds protest US in support of the countries they don’t want to go back to** **Genesius Times** We strive to provide the most up-to-date, accurate fake news on the Internet. Our team of journalists, hacks, and starving writers only want one thing: to make you laugh and/or cry. Have asubmission to contribute, click here? We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking toAmazon.comand affiliated sites. This website may feature images that are subject to copyright protection. We believe in and adhere to the principles of fair use as defined in copyright law. This includes the use of copyrighted images for purposes such as commentary, criticism, news reporting, teaching, scholarship, and research. We aim to provide attribution wherever possible and ensure that the use of such images is within the limits set by fair use. **Recent Posts** BREAKING: Kyle Rittenhouse searchlight is seen above Los Angeles amid riots Protesters firebomb the country they live in and hate so they aren’t deported and have to go back to the country they love Anti-ICE protesters hand out “Love Thy Neighbor (Or Else)” Molotov cocktails Walmart opens new ‘Loot!’ section in all of its California stores BREAKING: Hundreds protest US in support of the countries they don’t want to go back to **Categories** Seriously. Shareable. Satire. Business Health Science Newsbeat"}