{"id": 2137, "name": "The College Fix", "domain": "thecollegefix.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.thecollegefix.com/bulletin-board/college-students-use-no-contact-orders-to-avoid-people-they-dont-like-wall-street-journal/", "title": "College Students Use No Contact Orders To Avoid People They Dont Like Wall Street Journal", "content": "**The College Fix** NewsAbortion/Pro-lifeActivismAnalysisAnti-SemitismBiasClimate ChangeCommon CoreCurriculumFeminismFree SpeechGreek LifeHealthcareHigher Ed BubbleHigher EducationK-12 EducationLegalLGBTQOpinionPolitical CorrectnessPoliticsRacial issuesReligionSecond AmendmentSex EdSexual AssaultSportsTechnologyWhite Privilege Abortion/Pro-life Activism Analysis Anti-Semitism Bias Climate Change Common Core Curriculum Feminism Free Speech Greek Life Healthcare Higher Ed Bubble Higher Education K-12 Education Legal LGBTQ Opinion Political Correctness Politics Racial issues Religion Second Amendment Sex Ed Sexual Assault Sports Technology White Privilege Abortion/Pro-life Activism Analysis Anti-Semitism Bias Climate Change Common Core Curriculum Feminism Free Speech Greek Life Healthcare Higher Ed Bubble Higher Education K-12 Education Legal LGBTQ Opinion Political Correctness Politics Racial issues Religion Second Amendment Sex Ed Sexual Assault Sports Technology White Privilege Student Reporters Write For Us About The Fix Merchandise Contact “No contact orders,” once reserved for sexual assault accusations, are now being used by some college students to avoid people they do not like, according to theWall Street Journal. “[S]tudent conduct administrators had plenty of stories to share,” about their widespread use. “NCOs requested by one student after her roommate allegedly stole her bagels, by participants in a group project gone awry, by members of rival student organizations caught up in a dispute and by aggrieved parties in a social-media skirmish,” theWSJreported. “Schools hand them out like candy,” University of San Diego sociologist David Karp told the newspaper. “We generally know that students are increasingly fragile and conflict-averse, which leads to an increased desire to request a no contact order,” Karp said, placing the blame on “aggressive helicopter parents,” according to the newspaper’s paraphrase. The newspaper has other stories: Young people today have a hard enough time interacting face-to-face with their peers, let alone handling conflict, according to one administrator at a large Midwestern public university. Students today, he explained, tend to view other people as either hurtful or helpful with very little gray area in between. Negotiating differences and handling conflict, he said, often leads to real anxiety on their part. This mindset is facilitated by online behaviors that enable kids, from an early age, to shut out people they dislike or disapprove of. Columbia University Professor Ioana Literat said college students are reflecting what they see on social media. “Students are increasingly fluent in digital tools for managing boundaries like blocking, muting, curating their spaces, and no contact orders are sometimes seen as an offline extension of that: a way to formalize emotional or interpersonal boundaries through institutional means,” Literat said. Pro-Palestinian students also reportedly used the orders to keep away pro-Israel and Jewish students, according to the Anti-Defamation League. Other issues are also at play. “Most administrators date the increased use of no contact orders to the past eight to 10 years, the same period in which political polarization, numerous social justice movements, the Covid pandemic and the Israel/Gaza war turned up the heat on many campuses,” the newspaper reported. Read the full article MORE:Economist says higher ed operates like cartel IMAGE CAPTION AND CREDIT: A college student walks alone; George Pak/Pexels LikeThe College Fixon Facebook/Follow us on Twitter U. Louisville ‘LGBTQ+ Students of Color’ scholarship draws federal civil rights complaint Professor sends email encouraging campus to join LA protests against ICE At least 3 Louisiana universities force future teachers to take DEI classes: report University of Nebraska Lincoln should never have granted a doctorate to this student Δ NewsAbortion/Pro-lifeActivismAnalysisAnti-SemitismBiasClimate ChangeCommon CoreCurriculumFeminismFree SpeechGreek LifeHealthcareHigher Ed BubbleHigher EducationK-12 EducationLegalLGBTQOpinionPolitical CorrectnessPoliticsRacial issuesReligionSecond AmendmentSex EdSexual AssaultSportsTechnologyWhite Privilege Abortion/Pro-life Activism Analysis Anti-Semitism Bias Climate Change Common Core Curriculum Feminism Free Speech Greek Life Healthcare Higher Ed Bubble Higher Education K-12 Education Legal LGBTQ Opinion Political Correctness Politics Racial issues Religion Second Amendment Sex Ed Sexual Assault Sports Technology White Privilege Abortion/Pro-life Activism Analysis Anti-Semitism Bias Climate Change Common Core Curriculum Feminism Free Speech Greek Life Healthcare Higher Ed Bubble Higher Education K-12 Education Legal LGBTQ Opinion Political Correctness Politics Racial issues Religion Second Amendment Sex Ed Sexual Assault Sports Technology White Privilege Student Reporters Write For Us About The Fix Merchandise Contact No thanks, I’m not interested!"}