{"id": 185, "name": "The Council of Canadians", "domain": "canadians.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://canadians.org/media/joining-golden-dome-would-be-a-monumental-betrayal-say-anti-war-groups/", "title": "Joining Golden Dome Would Be A Monumental Betrayal Say Anti War Groups", "content": "Help keep the vital public advocacy and community organizing of the Council going strong.Renew your support for 2025. About Us Take Action News and Analysis Help keep the vital public advocacy and community organizing of the Council going strong.Renew your membership for 2025. About Us Take Action News and Analysis **Joining Golden Dome Would Be a “Monumental Betrayal,” Say Anti-War Groups** byCouncil of Canadians June 11, 2025June 11, 2025 Media Council of Canadians, World Beyond War Call on Carney to Reject “Dangerous, Costly” Scheme OTTAWA –The Council of Canadians, World Beyond War and allies are calling on Prime Minister Mark Carney to reject any Canadian participation in U.S. President Donald Trump’s recently announced “Golden Dome” project. Canada could join the missile interceptor programme as part of the trade and security pact the Carney government is currently negotiating with the US Talks between the two countries are moving rapidly, with some media reports suggesting a deal could be announced in the coming days. Nikolas Barry-Shaw, trade and privatization campaigner,Council of Canadians:“We shouldn’t even be considering signing up for the Golden Dome. We’ve seen this movie before, and we know how it ends. This latest ‘Star Wars’ reboot will cost Canadians tens if not hundreds of billions of dollars, inflame international tensions and lead to the militarization of space. It will make American arms manufacturers richer, but it will not make Canadians any safer.” “Corporate Canada may think joining Trump’s Golden Dome is a good idea, but most Canadians do not. Polls show ordinary Canadians remain overwhelmingly opposed to putting anti-missile weapon systems in space, with good reason. If Mark Carney signs us up for Trump’s Golden Dome, it would be a monumental betrayal of the trust Canadians have placed in him.” Rachel Small, Canada lead,World Beyond War:“It is unthinkable that Canada would partner on a new hundreds of billions of dollars project with the US at the same moment that President Donald Trump is deploying economic aggression and annexationist threats against Canada. Let alone a project that will antagonize military powers around the world while sparking a race to militarize space.” “Spending hundreds of billions of dollars on outrageous and aggressive weapons systems like the Golden Dome is a slap in the face to everyone in Canada struggling to get by or to imagine a life for their children in a country that sets new wildfire records nearly every year.” “If ever there were a time to reassess the genuine threats to the security of people across Canada and separate them from the self-interested goals of Donald Trump or the American weapons industry, this is it.” **Quotes from allies** “Participating in Trump’s Golden Dome is a betrayal of Mark Carney’s promise to distance Canada from the US,” explainedCanadian Foreign Policy InstitutefellowTamara Lorincz. “Canada must oppose weaponizing space and escalating the arms race.” “During the election campaign, the Liberals promised to distance Canada from the US military”, saysKaren RodmanfromJust Peace Advocates. “Joining the Golden Dome would betray that promise. Canada shouldn’t participate in Trump’s Golden Dome.” **BACKGROUND** Canadians oppose paying Trump to join the Golden Dome by a margin of nearly 4-to-1 (63% against, versus 17% for Canadians participation), according toa Nanos poll, conducted June 1-3. Last week, the Toronto Sunreportedthat the Carney government’s discussions over a trade and security pact with the U.S. “have recently intensified with the hope of announcing a deal within the next week to 10 days.” “What we can expect is an announcement that Canada will increase its defence spending, including potential participation in the Golden Dome missile defence system.” The U.S. has spent more than $350 billion on anti-missile systems over the past 60 years, with few tangible results to show for it. Experts and scientists havecriticized the Golden Dome initiativeas “a fantasy,” “a mirage,” and “science fiction.” – 30 – MEDIA CONTACTS:Nikolas Barry-Shaw(Council of Canadians),nbarryshaw@canadians.org, 514-825-2263Rachel Small(World Beyond War Canada),rachel@worldbeyondwar.org, 647-769-2472 **aBOUT uS** Since 1985, theCouncil of Canadianshas organized across the country to challenge corporate power and advocate for people, the planet, and democracy. Along with other anti-war groups, it played a leading role in the opposition to George W. Bush’s failed Ballistic Missile Defence (BMD) initiative in the early 2000s. The Council does not accept money from corporations or governments. World Beyond Waris a global network of volunteers, chapters, and affiliated organizations advocating for the abolition of the institution of war. **Share with your community:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Bluesky (Opens in new window)Bluesky More Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Reddit (Opens in new window)Reddit Click to share on Threads (Opens in new window)Threads Click to share on Mastodon (Opens in new window)Mastodon Bluesky Instagram Facebook X YouTube About Us Our Story Our GovernanceOur BoardOur AMMsChairpersonBy-lawsFinancesPolicies Our Board Our AMMs Chairperson By-laws Finances Policies Our Board Our AMMs Chairperson By-laws Finances Policies Work With Us Sign Up for Updates Contact Us Take Action Our CampaignsUnite for the Canada We WantNo Waterto WasteSafe Water for First Nations(Water Drop)Organize for a Just TransitionPharmacare Now!Blue Community Schools Unite for the Canada We Want No Waterto Waste Safe Water for First Nations(Water Drop) Organize for a Just Transition Pharmacare Now! Blue Community Schools Unite for the Canada We Want No Waterto Waste Safe Water for First Nations(Water Drop) Organize for a Just Transition Pharmacare Now! Blue Community Schools Our ActionsRecent Actions Recent Actions Recent Actions In Your CommunityChaptersBlue Communities Chapters Blue Communities Chapters Blue Communities Webinars & Events News and Analysis Analysis Media Resources Canadian Perspectives Donate Donate Now Donate Monthly Increase Your Monthly Donation Make changes to Your Monthly Gift Become a Member Renew Your Membership Legacy Giving Other Ways to Give The Council of Canadians200-240 Bank Street, Ottawa, ON K2P 1X4, Tel.: 613-233-2773, 1-800-387-7177, Fax: 613-233-6776,inquiries@canadians.org Bluesky Instagram Facebook X YouTube About Us Our Story Our GovernanceOur BoardOur AMMsChairpersonBy-lawsFinancesPolicies Our Board Our AMMs Chairperson By-laws Finances Policies Our Board Our AMMs Chairperson By-laws Finances Policies Work With Us Sign Up for Updates Contact Us Take Action Our CampaignsUnite for the Canada We WantNo Waterto WasteSafe Water for First Nations(Water Drop)Organize for a Just TransitionPharmacare Now!Blue Community Schools Unite for the Canada We Want No Waterto Waste Safe Water for First Nations(Water Drop) Organize for a Just Transition Pharmacare Now! Blue Community Schools Unite for the Canada We Want No Waterto Waste Safe Water for First Nations(Water Drop) Organize for a Just Transition Pharmacare Now! Blue Community Schools Our ActionsRecent Actions Recent Actions Recent Actions In Your CommunityChaptersBlue Communities Chapters Blue Communities Chapters Blue Communities Webinars & Events News and Analysis Analysis Media Resources Canadian Perspectives Donate Donate Now Donate Monthly Increase Your Monthly Donation Make changes to Your Monthly Gift Become a Member Renew Your Membership Legacy Giving Other Ways to Give The Council of Canadians200-240 Bank Street, Ottawa, ON K2P 1X4, Tel.: 613-233-2773, 1-800-387-7177, Fax: 613-233-6776,inquiries@canadians.org English"}