{"id": 282, "name": "Hartford Courant", "domain": "courant.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.courant.com/2025/06/11/a-unique-take-on-lobster-rolls-on-the-menu-for-summer-supper-series-at-boutique-and-thats-just-an-appetizer-lobster-rolls-made-with-warm-south/", "title": "A Unique Take On Lobster Rolls On The Menu For Summer Supper Series At Boutique And Thats Just An Appetizer Lobster Rolls Made With Warm South", "content": "Daily e-Edition Daily e-Edition Evening e-Edition Evening e-Edition Daily e-Edition Evening e-Edition NewsNewsBreaking NewsCoronavirusHealthNational NewsPoliticsElectionsCapitol WatchEn Espanol News Breaking News Coronavirus Health National News Politics Elections Capitol Watch En Espanol News Breaking News Coronavirus Health National News Politics Elections Capitol Watch En Espanol SportsSportsHigh School SportsCollege SportsConnecticut SunUConn MenUConn WomenUConn FootballUConn Huskies Sports High School Sports College Sports Connecticut Sun UConn Men UConn Women UConn Football UConn Huskies Sports High School Sports College Sports Connecticut Sun UConn Men UConn Women UConn Football UConn Huskies BusinessBusinessReal EstateTop WorkplacesConsumer Reviews Business Real Estate Top Workplaces Consumer Reviews Business Real Estate Top Workplaces Consumer Reviews Opinion Local NewsLocal NewsHartfordGlastonburyWest HartfordManchesterFarmingtonNew BritainSimsburyWethersfieldEast Hartford Local News Hartford Glastonbury West Hartford Manchester Farmington New Britain Simsbury Wethersfield East Hartford Local News Hartford Glastonbury West Hartford Manchester Farmington New Britain Simsbury Wethersfield East Hartford Things to DoThings to DoArtsHoroscopesCTNowFood & DrinkEvents Calendar Things to Do Arts Horoscopes CTNow Food & Drink Events Calendar Things to Do Arts Horoscopes CTNow Food & Drink Events Calendar JobsJobsFind a JobPlace an Ad Jobs Find a Job Place an Ad Jobs Find a Job Place an Ad ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary Branded ContentPaid Partner ContentAdvertising by AscendPaid Content by Brandpoint Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Classifieds AdvertisingAdvertisingValumail Advertising Valumail Advertising Valumail Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Subscribe Log In Sign up for email newsletters Subscribe Log In Daily e-Edition Daily e-Edition Evening e-Edition Evening e-Edition News Latest Headlines Election Health National News Politics En Espanol Trending: It’s ice cream season in Connecticut: Here are 5 shops that make their own **Breaking News** **Brian Wilson, Beach Boys visionary leader and summer’s poet laureate, dies at 82** **Unique take on lobster rolls on menu for supper series at CT historic inn. That’s just an appetizer** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Alobster rollmade with warm, South Indian spices, and swordfish with mango and swiss chard are among the masterpieces New York based Chef Rasika Venkatesawill create at a Connecticut inn. It’s for the first inLitchfield Inn’ssummer supper series. Thesummer supper seriesat the 32-room boutique hotel is designed as a quaint experience that brings in top chefs from the northeast. The hotel is owned bySyed Bokhari, with his wife, Pari Shah. Venkatesa, a formerTop Chefcompetitor and winner of many challenges on the Bravo show, said she loves sharing her south Indian roots and the foods her grandmother, Mythily Ramachandran, taught her to make. “My grandmother was my biggest inspiration. She would share the love for her family through her food,” Venkatesa said. But she also thanks her parents. “My parents have also inspired me. If it wasn’t for them I wouldn’t be doing what I love,” she said, crediting them with providing the best education and encouraging her to choose the career path she loved. “What I love about it first and foremost is I get to share my story,” including the “rich” history of India, the people of India, it’s food, she said. The food she grew up with in South India doesn’t taste like typical Indian food in America, as the spices are warmer, she said. After working in Michelin-starred restaurants starring other types of international cuisine such as French and Moroccan, she said she loves combining flavors from various areas of the world that complement one another. Based in Brooklyn, she owns pop upMythily— named to honor her grandma — and plans to open a brick and mortar in New York City by the same name. Venkatesa said her fondest memories are growing up in Chennai, India cooking with her grandmother who still gives her recipes at 84 years old. The summer series runs onsite in Litchfield June through August. Chef Venkatesa will be featured June 20, 21. The series consists of several multi-course dinners and wine pairings for $130 per person. Aside from Venkatesa, this year’s chefs include: Chef Keith Sarasin ofAatma Pop-Up Events, Aatma Curry House, andThe Farmers Dinner,July 18 and 19. Also, Chef Alistair McMurray, former sous chef atEleven Madison Park, Aug. 16. Syed Bokhari, who worked in the financial industry, and Pari, a practicing optometrist, bought the inn from his parents, who had owned it for 10 years. The inn was remodeled by new owners who have said they consider the inn a “labor of love.” As part of their plans reach out to the community with special events. Syed’s parents maintained the inn with management companies, but the younger couple is taking a more personal approach, and are intimately involved with the day-to-day operations of the 32-room boutique hotel. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky **RevContent Feed** **Most Popular** This CT restaurant offers more than doggie bags to take home. It’s their gift to customers.This CT restaurant offers more than doggie bags to take home. It's their gift to customers. **This CT restaurant offers more than doggie bags to take home. It’s their gift to customers.** **This CT restaurant offers more than doggie bags to take home. It’s their gift to customers.** Report: Four car wash workers in Southington allegedly taken into custody by ICE agentsReport: Four car wash workers in Southington allegedly taken into custody by ICE agents **Report: Four car wash workers in Southington allegedly taken into custody by ICE agents** **Report: Four car wash workers in Southington allegedly taken into custody by ICE agents** The proposal is for a high-tech trash plant. For many CT residents that’s a hard ‘no’The proposal is for a high-tech trash plant. For many CT residents that's a hard 'no' **The proposal is for a high-tech trash plant. For many CT residents that’s a hard ‘no’** **The proposal is for a high-tech trash plant. For many CT residents that’s a hard ‘no’** A CT university is opening a campus on the other side of the world. Here’s why and where.A CT university is opening a campus on the other side of the world. Here's why and where. **A CT university is opening a campus on the other side of the world. Here’s why and where.** **A CT university is opening a campus on the other side of the world. Here’s why and where.** Bear conflicts with humans are rising in CT. One product is a popular choice for keeping them away.Bear conflicts with humans are rising in CT. One product is a popular choice for keeping them away. **Bear conflicts with humans are rising in CT. One product is a popular choice for keeping them away.** **Bear conflicts with humans are rising in CT. One product is a popular choice for keeping them away.** Upgrades planned on Interstate 84 in CT city. Project would include ramps, road surface, more.Upgrades planned on Interstate 84 in CT city. Project would include ramps, road surface, more. **Upgrades planned on Interstate 84 in CT city. Project would include ramps, road surface, more.** **Upgrades planned on Interstate 84 in CT city. Project would include ramps, road surface, more.** CT teen wins national inventor award. His patent pending invention was inspired by helping his uncleCT teen wins national inventor award. His patent pending invention was inspired by helping his uncle **CT teen wins national inventor award. His patent pending invention was inspired by helping his uncle** **CT teen wins national inventor award. His patent pending invention was inspired by helping his uncle** Mailman hospitalized after being attacked by dog outside CT homeMailman hospitalized after being attacked by dog outside CT home **Mailman hospitalized after being attacked by dog outside CT home** **Mailman hospitalized after being attacked by dog outside CT home** Unique take on lobster rolls on menu for supper series at CT historic inn. That’s just an appetizerUnique take on lobster rolls on menu for supper series at CT historic inn. That's just an appetizer **Unique take on lobster rolls on menu for supper series at CT historic inn. That’s just an appetizer** **Unique take on lobster rolls on menu for supper series at CT historic inn. That’s just an appetizer** This former prep star, SEC quarterback returning to CT to play for his dadThis former prep star, SEC quarterback returning to CT to play for his dad **This former prep star, SEC quarterback returning to CT to play for his dad** **This former prep star, SEC quarterback returning to CT to play for his dad** **More in Connecticut News** Woman detained by ICE in CT city, two young children allegedly left terrified in car **Woman detained by ICE in CT city, two young children allegedly left terrified in car** **Woman detained by ICE in CT city, two young children allegedly left terrified in car** New Mexico man gets 40 years in prison in fatal Hartford shooting that went cold for nearly a decade **New Mexico man gets 40 years in prison in fatal Hartford shooting that went cold for nearly a decade** **New Mexico man gets 40 years in prison in fatal Hartford shooting that went cold for nearly a decade** Four people arrested after search in Bristol allegedly turns up narcotics, a gun magazine and cash **Four people arrested after search in Bristol allegedly turns up narcotics, a gun magazine and cash** **Four people arrested after search in Bristol allegedly turns up narcotics, a gun magazine and cash** CT high school’s joy in graduation dimmed by classmate taken by ICE. Town hopes to get him back. **CT high school’s joy in graduation dimmed by classmate taken by ICE. Town hopes to get him back.** **CT high school’s joy in graduation dimmed by classmate taken by ICE. Town hopes to get him back.** 2025 June 11 Tribune PublishingChicago TribuneNew York Daily NewsSun Sentinel of Fla.Daily Press of Va.Orlando SentinelThe Morning Call of Pa.The Virginian-PilotStudio 1847 Chicago Tribune New York Daily News Sun Sentinel of Fla. Daily Press of Va. Orlando Sentinel The Morning Call of Pa. The Virginian-Pilot Studio 1847 Chicago Tribune New York Daily News Sun Sentinel of Fla. Daily Press of Va. Orlando Sentinel The Morning Call of Pa. The Virginian-Pilot Studio 1847 COMPANY INFOArchiveContact UsAbout UsClassifiedsCareersPrivacy PolicyCookie PolicyTerms of ServiceSitemap Archive Contact Us About Us Classifieds Careers Privacy Policy Cookie Policy Terms of Service Sitemap Archive Contact Us About Us Classifieds Careers Privacy Policy Cookie Policy Terms of Service Sitemap Subscriber ServicesManage SubscriptionEZ PayVacation StopDelivery IssueSubscriber Terms Manage Subscription EZ Pay Vacation Stop Delivery Issue Subscriber Terms Manage Subscription EZ Pay Vacation Stop Delivery Issue Subscriber Terms AdvertisingPlace an AdLocal print ads Place an Ad Local print ads Place an Ad Local print ads Subscribe Now Subscriber Terms and Conditions Cookie Policy Cookie Preferences California Notice at Collection CA Notice of Financial Incentive Do Not Sell/Share My Personal Information Copyright © 2025 Hartford Courant"}