{"id": 152, "name": "Bogalusa Daily news", "domain": "bogalusadailynews.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://bogalusadailynews.com/2025/06/08/trump-administration-appoints-craig-mccain-to-serve-as-state-executive-director-for-usdas-farm-service-agency-in-louisiana/", "title": "Trump Administration Appoints Craig Mccain To Serve As State Executive Director For Usdas Farm Service Agency In Louisiana", "content": "Home E-Edition News Sports Obituaries Opinion Classifieds Public Notices Contests Special Section Home News Sports Obituaries Opinion Contests Classifieds Public Notices Special Section E-Edition **Trump Administration Appoints Craig McCain to Serve as State Executive Director for USDA’s Farm Service Agency in Louisiana** Published 2:00 pm Sunday, June 8, 2025 Bykimgerald WASHINGTON, May 28, 2025— The Trump Administration recently appointed Craig McCain as the new State Executive Director (SED) for the USDA Farm Service Agency (FSA) in Louisiana. McCain joined the Louisiana FSA team on May 5, 2025. “When America’s farming communities prosper, the entire nation thrives. This new group of USDA appointees will ensure President Trump’s America First agenda is a reality in rural areas across the country. I am grateful for the leadership of these new state directors and look forward to their work reorienting the agency to put Farmers First again,” said Agriculture Secretary Brooke Rollins. “FSA State Executive Directors serve in a critical role carrying out USDA’s mission at the state level — ensuring that our focus is on meeting the needs of local agricultural producers by putting farmers and ranchers first,” said FSA Administrator Bill Beam. “Rural communities need our support now more than ever. Our newly appointed state leaders bring a wealth of knowledge and expertise to their position as SED and they will play an integral role in shaping the future of agriculture in their state.” McCain returns to FSA where he previously served as the state executive director for Louisiana during President Trump’s first term. He started his career with FSA as a county operations trainee in 1986. After successfully completing the training program, he served for nearly 25 years as county executive director followed by three years as a district director. McCain grew up working on his family’s farm in Franklin Parish where they grew cotton and raised cattle. As SED, McCain is responsible for overseeing the delivery of FSA programs to agricultural producers in Louisiana. These commodity, conservation, credit, and disaster assistance programs ensure a safe, affordable, abundant and nutritious food, fiber, and fuel supply for all Americans. See USDA news release for full list of recent FSA and Rural Development appointees. FSA helps America’s farmers, ranchers and forest landowners invest in, improve, protect and expand their agricultural operations through the delivery of agricultural programs for all Americans. FSA implements agricultural policy, administers credit and loan programs, and manages conservation, commodity, disaster recovery and marketing programs through a national network of state and county offices and locally elected county committees. For more information, visit fsa.usda.gov. **You Might Like** **Segment Two of LA 3241 Project Now Open, Marking Major Milestone in I-12 to Bush Corridor** **Segment Two of LA 3241 Project Now Open, Marking Major Milestone in I-12 to Bush Corridor** **New Royalty Crowned for the 2025 WP Watermelon Festival Pageant** **New Royalty Crowned for the 2025 WP Watermelon Festival Pageant** **Bogalusa Police Arrest Angie Man for Numerous Drug Offenses** **Bogalusa Police Arrest Angie Man for Numerous Drug Offenses** **Man Sentenced to 135 Years in Prison for Trafficking Washington Parish Youth** **Man Sentenced to 135 Years in Prison for Trafficking Washington Parish Youth** Home News Obituaries Sports Lifestyle Opinion Health Classifieds Small Business E-Edition Public Notices About Us"}