{"id": 892, "name": "Middle East Institute", "domain": "mei.edu", "bias": "center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://mei.edu/publications/managing-threats-food-security-water-and-agricultural-resilience-north-africa", "title": "Managing Threats Food Security Water And Agricultural Resilience North Africa", "content": "Policy AnalysisRegional AffairsAfghanistan & PakistanArabian PeninsulaBlack SeaEgypt and Horn of AfricaIranIsraeli AffairsLebanonNorth Africa and the SahelPalestine & Palestinian-Israeli AffairsSyriaTurkeyGlobal AffairsClimate and WaterConflict Resolution & Track II DialoguesCountering Terrorism & ExtremismDefense & SecurityEconomics and EnergyStrategic Foresight InitiativeStrategic Technologies and Cyber Security **Regional Affairs** Afghanistan & Pakistan Arabian Peninsula Black Sea Egypt and Horn of Africa Iran Israeli Affairs Lebanon North Africa and the Sahel Palestine & Palestinian-Israeli Affairs Syria Turkey **Global Affairs** Climate and Water Conflict Resolution & Track II Dialogues Countering Terrorism & Extremism Defense & Security Economics and Energy Strategic Foresight Initiative Strategic Technologies and Cyber Security **Regional Affairs** Afghanistan & Pakistan Arabian Peninsula Black Sea Egypt and Horn of Africa Iran Israeli Affairs Lebanon North Africa and the Sahel Palestine & Palestinian-Israeli Affairs Syria Turkey **Global Affairs** Climate and Water Conflict Resolution & Track II Dialogues Countering Terrorism & Extremism Defense & Security Economics and Energy Strategic Foresight Initiative Strategic Technologies and Cyber Security Events EducationClassesClassesVideo ExplainersJournalJournalMiddle East JournalSubscriber LoginSubmissionsLibraryLibraryOman Library at the Middle East InstituteDigital CollectionCatalog **Classes** **Classes** Video Explainers **Journal** **Journal** Middle East Journal Subscriber Login Submissions **Library** **Library** Oman Library at the Middle East Institute Digital Collection Catalog **Classes** **Classes** Video Explainers **Journal** **Journal** Middle East Journal Subscriber Login Submissions **Library** **Library** Oman Library at the Middle East Institute Digital Collection Catalog Experts Arts & Culture Get InvolvedGet InvolvedGet InvolvedBecome a MemberCorporate SponsorshipDelegation TripsAnnual Awards GalaJobs & FellowshipsInternshipsDonatePolicies **Get Involved** **Get Involved** Become a Member Corporate Sponsorship Delegation Trips Annual Awards Gala Jobs & Fellowships Internships Donate Policies **Get Involved** **Get Involved** Become a Member Corporate Sponsorship Delegation Trips Annual Awards Gala Jobs & Fellowships Internships Donate Policies **Utility Navigation** عربي Blog Podcasts Subscribe About **Utility Navigation** عربي Blog Podcasts Subscribe About Policy AnalysisRegionalAfghanistan & PakistanArabian PeninsulaBlack SeaEgypt and Horn of AfricaIranIsraeli AffairsLebanonNorth Africa and the SahelPalestine & Palestinian-Israeli AffairsSyriaTurkeyThematicClimate and WaterConflict Resolution & Track II DialoguesCountering Terrorism & ExtremismDefense & SecurityEconomics and EnergyStrategic Foresight InitiativeStrategic Technologies and Cyber SecurityFeaturedEventviewTrump's Pivot to the Middle EastEventviewCan a Deal Avert Disaster? Prospects for US-Iranian Nuclear Talks **Regional** Afghanistan & Pakistan Arabian Peninsula Black Sea Egypt and Horn of Africa Iran Israeli Affairs Lebanon North Africa and the Sahel Palestine & Palestinian-Israeli Affairs Syria Turkey **Thematic** Climate and Water Conflict Resolution & Track II Dialogues Countering Terrorism & Extremism Defense & Security Economics and Energy Strategic Foresight Initiative Strategic Technologies and Cyber Security **Featured** **Trump's Pivot to the Middle East** **Can a Deal Avert Disaster? Prospects for US-Iranian Nuclear Talks** **Regional** Afghanistan & Pakistan Arabian Peninsula Black Sea Egypt and Horn of Africa Iran Israeli Affairs Lebanon North Africa and the Sahel Palestine & Palestinian-Israeli Affairs Syria Turkey **Thematic** Climate and Water Conflict Resolution & Track II Dialogues Countering Terrorism & Extremism Defense & Security Economics and Energy Strategic Foresight Initiative Strategic Technologies and Cyber Security **Featured** **Trump's Pivot to the Middle East** **Can a Deal Avert Disaster? Prospects for US-Iranian Nuclear Talks** Events EducationClassesClassesVideo ExplainersJournalJournalMiddle East JournalSubscriber LoginSubmissionsLibraryLibraryOman Library at the Middle East InstituteDigital CollectionCatalogFeaturedSummer/Autumn 2024 **Classes** **Classes** Video Explainers **Journal** **Journal** Middle East Journal Subscriber Login Submissions **Library** **Library** Oman Library at the Middle East Institute Digital Collection Catalog **Featured** **Summer/Autumn 2024** **Classes** **Classes** Video Explainers **Journal** **Journal** Middle East Journal Subscriber Login Submissions **Library** **Library** Oman Library at the Middle East Institute Digital Collection Catalog **Featured** **Summer/Autumn 2024** Experts Arts & CultureMEI ART GALLERY1763 N St. NWWashington, DC 20036Open Weekdays 10am - 5pm(Closed federal holidays)Book a visitOPENING SOONMaximal Miniatures: Contemporary Art from IranArts & Culture CenterMEI Art GalleryCurrent ExhibitionSchedule a VisitAbout the Arts & Culture CenterDonate **MEI ART GALLERY** Book a visit **OPENING SOON** **Arts & Culture Center** MEI Art Gallery Current Exhibition Schedule a Visit About the Arts & Culture Center Donate **MEI ART GALLERY** Book a visit **OPENING SOON** **Arts & Culture Center** MEI Art Gallery Current Exhibition Schedule a Visit About the Arts & Culture Center Donate Get InvolvedFeaturedFull PageviewAnnual Gala DinnerFull PageviewInternshipsGet InvolvedGet InvolvedBecome a MemberCorporate SponsorshipDelegation TripsAnnual Awards GalaJobs & FellowshipsInternshipsDonatePolicies **Featured** **Annual Gala Dinner** **Internships** **Get Involved** **Get Involved** Become a Member Corporate Sponsorship Delegation Trips Annual Awards Gala Jobs & Fellowships Internships Donate Policies **Featured** **Annual Gala Dinner** **Internships** **Get Involved** **Get Involved** Become a Member Corporate Sponsorship Delegation Trips Annual Awards Gala Jobs & Fellowships Internships Donate Policies Search Home Managing Threats to Food Security: Water and Agricultural Resilience in North Africa **Managing Threats to Food Security: Water and Agricultural Resilience in North Africa** Study Mohammed Mahmoud **Summary** Sustaining food security in North Africa is a complex and evolving challenge, influenced by the region’s arid climate, limited water resources, and sparse arable land. In response, efforts to enhance food security by governments, farmers, and non-governmental organizations have been centered on adopting climate-resilient agricultural practices, efficient irrigation techniques, and sustainable land-management strategies. Despite these efforts, food security in North Africa remains fragile due to systemic pressures on agricultural systems from climate change, water scarcity, and increasing market demands. By prioritizing improved water resource management, adopting efficient irrigation technologies, and diversifying agricultural practices, North Africa can not only bolster the resilience of its agricultural systems but also improve overall food security. Read the report as a PDF This study is part of an MEI research initiative examining the complex interplay between food security, governance, political stability, and economic development in North Africa and the Sahel. The project brings together a diverse range of perspectives with grounded views of local realities and their global implications through a series of articles, policy papers, and a final report. **Contents** Introduction The Importance of Agriculture in North Africa The Role of Water in Sustaining North Africa's Agriculture Irrigation Practices in North Africa The Implications of Climate Change The Ripple Effects of Armed Conflicts Resource Scarcity and Competing Needs Current Challenges and Future Opportunities Conclusion About the Author Endnotes Additional Photos **Introduction** Sustaining food security in North Africa,1is a complex and evolving challenge, influenced by the region’s arid climate, limited water resources, and sparse arable land. In response, efforts to enhance food security by governments, farmers, and non-governmental organizations have been centered on adopting climate-resilient agricultural practices, efficient irrigation techniques, and sustainable land-management strategies. Despite these efforts, food security in North Africa remains fragile due to systemic pressures on agricultural systems from climate change, water scarcity, and increasing market demands. The role of water in sustaining agriculture in North Africa is particularly crucial, since it is a primary resource for crop cultivation and livestock farming. However, the region’s water supplies are limited and under increasing stress due to competing demands from urbanization. Climate change exacerbates these pressures by altering precipitation patterns and increasing the frequency of droughts, which further intensifies water scarcity. Additionally, ongoing armed conflicts in the region have disrupted food production in certain areas, forcing farmers to abandon their land or scale back agricultural activities. These socio-political issues, coupled with resource scarcity, create a vicious cycle of food insecurity and social instability. The mounting competition for water and arable land further intensifies these challenges, making it difficult to balance the region’s growing needs. Environmental and ecological concerns, such as desertification and the spread of invasive species, only complicate the situation, threatening both immediate and long-term agricultural productivity. Addressing these interconnected food security challenges requires a comprehensive, multi-faceted approach that not only improves water management and climate adaptation but also promotes stability and sustainable development in the region. **The Importance of Agriculture in North Africa** Agriculture is a foundational pillar of North Africa’s culture and economy, helping to shape its socioeconomic growth. The resilience of the agricultural sector is deeply tied to the sustainability of the region’s diverse arable lands, which range from fertile river basins to semi-arid terrains. Contributions from the agricultural sector represent a considerable portion of the gross domestic product (GDP) of North African countries, adding value in terms of domestic food production. Moreover, agriculture as an industry provides significant employment in the region, especially in rural areas, where it can be a key source of community livelihoods. One metric that helps to illustrate the importance of domestic agriculture in supporting local food consumption is the food self-sufficiency ratio, which quantifies the percent of food consumption that is met through domestic food production. Besides a couple of exceptions (namely Egypt and Libya), most of the countries in North Africa have a relatively high level of food self-sufficiency (greater than 55%), with Morocco even achieving a food self-sufficiency ratio of 100% (see Table 1).2The data indicates that these countries direct most of their domestic food production toward local food consumption. More contemporary food security metrics capture a wider set of factors that dictate whether citizens of a particular country have reliable physical, social, and economic access to adequate and nutritious food that provides the dietary needs to support a healthy life. Unlike the quantitatively precise food self-sufficiency ratio, the more widely used and regularly updated Global Food Security Index (GFSI) incorporates broader qualitative elements of food affordability, availability, quality and safety, and sustainability and adaptation into its formula (scaled between 0 and 100, with higher GFSI scores indicating a greater level of food security). Data on North African countries from the most recent (2022) GFSI global report places Morocco, Algeria, Tunisia, and Egypt inside the range of 56 to 63, alluding to a better-than-average level of food security and still in line with their above-cited 2014 self-sufficiency condition. However, Sudan’s GFSI score is 42.8, a likely indicator that the country’s relative food security and food self-sufficiency has greatly declined over the past decade (no data is available for Libya and Mauritania in the 2022 GFSI report).3 When assessing the level of agricultural activity in North Africa, Sudan leads in this metric with the largest physical area of agricultural lands (exceeding 1 million square miles) and by being among the top North African countries in terms of agricultural lands as a percentage of its total land area (Figure 1).4Egypt, on the other hand, when compared to its North African neighbors, has the smallest area of agricultural land and the lowest percentage of total land area dedicated to agriculture (approximately 4%). This is primarily due to Egypt’s landscape being predominantly desert, covering 92% of its territory, with the remaining available arable land shared between agriculture and urban development, constraining agricultural potential. The agricultural sector is also a notable contributor to the GDP of most North African countries. When averaged over the period of 2014-2021, agriculture represented a quarter of Sudan’s GDP and a fifth of Mauritania’s. Other North African states saw agriculture contribute around 10% toward their respective GDPs. During this period, most North African countries experienced relatively stable and consistent contributions from agriculture to their GDPs. The only outlier was Sudan, which saw a 15% contraction, reflecting economic decline in this sector that had previously been more robust (see Figure 2).5 The agricultural sector represents a major portion of the employed labor force in some North African countries. For example, on average between 2001 and 2022, farm work accounted for nearly half of all employment in Sudan, over a third in Morocco and Mauritania, and approximately a quarter in Egypt.6However, employment in this sector as a percentage of total employment had been slightly declining over the years in each regional country, falling within the range of 5-13% from 2001 to 2022. This small drop could be attributed to improved and automated technologies and farming tools that require less human labor for crop cultivation. **The Role of Water in Sustaining North Africa's Agriculture** Water security is the foundation of food security. Agricultural systems cannot function without sufficient and dependable water resources. On a global scale, the agricultural sector accounts for 70% of global water consumption.7For the countries of North Africa, this statistic is even higher: their average agricultural water withdrawal as a percentage of total water withdrawals for the period of 2012-20 was 83%, with Sudan’s reaching a staggering 96% of all water withdrawals. Morocco’s and Mauritania’s agricultural water withdrawals were nearly as high, at approximately 88% and 91% of total water withdrawals respectively, for the same period (see Table 2).8 North Africa is recognized as one of the most water-stressed regions in the world. Water stress is a metric that identifies how much of local freshwater supplies are used to satisfy local water demand. A higher value of water stress indicates that water shortages are more likely to occur because the gap between water supply and demand is small. Per data from the World Resources Institute,9Egypt, Libya, and Tunisia face extremely high water stress (>80%); Morocco and Algeria experience high water stress (40-80%); and Mauritania is categorized as having medium to high water stress (20-40%). This high level of water stress is driven by the region’s naturally arid climate and its limited sources of freshwater. Consequently, the region relies heavily on deep, non-renewable groundwater aquifers, such as the Nubian Sandstone Aquifer System (shared by Egypt and Libya) and the North-Western Sahara Aquifer System (spanning Algeria, Tunisia, and Libya). A significant example of North Africa’s dependence on groundwater is Libya’s Great Man-Made River Project, one of the largest water supply systems in the world. The project taps into the Nubian Sandstone Aquifer System, transporting groundwater through an extensive network of underground pipelines from the southern part of the country to northern urban and agricultural areas. The Nile River is North Africa’s most significant surface water system. Combined, Egypt and Sudan account for nearly 90% of annual water withdrawals from the Nile.10In terms of food production, the river supplies water to two major agricultural production areas in both countries: the Nile River Delta in Egypt, at the terminus of the river system, and the Gezira Scheme in Sudan, located near the confluence of the Blue and White Nile rivers. In Mauritania, the Senegal River is the country’s principal surface water supply source, supporting agriculture and fishing in its fertile floodplains. Unlike the Nile and Senegal rivers, which flow year round, other rivers in North Africa are seasonal, fed by rainfall, snowmelt, and floodwaters, with intermittent or reduced flow during dry periods. These intermittent rivers, also known as wadis, remain dry for much of the year. Prominent examples include Morocco’s lengthy Wadi Draa, which flows from the Atlas Mountains and supports agriculture in the surrounding desert oases. With regard to nonconventional water supplies, countries in North Africa are increasingly looking to expand their desalination capacities.11Treated wastewater, another nonconventional water supply being modestly incorporated in most of North Africa, albeit at a much smaller scale, remains largely underutilized, as the necessary infrastructure development needed to expand its production can be cost prohibitive relative to the modest amount of additional water it generates. In 2022, irrigated areas in Sudan, Mauritania, Egypt, and Morocco were supplied mainly by surface water sources (96%, 90%, 74%, and 67%, respectively).12This is largely because this particular set of North African countries enjoys access to renewable surface water supplies not available to their neighbors. Egypt and Sudan almost exclusively rely on the water flow of the Nile River; Morocco’s water supply is boosted by snowmelt and runoff from the Atlas Mountains; and Mauritania can divert water from the Senegal River and its tributaries. Conversely, in 2022, Libya, Tunisia, and Algeria supplied a greater percentage of their irrigated areas with water from groundwater sources (100%, 82%, and 62% respectively).13That said, the distribution of groundwater aquifers within these countries is uneven, as in the case of Libya, which built the Great Man-Made River Project specifically to extract and transport groundwater from the southern portions of the country to the north. In terms of nonconventional water supplies for irrigation purposes in North Africa, usage levels are one to two orders of magnitude smaller compared to freshwater from surface water and groundwater. For example, the percent of irrigated areas supplied with treated municipal wastewater in 2021 ranged from 1.91% in Tunisia to as low as 0.09% in Algeria.14Based on available data, desalinated water was not a notable supply source for irrigated areas in North Africa. Although available data is insufficient for a comprehensive analysis, the conclusion is plausible, as the financial and energy costs to desalinate water at volumes adequate for agricultural purposes tend to be prohibitive. In the event desalination were to be considered as a source for agricultural water generation, treatment of brackish groundwater may be less costly and energy intensive due to its lower salinity content in contrast to seawater. **Irrigation Practices in North Africa** Different irrigation system types variously affect the relative volume of water used for agricultural food production. Across North Africa, diverse methods are used, with their utilization mostly dictated by local conditions such as accessibility to water supplies, availability of specific irrigation technologies, and considerations of suitability based on the crops being cultivated. Flood irrigation, for instance, is widely employed along the Nile River floodplain, particularly in Egypt and Sudan15among small-scale farmers who rely on its simplicity and affordability due to limited access to advanced irrigation systems. Flood irrigation plays an important role in enabling Egypt’s food production, since the Nile Delta serves as the agricultural hub of the country. Similarly, this method is primarily deployed to irrigate Sudan’s Gezira region, at the confluence of the Blue Nile and the White Nile.16 A particular form of flood irrigation used in certain parts of North Africa is spate irrigation, which depends on the seasonal flooding of rivers and dry riverbeds (wadis) from rainfall or snowmelt and is, therefore, highly susceptible to changes in rainfall patterns or the timing of floods. In the Anti-Atlas Mountains of Morocco, where other crop watering methods would be too costly or difficult to implement due to the mountainous terrain, spate irrigation is used to harness the seasonal run-off in the region’s wadis.17 Generally, flood irrigation of all kinds represents an extremely inefficient use of water for agricultural purposes, as significant volumes are lost to evaporation and seepage. Furthermore, over-saturation using inherently saline-rich water from flood irrigation can lead to elevated soil salinity. Standing floodwaters (whether from irrigation or extreme rainfall) also pose public health concerns, as these pools may become breeding grounds for disease-spreading vectors like mosquitoes, carrying malaria and dengue — a recurring problem in Sudan.18 Jessour irrigation, a system that involves constructing earthen or stone embankments across wadis to capture and store surface water runoff and seasonal floodwaters, is widely practiced in southern Tunisia, particularly in the arid regions of the Matmata Hills.19The embankments form small basins where water is retained, allowing it to infiltrate the soil and support crop growth. Jessour irrigation conserves water and combats soil erosion, making it a more sustainable agricultural practice in areas with scarce and unpredictable rainfall. Another traditional practice is known as terrace irrigation, which involves creating a series of flat, step-like platforms along hillsides or sloped terrains to slow water runoff and allow it to soak into the soil. This method is commonly used in the Atlas Mountains of Morocco, where steep landscapes and limited water resources pose significant challenges to farming.20Terraces help maximize the use of rainfall and prevent soil erosion by capturing and retaining water on each level, creating fertile zones for cultivating crops. Like the aforementioned jessour system, terraced irrigation is a simple, low-cost, and low-tech traditional farming method, making it highly sustainable for smallholder farmers, even in the presence of more modern agricultural irrigation solutions. The qanat irrigation system, or as it is more commonly referred to in the Maghreb region, foggara or khettara irrigation,21is an ancient method designed to transport water from underground aquifers to the surface, particularly in arid regions. The system consists of a series of vertical wells or shafts that are dug into the ground and connected by a horizontal tunnel or channel that slopes downward, allowing water to flow naturally by way of gravity. Qanat irrigation can still be found in southern Tunisia, southeastern Morrocco, Algerian Sahara, and Libya, where it is deployed to access deep underground aquifers to sustain agriculture in dry and challenging desert landscapes. Center pivot irrigation is a mechanized irrigation system used to efficiently water large flat-terrain agricultural fields. It consists of a rotating sprinkler arm mounted on wheeled towers that pivots around a central point, creating a circular pattern of irrigation. This method allows for uniform water distribution across the field, thus reducing water waste by highly and efficiently minimizing evaporation losses and runoff. Drip irrigation is a targeted method of delivering water directly to the roots of plants through a system of tubes, pipes, and emitters. There are two main types of drip irrigation systems: surface and subsurface. In surface drip irrigation, the emitters are placed on the soil’s surface, releasing water near the plant roots; subsurface drip irrigation involves burying water emitters beneath the soil surface, which significantly reduces water loss from evaporation and prevents runoff. Both types help optimize water use, but the choice between surface and subsurface systems depends on specific environmental conditions and agricultural needs. Besides the method of irrigation used, the type of crops cultivated factors into the rate of water consumption required for agricultural production. Cereals like wheat and corn are essential staples in the region but are relatively water-intensive, with wheat being very sensitive to sufficient watering during flowering and grain development. Rice is grown primarily in Egypt’s Nile Delta,22where paddy fields are flooded and require large amounts of water to maintain proper growing conditions. Among fruit crops, dates are one of the most water intensive, requiring significant irrigation in dry areas like Tunisia, Morocco, and Egypt. These high-water-demand crops necessitate efficient management practices, such as drip and center pivot irrigation, to help conserve and optimize water use. **The Implications of Climate Change** Over the past several years, temperature extremes across North Africa have consistently exceeded historical averages, with numerous countries and cities breaking heat records (e.g., Tunis, the capital of Tunisia, reached a temperature record of 49° Celsius, or 120.2° Fahrenheit, in 202323). As North Africa continues to warm, the rate of evapotranspiration (i.e., the loss of water from soil and plants) may increase sharply for irrigated crops, with modeling studies projecting an increase in potential evapotranspiration by up to 0.37 millimeters by 2050.24Consequently, irrigation demands per crop can grow, creating a compounding challenge of balancing the need to meet regional food production demands with the imperative to conserve already limited freshwater resources. North Africa’s current trajectory of long-term warming could be accompanied by a decline in the annual streamflow of its surface water systems. This would affect the Nile River, the Senegal River, and even snowmelt from the Atlas Mountains. As the reliability of surface water for agricultural irrigation diminishes, there will likely be a heavier dependence on groundwater to fill the gap, placing even greater strain on a resource that has long been overexploited and is now rapidly depleting. The continued rise in global sea surface temperatures due to climate change makes extreme weather events in coastal areas more frequent. As a result, countries in North Africa are facing an increased risk of major flooding events that could damage water infrastructure and disrupt agricultural production. The most recent example of this was when Storm Daniel descended upon Derna, Libya, in September 2023.25When storm waters were coupled with discharged surface water from collapsed dams upstream, the resulting cumulative floodwaters inundated Derna and literally washed large parts of the city out to sea, including urban and agricultural areas. Unlike the managed application of flood irrigation to water cultivated fields, floodwaters of the magnitude stemming from extreme weather events are quite detrimental to agricultural lands. Erosion is a major concern, as floodwaters wash away the nutrient-rich topsoil, reducing soil fertility and making it harder for future crops to grow. Floodwaters can also introduce contaminants from flood debris such as agricultural chemicals and waste, polluting the land and making it difficult for crops to survive. Sudan has frequently borne the brunt of flooding events along the Nile, a consequence of climate change and the river’s seasonal variability. The annual summer monsoon produced record rainfall in 2024, and the subsequent flooding of the Nile wreaked havoc on cereal crops at the peak of their growing season.26The uncontrollably high waters caused the Arbaat Dam, which holds back a critical freshwater reservoir utilized by the coastal city of Port Sudan, to collapse.27 In recent years, North Africa has also witnessed a troubling increase in the frequency and intensity of wildfires, with significant impacts on agricultural lands. In Algeria, yearly summer wildfires, particularly since 2021, have consistently wiped out large areas of farmland, destroying essential crops and severely disrupting food production in some of the country’s most agriculture-dependent regions.28In Morocco, the summer of 2022 proved to be one of the worst periods of wildfires for the country, as extensive agricultural areas burned in its northern regions.29 Another significant impact of climate change in North Africa to consider is sea level rise. In Egypt, for example, the Nile River Delta, one of the most fertile agricultural regions in the country, has become particularly vulnerable to sea water encroachment. Saltwater intrusion has already begun to degrade soil quality, reducing the land’s productivity and posing a major threat to crop cultivation.30Rising sea levels in Tunisia have caused significant coastal erosion and contamination of vital aquifers used for irrigation. Approximately 68% of the coastline is classified as moderately to highly vulnerable; and with sea levels projected to rise 30 to 50 centimeters by the end of the century, more than a quarter of the coastline is at risk of submersion and further erosion.31 **The Ripple Effects of Armed Conflicts** Climactic processes or inefficient water-use methods are not the only sources of concern. Armed conflicts strain access to vital water supplies, damage agricultural infrastructure such as irrigation systems and water conveyance networks, displace farming communities, and jeopardize food production. Scarce water resource systems, already under pressure from climate change in North Africa, thus may fall under greater risk due to negligence and lack of attention to preservation needs. The instability caused by conflict reduces local agricultural yields, increasing reliance on foreign food aid and imports as well as further weakening already fragile economies. Since April 2023, Sudan has been gripped by a devastating civil war between rival military factions that has plunged the country into chaos. With security and political stability shattered and state institutions unable to function, millions of civilians are left without access to essential resources such as food, water, electricity, and healthcare.32The situation has escalated into the world’s largest and fastest-growing displacement crisis, with over 12 million Sudanese displaced internally and more than 4 million having sought refuge in neighboring countries.33 The conflict in Sudan has devastated the country’s agricultural sector, which had employed 60-80% of the population. Moreover, looting has decimated markets and food stores, while disrupted trade routes have cut off access to essential supplies like seeds, fertilizers, and insecticides, leaving farmers unable to maintain agricultural production. In al-Jazira State, Sudan’s agricultural hub and home to the Gezira Scheme irrigation project, conflict reached the state capital, Wad Medani, in December 2023, forcing farmers to abandon their fields and halt crop production. In early 2024, food insecurity had risen by 70% compared to pre-conflict levels, leaving nearly 18 million people acutely food insecure (a level of food deprivation wherein lives and livelihoods are directly threatened).34Sudan is plunging into a deepening famine, marked by escalating starvation and a sharp rise in acute malnutrition. The crisis has become so grim that as of May 2025, there were 30.4 million people, more than half the population, in urgent need of food assistance.35 The consequences of Sudan’s war include food security ramifications that stretch beyond its borders. Before the war, Sudan was the world’s largest exporter of gum arabic, an important ingredient in soft drinks, chewing gum, and medicines, accounting for 70% of global exports. The acacia gum tree, the source of this product, grows naturally across Sudan and has supported the livelihoods of nearly 15% of the country’s population. Despite facing challenges like previous internal conflicts and climate change, Sudan’s gum Arabic production remained resilient, even earning a special exemption from US sanctions due to its necessity in the agri-food and pharmaceutical industries. However, the ongoing civil war has severely disrupted production and export. With fighting raging in parts of the country where the production and processing of the gum takes place, the supply chain has collapsed. Destroyed trucks, murdered transportation drivers, and skyrocketing fuel prices — 20 times higher than pre-conflict rates — have left vast quantities of gum arabic stranded, unable to reach global markets.36 Following the ousting of Moammar Gadhafi in 2011, Libya plunged into years of prolonged instability, marred by civil war and ongoing political fragmentation. This turmoil has contributed to the degradation of the country’s critical water infrastructure assets. The Great Man-Made River Project, a cornerstone of Libya’s water infrastructure development, became both a symbol of vulnerability and a target in the conflict. In 2019, warring factions attacked the water transmission system, cutting off supplies to Tripoli, while sabotage, looting, and obstruction of repairs have become common tactics used by militias to gain leverage over rivals.37These actions have compromised the system’s ability to meet urban and agricultural needs in northern Libya. The project’s centralized and highly sophisticated design amplifies its vulnerability in a conflict-ridden environment. Power outages frequently disable pumps, while access to spare parts and skilled maintenance personnel has been extensively disrupted. Years of conflict and political fragmentation have prevented investment in necessary upgrades. Over time, the system has fallen into disrepair, with compounding critical weaknesses in control centers and pumping stations. The result of this disregard for maintaining the country’s water infrastructure became very evident during the catastrophic flooding of Derna, when extreme rainfall collapsed two dams upstream of the city and exposed Libya’s inability to withstand extreme weather.38 Armed conflicts and wars outside of North Africa can also influence the region’s agricultural productivity and food security, such as the case of the Russian invasion of Ukraine in 2022. The ongoing war has profoundly disrupted food imports to North Africa, a region heavily dependent on global markets for staple crops like wheat. As of 2021, both Russia and Ukraine accounted for nearly 30% of the world’s wheat exports and have traditionally been primary suppliers to North African countries such as Egypt, Tunisia, and Morocco. Egypt, the world’s largest wheat importer, relied on these two producers for up to 85% of its wheat before the conflict. This reliance on imports has left North Africa vulnerable to supply chain disruptions, price volatility, and escalating socio-economic instability. Countries like Algeria, which imports 75% of its food, and Egypt, where wheat is a dietary staple, have faced soaring costs and mounting pressure to secure alternative sources of food imports, with their governments struggling to manage volatile international markets while ensuring sufficient food supplies for their growing populations.39 In addition to food imports, the war has also disrupted the supply of fertilizers to North Africa, with Russia previously being the world’s largest exporter of this essential agricultural commodity. By April 2024, fertilizer prices had doubled since the conflict began,40significantly impacting their affordability for farmers. This is very concerning in North Africa, where poor soil conditions necessitate regular fertilizer use to maintain agricultural productivity. Without adequate fertilizers, crop yields decline, food prices rise, and food insecurity intensifies. **Resource Scarcity and Competing Needs** Threats to food security in North Africa can also be internally driven by competing needs within the water-management and agricultural sectors. Agriculture is widely recognized as the largest source of water demand, yet limited resources in North Africa could put farming at odds with other sectors of water use. For example, even though municipal water use has a much smaller footprint than agriculture, it provides an essential water supply for human consumption needs, in the form of drinking water and sanitation. One of the primary drivers of municipal water demand is use per capita, based on the population size of water service areas. Therefore, as North Africa’s population continues to grow, the consumptive water needs of municipal areas will follow suit. Another sector to consider is industrial water use, which includes water needs for commercial and manufacturing processes as well as for industries like construction and mining. More importantly, in terms of potentially expanded water use, industrial water demand also includes water consumption for the energy sector. Water is an important input for energy generation, primarily used to cool thermoelectric plants and ensure efficient electricity generation. Water demand for energy generation is likely to increase substantially in the near future with the growth of the renewable and alternative energy sectors, specifically as it relates to North Africa’s efforts to expand its capacity to produce green hydrogen. This is because green hydrogen, which is generated through electrolysis by splitting water molecules into hydrogen and oxygen, requires one liter of water for every kilogram of hydrogen produced. The formation of the Africa Green Hydrogen Alliance by Egypt, Morocco, and Mauritania in 2022 has led to ambitious plans to integrate green hydrogen into the energy transition strategies of North African countries, which will likely intensify the demand for water to expand hydrogen-production operations.41 The livestock sector plays a crucial role in global food systems, contributing substantially to food security by providing protein for human consumption, manure for fertilization, and income for farmers. However, it also consumes vast amounts of resources that could otherwise be used for human food production. Livestock requires 2.8-3.2 kilograms of agricultural feed to produce 1 kg of meat, and they consume about one-third of global cereal production while occupying approximately 40% of the world’s arable land. The livestock sector continues to grow as demand for animal products rises because of increasing incomes, population growth, and urbanization. In 2010, livestock consumed an estimated 6 billion tons of feed, an amount that required 2.5 billion hectares of land to produce, which is equivalent to half of the world’s agricultural area, of which 57% subsequently becomes unsuitable for crop production. Despite livestock contributing only 18% of global calories consumed and 25% of global protein consumption, 86% of their feed is composed of non-edible resources like grass, leaves, and crop residues. This inefficiency in converting feed into human-edible products raises concerns about the balance between livestock production and food security.42 The sustainability of agriculture as an industry in North Africa hinges on the viability of this sector as an adequate source of livelihood for its rural farmers. Climate change complicates this by making traditional farming increasingly difficult due to water scarcity and unpredictable precipitation patterns. As agricultural livelihoods become less viable, more farmers are compelled to migrate to urban centers in search of alternative sources of income, leading to a decline in the agricultural workforce.43This shift is driven by factors such as income inequality, limited rural development, and the allure of improved living standards in cities. Consequently, rural communities face challenges in maintaining agricultural production, which can negatively impact food security in the region. Shifting to drip and center pivot irrigation could significantly alleviate North Africa’s agricultural water consumption challenges by boosting water-use efficiency and agricultural productivity. These modern technologies can cut water use by 30-60% and increase crop yields by 20-50%,44making farming more viable and profitable for rural communities. While they cannot fully offset the broader impacts of climate change that affect farming, such as rising temperatures and variable precipitation patterns, the adoption of efficient irrigation methods can help stabilize rural livelihoods, slow migration to cities, and support regional food security. **Current Challenges and Future Opportunities** The main food security-related challenge facing North Africa is water scarcity, a pervasive issue for all of the region’s countries. The consequent imbalance between water supply and water demand for high-use sectors like agriculture often leads to shortages, with countries like Libya and Sudan experiencing extreme water stress. Water availability is not only scarce but also unevenly distributed; many areas, particularly in the desert regions of Algeria and Libya, rely on groundwater extracted from deep, non-renewable aquifers, which is unsustainable in the long term. Since these aquifers are drained at a faster rate than they can naturally replenish, they risk depletion, leading to dangerous levels of water deficit for all sectors of water use. Another significant issue compounding water scarcity is inefficient water management. While irrigation is vital for agriculture, many North African countries still rely on inefficient irrigation methods, such as flood irrigation, which not only waste large amounts of water through evaporation and seepage but also lead to soil salinization. Over-irrigation exacerbates soil fertility loss, leading to long-term land degradation. In areas like Egypt’s Nile Delta and Sudan’s Gezira Scheme, flood irrigation is still widely used, though it is highly inefficient and unsuitable for increasing agricultural productivity under water-limited conditions. Despite the availability of modern irrigation techniques, such as drip irrigation, many agricultural areas still rely on outdated and inefficient irrigation systems due to financial constraints, lack of technological infrastructure, and insufficient education and training for rural farmers. North Africa’s agricultural sector also faces the threat of climate change. The region is warming at a rate faster than the global average, which has severe consequences for agricultural productivity. Increased temperatures, which in turn cause higher rates of evapotranspiration, mean crops will lose more water, and farmers must increase irrigation to compensate. This puts further pressure on the already limited water resources of the region and increases the water intensity of local agricultural production. Additionally, climate change brings erratic precipitation patterns, with some areas facing more frequent and intense droughts, while others experience flash floods. These extreme weather events disrupt planting seasons and damage crops, leading to food shortages. Countries like Sudan, Egypt, and Mauritania are particularly vulnerable, with their agriculture relying heavily on surface water from rivers like the Nile and the Senegal, which are already showing signs of reduced flow. Beyond climate change, desertification and soil degradation remain critical challenges to North Africa’s agriculture. Overgrazing and unsustainable farming practices contribute significantly to the loss of fertile soil. Desertification is not only a result of natural factors, such as wind erosion, but also human activities, including the overuse of land for grazing and farming. In countries like Morocco, Algeria, and Tunisia, where the soil is already fragile, these activities have led to widespread soil erosion and nutrient depletion. This forces farmers to adopt increasingly intensive farming methods to maintain yields, which often further degrades the land. Desertification not only reduces the available land for agriculture but also undermines the region’s ability to sustain food production over the long term. Invasive species, pests, and crop diseases are additional threats to North Africa’s agricultural resilience. As outbreaks intensify, farmers often resort to increased use of chemical pesticides. While pesticides can temporarily be successful, their overuse leads to environmental pollution, water contamination, and soil degradation. Furthermore, pesticide resistance is becoming an issue, forcing farmers to use even more chemicals, which undermines the long-term sustainability of the agricultural sector. Limited agricultural land in certain countries represents another pressing challenge. In Egypt, for example, the vast majority of the territory is desert, with only a small portion suitable for agriculture. The fertile Nile River Valley is the main source of arable land, but this area is increasingly being shared with urban development as Egypt’s population continues to grow. This puts additional pressure on the agricultural sector, making it more difficult for farmers to increase production and meet the country’s growing demand for food. Finally, the decline in agricultural employment poses another challenge to maintaining food security in North Africa. As automation and modern practices progressively decrease the reliance of farming on manual labor, workforce reductions can outpace the capacity of new agricultural methods to maintain necessary food production, especially in rural areas, where technology adoption lags behind. The resulting shortfall in labor, coupled with increased rural-to-urban migration, can disrupt agricultural productivity and potentially limit the region’s ability to meet local food demand in the long-term. Despite these significant challenges, there are numerous opportunities to address North Africa’s agricultural and water security issues. One of the most promising areas is the diversification of water sources. Desalination technology has already been embraced by several North African countries, such as Egypt, Morocco, and Tunisia, as a viable means of delivering fresh water to meet growing demand. Egypt, for example, operates many desalination plants along its Mediterranean and Red Sea coastlines, which contribute significantly to its water supply. Morocco has also invested heavily in desalination, with plans to expand its capacity to meet the demands of both agricultural and urban areas. With further investment, desalination could help alleviate the pressure on freshwater resources, particularly for agricultural irrigation. Additionally, desalination could be coupled with brackish groundwater treatment, which is less energy intensive than seawater desalination, offering a more sustainable option for agriculture in water-scarce areas. Another important opportunity lies in improving the efficiency of irrigation systems. Modern technologies such as drip irrigation and center pivot irrigation have been shown to significantly reduce water waste while improving crop yields. These methods are particularly useful in water-scarce regions, as they allow farmers to apply water directly to the roots of crops, minimizing evaporation and runoff. However, despite their benefits, the adoption of drip irrigation in North Africa faces several challenges. One major barrier is the initial cost of installation, which can be prohibitive for smallholder farmers without access to financial assistance. Additionally, there is often a strong attachment to traditional irrigation practices, which may be perceived as more reliable or culturally familiar. Limited technical knowledge and insufficient infrastructure to support maintenance and training further complicate widespread adoption. Addressing these challenges is essential for the successful implementation of water-saving technologies across the region. If adopted more broadly, these methods and tools, including soil moisture sensors and automated irrigation systems, could enable farmers to monitor water usage more accurately, reducing waste and improving water efficiency. Sustainable land-management practices offer another key opportunity to address the challenges posed by desertification and soil degradation. Techniques such as reforestation and soil conservation can help restore degraded lands and improve soil fertility, making it more productive and resilient to climate change. In areas that are prone to desertification, practices such as terracing, mulching, and crop rotation can minimize soil erosion and help maintain healthy soils. By promoting sustainable land-management practices, North Africa can slow the spread of desertification and improve agricultural productivity in arid and semi-arid regions. Additionally, crop diversification presents a valuable opportunity to increase agricultural resilience while minimizing the region’s dependence on water-intensive crops. Crops such as olives, grapes, and legumes are well-suited to the region’s dry climate and require less water than more traditional crops like wheat and rice. By encouraging the cultivation of drought-tolerant crops, North Africa can reduce its water demand and build a more sustainable and resilient agricultural sector. The promotion of climate-smart agriculture, which includes the use of drought-resistant crop varieties and sustainable irrigation practices, can further enhance food security in the region. Other technological advances also offer considerable potential to improve North Africa’s agricultural productivity. The adoption of precision farming techniques, which use satellite technology, drones, and sensors to monitor and manage crops, can assist farmers in optimizing their water use, reduce pesticide application, and increase farming yields. These technologies enable farmers to monitor crop health in real-time, adjust irrigation schedules, and apply fertilizers and pesticides more efficiently, ultimately reducing waste and improving environmental sustainability. Lastly, rural development efforts focused on improving education, infrastructure, and economic opportunities can play a key role in stabilizing North Africa’s rural agricultural workforce. Providing better access to education and training can equip rural farmers with the skills needed to adopt modern farming methods and sustainable practices. At the same time, strengthening rural economies by investing in infrastructure, social services, and small-scale farming approaches can reduce the flow of farmers migrating to urban areas. These initiatives not only help retain a stable agricultural workforce but also create stronger, more resilient rural communities capable of supporting North Africa’s sustainable agriculture in the long term. Implementing these potential solutions to address North Africa’s food and water security challenges will require collaboration among relevant groups and entities to enable regional and local improvements in irrigation efficiency, sustainable land management, climate-smart agriculture, technological innovation, and rural development. National governments and the ministries that manage food and water issues can lead the effort with respect to policymaking, infrastructure investments, and the scaling up of nonconventional water supplies and precision irrigation systems. International financial institutions can provide critical funding for large-scale projects, including modern irrigation networks, soil conservation initiatives, and rural development programs that enhance agricultural sustainability. Private-sector engineering companies may contribute to the development of water recycling technologies, while companies specializing in precision agriculture and smart irrigation can offer solutions that optimize water use and improve crop yields. Research institutions that generate data-driven insights on sustainable irrigation, soil conservation, and drought-resistant crops can deliver information and data that ensure policies and investment decisions are evidence-based. Multilateral organizations can offer technical expertise, policy guidance, and capacity-building programs to help North African countries transition to climate-smart agriculture, implement advanced irrigation systems, and adopt sustainable land-management practices to combat desertification. Non-governmental organizations may play a crucial role in advocating for inclusive, community-driven solutions, ensuring that smallholder farmers have access to training, financial support, and technology for sustainable farming. By integrating these diverse yet complementary groups and their respective approaches, North Africa can build a more sustainable agricultural sector that ensures long-term economic stability. **Conclusion** While North Africa grapples with substantial challenges such as water scarcity, climate change, and competing resource demands, the region also holds significant opportunities to mitigate these issues through a combination of sustainable practices, technological innovation, and enhanced water management strategies. By prioritizing improved water resource management, adopting efficient irrigation technologies, and diversifying agricultural practices, North Africa can not only bolster the resilience of its agricultural systems but also improve overall food security. These efforts would enable the region to better withstand the adverse impacts of climate change, optimize water use, and reduce dependence on vulnerable resources, ultimately driving sustainable economic growth and improving the livelihoods of its communities. Through coordinated action, North African countries can pave the way for a future that ensures optimal food security through resilient water and agricultural systems. **About the Author** Mohammed Mahmoud is the CEO and founder of the Climate and Water Initiative as well as the lead for Middle East Climate and Water Policy at the United Nations University Institute for Water, Environment, and Health. He was the founding director of MEI’s former Climate and Water Program. His areas of expertise include climate change adaptation, water policy analysis, and scenario planning. **Endnotes** 1For the purposes of this study, the region of North Africa includes the countries of Algeria, Egypt, Libya, Mauritania, Morocco (excluding Western Sahara), Sudan, and Tunisia. 2“Food self-sufficiency ratio in North Africa in 2014, by country” and “Food self-sufficiency ratio in the Nile Valley in 2014, by country,” Statista, accessed May 16, 2025. 3“The Global Food Security Index 2022,” Economist Impact, accessed May 16, 2025. 4“Agricultural land (square miles) and agricultural land (% of land area), 2012-2021, for Algeria, Egypt, Libya, Mauritania, Morocco, Sudan, and Tunisia,” Food and Agriculture Organization via the World Bank Data Bank, accessed March 2025. 5“Agriculture value added (% GDP), 2014-2021, for Algeria, Egypt, Libya, Mauritania, Morocco, Sudan, Tunisia,” FAO AQUASTAT Dissemination System, accessed March 2025. 6“Employment in agriculture (% of total employment), 2001-2022, for Algeria, Egypt, Libya, Mauritania, Morocco, Sudan, and Tunisia,” ILO via World Bank Data Bank, accessed March 2025. 7“Water in Agriculture,” World Bank, October 20, 2021. 8“Our World in Data: Agricultural water as a share of total water withdrawals, 2012-2020, for Algeria, Egypt, Libya, Mauritania, Morocco, Sudan, Tunisia,” World Bank, January 24, 2025. 9“25 Countries, Housing One-Quarter of the Population, Face Extremely High Water Stress,” World Resources Institute, August 16, 2023. 10Mohammed Mahmoud, “The Looming Climate and Water Crisis in the Middle East and North Africa,” Carnegie Endowment for International Peace, April 19, 2024. 11Mohammed Mahmoud, “The Dry Transition: Water Security and North Africa’s Renewable Energy Future,”North Africa’s Power Shift: Renewable Energy Development and Energy Security, Middle East Institute, December 2024. 12“% of area equipped for irrigation by surface water, 2022, for Sudan, Mauritania, Egypt, and Morocco,” FAO AQUASTAT Database, accessed March 2025. 13FAO, “% of area equipped for irrigation by groundwater, 2021, for Libya, Tunisia, and Algeria,” FAO AQUASTAT Database, accessed March 2025. 14FAO, “% of area equipped for irrigation by direct use of treated and non-treated municipal wastewater, 2021, for Algeria, Egypt, Libya, Mauritania, Morocco, Sudan, Tunisia,” FAO AQUASTAT Database, accessed March 2025. 15M.A.M. Moursy, M. ElFetyany, A.M.I. Meleha, Maha A. El-Bialy, “Productivity and profitability of modern irrigation methods through the application of on-farm drip irrigation on some crops in the Northern Nile Delta of Egypt,”Alexandria Engineering Journal, Volume 62, January 2023, pp. 349-356. 16The local, large-scale irrigation project is known as the Gezira Scheme. Mohammed Mahmoud,“The Nile River: Modern Solutions for Evolving Challenges,”Enhancing Water Security in the Middle East, Al Sharq Strategic Research, May 2023. 17Ismail Oudra, “Spate Irrigation in Morocco,” Spate Irrigation Network, October 2011. 18Ahmed Elagali, Aymen Ahmed, Nada Makki, et al., “Spatiotemporal mapping of malaria incidence in Sudan using routine surveillance data,”Scientific Reports, Vol. 12, No. 14114, August 18, 2022. 19Francesco Piras, Afef Zanzana, Ligia M. Costa Pinto, et al., “The role of the jessour system for agrobiodiversity preservation in Southern Tunisia,”Biodiversity Conservation,Vol. 31, pp. 2479-2494, September 25, 2021. 20Bernadette Montanari, “Shaping the Landscape, Preserving the Knowledge: How Terraces in the High Atlas Mountains of Morocco Retain Traditional Ecological Knowledge,”The Oxford Handbook of Mountain Archaeology, May 22, 2024. 21“Harvesting Water and Harnessing Cooperation: Qanat Systems in the Middle East and Asia,” Middle East Institute, January 18, 2014. 22Ramadan Abdelaziz Tolba, Mohammed Ahmed El-Shirbeny, Samir Masoud Abou-Shleel, et al., “Rice Acreage Delineation in the Nile Delta Based on Thermal Signature,”Earth Systems and Environment,Vol. 4, pp. 287–296, October 29, 2019. 23Press Release, “Africa faces disproportionate burden from climate change and adaptation costs,” World Meteorological Organization, September 2, 2024. 24Salah Basem Ajjur and Sami G. Al-Ghamdi, “Evapotranspiration and water availability response to climate change in the Middle East and North Africa”,Climatic Change,Vol. 166, article number 28, June 2021. 25Malak Ataeb, “Post-disaster reconstruction: Tackling water security in Derna after Storm Daniel,” Middle East Institute, May 23, 2024. 26“Sudan: Assessment on the impact of floods,” Food and Agriculture Organization of the United Nations, DIEM-Impact report, October 2024. 27Reuters in Port Sudan,“Flood surge in Sudan bursts dam, destroying villages and killing dozens,”The Guardian, August 26, 2024. 28Madjid Serrah, “After years of wildfires, Algeria tames the flames,”Context News, September 23, 2024. 29“Firefighters struggle to contain wildfires in northern Morocco,”Al Jazeera, July 15, 2022. 30Eman Mounir, “Egypt's Nile Delta Under Threat, Part 1: The Sea Engulfs Kafr El-Sheikh,” Earth Journalism Network, December 28, 2023. 31Sarah Yerkes and Joy Arkeh, “What Tunisia’s Municipalities Can Contribute to Climate Adaptation,” Carnegie Endowment for International Peace, June 13, 2024. 32Mohammed Mahmoud, “Sudan at the Nexus of Transboundary Cooperation on the Nile,”Troubled Waters in Conflict and a Changing Climate: Transboundary Basins Across the Middle East and North Africa, Carnegie Middle East Center, February 12, 2024. 33“Crisis in Sudan: What is happening and how to help,” International Rescue Committee, May 19, 2025. 34\"Crisis in Sudan,\" IRC, May 19, 2025. 35Farouk Chothia, “Sudan slides deeper into famine, experts say,”BBC News, December 24, 2024. 36Redaction Africanews with AFP, “Gum Arabic threatened by the war in Sudan,”Africanews, August 13, 2024. 37Wilson Center Staff, “Water Weaponization in Libya: A Conversation with Erika Weinthal,”New Security Beat, Wilson Center, March 22, 2024. 38Wilson Center Staff, “Water Weaponization in Libya,” March 22, 2024. 39Tarek Ben Hassen and Hamid El Bilali, “Conflict in Ukraine and the unsettling ripples: implications on food systems and development in North Africa,”Agriculture & Food Security,Vol. 13, No. 16, April 8, 2024. 40Hassen and Bilali, “Conflict in Ukraine,” April 8, 2024. 41“African Green Hydrogen Alliance launches with eyes on becoming a clean energy leader,” UN Climate Champions: Race to Zero, May 18, 2022. 42Anne Mottet, Cees de Haan, Alessandra Falcucci, Giuseppe Tempio, Carolyn Opio, and Pierre Gerber, “Livestock: On our plates or eating at our table? A new analysis of the feed/food debate,”Global Food Security, Vol. 14, pp. 1-8, September 2017. 43Sam Kimball, “Drought in North Africa Hits Farmers as Climate Change Impacts Bite,” Climate Impacts Tracker Asia, July 5, 2023. 44“Reducing the Drip of Irrigation Energy Costs,” Medium, July 2017. **Additional Photos** Main photo: Palm field suffering from desertification near Morocco’s southeastern oasis town of Erfoud, on Oct. 27, 2016. Photo by Fadel Senna/AFP via Getty Images. Contents photo: Automatic sprinklers irrigate a field with water from the Siliana wastewater treatment plant in northern Tunisia on Nov. 28, 2023. Photo by Fathi Belaid/AFP via Getty Images. The Middle East Institute (MEI) is an independent, non-partisan, not-for-profit, educational organization. It does not engage in advocacy and its scholars’ opinions are their own. MEI welcomes financial donations, but retains sole editorial control over its work and its publications reflect only the authors’ views. For a listing of MEI donors, please clickhere. **Main Navigation** Policy Analysis Events Education Experts Arts & Culture Get Involved Search media@mei.edu 202-785-1141 x241 events@mei.edu 202-785-1141 x202 development@mei.edu 202-785-1141 x2505 mej@mei.edu 202-785-1141 x210 artsculture@mei.edu 202-785-1141 x2509 communications@mei.edu 202-785-1141 **Tertiary Navigation** Public Disclosures Board Staff Employment Middle East Institute1763 N St. NW, Washington D.C. 20036 © 2018 Middle East Institute All Rights Reserved |Accessibility Policy| Built bySocial Driver."}