{"id": 1922, "name": "COED", "domain": "coed.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://coed.com/2025/06/04/pro-wrestler-arrested-after-kidnapping-victim-leaves-note-in-florida-jersey-mikes-bathroom/", "title": "Pro Wrestler Arrested After Kidnapping Victim Leaves Note In Florida Jersey Mikes Bathroom", "content": "**Pro Wrestler Arrested After Kidnapping Victim Leaves Note in Florida Jersey Mike’s Bathroom** Michael Berlfein / Shutterstock.com A professional wrestler was arrested last week after authorities responded to a disturbing plea for help discovered in a Jersey Mike’s bathroom in Navarre, Florida. The note – written by the wrestler’s girlfriend – claimed she was being held against her will. Eleanor Coffee, an employee at the sandwich shop, spotted what she initially thought was trash: “a little piece of crumpled up paper” on the floor beside a toilet paper dispenser in the women’s restroom. Upon closer inspection, she found a desperate message reading, “Please help get me home! HELP! Get me before May 30th!” The note contained the woman’s name, phone number, and a nearby address – details that prompted Coffee to alert her manager and contact the Santa Rosa County Sheriff’s Office. “She was like, ‘Please help me. I’m at this address in Navarre. I need you to call the police and do a wellness check,’” Coffee explained in an interview withWEAR News. Deputies recognized the man from security footage due to his involvement in previous domestic violence incidents. They obtained a search warrant for the location specified in the note. When authorities located the woman at the residence, she confirmed writing the plea and described what investigators called “a prolonged period of abuse.” According to the Sheriff’s Office statement, “She detailed repeated assaults, threats involving weapons, and being held in isolation… for a span of several months.” Law enforcement observedvisible injurieson the victim, who was subsequently transported to a hospital for treatment of “suspected broken bones and other trauma.” The arrested individual – who performs under the ring name Jayden Steele according toRingside News– denied physically assaulting the woman. However,Law & Crimereports she provided photographic evidence documenting her injuries. The wrestler now faces multiple charges, including four felonies and a misdemeanor: aggravated assault with a deadly weapon, kidnapping with false imprisonment, and battery. He’s been booked into the Santa Rosa County Jail. Join over 100,000 fans and receive news from COED.Email Address ABOUT|CONTACT|PRIVACY|TERMS Breaking News Entertainment College Sports Culture Viral Miss COED ABOUT COED CONTACT US MEDIA KIT PRIVACY POLICY Contact About Advertise Privacy Policy Terms of Use ©COED MEDIAAll Rights Reserved."}