{"id": 317, "name": "Woodland Daily Democrat", "domain": "dailydemocrat.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.dailydemocrat.com/2025/06/10/whitney-prawl-has-a-great-balance-of-being-fun-and-welcoming-allowing-her-students-to-thrive-teacher-of-the-week/", "title": "Whitney Prawl Has A Great Balance Of Being Fun And Welcoming Allowing Her Students To Thrive Teacher Of The Week", "content": "e-Edition e-Edition NewsLocal NewsBusinessNews AlertsCrime and Public SafetyCourtsAgricultureMarijuanaEducationHealthHousingTransportationCalifornia News Local News Business News Alerts Crime and Public Safety Courts Agriculture Marijuana Education Health Housing Transportation California News Local News Business News Alerts Crime and Public Safety Courts Agriculture Marijuana Education Health Housing Transportation California News SportsSportsLocal SportsHigh School SportsAthlete of the WeekUC Davis AggiesOakland AthleticsRaidersSan Francisco 49ersSan Francisco GiantsSan Jose SharksGolden State Warriors Sports Local Sports High School Sports Athlete of the Week UC Davis Aggies Oakland Athletics Raiders San Francisco 49ers San Francisco Giants San Jose Sharks Golden State Warriors Sports Local Sports High School Sports Athlete of the Week UC Davis Aggies Oakland Athletics Raiders San Francisco 49ers San Francisco Giants San Jose Sharks Golden State Warriors LifestyleLifestylePets of the WeekEntertainmentHome & GardenMoviesRestaurants Food and DrinkComicsPuzzlesEvents Lifestyle Pets of the Week Entertainment Home & Garden Movies Restaurants Food and Drink Comics Puzzles Events Lifestyle Pets of the Week Entertainment Home & Garden Movies Restaurants Food and Drink Comics Puzzles Events ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary OpinionOpinionColumnistsEditorialsLetters to the Editor Opinion Columnists Editorials Letters to the Editor Opinion Columnists Editorials Letters to the Editor Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Best of 2024 Magazine AdvertisingAdvertise with usA&E SourceLocal GuideJobsReal EstateToday’s AdsSpecial SectionsAdvertising ArticlesPublic Notices Advertise with us A&E Source Local Guide Jobs Real Estate Today’s Ads Special Sections Advertising Articles Public Notices Advertise with us A&E Source Local Guide Jobs Real Estate Today’s Ads Special Sections Advertising Articles Public Notices Subscribe Log In Logout Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print Subscribe Log In Sign up for email newsletters Subscribe Log In e-Edition e-Edition News Sports Lifestyle Obituaries Opinion Advertise e-Edition A&E Source Best of 2024 Magazine Trending: Woodland Christian girls basketball team wins 19th straight game after non-league clash against Rodriguez Woodland Joint Unified School District hosts tour for parent leaders, highlighting ‘badly needed’ improvements Davis Musical Theatre Company holding auditions for Young Performers’ Theatre, main stage | Center Stage Yolo County blood drives, Woodland rebates and utility assistance available | Just Business Empower Yolo fights for funding as Victims of Crime Act receives massive budget cuts **Whitney Prawl’s ‘great balance of being fun and welcoming’ allows students to thrive | Teacher of the Week** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print Whitney Prawl always thought she would go on to teach elementary school kids, but later found her place teaching middle school. She now teaches at the same school she attended when she was younger, and loves to spark questions and discussions in her lessons with her students. Douglass Middle School Principal Cristina Morel praises Prawl for being a role model not only in the classroom but also in the school, and for the genuine care she shows her students. “Whitney wears many hats on our campus and means different things to different people,” Morel said. “She is a key member of our Guiding Coalition, is the HSS department chair, and a WEA Rep for the site. She supports her colleagues and motivates her students to learn more and grow as individuals. She helps plan and support our academic initiatives and can be counted on to dress up for every spirit day.” Morel continued: “Mrs. Prawl is one of those teachers who thinks everything through and puts in effort – she does not do things by halves. Her lessons are detailed and include tons of support so that every student has the opportunity to be successful in her class. She is creative and designs lessons that students enjoy. Whitney has a great balance of being fun and welcoming, but her students know that there are rules and order- and they thrive in that environment.” Prawl is honored and grateful to be recognized as Teacher of the Week. “I really enjoy the fact that I get to teach where I went to school. It’s kind of fun,” Prawl said. “I work with some really great people, and I feel like so many of them could have been nominated, so I feel honored in that way, and so I’m grateful, very grateful.” Prawl was born and raised in Woodland. As a student, she attended Gibson Elementary, Douglas and then Woodland High School. After graduating, she attended American River College, where she studied political science and child development. She later got her degree in history with a minor in teaching education and her teaching credential at Sacramento State. Before she became a teacher, Prawl volunteered and worked in childcare programs for the Woodland and Sacramento YMCA, working with infants through high school-aged students. Through that job, she gained experience in problem-solving and working with children and parents, and she really enjoyed it. Prawl explains that she was inspired to become a teacher because she enjoyed working with kids. “I think I just always really loved working with kids, and that’s where I spent all my extra time,” Prawl said. “I knew that I wanted to do something with that as I was getting older. My aunt was also a kindergarten teacher in Woodland for decades at Gibson Elementary, and so I had a nice, positive role model in her to see that and want to be like that.” At Douglass, Prawl teaches eighth-grade U.S. history, where she has been teaching since 2016. “I have just always loved history,” Prawl shares. “When I first started training to be a teacher, it was not my plan to be at the middle school level. I thought I would teach elementary school for a very long time, but I’ve since felt that I’ve found my place working with middle school-aged kids, and I couldn’t imagine teaching at a lower or higher level. I feel like I found my place.” She describes her teaching style as kind and supportive, yet structured, to help her students make the classroom an inviting place and to encourage them to ask questions. “My teaching style is kind and supportive, but also to counter that, pretty firm and structured,” she said. “I work really hard to create an inviting classroom and a respectful environment for kids, somewhere where they could feel safe and want to take risks in asking hard questions, because that’s a lot of what U.S. history does, is ask the hard questions. I’m also really organized and am really good at holding kids accountable, both in their behavior and in their learning.” Prawl shares that one of her and her students’ favorite lessons is to work on bringing in real-time events and comparing them to past events. “One of my favorite things to work on with students is bringing in real-time events that are going on in our country and in our world, and have them analyze how they are very similar to events that are in our curriculum,” she said. “The kids really find that connection in that when they see an article about something going on in our government today, and I then show them something from 200 years ago and say, ‘Look, these are very similar,’ and watch their little light bulbs go on.” As the end of the school year approached, Prawl was wrapping up her unit on the Civil War. She mentioned that this is a “big theme” throughout the year, as they see the shift of laws regarding enslavement. She also shares that her favorite thing about her students is that their thoughtful questions often spark meaningful discussions. “I love when my students ask really thoughtful questions that kind of sparked discussions in class that lead to more organic learning when it’s not just me getting notes or reading out of the textbook, but when they initiate a discussion that leads to learning happening,” she said. As a former Douglass student, Prawl also enjoys sharing her memories of her time at the school. “I have a lot of memories, and I can share them,” Prawl said. “I have no problem sharing, like, embarrassing pictures of myself, like ‘Look guys, middle school’s awkward for everybody.’ But honestly, part of being at Douglass is the people that I work with. I love the staff that we have on campus and our leadership, and I feel like we are a team unlike any other. I feel like we have a really core group of great people guiding these middle schoolers through their awkward years.” Additionally, Prawl is chair of the history department at Douglass, through which she helps oversee and lead the planning and organizing. She is also part of the executive board of the Woodland Education Association, where she helps guide and lead teachers in the Woodland community. Outside of teaching, Prawl enjoys exploring little bookshops with friends and getting coffee. She also enjoys spending time in her garden and exploring national parks with her husband. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print **RevContent Feed** **Most Popular** Winters Police Department Chief addresses ICE raid concernsWinters Police Department Chief addresses ICE raid concerns **Winters Police Department Chief addresses ICE raid concerns** **Winters Police Department Chief addresses ICE raid concerns** City of Woodland to host 2-day Independence Day celebration July 3 and 4City of Woodland to host 2-day Independence Day celebration July 3 and 4 **City of Woodland to host 2-day Independence Day celebration July 3 and 4** **City of Woodland to host 2-day Independence Day celebration July 3 and 4** Woodland activists and residents set for ‘No Kings March’ June 14Woodland activists and residents set for 'No Kings March' June 14 **Woodland activists and residents set for ‘No Kings March’ June 14** **Woodland activists and residents set for ‘No Kings March’ June 14** Whitney Prawl’s ‘great balance of being fun and welcoming’ allows students to thrive | Teacher of the WeekWhitney Prawl's 'great balance of being fun and welcoming' allows students to thrive | Teacher of the Week **Whitney Prawl’s ‘great balance of being fun and welcoming’ allows students to thrive | Teacher of the Week** **Whitney Prawl’s ‘great balance of being fun and welcoming’ allows students to thrive | Teacher of the Week** Summer activities heat up at Woodland LibrarySummer activities heat up at Woodland Library **Summer activities heat up at Woodland Library** **Summer activities heat up at Woodland Library** A former student opens fire at an Austrian school, killing 10 and taking his own lifeA former student opens fire at an Austrian school, killing 10 and taking his own life **A former student opens fire at an Austrian school, killing 10 and taking his own life** **A former student opens fire at an Austrian school, killing 10 and taking his own life** Student speakers at UC Davis commencements to reflect on journeysStudent speakers at UC Davis commencements to reflect on journeys **Student speakers at UC Davis commencements to reflect on journeys** **Student speakers at UC Davis commencements to reflect on journeys** Column: What is the fate of Woodland Community College?Column: What is the fate of Woodland Community College? **Column: What is the fate of Woodland Community College?** **Column: What is the fate of Woodland Community College?** **More in News** Brian Wilson, Beach Boys visionary leader and summer’s poet laureate, dies at 82 **Brian Wilson, Beach Boys visionary leader and summer’s poet laureate, dies at 82** **Brian Wilson, Beach Boys visionary leader and summer’s poet laureate, dies at 82** Trump plans to attend ‘Les Misérables’ at the Kennedy Center after taking over the institution **Trump plans to attend ‘Les Misérables’ at the Kennedy Center after taking over the institution** **Trump plans to attend ‘Les Misérables’ at the Kennedy Center after taking over the institution** Juneteenth started with handbills proclaiming freedom. Here’s what they said **Juneteenth started with handbills proclaiming freedom. Here’s what they said** **Juneteenth started with handbills proclaiming freedom. Here’s what they said** Pulse massacre survivors are set to revisit the nightclub before it’s razed **Pulse massacre survivors are set to revisit the nightclub before it’s razed** **Pulse massacre survivors are set to revisit the nightclub before it’s razed** 2025 June 10 Subscribee-EditionSign Up For Newsletters e-Edition Sign Up For Newsletters e-Edition Sign Up For Newsletters Contact UsAnnouncement FormsWork With UsSpecial Sections Announcement Forms Work With Us Special Sections Announcement Forms Work With Us Special Sections Customer ServiceAccessibilityPrivacy PolicySitemap Accessibility Privacy Policy Sitemap Accessibility Privacy Policy Sitemap Advertise With UsMediaNews Group AdvertisingToday’s Ads MediaNews Group Advertising Today’s Ads MediaNews Group Advertising Today’s Ads Public NoticesLocal GuideJobsReal Estate Local Guide Jobs Real Estate Local Guide Jobs Real Estate Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}