{"id": 2130, "name": "The Standard", "domain": "standardmedia.co.ke", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.standardmedia.co.ke/ktn/ktn-newsdesk/video/2000228631/political-and-religious-leaders-are-demanding-full-accountability-for-the-death-of-albert-ojwang", "title": "Political And Religious Leaders Are Demanding Full Accountability For The Death Of Albert Ojwang", "content": "**JavaScript is disabled! Please enable JavaScript in your web browser!** NEWS BUSINESS SPORTS POLITICS FEATURES SCHEDULE LIVE LOGIN **Political and religious leaders are demanding full accountability for the death of Albert Ojwang** 11th June, 2025 Political, religious, and civil society leaders in Kenya are demanding full accountability for the death of Albert Ojwang, a blogger who died in police custody under suspicious circumstances. Arrested in Homa Bay for allegedly spreading misinformation, Ojwang was transferred to Nairobi’s Central Police Station, where police claim he fatally hit his head on a cell wall. 10th June, 2025 10th June, 2025 9th June, 2025 9th June, 2025 5th June, 2025 5th June, 2025 **GET OUR NEWSLETTER** Subscribe to our newsletter and stay updated on the latest developments and special offers! **CONNECT WITH US** **Digital News** videos Health & Science Opinion Education Columnists Lifestyle Cartoons Moi Cabinets Kibaki Cabinets Arts & Culture **The Nairobian** **The Nairobian** News Scandals Gossip Sports Blogs Entertainment Politics **entertainment** **entertainment** showbiz arts & culture lifestyle events **evewoman** **evewoman** Living Food Fashion & Beauty Relationships Videos wellness readers lounge Leisure And Travel bridal parenting **farmkenya** **farmkenya** news KTN farmers tv smart harvest podcasts farmers market Agri-Directory mkulima expo 2021 farmpedia **sports** **sports** football rugby Boxing Golf Tennis Basketball athletics Volleyball and handball hockey cricket gossip & rumours premier league **Enterprise** VAS e-learning digger classifieds jobs Cars/motors **tv stations** ktn home ktn news KTN Farmers Tv **radio stations** radio maisha spice fm vybez radio **** corporate contact us rate card Vacancies DCX O.M Portal corporate email RMS privacy policy terms & conditions Privacy and cookie settings"}