{"id": 237, "name": "Honolulu Civil Beat", "domain": "civilbeat.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.civilbeat.org/2025/05/important-intentions-uncertain-outcomes-raised-in-phasing-out-maui-short-term-rentals/", "title": "Important Intentions Uncertain Outcomes Raised In Phasing Out Maui Short Term Rentals", "content": "Community VoiceUncertain Outcomes Raised In Phasing Out Maui Short-Term Rentals Community Voice **Uncertain Outcomes Raised In Phasing Out Maui Short-Term Rentals** The county’s plan does not adequately address affordable housing and could deliver a serious blow to the local economy. ByLynette Pendergast May 30, 2025·4 min read **About the Author** Lynette Pendergast The county’s plan does not adequately address affordable housing and could deliver a serious blow to the local economy. In the wake of the 2023 Maui wildfires, our island’s housing crisis has reached a critical point. In response, county officials propose phasing out approximately 7,000 short-term rentals by 2026, with the goal of converting these units into long-term housing for locals. The urgency of this issue is undeniable, and the intent behind the proposal is understandable. However, as currently structured, the policy presents serious challenges that may unintentionally create new problems while falling short of its goal. It risks harming our economy without meaningfully addressing the barriers that keep locals from accessing truly affordable and suitable housing. **Closer Look At Financial Impact** The proposed STR phase-out could deliver a serious blow to Maui’s economy. According to the University of Hawaiʻi Economic Research Organization,the proposed policycould lead to the loss of nearly 1,900 local jobs, a $900 million reduction in annual visitor spending, and $60 million less in property tax revenue — funds that support critical public services and potential housing projects. In other words, we risk weakening our economic foundation without making significant strides toward increasing accessible and affordable housing for local families. **The Reality Behind The Units** Many of these units were never built to support long-term residential use. They’re typically small, one-bedroom or studio condos, with limited storage, outdoor space, and parking. Homeowners associationrules in many buildings also restrict family living with pet bans. Additionally, high carrying costs — including mortgage payments, HOA dues, maintenance, and taxes — can easily top $6,000, far beyond what most local families can afford in rent. For a household earning Maui’s median income, affordable rent caps out around $2,500 per month. According to a 2025 survey conducted by the Realtors Association of Maui, only 8% of apartment-zoned STR owners said they would convert their units to long-term rentals if the bill passed. Most said they would either sell or keep their units for personal use, citing financial strain, HOA restrictions, and the loss of family flexibility. In short, these properties are unlikely to reenter the market in a way that substantially benefits local residents. A review of the original covenants, conditions, and restrictions and zoning documents for many of these properties shows that short-term or transient use was clearly contemplated when these projects were established. There were no references to affordable or workforce housing requirements, reinforcing the fact that these units were not designed to serve as long-term housing. While the intent behind Bill 9 may be to prioritize housing, reinterpreting the original use of these units doesn’t guarantee the outcome the community is hoping for. **A Fragile Tourism Economy** The proposed phase-out also threatens to disrupt Maui’s visitor economy. Reducing the number of permitted STRs may not decrease tourism itself, but it could centralize visitor spending into fewer hands. This isn’t about defending one sector over another. That shift would disproportionately impact small businesses and local service providers that depend on the distributed economic benefits of STR guests. By consolidating tourism dollars into fewer hands, the policy risks diminishing the community’s share of the visitor economy without guaranteeing that more resources will stay in local hands. **Building Lasting, Local Solutions** Maui needs a balanced and thoughtful approach; one that addresses housing affordability while safeguarding economic stability. Rather than eliminating permitted STRs outright, the county should consider strategic actions, such as: strengthening enforcement against illegal STRs; allocating STR tax revenue specifically for affordable housing development; and accelerating the development of 201H projects, expanding accessory dwelling units, and investing in essential infrastructure. This isn’t about defending one sector over another. It’s about finding solutions that genuinely serve Maui’s residents while preserving the economic vitality that sustains our island community. Moving forward, let’s prioritize clear, practical, and community-focused strategies that address the housing crisis without compromising our future. Let’s work together to build a path that truly benefits all who call Maui home. **Sign up for our FREE morning newsletter and face each day more informed.** Community Voices aims to encourage broad discussion on many topics of community interest. It’s kind of a cross between Letters to the Editor and op-eds. This is your space to talk about important issues or interesting people who are making a difference in our world. Column lengths should be no more than 800 words and we need a photo of the author and a bio. We welcome video commentary and other multimedia formats. Send tonews@civilbeat.org. The opinions and information expressed in Community Voices are solely those of the authors and not Civil Beat. **This Bill Threatens The Future Of Māmaki And Hawaiʻi’s Local Farmers** ByMalie Sarsona·June 1, 2025·6 min read Support timely, accurate, independent journalism. Honolulu Civil Beat is a nonprofit organization, and your donation helps us produce local reporting that serves all of Hawaii. **About the Author** Lynette Pendergast Lynette Pendergast is president of the Realtors Association of Maui. **Latest Comments(0)** Read more Here's a perspective that's not talked about much: Forget about affordable housing!!! It will never happen. Housing is expensive. The cost only goes up. Instead, focus on bringing higher paying professional jobs to the islands so we can successfully compete with anyone in the country. And most importantly, we need to develop the skills to fill those higher paying jobs. Hawaii has a people problem. Can't afford a house? Quit blaming politicians and everyone else. Look in the mirror and figure it out. Keleko·4 days ago Bissen is just kicking the can down the road and shifting the blame for not building affordable housing on to TVR owners, which include \"local\" people. It shouldn't be a us against them scenario. It is a governmental failure of epic proportions over half a decade in the making. There is no short term solution to building housing that is 60 years too late and the mayor should admit it. It's not just a state wide problem, it's a national problem and as the cost to build continues to rise, people that don't understand how much that number is fail to see why you can't get a home in Hawaii for under $750K. It's high demand and limited supply. You simply cannot build a home for less than the cost of materials and labor required. Government can assist with the land part of the equation, but unless more prefab units are shipped in, the cost to put up a simple home will be a stretch for most not making 6 figures a year. If you want a more affordable home, where land and materials are cheaper, look at Nevada, Texas, or Arizona. wailani1961·1 week ago We own an 800 +/- sq ft 2 bdr condo on the west side. No pets allowed,Only 1 parking space, and 2 small closets. Our prop tax has risen from $6K to over $15 K per year, since 2019. Our minimum expenses per month are $7200. How would any family afford that amount as rent? Long term rental would see a lower property tax, so how would the county make up for that diff and also lower GET/TAT taxes? They would have to raise rates, AGAIN. This has been the most poorly thought out plan I have ever seen a county try to do. Dhenry99·1 week ago **About IDEAS** Ideas is the place you'll find essays, analysis and opinion on public affairs in Hawaiʻi. We want to showcase smart ideas about the future of Hawaiʻi, from the state's sharpest thinkers, to stretch our collective thinking about a problem or an issue. Emailnews@civilbeat.orgto submit an idea. **Reading has never been easier.** Get the Civil Beat App. **Wake up with the Morning Beat!** Sign up for our FREE morning newsletter and face each day more informed. Copyright © 2010-2025 Honolulu Civil Beat Inc. All rights reserved. Civil Beat ® is a registered trademark of Honolulu Civil Beat Inc. **Mahalo!** You're officially signed up for our daily newsletter, the Morning Beat. A confirmation email will arrive shortly. In the meantime, we have other newsletters that you might enjoy. Check the boxes for emails you'd like to receive. Breaking News AlertsWhat's this?Be the first to hear about important news stories with these occasional emails. Special Projects & InvestigationsWhat's this?You'll hear from us whenever Civil Beat publishes a major project or investigation. EnvironmentWhat's this?Get our latest environmental news on a monthly basis, including updates on Nathan Eagle's 'Hawaii 2040' series. Maui NewsletterWhat's this?Stay updated with the latest news from Maui. Inbox overcrowded? Don't worry, you can unsubscribeor update your preferences at any time."}