{"id": 734, "name": "KARE11", "domain": "kare11.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kare11.com/article/news/investigations/kare-11-investigates-lawmakers-pass-sweeping-reforms-targeting-fraud-minnesotas-housing-stabilization-service-program/89-ab67aca8-100a-4d64-bf40-6b5a7a3ec195", "title": "Kare 11 Investigates Lawmakers Pass Sweeping Reforms Targeting Fraud Minnesotas Housing Stabilization Service Program", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalCommunityNear MeEntertainmentExtrasHealthNation WorldMoneyPoliticsFeaturesShowsKARE 11 InvestigatesLatest News StoriesDNR unveils accessibility upgrades at William O'Brien State ParkMinnesota DNR unveils accessibility upgrades at William O'Brien State ParkAccessibility upgrades unveiled at William O'Brien State ParkAir quality alert issued across Minnesota Back Local Community Near Me Entertainment Extras Health Nation World Money Politics Features Shows KARE 11 Investigates DNR unveils accessibility upgrades at William O'Brien State ParkMinnesota DNR unveils accessibility upgrades at William O'Brien State ParkAccessibility upgrades unveiled at William O'Brien State Park Air quality alert issued across Minnesota Back Local Community Near Me Entertainment Extras Health Nation World Money Politics Features Shows KARE 11 Investigates DNR unveils accessibility upgrades at William O'Brien State ParkMinnesota DNR unveils accessibility upgrades at William O'Brien State ParkAccessibility upgrades unveiled at William O'Brien State Park Air quality alert issued across Minnesota WeatherBackForecastRadarClosings & DelaysTrafficLatest Weather StoriesWildfire smoke exits Minnesota as skies clearWEATHER: Active pattern brings numerous rain chances Back Forecast Radar Closings & Delays Traffic Wildfire smoke exits Minnesota as skies clear WEATHER: Active pattern brings numerous rain chances Back Forecast Radar Closings & Delays Traffic Wildfire smoke exits Minnesota as skies clear WEATHER: Active pattern brings numerous rain chances SportsBackHigh School SportsMinnesota VikingsGolden GophersMinnesota LynxMinnesota TwinsMinnesota TimberwolvesMinnesota UnitedMinnesota WildOlympicsLocked On Podcast NetworkLatest StoriesTwins claim lefty pitcher Joey Wentz off waivers from PiratesHigashioka has 5 RBIs, Carter and Langford each homer as Rangers beat Twins 16-4 Back High School Sports Minnesota Vikings Golden Gophers Minnesota Lynx Minnesota Twins Minnesota Timberwolves Minnesota United Minnesota Wild Olympics Locked On Podcast Network Twins claim lefty pitcher Joey Wentz off waivers from Pirates Higashioka has 5 RBIs, Carter and Langford each homer as Rangers beat Twins 16-4 Back High School Sports Minnesota Vikings Golden Gophers Minnesota Lynx Minnesota Twins Minnesota Timberwolves Minnesota United Minnesota Wild Olympics Locked On Podcast Network Twins claim lefty pitcher Joey Wentz off waivers from Pirates Higashioka has 5 RBIs, Carter and Langford each homer as Rangers beat Twins 16-4 SearchSearch:Search Advertise With Us KARE 11 Investigates Land of 10,000 Stories Breaking the News Sunrise MN & Co. News at Noon Traffic Links Contests Originals KARE 11 Saturday Your Money Weatherminds Lifting Voices Grow with KARE Locked On VERIFY Behind the Business Communities that KARE TV Listings Meet the KARE 11 team **KARE 11 Investigates: Lawmakers pass sweeping reforms targeting fraud in Minnesota’s Housing Stabilization Service program** Bipartisan action to protect vulnerable Minnesotans following a KARE 11 investigation exposing widespread allegations of forgery and fraud A.J. Lagoe, Kelly Dietz, Gary Knox KARE 11 Client Concerns Client Concerns Client Concerns Client Concerns Key Reforms Key Reforms Key Reforms Key Reforms Sounding the Alarm Sounding the Alarm Sounding the Alarm Sounding the Alarm ST PAUL, Minn. Minnesota lawmakers passed major reforms to the state’s Housing Stabilization Services (HSS) program after KARE 11 Investigates uncovered evidence of widespread fraud. The bipartisan legislative changes impose stricter backgrounding and oversight requirements for the program, which is designed to help the elderly and people with disabilities find and maintain housing. The HSS program is funded through Medicaid and overseen by the Minnesota Department of Human Services (DHS). In 2024, state data details HSS cost close to $105 million. But KARE 11 discovered significant allegations of fraud and forgery within the taxpayer-funded program, and providers billing the state for services clients say were never delivered. Legislators said the recent changes were directly inspired by aseries of KARE 11 reports. **:Client Concerns** Jesse Kingbird is a disabled combat veteran who is currently homeless. Earlier this year, he applied for HSS assistance but was denied by DHS, which told him he was already enrolled with another provider—someone he had never heard of. “I said, ‘From who?’” Kingbird recalled. “Like, I have no idea who these people are. I never heard these names before.” Kingbird says the electronic signature on the form signing him up for HSS was forged. It’s a pattern echoed by others across Minnesota. Another client, Steven Smith, says his signature signing him upfor services by a different company was also forged. Smith’s HSS provider, who billed for allegedly helping him find and maintain housing, is Leo Human Services. The company billed more than $1.2 million to Medicaid in 2024— earning its spot in the state’s top 10 billers. “I’ve never got an hour of help,” Smith said. KARE 11 extracted metadata from the PDF document that revealed that Smith’s signature, dated 08/28/23, was actually created the following day, 08/29/23, and authored by someone named Wats Hanin. DHS rules are clearthat providers are not permitted to sign on behalf of the recipient. Other HSS clients told KARE 11,taxpayers footed the bill for services never provided.Rachel Lien, who signed up for services with Brilliant Minds after completing addiction recovery treatment, provided records to prove it. “Everything listed is a complete lie,\" Lien said, while reading through her records. At KARE 11’s request, Lien obtained documentation from Brilliant Minds of the services they provided. In one example, Brilliant Minds documented a meeting with Rachel, stating: “I met with Rachel and introduced myself to her and spent a quality amount of time getting to know one another.\" But Rachel’s treatment records confirm Rachel was in a group counseling session at the exact same time Brilliant Minds claimed to have met with her. **:Key Reforms** “We’re going to slap a lid on it” said DFL State Senator John Hoffman about the fraud allegations within HSS. “Those bad actors, we need to stop.” He told KARE 11, the Special Legislative session allowed him and GOP Senator Jim Abeler to work on bipartisan reforms – completely rewriting state statute on how HSS is delivered. Changes are as follows: Limitations on billing, now capped at 100 hours annually per client Limitations on billing, now capped at 100 hours annually per client Limitations on billing, now capped at 100 hours annually per client Providers can utilize remote support for no more than 20% of transition and sustaining services for the recipient. Providers can utilize remote support for no more than 20% of transition and sustaining services for the recipient. Providers can utilize remote support for no more than 20% of transition and sustaining services for the recipient. HSS owners and managers involved in day-to-day operations must complete a compliance class. This includes training on billing, documentation, fraud prevention, and more. HSS owners and managers involved in day-to-day operations must complete a compliance class. This includes training on billing, documentation, fraud prevention, and more. HSS owners and managers involved in day-to-day operations must complete a compliance class. This includes training on billing, documentation, fraud prevention, and more. Additional funding for provider site visits by DHS, including a pre-enrollment visit. Additional funding for provider site visits by DHS, including a pre-enrollment visit. Additional funding for provider site visits by DHS, including a pre-enrollment visit. To fulfill eligibility, new and renewing HSS providers must complete a pre-enrollment risk assessment. To fulfill eligibility, new and renewing HSS providers must complete a pre-enrollment risk assessment. To fulfill eligibility, new and renewing HSS providers must complete a pre-enrollment risk assessment. Increased documentation requirements, including a signature by the service recipient verifying the accuracy of the provider’s HSS documentation. Increased documentation requirements, including a signature by the service recipient verifying the accuracy of the provider’s HSS documentation. Increased documentation requirements, including a signature by the service recipient verifying the accuracy of the provider’s HSS documentation. Providers must show proof of a surety bond. Upon new enrollment, or if the provider’s medical assistance revenue in the previous calendar year is $300,00 or less, the provider must purchase a $50,000 surety bond. If the provider exceeds that revenue, they must purchase a $100,000 surety bond. Providers must show proof of a surety bond. Upon new enrollment, or if the provider’s medical assistance revenue in the previous calendar year is $300,00 or less, the provider must purchase a $50,000 surety bond. If the provider exceeds that revenue, they must purchase a $100,000 surety bond. Providers must show proof of a surety bond. Upon new enrollment, or if the provider’s medical assistance revenue in the previous calendar year is $300,00 or less, the provider must purchase a $50,000 surety bond. If the provider exceeds that revenue, they must purchase a $100,000 surety bond. “It’s really about getting some transparency and accountability in the process,” Hoffman said. **:Sounding the Alarm** A number of HSS providers KARE 11 spoke with said reforms and increased oversight are a long time coming. “Most providers and people who work in this world have known that it’s been happening for a long time,” said Callie Proctor, Executive Director of an HSS company called Spirit & Sand. She told KARE 11 it’s “too easy” for HSS companies to commit fraud. A report from the housing advocacy group Hearth Connection, submitted to DHS in August 2024, warned that “reports of predatory activity to enroll individuals without their knowledge are increasing.” It also described predatory enrollers trolling outside emergency shelters, approaching people, promising housing and misrepresenting what they offer participants. Multiple addiction treatment providers interviewed by KARE 11 described aggressive marketing at their centers by HSS providers. The legislative reforms mark progress—but investigations are ongoing. In May, DHS notified KARE 11 of investigations into Leo Human Services, Brilliant Minds and several other HSS companies spotlighted by KARE 11. DHS also vowed to exercise its discretion to heighten oversight of all HSS companies as of June 1, by increasing the provider screening risk level from \"limited\" to \"high\" risk. KARE 11 later learned DHS has cut off Medicaid payments to both Leo Human Services and Brilliant Minds. As for Kingbird, he wants more than policy change. “This is not a victimless crime,” he said. “They need to be hauled off to jail. There are no ifs, ands, or buts about that.” KARE 11’s investigation into Housing Stabilization Services and questionable billing practices continues. If you have information to help our reporters, contact the KARE 11 Investigates team atinvestigations@kare11.com **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}