{"id": 770, "name": "KOB 4 Eyewitness News", "domain": "kob.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kob.com/news/business-money/us-job-openings-rose-unexpectedly-to-7-4-million-in-april-another-sign-the-american-labor-market-remains-resilient/", "title": "Us Job Openings Rose Unexpectedly To 7 4 Million In April Another Sign The American Labor Market Remains Resilient", "content": "Watch Live TV Schedule NewsNew Mexico NewsAlbuquerque MetroSanta Fe & Northern New MexicoFour CornersSoutheast New MexicoSouthwest New MexicoUS HeadlinesInternational NewsNew Mexico Politics4 InvestigatesMissing PiecesWhat the Tech? KOB 4 Eyewitness Contact UsContact KOB 4 Eyewitness NewsNewsletterKOB 4 AppsNews TipsNominate someone for Pay it 4wardLove 4 Pets PhotosOur TeamCareersAdvertising 4 Links WeatherWeather ForecastWeather AlertsKOB 4 Weather AppInteractive RadarClosings & DelaysYou Asked 4 It SportsKOB 4 SportsHigh SchoolsUNM LobosSports Poll TrafficTraffic MapAlbuquerque I-25 Traffic CamerasAlbuquerque I-40 Traffic CamerasNorthern New Mexico Traffic CamerasKOB 4 Skycams CommunityPay it 4wardLove 4 PetsDIY Friday with DanielleEye on New MexicoHeart of New MexicoTrue HeroesNew Mexico MomentKOB 4 KidsEvents Balloon Fiesta **US job openings rose unexpectedly to 7.4 million in April, another sign the American labor market remains resilient** WASHINGTON (AP) — US job openings rose unexpectedly to 7.4 million in April, another sign the American labor market remains resilient. WASHINGTON (AP) — US job openings rose unexpectedly to 7.4 million in April, another sign the American labor market remains resilient. WASHINGTON (AP) — US job openings rose unexpectedly to 7.4 million in April, another sign the American labor market remains resilient. Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Watch Live TV Schedule News KOB 4 Eyewitness Contact Us 4 Links Weather Sports Traffic Community Balloon Fiesta FCC Applications Public Files Terms of Use Contest Rules DMCA Notice Careers Hubbard Television Group Privacy Policy Any person with disabilities who needs help accessing the content of the FCC Public File may contact KOB via ouronline formor call 505-243-4411. This website is not intended for users located within the European Economic Area.©KOB-TV, LLCA Hubbard Broadcasting Company KOB Follow KOB Follow **KOB Follow** KOB Follow **KOB Follow** **KOB Follow**"}