{"id": 501, "name": "Frontiers in Arachnid Science", "domain": "frontiersin.org/journals/arachnid-science", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/arachnid-science/articles/10.3389/frchs.2025.1544428/full", "title": "Arachnid Science", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Arachnid Morphology, Systematics and Evolution Arachnid Diversity, Conservation and Biogeography Arachnid Ecology and Behavior Arachnid Genetics and Biomaterials Arachnid Microbiota and Diseases Arachnid Toxinology and Biochemistry Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Arachnid Morphology, Systematics and Evolution Arachnid Diversity, Conservation and Biogeography Arachnid Ecology and Behavior Arachnid Genetics and Biomaterials Arachnid Microbiota and Diseases Arachnid Toxinology and Biochemistry Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Arachnid Morphology, Systematics and Evolution Arachnid Diversity, Conservation and Biogeography Arachnid Ecology and Behavior Arachnid Genetics and Biomaterials Arachnid Microbiota and Diseases Arachnid Toxinology and Biochemistry Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office SYSTEMATIC REVIEW article Front. Arachn. Sci., 15 April 2025 Sec. Arachnid Morphology, Systematics and Evolution Volume 4 - 2025 |https://doi.org/10.3389/frchs.2025.1544428 This article is part of the Research TopicHorizons in Arachnid ScienceView all 7 articles **Spiders as superhosts and secondary kleptoparasites** 1Faculty of Life and Environmental Sciences, University of Iceland, Reykjavik, Iceland 2Department of Entomology, National Museum of Natural History, Smithsonian Institution, Washington, DC, United States Kleptoparasitism, broadly defined, is thetheft of extrinsic resources resulting in potential cost to the host. The stealing of resources, often food gathered by another, is perhaps best known in birds and mammals, but is even more common and widespread in arthropods like ants, bees, flies and spiders. Spiders are involved in myriad kleptoparasitic interactions, best studied as obligatory kleptoparasites of other spiders. However, less attention has been paid to the critical role of spiders as “superhosts” to commensal and kleptoparasitic organisms, and their variety of facultative kleptoparasitic strategies. To understand obligatory kleptoparasitism in spiders, it is first necessary to examine their role and characteristics as hosts and as facultative kleptoparasites. Most spider kleptoparasites utilize other spiders as hosts, a link that is not coincidental, and facultative resource stealing, in its many forms, is generally assumed to provide an evolutionary bridge to obligate kleptoparasitism. Here, I provide a brief review of these two roles through a summary of literature on all kleptoparasitic spiders and over 200 hosts. The phylogenetic distribution of spider hosts is distinctly non-random, involving about 200 species, in 86 genera, and 23 families. These then pertain to a few select lineages, out of total spider diversity: 23/136 families, 86/4,427 genera, and 200/52,765 known species. The vast majority of argyrodine hosts belong to four Araneoidea families (Araneidae, Nephilidae, Theridiidae, Linyphiidae), while the majority of hosts of mysmenid kleptoparasites are mygalomorphs, mostly Dipluridae and Ischnothelidae. Key spider hosts likeNephila,Trichonephila,Argiope,Cyrtophora, andLinothele, build large, often structurally complex, and persistent webs. Three-dimensionality, often in the form of auxiliary webbing, provides safe refuges for kleptoparasites, and the abundant prey and extended prey handling time of large spiders provide resources and opportunities for theft. Many of the favored hosts either interlink webs or are social. Key host traits to counter kleptoparasitism include web takedown and relocation, food concealment, and direct aggression. Facultative resource stealing in spiders includes web takeover, male kleptoparasitism of females in webs, and opportunistic prey theft. Among these, kleptotany, the facultative abandonment of own web and the invasion of a larger host web, to steal it and/or to prey on the host (araneophagy) are the most likely to link to obligatory kleptoparasitism. **1 Introduction** **1.1 Kleptoparasitism and kleptoparasite hosts** Kleptoparasitism is typically characterized by resource theft that comes at a cost to the host (Vollrath, 1987;Elgar, 1993;Iyengar, 2008). Scrounging may refer to individuals benefiting from food remnants left or ignored by the host, without direct conflict or the overt act of stealing valuable resources. Such behavior can occur in a social context and be tolerated or even cooperative. Yet, the apparent distinction between scrounging and kleptoparasitism is blurred, e.g. by the dynamic nature of many such foraging systems where the potential cost to the host ranges from negative to none (Trager et al., 2010,Figure 1) to potentially positive (Peng et al., 2013). When resources are limited the value of food items increases so that any theft may come at some cost. The same species may interact in environments, or during seasons, where resources are abundant, and resource theft may occur less aggressively and have negligible impact on the host´s energy budget. I emphasize kleptoparasitic systems wheretheft of extrinsic resources results inpotentialcost to the host. As pointed out byCoyle et al. (1991)while direct cost can be small and difficult to measure, even a single interruption where an invader distracts a host momentarily from feeding represents a potential cost to the host. As such, kleptoparasitism is usefully delimited from other forms of species-interactions that center on exploitation of innate properties of individuals (such as parasitism and predation) or involve intimate association of species that may be aggressive (competition over non-secured resources), or where species cohabit with neither player incurring even potential cost from overlapping resource use (commensalism, mutualism). The primary goal here is to set the stage for understanding the origin and evolution of obligatory kleptoparasitism and the ecological context that may render this strategy successful in the long term as anevolutionarily stable strategy. Pivotal to this endeavor is to examine facultative kleptoparasitism as a strategy that is often presumed to precede—or be transitional to—the evolution of obligatory kleptoparasitism. It is also critical to understand the nature of hosts, whose relatively close relationships to kleptoparasites in numerous organisms (Wheeler, 1901;Iyengar, 2008) are not coincidental, but integral to the success of the strategy (a generalized form of Emery´s rule,Emery 1909). Figure 1. The cost of resource theft to the ´host´ varies dramatically across systems and can be challenging to estimate. Top: when hosts and kleptoparasites are comparable in size, the cost is high. Hyenas form packs that can sometimes steal prey captured by lions. The cost to the host is obvious and significant: a lion will risk fighting over the prey with potentially harmful consequences and may lose prey that is challenging to capture. Bottom: When kleptoparasites are tiny compared to the host their impact may be marginal. Left: a tiny argyrodine spider with the toweringTrichonephilahost in the background that as adults are over 100x its mass. Lower right: kleptoparasitic milichiid flies soak up some digestive fluids from the prey of a crab spider. The individual consumption of these small kleptoparasites has negligible impact on the host but collectively, over time, and in circumstances of low food availability, they still have thepotentialto reduce the host’s fitness. Top, artwork modeled on a wirestock photo, lower left by I. Agnarsson, lower right by Jay Taylor. For kleptoparasites, resource theft may conserve energy that would otherwise be spent in foraging while simultaneously avoiding exposure to potentially hazardous prey or predators (Vollrath, 1987;Elgar, 1993;Iyengar, 2008). From the perspectives of the host, the cost of kleptoparasitism ranges from sublethal/lethal to minimal, even putatively positive, temporarily, and under certain circumstances. The potential cost and the long-term interaction of kleptoparasite and host, regardless, is expected to result in an arms race and the evolution of adaptive traits in the host to respond to kleptoparasite selection pressures. **1.2 The scope of this review** I initially envisioned this invited review as an opportunity for a comparative synthesis of kleptobiosis across the tree of life—through the eyes of spiders. During months of effort, I gradually started to appreciate the gargantuan size and challenge of such a task. On the one hand, inordinately vast literature must be surveyed that offers a great wealth of information on different taxa and strategies. On the other hand, despite its volume, the literature is incredibly sparse on the most pertinent data needed for such meta-analyses, namely phylogenetic context. As for most lineages, this information is also largely lacking for spiders (but seeSu and Smith, 2014). I therefore shifted my focus to a synthesis of kleptoparasitism involving spiders, but this too turned out to be elusive. Spiders are involved in a great variety of kleptoparasitic interactions both as hosts to a great variety of kleptoparasitic lineages, as well as containing many species involved both in facultative as well as obligatory kleptoparasitism (Table 1;Supplementary Table S1). The scope of this paper is therefore focused on providing a platform for understanding obligatory kleptoparasitism through a review of spiders as hosts to kleptoparasitic groups, including facultatively kleptoparasitic spiders. I highlight some of the ways in which spiders are unique and important hosts for multiple lineages of kleptoparasites, defensive host strategies, and the variety of opportunistic kleptoparasitism seen across the order. Facultative kleptoparasitism is probably extremely widespread in spiders, with scattered records that I attempt to summarize. Araneophagy through web invasion is seen in several lineages, perhaps best known in salticids likePortia. Such behavior has been reviewed before (e.g.Jackson, 1986) and does not seem to be explicitly linked to kleptoparasitism in general, with the possible exception of the argyrodine theridiids where both traits occur. Therefore, I offer a brief overview to summarize the variety of web invasion behaviors in spiders, with emphasis on those that may be linked to the origin and evolution of kleptoparasitism. Table 1. Known hosts among spiders (seeSupplementary Table S1for detail). Are there emerging shared patterns in the evolutionary ‘pathways’ to obligate kleptoparasitism across the countless independent evolutionary origins of kleptoparasitism? This question is challenging to answer and to do so properly, requires phylogenetic comparative meta-analyses that will not be attempted here and may be as yet unachievable given scattered phylogenetic knowledge of the various lineages. An obvious and often cited hypothesis is that obligatory kleptoparasitism has transitioned from facultative kleptoparasitism (Iyengar, 2008;Breed et al., 2012). Such a route where opportunistic resource theft as a part of a broader foraging strategy can act as an evolutionary bridge to obligate kleptoparasitism is intuitively appealing. Candidate examples may come fromKoptothripsthrips initially utilizing damaged galls then moving to actively usurping intact galls (Crespi and Abbot, 1999),Lestrimellitastingless bees gradually losing pollen-gathering structures to become reliant solely on stolen food (Breed et al., 2012), sphaerocerid flies that range from facultatively stealing food from scavengers like dung beetles to specialized reliance on host (Sirvinski et al., 1999), andRanzoviusbugs that belong to a lineage containing many facultative kleptoparasites but where some species have become entirely reliant on their social spider hosts to capture prey (Henry, 1984;Wheeler and McCaffrey, 1984). In other cases, like spiders, such a transition between facultative and obligate kleptoparasitism is not obvious given the evidence at hand. Another hypothesis that may be specific to spiders suggests an evolutionary link between stealing from or predating on a host, though the direction of such transition is debated, and in fact, this link has not been clearly established (but seeSu and Smith, 2014, and below). Kleptoparasitism exemplifies the complex interplay between ecological opportunity, behavioral flexibility, and evolutionary adaptation. This versatile strategy has evolved independently across diverse taxa implying important ecological function and fitness consequences favored by natural selection. Below I provide the groundwork necessary to further our understanding of obligatory kleptoparasitism in spiders. **2 Spider superhosts: webs provide refuge and resources** **2.1 Spider webs as habitats** Spider webs vary greatly in their size and web tenacity (Eberhard, 2020). Larger and more permanent webs may form habitats for a variety of arthropods, including other spiders (Figure 2). Webs provide a stable environment rich in resources such as shelter, prey remnants, and protection from environmental extremes (Eberhard, 2020), attracting a range of organisms that engage in complex interactions with their spider hosts.Proctor (1992), for example, discussed the co-inhabitants in colonialCyrtophora moluccensiswebs in Moorea, French Polynesia. In fiveCyrtophoracolonies she found five additional spider species whose combined abundance far outnumbered the host spiders. These included web builders usingCyrtophorawebs as support, as well as the kleptoparasiticArgyrodes argentatusand the likely araneophagicPlatnickina adamsoni. Social spider webs form an even more diverse habitat, for example the webs ofAnelosimus studiosuscan contain numerous other spiders, and a range of other arthropods (Deyrup et al., 2004;Perkins et al., 2007;Mock, 2008), andJani et al. (2023)reported 21 spider species and many other arthropods and even vertebrates making the webs of socialStegodyphus sarasinorumtheir home. Further, in a survey of about 80 nests of subsocialAnelosimusin Madagascar Magnússon and Agnarsson (unpublished) found over 130 arthropod species associated with these nests. Figure 2. Spider webs are hosts for a variety of kleptoparasites. Here, aTrichonephilafemale sits at the hub of her web, feeding on prey. On her and the prey (inset lower left) kleptoparasitic flies share her prey. A wasp (left) and a hummingbird (right) may steal prey, and the latter also silk for its nest, from her web. Various obligatory kleptoparasite species (inset above and lower right) are constant guests in her web, gleaning insects, and prey packages, feeding with her, or on her juveniles. On the left side of the web, a hole has been cut out by a kleptoparasite, removing prey from the web.Artwork is a conceptual reproduction of figure 97 inVollrath (1987). The inhabitants of spider webs are varied. Some species, including certain beetles and lepidopteran larvae, act as scavengers, consuming waste materials and leftover prey within the web. InPhryganoporus candidusnests, scavengers like mealybugs thrive, benefitting from the sheltered environment and sometimes aiding in nest sanitation by breaking down waste​ (Downes, 1995). Some insects and spiders simply seek shelter in the nests of social spiders, while ants, wasps, assassin bugs, and other predatory insects have been documented as significant predators, sometimes killing spiders and stealing egg masses. Predatory wasps, for example—while not kleptoparasitic—invade host webs and have a major impact onMetepeira incrassatacolonies (Uetz et al., 2002). As discussed below, in addition to opportunistic predators, many types of kleptoparasites are also attracted to this community thriving in a prey capturing abode. **2.2 Ecology and biogeography of spider webs as islands** Spider webs function as fascinating examples of “habitat islands”, uniquely structured and highly distinct and quantifiable ecosystems (Blackledge and Gillespie, 2002;Blackledge et al., 2011) that support various forms of life, notably among them, kleptoparasitic spiders (Elgar, 1989;Agnarsson, 2003). Spider webs resemble islands in the isolation of habitat, patchily dispersed within a matrix of strikingly contrasting habitats (Agnarsson, 2011). Therefore, general ecological models used for island biogeography and metapopulation biology (MacArthur and Wilson, 1967;Hanski, 1997) are applicable to spider webs as habitats. For kleptoparasites, host webs like those of golden orbweavers (Nephila,Trichonephila), are attractive due to their size, tenacity, and predictable provision of essential resources (Elgar, 1989;Grostal and Walter, 1999). Similarly, due to the size and ease of discovery and measurement, webs of golden orbweavers are a convenient system to study ecology, such as how kleptoparasites are distributed among ‘islands.’ Studies on nephilids (Robinson et al., 1973;Elgar, 1989;Grostal and Walter, 1997,1999,Agnarsson, 2003,2011), and other types of host webs (Cangialosi, 1990a,b,Rypstra and Binford, 1995) have clearly established that web size is the best predictor of kleptoparasite load (Su et al., 2021).Fernandez-Fournier and Avilés (2018)also showed that kleptoparasite diversity increases with web size across four different solitary and social host species, andMcCrate and Uetz (2010)showed that the number of Argyrodinae kleptoparasite species increases with size of colonies made up byMetepeira incrassataand associated web builders. This is expected as large webs both contain more silk, and thus areas to occupy, and intercept more prey resulting in a relatively high-quality kleptoparasite habitat (Gregorič et al., 2021,2024). What is intriguing is the scalability of the system—how abundance scales precisely with size (Agnarsson, 2011;Gregorič et al., 2024), down to some ´minimum´ size where kleptoparasites are generally absent (Agnarsson, 2002;Miyashita, 2002;Whitehouse et al., 2002). Thus, total host web area in a given region or habitat can approximately predict the expected number of spider kleptoparasites. Another interesting result from these studies is that a) while web clustering and interconnectedness—a common feature of many nephilid species—facilitate immigration and stabilization of kleptoparasite populations (Agnarsson, 2003,2011), b) even highly isolated webs have kleptoparasite abundances proportional to their size (Gregorič et al., 2024). This suggests that habitat quality trumps connectivity when individuals freely distribute according to resources and implies that isolation is not limiting in the distribution of kleptoparasites. Spider kleptoparasites therefore seemboth adept at locating host webs and highly mobile. Accordingly, it has been shown that the distribution of kleptoparasites among host webs closely follows the Ideal Free Distribution model, where the free movement of individuals leads to an equilibrium in habitat occupancy in relation to suitability (Elgar, 1989;Agnarsson, 2003,2011,Gregorič et al., 2024). The ability of kleptoparasitic spiders to detect and evaluate habitat islands suggests the use of airborne cues, likely pheromones produced by the host (Agnarsson et al., 2025), to locate suitable patches. In conclusion, spider webs provide a compelling model for studying habitat islands and the ecological relationships they support. Through examining the relationship between orb weavers and their kleptoparasitic guests, we can gain a deeper understanding of how patch quality and connectivity shape community dynamics in isolated habitats (Agnarsson, 2011;Gregorič et al., 2024). The preference of kleptoparasitic spiders for larger webs, coupled with their impressive dispersal capabilities, demonstrates that for organisms in isolated ecosystems, the availability and quality of resources are paramount. Habitat islands, whether they are spider webs or isolated forest patches, illustrate the complex interactions between organisms and their environments, offering valuable insights into abundance distributions and resilience of ecological communities. **2.3 Web building spiders as ideal hosts for kleptoparasites** Spider webs provide a diverse habitat for a variety of organisms (Figures 2,3and text above) that alone makes them attractive to other foragers. The efficacy of these prey catching devices further renders them a predictable source of insect cadavers and the sedentary nature of web-building spiders creates a stationary and accessible resource for kleptoparasites (Vollrath, 1987;Eberhard, 2020).Vollrath (1984)suggests that web spiders are vulnerable to kleptoparasitism because they cannot run away or hide food. Web building spiders, furthermore, may capture both large prey that require extended handling times and more prey than they can consume at a given time, requiring storage within the web (Champion de Crespigny et al., 2001). Additionally, spiders lack mandibles and generally do not chew on prey but rather inject venom and digestive enzymes into the prey. The prey is thus partially digested externally and spiders feed exclusively by sucking up the digestive juices (Foelix, 1982). Combined, the prolonged prey handling, availability of predigested stored prey in the web, and slow absorption of food from the prey by the host, all represent excellent opportunities for kleptoparasitic organisms to join in feeding with the host or steal its wrapped prey items (Table 1;Supplementary Table S1). In addition, while spider webs are not well characterized as sieves (Eberhard, 2020) their design, even if well-tuned to capture ´optimal´ prey, inevitably results in the by-catch of some very small insects that may not be important food source for the host. This presents an additional opportunity for kleptoparasites that are typically many times smaller than the host spider (regardless of developmental stage of either) or for whom such prey items represent valuable resources. It is no wonder then, that individual webs or colonies attract a great diversity of kleptoparasites, ranging from birds, large hymenopterans and scorpionflies, to tiny ants and ´freeloader´ flies, in addition to the specialized spider kleptoparasites likeArgyrodes(Thornhill, 1975;Nyffler and Benz, 1980;Vollrath, 1987;Henschel, 1998;Sivinski et al., 1999). Figure 3. Key spider hosts.(A–D)the most important hosts of argyrodine kleptoparasites.(A–C)Nephilidae.(A)Nephilingis lividafemale and B, her large orb web (c.a. 1m in total length).(C)The mother of all hosts,Trichonephila clavipes, sitting on her golden orb.(D)Cyrtophora citricolaweb, representing the second most affected host lineage. Note the abundant auxiliary webbing above and below the horizontal orb.(E)Linothelesp. female sitting in her retreat, leading to her brushed sheet web—the favorite home of mysmenid kleptoparasites.(D)is reproduced from Cyrtophora.citricola.net.7626.jpg in Wikipedia commons under Creative Commons Attribution-Share Alike 2.5 Generic.(E)is by Bastian Drolshagen, reproduced with permission from the author. Spiders are potentially dangerous hosts, but large spiders may pay limited attention to smaller organisms in their webs, if they are not struggling or sending other similar vibratory signals to the web owner (Vollrath 1979b,1987). While large spider webs thus attract a number of kleptoparasite species from diverse arthropod groups, the most numerous and speciose kleptoparasites in spider webs are other spiders. As pointed out byVollrath (1987p. 277) ´[t]he spider web is a very special structure in terms of material, configuration and information transmission. It is not surprising that web spiders are the most successful inquilines in spider webs (Brignoli, 1966), since they are superbly preadapted.’ In other words, spiders know how to operate spider webs and spider kleptoparasites can move about in webs stealthily and without becoming stuck on the sticky capture spiral of many of the hosts. Non-spider kleptoparasites that inhabit spider webs are, in fact, most common in webs that do not contain sticky silk, particularly in the webs of subsocial and social spiders that tend to show more tolerance toward other web inhabitants, many of which are, of course, their kin. Kleptoparasites may impose significant costs on spider hosts. While some scavengers may only consume leftover prey, kleptoparasites often remove entire prey items, reducing the spider’s available resources (Henschel and Lubin, 1992;Vollrath, 1987). In some cases, kleptoparasites like ants or certainArgyrodesspecies also attack spider broods or egg sacs, increasing their impact on spider populations (Schneider and Lubin, 1997;Agnarsson, 2002). The persistent threat of kleptoparasites and predators has led to the evolution of several adaptive responses in spiders. Spiders likeStegodyphus lineatusexhibit defensive behaviors to reduce the risk of ant raids, such as altering web structure or abandoning heavily invaded areas (Henschel, 1998;Rypstra, 1981). Hosts may also relocate webs when kleptoparasitic pressure becomes unsustainable (Rypstra, 1981;Whitehouse, 1997a) offering short term respite from kleptoparasite activities (Robinson et al., 1973). In sum, while spiders are potentially dangerous hosts as major arthropod predators that have evolved various means of countering kleptoparasitism, spider webs offer many advantages making them an ideal host to other organisms, among which kleptoparasites are typically most abundant. **2.4 Characteristics and phylogenetic distribution of spider hosts** Even a cursorial look at the distribution of kleptoparasitic hosts across the spider phylogeny reveals a starkly non-random pattern (Figures 4–6). The inset figure on the left side shows in broad strokes that hosts are not spread proportionately across all spider diversity. A total of about 200 hosts have been recorded, including approximately 200 named species, 88 genera, and 23 families, a tiny fraction of spider diversity (Figures 5,6). But even among these, the distribution of the most critical hosts—those home to the majority of kleptoparasites—is non-random. Rather, as depicted inFigure 4, preferred kleptoparasite hosts, labeled in bold and green font, are concentrated in relatively few genera within a small subset of web-building spiders. These key hosts exhibit unique characteristics—large, often structurally complex, and persistent webs—that make them particularly suitable for kleptoparasitic exploitation (Exline, 1945b;Vollrath, 1984,1987,Elgar, 1993;Whitehouse et al., 2002;Whitehouse, 2011). Kleptoparasitic hosts are disproportionately found among large sheet or funnel web spiders like web building mygalomorphs (Dipluridae, Ischnothelidae) and RTA clade spiders (Agelenidae, Pisauridae, Psechridae, Tengellidae), and among orbweavers (especially Nephilidae andCyrtophora, but also in large Araneidae, Theridiidae, and Linyphiidae). Within these families, key genera likeDiplura,Linothele,Ischnothele,Agelena,Psechrus,Nephila,Trichonephila,Argiope,Cyrtophora,Latrodectus,Linyphiaand a few other araneoids emerge as primary hosts for kleptoparasites, through sharing some key traits. All buildlarge webs, in absolute terms and certainly relative to confamiliars, that arelong lasting, either in being in constant construction and repair (mygalomorphs, RTAs,Cyrtophora,Latrodectus,Linyphia), undergoing only partial reconstruction (Nephilidae), or webs that are reconstructed with high site fidelity (Argiope,Gasteracantha). Most of these webs are3-dimensionalin primary architecture, or throughauxiliary webbingin the form of voluminous non-capture areas, either elaborate retreats where the host gets protected rest, or ´barrier´ webs that may serve to slow down prey or as protection against flying predators and parasitoids. The auxiliary webbing in these non-capture areas provides an excellent refuge for kleptoparasites where they can stay in contact with the prey capture web, but outside the prey monitoring zone of the host. In most cases, preferred hosts are alsolarge spidersat least relative to the kleptoparasites. It is easier for a small kleptoparasite to go about unnoticed in a large host web, and some of the prey that gets stuck in large webs is so small as to be ignored by the host but represents an important meal for the kleptoparasite. Large prey items caught by large spiders may requirelong prey handling times, and excess capture results inprey storing, both of which provide additional opportunities for kleptoparasites (Champion de Crespigny et al., 2001). Finally, the most important host species tend to buildclustered websthat may even be interconnected. For example,TrichonephilaandCyrtophoraare the two genera that are hosts to the greatest diversity and highest abundances of kleptoparasitic spiders (Table 1;Supplementary Table S1). Both construct expansive orb webs that epitomize the key traits of ´good hosts´, though nevertheless, they are architecturally strikingly differentas orb webs.Trichonephilabuilds a huge ´modified´ vertical orb (Kuntner et al. 2019) with extensive barrier webbing, especially as juveniles, whileCyrtophoraconstructs a horizontal modified ´sheet like´ orb with extensive vertical network of dense threads that intercept the flight of insects (Figure 3). Both tend to build webs in close proximity to others, frequently forming interconnected web clusters that may span significant areas. Aggregated webs provide large “arenas” where kleptoparasites may freely wander among multiple provisioning hosts, supplying rich prey capture opportunities and ample shelters. The large-scale composition of colonies inherently diffuses the host’s vigilance, creating a spatial limitation in policing and guarding resources effectively across the colony ​ (Vollrath, 1984;Elgar, 1993)​. Clustered webs may also capture more prey, due for example to ´richochet effects´ (Uetz, 1989). The ultimate spider aggregations are found insocial spidersconstructing large communal webs housing hundreds or thousands of individuals (Avilés, 1997). It is no surprise then that social spiders complete the list of the most important host species for kleptoparasites (Vollrath, 1987;Cangialosi, 1990a,b,c;Straus and Avilés, 2018,2023).StegodyphusandAnelosimus, in particular, contain many social species all of which host kleptoparasites that in some cases are specialists, likeArgyrodes ululansonAnelosimus eximius(Cangialosi, 1990a,b, –,1991) andArchaeodictyna ulovainStegadyphuswebs (Griswold and Meikle, 1987).Faiditus subdolusalso appears to prefer communal webs, hitherto found only in the nests of socialTheridion nigroannulatum(Avilés et al., 2006) and the colonialPhiloponella oweni(Smith Trail, 1980). Some particular traits of social spiders, in addition to web size, complexity, and permanence, are conducive to spider kleptoparasitism. Social spiders have generally reduced levels of aggression as—unlike typical solitary spiders—they must tolerate conspecifics sharing the web (Avilés, 1997;Agnarsson, 2002;2004). Communal web-building and resource sharing also translates to reduced individual control over web sections and increased ´noise´ levels in the web, making it harder to detect invaders who are apt at navigating silk. Perhaps as a consequence of decreased host detection, kleptoparasites in social webs tend to be closer in size to the host spiders than kleptoparasites in solitary webs. As outlined above, social spiders are also favored hosts among non-spider kleptoparasites. Figure 4. Phylogenetic distribution of major spider host species, obligate kleptoparasitic spiders, and theridiid araneophages. The inset figure highlights that both kleptoparasites and their hosts are clustered on certain branches unrelated to patterns of total species richness within the tree. This distribution indicates that while many spiders are web-builders, only a subset has evolved the necessary web traits to support kleptoparasitic lifestyles effectively (see alsoFigures 5,6). This narrow host range likely reflects the stringent requirements that kleptoparasites have for host web characteristics—namely, webs that provide sustained resources, cover, and minimal interference from the host. It is notable, also, that kleptoparasitism is clustered within Theridiidae and symphytognathoids, even though multiple origins are implied. Hosts in bold appear to be the most important in terms of number and abundances of kleptoparasites in their webs. Species number (species#) indicates diversity of kleptoparasites (kl) and araneophages (ar). The phylogeny is an interpretive reconstruction of relationships within Theridiidae fromLiu et al. (2016), while broader fundamental structure is fromWheeler et al. (2017)andKulkarni et al. (2023). The putative placement of Nicodamidae and relationships within Araneoidea, especially the monophyly and interrelationships among ´symphytognthoids´ reflect the stronger character set ofKulkarni et al. (2023).Gushangzaois tentatively placed among hadrotarsine theridiids, as proposed byLin et al. (2024). Figure 5. The number of kleptoparasite species associated with major spider clades. The majority of kleptoparasite species are associated with spiders building large and long lasting webs: primarily Entelegynae but also Mygalomorphae. In Entelegynae, araneoid spiders are hosts to the highest number of kleptoparasite species. The most prolific among those are the classical hosts in Nephilidae building large orbs with extensive barrier webs, along with the araneidCyrtophorabuilding complex horizontal sheets with extensive auxiliary webbing, and the social theridiids (Anelosimus) and eresids (Stegodyphus) (seeFigure 6for detail). Among mygalomorphs, the vast majority of kleptoparasites are found in two genera making large brushed sheets,LinotheleandIschnothele. Figure 6. The total number of kleptoparasite species that have been documented associated with different spider families (only the most important host families labeled, seeTable 1;Supplementary Table S1for detail). The non-random distribution of hosts among spiders is evident. The ´superhosts´ belong to families representing a small portion of total spider diversity: Araneidae (6%), Theridiidae (5%), Nephilidae (0.1%), Dipluridae (0.3%), and Eresidae (0.2%). Thus, for example, about 25% of kleptoparasite species are associated with the tiny Nephilidae. Linyphiidae have about as many associated kleptoparasites as expected by their relative species diversity (9.4%), while most families, and the vast majority of spider genera and species have not been documented as hosts to kleptoparasites. Even within the key host families, a tiny fraction of the genera and species are important hosts, as highlighted by the number of kleptoparasites found documented from key genera in each of the major host families (gray subtext to family names). Indeed, the overwhelming majority of host records come from species making large, complex, and long lasting 3-dimensional webs—1) horizontal (Cyrtophora) or vertical (e.g.Trichonephila) orbs with extensive barrier webs, 2) expansive silk networks of social spiders (Anelosimus,Stegodyphus), 3) ´irregular´ sheets with swaths of very numerous silk lines (brushed sheets) containing a distinct retreat tunnel (Linothele), and 4) horizontal sheet webs with extensive auxiliary webbing above (Orsonwelles). Note that, commonly, kleptoparasite species are found in the webs of more than one family, though most of the kleptoparasite species that chose Dipluridae hosts (most mysmenid kleptoparasites) are exclusive to them. While preferred spider hosts share many traits, the stark divide in host use between argyrodine and ´symphytognathoid´ (Mysmenopsis,Isela,Curimagua) kleptoparasites is intriguing and suggests we have a very partial understanding of host choice. The mygalomorphsDipluraandLinotheleconstruct brushed sheet-like webs that span the ground or other surfaces and are key hosts for a clade of symphytognathoid kleptoparasites (excludingSofanapsis) but are rarely used by argyrodines. In turn, symphytognthoids are relatively rarely found in orb webs suspended above the ground that are favored by argyrodines. Thus, it seems that the even ´good hosts´, as characterized above, building large, complex, and permanent webs, are not simply a free-for-all. Effective utilization of a given host type may require some adaptations. That two monophyletic lineages (argyrodines and mysmenids) have diverged to specialize on these different web types —sticky orbs vs mechanical (non-sticky) sheet and funnel webs, respectively--begs adaptive questions. It remains to be seen if we can identify traits that differ between argyrodine and symphytognathoid kleptoparasites and may help explain this division in host use. Certainly, certain kleptoparasite behaviors may be orb-web specific like silk consumption (spiders have not been documented consuming aciniform silks, used in the sheet of Diplurid webs) and stealing wrapped prey items. However, in both cases kleptoparasites feed with the host, possibly the primitive foraging mode of spider kleptoparasites. Curiously, the other symphytonathoid kleptoparasite, the anapidSofanapis, is highly unusual in preferring host rarely used by the other two clades. It seems to prefer austrochilid hosts, while also found in the webs of Hahnidae, in addition to occurring in some classical orb webs. Regardless,Sofanapisdisplays the putatively primitive foraging mode of feeding with the host. Of identified species, the host to the highest number of kleptoparasite species is probably also the best studied, the AmericanTrichonephila clavipeswhere 21 species of mostly argyrodines have been documented (Table 1;Supplementary Table S1). While vastly less effort has been afforded to other nephilids as host, other species likeT. inaurata,T. clavata, andNephila pilipesare known to harbor multiple species of kleptoparasites (Table 1;Supplementary Table S1).Whitehouse et al. (2002)suggested a special importance of Nephilidae hosts globally, and field biologists certainly can confirm that large nephilid webs, as a rule, house multiple argyrodine individuals. In addition toNephilaandTrichonephila, largerNephilengysandNephilingiswebs are rarely without kleptoparasites, that may also be found inHerennia.Cyrtophora citricola, and otherCyrtophoraare similarly critical hosts harboring high abundances and numerouse species of kleptoparasites. These two groups seem to be the preferred hosts of the majority of argyrodine kleptoparasites, with some clear exceptions (Table 1;Supplementary Table S1), however, systematic research on kleptoparasite distributions and assembly into host webs is generally lacking. The tight link betweenLinothelemygalomorphs andMysumenopsiskleptoparasites has become particularly clear recently with the effort ofDupérré and Tapia (2015,2020), but again, almost no research on host choice and assembly into host webs exists on mysmenid kleptoparasites. **2.5 Deferred hosts** In contrast to the groups discussed above, the majority of web building spiders rarely host kleptoparasites and thus appear to be deferred hosts—that is their webs have much lower kleptoparasite loads than predicted based on web size. While many knowledge gaps exist and new research constantly adds to the list of kleptoparasitic species and their hosts, a ´list´ of deferred hosts among web building spiders would be very long, approximately the inverse of hosts listed inTable 1(see alsoSupplementary Table S1). Even some found inTable 1, species thatare utilizedas hosts, are clearly deferred. For example spiders in the genusLeucaugeare among the most common orbweavers in many habitats (own obs.). Yet they rarely contain kleptoparasitic spiders. In fact, many of the records ofLeucaugeas a host come from a study whereMcCrate and Uetz (2010)failed to find kleptoparasites in its webs, unless in multi-species colonies of web-builders associated with the colonialMetepeira incrassata. In some areasLeucaugewebs are generally without kleptoparasites but may serve as interim hosts during seasons when preferred hosts are not available (Miyashita, 2002).Miyashita (2002)foundArgyrodes bonadeaandA. flavescensinLeucauge blandawebs in Japan but almost exclusively when preferred hosts (Nephila pilipesandTrichonephila clavata) were not in season. Regardless,Miyashita (2002p. 34) found thatL. blandahad “…significantly fewer [Argyrodes] … on their webs than expected from their web area”.Tetragnathaand other tetragnathids, most Araneidae genera, and nearly all small ‘‘orbicularians’’ (e.g.Cyclosa,Eustala,Mangoraetc.), are further examples of extremely common, diverse, and abundant orbweavers that rarely host kleptoparasites. Similarly, amaurobiids, most pholcids, mysmenids, and most theridiids, are examples of diverse web builders underutilized by kleptoparasites (Supplementary Table S2). In fact, the vast majority of species of web-building spiders are deferred hosts, likely including many entire families of spiders like Theridiosomatidae, Symphytognathidae, and other groups of small spiders. The vast majority of species in the most diverse web-building groups Linyphiidae and Theridiidae are also deferred. In the latter two, nevertheless, certain species rank among clearly preferred hosts. It is logically obvious that what characterizes deferred hosts is lacking some or most of the traits of preferred hosts. There are vastly more species of small rather than large web builders, which may more readily detect similar-sized invaders and compete more directly with them for food. The majority of orbweavers make small webs with little auxiliary webbing, renew webs daily, and may frequently relocate.Leucaugeare an exception in that their orbs are often associated with barrier webs, and indeed many kleptoparasites of many species have occasionally been found in their webs. However, these relatively small spiders are incredibly aggressive toward web intruders (Eberhard pers. comm.) which may explain whyLeucaugewebs seem mostly to be used as ´last resort´ hosts when preferred hosts are absent. Smaller spiders and webs capture fewer insects, are likely to have faster prey handling time, and less reason to store prey. Most web builders, furthermore, do not form interconnected clusters. In some cases, a single trait may separate preferred from avoided hosts. Large orbweavers have many attributes that are attractive to kleptoparasites, yet only a portion of them commonly host them, likely due to lack of certain critical traits. A point in case can be made regardingGasteracanthaandMicrathena. The two genera are diverse and highly similar as large, spiny, brightly colored spiders that build big and highly regular symmetric orb webs, in relatively open areas. Numerous species of argyrodines have been documented in a number ofGasteracanthaspecies that, at least in certain habitats, appear to be among the most important hosts. In contrast, kleptoparasites are rarely encountered inMicrathenawebs (except when associated with multi-species coloniesMcCrate and Uetz, 2010). While both genera remove webs at night and rebuild during the day, a key difference may be in what they do not remove.Micrathenaremoves the entire web leaving at most one or two lines whileGasteracanthaleaves up a number of frame lines that that are reused as frames the following morning (Eberhard pers. comm.). Such minor differences may suffice to allow kleptoparasites to more easily find webs or web remains at night and stay associated with host webs that are taken down but rebuilt in the same spot. **2.6 Hosts from the perspective of kleptoparasites** It is clear that host choice is not random. First, only a small subset of web building spiders seem appropriate hosts. Second, even among spiders that build relatively large and permanent webs, kleptoparasite diversity and abundance is concentrated in the webs of a few host species. But how decisively do kleptoparasites chose among ´acceptable hosts´? There is a range of opinion but limited data on kleptoparasite host specialization.Vollrath (1984p. 70), e.g. discussed argyrodines and claimed that ´[o]f the 50-odd neotropicalArgyrodestwo are presently known to be specialists, about ten to be generalists…´. Specialists are, he claims, in large araneids (Araneus,Cyrtophora,Argiope,Nephila), while generalists are found in multiple additional hosts (Vollrath, 1977). SinceVollrath (1984,1987) kleptoparasites are commonly referred to as either specialists or generalists in literature (e.g.Elgar, 1993;Whitehouse, 2011;Su and Smith, 2014). Yet the data at hand suggest a more subtle picture. In an extensive study of argyrodines (treated together under the genusConopisthaat the time) of Peru and Ecuador,Exline (1945bp. 506) stated ´There is no correlation between the various species ofConopisthaand species of their hosts. They inhabit indifferently webs ofGasteracantha,Argiope,Meta, andAranea[=Araneus], in localities where these orb weavers occur.’ Similarly, as more data are gathered, species that once were thought to be specialists, likeArgyrodes elevatus, have now been documented in a large sweep of hosts (Supplementary Table S2). On the other hand,Exline (1945bp. 506-507) discussed preferred and deferred hosts in general: ‘Some field observations on the relationships ofConopisthato host species may be important if correctly interpreted. In most areas where the genus is common, species of orb-weavers, includingMeta,Gasteracantha,Aranea,Argiope,Tetragnatha,Cyclosa, andLeucauge, are common.Conopisthanearly always is present in the webs ofMeta,Gasteracantha,Aranea, andArgiope, but almost never in webs ofTetragnatha,CyclosaorLeucauge. Spiders of the first groups, hosts ofConopistha, feed upon large insects—beetles, large flies, bees, and Orthoptera—and disregard the small prey in their webs. Orb-weavers which do not harborConopisthafeed on such minute insects as small flies, mosquitoes, and midges.’Exline (1945a,b)believed host choice was essentially random and that kleptoparasites survived and thrived when they happened to be in webs where they did not compete with the host for prey or fall prey to it. There is little evidence for host choice to be random, especially with respect to preferred and deferred webs in general. However, establishing true host specialization requires large amounts of data that simply do not exist for most species. Studies that have been made over a short period of time, in a particular region or season, or particular habitat, may find evidence suggesting specialization, while the strength of any proposed association with a particular host tends to break down as more data are added.Vollrath (1976,1977,1979b,1984), for example, suggested thatArgyrodes elevatusis a specialist on large hosts, principally found in webs ofTrichonephila clavipesandArgiope argentata, which is an expert in stealing food bundles from the hosts hub. Further studies on this species have found it utilizing a variety of host species, large and small. Thus, in stark contrast with Vollrath,Silveira and Japyassú (2012)instead considerA. elevatusto show extreme plasticity, employing diverse tactics to steal food from a great variety of hosts and web types. These includeNephilengys, variousArgiopeandAraneus, colonialMetepeira incrassataandCyclosa huila, subsocialAnelosimus baeza, as well as in solitary webs of theridiid spiders such asLatrodectus,Tidarren, andParasteatoda. What can we therefore claim about host specialization in argyrodine kleptoparasites? As proposed byAgnarsson et al. (2025)asking if one species is a specialist or a generalist is not a productive approach to understand the complex interplay between kleptoparasites and hosts. Rather “argyrodines may better be characterized as kleptoparasites generally capable of discriminating among host webs, but that choose hosts with varying degrees of astuteness or concern.” A more productive approach, therefore, will be to better assess kleptoparasite distribution and assembly into host webs at a community level, and the factors that impact host choice. In particular, what host traits do kleptoparasites cue in on and why do some species seem to choose hosts with greater astucity than others? **3 Diversity of organisms as kleptoparasites of spiders** **3.1 Non-spider kleptoparasites on spider hosts** A number of animals regularly exploit spider webs, ranging from commensals to kleptoparasites, to predators and parasitoids, depending on whether symbionts compete for the same resource and the manner of their foraging or reproductive strategy (Supplementary Table S3, Robinson and Robinson, 1977). Some arthropods may be purely commensal, such as mealybugs found inPhryganoporus candidusnests, or scavenging beetles that rummage leftover prey and waste (Downes, 1995), or lepidopteran larvae feeding mostly on plant material incorporated into the webs of social spiders. Kleptoparasites (Supplementary Table S3), in addition to other spiders, include species of hemipterans (Davis and Russell, 1969;Henry, 1984) panorpoid scorpionflies (Thornhill, 1975), lepidopteran larvae (Robinson, 1977), wasps (Jeanne, 1972), damselflies (Vollrath, 1977), numerous dipteran species of at least 10 families (Sivinski et al., 1999), rove beetles and other scavenging beetles, Cheyletidae mites, and other arthropods (Supplementary Table S1,Knab, 1915;Bristowe, 1931, 1941,Richards, 1953;Robinson and Robinson, 1977), and even birds, such as a hummingbird that steals both insect prey and silk (Young, 1971). Many of these are attracted to prey captured by the host spider or entangled in its web, others may be more generally predators in the host webs where they may prey on host or commensal spiders, their eggs or juveniles, or other arthropods in the web (Schneider and Lubin, 1997;Henschel, 1998). Ants, for example, enter webs and may steal prey from the web and/or prey on the host and its offspring (Schneider and Lubin, 1997;Henschel, 1998). Parasitoid wasps target host spiders, their eggs, or even other symbionts (Hieber and Uetz, 1990). Kleptoparasites that compete with spiders for prey, remove prey items secured by the spider, or feed with the host, clearly can negatively impact the hosts (Henschel and Lubin, 1992). Probably the majority of non-spider kleptoparasites in spider webs are facultative. Scorpionflies (Panorpidae) opportunistically enter webs to feed on captured prey (Thornhill, 1975). Other facultative kleptoparasites include damselflies (Zygoptera), apocritan wasps, and lepidopteran larvae that may occasionally steal prey from spider webs or use the web or webbing as nesting material (Jeanne, 1972,Robinson, 1977;Vollrath, 1977), and mites and beetles that scavenge on debris left by the host spider or consume parts of prey remains (Faust et al., 2012). Hummingbirds may occasionally use silk taken from spider webs as nesting material and grab prey items as they pass by (Young, 1971). The impact of facultative kleptoparasites can be difficult to evaluate. Secondary consumption on decomposing prey bodies or web-bound detritus, can be of no consequence to the host, or even beneficial if it results in effectively reducing waste within the web. Yet, all these taxa may remove resources with potential fitness consequences for the host spider. On the other end of the spectrum, there is clear evidence that facultative kleptoparasites can be very harmful to the host. Ants provide a stark example of harmful occasional kleptoparasites. When they wander into spider webs, they have the ability to recruit large raids of foragers that opportunistically steal resources and predate upon hosts (Schneider and Lubin, 1997;Henschel, 1998;Hölldobler and Wilson, 1998). As ants may continuously patrol a network of routes around their nests, they can pose a persistent and ominous challenge to web building spiders (Henschel, 1998;Hölldobler and Wilson, 1998). Furthermore, ants likeVeromessor pergandei,Oecophylla smaragdina, andAnoplolepis gracilipescan not only steal prey and forage on egg sacs but may also dismantle spider webs e.g. to salvage trapped nestmates. Many groups then rely mostly on kleptoparasitism, where spiders may be among their hosts, or their exclusive hosts. Dipterans are adept kleptoparasites often feeding on prey along with the predators, and numerous species in families including Milichiidae, Phoridae, Chloropidae, and others (Supplementary Table S3) approach or invade spider webs (Sivinski and Stowe, 1980;Sivinskii et al., 1999). Milichiid flies are chemically attracted to prey caught in spider webs and often hover near the web until an opportunity arises to feed undetected. The majority of such flies apparently go unnoticed, perhaps adapted to hovering at a safe distance and landing on the spider carapace or on the prey only when the spider is occupied. Or the host opts to not detract them, however, some percentage of these flies may themselves end up as prey.Ranzoviusbugs (Miridae) likeR. morensandR. contubernalisare specialist kleptoparasites scavenging prey items in spider webs, many associated with the socialAnelosimusspiders (Henry, 1984;Wheeler and McCaffrey, 1984;Guariso, 2000;Deyrup et al., 2004) In conclusion, spider webs represent not only snares for prey capture but also complex habitats that sustain diverse communities where kleptoparasitic organisms are the most diverse. From the stealthyArgyrodesto opportunistic ants, each kleptoparasitic organism has developed strategies to exploit spider webs to its advantage. Clearly, spider webs play ecological roles beyond prey capture, providing important microhabitats within most terrestrial ecosystems. **4 Facultative kleptoparasitism in spiders and araneophages in kleptoparasitic lineages** **4.1 Interactions among spider species in webs – webs as refuges and structural support, and web invasion** Spiders exhibit a fascinating array of web-invasive strategies exploiting the webs of other spiders in intra- and interspecific interactions including—in addition to kleptoparasitism—other resource usurpation, web takeover, predation, and mating. Perhaps the least invasive usurpation of spider webs is using a stranger’s web as a refuge from predators, as seen in some wandering spiders in social spider webs or using the structural lines of the web to support one´s own web. Such connecting behavior characterizes colonial spiders that in addition to clustering around abundant resources may benefit from interconnectedness via ´ricochet effects´ (Uetz, 1989), the ability to sense struggling prey in multiple webs, predator defense, and others (Rypstra, 1989). Colonial species such asMetepeira incrassata(McCrate and Uetz, 2010) andPhiloponella republicana(Binford and Rypstra, 1992), and those that more facultatively interlink webs likeCyrtophoraspp. (Rypstra, 1979;Leborgne et al., 1998) andTrichonephilaspp (Rypstra, 1981;Agnarsson, 2011), may also connect their nests to heterospecific webs. Many other species facultatively connect their webs to others, particularly to webs of colonial or clustering species.Leucauge,Uloborus,Micrathena,Holocnemus pulceiand some other pholcids, various small orbbweavers, linyphiids and theridiids are among those using ´host´ webs as structural support (Bristowe 1941a,b,Eberhard et al., 1993;Leborgne et al., 1998;McCrate and Uetz, 2010, Magnússon and Agnarsson unpublished). As webs of inter- and intraspecific individuals are thus frequently contiguous (Krafft, 1970;Burgess and Uetz, 1982;Jackson and Hallas, 1986;Hénaut et al., 2010), opportunities for web invasions abound. Indeed, spiders in interconnected complexes often enter neighboring webs to pursue insects (facultative kleptoparasitism,Supplementary Table S2), or opportunistically predate on the web owner (Kullmann, 1959a,b,1960;Jackson and Hallas, 1986;Wise, 2006).Bristowe (1941a,b), for example, observedPholcussp. predate on the owners of various webs it connected to, including araneids, theridiids, amaurobiids, agelenids and other pholcids. Other spiders instead of linking their web will invade webs to aggressively steal prey from the host, kill the host, or attempt to take the web over. The best-known cases are wandering spiders likeOlios(Sparassidae),SimaethaandPortia(Salticidae) that engage in aggressive facultative kleptoparasitism by removing the prey from their hosts (Jackson and Wilcox, 1990).Portiais unique in its versatility of foraging strategies, being among the very few jumping spiders that regularly build prey capture webs, in addition to hunting outside a web, and invading the webs of other species (Jackson and Hallas, 1986). It may or may not connect its own web to a host web and opportunistically forage kleptoparasitically or via araneophagy. Even though they will take insects,Portiaspecies are specialized araneophages that will prey on eggs, juveniles, and capture host spiders using a variety of tactics including stealth and mimicry (Jackson, 1985,1987,Jackson and Blest, 1982;Jackson and Hallas, 1986). Web building spiders may instead engage in web takeover. Kleptoteny refers to such theft were spiders abandon their own webs to invade and exploit the webs of others. While there are relatively few observations of web invasion by web building spiders (Enders, 1974;Buskirk, 1975;Eberhard et al., 1978;Wise, 1981,2006,Wickler and Seibt, 1988;Eichenberger et al., 2009;Houser et al., 2014;Gan et al., 2015;Gould, 2021), web building spiders frequently abandon webs when insufficient prey is captured (Turnbull, 1964), providing an impetus to wander off web and possibly happen upon other webs inadvertently. It seems likely that web takeover is widespread as an opportunistic strategy (Bilsing, 1920,Bristowe 1941a,b). Web building spiders web takeover may take place intra- or interspecifically, can be passive or aggressive, and involve various life stages, including adult males.Enders (1974), in an experimental setup, observed passive (empty web) conspecific web takeover inLarinioides cornutusandArgiope trifasciata. Both species would also invade empty webs of some other orbweavers andEustalasp. was observed taking over empty webs ofLarinioides cornutus(Bilsing, 1920;Enders, 1974). Aggressive web takeover has been seen in a number of species. ColonialCyrtophora citricolaadults and juveniles will displace each other depending on the capture rate of individual webs (Blanke, 1972;Eberhard et al., 1978;Rypstra, 1979) and adultTrichonephila clavipeswill displace smaller individuals from their webs (Farr, 1976;Christenson, 1984).Cyrtophora citricolaoften steal food from one another (Whitehouse and Lubin, 2005) and in some cases, rather than attempting to take over webs, some individuals may simply opt to be webless and operate as facultative kleptoparasites in conspecific webs. This has been observed, for example, inC. citricolaandAgelenopsis aperta(Rypstra, 1979;Christenson, 1984). It is unclear if such ´intraspecific optional weblessness´ differs from other facultative kleptoparasite strategies.Gan et al. (2015)observed intra- and interspecific aggressive web takeover among various orbweaving species includingLariniaria argiopiformis,Neoscona inusta,N. punctigera,Parawixia dehaani,Zygiella x-notata, andTetragnatha laboriosa. Webs built higher in the vegetation and those capturing more prey were more likely to be invaded, and typically, as inC. citricolaandT. clavipes, the success rate of web takeover depends on the relative size of invader and host. Similarly,Eichenberger et al. (2009)observed interactions between the introduced linyphiidMermessus trilobatuswith native European sheetweb spiders (Erigone dentipalpis,E. atra,Gnathonarium dentatum,Dicymbium nigrumandMicrargus herbigradus). The impetus for the study was the indicated invasive takeover of webs by the introducedM. trilobatus, however,Eichenberger et al. (2009)found that all of these species may attempt web takeover. Like prior studies, they found that body size plays a critical role in the outcome of these interactions, whether intra- and interspecific web takeover. This kind of web takeover is a clear example of facultative kleptoparasitism (aggressive usurpation) where the stolen resource is not prey secured by the host, but its prey capturing device and, of course, the prey it subsequently entangles.Eberhard et al. (1978)observations of webs ofMetazygiaspp. in Colombia illustrate a form of web robbery in which male spiders seize webs from immature or conspecific individuals to capture prey. This is a particularly interesting case of size-based aggressive usurpation as the males themselves typically do not build webs. They observed a maleTetragnathasp. invade the web ofM. gregaliswhere it stole prey and eventually replaced the smaller owner in the hub of the web. Similarly, they saw males ofEustalasp. andLarinia directatake over webs ofMetazygiaand males ofMetazygiataking over webs of conspecifics or otherMetazygiaspecies. The males would then capture prey in the stolen web. Male spiders may also feed on silk, maleLeucauge marinamay steal silk from the webs of larger orbweavers (Eberhard, 2020). Observations on male behavior after they molt to adulthood and abandon web building, but prior to courtship, is generally lacking. However, it is reasonable to assume that males wandering in search of females will opportunistically capture prey on and off webs and steal other resources. The males of many species that cohabit with females they (attempt to) mate with, will take prey from the webs (see below), and web building spiders are certainly capable of capturing prey outside their webs,Gould (2021), for example observedTetragnathasp. haul up a large dragonfly without the use of a web. **4.2 Mating and males as facultative kleptoparasites** Webs typically serve as mating sites, with males abandoning their own webs and seeking to invade the web of a female to court her. It is common that males cohabit with females in their webs for some time, guarding a subadult female until she molts to maturity, defending her against other males, or awaiting an opportunity to sneak in and mate (Foelix, 2010). In the case of large spiders with pronounced sexual size dimorphism (female biased extreme sexual size dimorphism, eSSDsensuKuntner and Coddington, 2020) males may even accumulate in significant numbers in female webs. In communal species, likePhiloponellaspp (Opell, 1979), it is also common to find males in the colonies and it seems likely they take prey opportunistically. Though observations are sparse for this aspect of male biology, the scattered records suggest that males may commonly act as facultative kleptoparasites in female webs.Linyphia litigosamales steal prey from females they cohabit with and will even fight her for prey (Rovner, 1968;Wise, 1975;Watson, 1990). Many male pholcids will, similarly, aggressively pursue food in female webs (Eberhard and Briceño, 1983,1985,Blanchong et al., 1995). Males in some species are favored to win fights due to larger size (Eberhard and Briceño, 1983), or in species where the sexes are similarly sized, the larger individual tends to have the upper hand (Blanchong et al., 1995).Latrodectus revivensismales enter webs of females, even juveniles and subadults, and steal prey. The impact is particularly negative for younger females that may opt to relocate their webs to escape the male, at a high risk of mortality (Lubin et al., 1993). MaleStegodyphus lineatuscohabit with females and may steal and consume their eggs (if not their own) and steal prey from them, acting as costly kleptoparasites in female webs (Schneider and Lubin, 1996,1997). Facultative male kleptoparasitism is typically less aggressive and costly to females. MaleMetellina segmentatahang out at the edge of the female web and may enter the web when the female has captured prey and feed with her, both prior to and after mating (Blanke, 1974;Prenter et al., 1994;Elgar and Fahey, 1996). In the eSSD nephilids, where multiple males often cohabit with the giant female, their foraging behavior is quite similar to that of obligatory kleptoparasitic argyrodines.Trichonephila clavipesmales, for example, await their opportunity in the barrier web and enter the web to glean insects ignored by the female, feed with the female, eat silk, or may even steal prey from argyrodines inside the female web (Christenson and Goist, 1979;Vollrath, 1977;1980,1987). In bothNephilaandTrichonephilathe largest male may reside near the hub and feed with the female while the smaller ´satellite´ males glean insects and rival argyrodine kleptoparasites (Robinson et al., 1973,1976, Kuntner pers. comm.). It is likely that males of other nephilids and of other eSSD orb weavers where males accumulate in female webs display similar kleptoparasitic behaviors (Robinson et al., 1973;Christenson and Goist, 1979;Vollrath, 1980, Kuntner pers. comm.). Male cohabitation may in some cases be more mutualistic than parasitic in nature. Males of the pholcidsBlechrocelissp. andModisimusspp. cohabit with female and capture prey in her web (Eberhard and Briceño, 1983,1985). While the generally larger males will contest with the female over prey, the males appear to ´concede´ the prey to females upon ´begging´ gestures she makes, vibrating her abdomen. In some instances, males will capture and wrap prey, signal the female by plugging the web, and then leave the prey to her, or even carry the prey to her.Eberhard and Briceño (1983,1985) suggest that this kind of ´chivalry´ inBlechrocelisandModisimusspp. may render the interaction between males and females mutualistic. On the other hand, where the sexes are similarly sized like inHolocnemus pluchei, the outcome of a struggle for prey depends on individual size, males not being favored in general. On such ´equal terms´ males that happened to secure a prey from a female, did not show any signs of ´chivalry (Blanchong et al., 1995). Perhaps the lack of a general size advantage means that males cannot exert control over females by stealing prey at will and then secondarily offering it to them. **4.3 Facultative kleptoparasites and araneophages** In addition to web takeover scattered across multiple web building groups, and male facultative kleptoparasitism that is also widespread but rather poorly known, a few cases of facultative kleptoparasitism that involve neither web takeover nor male spiders are relatively well documented. Information on a few groups of such facultatively kleptoparasitic taxa are summarized below. In addition, some taxa specializing in araneophagy are treated below, although they may be similar to taxa discussed under section 5.1. These are examples taken to highlight groups likeRhomphaeaandAriamnesthat due to details of strategies and/or phylogenetic position, may display transitional traits related to the evolution of kleptoparasitism. Information on further facultative spider kleptoparasite and araneophages can be found above and inSupplementary Table S2, though it is far from exhaustive. It should be noted that not all spider kleptoparasites steal from other spiders.Henrikseniacrab spiders take food from pitcher plants (Fage, 1928;Striffler and Rembold, 2009;Chua and Lim, 2012), and spiders may also take food from other predators and scavengers (Cushing, 2012).Jackson and Pollard (2008), for example, observed three Kenyan species ofMenemerusjumping spiders snatch food from the mandibles ofCrematogasterandCamponotusants, a behavior first noted byBhattacharya (1936)in the IndianM. bivittatus[asM. melanognathus]. Near the shores of a lake masses of Chaoboridae and Chironomidae midges that had emerged from a lake were found perishing on the walls of buildings scouted by ants.Jackson and Pollard (2008)describe how the spiders would track ants as they walked by and attack if they were carrying prey. The spiders would approach rapidly, grab the fly with their chelicerae and pull away as the ant let go of the prey. Only relatively small individuals would partake in prey theft, which complemented typical prey catching by these jumping spiders. Hence, the kleptoparasitic behavior is facultative andJackson and Pollard (2008)suggest that it may secure fly prey more rapidly than stalking the fly directly. Further, as the flies are dead or dying, the spiders may use the ants as assessors picking out among the cadavers prey that is still palatable. This foraging tactic has been noted in multipleMenemerusspecies, but is not a common salticid behavior, suggesting this may be an adaptive, although facultative, strategy. In most cases, spiders steal food from other spiders, and typically on the host´s web.Oonopsis a fairly large genus of Oonopidae spiders containing one species known to be kleptoparasitic.Oonops pulcheris a small spider that has been observed in a variety of habitats, hunting on the ground as typical for oonopids, sometimes found in birds’ nests, but also in the webs of larger spiders (Bristowe, 1930,1958).Bristowe (1930)observedO. pulchermove among the retreat strands of its hosts, ignored by the host agelenid or amaurobiid spider, feeding on remnants of the hosts meals.Oonops pulcheris clearly a facultative kleptoparasite, most commonly found outside a host webs (Le Peru, 2011). Platnickinais a theridiid genus containing 12 species some of which have been observed invading other spider webs.Platnickinais an anomaly in this summary of genera as it likely rarely steals prey. It is discussed here to highlight the need for further studies of the genus, and to consider the potential links between opportunistic web invasion and obligatory kleptoparasitism in spiders.Platnickinaspecies build their own web, a simple network of threads, and commonly capture prey there (Suzuki et al., 2022). The majority of prey consists of insects like nematoceran flies and paraneopterans, but some 40% of the prey were spiders.Platnickinawill wander outside its web and into webs of hosts including other theridiids,TetragnathaandTrichonephila(Bristowe 1941a,b;Namkung, 2003;Suzuki et al., 2022). There, it will attempt to attack and kill the host but has a much lower success rate in killing hosts in the host´s web than in capturing prey in its own web. The large size of potential spider host prey may make up for the challenge in capturing and killing it.Platnickinamay be an opportunistic kleptoparasite as well, Suzuki (pers. comm.), for example, has observedP. sterninotanafeeding on a largeBrachycerafly in a theridiid web. Rhomphaeacontains 37 argyrodine species that are primarily thought to be araneophages and are often discussed in the context of the origin of web invasion and kleptoparasitism.Rhomphaeaspecies are typically elongated, with long ´tails´ that they can move in a worm-like fashion (Archer, 1946)—their bodies appear well camouflaged, especially within host webs. WhileRhomphaeaspecies are often found in their own simple web consisting of several irregularly spaced threads, they are also frequent invaders in the webs of other spiders. ´Hosts´ ofRhomphaeainclude a variety of smaller sheet (Linyphiidae) and cobweb (Theridiidae) spiders—including social theridiids—as well as orbweavers (Archer, 1946;Exline and Levi, 1962;Smith Trail, 1980;Whitehouse, 1987b;Guarisco, 2000;Kim and Kim, 2007;McCrate and Uetz, 2010;Srinivasulu et al., 2013). In most cases,Rhomphaeaare reported as host predators, but they have also been observed stealing food from host webs (Eberhard, 1979;Yaginuma, 1986,Yoshida, 2001a,b).Suzuki et al. (2022)found that the diet of adultRhomphaeaconsists mostly of spiders, with some 15% of predation attempts directed at insects, while juvenileRhomphaeacapture mostly insects.Rhomphaeahad a high predation success on its own simple thread webs (95%), but in host webs it often fails to capture the host spider (25% success rate), especially when the host is large. It is likely thatRhomphaeaventures into host webs in an attempt to catch larger prey than it gets on its own web, even if less successful. Ariamnesis an extraordinary genus of argyrodine theridiids, containing 24 species with exceptionally elongated and worm-like abdomens (Vollrath, 1977).Ariamnesare relatively large spiders, and unlike most members of the subfamily, they appear to rarely wander into webs of other spiders (Clyne, 1979;Eberhard, 1979).Eberhard (1979)describes the web ofAriamnesas a sparse, irregular, three-dimensional network of long, non-sticky threads that can extend up to 1-2 meters. Rather than functioning as a snare, this web serves as a resting site for the spider and as a base for ambush attacks. Juveniles ofA. attenuatusprimarily capture nematocerous flies that tend to hang on these threads, while adults capture juvenile spiders, typically non-web builders larger than themselves. They use a specialized predatory technique shared withRhomphaea, throwing sticky silk with their hind legs to immobilize prey.Suzuki et al. (2022)found that spiders constitute about 75% of the prey ofAriamnes, with a preference for cursorial spiders over web builders, and including other araneophagic spiders likeRhomphaea,Platnickina, and even otherAriamnes.Ariamnesforaging behavior appears to be quite homogenous across species. The spider’s resting posture, with legs outstretched, may be a camouflage resembling a pine needle caught in the web.Dönitz (1887)described the spider’s unique egg sac, a bell-shaped structure suspended by threads and resembling an elongated cocoon with a wool-like interior, which the adult females guard (Eberhard, 1979). Spiders employ diverse web invasion tactics, utilizing webs for predation, resource competition, shelter, and mating. Diverse groups of both web builders and web-less hunters enter webs in search of resources or mating opportunities. Facultative kleptoparasitism is found in most such species, opportunistically stealing prey, silk, or even the web itself, regardless of the ultimate objective ranging from courtship to cannibalism. Facultative kleptoparasitism is also found in some spiders stealing prey not from a web spider. For reasons outlined in the Introduction, I have not attempted to exhaustively review facultative kleptoparasitism in spiders. It is a compelling but underexamined facet of spider biology, marked by dynamic and often intricate interactions: overt contests for webs, covert theft of prey and silk by males wandering in search of females, sexual conflict on display in facultative male kleptoparasitism, opportunistic resource theft by versatile taxa, and specialized araneophagy. Opportunities for innovative future research abound—given the phylogenetic spread of observed species, and the somewhat haphazard nature of such observations. I predict thatfacultative kleptoparasitism is far more widespread and common than currently appreciated.Spiders that engage in opportunistic web invasions demonstrate an evolutionary flexibility, using webs of others to reduce the energetic costs of web building and prey capture. If as pervasive as hypothesized above, the occurrence of web invasions and facultative kleptoparasitism across diverse spider lineages may imply that the evolutionary bridge to obligatory kleptoparasitism in spiders is rather short. **4.4 Obligate spider kleptoparasites** In total there are probably between 200-300 species of obligate kleptoparasites among the ~53,000 spider species currently known (WSC, 2025). Some behavioral or habitat data (host webs) are available for a little over 100 species (seeTable 1;Supplementary Table S1and References, summarized in Agnarsson in prep.), while the majority of species expected to be kleptoparasitic lack such data. Many new species also doubtless await discovery and description (Agnarsson et al., 2013) as evidenced by a proliferation in descriptions of species and genera in recent years (Dupérré and Tapia, 2020;Lin et al., 2024;Vanuytven et al., 2024). A synthesis on obligate kleptoparasitic spiders will be provided elsewhere (Agnarsson in prep.). **5 Host response to kleptoparasitism** The cost of kleptoparasitism is challenging to measure. In some cases, it is expected to be relatively small, when kleptoparasites only remove prey remains, prey ignored by the host, or silk. However, any removal of calories from the web has the potential to impact the host (Coyle et al., 1991;Whitehouse, 2011) and even calories contained in ignored prey and silk represent a cost as these could be ingested by the host when recycling the web. In many cases, kleptoparasitism inflicts a more readily measurable costs on host spiders, especially through prey depletion and its cascading effects on growth, reproductive output, and fitness (Vollrath, 1987;Elgar, 1993;Whitehouse, 2011). Studies onAnelosimus eximiusdemonstrate thatFaiditus ululansmay consume up to a quarter of the prey in a host’s web (Cangialosi, 1990b), and research onTrichonephila clavipesshows that the daily caloric requirements of argyrodine spiders can reach at least 20% of that of the host when kleptoparasite abundances are high—in this case when they reach about 40 per web (Vollrath, 1980;Elgar, 1993). While these may be extreme examples, even at a smaller cost, kleptoparasites divert significant energy reserves away from the host spider’s reproductive efforts and thus fitness. It is obvious that such resource diversion can be particularly damaging in energy-constrained environments, where each prey item represents a critical contribution to the host’s metabolic requirements. In social webs, the impact of kleptoparasites can amplify, as these webs represent a “public good” shared among colony members. The shared prey resources attract kleptoparasites who consume prey captured collectively, placing additional strain on the colony (Straus and Avilés, 2018,2023). Thus, this resource-sharing model, though beneficial for maintaining the colony, becomes a point of vulnerability, making communal webs especially susceptible to kleptoparasitic exploitation and resource depletion (Leborgne et al., 2011). This highlights the ecological cost of maintaining large, accessible prey traps in communal settings ​ (Vollrath, 1984), where kleptoparasitism can reach ´sublethal´ levels (Straus and Avilés, 2023). The behavior and phylogenetic distribution of kleptoparasitic hosts suggests an evolutionary trade-off, perhaps even an arms race between web-building spiders and kleptoparasites. Hosts in clades like Nephilidae, Araneidae, and Dipluridae have evolved ´progressively´ (or repeatedly) larger and more intricate webs presumably under fecundity selection where larger females require ever more food to produce more offspring (see e.g.Kuntner et al., 2019;Kuntner and Coddington, 2020). However, large and elaborate webs with high prey capture success rate also attract kleptoparasites. This trade-off may have at least two consequences. First, one expects increased selective pressure on direct hosts countermeasures such as means of detecting and eliminating kleptoparasites while maintaining such webs. Second, the majority of orb weaving spiders take down their webs and rebuild daily. It is tempting to consider the possibility that daily web recycling, in addition to providing a fresh capture surface daily, is an example of a trade-off where the costs of kleptoparasitism outweigh the benefits of more elaborate permanent webs. However, testing this hypothesis may be challenging, and if orb recycling evolved once, as the evidence may suggest (e.g.Eberhard, 2020and references therein), putative causative factors will ever remain speculative. One observation casts doubt on such co-evolutionary scenario; spider kleptoparasitism likely evolved later (and mostly within Araneoidea), than daily web recycling in orb-weavers. Thus, the origin of web recycling does not relate to (at least extant) spider kleptoparasites. The hypothesis is still tenable given the negative impact of heavy kleptoparasite load (Vollrath, 1987;Elgar, 1993), and facultative web takedown and relocation by spiders suffering such heavy loads. It is plausible that kleptoparasitism maintains natural selection for web recycling, and that it plays a trade-off role in the evolution of large and permanent webs.Nephila pilipes(Robinson et al., 1973) for example will take down and relocate its web when kleptoparasite load is high. A new web location may offer a respite from kleptoparasites for up to 48 hours. Web relocation in socialAnelosimusand extreme ´boom and bust´ population growth in socialTheridion nigroannulatumare both putatively linked to argyrodine kleptoparasites (Avilés et al., 2006;Straus and Avilés, 2018,2023). Thus, kleptoparasite pressure can become a resource drain leading to colony fragmentation or collapse. These scenarios underscore the likely evolutionary arms race between resource conservation strategies and kleptoparasitic exploitation, with host spiders displaying adaptive flexibility in web structure, prey management, and interspecific interactions to mitigate the fitness impacts of kleptoparasitism​ (Whitehouse, 2011). Certain solitary orb-weavers display a degree of tolerance toward minor kleptoparasitic activity, conserving energy by ignoring low-level incursions.Vollrath (1987)suggests that this tolerance may serve as an adaptive strategy, where active defense is reserved for more resource-intensive interactions. When implemented, hosts may engage in defensive behaviors aimed at excluding or confronting kleptoparasites.Trichonephila clavipes, for example, may respond to argyrodines with aggressive web shaking, or even pursuits. Many other host spiders have aggressive response to spider kleptoparasites that differs distinctly from their response to prey or predators (Vollrath, 1987). Further, the web itself may serve as a barrier modulating kleptoparasitic impact, e.g. through spatial separation of prey from potential kleptoparasites. For instance, layered retreats withinAnelosimuscolonies can limit direct access to prey-rich areas, creating a physical deterrent. It is likely that other traits, speed of prey capture and handling, retreats, and sensory biology are influenced by kleptoparasitism, but research is lacking on this front. **6 Conclusions** Certain spiders function as superhosts by providing structurally complex, resource-rich webs that support a wide range of kleptoparasites. Key superhost traits include large host and web size, high prey capture rates, web or website persistence, and three-dimensional auxiliary silk structures that offer refuges for kleptoparasites. These characteristics are most pronounced in genera such as the orbweavingNephila,TrichonephilaandCyrtophora, and sheet weaving mygalomorphs likeDipluraandLinothele. The webs of these hosts attract diverse kleptoparasites from multiple arthropod lineages, including spiders, flies, ants and bugs. Social spiders are also favored hosts likewise building large and complex webs. The most diverse communities, indeed, form in social spider webs, which have hosts that are more tolerant of co-inhabitants than solitary spiders and generally lack sticky silk. In such webs kleptoparasites bound, but also many arthropods scavenge leftovers and detritus, like beetles and lepidopteran larvae. The spectrum of kleptoparasitism in spider webs is broad, encompassing obligate kleptoparasites like argyrodine theridiids, facultative prey thieves, web invaders, and even commensals that exploit spider webs without stealing resources useful to the host. Some kleptoparasites feed opportunistically on prey remnants, while others engage in stealthy theft or aggressive food robbery. Additionally, spiders themselves exhibit secondary kleptoparasitism, with some species abandoning their own webs to invade and exploit the webs of other spiders (kleptotany). This facultative kleptoparasitism is seen in multiple lineages and can involve resource theft, web takeover, or even direct predation on the host (araneophagy). These interactions suggest a complex evolutionary pathway, where facultative kleptotany may serve as a transition to obligate kleptoparasitism. This review highlights the importance of spiders in kleptoparasitic networks and suggests that further phylogenetic and ecological analyses are necessary to fully understand the evolutionary history of kleptoparasitism, and the assembly of kleptoparasitic species into host webs. **7 Future directions** Despite substantial progress in understanding spiders as superhosts and secondary kleptoparasites, this review reveals several key areas that urgently require future research. **7.1 Phylogenetic context of kleptoparasitism** While facultative kleptoparasitism and kleptotany (here) have been hypothesized as precursors to obligate kleptoparasitism, robust phylogenetic analyses are necessary to establish evolutionary transitions. Future work should focus on constructing comprehensive phylogenetic trees incorporating all kleptoparasitic and host lineages to discern evolutionary patterns and seek signatures of possible coevolutionary arms race between kleptoparasites and host. **7.2 Mechanisms of host selection and assembly into host webs** Further investigation is needed into how kleptoparasites locate, evaluate, and establish themselves in host webs. Ecological studies on species colonization, composition in host webs, and intra- and interspecific competition would clarify what rules may govern species assembly into these habitat islands. Studies employing behavioral assays and chemical ecology approaches should clarify the role of airborne cues, such as pheromones or web-borne signals, in host detection and selection. **7.3 Impact of kleptoparasitism on host fitness and web dynamics** Although some hosts appear resilient to kleptoparasitism, long-term studies tracking web persistence, prey capture rates, and reproductive success in the presence of kleptoparasites would provide a clearer picture of costs and benefits to hosts. Evaluating host responses to kleptoparasites in relation to species and kleptoparasite load could cast light on what strategies may be evolutionary responses to this type of resource theft. In particular, if both facultative and obligatory web takedown and relocation are influenced by kleptoparasitism, then web takedown may play a role in explaining the absence of kleptoparasites from the majority of spider webs. **7.4 Geographic and environmental influences** The distribution and abundance of kleptoparasites across different biogeographic regions remain underexplored. Comparative studies examining kleptoparasitism in varying climates, habitats, and ecological contexts, and the biogeography of kleptoparasites among geographical and habitat islands, would enhance understanding of environmental factors shaping these interactions. **7.5 Behavioral plasticity and evolutionary transitions** Some species exhibit facultative kleptoparasitism in specific contexts, suggesting behavioral plasticity that may facilitate evolutionary shifts. Experimental studies investigating the conditions under which facultative kleptoparasitism is expressed could illuminate pathways to obligate kleptoparasitism. **7.6 Community-level interactions in multi-species webs** Spider webs are often interlinked and can form multi-species assemblages. Given that existing studies suggest such web clusters are more than the combination of their parts, further research is needed to explore the dynamics of kleptoparasite assemblies in such transient communities. In particular, in what context do webs of species that are normally deferred become attractive to kleptoparasites? Understanding this context may offer key insight into the host traits that attract and detract kleptoparasites. **7.7 Application of (advanced) tracking technologies** An almost entirely unexplored field of study is that of tracking movement of kleptoparasites among host webs. Simple techniques like paint or dust tagging would allow the movement of individual kleptoparasites to be tracked and could provide novel insights into assembly into host webs, dispersal, and long-term site fidelity of kleptoparasitic spiders. The use of modern tracking tools, such as harmonic tags or miniature radio-frequency identification (micro RFID) tags would be ideal and is certainly feasible to track larger host species. The smallest harmonic tags may also be useful for tracking kleptoparasites and such data would lend themselves well to machine-learning-based behavioral analysis. **7.8 Molecular ‘tracking’ of kleptoparasites** A few studies have started to use modern sequencing methods to understand kinship and local adaptation in kleptoparasitic spiders. Population genomics offers tools that will advance our understanding on dispersal, kinship of individuals within host webs (potentially underlying some cooperative behavior), and host specialization. Such data may be pivotal in gaining complete understanding of species assembly into host webs. Addressing these knowledge gaps will not only refine our understanding of kleptoparasitism in spiders but also contribute to broader ecological and evolutionary theories on community ecology, assembly rules, resource exploitation, parasitism, and host-parasite dynamics. **Data availability statement** The data analyzed in this study is subject to the following licenses/restrictions: Some unpublished sequence data from collaborative ongoing work was used to inform on the summary phylogeny. Requests to access these datasets should be directed to IA,aWFnbmFyc3NvbkBnbWFpbC5jb20=. **Author contributions** IA: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Supervision, Validation, Visualization, Writing – original draft, Writing – review & editing. **Funding** The author(s) declare that financial support was received for the research and/or publication of this article. Funding for this work came, in part, from an Erasmus+ grant to the author and a University of Iceland grant RSJ2023-92897. **Acknowledgments** I thank the editors of Frontiers in Arachnid Science, in particular Matjaz Kuntner and Alejandro Cabezas-Cruz, for inviting me to contribute to the Horizons review collection and handling the manuscript, respectively. Many people contributed data and ideas to this paper and I am especially thankful to Robert Jackson, Mark Elgar, William Eberhard, Jonathan Coddington, Yuya Suzuki, Greg Anderson, Jillian Cowles, Matjaz Kuntner, and Matjaz Gregorič. Thanks to Danniella Sherwood, Franklyn Cala Riquelme, Jonathan Coddington, Matjaz Kuntner, Matjaz Gregorič., Elodie Ferreira, Brogan Pett and Snædís Björnsdóttir for comments that improved the manuscript. **Conflict of interest** The author declares that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Generative AI statement** The author(s) declare that Generative AI was used in the creation of this manuscript. AI was used to extract data from literature, provide paper summaries, and in building bibliography. All text is original by the author and AI information was verified. **Publisher’s note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **Supplementary material** The Supplementary Material for this article can be found online at:https://www.frontiersin.org/articles/10.3389/frchs.2025.1544428/full#supplementary-material **References** Abhijith A. P. C., Hill D. E., Pai M. J., Baliga V. (2021). Spiders that prey on jumping spiders (Araneae: Salticidae).Peckhamia250, 1–7. Google Scholar Agnarsson I. (2002). Sharing a web—On the relation of sociality and kleptoparasitism in theridiid spiders (Theridiidae, Araneae).J. Arachnology30, 181–188. doi: 10.1636/0161-8202(2002)030[0181:SAWOTR]2.0.CO;2 Crossref Full Text|Google Scholar Agnarsson I. (2003). Spider webs as habitat patches: The distribution of kleptoparasites (Argyrodes, Theridiidae) among host webs (Nephila, Tetragnathidae).J. Arachnology31, 344–349. doi: 10.1636/s02-21 Crossref Full Text|Google Scholar Agnarsson I. (2004). Morphological phylogeny of cobweb spiders and their relatives (Araneae, Araneoidea, Theridiidae).Zoological J. Linn. Soc.141, 447–626. doi: 10.1111/j.1096-3642.2004.00120.x Crossref Full Text|Google Scholar Agnarsson I. (2006). A revision of the New Worldeximiuslineage ofAnelosimus(Araneae, Theridiidae) and a phylogenetic analysis using worldwide exemplars.Zoological J. Linn. Soc.146, 453–593. doi: 10.1111/j.1096-3642.2006.00213.x Crossref Full Text|Google Scholar Agnarsson I. (2011). Habitat patch size and isolation as predictors of occupancy and number of argyrodine spider kleptoparasites inNephilawebs.Naturwissenschaften98, 163–167. doi: 10.1007/s00114-010-0750-3 PubMed Abstract|Crossref Full Text|Google Scholar Agnarsson I., Coddington J. A., Kuntner M. (2013). “Systematics – progress in the study of spider diversity and evolution,” inSpider research in the 21st century. Ed. Penney D., 58–111. Google Scholar Agnarsson I., Ramahefarison F. N., Matthíasdóttir. H. H., Kudari L., Dagsson M. M., Baldursdóttir N. G., et al. (2025). Which web to invade? argyrodine kleptoparasites differentiate among architecturally different host webs.Preprint at EcoEvoRxiv no 8729. Google Scholar Agnarsson I., Gotelli N. J., Agostini D., Kuntner M. (2016). Limited role of character displacement in the coexistence of congenericAnelosimusspiders in a Madagascan montane forest.Ecography39, 743–753. doi: 10.1111/ecog.01930 Crossref Full Text|Google Scholar Alayón García G. (1992). Descripción del macho deIschnothele longicaudaFranganillo (Araneae: Dipluridae).Poeyana414, 1–7. Google Scholar Andrade M. C. B. (1996). Sexual selection for male sacrifice in the Australian redback spider.Science271, 70–72. doi: 10.1126/science.271.5245.70 Crossref Full Text|Google Scholar Archer A. F. (1946). The Theridiidae or comb-footed spiders of Alabama.Museum Papers Alabama Museum Natural History22, 1–67. Google Scholar Archer A. F. (1948). A modified classification of spiders based in part on the evolution of the male palpus.J. Alabama Acad. Sci.20, 3–9. Google Scholar Archer A. F. (1966). Nuevos argiopidos (Arañas) de Las Antillas.Caribbean J. Sci.5, 129–133. Google Scholar Avilés L., Maddison W. P., Agnarsson I. (2006). A new independently derived social spider with explosive colony proliferation and a female size dimorphism.Biotropica38, 743–753. doi: 10.1111/j.1744-7429.2006.00202.x Crossref Full Text|Google Scholar Avilés L. (1997). “Causes and consequences of cooperation and permanent-sociality in spiders,” inThe evolution of social insects and arachnids. Eds. Choe J. C., Crespi B. J. (Cambridge: Cambridge University Press), 476–498. Google Scholar Baba Y. G., Miyashita T. (2005). Geographical host change in the kleptoparasitic spiderArgyrodes kumadaiassociated with distribution of two host species.Acta Arachnologica54, 75–76. doi: 10.2476/asjaa.54.75 Crossref Full Text|Google Scholar Baba Y., Osada Y., Miyashita T. (2012). The effect of host web complexity on prey-stealing success in a kleptoparasitic spider mediated by locomotor ability.Anim. Behav.84, 1261–1268. doi: 10.1016/j.anbehav.2012.02.019 Crossref Full Text|Google Scholar Baba Y., Walters R. J., Miyashita T. (2007). Host-dependent differences in prey acquisition between populations of a kleptoparasitic spiderArgyrodes kumadai(Araneae, Theridiidae).Ecol. Entomology32, 38–44. doi: 10.1111/j.1365-2311.2006.00837.x Crossref Full Text|Google Scholar Baba Y., Walters R. J., Miyashita T. (2013). Complex latitudinal variation in the morphology of the kleptoparasitic spiderArgyrodes kumadaiassociated with host use and climatic conditions.Population Ecol.55, 43–51. doi: 10.1007/s10144-012-0334-5 Crossref Full Text|Google Scholar Baert L. (1990). Mysmenidae (Araneae) from Peru.Bull. l'Institut R. Des. Sci. Naturelles Belgique60, 5–18. Google Scholar Baert L. L., Murphy J. A. (1987).Kilifia inquilina: a new mysmenid spider from Kenya (Araneae: Mysmenidae).Bull. Br. Arachnological Soc.7, 194–196. Google Scholar Baptista R. (1988). Onmysmenopsis(Mysmenidae), a kleptoparasite of pholcidae.Am. Arachnology38, 4. Google Scholar Berland L. (1923). Le peuplement en Araignées de la Nouvelle Calédonie.Comptes Rendus l'Académie Des. Sci.176, 1668–1670. Google Scholar Berland L. (1924).Araignées de la Nouvelle Calédonie et des îles LoyaltyVol. 3. Eds. Sarazin F., Roux J. (Nova Caledonia: Zoologie), 159–255. Google Scholar Berry J. W. (1987). Notes on the life history and behavior of the communal spiderCyrtophora moluccensis(Doleschall) (Araneae, Araneidae) in Yap, Caroline Islands.J. Arachnology15, 309–319. Google Scholar Bhattacharya G. C. (1936). Observations of some peculiar habits of the spider (Marpissa melanognathus).J. Bombay Natural History Soc.39, 142–144. Google Scholar Bilsing S. W. (1920). Quantitative studies in the food of spiders.Ohio J. Sci.20, 215–260. Google Scholar Binford G. J., Rypstra A. L. (1992). Foraging behavior of the communal spiderPhiloponella republicana(Araneae: Uloboridae).J. Insect Behav.5, 321–335. doi: 10.1007/bf01049841 Crossref Full Text|Google Scholar Blackledge T. A., Gillespie R. G. (2002). Estimation of capture areas of spider orb webs in relation to asymmetry.J. Arachnology30, 70–77. doi: 10.1636/0161-8202(2002)030[0070:eocaos]2.0.co;2 Crossref Full Text|Google Scholar Blackledge T. A., Kuntner M., Agnarsson I. (2011). The form and function of spider orb webs: Evolution from silk to ecosystems.Adv. Insect Physiol.41, 175–262. doi: 10.1016/B978-0-12-415919-8.00004-5 Crossref Full Text|Google Scholar Blanchong J. A., Summerfield M. S., Popson M. A., Jakob E. M. (1995). Chivalry in pholcid spiders revisited.J. Arachnology23, 165–170. Google Scholar Blanke R. (1972). Untersuchungen zur Ökophysiologie und Ökethologie vonCyrtophora citricolaForsskål (Araneae, Araneidae) in Andalusien.Forma Functio (Braunschweig)5, 125–206. Google Scholar Blanke R. (1974). Der Zusammenhang zwischen Beuteangebot und Reproduktionsrate beiCyrtophora citricola(Forsskål) (Araneae, Araneidae).Beiträge zur naturkundlichen Forschung Südwestdeutschland33, 223–228. Google Scholar Bosmans R., Colombo M. (2015). New species of spiders from Sardinia (Araneae), with ecological notes onLipocrea epeiroides(O. Pickard-Cambridge 1872) (Araneae: Araneidae).Arachnology16, 319–332. doi: 10.13156/arac.2015.16.9.319 Crossref Full Text|Google Scholar Bradoo B. L. (1972). Some observations on the ecology of social spiderStegodyphus sarasinorumKarsch (Araneae: Eresidae) from India.Oriental Insects6, 193–203. doi: 10.1080/00305316.1972.10434070 Crossref Full Text|Google Scholar Bradoo B. L. (1979).Uloborus ferokussp. nov. (Araneae: Uloboridae), a commensal ofStegodyphus sarasinorumKarsch.Bull. Br. Arachnological Soc.4, 353–355. Google Scholar Bradoo B. L. (1983). A new record of commensalism betweenArgyrodes progilesTikader (Araneae: Theridiidae) andStegodyphus sarasinorumKarsch.Curr. Sci. (Bangalore52, 217–218. Google Scholar Bradoo B. L. (1985). Some observations on the fecundity ofUloborus ferokusBradoo (Araneae: Uloboridae).Indian Zoologist9, 73–75. Google Scholar Bradoo B. L. (1986). Feeding behavior of a non-poisonous spiderUloborus ferokus(Araneae, Uloboridae).Zoologischer Anzeiger217, 75–88. Google Scholar Breed M. D., Cook C., Krasnec M. O. (2012). Cleptobiosis in social insects.Psyche2012, 484765. doi: 10.1155/2012/484765 Crossref Full Text|Google Scholar Brignoli P. M. (1966). Le società eterotipiche degli Araneidi.Rendiconti dell'Accademia Nazionale dei LinceiXVI, 1–28. Google Scholar Bristowe W. S. (1930). Notes on the biology of spiders. III. Miscellaneous.Ann. Magazine Natural History6, 347–353. Google Scholar Bristowe W. S. (1931). Notes on the biology of spiders. VII. Flies that triumph over spiders.Ann. Magazine Natural History10, 471–474. doi: 10.1080/00222933108673425 Crossref Full Text|Google Scholar Bristowe W. S. (1941a).The comity of spiders(London: The Ray Society). Google Scholar Bristowe W. S. (1941b).The comity of spiders, Vol. II(London: Ray Society). Google Scholar Bristowe W. S. (1958).The World of Spiders(Collins New Naturalist). Google Scholar Bristowe W. S. (1968).The Comity of Spiders. Vol. 1 and 2(Ray Society). Google Scholar Burgess J. W., Uetz C. W. (1982). “Social spacing strategies in spiders,” inSpider communication. mechanisms and ecological significance. Eds. Witt P. N., Rovner J. S. (Princeton: Princeton Univ. Press), 317–322. Google Scholar Buskirk R. E. (1975). Aggressive display and orb defense in a colonial spiderMetabus gravidus.Anim. Behav.23, 560–567. doi: 10.1016/0003-3472(75)90133-5 Crossref Full Text|Google Scholar Cangialosi K. R. (1990a). Kleptoparasitism in colonies of the social spiderAnelosimus eximius (Araneae: Theridiidae).Acta Zoologica Fennici190, 51–54. Google Scholar Cangialosi K. R. (1990b). Social spider defense against kleptoparasitism.Behav. Ecol. Sociobiology27, 49–54. doi: 10.1007/bf00183313 Crossref Full Text|Google Scholar Cangialosi K. R. (1990c). Life cycle and behavior of the kleptoparasitic spiderArgyrodes ululans(Araneae: Theridiidae).J. Arachnology18, 347–358. Google Scholar Cangialosi K. R. (1991). Attack strategies of a spider kleptoparasite: Effects of prey availability and host colony size.Anim. Behav.41, 639–647. doi: 10.1016/S0003-3472(05)80902-9 Crossref Full Text|Google Scholar Cangialosi K. R. (1997). Foraging versatility and the influence of host availability inArgyrodes trigonum(Araneae, Theridiidae).J. Arachnology25, 182–193. Google Scholar Cerveira A. M., Jackson R. R. (2005). Specialised predation by Palpimanus sp. (Araneae: Palpimanidae) on jumping spiders (Araneae: Salticidae).J. East Afr. Natural History94, 303–317. doi: 10.2982/0012-8317(2005)94[303:SPBPSA]2.0.CO;2 Crossref Full Text|Google Scholar Champion de Crespigny F. E., Herberstein M. E., Elgar M. A. (2001). Food caching in orb-web spiders (Araneae: Araneoidea).Naturwissenschaften88, 42–45. doi: 10.1007/s001140000194 PubMed Abstract|Crossref Full Text|Google Scholar Chida T., Tanikawa A. (1999). A new species of the spider genusArgyrodes(Araneae: Theridiidae) from Japan previously misidentified with A. fissifrons.Acta Arachnologica48, 31–36. doi: 10.2476/asjaa.48.31 Crossref Full Text|Google Scholar Chinta S. P., Goller S., Uhl G., Schulz S. (2016). Identification and synthesis of branched wax-type esters, novel surface lipids from the spiderargyrodes elevatus(Araneae: theridiidae).ChemBiodivers13, 1202–1220. doi: 10.1002/cbdv.201600020 PubMed Abstract|Crossref Full Text|Google Scholar Christenson T. E. (1984). Behaviour of colonial and solitary spiders of the theridiid speciesAnelosimus eximius.Anim. Behav.32, 725–734. doi: 10.1016/S0003-3472(84)80148-7 Crossref Full Text|Google Scholar Christenson T. E., Goist K. C. (1979). Costs and benefits of male-male competition in the orb weaving spider,Nephila clavipes.Behav. Ecol. Sociobiology5, 87–92. doi: 10.1007/BF00302697 Crossref Full Text|Google Scholar Chrysanthus F. (1963). Spiders from South New Guinea. V.Nova Guinea (NS Zool)24, 727–750. Google Scholar Chua T. J. L., Lim M. L. M. (2012). Cross-habitat predation inNepenthes gracilis: The red crab spiderMisumenops nepenthicolainfluences abundance of pitcher dipteran larvae.J. Trop. Ecol.28, 97–104. doi: 10.1017/S0266467411000629 Crossref Full Text|Google Scholar Clark R. J., Jackson R. R. (1994). Self recognition in a jumping spider:Portia labiatafemales discriminate between their own draglines and those of conspecifics.Ethology Ecol. Evol.6, 371–375. doi: 10.1080/08927014.1994.9522987 Crossref Full Text|Google Scholar Clyne D. (1979).The garden jungle(Sydney: Collins). Google Scholar Cobbold S. M., Su Y.-C. (2010). The host becomes dinner: Possible use ofCyclosaas a nuptial gift byArgyrodesin a colonial web.J. Arachnology38, 132–134. doi: 10.1636/HI09-42.1 Crossref Full Text|Google Scholar Coyle F. A. (1995). A revision of the funnelweb mygalomorph spider subfamily Ischnothelinae (Araneae, Dipluridae).Bull. Am. Museum Natural History226), 3–133. Google Scholar Coyle F. A., Meigs T. E. (1989). Two new species of kleptoparasiticMysmenopsis(Araneae, Mysmenidae) from Jamaica.J. Arachnology17, 59–70. Google Scholar Coyle F. A., O'Shields T. C., Perlmutter D. G. (1991). Observations on the behavior of the kleptoparasitic spiderMysmenopsis furtiva.J. Arachnology19, 62–66. Google Scholar Crespi B., Abbot P. (1999). The behavioral ecology and evolution of kleptoparasitism in Australian gall thrips.Florida Entomologist82, 147–164. doi: 10.2307/3496568 Crossref Full Text|Google Scholar Crespo L. C., Cardoso P., Henriques S., Gaspar C. (2009). Spiders (Araneae) from Porto Santo (Madeira, Portugal): additions to the current knowledge.Boletín la Sociedad Entomologica Aragonesa45, 471–475. Google Scholar Cushing P. E. (2012). Spider-ant associations: An updated review of myrmecomorphy, myrmecophily, and myrmecophagy in spiders.Psyche: A J. Entomology2012, 1–23. doi: 10.1155/2012/151989 Crossref Full Text|Google Scholar Davis R. M., Russell M. P. (1969). Commensalism betweenRanzovius moerens(Reuter) (Hemiptera: Miridae) and Hololena curta (McCook) (Araneida: Agelenidae).Psyche76, 262–269. Google Scholar Deyrup M., Kraus J. M., Eisner T. (2004). A Florida caterpillar and other arthropods inhabiting the webs of a subsocial spider (Lepidoptera: Pyralidae; Araneida: Theridiidae).Florida Entomologist87, 554–558. doi: 10.1653/0015-4040(2004)087[0554:afcaoa]2.0.co;2 Crossref Full Text|Google Scholar Dippenaar-Schoeman A. S., Haddad C. R., Foord S. H., Lotz L. N. (2021a).South African National Survey of Arachnida Photo Identification Guide: The Mysmenidae of South Africa (Version 1: 1–6). doi: 10.5281/zenodo.6802505 (Zenodo: online) Crossref Full Text|Google Scholar Dippenaar-Schoeman A. S., Haddad C. R., Foord S. H., Lotz L. N. (2021b).South African National Survey of Arachnida Photo Identification Guide: The Theridiidae of South Africa. Part 1 (A-P): 1–69 Part 2 (R–Z) version 1: 1–23. doi: 10.5281/zenodo.7515997 (Zenodo: online) Crossref Full Text|Google Scholar Dönitz (1887). Über die Copulation von Spinnen.Sitzungsberichte der Gesellschaft naturforschender Freunde zu Berlin1887, 49–51. Google Scholar Downes M. F. (1994). Arthropod nest associates of the social spiderPhryganoporus candidus(Araneae: Desidae).Bull. Br. arachnol. Soc.9, 249–255. Google Scholar Downes M. F. (1995).Australian social spiders: what is meant by ‘social’ records of the western australian museum supplement, Vol. 52. 25–32. Google Scholar Drisya-Mohan O. M., Kavyamol P., Sudhikumar A. V. (2019). Effect of kleptoparasitic ants on the foraging behavior of a social spider (Stegodyphus sarasinorumKarsch 1891).Zoological Stud.58, 3. doi: 10.6620/ZS.2019.58-03 PubMed Abstract|Crossref Full Text|Google Scholar Dupérré N., Tapia E. (2015). Descriptions of four kleptoparasitic spiders of the genusMysmenopsis(Araneae, Mysmenidae) and their potential host spider species in the genusLinothele(Araneae, Dipluridae) from Ecuador.Zootaxa3972, 343–368. doi: 10.11646/zootaxa.3972.3.3 PubMed Abstract|Crossref Full Text|Google Scholar Dupérré N., Tapia E. (2020). Megadiverse Ecuador: A review ofMysmenopsis(Araneae, Mysmenidae) of Ecuador, with the description of twenty-one new kleptoparasitic spider species.Zootaxa4761, 1. doi: 10.11646/zootaxa.4761.1.1 PubMed Abstract|Crossref Full Text|Google Scholar Eberhard W. G. (1979).Argyrodes attenuatus(Theridiidae): a web that is not a snare.Psyche: A Journal of Entomology86, 407–413. doi: 10.1155/1979/31273 Crossref Full Text|Google Scholar Eberhard W. G. (2020).Spider webs: behavior, function, and evolution(Chicago: University of Chicago Press). doi: 10.7208/chicago/9780226534749.001.0001 Crossref Full Text|Google Scholar Eberhard W. G., Barreto M., Pfizenmaier W. (1978). Web robbery by mature male orb-weaving spiders.Bull. Br. arachnol. Soc.4, 228–230. doi: 10.1007/BF00345159 Crossref Full Text|Google Scholar Eberhard W. G., Briceño R. D. (1983). Chivalry in pholcid spiders.Behav. Ecol. Sociobiology13, 189–195. doi: 10.1007/BF00299922 Crossref Full Text|Google Scholar Eberhard W. G., Briceño R. D. (1985). Behavior and ecology of four species ofModisimusandBlechroscelis(Araneae, Pholcidae).Rev. Arachnologique6, 29–36. Google Scholar Eberhard W. G., Platnick N. I., Schuh R. T. (1993). Natural history and systematics of arthropod symbionts (Araneae, Hemiptera, Diptera) inhabiting webs of the spiderTengella radiata(Araneae: Tengellidae).Am. Museum Novitates No.3065, 1–17. Google Scholar Eichenberger B., Siegenthaler E., Schmidt-Entling M. H. (2009). Body size determines the outcome of competition for webs among alien and native sheetweb spiders (Araneae: Linyphiidae).Ecol. Entomology34, 363–368. doi: 10.1111/j.1365-2311.2008.01085.x Crossref Full Text|Google Scholar Elgar M. A. (1989). Kleptoparasitism: a cost of aggregating for an orb-weaving spider.Anim. Behav.37, 1052–1055. doi: 10.1016/0003-3472(89)90152-8 Crossref Full Text|Google Scholar Elgar M. A. (1993). Inter-specific associations involving spiders: kleptoparasitism, mimicry and mutualism.Memoirs Queensland Museum33, 411–430. Google Scholar Elgar M. A. (1994). Experimental evidence of a mutualistic association between two web-building spiders.J. Anim. Ecol.63, 880–886. doi: 10.2307/5265 Crossref Full Text|Google Scholar Elgar M. A., Fahey B. F. (1996). Sexual cannibalism, competition, and size dimorphism in the orb-weaving spiderNephila plumipesLatreille (Araneae: Araneoidea).Behav. Ecol.7, 195–198. doi: 10.1093/beheco/7.2.195 Crossref Full Text|Google Scholar Elgar M. A., Pope B., Williamson I. (1983). Observations on the spatial distribution and natural history ofCyrtophora hirta(L. Koch) (Araneae: Araneidae) in Queensland, Australia.Bull. Br. Arachnological Soc.6, 83–87. Google Scholar Elias N. U., Responte M. A., Wu C.-Y., Chiu Y.-F., Peng P., Liao H., et al. (2024). A shift in the host web occupancy of dew-drop spiders associated with genetic divergence in the Southwest Pacific.J. Biogeography51, 1049–1063. doi: 10.1111/jbi.14803 Crossref Full Text|Google Scholar Emerton J. H. (1882). New England Spiders of the Family Theridiidae.Trans. Connecticut Acad. Arts Sci.6, 1–86. doi: 10.5962/bhl.part.7410 Crossref Full Text|Google Scholar Emerton J. H. (1902).The Common Spiders of the United States. (Boston: Ginn & Company) Google Scholar Emerton J. H. (1909). Supplement to the New England spiders.Trans. Connecticut Acad. Arts Sci.14, 171–236. Google Scholar Emery C. (1909). Über den ursprung der dulotischen, parasitischen und myrmekophilen ameisen.Biologisches Centralblatt29, 352–362. Google Scholar Enders F. (1974). Vertical stratification in orb-web spiders (Araneidae-Araneae) and a consideration of other methods of coexistence.Ecology55, 317–328. doi: 10.2307/1935219 Crossref Full Text|Google Scholar Exline H. (1945a). A new group of the genus Conopistha Karsch 1881 and three new species from Ecuador and Peru.Trans. Connecticut Acad. Arts Sci.36, 177–189. Google Scholar Exline H. (1945b). Spiders of the genusConopistha(Theridiidae, Conopisthinae) from northwestern Peru and Ecuador.Ann. Entomological Soc. America38, 505–528. doi: 10.1093/aesa/38.4.505 Crossref Full Text|Google Scholar Exline H., Levi H. W. (1962). American spiders of the genusArgyrodes(Araneae: Theridiidae).Bull. Museum Comp. Zoology at Harvard Coll.127, 75–204. Google Scholar Fage L. (1928). Part IV. Araneae. In notes on the fauna of pitcher plants.J. Malay Branch Asiatic Soc.6, 13–19. Google Scholar Farr J. A. (1976). Social behavior of the golden silk spider,Nephila clavipes(Linnaeus) (Araneae: Araneidae).J. Arachnology4, 137–144. Google Scholar Faust L. F., De Cock R., Lewis S. M. (2012). Thieves in the night: Kleptoparasitism by fireflies in the genusPhoturisDejean (Coleoptera: Lampyridae).Coleopterists Bull.66, 1–6. doi: 10.1649/072.066.0101 Crossref Full Text|Google Scholar Fernandez-Fournier P., Avilés L. (2018). Environmental filtering and dispersal as drivers of metacommunity composition: complex spider webs as habitat patches.Ecosphere9, e02101. doi: 10.1002/ecs2.2101 Crossref Full Text|Google Scholar Foelix R. F. (1982).Biology of Spiders(Cambridge: Harvard University Press). Google Scholar Foelix R. F. (2010).Biology of spiders(Oxford University Press). Google Scholar Forster R. R., Platnick N. I. (1977). A review of the spider family Symphytognathidae (Arachnida: Araneae).Am. Museum Novitates2619, 1–29. Google Scholar Fowler H. G., Venticinque E. M. (1996). Interference competition and scavenging by Crematogaster ants associated with the webs of the social spiderAnelosimus eximius.J. Kansas Entomological Soc.69, 267–269. Google Scholar Gan W., Liu S., Yang X., Li D., Lei C. (2015). Prey interception drives web invasion and spider size determines successful web takeover in nocturnal orb-web spiders.Biol. Open4, 1326–1329. doi: 10.1242/bio.012799 PubMed Abstract|Crossref Full Text|Google Scholar Gillespie R. G., Rivera M. A. J. (2007). Free-living spiders of the genusAriamnes(Araneae: Theridiidae) in Hawaii.J. Arachnology35, 11–37. doi: 10.1636/H04-05.1 Crossref Full Text|Google Scholar González A., Castro C. D. (1996). Neotropical spiders of the genus Argyrodes Simon (Araneae, Theridiidae).Bull. Br. Arachnol. Soc.10, 127–137. Google Scholar González M., Toscano-Gadea C. A. (2021). Can’t even trust the family? The web of the unusual web-building wolf spider Aglaoctenus lagotis (Araneae: Lycosidae) invaded by typical wandering wolf spiders.Arachnology18, 710–714. doi: 10.13156/arac.2020.18.7.710 Crossref Full Text|Google Scholar Gould J. (2021). Hauling up a hefty meal: Long-jawed spider (Araneae, Tetragnathidae) uses silk lines to transport large prey vertically through the air in the absence of a web.Ethology127, 438–442. doi: 10.1111/eth.13137 Crossref Full Text|Google Scholar Gray M. R. (1983). Spider predation onAchaearanea mundulaL. Koch.Australas. Arachnology13, 6–9. Google Scholar Gray M. R., Anderson G. J. (1989). A new Australian species ofArgyrodesSimon (Araneoidea: Theridiidae) which preys on its host.Proc. Linn. Soc. New South Wales111, 25–30. Google Scholar Gregorič M., Agnarsson I., Blackledge T. A., Kuntner M. (2011). Darwin's bark spider: Giant prey in giant orb webs (Caerostris darwini, Araneae: Araneidae)?J. Arachnology39, 287–295. doi: 10.1636/CB10-95.1 Crossref Full Text|Google Scholar Gregorič M., Quiñones-Lebrón S. G., Kuntner M., Agnarsson I. (2024). Exploring resource patch occupancy: Patch size, but not connectivity, explains the abundance of spider kleptoparasites in golden orb webs.J. Zoology324, 244–252. doi: 10.1111/jzo.13212 Crossref Full Text|Google Scholar Griswold C. E. (1985).Isela okuncana: A new genus and species of kleptoparasitic spider from southern Africa.Ann. Natal Mus.27, 207–217. Google Scholar Griswold C. E., Meikle T. (1987).Archaeodictyna ulova, new species: A remarkable kleptoparasite of group-living eresid spiders (Stegodyphus spp.).Am. Museum Novitates2897, 1–11. Google Scholar Grostal P. (1999). Five species of kleptobiotic Argyrodes Simon (Theridiidae: Araneae) from eastern Australia: descriptions and ecology with special reference to southeastern Queensland.Memoirs of the Queensland Museum43, 621–638. Google Scholar Grostal P., Walter D. E. (1997). Kleptoparasites or commensals? Effects ofArgyrodes antipodianus(Araneae: Theridiidae) onNephila plumipes(Araneae: Tetragnathidae).Oecologia111, 570–574. doi: 10.1007/s004420050273 PubMed Abstract|Crossref Full Text|Google Scholar Grostal P., Walter D. E. (1999). Host specificity and distribution of the kleptobiotic spiderArgyrodes antipodianus(Araneae: Theridiidae) on orb webs in Queensland, Australia.J. Arachnology27, 522–530. Google Scholar Guarisco H. (1999). Distributional status and natural history observations of the genusArgyrodes(Araneae: Theridiidae) in Kansas.Trans. Kansas Acad. Sci.102, 138–141. doi: 10.2307/3627875 Crossref Full Text|Google Scholar Guarisco H. (2000). Three cobweb spider genera (Anelosimus, Tidarren, and Thymoites) andArgyrodes fictiliumrecently discovered in Kansas.J. Kansas Ent. Soc.73, 155–163. Google Scholar Hall D. W. (2019). Orchard Orbweaver, Orchard SpiderLeucauge argyrobapta(White),Leucauge venusta(Walckenaer) (Arachnida: Araneae: Tetragnathidae): EENY728/IN1243, 3/2019.Featured Creatures Collection. doi: 10.32473/edis-in1243-2019 Crossref Full Text|Google Scholar Hanski I. A. (1997).Metapopulation biology: Ecology, genetics, and evolution(San Diego: Academic Press), 512 pages. Google Scholar Hénaut Y. (2000). Host selection by a kleptoparasitic spider.J. Natural History34, 747–753. doi: 10.1080/002229300299390 Crossref Full Text|Google Scholar Hénaut Y., Delme J., Williams T. (2005). Host selection by a kleptobiotic spider.Naturwissenschaften92, 95–99. doi: 10.1007/s00114-004-0597-6 PubMed Abstract|Crossref Full Text|Google Scholar Hénaut Y., Machkour-M’Rabet S. (2010). Interspecific aggregation around the web of the orb spiderNephila clavipes: consequences for the web architecture ofLeucauge venusta.Ethology Ecol. Evol.22, 203–209. doi: 10.1080/03949371003708016 Crossref Full Text|Google Scholar Hénaut Y., Machkour-M’Rabet S., Winterton P., Calmé S. (2010). Insect attraction by webs ofNephila clavipes(Araneae: Nephilidae).J. Arachnology38, 135–138. doi: 10.1636/t08-72.1 Crossref Full Text|Google Scholar Henry T. J. (1984). Revision of the spider-commensal plant bug genusRanzoviusDistant (Heteroptera: Miridae).Proc. Entomological Soc. Washington86, 53–67. Google Scholar Henschel J. R. (1998). Predation on social and solitary individuals of the spiderStegodyphus dumicola(Araneae, Eresidae).J. Arachnology26, 61–69. Google Scholar Henschel J. R., Lubin Y. D. (1992). Environmentalfactors affecting the web and activity of a psam-mophilous spider in the namib desert.J. Arid Environments22, 173–189. doi: 10.1016/s0140-1963(18)30590-1 Crossref Full Text|Google Scholar Hentz N. M. (1850). Descriptions and figures of the araneides of the United States.Boston J. Natural History6, 18–35. Google Scholar Hieber C. S., Uetz G. W. (1990). Colony size and parasitoid load in two species of colonialMetepeiraspiders from Mexico (Araneae: Araneidae).Oecologia82, 145–150. doi: 10.1007/bf00323527 PubMed Abstract|Crossref Full Text|Google Scholar Higgins L. E., Buskirk R. E. (1998). Spider-web kleptoparasites as a model for studying producer-consumer interactions.Behav. Ecol.9, 384–387. doi: 10.1093/beheco/9.4.384 Crossref Full Text|Google Scholar Hiramatsu T. (2012). Kleptoparasitic behavior ofRhomphaeasp. in a web ofNephila clavata.Kishidaia101, 48–49. Google Scholar Hiramatsu T. (2019). Predation ofArgyrodes kumadaibyChorizopes nipponicusin the web ofNephila clavata. 114, 56–57. Google Scholar Hölldobler B., Wilson E. O. (1998).Journey to the ants a story of scientific exploration(Harvard University Press). Google Scholar Hormiga G. (2002).Orsonwelles: A new genus of giant linyphiid spiders (Araneae) from the Hawaiian Islands.Invertebrate Systematics16, 369–448. doi: 10.1071/it01026 Crossref Full Text|Google Scholar Houser J. D., Ginsberg H. S., Jakob E. M. (2014). Competition between introduced and native spiders (Araneae: Linyphiidae).Biol. Invasions16, 2479–2488. doi: 10.1007/s10530-014-0679-0 Crossref Full Text|Google Scholar Houser J. D., Jennings D. T., Jakob E. M. (2005). Predation byArgyrodes trigonumonLinyphia triangularis, an invasive sheet-web weaver in coastal Maine.J. Arachnology33, 193–195. doi: 10.1636/s03-15 Crossref Full Text|Google Scholar Iyengar E. V. (2008). Kleptoparasitic interactions throughout the animal kingdom and a re-evaluation, based on participant mobility, of the conditions promoting the evolution of kleptoparasitism.Biol. J. Linn. Soc.93, 745–762. doi: 10.1111/j.1095-8312.2008.00954.x Crossref Full Text|Google Scholar Jackson R. R. (1985). The biology ofSimaetha paetulaandSimaetha thoracicaweb-building jumping spiders (Araneae: Salticidae) from Queensland, Australia: cohabitation with social spiders, utilization of silk, predatory behavior, and intraspecific interactions.J. Zoological Ser. B1, 175–210. doi: 10.1111/j.1469-7998.1985.tb00071.x Crossref Full Text|Google Scholar Jackson R. R. (1986). Communal jumping spiders (Araneae: Salticidae) from Kenya: Interspecific nest complexes, cohabitation with web-building spiders, and intraspecific interactions.New Z. J. Zoology13, 13–26. doi: 10.1080/03014223.1986.10422643 Crossref Full Text|Google Scholar Jackson R. R. (1987). The biology of Olios spp., huntsman spiders (Araneae, Sparassidae) from Queensland and Sri Lanka: predatory behaviour and cohabitation with social spiders.Bull. Br. Arachnological Soc.7, 133–136. Google Scholar Jackson R. R., Blest A. D. (1982). The biology ofPortia fimbriata, a web-building jumping spider (Araneae, Salticidae) from Queensland: Utilization of webs and predatory versatility.J. Zoology196, 255–293. doi: 10.1111/j.1469-7998.1982.tb03504.x Crossref Full Text|Google Scholar Jackson R. R., Hallas S. E. A. (1986). Comparative biology ofPortia africana, P. albimana,P. fimbriata,P. labiata, andP. shultzi: Utilisation of webs, predatory versatility, and intraspecific interactions.New Z. J. Zoology13, 423–489. doi: 10.1080/03014223.1986.10422978 Crossref Full Text|Google Scholar Jackson R. R., Pollard S. D. (2008). Observations ofPortia africana, an araneophagic jumping spider, living together and sharing prey.New Z. J. Zoology35, 237–242. doi: 10.1080/03014220809510119 Crossref Full Text|Google Scholar Jackson R. R., Whitehouse M. E. A. (1986). The biology of New Zealand and Queensland pirate spiders (Araneae, Mimetidae): aggressive mimicry, araneophagy and prey specialization.J. Zoology210, 279–303. doi: 10.1111/j.1469-7998.1986.tb03635.x Crossref Full Text|Google Scholar Jackson R. R., Wilcox R. S. (1990). Aggressive mimicry, prey-specific predatory behavior, and predator recognition in the predator-prey interactions ofPortia fimbriataand Euryattus sp., jumping spiders from Queensland.Behav. Ecol. Sociobiology26, 111–119. doi: 10.1007/bf00171580 Crossref Full Text|Google Scholar Jäger P., Praxaysombath B. (2011). Spiders from Laos with forty-three new records and first results from the provinces Bolikhamsay and Champasak (Arachnida: Araneae).Acta Arachnologica60, 9–31. doi: 10.2476/asjaa.60.9 Crossref Full Text|Google Scholar Jani M. B., Caleb J. T. D., Kapoor V., Kulkarni S., Uma D. (2023). Aliens in the society: Foreign arthropods and small vertebrates associated with the social spiderStegodyphus sarasinorumKarsch 1892 (Araneae: Eresidae).J. Arachnology51, 57–62. doi: 10.1636/joa-s-22-004 Crossref Full Text|Google Scholar Javed S. M. M., Srinivasulu C., Tampal F. (2010). Addition to araneofauna of Andhra Pradesh, India: occurrence of three species of Argyrodes Simon 1864 (Araneae: Theridiidae).J. Threatened Taxa2, 980–985. doi: 10.11609/JoTT.o2194.980-5 Crossref Full Text|Google Scholar Jeanne R. L. (1972). Social biology of the neotropical waspMischocyttarus drewseni.Bull. Museum Comp. Zoology144, 63–150. Google Scholar Justice M. J., Justice T. C., Vesci R. L. (2005). Web orientation, stabilimentum structure, and predatory behavior ofArgiope floridaChamberlin & Ivie 1944 (Araneae, Araneidae, Argiopinae).J. Arachnology33, 82–92. doi: 10.1636/S03-53 Crossref Full Text|Google Scholar Kaston B. J. (1948). Spiders of connecticut.Bull. Connecticut Geological Natural History Survey70, 1–874. Google Scholar Kaston B. J. (1965). Some little-known aspects of spider behavior.Am. Midland Nat.73, 336–356. doi: 10.2307/2423458 Crossref Full Text|Google Scholar Kerr A. M. (2005). Behavior of web-invading spidersArgyrodes argentatus(Theridiidae) inArgiope appensa(Araneidae) host webs in Guam.J. Arachnology33, 1–6. doi: 10.1636/s02-29 Crossref Full Text|Google Scholar Kerr A. M., Quenga A. S. (2004). Population variation of web-invading spiders (Theridiidae: Argyrodes spp.) on host webs in Guam, Mariana Islands, Micronesia.J. Natural History38, 671–680. doi: 10.1080/0022293031000064413 Crossref Full Text|Google Scholar Keyserling E. (1884).Die Spinnen Amerikas. Theridiidae, Vol. 2, Part 1(Nürnberg: Bauer & Raspe). Google Scholar Keyserling E. (1890).Die Arachniden Australiens. Part II, 37(Nürnberg: Bauer & Raspe). Google Scholar Keyserling E. (1891).Die Spinnen Amerikas(Brasilianische Spinnen). (Nürnberg: Bauer & Raspe). Google Scholar Kim S.-T. (2021).Invertebrate Fauna of Korea, Volume 21, Number 47: Spiders V (Arthropoda: Arachnida: Araneae: Theridiidae, Amaurobiidae, Eresidae, Zoropsidae, Anyphaenidae)(Incheon, Republic of Korea: Published by the National Institute of Biological Resources). Google Scholar Kim B.-W., Kim J.-P. (2007). Taxonomic study of the spider subfamily Argyrodinae (Arachnida: Araneae: Theridiidae) in Korea.Korean J. Sys. Zool.23, 213–222. doi: 10.5635/kjsz.2007.23.2.213 Crossref Full Text|Google Scholar Kim J. P., Ye S. H., Kim T. W., Kim D. H. (2015). One new record species of the genusNeospintharusExline 1950 (Araneae: Theridiidae) from Korea.Korean Arachnology31, 25–28. Google Scholar Knab F. (1915). Commensalism in desmometopa.Proc. Entomological Soc. Washington17, 117–121. Google Scholar Koh T. H., Li D. (2003). State-dependent prey type preferences of a kleptoparasitic spiderArgyrodes flavescens(Araneae: Theridiidae).J. Zoology260, 227–233. doi: 10.1017/S0952836903003674 Crossref Full Text|Google Scholar Krafft B. (1970). Contribution a la biologie et a l'ethologie d'Agelena consociatadenis (araignee sociale du gabon) . i.Biologica Gabonica4, 197–301. Google Scholar Kraus O. (1955). Spinnen von Korsika, Sardinien und Elba.Senckenbergiana Biologica36, 371–394. Google Scholar Kulkarni S., Wood H. M., Hormiga G. (2023). Advances in the reconstruction of the spider tree of life: A roadmap for spider systematics and comparative studies.Cladistics39, 479–532. doi: 10.1111/cla.12557 PubMed Abstract|Crossref Full Text|Google Scholar Kullmann E. (1959a). Beobachtungen und Betrachtungen zum Verhalten der TheridiideConopistha argyrodesWalckenaer (Araneae).Mitt. aus dem Zoologischen Museum Berlin35, 275–292. doi: 10.1002/mmnz.19590350204 Crossref Full Text|Google Scholar Kullmann E. (1959b). Über parasitäres Verhalten der SpinneTheridiumtepidariorum C. L. Koch.Verhandlungen der Deutschen Zoologischen Gesellschaft Münster1959, 332–342. Google Scholar Kullmann E. (1960). Beobachtungen anTheridium tepidariorumC. L. Koch als Mitbewohner vonCyrtophora-Netzen.Deutsche Entomologische Z. Berlin7, 146–163. doi: 10.1002/mmnd.19600070105 Crossref Full Text|Google Scholar Kumada K. (1986).Theridion adamsoniBerland 1934, a newly recorded species from Japan.Atypus88, 1–6. Google Scholar Kumada K. (1990). A new species of the genusArgyrodesfrom Japan (Araneae, Theridiidae).Acta Arachnologica39, 1–5. doi: 10.2476/asjaa.39.1 Crossref Full Text|Google Scholar Kuntner M. (2005). Phylogenetic systematics of the Gondwanan nephilid spider lineage Clitaetrinae (Araneae, Nephilidae).Zoologica Scripta35, 19–62. doi: 10.1111/j.1463-6409.2006.00220.x Crossref Full Text|Google Scholar Kuntner M. (2007). A monograph ofNephilengys, the pantropical ´hermit spiders´ (Araneae, Nephilidae, Nephilinae).Systematic Entomology32, 95–135. doi: 10.1111/j.1365-3113.2006.00348.x Crossref Full Text|Google Scholar Kuntner M., Agnarsson I. (2010). Web gigantism in Darwin's bark spider, a new species from Madagascar (Araneidae:Caerostris).J. Arachnology38, 346–356. doi: 10.1636/B09-113.1 Crossref Full Text|Google Scholar Kuntner M., Agnarsson I. (2011). Biogeography and diversification of hermit spiders on Indian Ocean islands (Nephilidae:Nephilengys).Mol. Phylogenet. Evol.59, 477–488. doi: 10.1016/j.ympev.2011.02.002 PubMed Abstract|Crossref Full Text|Google Scholar Kuntner M., Coddington J. A. (2020). Sexual size dimorphism: evolution and perils of extreme phenotypes in spiders.Annu. Rev. Entomology65, 57–80. doi: 10.1146/annurev-ento-011019-025032 PubMed Abstract|Crossref Full Text|Google Scholar Kuntner M., Hamilton C., Cheng R.-C., Gregorič M., Lupše N., Moriarty Lemmon E., et al. (2019). Golden orbweavers ignore biological rules: Phylogenomic and comparative analyses unravel a complex evolution of sexual size dimorphism.Systematic Biol.68, 555–572. doi: 10.1093/sysbio/syy082 PubMed Abstract|Crossref Full Text|Google Scholar Lamore D. H. (1957). The spiderConopistha trigonaas a commensal ofAllepeira lemniscatain Maryland.Proc. Entomological Soc. Washington59, 79. Google Scholar Lamore D. H. (1958). The jumping spiderPhidippus audaxHentz and the spiderConopistha trigonaHentz as predators of the basilica spider,Allepeira lemniscataWalckenaer, in Maryland.Proc. Entomological Soc. Washington60, 286. Google Scholar Larcher S. F., Wise D. H. (1985). Experimental studies of the interactions between a web-invading spider and two host species.J. Arachnology13, 43–59. Google Scholar Lawrence R. F. (1937). A collection of arachnida from Zululand.Ann. Natal Museum8, 211–273. Google Scholar Le Peru B. (2011). The spiders of europe, a synthesis of data: Volume 1 atypidae to theridiidae.Mémoires la Société Linnéenne Lyon2, 1–522. Google Scholar Leborgne R., Cantarella T., Pasquet A. (1998). Colonial life versus solitary life inCyrtophora citricola(Araneae: Araneidae).Insectes Sociaux45, 125–134. doi: 10.1007/s000400050074 Crossref Full Text|Google Scholar Leborgne R., Lubin Y., Pasquet A. (2011). Kleptoparasites influence foraging behaviour of the spiderStegodyphus lineatus(Araneae: Eresidae).Insectes Sociaux58, 255–261. doi: 10.1007/s00040-010-0144-8 Crossref Full Text|Google Scholar Legendre R. (1960). Quelques remarques sur le comportement desArgyrodesmalgaches.Annales Des. Sci. Naturelles (Zoologie Biologie Animale)2, 507–512. Google Scholar Legendre R. (1961). Études sur les Archaea (Aranéides). II. La capture des proies et la prise de nourriture.Bull. la Société Zoologique France86, 316–319. Google Scholar Levi H. W. (1967). Cosmopolitan and pantropical species of theridiid spiders (Araneae: Theridiidae).Pacific Insects9, 175–186. Google Scholar Levy G. (1985). Spiders of the generaEpisinus,Argyrodes, andCoscinidafrom Israel with additional notes on Theridion (Araneae: Theridiidae).J. Zoology Ser. A207, 87–123. Google Scholar Lin Y.-J., Hu C.-H., Pham D.-S., Li S. (2024). Taxonomic notes of theridiid spiders (Araneae: Theridiidae) from China and Vietnam.Zoological Res.: Diversity and Conservation1, 141–168. doi: 10.24272/j.issn.2097-3772.2024.604 Crossref Full Text|Google Scholar Liu J., May-Collado L. J., Pekár S., Agnarsson I. (2016). A revised and dated phylogeny of cobweb spiders (Araneae, Araneoidea, Theridiidae): A predatory Cretaceous lineage diversifying in the era of the ants (Hymenoptera, Formicidae).Mol. Phylogenet. Evol.94, 658–675. doi: 10.1016/j.ympev.2015.09.023 PubMed Abstract|Crossref Full Text|Google Scholar Lopez A. (1986). Observations on some spiders of Tenerife (Canary Islands).Br. Arachnological Soc. Newslett.45, 6–7. Google Scholar Lopez A. (1988). Les appareils stridulatoires d’Argyrodes dracusChamb. & Iv. (Theridiidae), d’Holocnemus pluchei(Scop.) (Pholcidae) et autres araignées.Bull. la Société d’Étude Des. Sci. Naturelles Béziers (Nouvelle Série)12, 21–31. Google Scholar Lopez A. (1990). Contribution to the study of spiders from Reunion: Introductory note.Bull. la Société Sci. Naturelles67, 13–22. Google Scholar Lubin Y. D. (1974). Adaptive advantages and the evolution of colony formation inCyrtophora(Araneae: Araneidae).Zoological J. Linn. Soc.54, 321–339. doi: 10.1111/j.1096-3642.1974.tb00806.x Crossref Full Text|Google Scholar Lubin Y., Ellner S., Kotzman M. (1993). Web relocation and habitat selection in a desert widow spider.Ecology74, 1915–1928. doi: 10.2307/1940835 Crossref Full Text|Google Scholar Lubin Y. D., Robinson M. H. (1982). Dispersal by swarming in a social spider.Science216, 319–321. doi: 10.1126/science.216.4543.319 PubMed Abstract|Crossref Full Text|Google Scholar Luczak J., Dabrowska-Prot E. (1970). Preliminary observations on the food of the spiderTheridion pictum(Walck.) and its predators.Bull. Br. Arachnological Soc.1, 109. Google Scholar MacArthur R. H., Wilson E. O. (1967).The theory of island biogeography(Princeton University Press). Google Scholar Marples B. J. (1955). Spiders from Western Samoa.J. Linn. Soc. London42, 453–504. doi: 10.1111/j.1096-3642.1955.tb02217.x Crossref Full Text|Google Scholar Mascord R. E. (1980).Spiders of Australia: A Field Guide(Sydney: Reed). Google Scholar McCrate A., Uetz G. W. (2010). Kleptoparasites: a twofold cost of group living for the colonial spiderMetepeira incrassata(Araneae: Araneidae).Behav. Ecol. Sociobiology64, 389–399. doi: 10.1007/s00265-009-0855-x Crossref Full Text|Google Scholar Meira F. A., Gonzaga M. O. (2021). Araneophagy as an alternative foraging tactic to kleptoparasitism in two Argyrodinae (Araneae: Theridiidae) species.Behav. Processes189, 104445. doi: 10.1016/j.beproc.2021.104445 PubMed Abstract|Crossref Full Text|Google Scholar Michálek O., Petráková L., Pekár S. (2017). Capture efficiency and trophic adaptations of a specialist and generalist predator: A comparison.Ecol. Evol.7, 2756–2766. doi: 10.1002/ece3.2812 PubMed Abstract|Crossref Full Text|Google Scholar Miyashita T. (2001). Competition for a limited space in kleptoparasitic Argyrodes spiders revealed by field experiments.Population Ecology43, 97–103. doi: 10.1007/PL00012020 Crossref Full Text|Google Scholar Miyashita T. (2002). Population dynamics of two species of kleptoparasitic spiders under different host availabilities.J. Arachnology30, 31–38. doi: 10.1636/0161-8202(2002)030[0031:PDOTSO]2.0.CO;2 Crossref Full Text|Google Scholar Miyashita T., Maezono Y., Shimazaki A. (2004). Silk feeding as an alternative foraging tactic in a kleptoparasitic spider under seasonally changing environments.J. Zoology262, 225–229. doi: 10.1017/S0952836903004540 Crossref Full Text|Google Scholar Mock S. N. (2008). Arthropod community associated with the webs of the subsocial spiderAnelosimus studiosus.Electronic Theses and Dissertations.702. Available online at:https://digitalcommons.georgiasouthern.edu/etd/702. Google Scholar Moran J. A. (1993).Misumenops nepenthicola: The top aquatic predator of the Nepenthes food web?Brunei Museum J.8, 83–84. Google Scholar Moura R. R., Oliveira I. D., Vasconcellos-Neto J., Gonzaga M. O. (2021). Where ignorance is bliss,’ tis folly to be wise”: Indiscriminate male care in a neotropical spider.Ethology127, 223–230. doi: 10.1111/eth.13112 Crossref Full Text|Google Scholar Moura R. R., Vasconcellos-Neto J., Gonzaga M. O. (2017). Extended male care inManogea porracea(Araneae: Araneidae): The exceptional case of a spider with amphisexual care.Anim. Behav.123, 1–9. doi: 10.1016/j.anbehav.2016.09.018 Crossref Full Text|Google Scholar Moura R. R., Vasconcellos-Neto J., Gonzaga M. O. (2020). Female sexual maturity as a determining factor of size-assortative pairing in the protandrous spiderManogea porracea(Araneae, Araneidae).Zoologischer Anzeiger284, 1–6. doi: 10.1016/j.jcz.2019.11.003 Crossref Full Text|Google Scholar Namkung J. (2003). The spiders of Korea.Arachnologische Mitt.25, 62–63. doi: 10.5431/aramit2506 Crossref Full Text|Google Scholar Nentwig W., Christenson T. E. (1986). Natural history of the non-solitary sheet-weaving spiderAnelosimus jucundus(Araneae: Theridiidae).Zoological J. Linn. Soc.87, 27–35. doi: 10.1111/j.1096-3642.1986.tb01328.x Crossref Full Text|Google Scholar Nyffeler M., Benz G. (1980). Kleptoparasitismus von juvenilen Kreuzspinnen und Skorpionsfliegen in den Netzen adulter Spinnen.Rev. Suisse de Zoologie87, 907–918. doi: 10.3929/ETHZ-A-005779248 Crossref Full Text|Google Scholar Opell B. D. (1979). Revision of the genera and tropical American species of the spider family Uloboridae.Bull. Museum Comp. Zoology148, 443–549. Google Scholar Osses F., Martins E. G., Romero G. Q. (2007). Association of the stilt bugJalysus ossesaeHenry (Hemiptera: Heteroptera: Berytidae) with myrmecophytic plants of the genusMaieta(Melastomataceae) in an upland forest area in central Amazon, Brazil.Proc. Entomological Soc. Washington109, 331–337. Google Scholar Ovatt Mohanan D. M., Neisseril A. K., Ambalaparambil V. S. (2019). Is cooperation in prey capture flexible in the Indian social spiderStegodyphus sarasinorum.Arachnologische Mitt. / Arachnology Lett.58, 97–102. doi: 10.30963/aramit5813 Crossref Full Text|Google Scholar Pasquet A., Leborgne R., Cantarella T. (1997). Opportunistic egg feeding in the kleptoparasitic spiderArgyrodes gibbosus.Ethology103, 160–170. doi: 10.1111/j.1439-0310.1997.tb00015.x Crossref Full Text|Google Scholar Patel B. H., Bradoo B. L. (1981). The cocoon spinning behaviour and maternal care inUloborus ferokusBradoo (Araneae: Uloboridae).Zool. Anz. Leipzig207, 78–87. Google Scholar Pekár S., Sobotník J., Lubin Y. (2011). Armoured spiderman: morphological and behavioural adaptations of a specialised araneophagous predator (Araneae: Palpimanidae).Naturwissenschaften98, 593–603. doi: 10.1007/s00114-011-0804-1 PubMed Abstract|Crossref Full Text|Google Scholar Peng P., Blamires S. J., Agnarsson I., Lin H.-C., Tso I.-M. (2013). A color-mediated mutualism between two arthropod predators.Curr. Biol.23, 172–176. doi: 10.1016/j.cub.2012.11.057 PubMed Abstract|Crossref Full Text|Google Scholar Peng P., Stuart-Fox D., Su Y.-C., Baba Y. G., Elgar M. A. (2024). Fitness effects of symbiotic relationships between arthropod predators: Synergy in a three-way spider symbiosis.Funct. Ecol.38, 1590–1599. doi: 10.1111/1365-2435.14575 Crossref Full Text|Google Scholar Perkins T. A., Riechert S. E., Jones T. S., Jones T. C. (2007). Interactions between the social spiderAnelosimus studiosus(Araneae, Theridiidae) and foreign spiders that frequent its nests.J. Arachnology35, 143–152. doi: 10.1636/t06-43.1 Crossref Full Text|Google Scholar Petrunkevitch A. (1930). The spiders of Porto Rico. Part two.Trans. Conn. Acad. Arts Sci.30, 159–356. Google Scholar Pickard-Cambridge O. (1872). General list of the spiders of Palestine and Syria, with descriptions of numerous new species, and characters of two new genera.Proc. Zoological Soc. London1872, 212–354. Google Scholar Platnick N. I., Forster R. R. (1989). A revision of the temperate South American and Australasian spiders of the family Anapidae (Araneae, Araneoidea).Bull. Am. Mus. Nat. Hist.190, 1–139. Google Scholar Platnick N. I., Shadab M. U. (1978). A review of the spider genusMysmenopsis(Araneae: Mysmenidae).Am. Museum Novitates No.2661, 1–29. Google Scholar Platnick N. I., Shadab M. U. (1979). A review of the spider generaAnapisonaandPseudanapis(Araneae, Anapidae).Am. Mus. Novit.2672, 1–20. Google Scholar Pocock R. I. (1898). The Arachnida from the Province of Natal, South Africa, contained in the collection of the British Museum.Ann. Mag. Nat. Hist.7) 2, 197–226. doi: 10.1080/00222939808678036 Crossref Full Text|Google Scholar Prenter J., Elwood R., Montgomery I. (1994). Male exploitation of female predatory behaviour reduces sexual cannibalism in male autumn spiders,Metellina segmentata.Anim. Behav.47, 235–236. doi: 10.1006/anbe.1994.1031 Crossref Full Text|Google Scholar Proctor H. C. (1992). Cohabitation of six species of spiders in webs ofCyrtophora moluccensis(Araneae: Araneidae) in Moorea, French Polynesia.J. Arachnology20, 144–145. Google Scholar Quero A., Gonzaga M. O., Vasconcellos-Neto J., Moura R. R. (2023). Offspring mortality factors and parental care efficiency of the spiderManogea porracea(Araneidae) in the Brazilian savanna.Ethology Ecol. Evol.35, 551–567. doi: 10.1080/03949370.2022.2152197 Crossref Full Text|Google Scholar Ramírez M. J., Platnick N. I. (1999). OnSofanapis antillanca(Araneae, Anapidae) as a kleptoparasite of austrochiline spiders (Araneae, Austrochilidae).J. Arachnol.27, 547–549. Google Scholar Reimoser E. (1931). Echte Spinnen der deutschen limnologischen Sunda-Expedition.Arch. Hydrobiol.8, 759–770. Google Scholar Responte M., Chiu Y.-F., Peng P., Brown R. M., Yu M.-L., Dai C.-Y., et al. (2021). Northward geographic diversification of a kleptoparasitic spiderArgyrodes lanyuensis(Araneae: Theridiidae) from the Philippine Archipelago to Orchid Island.Ecol. Evol.11, 11241–11266. doi: 10.1002/ece3.7910 PubMed Abstract|Crossref Full Text|Google Scholar Richards O. W. (1953). A communication on commensalism of Desmometopa (Diptera: Milichiidae) with predacious insects and spiders.Proc. R. Entomological Soc. London C18, 55–56. Google Scholar Riechert S. E., Gillespie R. G. (1986). “Habitat choice and utilization in web building spiders,” inSpiders: Webs, Behavior, and Evolution. Ed. Shear W. A. (Stanford University Press, Stanford, CA), 23–48. Google Scholar Rivera M. A. J., Gillespie R. G. (2010). New species of endemic kleptoparasitic spiders of the genusArgyrodes(Araneae: Theridiidae) in the Hawaiian Islands.Pacific Sci.64, 221–231. doi: 10.2984/64.2.221 Crossref Full Text|Google Scholar Roberts N. L. (1952). “A contrast in snares,” inAustralian Spiders., vol. 138–141. Ed. McKeown K. C. (Angus & Robertson, London), 287 pp. Google Scholar Roberts M. J. (1978). Contributions à l'étude de la faune terrestre des îles granitiques de l'archipel des Séchelles. (Mission P. L. G. Benoit - J. J. van Mol 1972). Theridiidae, Mysmenidae and gen. Theridiosoma (Araneidae) (Araneae).Rev. Zool. Afr. Belgium92, 663–674. Google Scholar Robinson M. H. (1977). Symbioses between insects and spiders: An association between lepidopteran larvae and the social spiderAnelosimus eximius(Araneae: Theridiidae).Psyche: A Journal of Entomology84, 225–232. doi: 10.1155/1977/87867 Crossref Full Text|Google Scholar Robinson M. H., Olazarri J. (1971). Units of behavior and complex sequences in the predatory behavior of Argiope argentata (Fabricius): (Araneae: Araneidae). InSmithsonian Contributions to Zoology. Washington: Smithsonian Institution Press. 65. doi: 10.5479/si.00810282.65 Crossref Full Text|Google Scholar Robinson M. H., Robinson B. C. (1976). Ecology and behavior ofNephila maculata: a supplement.Smithson. Contrib. Zool.218, 1–22. doi: 10.5479/si.00810282.218 Crossref Full Text|Google Scholar Robinson M. H., Robinson M. E., Robinson B. (1973). Ecology and behavior of the giant wood spiderNephila maculata(Fabricius) in New Guinea.Smithsonian Contributions to Zoology149, 1–73. doi: 10.5479/si.00810282.149 Crossref Full Text|Google Scholar Rovner J. S. (1968). Territoriality in the sheet web spiderLinyphia triangularis(Clerck) (Araneae, Linyphiidae).Z. Tierpsychol.25, 232–242. doi: 10.1111/j.1439-0310.1968.tb00015.x PubMed Abstract|Crossref Full Text|Google Scholar Rypstra A. (1979). Foraging flocks of spiders: A study of aggregate behavior inCyrtophora citricola(Forskal) (Araneae: Araneidae) in West Africa.Behavioral Ecology and Sociobiology. 5, 291–300. doi: 10.1007/BF00293677 Crossref Full Text|Google Scholar Rypstra A. L. (1981). The effect of kleptoparasitism on prey consumption and web relocation in a Peruvian population of the spiderNephila clavipes.Oikos37, 179–182. doi: 10.2307/3544463 Crossref Full Text|Google Scholar Rypstra A. L. (1989). Foraging success of solitary and aggregated spiders: insights into flock formation.Anim. Behav.37, 274–281. doi: 10.1016/0003-3472(89)90116-4 Crossref Full Text|Google Scholar Rypstra A. L., Binford G. J. (1995).Philoponella republicana(Araneae: Uloboridae) as a commensal in the webs of other spiders.J. Arachnology23, 1–8. Google Scholar Saaristo M. I. (1978). Spiders (Arachnida, Araneae) from Seychelles Islands, with notes on taxonomy.Ann. Zool. Fennici15, 99–126. Google Scholar Saaristo M. I. (2000). Kleptoparasitic theridiid spiders of the granitic Seychelles (Araneae, Theridiidae).Phelsuma8, 49–89. Google Scholar Saaristo M. I. (2010). “Araneae,” inArachnida and Myriapoda of the Seychelles Islands. Eds. Gerlach J., Marusik Y. M. (Siri Scientific Press, Manchester), 8–306. Google Scholar Schmidt G. E. W. (1980). “Zur Spinnenfauna von Lanzarote und Graciosa,” inVerhandlungen 8. Internationaler Arachnologen-Kongress abgehalten an der Universität für Bodenkultur Wien, 7–12 Jul. Ed. Gruber J. (H. Egermann, Vienna), 421–423. Google Scholar Schmidt G. (1999). Was führt beiNephila inaurata Madagascariensis(Vinson 1863) (Araneae: Araneidae: Nephilinae) zur Koloniebildung?Arachnol. Mag.7, 38720. Google Scholar Schmidt G. (2005). Das Weibchen vonGrammostola aureostriataSchmidt & Bullmer 2001 (Araneae: Theraphosidae: Theraphosinae).Tarantulas World106, 3–6. Google Scholar Schmidt G., Geisthardt M., Piepho F. (1994). Zur Kenntnis der Spinnenfauna der Kapverdischen Inseln (Arachnida: Araneida).Mitt. Des. Internationalen Entomologischen Vereins19, 3–4. Google Scholar Schneider J. M. (1997). Timing of maturation and the mating system of the spider,Stegodyphus lineatus(Eresidae): how important is body size?Biol. J. Linn. Soc.60, 517–525. Google Scholar Schneider J. M., Lubin Y. (1996). Infanticidal male eresid spiders.Nature381, 655–656. doi: 10.1038/381655a0 Crossref Full Text|Google Scholar Schneider J. M., Lubin Y. (1997). Infanticide by males in a spider with suicidal maternal care,Stegodyphus lineatus(Eresidae).Anim. Behav.54, 305–312. doi: 10.1006/anbe.1996.0454 PubMed Abstract|Crossref Full Text|Google Scholar Scott C. E., McCann S. (2023). They mostly come at night: Predation on sleeping insects by introduced candy-striped spiders in North America.Ecology104, e4025. doi: 10.1002/ecy.4025 PubMed Abstract|Crossref Full Text|Google Scholar Sekhar R., Jose S. K. (2018). First record ofRhomphaea labiata(Zhu & Song 1991) from India (Araneae: Theridiidae).J. Entomology Zoology Stud.6, 2774–2776. Google Scholar Shinkai A. (1988). A note on the web silk theft byArgyrodes cylindratusThorell (Araneae: Theridiidae).Acta Arachnologica36, 115–119. doi: 10.2476/asjaa.36.115 Crossref Full Text|Google Scholar Shinkai A. (1992).Rhomphaea saganacaught a cranefly.Kishidaia64, 39–40. Google Scholar Shinkai A. (2000).Argyrodes flavescenscaught byRhomphaeasp. in a web ofNephila maculata.Kishidaia78, 37. Google Scholar Sibi K. K., Gigi P., Sudhikumar A. V. (2022). First report of the kleptoparasitic spiderArgyrodes miniaceus(Doleschall 1857) (Araneae: Theridiidae) from India.Serket19, 90–94. Google Scholar Sierwald P., Fenzl T. (1999).Argyrodesin webs of the Floridian red widow spider (Araneae: Theridiidae).Florida Entomologist82, 359–361. doi: 10.2307/3496591 Crossref Full Text|Google Scholar Silveira M. C., Japyassú H. F. (2012). Notes on the behavior of the kleptoparasitic spiderArgyrodes elevatus.Revista de Etologia11, 56–67. Google Scholar Simon E. (1864).Histoire naturelle des Araignées (Aranéides)(Paris: Roret). Google Scholar Simon E. (1892).Histoire naturelle des Araignées, tome 1 (fasc. 1)(Paris: Roret). Google Scholar Simon E. (1894).Histoire naturelle des Araignées, tome 1 (fasc. 3)(Paris: Roret), 489–760. Google Scholar Sivinski J., Marshall S. D., Petersson E. (1999). Kleptoparasitism and phoresy in the diptera.Florida Entomologist82, 179–197. doi: 10.2307/3496570 Crossref Full Text|Google Scholar Sivinski J., Stowe M. K. (1980). A kleptoparasitic cecidomyiid and other flies associated with spiders.Psyche87, 337–348. doi: 10.1155/1980/27685 Crossref Full Text|Google Scholar Smith Trail D. R. (1980). Predation byArgyrodes(Theridiidae) on solitary and communal spiders.Psyche (Cambridge)87, 349–355. doi: 10.1155/1980/74071 Crossref Full Text|Google Scholar Spear D. M., Foster W. A., Advento A. D., Naim M., Caliman J. P., Luke S. H., et al. (2018). Simplifying understory complexity in oil palm plantations is associated with a reduction in the density of a kleptoparasitic spider,Argyrodes miniaceus(Araneae: Theridiidae), in host (Araneae: Nephilinae) webs.Ecol. Evol.8, 1595–1603. doi: 10.1002/ece3.3772 PubMed Abstract|Crossref Full Text|Google Scholar Srinivasulu C., Srinivasulu B., Javed S. M. M., Tampal F., Subramaniyam M., Nagulu V., et al. (2013). Additions to the araneofauna of Andhra Pradesh, India - Part II. Records of interesting species of the comb-footed generaLatrodectus,Rhomphaea, andColeosoma(Araneae: Theridiidae).J. Threatened Taxa5, 4483–4491. doi: 10.11609/JoTT.o2660.4483-91 Crossref Full Text|Google Scholar Straus S., Avilés L. (2018). Effects of host colony size and hygiene behaviours on social spider kleptoparasite loads along an elevation gradient.Funct. Ecol.32, 2707–2716. doi: 10.1111/1365-2435.13225 Crossref Full Text|Google Scholar Straus S., Avilés L. (2023). Sublethal effects of kleptoparasitism on experimental social spider colonies.Ethology129, 649–654. doi: 10.1111/eth.13401 Crossref Full Text|Google Scholar Striffler B. F., Rembold K. (2009). “Henriksenia labuanicanom. nov., a replacement name forMisumenops nepenthicolaBristowe, (1930) and the clarification of the current taxonomic status ofMisumenops nepenthicolaFage, (1928) (Arachnida, Araneae, Thomisidae),” inPitcher Plants of the Old World. Ed. McPherson S. (Redfern Natural History Publications, Dorset), 1334–1338. Google Scholar Struhsaker T. T. (1969). Notes on the spiders Uloborus mundior (Chamberlin and Ivie) and Nephila clavipes (Linnaeus) in Panama.Am. Midland Nat.82, 611–613. doi: 10.2307/2423802 Crossref Full Text|Google Scholar Su Y.-C. (2012).A gang of thieves: Evolution of cooperative kleptoparasitism in the subfamily Argyrodinae (Araneae: Theridiidae). University of Kansas, Lawrence. Google Scholar Su Y.-C., Peng P., Elgar M. A., Smith D. R. (2018). Dual pathways in social evolution: Population genetic structure of group-living and solitary species of kleptoparasitic spiders (Argyrodinae: Theridiidae).PLoS One13, e0208123. doi: 10.1371/journal.pone.0208123 PubMed Abstract|Crossref Full Text|Google Scholar Su Y.-C., Smith D. R. (2014). Evolution of host use, group-living, and foraging behaviours in kleptoparasitic spiders: Molecular phylogeny of the Argyrodinae (Araneae: Theridiidae).Invertebrate Systematics28, 415–431. doi: 10.1071/is14010 Crossref Full Text|Google Scholar Su Y.-C., Wu C.-Y., Hung J.-Y., Yang C.-H., Li B., Moi S.-H., et al. (2021). Machine learning data imputation and prediction of foraging group size in a kleptoparasitic spider.Mathematics9, 415. doi: 10.3390/math9040415 Crossref Full Text|Google Scholar Suzuki Y., Ikemoto M., Yokoi T. (2022). The ontogenetic dietary shift from non-dangerous to dangerous prey in predator-eating predators under capture risk.Ecol. Evol.12, ece3–9609. doi: 10.1002/ece3.9609 PubMed Abstract|Crossref Full Text|Google Scholar Taczanowski L. (1873). Les Aranéides de la Guyane française.Horae Societatis Entomologicae Rossicae113-150, 261–286. Google Scholar Tanaka K. (1984). Rate of predation by a kleptoparasitic spider, Argyrodes fissifrons, upon a large host spider,Agelena limbata.J. Arachnology12, 363–367. Google Scholar Tanikawa A. (2017).Uloborus plumipesandDipoena pelorosa(Araneae: Uloboridae, Theridiidae): two newly recorded spiders in Japan.Acta Arachnologica66, 5–8. doi: 10.2476/asjaa.66.5 Crossref Full Text|Google Scholar Thorell T. (1887). Viaggio di L. Fea in Birmania e regioni vicine. II. Primo saggio sui Ragni birmani.Annali del Museo Civico di Storia Naturale di Genova, 5–417. Google Scholar Thornhill R. (1975). Scorpionflies as kleptoparasites of web-building spiders.Nature258, 709–711. doi: 10.1038/258709b0 Crossref Full Text|Google Scholar Tikader B. K. (1970). Spider fauna of sikkim.Records Zoological Survey India64, 1–83. doi: 10.26515/rzsi/v64/i1-4/1966/161523 Crossref Full Text|Google Scholar Tikader B. K. (1977). Studies on spider fauna of Andaman and Nicobar Islands, Indian Ocean.Records Zoological Survey India72, 153–212. doi: 10.26515/rzsi/v72/i1-4/1977/161929 Crossref Full Text|Google Scholar Trager M. D., Bhotika S., Hostetler J. A., Andrade G. V., Rodriguez-Cabal M. A., McKeon C. S., et al. (2010). Benefits for plants in ant-plant protective mutualisms: A meta-analysis.PLoS One5, e14308. doi: 10.1371/journal.pone.0014308 PubMed Abstract|Crossref Full Text|Google Scholar Tso I.-M., Severinghaus L. L. (1998). Silk stealing byArgyrodes lanyuensis(Araneae: Theridiidae): a unique form of kleptoparasitism.Anim. Behav.56, 219–225. doi: 10.1006/anbe.1998.0770 PubMed Abstract|Crossref Full Text|Google Scholar Tso I. M., Severinghaus L. L. (2000).Argyrodes fissifronsinhabiting webs ofCyrtophorahosts: Prey size distribution and population characteristics.Zoological Stud.39, 236–242. Google Scholar Uetz G. W. (1989). The \"ricochet effect\" and prey capture in colonial spiders.Oecologia81, 154–159. doi: 10.1007/bf00379799 PubMed Abstract|Crossref Full Text|Google Scholar Uetz G. W., Boyle J., Hieber C. S., Wilcox R. S. (2002). Anti-predatorbenefits of group living in colonial web-building spiders – the“Early Warning“ effect.Anim. Behav.63, 445–452. doi: 10.1006/anbe.2001.1918 Crossref Full Text|Google Scholar Vanuytven H., Jocqué R., Deeleman-Reinhold C. (2024). Two new theridiid genera from Southeast Asia (Araneae: Theridiidae, Argyrodinae): males with a nose for courtship.J. Belgian Arachnological Soc.39, 1–96. Google Scholar Vinson A. (1863).Aranéides des Iles de la Réunion, Maurice et Madagascar(Paris: Librairie Encyclopédique de Roret). doi: 10.5962/bhl.title.125517 Crossref Full Text|Google Scholar Vollrath F. (1976). Konkurrenzvermeidung bei tropischen kleptoparasitischen Haubennetzspinnen der GattungArgyrodes(Arachnida, Araneae, Theridiidae).Entomologia Generalis3, 104–108. Google Scholar Vollrath F. (1977).Zur Ökologie und Biologie von kleptoparasitischen Argyrodes elevatus und synöken Argyrodes-Arten (Araneae, Theridiidae) (Doctoral Thesis). University of Freiburg. Google Scholar Vollrath F. (1978). A close relationship between two spiders (Arachnida, Araneidae):Curimagua bayanosynecious on aDipluraspecies.Psyche85, 347–353. doi: 10.1155/1978/27439 Crossref Full Text|Google Scholar Vollrath F. (1979a). Behaviour of the kleptoparasitic spiderArgyrodes elevatus(Araneae: Theridiidae).Anim. Behav.27, 519–521. doi: 10.1016/0003-3472(79)90186-6 Crossref Full Text|Google Scholar Vollrath F. (1979b). Vibrations: Their signal function for a spider kleptoparasite.Science205, 1149–1151. doi: 10.1126/science.205.4411.1149 PubMed Abstract|Crossref Full Text|Google Scholar Vollrath F. (1980). Male body size and fitness in the web-building spiderNephila clavipes.Z. für Tierpsychologie - J. Comp. Ethology53, 61–78. doi: 10.1111/j.1439-0310.1980.tb01052.x Crossref Full Text|Google Scholar Vollrath F. (1982). Colony foundation in a social spider.Ethology60, 313–325. doi: 10.1111/j.1439-0310.1982.tb01089.x Crossref Full Text|Google Scholar Vollrath F. (1984). Kleptobiotic interactions in invertebrates. In: Barnard C. J., ed.Producers and scroungers: strategies of exploitation and parasitism. London: Croom-Helm, 61–66. Google Scholar Vollrath F. (1987). “Kleptobiosis in spiders,” inEcophysiology of spiders. Ed. Nentwig W. (Springer-Verlag, Berlin), 274–286. doi: 10.1007/978-3-642-71552-5_20 Crossref Full Text|Google Scholar Vollrath F. (1977). Zur (kologie und biologie yon kleptoparasitischenArgyrodes elevatusund synokenArgyrodesarten.Dissertation Univ. Freiburg.. Google Scholar Watson P. J. (1990). Female-enhanced male competition determines the first mate and principal sire in the spiderLinyphia litigiosa(Linyphiidae).Behav. Ecol. Sociobiology26, 77–90. doi: 10.1007/BF00171577 Crossref Full Text|Google Scholar Wheeler W. M. (1901). The compound and mixed nests of American ants.Am. Nat.35, 431–448. doi: 10.1086/277964 Crossref Full Text|Google Scholar Wheeler C. C., Coddington J. A., Crowley L. M., Dimitrov D., Goloboff P. A., Griswold C. E., et al. (2017). The spider tree of life: phylogeny of Araneae based on target-gene analyses from an extensive taxon sampling.Cladistics33, 574–616. doi: 10.1111/cla.12182 PubMed Abstract|Crossref Full Text|Google Scholar Wheeler A. G., McCaffrey J. P. (1984).Ranzovius contubernalis: Seasonal history, habits, and description of fifth instar, with speculation on the origin of spider commensalism in the genus Ranzovius (Hemiptera: Miridae).Proc. Entomol. Soc. Wash.86, 68–81. Google Scholar Whitehouse M. E. A. (1986). The foraging behaviours ofArgyrodes antipodiana(Theridiidae), a kleptoparasitic spider from New Zealand.New Z. J. Zoology13, 151–159. doi: 10.1080/03014223.1986.10422658 Crossref Full Text|Google Scholar Whitehouse M. E. A. (1987b). Spider eat spider\": the predatory behavior of Rhomphaea sp. from New Zealand.J. Arachnology15, 355–366. Google Scholar Whitehouse M. E. A. (1988). Factors influencing specificity and choice of host inArgyrodes antipodiana(Theridiidae: Araneae).J. Arachnology16, 349–355. Google Scholar Whitehouse M. E. A. (1991). To mate or fight? Male-male competition and alternative mating strategies inArgyrodes antipodiana(Theridiidae: Araneae).Behav. Processes23, 163–172. doi: 10.1016/0376-6357(91)90046-3 PubMed Abstract|Crossref Full Text|Google Scholar Whitehouse M. E. A. (1997a). The benefits of stealing from a predator: foraging rates, predation risk, and intraspecific aggression in the kleptoparasitic spiderArgyrodes antipodiana.Behav. Ecol.8, 665–667. doi: 10.1093/beheco/8.6.665 Crossref Full Text|Google Scholar Whitehouse M. E. A. (1997b). Experience influences male–male contests in the spiderArgyrodes antipodiana(Theridiidae: Araneae).Anim. Behav.53, 913–923. doi: 10.1006/anbe.1996.0313 Crossref Full Text|Google Scholar Whitehouse M. (2011). “Kleptoparasitic spiders of the subfamily Argyrodinae: A special case of behavioural plasticity,” inSpider Behaviour: Flexibility and Versatility. Ed. Herberstein M. E. (Cambridge: Cambridge University Press), 348–386. doi: 10.1017/CBO9780511974496.011 Crossref Full Text|Google Scholar Whitehouse M. E. A. (2016). Sex-linked differences in learning to improve foraging techniques in the group-living kleptoparasitic spiderArgyrodes antipodianus(Theridiidae).New Z. J. Zoology43, 96–111. doi: 10.1080/03014223.2015.1127264 Crossref Full Text|Google Scholar Whitehouse M. E. A., Agnarsson I., Miyashita T., Smith D. R., Cangialosi K. R., Masumoto T., et al. (2002).Argyrodes: Phylogeny, sociality, and interspecific interactions: A report on theArgyrodesSymposium, Badplaas 2001.J. Arachnology30, 238–245. doi: 10.1636/0161-8202(2002)030[0238:APSAII]2.0.CO;2 Crossref Full Text|Google Scholar Whitehouse M. E. A., Jackson R. R. (1993). Group structure and time budgets ofArgyrodes antipodiana(Araneae: Theridiidae), a kleptoparasitic spider from New Zealand.New Z. J. Zoology20, 201–206. doi: 10.1080/03014223.1993.10422860 Crossref Full Text|Google Scholar Whitehouse M. E. A., Jackson R. R. (1994). Intraspecific interactions ofArgyrodes antipodiana, a kleptoparasitic spider from New Zealand.New Z. J. Zoology21, 253–268. doi: 10.1080/03014223.1994.9517993 Crossref Full Text|Google Scholar Whitehouse M. E. A., Jackson R. R. (1998). Predatory behaviour and parental care inArgyrodes flavipes, a social spider from Queensland.J. Zoology244, 95–105. doi: 10.1111/j.1469-7998.1998.tb00011.x Crossref Full Text|Google Scholar Whitehouse M.-E. A., Lubin Y. (2005). The functions of societies and the evolution of group living: Spider societies as a test case.Biol. Rev.80, 347–361. doi: 10.1017/S1464793104006694 PubMed Abstract|Crossref Full Text|Google Scholar Wickler W., Seibt U. (1988). Two species ofStegodyphusspiders as solitary parasites in socialS. dumicolacolonies (Araneida, Eresidae).Verhandlungen Des. Naturwissenschaftlichen Vereins Hamburg30, 311–317. Google Scholar Wiehle H. (1928). Beiträge zur Biologie der Araneen, insbesondere zur Kenntis der Radnetzbaues.Z. für Morphologie und Ökologie der Tiere11, 115–151. doi: 10.1007/BF02425772 Crossref Full Text|Google Scholar Wise D. H. (1975). Food limitation of the spiderLinyphia marginata: Experimental field studies.Ecology56, 637–646. doi: 10.2307/1935497 Crossref Full Text|Google Scholar Wise D. H. (1981). Inters- and intraspecific effects of density manipulations upon females of two orb-weaving spiders (Araneae, Araneidae).Oecologia48, 252–256. doi: 10.1007/BF00347972 PubMed Abstract|Crossref Full Text|Google Scholar Wise D. H. (1982). Predation by a commensal spider,Argyrodes trigonum, upon its host: an experimental study.J. Arachnology10, 111–116. Google Scholar Wise D. H. (2006). Cannibalism, food limitation, intraspecific competition, and the regulation of spider populations.Annu. Rev. Entomology51, 441–465. doi: 10.1146/annurev.ento.51.110104.150947 PubMed Abstract|Crossref Full Text|Google Scholar Wood H. M., Griswold C. E., Gillespie R. G. (2012). Phylogenetic placement of pelican spiders (Archaeidae, Araneae), with insight into evolution of the \"neck\" and predatory behaviours of the superfamily Palpimanoidea.Cladistics28(6), 598–626. doi: 10.1111/j.1096-0031.2012.00411.x PubMed Abstract|Crossref Full Text|Google Scholar WSC (2025).World Spider Catalog. Version 26(Natural History Museum Bern). doi: 10.24436/2 Crossref Full Text|Google Scholar Yaginuma T. (1956).In World spiders.(Osaka), 64 p. Google Scholar Yaginuma T. (1986).Spiders of Japan in color(Higashi-ku: Hoikusha Publishing). Google Scholar Yoshida M. (2001a). Kleptoparasitic behaviors of two orb-weaving spiders in webs abandoned byMetleucauge kompirensis(Araneae: Tetragnathidae).Acta Arachnologica50, 5–10. doi: 10.2476/asjaa.50.5 Crossref Full Text|Google Scholar Yoshida M. (2001b). Seasonal changes in the frequency of intrusion by web spiders into webs abandoned byMetleucauge kompirensis(Araneae: Tetragnathidae).Acta Arachnologica50, 117–125. doi: 10.2476/asjaa.50.117 Crossref Full Text|Google Scholar Yoshida H., Tso I. M., Severinghaus L.-L. (1998). Description of a new species of the genus Argyrodes (Araneae: Theridiidae) from Orchid Island, Taiwan, with notes on its ecology and behavior.Acta Arachnologica47, 1–5. doi: 10.2476/asjaa.47.1 Crossref Full Text|Google Scholar Young A. M. (1971). Foraging for insects by a tropical hummingbird.Condor73, 36–45. doi: 10.2307/1366122 Crossref Full Text|Google Scholar Zhang X., Lan T., Nie L., Li S. (2020). Eight new species of the spider genusPimoa(Araneae, Pimoidae) from Tibet, China.ZooKeys 940, 79–104. doi: 10.3897/zookeys.940.49793 PubMed Abstract|Crossref Full Text|Google Scholar Zhang H., Zhong R., Yu L., Chen J., Agnarsson I., Liu J. (2022). Safety is increasingly important in cobweb spiders based on life history.Integr. Zoology18, 736–745. doi: 10.1111/1749-4877.12682 PubMed Abstract|Crossref Full Text|Google Scholar Zhu M. S., Song D. X. (1991). Notes on the genusargyrodesfrom China (Araneae: theridiidae).J. Hebei Pedagogic Coll. (Natural Science)1991, 130–146. Google Scholar Keywords:Kleptoparasitism, commensal, Theridiidae, spider webs, kleptotany Citation:Agnarsson I (2025) Spiders as superhosts and secondary kleptoparasites.Front. Arachn. Sci.4:1544428. doi: 10.3389/frchs.2025.1544428 Received:12 December 2024;Accepted:19 February 2025;Published:15 April 2025. Edited by: Reviewed by: Copyright© 2025 Agnarsson. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Ingi Agnarsson,aWFnbmFyc3NvbkBnbWFpbC5jb20= Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract 1 Introduction 2 Spider superhosts: webs provide refuge and resources 3 Diversity of organisms as kleptoparasites of spiders 4 Facultative kleptoparasitism in spiders and araneophages in kleptoparasitic lineages 5 Host response to kleptoparasitism 6 Conclusions 7 Future directions Data availability statement Author contributions Funding Acknowledgments Conflict of interest Generative AI statement Publisher’s note Supplementary material References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}