{"id": 271, "name": "Contagion", "domain": "contagionlive.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://www.contagionlive.com/publications/contagion/contagion-spring-2025-digital-edition", "title": "Contagion Spring 2025 Digital Edition", "content": "Antimicrobial Stewardship Bench to Bedside With SIDP C. difficile Clinical Corner Fungal Infections Hepatitis RSV: A New Era in Prevention SpotlightNewsMediaConferencePublicationCME/CEPartnersResourcesContributeSubscribe Spotlight News Media Conference Publication CME/CE Partners Resources Contribute Subscribe Spotlight News Media Conference Publication CME/CE Partners Resources Contribute Subscribe **Contagion, Spring 2025 Digital Edition** **Clickhereto view our interactive Spring 2025 Issue.** Ocular Syphilis and Neurosyphilis in a Patient Living With HIV Read More Read More When Should We De-Escalate Empiric Antimicrobials? De-escalating empiric antimicrobial therapy is a strategy to combat antimicrobial resistance. Antimicrobial stewardship programs can play a major role in preserving antibiotic effectiveness and preventing unnecessary antibiotic use. De-escalating empiric antimicrobial therapy is a strategy to combat antimicrobial resistance. Antimicrobial stewardship programs can play a major role in preserving antibiotic effectiveness and preventing unnecessary antibiotic use. Read More Read More Dose Optimization as a Strategy to Improve Clinical Outcomes and Suppress Antimicrobial Resistance From the discovery of penicillin to PK-PD principles: A brief historical overview and what we have learned from recent clinical trials. From the discovery of penicillin to PK-PD principles: A brief historical overview and what we have learned from recent clinical trials. Read More Read More HIV's Golden Age: Responding to the Needs of an Aging Population As the cohort of people living with HIV in the US ages, HIV care programs must rapidly adapt to the changing needs of older adults with HIV. As the cohort of people living with HIV in the US ages, HIV care programs must rapidly adapt to the changing needs of older adults with HIV. Read More Read More Shifting Sands in Cellulitis This common skin and soft tissue infection has a high recurrence rate and significant treatment failure. β-Lactams remain effective first-line treatments, though rising resistance to clindamycin and tetracycline, especially in GAS, is a growing concern. This common skin and soft tissue infection has a high recurrence rate and significant treatment failure. β-Lactams remain effective first-line treatments, though rising resistance to clindamycin and tetracycline, especially in GAS, is a growing concern. Read More Read More Rifaquizinone: A Novel Rifamycin-Quinolone Hybrid Antibiotic Rifaquizinone is a dual-pharmacophore antibiotic combining rifamycin and a fluoroquinolone-like compound, showing strong bactericidal activity against resistant Staphylococcus aureus strains and biofilms, with promising results for treating prosthetic joint infections (PJI) but limited oral bioavailability. Rifaquizinone is a dual-pharmacophore antibiotic combining rifamycin and a fluoroquinolone-like compound, showing strong bactericidal activity against resistant Staphylococcus aureus strains and biofilms, with promising results for treating prosthetic joint infections (PJI) but limited oral bioavailability. Read More Read More Complicating the Uncomplicated: A Bundled Approach to Reducing Inappropriate Antibiotic Prescribing for Acute Uncomplicated Bronchitis A recent study evaluated bundled ambulatory stewardship interventions (ASIs) — audits, reporting, webinars, and electronic alerts — to reduce inappropriate antibiotic prescriptions (IAPs) for acute uncomplicated bronchitis (AUB). A recent study evaluated bundled ambulatory stewardship interventions (ASIs) — audits, reporting, webinars, and electronic alerts — to reduce inappropriate antibiotic prescriptions (IAPs) for acute uncomplicated bronchitis (AUB). Read More Read More Is Renal-Adjusted Ceftazidime/Avibactam in Patients With KPC-Producing Klebsiella Pneumoniae Bloodstream Infection Associated With Increased Mortality? Read More Read More PEPFAR: A Legacy of American Goodwill and Influence Read More Read More H5N1: The Outbreak the US Got Bored With Since its detection in early 2024, H5N1 has spread to dairy cows, poultry, and wild birds. Political factors, including leadership changes at the Centers for Disease Control and Prevention and cuts to public health resources, have worsened the situation, leading to a weakened response. Since its detection in early 2024, H5N1 has spread to dairy cows, poultry, and wild birds. Political factors, including leadership changes at the Centers for Disease Control and Prevention and cuts to public health resources, have worsened the situation, leading to a weakened response. Read More Read More Contagion Spring 2025 Digital Edition View our interactive Spring 2025 digital edition. View our interactive Spring 2025 digital edition. Read More Read More 2 Commerce DriveCranbury, NJ 08512 609-716-7777"}