{"id": 169, "name": "B.T. Denmark", "domain": "bt.dk", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.bt.dk/politik/det-er-en-katastrofe-stoejberg-og-messerschmidt-raser-over-ny-indvandreropgoerelse", "title": "Det Er En Katastrofe Stoejberg Og Messerschmidt Raser Over Ny Indvandreropgoerelse", "content": "**** Nyheder Sport Underholdning Penge Menu **'Det er en katastrofe': Støjberg og Messerschmidt raser over ny indvandreropgørelse** Flere politikere tordner nu mod statsminister Mette Frederiksen. Èn formand kræver sågar, at hun nu udskriver valg. Det sker, efter at B.T. tirsdag kunne fortælle, at der i dag erni områder i Danmark, hvor personer med dansk oprindelse er i undertal. »Jeg opfordrer statsministeren til øjeblikkelig at udskrive valg, så danskerne får mulighed for at afværge den demografiske katastrofe, der er undervejs - ved at vælge et nyt flertal,« tordner Morten Messerschmidt. Nyheden skriver sig ind i en verserende debat om den såkaldte 'befolkningsudskiftning.' Den blev sparket igang af en demografisk fremskrivningi Politiken, der viser, at flertallet i Danmark i 2096 kan være indvandrere eller efterkommere. Dansk Folkeparti-formanden står ikke alene med sin kritik. I koret melder også Inger Støjberg sig. »Det er ganske rædselsfuldt,« siger hun til B.T. og fortsætter: »Vi har sorte pletter i Danmark, og der er områder, hvor danskerne er i mindretal, og det kan vi simpelthen ikke være bekendt.« Hvorfor egentlig ikke - der er jo altså blot tale om nogle fordelingstal? »Danmark er danskernes land. Og sådan skal det vedblive med at være. Alt for mange af dem, der kommer hertil arbejder ikke, er på offentlig forsørgelse og mange er kriminelle. Nu må regeringen vågne op!« Det er på baggrund af en særkørsel fra Danmarks Statistik foretaget for B.T., at de ni områder er kommet frem i lyset. Af ovenstående tabel fremgår det, at Tingbjerg i Københavns Kommune topper listen. Her har blot 25 procent af borgerne dansk oprindelse. Til gengæld har hele 67 procent ikkevestlig baggrund - enten i kraft af at være indvandrer eller efterkommer. På andenpladsen befinder Vollsmose sig i Odense Kommune, hvoraf kun 34 procent af beboerne har dansk oprindelse. Morten Messerschmidt langer ud efter statsminister Mette Frederiksen (S). Han mener nemlig, hun bærer en væsentlig del af ansvaret, fordi indvandringen fra muslimske lande er steget med124 procent under hende. »Det er dén udvikling, som vi nu ser konsekvensen af. En reel befolkningsudskiftning, hvor danskere bliver i mindretal. Lige nu i en række byer. I fremtiden på landsplan,« siger han og fortsætter: 'Det er resultatet af en forfejlet og hyklerisk udlændingepolitik, hvor man i festtaler lover stramninger, men i praksis åbner døren på vid gab,' udtaler Morten Messerschmidt.Foto: Mads Claus Rasmussen/Ritzau ScanpixVis mere'Det er resultatet af en forfejlet og hyklerisk udlændingepolitik, hvor man i festtaler lover stramninger, men i praksis åbner døren på vid gab,' udtaler Morten Messerschmidt.Foto: Mads Claus Rasmussen/Ritzau Scanpix »Det er en katastrofe og viser, hvor afgørende Dansk Folkepartis indflydelse er.« Hvorfor er det ligefrem en katastrofe - det er vel folks værdier og ikke hudfarve, der er afgørende? »Vi taler jo ikke om adoptivbørn, når tallene viser dansk mindretal i Brøndby. Det er indvandrere fra muslimske lande. Så det synes jeg, er en fuldstændig afsporing af debatten,« lyder det fra Messerschmidt. B.T. har præsenteret Morten Messerschmidt og Inger Støjbergs kritik for statsminister Mette Frederiksen. Statsministeriet pressetjeneste henviser til Socialdemokratiets politiske ordfører Christian Rabjerg Madsen. »Vi har heldigvis langt bedre styr på asyltilstrømningen, end dengang Støjberg og DF havde ansvaret. I 2016 var der omkring 2500 ansøgere om indfødsret fra Mellemøsten og Nordafrika. Og på asylområdet blev der tildelt 7000 opholdstilladelser - i dag er det tal omkring 1000. Og vi får i langt højere grad hjemsendt afvise asylansøgere end i Støjbergs tid.« Betyder dét så, at du faktisk er enig med kritikerne i, at det her er en udfordring? »Det er klart. Det her er en af årsagerne til, at vi har strammet op og fået nedbragt antallet af asylansøgere siden Støjbergs tid.« Men er det en falliterklæring af jer, at der er i det hele taget er sådan nogle områder her, når I tidligere med jeres 'Retfærdig og realistisk'-udspil har foreslået, athøjst 30 procent skulle have ikkevestlig baggrund i boligområderne? »Vi har fået gennemført det meste fra 'Retfærdig og realistisk'. Men jeg er ikke tilfreds med de her tal overhovedet. Og det siger noget om, at vi fortsat har et arbejde foran os med at sikre at integrationsopgaven bliver spredt mere ud. For det lykkes bedst, når den ikke er for stor i et område.« Bliver stærk torsdag Bliver stærk torsdag Bliver stærk torsdag Bliver stærk torsdag Bliver stærk torsdag Bliver stærk torsdag Bliver smidt ud Bliver smidt ud Bliver smidt ud Bliver smidt ud Bliver smidt ud Bliver smidt ud Styrtede 60 meter i døden Styrtede 60 meter i døden Styrtede 60 meter i døden Styrtede 60 meter i døden Styrtede 60 meter i døden Styrtede 60 meter i døden Rygterne går amok Rygterne går amok Rygterne går amok Rygterne går amok Rygterne går amok Rygterne går amok Stukket med kniv Stukket med kniv Stukket med kniv Stukket med kniv Stukket med kniv Stukket med kniv Chok midt i gudstjeneste Chok midt i gudstjeneste Chok midt i gudstjeneste Chok midt i gudstjeneste Chok midt i gudstjeneste Chok midt i gudstjeneste Dette spørgsmål stiller jeg ALTID Dette spørgsmål stiller jeg ALTID Dette spørgsmål stiller jeg ALTID Dette spørgsmål stiller jeg ALTID Dette spørgsmål stiller jeg ALTID Dette spørgsmål stiller jeg ALTID Her er sandheden om solcreme Her er sandheden om solcreme Her er sandheden om solcreme Her er sandheden om solcreme Her er sandheden om solcreme Her er sandheden om solcreme Kendispar skal skilles efter 21 år Kendispar skal skilles efter 21 år Kendispar skal skilles efter 21 år Kendispar skal skilles efter 21 år Kendispar skal skilles efter 21 år Kendispar skal skilles efter 21 år Trump tilsviner Trump tilsviner Trump tilsviner Trump tilsviner Trump tilsviner Trump tilsviner Alarmklokkerne ringer Alarmklokkerne ringer Alarmklokkerne ringer Alarmklokkerne ringer Alarmklokkerne ringer Alarmklokkerne ringer Truer med vanvidsmissil Truer med vanvidsmissil Truer med vanvidsmissil Truer med vanvidsmissil Truer med vanvidsmissil Truer med vanvidsmissil Truet med glasflaske Truet med glasflaske Truet med glasflaske Truet med glasflaske Truet med glasflaske Truet med glasflaske Bizarre scener Bizarre scener Bizarre scener Bizarre scener Bizarre scener Bizarre scener Skynd dig: Kun 19 kroner Skynd dig: Kun 19 kroner Skynd dig: Kun 19 kroner Skynd dig: Kun 19 kroner Skynd dig: Kun 19 kroner Skynd dig: Kun 19 kroner 'Du er ikke alene' 'Du er ikke alene' 'Du er ikke alene' 'Du er ikke alene' 'Du er ikke alene' 'Du er ikke alene' USA vil evakuere USA vil evakuere USA vil evakuere USA vil evakuere USA vil evakuere USA vil evakuere Kan koste Trump dyrt Kan koste Trump dyrt Kan koste Trump dyrt Kan koste Trump dyrt Kan koste Trump dyrt Kan koste Trump dyrt Vender tilbage Vender tilbage Vender tilbage Vender tilbage Vender tilbage Vender tilbage 'Det er en katastrofe' 'Det er en katastrofe' 'Det er en katastrofe' 'Det er en katastrofe' 'Det er en katastrofe' 'Det er en katastrofe' Voldsom kritik Voldsom kritik Voldsom kritik Voldsom kritik Voldsom kritik Voldsom kritik Dansk rigmand er nu blevet milliardær Dansk rigmand er nu blevet milliardær Dansk rigmand er nu blevet milliardær Dansk rigmand er nu blevet milliardær Dansk rigmand er nu blevet milliardær Dansk rigmand er nu blevet milliardær Efterforskes forny voldtægt Efterforskes forny voldtægt Efterforskes forny voldtægt Efterforskes forny voldtægt Efterforskes forny voldtægt Efterforskes forny voldtægt Her er dagens bedste bets Her er dagens bedste bets Her er dagens bedste bets Her er dagens bedste bets Her er dagens bedste bets Her er dagens bedste bets Politiet melder ud Politiet melder ud Politiet melder ud Politiet melder ud Politiet melder ud Politiet melder ud Fundet i god behold Fundet i god behold Fundet i god behold Fundet i god behold Fundet i god behold Fundet i god behold Eksperter afviser Eksperter afviser Eksperter afviser Eksperter afviser Eksperter afviser Eksperter afviser Dansker melder fra Dansker melder fra Dansker melder fra Dansker melder fra Dansker melder fra Dansker melder fra Gør det på motorvejen Gør det på motorvejen Gør det på motorvejen Gør det på motorvejen Gør det på motorvejen Gør det på motorvejen Dansk mareridt Dansk mareridt Dansk mareridt Dansk mareridt Dansk mareridt Dansk mareridt Flået af hylderne Flået af hylderne Flået af hylderne Flået af hylderne Flået af hylderne Flået af hylderne Brian Wilson er død Brian Wilson er død Brian Wilson er død Brian Wilson er død Brian Wilson er død Brian Wilson er død 'Hva sagde jeg?!' 'Hva sagde jeg?!' 'Hva sagde jeg?!' 'Hva sagde jeg?!' 'Hva sagde jeg?!' 'Hva sagde jeg?!' Skyldig Skyldig Skyldig Skyldig Skyldig Skyldig Dansk gigant tager nu konsekvensen Dansk gigant tager nu konsekvensen Dansk gigant tager nu konsekvensen Dansk gigant tager nu konsekvensen Dansk gigant tager nu konsekvensen Dansk gigant tager nu konsekvensen Kritiserede Trump-rådgiver Kritiserede Trump-rådgiver Kritiserede Trump-rådgiver Kritiserede Trump-rådgiver Kritiserede Trump-rådgiver Kritiserede Trump-rådgiver Sletter Sletter Sletter Sletter Sletter Sletter Kæmpe tilbud lige nu Kæmpe tilbud lige nu Kæmpe tilbud lige nu Kæmpe tilbud lige nu Kæmpe tilbud lige nu Kæmpe tilbud lige nu Kan ændre dit liv totalt Kan ændre dit liv totalt Kan ændre dit liv totalt Kan ændre dit liv totalt Kan ændre dit liv totalt Kan ændre dit liv totalt Gør kæmpe streaming- forskel Gør kæmpe streaming- forskel Gør kæmpe streaming- forskel Gør kæmpe streaming- forskel Gør kæmpe streaming- forskel Gør kæmpe streaming- forskel Uheld på vej til lufthavn Uheld på vej til lufthavn Uheld på vej til lufthavn Uheld på vej til lufthavn Uheld på vej til lufthavn Uheld på vej til lufthavn Fik alle til at vende hovedet Fik alle til at vende hovedet Fik alle til at vende hovedet Fik alle til at vende hovedet Fik alle til at vende hovedet Fik alle til at vende hovedet 'Kan ske når som helst' 'Kan ske når som helst' 'Kan ske når som helst' 'Kan ske når som helst' 'Kan ske når som helst' 'Kan ske når som helst' Macron skubbet af konen Macron skubbet af konen Macron skubbet af konen Macron skubbet af konen Macron skubbet af konen Macron skubbet af konen Fatal russisk fejl Fatal russisk fejl Fatal russisk fejl Fatal russisk fejl Fatal russisk fejl Fatal russisk fejl Norsk bil ramt Norsk bil ramt Norsk bil ramt Norsk bil ramt Norsk bil ramt Norsk bil ramt Dansk band bandlyst Dansk band bandlyst Dansk band bandlyst Dansk band bandlyst Dansk band bandlyst Dansk band bandlyst Historisk: Skudt ned Historisk: Skudt ned Historisk: Skudt ned Historisk: Skudt ned Historisk: Skudt ned Historisk: Skudt ned Er du nu bekymret? Er du nu bekymret? Er du nu bekymret? Er du nu bekymret? Er du nu bekymret? Er du nu bekymret? Helt nye detaljer Helt nye detaljer Helt nye detaljer Helt nye detaljer Helt nye detaljer Helt nye detaljer Fundet i god behold Fundet i god behold Fundet i god behold Fundet i god behold Fundet i god behold Fundet i god behold Kan du klare dagens ord? Kan du klare dagens ord? Kan du klare dagens ord? Kan du klare dagens ord? Kan du klare dagens ord? Kan du klare dagens ord? Prøvdagens ord med6 bogstaver Prøvdagens ord med6 bogstaver Prøvdagens ord med6 bogstaver Prøvdagens ord med6 bogstaver Prøvdagens ord med6 bogstaver Prøvdagens ord med6 bogstaver PrøvB.T.s krydsord her! PrøvB.T.s krydsord her! PrøvB.T.s krydsord her! PrøvB.T.s krydsord her! PrøvB.T.s krydsord her! PrøvB.T.s krydsord her! Ordkloden: Hvor mange ord kan du finde? Ordkloden: Hvor mange ord kan du finde? Ordkloden: Hvor mange ord kan du finde? Ordkloden: Hvor mange ord kan du finde? Ordkloden: Hvor mange ord kan du finde? Ordkloden: Hvor mange ord kan du finde? Fire kommet til skade Fire kommet til skade Fire kommet til skade Fire kommet til skade Fire kommet til skade Fire kommet til skade Rejs for ingen penge Rejs for ingen penge Rejs for ingen penge Rejs for ingen penge Rejs for ingen penge Rejs for ingen penge DR søger ny vært til populært program DR søger ny vært til populært program DR søger ny vært til populært program DR søger ny vært til populært program DR søger ny vært til populært program DR søger ny vært til populært program Fyrer samtlige Fyrer samtlige Fyrer samtlige Fyrer samtlige Fyrer samtlige Fyrer samtlige Han er dybt utilfreds Han er dybt utilfreds Han er dybt utilfreds Han er dybt utilfreds Han er dybt utilfreds Han er dybt utilfreds Massivt til stede Massivt til stede Massivt til stede Massivt til stede Massivt til stede Massivt til stede Gik amok i toget Gik amok i toget Gik amok i toget Gik amok i toget Gik amok i toget Gik amok i toget Skød fanger af kedsomhed Skød fanger af kedsomhed Skød fanger af kedsomhed Skød fanger af kedsomhed Skød fanger af kedsomhed Skød fanger af kedsomhed I krig med TV 2 I krig med TV 2 I krig med TV 2 I krig med TV 2 I krig med TV 2 I krig med TV 2 Vækker vrede Vækker vrede Vækker vrede Vækker vrede Vækker vrede Vækker vrede 'Bliv inde og luk vinduer' 'Bliv inde og luk vinduer' 'Bliv inde og luk vinduer' 'Bliv inde og luk vinduer' 'Bliv inde og luk vinduer' 'Bliv inde og luk vinduer' Har brug for din hjælp Har brug for din hjælp Har brug for din hjælp Har brug for din hjælp Har brug for din hjælp Har brug for din hjælp Mystisk aktion i rækkehus Mystisk aktion i rækkehus Mystisk aktion i rækkehus Mystisk aktion i rækkehus Mystisk aktion i rækkehus Mystisk aktion i rækkehus Trump:Vi har en aftale Trump:Vi har en aftale Trump:Vi har en aftale Trump:Vi har en aftale Trump:Vi har en aftale Trump:Vi har en aftale Nyt efter skræk-forløb med Wegovy Nyt efter skræk-forløb med Wegovy Nyt efter skræk-forløb med Wegovy Nyt efter skræk-forløb med Wegovy Nyt efter skræk-forløb med Wegovy Nyt efter skræk-forløb med Wegovy Bygger nyt hovedsæde Bygger nyt hovedsæde Bygger nyt hovedsæde Bygger nyt hovedsæde Bygger nyt hovedsæde Bygger nyt hovedsæde Involveret i ulykke Involveret i ulykke Involveret i ulykke Involveret i ulykke Involveret i ulykke Involveret i ulykke Overvejer at tilgive Overvejer at tilgive Overvejer at tilgive Overvejer at tilgive Overvejer at tilgive Overvejer at tilgive Kaos i Nordirland Kaos i Nordirland Kaos i Nordirland Kaos i Nordirland Kaos i Nordirland Kaos i Nordirland Dansker spås vild fremtid Dansker spås vild fremtid Dansker spås vild fremtid Dansker spås vild fremtid Dansker spås vild fremtid Dansker spås vild fremtid Slagter Europa Slagter Europa Slagter Europa Slagter Europa Slagter Europa Slagter Europa Vokser minut for minut Vokser minut for minut Vokser minut for minut Vokser minut for minut Vokser minut for minut Vokser minut for minut Pia K. har fået brud Pia K. har fået brud Pia K. har fået brud Pia K. har fået brud Pia K. har fået brud Pia K. har fået brud Hemmeligt møde på Grand Hotel Hemmeligt møde på Grand Hotel Hemmeligt møde på Grand Hotel Hemmeligt møde på Grand Hotel Hemmeligt møde på Grand Hotel Hemmeligt møde på Grand Hotel Kæmpe samarbejde med USA Kæmpe samarbejde med USA Kæmpe samarbejde med USA Kæmpe samarbejde med USA Kæmpe samarbejde med USA Kæmpe samarbejde med USA Kæreste-rygte eksploderer Kæreste-rygte eksploderer Kæreste-rygte eksploderer Kæreste-rygte eksploderer Kæreste-rygte eksploderer Kæreste-rygte eksploderer Politiet efterforskes Politiet efterforskes Politiet efterforskes Politiet efterforskes Politiet efterforskes Politiet efterforskes Ekstrem rekord i Grønland Ekstrem rekord i Grønland Ekstrem rekord i Grønland Ekstrem rekord i Grønland Ekstrem rekord i Grønland Ekstrem rekord i Grønland Soldat chokerer Soldat chokerer Soldat chokerer Soldat chokerer Soldat chokerer Soldat chokerer Mand narret på det groveste Mand narret på det groveste Mand narret på det groveste Mand narret på det groveste Mand narret på det groveste Mand narret på det groveste Nu rykker de ind Nu rykker de ind Nu rykker de ind Nu rykker de ind Nu rykker de ind Nu rykker de ind Kongen af Odense: Elsker ham Kongen af Odense: Elsker ham Kongen af Odense: Elsker ham Kongen af Odense: Elsker ham Kongen af Odense: Elsker ham Kongen af Odense: Elsker ham TV 2 kan glemme det TV 2 kan glemme det TV 2 kan glemme det TV 2 kan glemme det TV 2 kan glemme det TV 2 kan glemme det Amok på personale Amok på personale Amok på personale Amok på personale Amok på personale Amok på personale Sender ham ultralyds- billede Sender ham ultralyds- billede Sender ham ultralyds- billede Sender ham ultralyds- billede Sender ham ultralyds- billede Sender ham ultralyds- billede Berlingske Media A/S Pilestræde 34 DK-1147 København K Tlf. +45 33 75 75 33 TIP OS Annoncering Kundeservice Om B.T.Ledige stillinger Ledige stillinger Ledige stillinger Advertorial Låneguide Simon Richard Nielsen, chefredaktør (ansv.)Anders Krab-Johansen, koncernchef og udgiver Generelle handelsbetingelser Cookie-og privatlivspolitik Cookiedeklaration Vilkår CVR.nr.: 29 20 73 13"}