{"id": 1474, "name": "Today.com (NBC Today Show)", "domain": "today.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.today.com/food/groceries/trader-joes-opens-new-la-location-across-street-from-another-one-rcna212192", "title": "Trader Joes Opens New La Location Across Street From Another One Rcna212192", "content": "Buy or Bye? From Sardines to Grandma Hobbies, We Found Summer Must-Haves and Trends to Skip On the ShowAbout TODAYShow Video3rd Hour of TODAYJenna & FriendsSaturday TODAYSunday TODAYShop the Show About TODAY Show Video 3rd Hour of TODAY Jenna & Friends Saturday TODAY Sunday TODAY Shop the Show About TODAY Show Video 3rd Hour of TODAY Jenna & Friends Saturday TODAY Sunday TODAY Shop the Show ShopShop the ShowShop TODAY StagesGift GuidesRanked by Shop TODAYSteals & DealsNewsletter Shop the Show Shop TODAY Stages Gift Guides Ranked by Shop TODAY Steals & Deals Newsletter Shop the Show Shop TODAY Stages Gift Guides Ranked by Shop TODAY Steals & Deals Newsletter WellnessStart TODAYExpert Tip of the DayWomen's HealthFitnessDiet & NutritionMental HealthSleep Start TODAY Expert Tip of the Day Women's Health Fitness Diet & Nutrition Mental Health Sleep Start TODAY Expert Tip of the Day Women's Health Fitness Diet & Nutrition Mental Health Sleep Start TODAY ParentsBaby NamesKids HealthFamilyBabiesParenting TipsLOL Baby Names Kids Health Family Babies Parenting Tips LOL Baby Names Kids Health Family Babies Parenting Tips LOL FoodRecipes On The ShowMost Popular RecipesAll RecipesFood NewsWhat to Cook This Week Recipes On The Show Most Popular Recipes All Recipes Food News What to Cook This Week Recipes On The Show Most Popular Recipes All Recipes Food News What to Cook This Week LifeAstrologyEssaysHolidaysQuotesJokesTrivia Astrology Essays Holidays Quotes Jokes Trivia Astrology Essays Holidays Quotes Jokes Trivia PodcastsTODAYJenna and FriendsSunday TODAYMaking SpaceOpen Book with JennaCooking Up a Storm TODAY Jenna and Friends Sunday TODAY Making Space Open Book with Jenna Cooking Up a Storm TODAY Jenna and Friends Sunday TODAY Making Space Open Book with Jenna Cooking Up a Storm Share this — Sections Health & Wellness Parenting Food Shop Pop Culture News Life Style Shows TODAY 3rd Hour of TODAY TODAY with Jenna & Friends Saturday TODAY Sunday TODAY with Willie Geist Watch Full Episodes More News Life Books Trending Recipes Read With Jenna Astrology Inspirational Holidays Relationships TODAY Table Help Newsletters Start TODAY Jokes Shop TODAY Awards Citi Concert Series Listen All Day Follow today More Brands Facebook Pinterest Email SMS Print Whatsapp Reddit Pocket Flipboard Twitter Linkedin On the Show Shop Wellness Start TODAY Parents Food Life Podcasts **Why Did Trader Joe’s Open a Store Directly Across the Street From Another One?** Shoppers in a sunny California suburb may do a double take while shopping for Unexpected Cheddar. On June 6, a brand-new Trader Joe’s opened in Sherman Oaks, California, part of the grocery chain’s plan toopen 21 stores across 13 states. This particular store, however, is different from the rest for one glaring reason: It’s directly across the street from a Trader Joe’s that has been open for decades. The new store, located at 14140 Riverside Drive, is affectionately called “Sherman Oaks too” on theTrader Joe’s website, and its address is only 21 digits different from its sister store at 14119 Riverside Drive. Both groceries open at 8 a.m. and close at 9 p.m. daily. Needless to say, area customers are confused. “Want to know something actually insane?” local customer Shauna Greensays in a June 7 TikTokwhile pointing out the pair of TJ’s in her view. “Literally across the street, still open. And I just asked the worker, I’m like, ‘How long is the other Trader Joe’s gonna stay open?’ and she said, ‘Um, they just signed their lease.’” Green says she’d understand more if it were in a different part of the city, but across the street seems “excessive.” “It’s not a bad problem to have; it’s just a perplexing situation,” she tells TODAY.com. In the comments of her video, people expressedconfusionandjealousy. Many said the move wasstraightout ofStarbucks’playbook— a clear sign of the “chainification” of a neighborhood. “There are three Starbucks in Westchester by LAX, two Standalone and one in Ralph’s all across from each other,”wroteone TikTok user. Matt Judd, who is Team Lead at the Sherman Oaks too location, says both locations are going to just “play it out and see how it goes” as there is enough demand in the area. “I think all along we intended to close the one original one that had been there since 1973, a bit of an undersized store and then somewhere along the line, we decided maybe we could see how two goes for a little bit,” Judd tells TODAY.com. “There’s that much business here, and we’ve had such a great relationship with our customers for 52 years.” Judd also notes that the “more modern” store is “about 40% bigger” with wider aisles, bigger refrigeration and a larger frozen section. A manager at the original Sherman Oaks Trader Joe’s directed us to the corporate office, which declined to comment further on its neighboring stores. Online, some customers have noted the upgrades at the new store, with one TikToker in aJune 9 videoshowing the new parking garage and “spacious” interior. ConsideringTrader Joe’s reputation for terrible parking, Green welcomes the larger spaces. “The other parking lot is a TJ’s cliche, it’s hell. Cramped and compact spaces with tight turns and a nonstop gridlock,” she says. “My plan is to go wherever the parking is better.” Joseph Lamour is the food reporter at TODAY.com and is based in Washington D.C. **More Trending** **Cory Booker Reveals He Once Went On A Date With Mariah Carey. What He Shared** **Pop Culture** **Woman Is Confident Her Chair Is Blue — But the Internet Has Other Plans** **Life** **Man Gored by Bison at Yellowstone National Park** **News** **Country Music Artist Conner Smith Allegedly Fatally Struck A Woman With Vehicle** **News** **Jack Wagner Teases Nick’s ‘Bold and the Beautiful’ Return – and If It’s Permanent** **TV** **Dolphin’s Birth Caught on Camera at Chicago Zoo** **Pets & Animals** **This Retro Diet Coke Flavor is Making a Comeback for the Summer** **Groceries** **In Her Debut Cookbook, Drag Queen Kim Chi Hopes to ‘Make You More Open-Minded’** **People** **RM and V Discharged After Completing Military Service: What to Know About BTS’ Enlistment** **Music** **How many kids do Jay-Z and Beyoncé have? All about Blue Ivy, Rumi and Sir** **Parents** About Contact Help Visit TODAY Apps AD Choices Privacy Policy Do Not Sell My Personal Information CA Notice TERMS OF SERVICE TERMS OF SERVICE Careers Closed Captioning TODAY Sitemap Advertise TODAY Store Shop TODAY © 2025 NBCUniversal Media, LLCApple®, Apple logo® and App Store® are registered trademarks of Apple Inc."}