{"id": 1718, "name": "FaithIt", "domain": "faithit.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://faithit.com/this-was-gods-plan-for-us-high-school-sweethearts-get-the-surprise-of-their-lives-on-ultrasound/#respond", "title": "This Was Gods Plan For Us High School Sweethearts Get The Surprise Of Their Lives On Ultrasound", "content": "Spiritual Relationships Parenting Inspirational Entertainment Causes Spiritual Relationships Parenting Inspirational Entertainment Causes **Exclusive Content:** **Viral Photo Shows the Moment a White State Trooper Prayed for a Black Man During a Routine Traffic Stop** **3 Ways to Fight for Your Marriage When You’re Tempted to Throw in the Towel** **How to Deal With a Lying Husband and Get a Better Marriage** Spiritual Relationships Parenting Inspirational Entertainment Causes **‘This was God’s plan for us’: High School Sweethearts Get the Surprise of Their Lives on Ultrasound** High school sweethearts Chance and Sara Hohensee were riding high with expectation when they went to a routine 10-week ultrasound appointment for their second child. The couple, who already had a one-year-old daughter, Harlow, was excited about expanding their family. However, they never could have imagined that this routine appointment would turn out to be “anything but.” Soon after theultrasound techgot Sara prepped and but the ultrasound wand on her belly, the mood changed dramatically, as both the tech and the Hohensees could see two babies on the screen. “At first, we saw two,” Chance Hohensee toldWDBJ. “And then she says, ‘Oh, there’s two,’ and then she goes ‘Oh, there’s a third.” The Hohensees were about to be the proud parents of spontaneously occurring triplets, a triplet pregnancy in which no fertility treatments were used at all. Spontaneous triplets are so rare they only occur in about 1 in a million pregnancies. At first, the realization was too much to comprehend, but the overwhelm and uncertainty eventually turned to joy. A post shared by S A R A • H O H E N S E E (@sarahohensee) Sara explained their emotional journey onher Instagramwith a maternity photo, saying: I’ve always been a type A planner. I’m a strong believer in structure, checklists, and timelines to keep things flowing smoothly and according to plan. When people used to ask Chance and I how many kids we want, our answer was, “at least 2, but not more than 3”. That was our plan. We were more than happy leaving this “4 kid business” to other couples as we happily stuck to what we thought was best for us. Then, at the 10 week ultrasound for what we thought was baby#2, we got the news of our triplets. We didn’t take it well. We cried a lot of tears (not of joy) with fear of the unknown, questioning God why He would give us so much more than we thought we could ever handle. It wasn’t our plan. As we embark on the 34th week of this triplet pregnancy, we have truly learned how to give it all to God. It’s been the most unexpected, but best thing for our faith and has truly helped us trust in Him and His plans for our future and in His purpose for our lives. We’re still scared (very scared) and have many questions and fears for the unknown, but we know God provides and is always faithful. “And we know that in all things God works for the good of those who love him, who have been called according to his purpose.” -Romans 8:28 Late last summer, the triplets were born after much anticipation. The Hohensees were blessed with two more little girls and a boy, named Baylor Sparks, Hayes Michael and Maddyn Kay. All the babies weighed between four and five pounds and arrived safe and sound.Big sisterHarlow, now two years old, is loving her role, says dad Chance. “They’re her babies now,” he said. “She really loves to love up on them and give them kisses.” A post shared by S A R A • H O H E N S E E (@sarahohensee) Congratulations to the new family of six! We know that as God has called you to this, He will equip you, and we wish you all the best. **Let's change the world** **Viral Photo Shows the Moment a White State Trooper Prayed for a Black Man During a Routine Traffic Stop** **3 Ways to Fight for Your Marriage When You’re Tempted to Throw in the Towel** **How to Deal With a Lying Husband and Get a Better Marriage** **About us** Advertise **Most recent** **Viral Photo Shows the Moment a White State Trooper Prayed for a Black Man During a Routine Traffic Stop** **3 Ways to Fight for Your Marriage When You’re Tempted to Throw in the Towel** **How to Deal With a Lying Husband and Get a Better Marriage** **One Year After “I Do,” Husband Realizes Why Marriage Isn’t for Him** **Most popular** **Viral Photo Shows the Moment a White State Trooper Prayed for a Black Man During a Routine Traffic Stop** **3 Ways to Fight for Your Marriage When You’re Tempted to Throw in the Towel** **How to Deal With a Lying Husband and Get a Better Marriage** **One Year After “I Do,” Husband Realizes Why Marriage Isn’t for Him** **Subscribe** © Faithit - All rights reserved."}