{"id": 1550, "name": "Washington Monthly", "domain": "washingtonmonthly.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://washingtonmonthly.com/2025/06/01/the-secret-to-reindustrializing-america-is-not-tax-cuts-and-tariffs-its-regulated-competition/", "title": "The Secret To Reindustrializing America Is Not Tax Cuts And Tariffs Its Regulated Competition", "content": "Donate Subscribe College GuideOpen dropdown menuWashington Monthly’s 2024 College Guide and Rankings Washington Monthly’s 2024 College Guide and Rankings Washington Monthly’s 2024 College Guide and Rankings EducationOpen dropdown menuHigher EducationK-12Higher Ed Q&A Higher Education K-12 Higher Ed Q&A Higher Education K-12 Higher Ed Q&A PoliticsOpen dropdown menuMonopolized EconomyHealth CareRussia’s War on UkraineEconomyLaw and JusticeProtecting the Vote Monopolized Economy Health Care Russia’s War on Ukraine Economy Law and Justice Protecting the Vote Monopolized Economy Health Care Russia’s War on Ukraine Economy Law and Justice Protecting the Vote MagazineOpen dropdown menuCurrent IssuePast Issues Current Issue Past Issues Current Issue Past Issues Podcast About Kukula Award Bluesky Page X Username Youtube Page Linkedin Page Washington Monthly’s 2024 College Guide and Rankings MagazineCurrent IssuePast Issues Current Issue Past Issues Current Issue Past Issues EducationK-12Higher EducationHigher Ed Q&A K-12 Higher Education Higher Ed Q&A K-12 Higher Education Higher Ed Q&A Politics Health Care Protecting the Vote Law and Justice The Monopolized Economy Economy Books About Advertise Contact Careers Privacy Policy Successes of Philanthropy Washington Monthly’s 2024 College Guide and Rankings MagazineCurrent IssuePast Issues Current Issue Past Issues Current Issue Past Issues EducationK-12Higher EducationHigher Ed Q&A K-12 Higher Education Higher Ed Q&A K-12 Higher Education Higher Ed Q&A Politics Health Care Protecting the Vote Law and Justice The Monopolized Economy Economy Books About Advertise Contact Careers Privacy Policy Successes of Philanthropy Bluesky Page X Username Youtube Page Linkedin Page Washington Monthly Donate Subscribe College GuideOpen dropdown menuWashington Monthly’s 2024 College Guide and Rankings Washington Monthly’s 2024 College Guide and Rankings Washington Monthly’s 2024 College Guide and Rankings EducationOpen dropdown menuHigher EducationK-12Higher Ed Q&A Higher Education K-12 Higher Ed Q&A Higher Education K-12 Higher Ed Q&A PoliticsOpen dropdown menuMonopolized EconomyHealth CareRussia’s War on UkraineEconomyLaw and JusticeProtecting the Vote Monopolized Economy Health Care Russia’s War on Ukraine Economy Law and Justice Protecting the Vote Monopolized Economy Health Care Russia’s War on Ukraine Economy Law and Justice Protecting the Vote MagazineOpen dropdown menuCurrent IssuePast Issues Current Issue Past Issues Current Issue Past Issues Podcast About Kukula Award **The Secret to Reindustrializing America Is Not Tax Cuts and Tariffs. It’s Regulated Competition.** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Bluesky (Opens in new window)Bluesky Republicans and Democrats now generally agree that we must make more stuff in America but no consensus exists about how to do that. Under President Joe Biden, the strategy was to offer subsidies to key industries, like microchip manufacturers, and then use targeted tariffs to protect those efforts. Under President Donald Trump, the plan apparently is to impose, or threaten to impose, high tariffs on a shifting set of nations and products while threatening to cut Biden’s targeted financial incentives and replace them with across-the-board tax cuts, mostly for the well-to-do. Considering how central the goal of reindustrialization is to both parties, it’s noteworthy that the range of policy levers being debated is by and large limited to just three: tariffs, the tax code, and direct public investment. Yet while these can be useful tools, they are hardly the only ones, or even the most powerful. Indeed, historically, fostering America’s industrial strength depended far more on deploying regulations to steer market behavior. When Americans hear the wordregulationthey tend to think of the environmental and consumer protection measures put in place by federal agencies mostly since the 1970s. But for a century before that, a huge body of regulation of a different kind steered the course of the nation’s economic development. It was regulation that set market rules of competition. Which kinds of banks could operate where and how much interest could they charge or pay? What rates could railroads or airlines set for transporting various types of cargo or passengers over different distances? How much profit could investors in electric utilities or telecommunications companies make, and what customers were they required to serve and at what prices? Working with industry, federal lawmakers and regulators hashed out rules that determined who could enter and exit different key sectors, what terms of service they could impose, and with whom they could merge. During America’s century-long rise as a capitalist superpower, such market rules fit together to form an increasingly sophisticated and pervasive system that the political scientist and economic historian Gerald Berk has dubbed “regulated competition.” It was a uniquely American system for governing industrial capitalism, and it delivered broad prosperity for decades. It did so first by catalyzing a virtuous cycle of innovation. Firms in key industry sectors like transportation and electricity were guaranteed modest but predictable profits that allowed them to attract more capital, and to take greater risks, than they otherwise could. In exchange, companies were obliged to serve all market segments, rather than cherry-pick the most profitable. This enabled smaller cities, towns, and rural areas to compete on a more equal footing with large cities on the coasts, thus spreading economic development and wealth creation more equitably across the country while also serving as a check on the growth of financiers and oligarchy. But then, beginning in the 1970s, policy makers from both parties largely dismantled this well-calibrated system of political economy in a rush to “deregulate” the economy and unleash “the market.” An especially vivid example of how America’s system of regulated competition once worked is aviation. This essay tells the story of how careful federal marketplace rules fostered the growth of air travel, domestic airplane manufacturing, and commerce in smaller cities across America—and how the demise of that system eroded all three. The same story could be told of other crucial industries, from finance to retail to shipbuilding. Washington’s abandonment of regulated competition explains much of what’s gone wrong with the American economy over the past 40 years, and its restoration could be the key to the country’s industrial revival. To understand how smart market regulation spurred innovation and equitable growth in aviation it’s useful to begin with the way the country dealt with the previous big revolution in transportation technology. Throughout the late 19th and early 20th centuries, policy makers had wrestled with what had come to be known as “the railroad problem,” a seemingly intractable dilemma involving a vicious mix of monopoly and ruinous competition. Early railroads held local monopolies in many places, which they used to extract wealth from the local community and retard its economic development. Yet early railroads also often faced cutthroat competition in many other markets due to duplicative lines and other forms of excess capacity. As a result, railroad owners repeatedly engaged in self-destructive rate wars, often moving freight and passengers at below cost in a desperate attempt to help defray their high fixed costs. Largely because of the effects of these price wars, by the end of the 1870s, railroads accounting for more than 30 percent of domestic mileage had failed or fallen into court-ordered receivership. Seeking to redress the railroad problem, Congress passed the Interstate Commerce Act in 1887. The resultingInterstate Commerce Commissionattacked the twin problems of monopoly and ruinous competition primarily through rate regulation. The ICC mandated that railroads publicly post their rates and that they charge all passengers and shippers roughly the same price per mile for the same level or category of service. This eliminated price discrimination based on sheer market power, thereby reducing regional inequalities and market distortions caused by local railroad monopolies. The ICC also used rate regulation to guard against ruinous competition by setting rates high enough to enable railroads to attract the capital they needed to maintain their infrastructure and finance a wave of new technologies, including much larger, more powerful locomotives and much safer rolling stock made of steel rather than wood. Starting in 1916, Congress extended this same basic regulatory framework to maritime transportation by passing the Shipping Act. It created a new agency, the U.S. Shipping Board, which was charged with ensuring that all ocean carriers publicly posted their prices and offered all “similarly situated” shippers roughly equal terms of service. To limit destructive price wars and to advance other public purposes, the Shipping Act and subsequent legislation also limited access to many domestic ports to U.S. flagged ships. Under this regime of regulated competition, the industry was able to finance a dramatic transition from wind-powered to steam-powered ships. In 1935, Congress extended the same regulatory model to interstate trucks and buses by giving the ICC jurisdiction over these modes. In this instance the twin challenge of limiting ruinous competition while avoiding monopoly was accomplished through a combination of rate regulation and high regulatory barriers to entry. For example, by limiting the number of commercial interstate truck licenses and the markets that individual truckers could serve, the ICC prevented ruinous competition, thereby ensuring that truckers could earn a living wage, trucking companies could earn their cost of capital, and truck manufacturers could finance the cost of innovation. So it is hardly surprising that the United States would wind up applying the same principles to aviation. The story begins in the decade following Charles Lindbergh’s celebrated 1927 solo flight across the Atlantic. During these years, rapid advances in aviation technology promised a revolutionary new age of public air transport if only a viable airline business model could be found. In 1933, Boeing introduced its model 247, a monoplane capable of hauling 10 passengers at 155 miles per hour. Soon came a series of other revolutionary passenger planes, including the Lockheed Electra and the iconic Douglas DC-3, which could carry 21 passengers at a cruising speed of 180 miles per hour for as far as 1,200 miles. Thanks to these technological advances, by 1935 air traffic had increased to an annual rate of nearly 200 times what it had been in 1926. Yet the airline industry was in a state of near economic collapse. The primary reason was the destructive competition that existed among carriers. Starting a new airline required no regulatory approval, and the financial barriers to entry did not extend much beyond the cost of buying a plane and hiring a small crew. As more and more “fly-by-night” carriers flooded into the market, margins became slim or nonexistent. This lack of profitability—worsened, of course, by the effects of the Great Depression—left the industry unable to attract the capital it needed to take full advantage of new technology or even maintain existing planes. By 1938, an estimated 50 percent of all capital invested in commercial aviation had disappeared and the number of airlines offering scheduled service had shrunk from a hundred to less than a score. Carriers that survived this era did so mostly by winning lucrative, exclusive federal contracts to haul air mail along specific routes. But the process for the letting of such contracts generated repeated charges of widespread corruption involving collusion between the postmaster general and favored carriers. Responding to the scandals, President Franklin D. Roosevelt canceled all air mail contracts. Confronted with this darkening atmosphere, Roosevelt and Congress began debating how to create a regulatory structure that would enable the aviation industry to at last become economically viable while also serving the public interest. The result was the Civil Aeronautics Act of 1938, which laid out a system for regulated competition in aviation markets that would last into the jet age and beyond. For the architects of the Civil Aeronautics Act, a key goal was to stem the deleterious effects of unrestrained airline competition. “We are interested,” noted Senator and future President Harry Truman, “… in seeing that ‘fly-by-night’ operations do not start up and bring down prices and create chaos.” A House committee report on the proposed legislation charged that excessive airline competition was undermining the government’s previous investments in aviation: “The government cannot allow unrestrained competition by unregulated air carriers to capitalize on and jeopardize the investment which the government has made during the last 10 years in their transport industry through the mail service.” West Virginia Democratic Representative Jennings Randolph went further, noting, “Air transport today is the only mode of transportation and communication for which there exists no comprehensive and permanent system of Federal economic regulation.” He concluded that “unbridled and unregulated competition is a public menace,” citing as examples “rate war[s], cutthroat devices, and destructive and wasteful practices.” In the eyes of regulation advocates, these and other market failures were unlikely to go away on their own as the industry matured. Instead, they were thought to be built into the cost structure of flying. For example, when an airline operates a plane, it faces fixed costs that must be paid regardless of how many passengers are on board. At the same time, the cost of adding one more passenger to a flight is marginal. This means that an airline can be tempted to sell seats at below the average fare needed to meet expenses if that’s what it takes to fill the plane. Even if an airline can only fill seats by offering some or all passengers money-losing discounts, this practice will at least partially cover the high fixed cost of operating the plane, thereby allowing the airline to lose less money on the flight than it otherwise would. To overcome these and other structural sources of destructive fare wars and inequitable pricing policies, Congress settled first on a system of entry control. In the future, to start a new airline or offer service on any route, carriers would need to apply to a new regulatory agency called theCivil Aeronautics Board(CAB) for a certificate of “public convenience and necessity.” The meaning of this phrase allowed for differing interpretations. As the aviation icon Amelia Earhart testified before a House committee, “I defy anyone at the present period to define convenience or necessity as applied to aviation. I feel that mere study cannot determine that matter, as we have no background yet of sufficient experimentation to afford adequate interpretation.” In practice, however, the standard became clearer. Once the CAB was up and running it grandfathered in most incumbent carriers by granting them regulatory authority to continue operating on their existing routes. It then used a two-step process to control new entry and routes. First it would determine how many carriers a given market could profitably support. If it found sufficient demand to support a new carrier, it would then choose among competing applicants based on their own financial viability and ability to serve the public’s “convenience and necessity.” When Americans hear the wordregulationthey tend to think of the environmental and consumer protection measures put in place mostly since the 1970s. But for a century before that, regulations of a different kind, ones that set market rules of competition, steered the course of the nation’s economic development. The Civil Aeronautics Act also required CAB regulators to avoid facilitating monopoly power even as they constrained competition. In response to this mandate, the CAB tended to favor smaller over larger carriers in issuing operating authorities. In some cases, the CAB would enhance the economic viability of smaller carriers by allowing them to extend their limited route structures to serve particularly lucrative market segments. To ensure air service to sparsely populated destinations, the CAB sometimes required incumbent carriers to provide the money-losing service using returns on higher-margin routes. This was consistent with Congress’s mandate that the CAB ensure “any citizen of the United States a public right of freedom of transit in air commerce through the navigable air space of the United States.” Sign up below for theWashington MonthlyNewsletterand get our best stories from the web and print, plus our weekly podcast, straight to your inbox Email (required)* Example: Yes, I would like to receive emails from Washington Monthly. (You can unsubscribe anytime) The Civil Aeronautics Act also empowered the CAB to mitigate the effects of concentrated market power by using two other policy levers. First, it gave the CAB statutory authority to block any airline mergers or acquisitions that it found to be not in the public interest. More significantly, the act also gave the CAB authority over what rates carriers could charge and mandated that they be fair and reasonable. In setting rates, the CAB began by compiling industry cost and revenue figures. Then it calculated what the industry’s cost and revenue would have been if the average flight had been 55 percent full. Fares were then set at a level no higher than what the CAB determined would be sufficient to generate this “revenue requirement” plus a projected 12 percent return on investment for airline stockholders. Despite huge technological advances, by 1938 the airline industry was near economic collapse because of destructive competition among carriers. Starting a new airline required no regulatory approval, and the barriers to entry did not extend much beyond buying a plane and hiring a small crew. An important additional provision of the Civil Aeronautics Act required that CAB rate setting promote “adequate, economical, and efficient service by air carriers at reasonable charges, without unjust discriminations, undue preferences or advantages, or unfair or destructive competitive practices.” Mindful of the mandate to prevent “unjust discriminations,” the CAB ensured that the per mile cost of flying was roughly the same on all routes, regardless of distance, destination, or volume of demand. Similarly, the CAB required that all passengers on any plane pay identical fares for the same class of service, thus denying airlines the ability to engage in discriminatory practices commonly used by airlines today, such as charging some passengers more than others depending on when they bought their ticket or on what their destination is when they change planes. Finally, to guard against price wars that might threaten the industry’s overall financial viability, the CAB also generally prohibited any single carrier on a route from lowering fares unless all its competitors did as well. During the years that the U.S. was engaged in fighting World War II, civilian airline travel virtually vanished. Yet by 1955, more Americans were already traveling byair than by train, and airliners had replaced ocean liners as the dominant mode of transatlantic travel. A huge factor behind the explosive growth in air travel in this era was continuing dramatic advancement in aviation technology, much of it developed by the military and defense contractors during the war years. Aircraft manufacturers introduced a succession of new, increasingly larger, safer, and more efficient four-engine airliners, including the Douglas DC-4, Lockheed’s Constellation, the Douglas DC-6, the Douglas DC-7, and the Boeing 377 Stratocruiser. Starting in the late 1950s, these were followed by a series of still-faster jets offering still-greater capacity and lower operating costs per passenger. By 1968, a single DC-8 could produce more annual seat miles than the entire industry did 30 years before. By 1970, the first “jumbo jet,” the Boeing 747, went into service. This technological revolution did not occur, however, independent of the political economy governing aviation during this period. The other huge, and often overlooked, factor was the system of regulated competition overseen by the CAB. Because of CAB market regulation, airlines escaped the self-destructive rate wars and negative margins that had previously prevailed and instead earned consistent, modest rates of return throughout the next three decades. This in turn allowed the aviation sector to attract the capital it needed to develop and deploy rapidly improving but highly expensive new generations of aircraft. In short, technology and regulation combined to create avirtuous cycle. Airlines under CAB regulation still faced considerable competition with each other and so were incentivized to invest in faster, safer planes. But because of the carefully balanced limits the CAB placed on competition, aircraft manufacturers in turn understood that if they developed new and better planes, airlines would have both the incentive to buy them and enough capital to afford them. CAB regulation led to airlines investing heavily in more and better planes, and as they did so, the industry grew and became more efficient, allowing more and more Americans to enjoy the benefits of air travel. Largely because of this virtuous cycle, the cost of flying fell dramatically under CAB regulation while the safety, speed, and quality of air travel improved even more. Real revenue per passenger mile declined under CAB regulation by an average of 1.8 percent per year between 1946 and 1978. Reflecting this trend line, the inflation-adjusted cost of a typical flight between Los Angeles and Boston fell from $4,439 in 1941 to $915 in 1978, a 79 percent decrease, even as the new generation of jets made the travel time much shorter and the journey much safer. Because of the falling cost and improving value of air travel, by 1977, nearly two-thirds of all Americans over 18 had taken a trip on a plane, up from just one-third in 1962. The regulated competition provided by the CAB also allowed the industry to earn enough surplus to support a comparatively well-paid, highly trained, unionized workforce during this era. Another benefit was the promotion of regional equality and more balanced economic development. By requiring high-volume, high-margin routes to effectively cross-subsidize low-volume, low-margin routes, the CAB enabled a larger airline network, thereby creating positive network effects that included allowing businesses in smaller and heartland cities to better compete in larger markets. This was key to the flourishing of smaller cities in this era and to the increase in regional equality. The equalization of railroad rates had already allowed heartland cities like St. Louis to compete on equal terms as manufacturing and distribution centers during the first half of the 20th century. By extending the same principle to airlines, heartland cities also became better able to compete nationally and internationally in key service industries. In the early jet age, for example, St. Louis’s abundant air service allowed the city to become amajor hubfor advertising and public relations firms serving national and global brands, as well as a frequent host of lucrative trade conventions. In no small measure because of their freedom from price discrimination in the transportation sector, heartland citiesconvergedwith major money-center coastal cities like New York and Boston in their per capita income during this era, while overallregional inequalityfell sharply. In summary, under the CAB’s watch, a high-risk venture with vast national economic potential had become by the 1970s a secure and stable backbone of American civic and commercial life. But the regulatory regime had its flaws, and a growing chorus of well-placed critics. Throughout its existence, the CAB faced criticism from different quarters. An early complaint was that it set airfares too high because it used cost estimates based on flights being little more than half full on average. No doubt the CAB did not always get pricing right. But part of the rationale for this formula was to ensure adequate revenue not just during the top of the business cycle but also during economic downturns. Another consideration was that encouraging higher load factors would erode the quality and reliability of the flying experience. Not only would planes have been more crowded, but there also would have been fewer seats available to rebook passengers whose flights were canceled due to bad weather or mechanical problems. Today’s frequently overbooked planes and lack of capacity to deal with stranded passengers are just two of many ways in which the quality of air travel has declined since the days of the CAB. Another line of criticism charged that the CAB, particularly over time, erred in giving incumbent carriers too much protection from start-ups and from each other. Through the mid-1970s, the CAB refused to allow a single new trunkline carrier to enter the business, leading to charges that it had created a protected oligopoly. Somewhat inconsistently, other critics charged that airlines were competing too much with each other over the wrong things. The CAB set rates in ways that virtually eliminated price competition. Yet airlines still had to worry about losing passengers to other carriers as well as to other modes like autos or trains for short or intermediate-length trips. So they wound up competing over quality instead of price. This included competition over service standards like on-time performance, safety, leg room, baggage handling, and frequent, convenient scheduling, but they also included, critics charged, competition over “frills,” like inflight meals served on chinaware by comely stewardesses. Another key argument leveled against the CAB was that it kept airfares unnecessarily high by underestimating the elasticity of demand for air travel. Led by the academic economist turned policy entrepreneur Alfred Kahn, these critics argued that if airlines were allowed to reduce fares to marginal costs and offer deep discounts to price-sensitive consumers, this would fill seats that otherwise would go empty. And with more passengers per plane available to share the fixed cost of flying, Kahn argued, the average cost for everyone could be allowed to fall without endangering airline solvency. Informing the growing attacks on the CAB was the growing prestige of so-called neoclassical economics. More and more academic economists insisted on the power of unregulated markets to allocate resources to their highest valued use. According to this analytical framework, which became part of the influential law and economics movement championed by Richard A. Posner, virtually any form of market regulation was likely to cause a “dead weight loss” in society’s total welfare. Another influence was the rise of public choice theory, which emphasized how regulation could create barriers to entry that allowed established industries to escape competition and earn “monopoly rents.” Because of federal market regulation, airlines escaped self-destructive rate wars and negative margins and instead earned consistent, modest rates of return. This in turn allowed the aviation sector to attract the capital it needed to develop and deploy rapidly improving but highly expensive new generations of aircraft. Still another line of attack came from the era’s rising consumer movement. The consumer advocateRalph Naderbecame a leading champion of airline deregulation, arguing that by creating regulatory barriers to new airlines, the CAB had allowed both airline management and unions to become overpaid and sclerotic at the expense of “the consumer.” Meanwhile many liberals, including U.S. Senator Ted Kennedy and his then Judiciary Committee staffer Stephen Breyer, the future Supreme Court justice, reasoned that deregulation would lead to more competition and lower consumer prices—a high priority at a time when the OPEC oil cartel had set off an inflationary spiral. Together, these forces created a unique moment in which both leading Republican and Democratic policy makers, as well as putative academic experts, formed a consensus in favor of ending regulation of airline markets. Implementation of these ideas began when President Jimmy Carter appointed Alfred Kahn to head the CAB in 1977. In that capacity, Kahn took administrative measures that allowed airlines to serve any routes they wanted under a policy known as “multiple permissive entry.” By 1978, the CAB had amended its rate-setting policies to allow airlines downward pricing flexibility of up to 70 percent. When airlines responded with deep fare cuts, the traveling public cheered, helping to build political support for disbanding the CAB altogether. In short order this caused Congress to pass, and Carter to sign, the Airline Deregulation Act of 1978, which ended any government role in managing entry, pricing, and route network structure in airline markets. The early years of airline deregulation saw a burst of new entrants along with steep price declines on many high-volume, long-distance routes. But it also brought a sharp decline in air service to cities in what we today call “flyover country.” In 1986, West Virginia Senator Robert Byrd publicly apologized for having voted to abolish the CAB: This is one Senator who regrets that he voted for airline deregulation. It has penalized States like West Virginia, where many of the airlines pulled out quickly following deregulation and the prices zoomed into the stratosphere—doubled, tripled and, in some instances, quadrupled. So we have poorer air service and much more costly air service than we in West Virginia had prior to deregulation. I admit my error; I confess my unwisdom, and I am truly sorry for having voted for deregulation. Overall, airline prices did continue to fall on most remaining routes. This caused much of the public, particularly those living in well-served, large coastal cities, to view airline regulation as a success. But with the benefit of hindsight a far different picture emerges. First, it’s now clear that the initial reductions in fares on high-volume routes were in large measure not the result of any increase in efficiency, but of a coincidental fall in global energy prices that occurred during the early years of deregulation. A 1990 study by the Economic Policy Institute concluded that, after adjusting for changes in the cost of jet fuel, overall airline fares fell faster in the 10 years before 1978 than they did during the 10 years after.A studypublished in theJournal of the Transportation Research Forumconfirms that this pattern continued for many years. Except for a period after the 9/11 terrorist attack, the study found, real air prices continued to fall more slowly through the mid-2000s than they had before deregulation. Accounting for declines in the quality of airline service over this period would show real prices falling still more slowly. For example, due to the move to a hub-and-spoke system and the decline in the number of direct flights that occurred under deregulation, the time, distance, and inconvenience required to travel to many destinations lengthened substantially during this period. The initial seeming success of deregulation was further belied during the aughts by the reemergence of ruinous competition, which evaporated airline profit margins and eventually turned major carriers into wards of the state. During all but three years of that decade, U.S. airlines had negative net income, racking up cumulative losses of more than $68 billion. Major airlines like United and US Airways declared bankruptcy and defaulted on their pension debts, requiring expensive taxpayer bailouts. Some of this distress was caused by recessions or spikes in fuel costs, but the larger structural cause was the loss of market regulation. Airlines were no longer assured of adequate margins or protection from price wars. Relatedly, the dramatic improvements in aviation technology that had occurred under the CAB disappeared under deregulation. The fuel efficiency of jet engines has marginally increased over the past 40 years, but otherwise, today’s commercial jet liners are little changed from what they were in the late 1970s. In large measure this was a result of deregulated airlines engaging in price wars that prevented them from covering their routine capital costs and accrued liabilities, let alone investing in dramatically improved planes and service quality. Eventually, in an attempt to reverse their declining economic fortunes under deregulation, airlines not only cut service standards but also consolidated massively, taking advantage of lax antitrust enforcement standards that existed for much of that period. After a series of mega mergers, by 2015, a single airline controlled a majority of the market at40 of the 100 largest U.S. airports. Through control of gate access at major “fortress hubs,” incumbent airlines faced virtually no competition on most of their routes, or even the threat of it. By 2021, the four largest remaining airlines controlled nearlytwo-thirdsof the entire domestic market. Adding to the cartelization of the industry was the fact that the four remaining major carriers each counted among its largest stockholders the same fourlarge institutional investors, creating an interlocking ownership structure rivaling that of the big colluding corporate trusts of Gilded Age. Along with the rise of concentrated ownership came a sharp rise in predatory pricing and other business practices, such as frequent-flyer rewards programs designed to further dampen competition among existing carriers and deter the formation of new airlines. At the same time, the airlines continue to add fees and lower service standards while eliminating flights altogether to many smaller and midsize cities, all while raising fares and engaging in massive stock buybacks. Not only does the traveling publicsuffer, but so does the promise of aviation itself. Now that they operate as an unregulated oligopoly, airlines once again have the profits needed to invest in new breakthrough technologies but no longer have any incentive to do so. The retreat from regulated competition did not just apply to airlines. Market regulation of railroads ended at roughly the same time, for example, and with much the same result. Thousands of American cities lost all rail service or became captive to a single monopolistic railroad, thereby losing their ability to compete ascenters of manufacturingor distribution. Similarly, a retreat from regulated competition led to a near-total collapse of American domesticshipbuildingand ocean shipping industries after the 1980s. The federal government also retreated from the regulated competition model in many other key realms. These included the gas and oil sectors, electrical generation and distribution, communications, and, above all, finance. Until the 1980s, regulated competition of banks and other financial institutions controlled what interest rates they could charge or pay and where they could operate, while also strictly limiting mergers and their investments in adjacent lines of business. State and federal laws fostered a dense web of small-scale community banks and locally operated thrifts and credit unions. This not only prevented the growth of banks that were “too big to fail,” it also prohibited an increase in giant, unregulated hedge funds and private equity firms. Under this policy regime, the role of Wall Street over industrial firms was tightly contained, allowing the management of great American industrial companies like Boeing, General Motors, and General Electric to remain mostly in the hands of engineers committed to innovation rather than financiers intent on stripping out assets to maximize short-term profits. Yet the historical role of regulated competition in building the U.S. industrial economy is so poorly understood that the very phrase seems like a contradiction in terms to many Americans. Under the thrall of “neoliberal” doctrines popularized over the past 40 years, too many of us are conditioned to view “free market” competition as inherently productive, and to view government intervention in markets as inherently the opposite. But history shows that without smart rules, market competition is often ruinous to the firms involved, to the pace of technological progress, and ultimately to the larger public interest. Fortunately, history also shows that government measures that channel competition toward productive and socially useful ends are not only possible; they were fundamental to the creation of the world’s greatest, most innovative, most broadly prosperous capitalist nation. The historical role of regulated competition in building the U.S. industrial economy is so poorly understood that the phrase sounds like a contradiction. Too many of us are conditioned to view “free market” competition as inherently productive, and to view government intervention as inherently the opposite. Can we ever get back to a system of regulated competition? At a time when the Trump administration is slashing what remains of America’s regulatory state and “abundance liberals” are bemoaning excessive red tape as a key obstacle to prosperity, reestablishing the system of market regulation might seem like a political nonstarter. But we have already seen dramatic movement in both parties over the past decade in their rediscovery of the importance of effective antitrust enforcement. This has occurred not because of any great change in their respective ideologies. It has happened because of the sheer accumulation of documented harms caused by unregulated, predatory monopolies and a growing awareness among policy intellectuals and elected officials that century-old antitrust laws could be revived and repurposed to address new conditions. Similarly, it’s probably only a matter of time before wide-scale downward mobility, particularly the decline of heartland communities in key electoral states, leads policy makers to rediscover the merits of regulated competition. It is not hard to imagine, for instance, politicians from both parties who represent “flyover” cities banding together to demand more equitable, affordable, and practical air service through a new regulatory regime—perhaps one that takes advantage of AI and other modern data-processing tools to make pricing and other regulatory functions more precise than under the old CAB system. Taking the next step back to the future by applying market regulation to key existing and emerging industries might take time. But it seems increasingly inevitable as the alternatives variously advocated by Republicans and Democrats continue to fail or prove inadequate to the political economic challenges we face. **Related** **Phillip Longman** Phillip Longman is the senior editor at the Washington Monthly and the policy director at the Open Markets Institute. **Support theWashington Monthly** At this moment of deep political division, bold ideas to preserve American democracy are more important than ever. TheWashington Monthlyis an independent voice, listened to by insiders and willing to take on sacred cows—liberal and conservative. And we need your support. Help us—your contribution is vital, tax-deductible, and much appreciated! **Donate Now!** Sign up below for theWashington MonthlyNewsletterand get our best stories from the web and print, plus our weekly podcast, straight to your inbox Email (required)* Example: Yes, I would like to receive emails from Washington Monthly. (You can unsubscribe anytime) Bluesky Page X Username Youtube Page Linkedin Page Washington Monthly’s 2024 College Guide and Rankings 2020 Hospital Guide and Rankings MagazineCurrent IssuePast Issues Current Issue Past Issues Current Issue Past Issues From the Archives EducationK-12Higher Education K-12 Higher Education K-12 Higher Education Health Care The Monopolized Economy Politics Protecting the Vote Law and Justice Economy Books About Advertising Contact Careers Privacy Policy Successes of Philanthropy"}