{"id": 1866, "name": "Alberta Press Leader", "domain": "albertapressleader.ca", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://albertapressleader.ca/new-york-times-best-selling-author-pens-article-the-drug-that-cracked-covid-ivermectin-the-forbidden-treatment-alberta-press/", "title": "New York Times Best Selling Author Pens Article The Drug That Cracked Covid Ivermectin The Forbidden Treatment Alberta Press", "content": "Alberta Press Leader Alberta Press Leader News **New York Times best-selling author pens article ‘The Drug that Cracked Covid’ Ivermectin: The Forbidden Treatment** **Ivermectin: The Forbidden Treatment** So why are journalists not covering it? Michael Capuzzo, a New York Times best-selling author, and a six-time Pulitzer-nominated journalist publishedan articletitled “The Drug that Cracked Covid.” The article chronicles the struggle between frontline doctors around the world to get ivermectin approved as a Covid-19 treatment and the media outlets and social media companies thwarting them. Capuzzo said because of ivermectin there are “hundreds of thousands, actually millions, of people around the world who are living and not dying but the media has done all they can to “debunk” ivermectin is an effective, easily accessible and affordable treatment for Covid-19. Capuzzo said the media has parroted the arguments by health regulators around the world that there isn’t enough evidence to justify its use. Capuzzo, as a reporter, “saw with [his] own eyes the other side [of the story]” that has gone unreported, of the many patients in the U.S. whose lives have been saved by ivermectin and of five of the doctors leading the fight to save lives, Paul Marik, Umberto Meduri, José Iglesias, Pierre Kory and Joe Varon. Through their leadership of the Front Line COVID-19 Critical Care (FLCCC) Alliance, they have enhanced treatment of Covid-19 by discovering and promoting the use of Corticoid steroids against the virus. But their calls for ivermectin to be used were met with a wall of resistance from healthcare regulators and a wall of silence from the media. “I really wish the world could see both sides,” said Capuzzo. Capuzzo published his article on ivermectin inMountain Home, a monthly local magazine for the Pennsylvania mountains and New York Finger Lakes region, of which Capuzzo’s wife is the editor. Capuzzo says, “I don’t know of a bigger story in the world.” Total news blackout On Dec. 8 2020, FLCCC member Dr. Pierre Kory gave nine minutes of testimony to the U.S. Homeland Security Committee Meeting on the potent anti-viral, anti-inflammatory benefits of ivermectin. Nine million people viewed the video on YouTube before it was taken down by YouTube’s owner, Google. Capuzzo said mainstream and social media have gone to extraordinary lengths to keep people in the dark about ivermectin. Three days after Kory’s testimony, an Associated Press “fact-check reporter” interviewed Kory. Then she wrote: “AP’S ASSESSMENT: False. There’s no evidence Ivermectin has been proven a safe or effective treatment against COVID-19.” Like many critics, she didn’t explore the Ivermectin data or evidence in any detail, but merely dismissed its “insufficient evidence,” quoting instead the lack of a recommendation by the NIH or WHO. Twitter takes down Brazil’s health minister’s tweet On Jan. 12, 2021, the Brazilian Ministry of Health tweeted to its 1.2 million followers not to wait with COVID-19 until it’s too late but “go to a Health Unit and request early treatment,” (Ivermectin) only to have Twitter take down the official public health tweet for “spreading misleading and potentially harmful information.” Facebook takes down Slovak’s health minister’s post to use Invermectin On Jan. 31, the Slovak Ministry of Health announced its decision on Facebook to allow use of Ivermectin. Facebook took down the post and removed the entire page it was on, the Ivermectin for MDs Team, with 10,200 members from more than 100 countries. In Argentina, Professor and doctor Hector Carvallo, whose prophylactic studies are renowned by other researchers, says all his scientific documentation for Ivermectin is quickly scrubbed from the Internet. “I am afraid,” he wrote to Marik and his colleagues, “we have affected the most sensitive organ on humans: the wallet…” As Kory’s testimony was climbing toward nine million views, YouTube, owned by Google, erased his official Senate testimony, saying it endangered the community. Front-line doctors undeterred Undeterred, many front-line doctors have tried to persuade their health regulators of the efficacy and safety of ivermectin as a covid treatment. They include Dr. Tess Lawrie, a prominent independent medical researcher who, as Capuzzoreports, evaluates the safety and efficacy of drugs for the WHO and the National Health Service to set international clinical practice guidelines: She read all 27 of the Ivermectin studies Kory cited. The resulting evidence is consistent and unequivocal, she said, and sent a rapid meta-analysis, an epidemiolocal statistical multi-study review considered the highest form of medical evidence, to the director of the NHS, members of parliament, and a video to Prime Minister Boris Johnson with “the good news… that we now have solid evidence of an effective treatment for COVID-19…” and Ivermectin should immediately “be adopted globally and systematically for the prevention and treatment of COVID-19.” Ignored by British leaders and media, Lawrie convened the day-long streaming BIRD conference—British Ivermectin Recommendation Development—with more than 60 researchers and doctors from the U.S., Canada, Mexico, England, Ireland, Belgium, Argentina, South Africa, Botswana, Nigeria, Australia, and Japan. They evaluated the drug using the full “evidence-to-decision framework” that is “the gold standard tool for developing clinical practice guidelines” used by the WHO, and reached the conclusion that Ivermectin should blanket the world. “Most of all you can trust me because I am also a medical doctor, first and foremost,” Lawrie told the prime minster, “with a moral duty to help people, to do no harm, and to save lives. Please may we start saving lives now.” She heard nothing back. Dr. Andrew Hill, a renowned University of Liverpool pharmacologist and independent medical researcher, and the senior World Health Organization/UNITAID investigator of potential treatments for COVID-19 said Ivermectin was the only thing that worked against COVID-19, and its safety and efficacy were astonishing. Ivermectin, the WHO researcher concluded, reduced COVID-19 mortality by 81 per cent. VIDEO:MP Derek Sloan raises concerns about censorship of doctors and scientists **Continue Reading** **More Stories** News **The Role of Unbiased News in Shaping Public Perception of Online Gambling** News **PM Justin Trudeau’s ‘hair flip’ goes viral** News **Top German Lawyer Launches Class-Action Suit Against COVID Lockdowns** You may have missed News **The Role of Unbiased News in Shaping Public Perception of Online Gambling** News **PM Justin Trudeau’s ‘hair flip’ goes viral** News **Top German Lawyer Launches Class-Action Suit Against COVID Lockdowns** News **Notable Crimes and Investigations in Alberta: A Closer Look** News **New York Times best-selling author pens article ‘The Drug that Cracked Covid’ Ivermectin: The Forbidden Treatment** About Contact"}