{"id": 1336, "name": "Techdirt", "domain": "techdirt.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.techdirt.com/2025/06/05/judge-cites-kafka-regarding-renditioning-venezuelans-to-salvadoran-concentration-camp-but-allows-kafkaesque-conditions-to-continue/", "title": "Judge Cites Kafka Regarding Renditioning Venezuelans To Salvadoran Concentration Camp But Allows Kafkaesque Conditions To Continue", "content": "Sign In Register Preferences TechDirt GreenHouse Free Speech Error 402 Ctrl-Alt-Speech Deals Jobs Support Techdirt **Judge Cites Kafka Regarding Renditioning Venezuelans To Salvadoran Concentration Camp, But Allows Kafkaesque Conditions To Continue** Legal Issues **from thewhen-do-we-turn-into-cockroachesdept** Generally speaking, if a judge begins an order — in a case where hundreds of men were illegally renditioned to a Salvadoran concentration camp directly against that judge’s orders — by talking about Franz Kafka’sThe Trial, you’d think that the judge is going to go hard against the government. Instead, Judge James Boasberg delivers quite a frustrating ruling: after eloquently explaining why the government’s actions mirror Kafka’s nightmarish bureaucracy, he proceeds to accept the Trump administration’s transparently ridiculous claim that they have no control over people they literally paid El Salvador to imprison. He does try to concoct a workaround — arguing that while the prisoners can’t file habeas because they’re supposedly not in US custody, their due process rights were violated, so the remedy is to somehow restore their ability to file the habeas petitions they can’t file. But as we’ll see, this “solution” seems quite toothless. The ruling starts with this somewhat incredible paragraph: One morning, Kafka’s Josef K. awakens to encounter two strange men outside his room. As he gets his bearings, he realizes that he is under arrest. When he asks the strangers why, he receives no answer. “We weren’t sent to tell you that,” one says. “Proceedings are under way and you’ll learn everything in due course.” Franz Kafka, The Trial 5 (Breon Mitchell trans., Schocken Books Inc. 1998). Bewildered by these men and distressed by their message, K. tries to comfort himself that he lives in “a state governed by law,” one where “all statutes [are] in force.” Id. at 6. He therefore demands again, “How can I be under arrest? And in this manner?” “Now there you go again,” the guard replies. “We don’t answer such questions.” Undeterred, K. offers his “papers” and demands their arrest warrant. “Good heavens!” the man scolds. “There’s been no mistake.” “[O]ur department,” he assures K., is only “attracted by guilt”; it “doesn’t seek [it] out . . . . That’s the Law.” Id. at 8–9. “I don’t know that law,” K. responds. “You’ll feel it eventually,” the guard says. Id. at 9. And then he makes the direct tie-in from that story to what’s actually happening: Such was the situation into which Frengel Reyes Mota, Andry Jose Hernandez Romero, and scores of other Venezuelan noncitizens say they were plunged on March 15, 2025. In the early morning hours, Venezuelans held by the Department of Homeland Security at El Valle Detention Facility in Texas were awakened from their cells, taken to a separate room, shackled, and informed that they were being transferred…. To where? That they were not told…. When asked, some guards reportedly laughed and said that they did not know; others told the detainees, incorrectly, that they were being transferred to another immigration facility or to Mexico or Venezuela. Before long, Reyes Mota, Hernandez Romero, and the other detainees were shuttled onto buses, driven to a nearby airport, and loaded onto planes…. As the planes waited on the tarmac, many passengers aboard reportedly began to panic and beg officials for more information, but none was provided…. The planes eventually departed that evening and, after a stop in Honduras, landed in El Salvador…. Upon their arrival, the detainees were transferred into a Salvadoran mega-prison known as the Center for Terrorism Confinement (CECOT). And he reminds everyone that the government literally ignored his pretty clear order to not take these men out of the country: This Court, at a swiftly convened hearing on March 15, ordered the Government not to relinquish custody of the men,but that mandate was ignored. Such defiance is currently the subject of the Court’s contempt inquiry. So far, so good. The judge has laid out a perfect analogy for what happened and documented the government’s contempt of his direct orders. Then he completely undermines himself: While it is a close question,the current record does not support Plaintiffs’ assertion that they are in the constructive custody of the United States. Even crediting the public statements characterizing the arrangement as outsourcing the U.S. prison system and acknowledging the President’s unofficial assertion of his power to request a release, such comments cannot overcome a sworn declaration from a knowledgeable government official attesting that the CECOT Class’s ongoing detention is a question of Salvadoran law This is where the ruling goes completely off the rails. Judge Boasberg claims that further details that the DOJ filed under seal about the nature of the deal between the US and El Salvador suggest that the deal is basically “we ship ‘em to you, you do whatever the fuck you want with them,” and thus they shouldn’t be seen as being in “constructive custody” of the US any more. This is obvious bullshit, and the judge knows it. Because there’s almost no one in the world who thinks that if the US government called up President Bukele and said “yo, we need that person back” that Bukele wouldn’t do it. Hell, we know thisbecause the US already did that. As an article the NY Times wrote back in April revealed (buried so deep down that I haven’t seen much commentary on it)El Salvador has already sent backat least eight people that were incorrectly sent there: In Washington, the Trump administration was working to address Mr. Bukele’s confusion about whom the United States had sent him.Eight women who had been mistakenly sent were swiftly flown back. So when the US wants someone back from CECOT, they get them back. But somehow that information isn’t at play here. Judge Boasberg does admit that it’s entirely possible the government is lying to him, but basically says his hands are tied by the Supreme Court: This conclusion, to be sure, presumes the truthfulness and reliability of the Kozak Declaration, which is rendered more difficult given the Government’s troubling conduct throughout this case. The Court nonetheless follows the lead of the Supreme Court, the D.C. Circuit, and other courts within this district in taking Kozak at his word. In Munaf, the Supreme Court instructed federal district courts not to “second-guess” assessments of the political branches as to the nature of detention under a foreign sovereign. See 553 U.S. at 702. Applying that principle, our Circuit has found governmental submissions similar to the Kozak Declaration to be conclusive on the question whether ongoing detention is “on behalf of the United States.” Seems bad! He also admits that the Trump admin’s claims in this case aren’t nearly as detailed or believable as in the precedents he feels bound by, but basically says the plaintiffs (who, again, are mostly disappeared in a concentration camp no one gets released from) really need to provide more proof that the US government has some say in their detention, even as he admits it contradicts other statements that [checks notes]… the US government is making. Plaintiffs, however, have unearthed no comparably reliable evidence to rebut the Kozak Declaration. The Court must therefore at this point accept the Government’s representations as to the nature of the CECOT Plaintiffs’ ongoing detention,despite their incongruity with multiple public statementsmade by both Salvadoran and U.S. officials. Great. The judge then proceeds to explain why this exact scenario — shipping prisoners beyond the reach of habeas corpus — was one of the grievances that led to American independence. But apparently that’s just an interesting historical footnote now: The Court is nonetheless mindful of the possibility, raised by Plaintiffs, that the Government has adopted and presented its arrangement with El Salvador as a “ruse — and a fraud on the court — designed to maintain control over the detainees beyond the reach of the writ.” …. Our legal tradition is wholly incompatible with the establishment of a network of overseas prisons, shielded from the Great Writ by the facade of foreign control, to which the Government routinely exports detainees without due process — a legal no man’s land.Indeed, the Habeas Corpus Act of 1679 generally prohibited detention “beyond the seas” to places where the writ did not run, … and such abuses partly animated this nation’s War for Independence. See Declaration of Independence para. 21 (U.S. 1776) (listing amongst grievances against the King that he “transport[ed]” colonists “beyond Seas to be tried for pretended offences”).Were such a scheme to subsequently be made apparent to the Court, it would follow the Supreme Court’s instruction to “take such action as will defeat attempts to wrongfully deprive parties entitled to sue in Federal courts [for] the protection of their rights in those tribunals.” It feels like he’s begging for evidence that the Justice Department is lying to him and reminds the government that “any official who makes knowingly false statements in a sworn declaration subjects himself to perjury prosecution.” Having accepted the government’s lie about custody, the judge then concocts a workaround that’s somehow even more absurd: since the men’s due process rights were violated, the equitable remedy is… to have the Trump admin somehow restore their ability to file habeas petitions they can’t file because they’re supposedly not in US custody. That principle permits Plaintiffs to proceed here. Just like litigants have since the beginning of our legal tradition, they may invoke this Court’s equitable authority to restrain the Government from infringing upon constitutional protections. They need not do so in habeas, nor are they obligated to identify a cause of action conferring that right. The judge does conclude the due process violation is clear, citing recent Supreme Court holdings in this and related cases: In light of those Supreme Court holdings, this Court ultimately agrees with the CECOT Plaintiffs that they are likely to succeed on the merits of their due-process claim. Defendants plainly deprived these individuals of their right to seek habeas relief before their summary removal from the United States — a right that need not itself be vindicated through a habeas petition. Perhaps the President lawfully invoked the Alien Enemies Act. Perhaps, moreover, Defendants are correct that Plaintiffs are gang members.But — and this is the critical point — there is simply no way to know for sure, as the CECOT Plaintiffs never had any opportunity to challenge the Government’s say-so.Defendants instead spirited away planeloads of people before any such challenge could be made. And now, significant evidence has come to light indicating that many of those currently entombed in CECOT have no connection to the gang and thus languish in a foreign prison on flimsy, even frivolous, accusations. This is the point we’ve raised before.Without due process, there is no rule of law. So what’s the remedy for this constitutional violation? The judge orders the government to “facilitate” the prisoners’ ability to seek habeas relief — the same meaningless directive that’s already been ignored (if not mocked) in similar cases: Because the other preliminary-injunction factors also support the CECOT Plaintiffs, the Court concludes that their Class is entitled to preliminary relief. In short,the Government must facilitate the Class’s ability to seek habeas reliefto contest their removal under the Act. Exactly what such facilitation must entail will be determined in future proceedings. Although the Court is mindful that such a remedy may implicate sensitive diplomatic or national-security concerns within the exclusive province of the Executive Branch, it also has a constitutional duty to provide a remedy that will “make good the wrong done.” Let’s recap this judicial pretzel: The prisoners can’t file habeas because they’re supposedly not in US custody. But their due process rights were violated by being denied the chance to file habeas before removal. So the remedy is to restore their ability to file habeas… which they still can’t do because they’re not in US custody. As is now clear, CECOT Class members were entitled to notice and an opportunity to challenge their removability pursuant to the Proclamation. That process — which was improperly withheld — must now be afforded to them. Put differently, Plaintiffs’ ability to bring habeas challenges to their removal must be restored. In light of the well-established law of remedies and the example that has already been set by all three levels of the federal judiciary, then,Defendants must facilitate Plaintiffs’ ability to proceed through habeasand ensure that their cases are handled as they would have been if the Government had not provided constitutionally inadequate process. The judge acknowledges what’s really at stake here: The Court determines that such a remedy balances Defendants’ distinct role in conducting foreign affairs with the grave need to right their legal wrongs;absent this relief, the Government could snatch anyone off the street, turn him over to a foreign country, and then effectively foreclose any corrective course of action.See Abrego Garcia, 145 S. Ct. at 1019 (statement of Sotomayor, J.). Well, duh. That’s the whole fucking concern. And, yes, the governmentalready didsnatch people off the street to send to a foreign country, effectively foreclosing any corrective course of action. So what happens now? The judge punts, asking the government to submit a “plan” for facilitating something they’ve alreadyshown zero interestin facilitating: Mindful of national-security and foreign-policy concerns,the Court will not — at least yet — order the Government to take any specific steps. It will instead allow Defendants to submit proposals regarding the appropriate actions that would “allow [Plaintiffs] to actually seek habeas relief.” We all know how this ends: the DOJ will file some theatrical bullshit claiming they’d love to help but gosh, foreign sovereignty and all that. The judge will wring his hands some more. And hundreds of men will continue rotting in CECOT because everyone involved would rather play legal theater than acknowledge the obvious solution: if you shipped them there, you can damn well get them back. Perhaps Judge Boasberg will surprise us and come up with something that has actual teeth, but it feels long past the time for that. Meanwhile, the men who were disappeared into this Kafkaesque nightmare remain trapped in a foreign prison, casualties of a legal system more interested in procedural niceties than actual justice. The judge opened with Kafka, which would lead you to believe his goal is to not be just another cog in a Kafkaesque machine, but the authority who puts an end to the nonsense. Instead, we just keep getting another round of bureaucratic bullshit. Filed Under:alien enemies act,cecot,dhs,doj,donald trump,due process,el salvador,facilitation,habeas corpus,james boasberg,rendition The GOP Is Way Too Fucking Excited About Using US Troops On American Protestors Lindsey Graham Thinks It Should Be Illegal To Identify ICE Agents Columbia's Capitulation Backfired Spectacularly As Trump Admin Threatens Its Accreditation ICE, DHS Again Pretend Congress Members Don't Have The Legal Right To Engage In Unannounced Detention Facility Inspections California Sues Trump Over Unprecedented Federal Seizure Of State National Guard **Comments on “Judge Cites Kafka Regarding Renditioning Venezuelans To Salvadoran Concentration Camp, But Allows Kafkaesque Conditions To Continue”** Filter comments in byTime Filter comments asThreaded Filter only comments ratedInsightful Filter only comments rated funnyLOL Filter only comments that areUnread **** Cool, another judge turns into a fascist. **** Seems like the judge needs to find his family in some wore torn country. **** trump shares his section of the blame but this is really the fault of a legal system that has consistently refused to allow any level of real accountability for government officials. if we had a judiciary that could actually punish government overreach, we wouldn’t be at this point, but the standard under both parties has always been that an agent of the government has to curbstomp a child on camera before there’s even the question of putting someone in jail **** Captain Yossarian would be proud. This comment has been flagged by the community.Click heretoshowit. **Right Place Right Time** El Salvador has already sent back at least eight people that were incorrectly sent there Those sent back were women, and the facility was for men only. The statement above wrongly implies that it was a mistake to deport them; it was not. The mistake was to try to send them somewhere that only accommodates men. Unlike Kafka, we do know the crime: illegal presence within the United States. They had their hearing, they lost, and they received a deportation order. Due process worked. **Re:** Do you get sexual pleasure from the suffering and misery of people you deem “lesser”, or is that just a side effect of you being a heartless asshole? **Re:** Unlike Kafka, we do know the crime: illegal presence within the United States. Unauthorized entry is a civil offense under federal law, not a criminal one. **Re: Re:** No, it’s not, but it is a misdemeanor rather than a felony. **Re:** They had their hearing, they lost, and they received a deportation order. Due process worked. The Supreme Court has made clear that potential deportees under the Alien Enemies Act must be afforded due process to challenge that designation. That’s a separate right to due process from the one that you’re referring to. **Re:** Did you cum? **Unlike Techdirt, trial judges are constrained by the fact that what they write is subject to appeal** So, they have to live in the real world. And the motions panel in the DC Circuit this month is Judges Katsas, Rao, and Walker, all appointed during Trump’s first term. Would you REALLY rather he issue an order that is likely to be overturned on appeal? **Re:** Yes. At least he’d be trying to do something other than pussyfoot around the issue of the federal government ignoring the courts. **Re:** Yes? Why wouldn’t I want that? If Boromir let Frodo go to Mordor with the ring, Frodo was likely to fail. Boromir should therefore have claimed the ring himself and taken it to Minas Tirith. He has to live in the real world, after all. **Re:** Would you REALLY rather he issue an order that is likely to be overturned on appeal? Why would it be better to avoid the issue entirely? Also can’t it be heard en banc if needed. **Re: Re:** After it gets heard en banc (and assuming the order is reinstated), it then goes to the Supreme Court. Do you want to give odds on what the Supreme Court would do with it? And while all this flailing around is going on, the prisoners stay in durance vile, the plaintiff’s lawyers (and whoever is backing them) are throwing money/time away futilely. Worse, knowingly futilely. What material benefit do you see coming out of such a gesture for the plaintiffs? And if not for them, then the next plaintiffs? You should be writing to your congressmen – especially if they are republican – to demand that detention laws be modified to prevent such abominations. Something as simple as “thou shalt not transport prisoners to detention outside of US custody”. And nailing down the due process rights (lawyer access, time scales, all of that that the Trump admin has been abusing). **Re: Re: Re:** Do you want to give odds on what the Supreme Court would do with it? It’s better odds than 0, which is what doing nothing gives you. SCOTUS sucks obviously, and I’m not saying it’s good odds. But it’s also not a guarantee, either. We’ve seen it make some (very limited progress) towards limiting the administration in these cases. It’s how we got things like habeas. You should be writing to your congressmen – especially if they are republican – to demand that detention laws be modified to prevent such abominations. The thing is, it’s not an either/or. You can do both. (And speaking of which, the odds of Republican Congressmen doing anything remotely productive is about as likely as SCOTUS). I don’t see any reason not to do the right thing, even if it’s not likely to work. I’m not expecting it to be successful, but that isn’t a reason not to try, unless there is some strategic advantage to be gained otherwise. If nothing else, you tie them up in court when they’re on very limited resources as is. (Which isn’t necessarily something a judge should be taking into account, but if you’re looking at the composition of the circuit you’re past that already) The saying is “Don’t obey in advance” for a reason. Especially when you’re citing an irrelevant factor like the 3 way DC bench instead of SCOTUS. It’s dire enough without actively finding excuses to give up. **Re:** I get that and am sympathetic to it, but find it frustrating that EVERYONE knows what’s going on here and people have to sit in a concentration camp for months while the DOJ/DHS will continue to lie. **Re: 'You'd better not do that again or I'll really wag my finger at you!'** As opposed to a ruling where he wrings his hands pathetically, says what the government did was super bad… and then proceeds to basically tell them ‘But yeah, you get a pass’? Yes, because even if it was overturned on appeal he would at least betryingto do something about the gross miscarriage of justice and the law rather than just washing his hands of the atrocity. **Rights of a nation?** the USA has as much Rights to Ship People over the Southern border, as those South of the Border have being SHIPPED to the USA. IT ENDS AT OUR BORDER, no Further.The problem we have is TRUMP thinks Everything South of the Border is Mexico. And the only reason he knows Salvadore is that its his Vacation location. **Or in other words, 'Put up or shut up'** If you complain to a company that you hate what they’re doing but you still buy from them all you’ve taught them is that they can ignore your complaints. Likewise if you’re a judge and you complain about something the government does but still allow them to get away with doing it all you’ve taught them is that they can ignore your complaints and continue doing the act in question. If US judge are going to keep acting like doormats and let the government stomp all over them the least they can do is stop wasting everyone’s time and money and just admit at the outset that they will not rule against the government in any substantial manner, nor hold the government accountable for violations of court orders. **** I was feeling a little bit hopeful when I read that Judge J. Harvie Wilkinson III was willing touse the Trump administration’s public statements to disprove pretenses of lawfulness in court: If courts pay more attention to out-of-court presidential and Administration statements, that will be another example of how the “presumption of regularity”—”the courts’ baseline assumption that government officials act lawfully and in good faith,” as Alan Rozenshtein puts it—is in serious jeopardy. Justice Alito’s dissent to the A.A.R.P. order, in which Justice Thomas joined, shows that those two justices remain content to rely on the Government’s representation’s in court—and vexed that their colleagues apparently feel differently. Like stare decisis,the presumption of regularity is a judicial doctrine; Wilkinson rejected the doctrine in a specific case for good reason. Judge James Boasberg walked right up to the line of rejecting the doctrine, hit the other side with a fist, andbacked away, succeeding in un-raising my faith in the courts to penalize perjury. **So how about selling kidnapped victims into slavery?** Imagine if the DHS were capturing civilians in the US and then selling them into Namibia to work in the diamond mines, then to forget about them and erase their records? Would anyone consider this a wrongdoing? Would someone be faulted? Would any effort be made to effect recovery of the victims? It’s the same picture. **Re:** Imagine if the DHS were capturing civilians in the US… We don’t have to,they already are. **** “We must respect foreign sovereignty!” Iraq has left the chat. Also, Panama, Afghanistan, Cuba, Venezuela, Haiti andthe rest of a very long list. **thoughtful [sic] analysis** “This is obvious bullshit, and the judge knows it.”?It’s cute that you, a tech blogger with a degree from Twitter Law School, presume to know the mind of the judge AND know better than him and his law clerks the ins and outs of constructive custody. Criticize the result. Criticize the DOJ’s suspicious and underhanded behavior in this whole saga. But man when you start criticizing the legal analysis about things you just don’t understand? To quote one author, “This is obvious bullshit, and [you] know[] it.” **Re:** i keep reading your comment but i can’t seem to find the argument =/ **Re: Re:** Then perhaps try reading the order, where the judge spends pages analyzing the issue? Maybe the judge is wrong–the appellate process may correct his errors if there are any. But simply shouting “bullshit” (not to mention, “and you know it”) from the peanut gallery/back seat/pick your metaphor for you don’t really know, sounds more like whining that the law doesn’t work the way you want it to. **** El Salvador has already sent back at least eight people that were incorrectly sent there Those sent back were women, and the facility was for men only. The statement above wrongly implies that the Trump administration readily acknowledged it was wrong to deport them; they did not. The error was to try to send them somewhere that only accommodates men. **** Wait, so now “next friend” can file lawsuit on behalf of a third party an obtain TRO without posting a mandatory bond? **** **Add Your CommentCancel reply** Your email address will not be published.Required fields are marked* Have a Techdirt Account?Sign in now. Want one?Register here Name Email Subscribe to theTechdirt Dailynewsletter URL Subject Comment* **Comment Options:** Techdirt community members with Techdirt Credits can spotlight a comment as either the \"First Word\" or \"Last Word\" on a particular comment thread. Credits can be purchased at theTechdirt Insider Shop » Δ **Techdirt Daily Newsletter** A weekly news podcast fromMike Masnick&Ben Whitelaw Read the latest posts: Winding Down Our Latest Greenhouse Panel: The Lessons Learned From SOPA/PIPA From The Revolt Against SOPA To The EU's Upload Filters Did We Miss Our Best Chance At Regulating The Internet? Read All» Become an Insider! **Wednesday** **Tuesday** **Email This Story** **** This feature is only available to registered users.You can registerhereorsign into use it. **Tools & Services** Twitter Facebook RSS Podcast Research & Reports **Company** About Us Advertising Policies Privacy **Contact** Help & Feedback Media Kit Sponsor / Advertise **More** Copia Institute Insider Shop Support Techdirt"}