{"id": 795, "name": "KVIA - El Paso", "domain": "kvia.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://kvia.com/for/2025/06/06/texas-attorney-general-denies-public-access-to-franklin-high-football-team-hazing-investigation-done-by-outside-law-firm/", "title": "Texas Attorney General Denies Public Access To Franklin High Football Team Hazing Investigation Done By Outside Law Firm", "content": "Home NewsEl PasoNew MexicoTexasOn the BorderXtraUS/WorldABC-7 Alert CenterEducationMilitaryHealth El Paso New Mexico Texas On the Border Xtra US/World ABC-7 Alert Center Education Military Health El Paso New Mexico Texas On the Border Xtra US/World ABC-7 Alert Center Education Military Health WeatherABC-7 StormTrack DopplerABC-7 First Alert ABC-7 StormTrack Doppler ABC-7 First Alert ABC-7 StormTrack Doppler ABC-7 First Alert TrafficGas Prices Gas Prices Gas Prices SportsUTEPNMSUEl Paso Chihuahuas UTEP NMSU El Paso Chihuahuas UTEP NMSU El Paso Chihuahuas Be Mindful Play ShareABC-7 Listens ABC-7 Listens ABC-7 Listens Watch a Newscast Watch Live Events Watch Locomotive FC LifeFather’s DayCommunity ChampionsBorderland ExpertsDo-GooderGood Vibes OnlySunday FundayLifestyleEntertainmentEvents CalendarYour Money Father’s Day Community Champions Borderland Experts Do-Gooder Good Vibes Only Sunday Funday Lifestyle Entertainment Events Calendar Your Money Father’s Day Community Champions Borderland Experts Do-Gooder Good Vibes Only Sunday Funday Lifestyle Entertainment Events Calendar Your Money About UsContact KVIAPeople of ABC-7Email AlertsDownload Our AppsJobsClosed CaptioningEEO Public FilingFCC Public FileHistory of KVIA ABC-7TV Listings Contact KVIA People of ABC-7 Email Alerts Download Our Apps Jobs Closed Captioning EEO Public Filing FCC Public File History of KVIA ABC-7 TV Listings Contact KVIA People of ABC-7 Email Alerts Download Our Apps Jobs Closed Captioning EEO Public Filing FCC Public File History of KVIA ABC-7 TV Listings News Weather Traffic Sports Be Mindful Play Share **ABC-7 First Alert: Near record-highs for Father’s Day Weekend, lingering rain chances today** **Texas attorney general denies public access to Franklin High football team hazing investigation done by outside law firm** Coach responds to reprimand: “The incidents that were reported I could not even imagine.” EL PASO, Texas (KVIA) -- Texas Attorney General Ken Paxton says a report by an Austin law firm hired by El Paso ISD to investigate hazing allegations in Franklin High School’s football program can be withheld from the public under the state's open records law. The ruling stems from an ABC-7 open records request in March that sought all investigative reports related to allegations of misconduct and hazing involving members of the Franklin High School varsity football team. Some information, such as the school's investigative report, was made public. As ABC-7 was first to report, a school investigation revealed there was “inappropriate physical conduct linked to hazing” among teammates on the football team in the Spring of 2024, records show. According to records, some players indicated there was trash talking and took it as a joke, while others pointed to students being dragged to the “Hog Pit”, their shirts ripped off, or incidents in the locker room showers where students were slapped and ganged up for initiations.One student told ABC-7he was hazed and sexually harassed. Investigators could not corroborate claims that genitalia was placed on a player’s face or mouth. When ABC-7 requested the investigative report prepared by attorneys Walsh Gallegos Kyle Robinson & Roalson out of Austin, EPISD denied access. The school district’s attorney, S. Anthony Safi, requested a legal opinion to withhold the documents citing attorney-client privilege. “The investigative report and timeline were intended to be confidential, and have been kept confidential,” Safi wrote in a letter to Paxton on March 21. “These materials were not intended to be disclosed to third parties other than those to whom disclosure was made in the furtherance of rendition of professional legal services to EPISD, or those reasonably necessary for the transmission of communication.” In a letter dated May 28, Paxton’s Open Records Division agreed with Safi, saying the district “demonstrated the applicability of the attorney-client privilege to the information at issue.” ABC-7 appealed to Paxton to release the report, along with other materials the district sought to withhold, including an audit of the hazing allegations Safi said was done by the district’s chief internal auditor, a four-page letter sent from Principal Amanda Bowser to now former football coach Daren Walker, and a letter sent from Bowser to the Texas Department of Family and Protective Services. While the Attorney General's ruling allowed the district to withhold most of the information from the public under certain exemptions, it said EPISD had to release the letter of reprimand Walker received from Principal Bowser following its hazing investigation. “Upon review, we find the information at issue related to the employee at issue in his capacity as an athletics coach not a teacher,” the letter from the Attorney General’s Open Records Division states. “Thus, we find the district has failed to demonstrate the information at issue consists of documents evaluating the performance of a teacher or administrator for purposes of section 21.355 of the Education Code.” The school launched an investigation in October 2024 after Franklin High School Principal Amanda Bowser received two anonymous letters alleging hazing was happening with the football program, according to records obtained by ABC-7. Records show Daren Walker received a letter of reprimand in November 2024 once school administrators concluded their investigation; however, they decided to re-interview players again about the hazing allegations in mid-February of this year. School officials would only confirm Walker was reassigned on February 26 for a “personnel matter,” but records obtained by ABC-7 show he was removed that day from his coaching duties whilebeing investigated for slapping a playeron the back of the head at a fundraising meeting. The outcome of the slapping investigation prompted Franklin High School Principal Amanda Bowser to recommend the termination of Walker’s contract, records show. The records obtained by ABC-7 under the Texas Public Information Act reveal Walker was suspended with pay and is set to retire on Friday, June 6. In Bowser’s 2-page letter of reprimand to Walker dated November 19, 2024, she went over a timeline of the investigation, what prompted it, district policies she said Walker violated, reporting procedures, corrective actions the district can take, and schedule changes “to ensure oversight within the football locker room.” In the letter, Bowser said although they believed Walker didn’t know the extent of hazing, saying, “the investigation did reveal that there is a culture in football that makes it difficult for your students to report these things directly to your staff.” Bowser stated the football schedule would be changed due to a lack of locker room supervision. “During our conversations you have mentioned that coaches need to leave early to get to their next classes, which contributes to this lack of supervision,” Bowser wrote. In Walker’s two-page response nearly three weeks later, he reflected on his tenure at El Paso ISD, writing he had worked for the district for 34 years, while serving as head football coach for 24 years. “To be clear, I did not, and would not, knowingly allow students to engage in such conduct,” Walker wrote. “I will ensure, moving forward, that the students are comfortable coming forward to report concerns with me and the football staff. I do not agree that I have violated district policy and that a letter of reprimand was warranted in this matter.” Walker said he addressed the team about “horseplay” in the locker room in April 2024, and it stopped immediately. “I never condoned or encouraged any type of hazing, bullying, initiation, or harassment of a student,” Walker wrote. “The incidents that were reported I could not even imagine.” Walker said a leadership council was created, consisting of Varsity players from each grade level. He said the council was created to, “establish communication between the locker room and the coaches.” ABC-7 has reached out repeatedly to El Paso ISD and Daren Walker for comment on this investigation. To date, the district has refused to comment, citing ABC-7's Public Information (PIA) request, saying, “...El Paso ISD has sought an Attorney General ruling related to your PIA request. While the Attorney General’s ruling is pending the District will not comment on the matter. El Paso ISD remains committed to creating nurturing environments that support the growth of every child. We take every appropriate action to ensure student and staff safety. We appreciate our community's trust and support.\" ABC-7 has renewed its request for an interview with El Paso ISD this week since the Attorney General has made a ruling in the request. So far, we have not heard back. Meanwhile, a Texas Education Agency spokesperson told ABC-7 that the complaint it received about Walker has been reviewed. “TEA can confirm that the educator in question is under investigation by the agency's Educator Investigations Division,” the Texas Agency of Education said in a written statement. “An investigatory flag has been placed on their certificate, which can be viewed via theonline certificate lookup. Because the matter remains ongoing, TEA cannot comment further.” Jump to comments ↓ **Lesley Engle** **Andrew J. Polk** **Related Articles** **SOUTHWEST UNIVERSITY – Senior Salute 2025 | $300 Gift Card** **EP CHILDREN’S HOSPITAL – Father’s Day Photo Contest 2025 | Amazon eCard** **$140M bond on the November ballot for Doña Ana County voters** **ABC-7 First Alert: Near record-highs for Father’s Day Weekend, lingering rain chances today** KVIA ABC 7 is committed to providing a forum for civil and constructive conversation. Please keep your comments respectful and relevant. You can review our Community Guidelines byclicking here If you would like to share a story idea, please submit ithere. Terms of Service|Privacy Policy|Community Guidelines| KVIA-TV FCC Public File|FCC Applications| Do Not Sell My Personal Information **Subscribe to our Email Newsletters** Breaking NewsSevere WeatherDaily News UpdatesDaily Weather ForecastEntertainmentContests & Promotions **Download Our Apps** Accessibility Tools Increase TextIncrease Text Decrease TextDecrease Text GrayscaleGrayscale High ContrastHigh Contrast Negative ContrastNegative Contrast Light BackgroundLight Background Links UnderlineLinks Underline Readable FontReadable Font ResetReset"}