{"id": 1585, "name": "WHYY - NPR - Philadelphia", "domain": "whyy.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://whyy.org/sponsored/thomas-jefferson-university-is-pioneering-professions-focused-education-for-a-dynamic-century/", "title": "Thomas Jefferson University Is Pioneering Professions Focused Education For A Dynamic Century", "content": "**Marketplace** Fresh Air opens the window on contemporary arts and issues with guests from worlds as diverse as literature and economics. Terry Gross hosts this multi-award-winning daily interview and features program. DONATE News Radio & PodcastsRadio ScheduleWays to StreamWHYY Listen App Radio Schedule Ways to Stream WHYY Listen App Radio Schedule Ways to Stream WHYY Listen App TVWHYY TV ScheduleWHYY Watch AppLive TVWatch on DemandStream PBS Kids WHYY TV Schedule WHYY Watch App Live TV Watch on Demand Stream PBS Kids WHYY TV Schedule WHYY Watch App Live TV Watch on Demand Stream PBS Kids Arts Events EducationWHYY Early Education ProgramsFor StudentsPathways to Media CareersWHYY Media LabsYouth Media Awards WHYY Early Education Programs For Students Pathways to Media Careers WHYY Media Labs Youth Media Awards WHYY Early Education Programs For Students Pathways to Media Careers WHYY Media Labs Youth Media Awards SupportMembershipWHYY PassportWHYY Member PortalSponsorshipVehicle Donation ProgramVolunteer Membership WHYY Passport WHYY Member Portal Sponsorship Vehicle Donation Program Volunteer Membership WHYY Passport WHYY Member Portal Sponsorship Vehicle Donation Program Volunteer NEWSLETTERS DONATE SPONSORED Facebook Twitter Email **SPONSORED** **Thomas Jefferson University is pioneering professions-focused education for a dynamic century** Note: This article is a paid placement and does not necessarily reflect the views or opinions of WHYY. Metaphorically, Thomas Jefferson University president Susan C. Aldridge, PhD, has an amazing vista around her. Founded in 1824 as one of the nation’s first medical schools, the first to open a clinic for the poor, and in 1884 the first Textile School in the U.S., her institution enables her to view a 200-year legacy of leadership in higher education, research, clinical care and community engagement. Turning 180 degrees, Aldridge, the leader of one of the nation’s most innovative and effective institutions of profession-focused higher education, envisions Jefferson’s path forward, mapping out its opportunities and responsibilities to be a model for preparing graduates for career-long success in the dynamic, 21st century. At this historical pivot point, Jefferson today is a national doctoral research university with 10 colleges and more than 200 academic programs. It’s also a powerhouse of research discovery, translation and application, scholarship and clinical investigation. Aldridge is exactly the right leader at the right time. An accomplished higher education executive, strategist and futurist, she previously served as president of the University of Maryland Global Campus, president of Drexel University Online, and vice chancellor of Troy University. She was a member of the Jefferson Board of Trustees when she accepted appointment as interim president in June 2023, and was formally named president a year later. “People have asked me why I took on a university presidency at this time, when higher education is experiencing tectonic shifts that are shaking the foundations of hundreds of colleges and universities,” Aldridge said. “My answer is this: Our goal at Jefferson is to redefine ‘possible,’ and that’s exactly what’s called for in higher education today. The world desperately needs what our institutions are best-positioned to offer: New knowledge and the capacity to prepare the skilled and adaptable workforce required to apply that knowledge — enabling them to help solve complex, thorny global challenges.” A Focus on the Future The post-World War II model of higher education served well for many decades, Aldridge observed, and its graduates drove extraordinary advances in the life and physical sciences, engineering, architecture, design, medicine and public health and biomedical research. “But that model is untenable in this century,” she explained. “Today, universities must be flexible and innovative, creative and courageous. We must stay aligned with society’s evolving needs — ensuring that our graduates have the kinds of knowledge, skills and personal capacities they need to succeed for decades to come.” Judging by some key metrics, Jefferson is doing just that. In the first year after earning their bachelor’s degree, 97% of Jefferson graduates are employed in their field or have been accepted to graduate school. Unlike most U.S. colleges and universities, Jefferson’s admissions are growing and it’s been launching new degree programs. Aldridge attributes its student-success rates and program growth to the university’s future-focused and award-winning model for educating professionals, its commitment to pedagogical innovation that leverages both new technologies and the science of cognition and learning, and to dedicated faculty who excel in both their classrooms and their professions. Jefferson has another advantage. It’s one of the few multifaceted universities closely allied with a major academic health system and a non-profit health insurer. “The close relationship between the university, Jefferson Health and Jefferson Health Plans creates myriad opportunities for students’ hands-on engagement in professional activities and research,” Aldridge explained. “Those opportunities are not just in biomedical disciplines, they extend to students in fields ranging from industrial and textile design to arts and humanities to business and public policy.” Leveraging AI in Higher Education Having previously led the development of global online programs at two major universities, Aldridge has deep experience in guiding higher education’s adaptation to — and adoption of — major technology shifts. Now, she is a thought leader on how best to integrate computational science, machine learning and artificial intelligence into universities’ curriculum, teaching and overall operations. “At Jefferson, we work hard to make sure our graduates are prepared for the future of work in an era of — I’ll call it — ubiquitous computation,” she explained. “We want them to be facile and comfortable working with new technological resources like AI; and teach them to balance technologies’ strengths and weaknesses by applying empathy, creativity, intuition and human caring.” The university has also created resources that help faculty and researchers learn about and make best use of emerging computational science applications and technologies. Those include, for example, the AI and Deep Learning Networks Program and the AI Center of Excellence, which help faculty create novel content through machine learning. “But those are just down payments on what we know, intuitively, there will need to be a significant, long-term investment in new technical capacities and resources,” Aldridge noted. In the near future, Jefferson will also launch new academic programs in general computation and data analysis and in discipline-specific areas such as computational biology. “We are also adding teaching on specific data-based capacities to a range of courses where computation may not previously have been relevant — capacities such as creating multimodal large language models and using prompt engineering to shape Generative AI models in real time.” As a thought leader, Aldridge is also asking her peers this provocative question:How best can we proactively guide AI’s use in higher education and shape its impact on our students, faculty and institution — instead of just passively reacting to what comes next? She believes the answer requires pursuing several specific objectives. “First, we must ensure that across our curriculum we are preparing today’s students to use AI in their careers — in particular, to add human-skills value that enables them to succeed in parallel with employers’ expanded use of AI. Second, we need to employ AI-based capacities to enhance the effectiveness of the education we deliver to our students — and to strengthen their capacity for meaningful, lifelong learning. Third, we must employ AI to address specific pedagogical and administrative challenges, ranging from improving learning outcomes to maintaining our campus facilities.” Moving Forward Achieving those objectives — alongside dealing with the slew of other challenges universities are grappling with these days — will not be easy. Which leads back to the question Aldridge is frequently asked: Why take on such an enormous task? “This is a pivotal point in time for both higher education and a university, like ours, that possesses unique characteristics, strengths and opportunities,” she observed. “Jefferson’s mission of improving lives compels us to both positively impact the people, communities and those our graduates will serve, and help improve the quality of higher education and healthcare delivery for generations to come. “Given that context, how could I not be excited about this role and the opportunity it presents to help shape the future?” Facebook Twitter Email Want a digest of WHYY’s programs, events & stories?Sign up for our weekly newsletter. Want a digest of WHYY’s programs, events & stories?Sign up for our weekly newsletter. Want a digest of WHYY’s programs, events & stories?Sign up for our weekly newsletter. Together we can reach 100% of WHYY’s fiscal year goal WHYY provides trustworthy, fact-based, local news and information and world-class entertainment to everyone in our community.WHYY offers a voice to those not heard, a platform to share everyone’s stories, a foundation to empower early and lifelong learners and a trusted space for unbiased news. Learn more aboutSocial Responsibility at WHYY. It’s how we live. WHYY provides trustworthy, fact-based, local news and information and world-class entertainment to everyone in our community. WHYY offers a voice to those not heard, a platform to share everyone’s stories, a foundation to empower early and lifelong learners and a trusted space for unbiased news. Learn more aboutSocial Responsibility at WHYY. It’s how we live. WHYY provides trustworthy, fact-based, local news and information and world-class entertainment to everyone in our community. WHYY offers a voice to those not heard, a platform to share everyone’s stories, a foundation to empower early and lifelong learners and a trusted space for unbiased news. Learn more aboutSocial Responsibility at WHYY. It’s how we live. 215.351.1200talkback@whyy.org 302.516.7506talkback@whyy.org Albie’s Elevator Art Outside Billy Penn Check, Please! Philly The Connection Delishtory Flicks Fresh Air Good Souls The Infinite Art Hunt Movers & Makers On Stage at Curtis Peak Travel Philadelphia Revealed PlanPhilly The Pulse Schooled The Statue Stop and Frisk: Revisit or Resist Studio 2 Things To Do Voices in the Family WHYY News Climate Desk You Oughta Know Young Creators Studio Young, Unhoused and Unseen Your Democracy AboutSocial Responsibility at WHYYBoard and ExecutivesCommunity Advisory BoardFrequently Asked QuestionsEmploymentInternshipsPress RoomMeet Our NewsroomWHYY News Style GuideWHYY ProductionsWHYY SpacesSubmissionsHistoryDirectionsCoverage AreaFinancial StatementsWHYY Community ReportSupportersPrivacy Social Responsibility at WHYY Board and Executives Community Advisory Board Frequently Asked Questions Employment Internships Press Room Meet Our Newsroom WHYY News Style Guide WHYY Productions WHYY Spaces Submissions History Directions Coverage Area Financial Statements WHYY Community Report Supporters Privacy Social Responsibility at WHYY Board and Executives Community Advisory Board Frequently Asked Questions Employment Internships Press Room Meet Our Newsroom WHYY News Style Guide WHYY Productions WHYY Spaces Submissions History Directions Coverage Area Financial Statements WHYY Community Report Supporters Privacy Apps Meet Our Newsroom Employment Lifelong Learning Award N.I.C.E. Initiative Contact Us Sponsorship Directions FCC Public Files FCC Applications Facebook Twitter Instagram YouTube © MMXXV WHYY Privacy Policy Terms of Use for WHYY.org WHYY is partnered with"}