{"id": 1799, "name": "SaneVax", "domain": "sanevax.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://sanevax.org/news-blog/vaccine-injury-reporting/vaccines-and-medications-in-pregnancy-surveillance-system-vampss/", "title": "Vaccines And Medications In Pregnancy Surveillance System Vampss", "content": "Home VictimsVaccine Victims MemorialGardasil & SilgardG / S AustralasiaG / S AustraliaG / S New ZealandG / S EuropeG / S Czech RepublicG / S DenmarkG / S FranceG / S GermanyG / S IrelandG / S ItalyG / S NorwayG / S ScotlandG / S SpainG / S United KingdomG / S N. AmericaG / S CanadaG / S MexicoG / S United StatesG / S S. AmericaG / S BrazilG/S ColombiaCervarixCervarix AsiaCervarix IndiaCervarix PhilippinesCervarix EuropeCervarix CzechCervarix NetherlandsCervarix ScotlandCervarix SlovakiaCervarix SpainCervarix UKCervarix N. AmericaCervarix Mexico Vaccine Victims Memorial Gardasil & SilgardG / S AustralasiaG / S AustraliaG / S New ZealandG / S EuropeG / S Czech RepublicG / S DenmarkG / S FranceG / S GermanyG / S IrelandG / S ItalyG / S NorwayG / S ScotlandG / S SpainG / S United KingdomG / S N. AmericaG / S CanadaG / S MexicoG / S United StatesG / S S. AmericaG / S BrazilG/S Colombia G / S AustralasiaG / S AustraliaG / S New Zealand G / S Australia G / S New Zealand G / S EuropeG / S Czech RepublicG / S DenmarkG / S FranceG / S GermanyG / S IrelandG / S ItalyG / S NorwayG / S ScotlandG / S SpainG / S United Kingdom G / S Czech Republic G / S Denmark G / S France G / S Germany G / S Ireland G / S Italy G / S Norway G / S Scotland G / S Spain G / S United Kingdom G / S N. AmericaG / S CanadaG / S MexicoG / S United States G / S Canada G / S Mexico G / S United States G / S S. AmericaG / S BrazilG/S Colombia G / S Brazil G/S Colombia CervarixCervarix AsiaCervarix IndiaCervarix PhilippinesCervarix EuropeCervarix CzechCervarix NetherlandsCervarix ScotlandCervarix SlovakiaCervarix SpainCervarix UKCervarix N. AmericaCervarix Mexico Cervarix AsiaCervarix IndiaCervarix Philippines Cervarix India Cervarix Philippines Cervarix EuropeCervarix CzechCervarix NetherlandsCervarix ScotlandCervarix SlovakiaCervarix SpainCervarix UK Cervarix Czech Cervarix Netherlands Cervarix Scotland Cervarix Slovakia Cervarix Spain Cervarix UK Cervarix N. AmericaCervarix Mexico Cervarix Mexico Vaccine Victims Memorial Gardasil & SilgardG / S AustralasiaG / S AustraliaG / S New ZealandG / S EuropeG / S Czech RepublicG / S DenmarkG / S FranceG / S GermanyG / S IrelandG / S ItalyG / S NorwayG / S ScotlandG / S SpainG / S United KingdomG / S N. AmericaG / S CanadaG / S MexicoG / S United StatesG / S S. AmericaG / S BrazilG/S Colombia G / S AustralasiaG / S AustraliaG / S New Zealand G / S Australia G / S New Zealand G / S EuropeG / S Czech RepublicG / S DenmarkG / S FranceG / S GermanyG / S IrelandG / S ItalyG / S NorwayG / S ScotlandG / S SpainG / S United Kingdom G / S Czech Republic G / S Denmark G / S France G / S Germany G / S Ireland G / S Italy G / S Norway G / S Scotland G / S Spain G / S United Kingdom G / S N. AmericaG / S CanadaG / S MexicoG / S United States G / S Canada G / S Mexico G / S United States G / S S. AmericaG / S BrazilG/S Colombia G / S Brazil G/S Colombia G / S AustralasiaG / S AustraliaG / S New Zealand G / S Australia G / S New Zealand G / S Australia G / S New Zealand G / S EuropeG / S Czech RepublicG / S DenmarkG / S FranceG / S GermanyG / S IrelandG / S ItalyG / S NorwayG / S ScotlandG / S SpainG / S United Kingdom G / S Czech Republic G / S Denmark G / S France G / S Germany G / S Ireland G / S Italy G / S Norway G / S Scotland G / S Spain G / S United Kingdom G / S Czech Republic G / S Denmark G / S France G / S Germany G / S Ireland G / S Italy G / S Norway G / S Scotland G / S Spain G / S United Kingdom G / S N. AmericaG / S CanadaG / S MexicoG / S United States G / S Canada G / S Mexico G / S United States G / S Canada G / S Mexico G / S United States G / S S. AmericaG / S BrazilG/S Colombia G / S Brazil G/S Colombia G / S Brazil G/S Colombia CervarixCervarix AsiaCervarix IndiaCervarix PhilippinesCervarix EuropeCervarix CzechCervarix NetherlandsCervarix ScotlandCervarix SlovakiaCervarix SpainCervarix UKCervarix N. AmericaCervarix Mexico Cervarix AsiaCervarix IndiaCervarix Philippines Cervarix India Cervarix Philippines Cervarix EuropeCervarix CzechCervarix NetherlandsCervarix ScotlandCervarix SlovakiaCervarix SpainCervarix UK Cervarix Czech Cervarix Netherlands Cervarix Scotland Cervarix Slovakia Cervarix Spain Cervarix UK Cervarix N. AmericaCervarix Mexico Cervarix Mexico Cervarix AsiaCervarix IndiaCervarix Philippines Cervarix India Cervarix Philippines Cervarix India Cervarix Philippines Cervarix EuropeCervarix CzechCervarix NetherlandsCervarix ScotlandCervarix SlovakiaCervarix SpainCervarix UK Cervarix Czech Cervarix Netherlands Cervarix Scotland Cervarix Slovakia Cervarix Spain Cervarix UK Cervarix Czech Cervarix Netherlands Cervarix Scotland Cervarix Slovakia Cervarix Spain Cervarix UK Cervarix N. AmericaCervarix Mexico Cervarix Mexico Cervarix Mexico ResourcesHPV Testing ResourcesPre-HPV VaccinationPost-HPV VaccinationMedical ProfessionalsVaccine Injury AttorneysPolitical Action GroupsVaccine GroupsVaccine Victims Hotline HPV Testing ResourcesPre-HPV VaccinationPost-HPV Vaccination Pre-HPV Vaccination Post-HPV Vaccination Medical Professionals Vaccine Injury Attorneys Political Action Groups Vaccine Groups Vaccine Victims Hotline HPV Testing ResourcesPre-HPV VaccinationPost-HPV Vaccination Pre-HPV Vaccination Post-HPV Vaccination Pre-HPV Vaccination Post-HPV Vaccination Medical Professionals Vaccine Injury Attorneys Political Action Groups Vaccine Groups Vaccine Victims Hotline SANE Vax Press Releases VideosVaccine Safety VideosVaccine Victim VideosPharma Videos Vaccine Safety Videos Vaccine Victim Videos Pharma Videos Vaccine Safety Videos Vaccine Victim Videos Pharma Videos AboutAbout UsWho We ArePress ReleasesSANE Vax in the NewsContact Us About Us Who We Are Press Releases SANE Vax in the News Contact Us About Us Who We Are Press Releases SANE Vax in the News Contact Us SaneVax, Inc. The First International HPV Vaccine Information Clearinghouse NEWSGovernment AgenciesAfricanAsianAustralasianEuropeanNorth AmericanSouth AmericanUnited NationsWHOPharmaceutical CompaniesCSL BiotherapiesGlaxoSmithKlineInovio PharmaceuticalsLiquidia TechnologiesMerck & Co.NovartisPfizerQiagenSanofi AventisSanofi Pasteur MSD spmsdWyeth LaboratoriesScience & MedicineCancerClinical TrialsEnvironmental HealthHeavy Metal ToxicityHPV ScienceInfluenzaMeningitisPertussisPharmaceuticalsRotavirusSTD’sVaccine ScienceWomen’s HealthVaccine Adverse EventsVaccine Injury ReportingVAERSVAMPSSVaccine LitigationVaccine MarketingVaccine Politics/PeopleVaccine VictimsCervarix InjuriesDTP/DTaP InjuriesFluvax InjuriesFluzone InjuriesGardasil / Silgard InjuriesMenomune InjuriesMMR InjuriesPolio Vaccine InjuriesSynflorix InjuriesYellow Fever VaccineVaccinesAnthraxBreast CancerChicken PoxCholeraCombination VaccinesDiphtheriaHepatitis BHPVInfluenza VaccinesMalariaMeaslesMeningitis VaccinesMRSAMumpsNorovirusPertussis VaccinesPneumococcal DiseasePolioRotavirus VaccinesShinglesSmallpoxTBTetanusTyphoidYellow Fever VaccineVaccines and the Media Government AgenciesAfricanAsianAustralasianEuropeanNorth AmericanSouth AmericanUnited NationsWHO African Asian Australasian European North American South American United Nations WHO Pharmaceutical CompaniesCSL BiotherapiesGlaxoSmithKlineInovio PharmaceuticalsLiquidia TechnologiesMerck & Co.NovartisPfizerQiagenSanofi AventisSanofi Pasteur MSD spmsdWyeth Laboratories CSL Biotherapies GlaxoSmithKline Inovio Pharmaceuticals Liquidia Technologies Merck & Co. Novartis Pfizer Qiagen Sanofi Aventis Sanofi Pasteur MSD spmsd Wyeth Laboratories Science & MedicineCancerClinical TrialsEnvironmental HealthHeavy Metal ToxicityHPV ScienceInfluenzaMeningitisPertussisPharmaceuticalsRotavirusSTD’sVaccine ScienceWomen’s Health Cancer Clinical Trials Environmental Health Heavy Metal Toxicity HPV Science Influenza Meningitis Pertussis Pharmaceuticals Rotavirus STD’s Vaccine Science Women’s Health Vaccine Adverse Events Vaccine Injury ReportingVAERSVAMPSS VAERS VAMPSS Vaccine Litigation Vaccine Marketing Vaccine Politics/People Vaccine VictimsCervarix InjuriesDTP/DTaP InjuriesFluvax InjuriesFluzone InjuriesGardasil / Silgard InjuriesMenomune InjuriesMMR InjuriesPolio Vaccine InjuriesSynflorix InjuriesYellow Fever Vaccine Cervarix Injuries DTP/DTaP Injuries Fluvax Injuries Fluzone Injuries Gardasil / Silgard Injuries Menomune Injuries MMR Injuries Polio Vaccine Injuries Synflorix Injuries Yellow Fever Vaccine VaccinesAnthraxBreast CancerChicken PoxCholeraCombination VaccinesDiphtheriaHepatitis BHPVInfluenza VaccinesMalariaMeaslesMeningitis VaccinesMRSAMumpsNorovirusPertussis VaccinesPneumococcal DiseasePolioRotavirus VaccinesShinglesSmallpoxTBTetanusTyphoidYellow Fever Vaccine Anthrax Breast Cancer Chicken Pox Cholera Combination Vaccines Diphtheria Hepatitis B HPV Influenza Vaccines Malaria Measles Meningitis Vaccines MRSA Mumps Norovirus Pertussis Vaccines Pneumococcal Disease Polio Rotavirus Vaccines Shingles Smallpox TB Tetanus Typhoid Yellow Fever Vaccine Vaccines and the Media Government AgenciesAfricanAsianAustralasianEuropeanNorth AmericanSouth AmericanUnited NationsWHO African Asian Australasian European North American South American United Nations WHO African Asian Australasian European North American South American United Nations WHO Pharmaceutical CompaniesCSL BiotherapiesGlaxoSmithKlineInovio PharmaceuticalsLiquidia TechnologiesMerck & Co.NovartisPfizerQiagenSanofi AventisSanofi Pasteur MSD spmsdWyeth Laboratories CSL Biotherapies GlaxoSmithKline Inovio Pharmaceuticals Liquidia Technologies Merck & Co. Novartis Pfizer Qiagen Sanofi Aventis Sanofi Pasteur MSD spmsd Wyeth Laboratories CSL Biotherapies GlaxoSmithKline Inovio Pharmaceuticals Liquidia Technologies Merck & Co. Novartis Pfizer Qiagen Sanofi Aventis Sanofi Pasteur MSD spmsd Wyeth Laboratories Science & MedicineCancerClinical TrialsEnvironmental HealthHeavy Metal ToxicityHPV ScienceInfluenzaMeningitisPertussisPharmaceuticalsRotavirusSTD’sVaccine ScienceWomen’s Health Cancer Clinical Trials Environmental Health Heavy Metal Toxicity HPV Science Influenza Meningitis Pertussis Pharmaceuticals Rotavirus STD’s Vaccine Science Women’s Health Cancer Clinical Trials Environmental Health Heavy Metal Toxicity HPV Science Influenza Meningitis Pertussis Pharmaceuticals Rotavirus STD’s Vaccine Science Women’s Health Vaccine Adverse Events Vaccine Injury ReportingVAERSVAMPSS VAERS VAMPSS VAERS VAMPSS Vaccine Litigation Vaccine Marketing Vaccine Politics/People Vaccine VictimsCervarix InjuriesDTP/DTaP InjuriesFluvax InjuriesFluzone InjuriesGardasil / Silgard InjuriesMenomune InjuriesMMR InjuriesPolio Vaccine InjuriesSynflorix InjuriesYellow Fever Vaccine Cervarix Injuries DTP/DTaP Injuries Fluvax Injuries Fluzone Injuries Gardasil / Silgard Injuries Menomune Injuries MMR Injuries Polio Vaccine Injuries Synflorix Injuries Yellow Fever Vaccine Cervarix Injuries DTP/DTaP Injuries Fluvax Injuries Fluzone Injuries Gardasil / Silgard Injuries Menomune Injuries MMR Injuries Polio Vaccine Injuries Synflorix Injuries Yellow Fever Vaccine VaccinesAnthraxBreast CancerChicken PoxCholeraCombination VaccinesDiphtheriaHepatitis BHPVInfluenza VaccinesMalariaMeaslesMeningitis VaccinesMRSAMumpsNorovirusPertussis VaccinesPneumococcal DiseasePolioRotavirus VaccinesShinglesSmallpoxTBTetanusTyphoidYellow Fever Vaccine Anthrax Breast Cancer Chicken Pox Cholera Combination Vaccines Diphtheria Hepatitis B HPV Influenza Vaccines Malaria Measles Meningitis Vaccines MRSA Mumps Norovirus Pertussis Vaccines Pneumococcal Disease Polio Rotavirus Vaccines Shingles Smallpox TB Tetanus Typhoid Yellow Fever Vaccine Anthrax Breast Cancer Chicken Pox Cholera Combination Vaccines Diphtheria Hepatitis B HPV Influenza Vaccines Malaria Measles Meningitis Vaccines MRSA Mumps Norovirus Pertussis Vaccines Pneumococcal Disease Polio Rotavirus Vaccines Shingles Smallpox TB Tetanus Typhoid Yellow Fever Vaccine Vaccines and the Media WORLD NEWSAfricaAsiaAustralasiaEuropeNorth AmericaSouth America Africa Asia Australasia Europe North America South America Africa Asia Australasia Europe North America South America RESEARCHCancer ResearchCervarix VaccineGardasil/Silgard VaccineHuman Pap. ResearchImmunization PracticesNeurologyVaccine AdjuvantsVac. Ingredient ResearchVaccine InjuriesVaccine PreservativesVaccine Related ResearchVaccine Safety Cancer Research Cervarix Vaccine Gardasil/Silgard Vaccine Human Pap. Research Immunization Practices Neurology Vaccine Adjuvants Vac. Ingredient Research Vaccine Injuries Vaccine Preservatives Vaccine Related Research Vaccine Safety Cancer Research Cervarix Vaccine Gardasil/Silgard Vaccine Human Pap. Research Immunization Practices Neurology Vaccine Adjuvants Vac. Ingredient Research Vaccine Injuries Vaccine Preservatives Vaccine Related Research Vaccine Safety CITIZENS SPEAKCervical Cancer DebateHPV VaxAustralian ConcernsCanadian ConcernsIrish ConcernsSpain ConcernsUK ConcernsUnited States Concerns Cervical Cancer Debate HPV VaxAustralian ConcernsCanadian ConcernsIrish ConcernsSpain ConcernsUK ConcernsUnited States Concerns Australian Concerns Canadian Concerns Irish Concerns Spain Concerns UK Concerns United States Concerns Cervical Cancer Debate HPV VaxAustralian ConcernsCanadian ConcernsIrish ConcernsSpain ConcernsUK ConcernsUnited States Concerns Australian Concerns Canadian Concerns Irish Concerns Spain Concerns UK Concerns United States Concerns Australian Concerns Canadian Concerns Irish Concerns Spain Concerns UK Concerns United States Concerns **The Vaccines and Medications in Pregnancy Surveillance System (VAMPSS)** June 18, 2011ByJonathanLeave a Comment American Academy of Asthma, Allergy & Immunology A Collaboration Among: American Academy of Asthma, Allergy & Immunology (AAAAI) Organization of Teratology Information Specialists (OTIS) Slone Epidemiology Center at Boston University (SEC) What is VAMPSS? The Vaccines and Medications in Pregnancy Surveillance System (VAMPSS) is a new nationwide post-marketing surveillance system established to comprehensively monitor […] Filed Under:Reproductive System,Vaccine Adverse Events,Vaccine Marketing,Vaccine Politics/People,VAMPSSTagged With:drugs during pregnancy,immunizations,vaccinations,Vaccine Adverse Reactions,VAMPSS **Felicia from Maine** Creating an HPV Industry File a VAERS Report Gardasil and Unexplained Deaths HPV Industry Timeline HPV Mechanisms of Action in Women HPV Vaccine Fact Sheet Petition: Rescind HPV Vaccine Approval Presentation to the FDA Supreme Court Arguments **HPV Vaccine VAERS Reports** Access expanded report here. Your email: **HPV vaccine – Aluminum Toxin and Silica Antidote. Grace Filby** Copyright © 2025 SaneVax, Inc. · Site byTheWebElves.coma div. ofKalaRhythms.org·Log in"}