{"id": 1461, "name": "Hillsboro Times-Gazette", "domain": "timesgazette.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.timesgazette.com/2025/06/08/head-first-to-akron-2025-mustangs-make-history-with-schools-first-baseball-final-four-2/", "title": "Head First To Akron 2025 Mustangs Make History With Schools First Baseball Final Four 2", "content": "E-EditionLogoutSign InSubscribeMyAccountNewsletter SignupManage PreferencesLink My Account NewsLatest NewsSubmit News TipSpecial SectionsArchives Latest News Submit News Tip Special Sections Archives Latest News Submit News Tip Special Sections Archives SportsLatest SportsSubmit ScoresSubmit Sports News Latest Sports Submit Scores Submit Sports News Latest Sports Submit Scores Submit Sports News Obituaries OpinionLatest OpinionLetter To The Editor Latest Opinion Letter To The Editor Latest Opinion Letter To The Editor Life & CultureCommunity NewsLocal EntertainmentLocal FeaturesSpecial SectionsSubmit AnniversarySubmit BirthSubmit BirthdaySubmit EngagementSubmit WeddingCalendarBusinesses Community NewsLocal Entertainment Local Entertainment Local Features Special Sections Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding Calendar Businesses Community NewsLocal Entertainment Local Entertainment Local Entertainment Local Features Special Sections Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding Calendar Businesses ClassifiedsJob Match OhioOhio Public Notices Job Match Ohio Ohio Public Notices Job Match Ohio Ohio Public Notices Connect With UsAbout UsAdvertiseContact UsTimes Gazette on FacebookTimes Gazette on TwitterReader ServicesPrivacy Policy About Us Advertise Contact Us Times Gazette on Facebook Times Gazette on Twitter Reader Services Privacy Policy About Us Advertise Contact Us Times Gazette on Facebook Times Gazette on Twitter Reader Services Privacy Policy E-EditionLogoutSign InSubscribeMyAccountNewsletter SignupManage PreferencesLink My Account NewsLatest NewsSubmit News TipSpecial SectionsArchives Latest News Submit News Tip Special Sections Archives Latest News Submit News Tip Special Sections Archives SportsLatest SportsSubmit ScoresSubmit Sports News Latest Sports Submit Scores Submit Sports News Latest Sports Submit Scores Submit Sports News Obituaries OpinionLatest OpinionLetter To The Editor Latest Opinion Letter To The Editor Latest Opinion Letter To The Editor Life & CultureCommunity NewsLocal EntertainmentLocal FeaturesSpecial SectionsSubmit AnniversarySubmit BirthSubmit BirthdaySubmit EngagementSubmit WeddingCalendarBusinesses Community NewsLocal Entertainment Local Entertainment Local Features Special Sections Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding Calendar Businesses Community NewsLocal Entertainment Local Entertainment Local Entertainment Local Features Special Sections Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding Calendar Businesses ClassifiedsClassified AdsJob Match OhioOhio Public Notices Classified Ads Job Match Ohio Ohio Public Notices Classified Ads Job Match Ohio Ohio Public Notices Connect With UsAbout UsAdvertiseContact UsTimes Gazette on FacebookTimes Gazette on TwitterReader ServicesPrivacy Policy About Us Advertise Contact Us Times Gazette on Facebook Times Gazette on Twitter Reader Services Privacy Policy About Us Advertise Contact Us Times Gazette on Facebook Times Gazette on Twitter Reader Services Privacy Policy Sports **Head first to Akron: 2025 Mustangs make history with school’s first baseball Final Four** The Lynchburg-Clay Mustangs baseball team is shown. Jessica Faust Photo The 2025 season has truly been an all-around effort for the Lynchburg-Clay Mustangs. The Mustangs (23-3 on the year) will face St. Paris Graham 7 p.m. Friday in a Division V semifinal game at Canal Park in Akron in the 97th annual OHSAA baseball state tournament. The Division V state championship baseball game will be 4 p.m. Saturday at Canal Park. “It’s great to know no other Lynchburg team has made it as far as we did,” said senior Cole Wells. “It’s really cool to put our name in the history books and have a banner in the gym.” Lynchurg-Clay defeated St. Clairsville 5-4 in 9 innings in the Region 19 championship game Thursday at Marietta College. Elam Faust slid head first into home plate with the winning run on a Braedon West sacrifice fly. Graham defeated Ironton 5-1 in the Region 20 title game at Mason High School. The Falcons have six straight tournament wins, pitching their way to a 23-10 season record. Graham has allowed eight runs in the six post-season contests. Even though pitching likely gets the headlines — the Mustangs did hurl eight consecutive shutouts during the season — Lynchurg-Clay has been solid all season in each phase of the game — hitting, pitching, fielding. “It’s a testament to how hard these kids work,” coach James Flowers said. The offense is hitting at a .381 clip with Cole Wells leading the way at .578. He has 5 home runs and 35 runs batted in this season and earned athlete of the year honors in the Southern Hills Athletic Conference. The team stole 121 bases this season, in large part due to a .532 on-base percentage. On defense, after committing 111 errors combined in the last two seasons, the Mustangs erred on just 21 balls this season and had a .961 fielding percentage. The pitching staff rode the arms primarily of Wells, Braedon West and Christian Flowers. “It’s starting with these nine seniors and these three starting pitchers who mainly carried most of the work all year,” the LCHS coach said. “They’ve been in these situations before. They always want the baseball. They don’t care what the moment is, what’s on the line. All three of them, at any point, will say ‘I want the baseball. I’ve got this’.” Wells went 8-0 with a 0.29 earned run average. He had four shutouts and struck out 94 in 48.2 innings. West was 5-1 with a 1.71 ERA and 60 strikeouts in 45 innings. Flowers was 6-1 with a 1.63 ERA and fanned 40 in 30 innings pitched. In all, the team pitched 147 innings with 222 strikeouts. The 11 shutouts were a considerable improvement over three shutouts in the previous three seasons. Lynchburg-Clay has been building toward a season for the ages the previous three seasons. Seven of the nine seniors on the current roster were on the varsity team as freshmen in 2022. They went 12-9 that first year, 9-13 as sophomores and 15-9 last season as juniors. The Mustangs lost the 2024 season opener to Portsmouth 9-7 then lost to Portsmouth again in the district championship game 6-5. “When we lost to them in the district championship game last year, it wasn’t very fun,” said Christian Flowers, senior and son of the head coach. “I’ve played baseball my whole life and I knew it would work out to get our revenge against them and we got to play them in the same game as they beat us last year, the exact same field. I knew that we would win.” And the Mustangs did win, 3-2, to advance to the regional tournament which was further than any LCHS baseball team had been. They defeated Valley 4-3 in the regional semis and then St. Clairsville 5-4 in the title game. This is the first-ever trip to the OHSAA Final Four for the Mustangs while the Falcons, out of the Central Buckeye Conference, won state baseball championships in 1973 and 1930. Like the Mustangs, the Falcons are loaded with seniors, 10 of them in fact. The Falcons have a .299 batting average, up from .283 during the season. They have 37 errors and a .945 fielding percentage, according to MaxPreps. But in the post-season, Graham has seemingly pitched better. It’s only shutout came in a 7-0 win over Miami Valley Christian Academy in the regional semis. The Falcons have won 10 of their last 12 games overall. Adam Levy, the top hitter on the team at .421, has been the pitching standout of late, picking up the win over Ironton in the regional championship game. **Featured Local Savings** **Are the Cincinnati Reds back?** **Mustangs reminiesce on Terry’s Pizza following passing** **Hillsboro softball finishes as Division IV State Runner-Up**"}