{"id": 1488, "name": "Johnstown Tribune-Democrat", "domain": "tribdem.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.tribdem.com/site/johnstown-magazine-locator.html", "title": "Johnstown Magazine Locator.html", "content": "Facebook YouTube Email Local News Business Editorials In The Spotlight Politics State Local Sports College Sports AAABA Tomahawks Comics Puzzles Games Photos Videos Podcasts All Contests Simply the Best Bark Madness Subscribe to Johnstown Magazine About Johnstown Magazine Newsstand Locations Best of Johnstown Shutterbugs Birth Announcements Celebrations Events Calendar Burger Week Morley's Run Johnstown Bridal Showcase Restaurant Week Active Aging Expo Jobs Homes Autos Classified Yellow Place an Ad Purchase Photos Submit a Letter to the Editor Submit a News Tip Place an Obituary Join Our Team Start a Subscription Manage My Subscription E-Paper Email Newsletters App Downloads Buy Books and CD's Heroes Were Made Golf Pass Newspaper Ads Buy Photos Weekly Ads Buy Local Search Search Search Contact UsPurchase PhotosSubmit a Letter to the EditorSubmit a News TipPlace an Obituary Purchase Photos Submit a Letter to the Editor Submit a News Tip Place an Obituary Purchase Photos Submit a Letter to the Editor Submit a News Tip Place an Obituary SUBSCRIBEStart a SubscriptionManage My SubscriptionE-PaperApp DownloadsNewsletter Start a Subscription Manage My Subscription E-Paper App Downloads Newsletter Start a Subscription Manage My Subscription E-Paper App Downloads Newsletter Login About UsContact UsAdvertise with UsE-editionTribune-Democrat EventsJohnstown Bridal ShowcaseJohnstown Women's ShowcaseActive Aging ExpoIce Fest About Us Contact Us Advertise with Us E-edition Tribune-Democrat EventsJohnstown Bridal ShowcaseJohnstown Women's ShowcaseActive Aging ExpoIce Fest Johnstown Bridal Showcase Johnstown Women's Showcase Active Aging Expo Ice Fest About Us Contact Us Advertise with Us E-edition Tribune-Democrat EventsJohnstown Bridal ShowcaseJohnstown Women's ShowcaseActive Aging ExpoIce Fest Johnstown Bridal Showcase Johnstown Women's Showcase Active Aging Expo Ice Fest Johnstown Bridal Showcase Johnstown Women's Showcase Active Aging Expo Ice Fest E-Paper Local EventsSee All EventsAdd Your Event See All Events Add Your Event See All Events Add Your Event Celebrations Obituaries Public Notices 81°Johnstown, PA(15901)TodayPartly cloudy skies. Low 63F. Winds WSW at 5 to 10 mph..TonightPartly cloudy skies. Low 63F. Winds WSW at 5 to 10 mph.Updated: June 11, 2025 @ 6:17 pmFull Forecast Johnstown, PA(15901)TodayPartly cloudy skies. Low 63F. Winds WSW at 5 to 10 mph..TonightPartly cloudy skies. Low 63F. Winds WSW at 5 to 10 mph.Updated: June 11, 2025 @ 6:17 pm Partly cloudy skies. Low 63F. Winds WSW at 5 to 10 mph.. Partly cloudy skies. Low 63F. Winds WSW at 5 to 10 mph. Updated: June 11, 2025 @ 6:17 pm Full Forecast Johnstown, PA(15901)TodayPartly cloudy skies. Low 63F. Winds WSW at 5 to 10 mph..TonightPartly cloudy skies. Low 63F. Winds WSW at 5 to 10 mph.Updated: June 11, 2025 @ 6:17 pm Partly cloudy skies. Low 63F. Winds WSW at 5 to 10 mph.. Partly cloudy skies. Low 63F. Winds WSW at 5 to 10 mph. Updated: June 11, 2025 @ 6:17 pm Partly cloudy skies. Low 63F. Winds WSW at 5 to 10 mph.. Partly cloudy skies. Low 63F. Winds WSW at 5 to 10 mph. Updated: June 11, 2025 @ 6:17 pm Full Forecast E-Paper Newsletter Facebook Instagram **Brian Wilson, Beach Boys visionary leader and s…** **Cambria Heights' Lantzy playmakers are prominen…** **U.S. prepares to order departure of all nonesse…** **At least 49 people have died in flooding in Sou…** **Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82** **Johnstown Magazine Sales Locations** Pick up a copy ofJohnstown Magazinethroughout the region. Stores that carry Johnstown Magazine (Sorted by city) STORE ADDRESS PHONE CISCATO'S MARKET 800 RAILROAD ST.JOHNSTOWN, PA. 15901 814-535-8326 EMS SUBS 345 MAIN ST.JOHNSTOWN, PA. 15901 814-535-5919 IDEAL MARKET #764 339 WALNUT ST.JOHNSTOWN, PA. 15901 814-539-4680 DOLLAR GENERAL 641 MAIN ST.JOHNSTOWN, PA. 15901 814-619-3735 JOHNSTOWN FLOOD MUSEUM 304 WASHINGTON ST.JOHNSTOWN, PA. 15901 814-539-1889 FLOOD CITY CAFE 137 CLINTON ST.JOHNSTOWN, PA. 15901 814-254-4005 CLASSIC ELEMENTS 345 MAIN ST.JOHNSTOWN, PA. 15901 814-254-7702 SCOOFIE'S STOP & SHOP 1257 FRANKSTOWN RD.JOHNSTOWN, PA. 15902 814-539-6027 DOLLAR GENERAL 21 BRIDGE ST.JOHNSTOWN, PA. 15902 814-419-6275 C GILL'S SHOES 1513 SCALP AVE.JOHNSTOWN, PA. 15904 814-269-4059 DOLLAR GENERAL 850 SCALP AVE.JOHNSTOWN, PA. 15904 814-619-4760 DOLLAR GENERAL 1513 SCALP AVE.JOHNSTOWN, PA. 15904 814-419-6428 BOSCOV'S 570 GALLERIA DR.JOHNSTOWN , PA. 15904 814-266-4300 STEMS CLOVERLEAF 130 BELMONT ST.JOHNSTOWN, PA. 15904 814-266-8000 IDEAL MARKET #710 2449 BEDFORD ST. JOHNSTOWN, PA. 15904 814-269-3459 EMS SUBS 1111 SCALP AVE.JOHNSTOWN, PA. 15904 814-269-3493 GIANT EAGLE #0661 1451 SCALP AVE.JOHNSTOWN, PA. 15904 814-266-7940 MARKET BASKET 1407 DWIGHT DR.JOHNSTOWN, PA. 15904 814-266-5311 CLARK'S CORNER STORE 1003 MENOHER BLVD.JOHNSTOWN, PA. 15905 814-255-5735 DOLLAR GENERAL 151 SOUTHMONT BLVD.JOHNSTOWN, PA. 15905 814-619-3436 DOLLAR GENERAL 1708 LYTER DR.JOHNSTOWN, PA. 15905 814-619-0781 WESTMONT DRUG 1741 GOUCHER ST.JOHNSTOWN, PA. 15905 814-255-4101 EMS SUBS 612 GOUCHER ST.JOHNSTOWN, PA. 15905 814-255-6421 DOLLAR GENERAL 300 GOUCHER ST.JOHNSTOWN, PA. 15905 814-419-6084 GIANT EAGLE #0046 344 GOUCHER ST.JOHNSTOWN, PA. 15905 814-288-6918 BI-LO 8TH WARD 81 OSBORNE ST. JOHNSTOWN, PA. 15905 814-535-7704 MARTELLA'S PHARMACY 1079 FRANKLIN ST. JOHNSTOWN, PA. 15905 814-535-1833 DOLLAR GENERAL 340 SHERIDAN ST.JOHNSTOWN, PA. 15906 814-419-6280 GIANT EAGLE #0610 1233 BROAD ST.JOHNSTOWN, PA. 15906 814-535-4496 HERITAGE DISCOVERY CENTER BROAD ST.JOHNSTOWN, PA. 15906 814- 539-1889 MERCIK'S IDEAL 2690 WILLIAM PENN AVE.JOHNSTOWN, PA. 15909 814-322-1369 MARTELLA'S PHARMACY 1932 WILLIAM PENN AVE.JOHNSTOWN, PA. 15909 814-322-1011 DOLLAR GENERAL 1940 WILLIAM PENN AVE.JOHNSTOWN, PA. 15909 814-419-6410 SHOP N' SAVE 1213 2ND ST. CRESSON,PA 16630 814-886-7221 DOLLAR GENERAL 174 1ST ST.CONEMAUGH, PA. 15909 814-533-5920 FOREST HILLS PHARMACY 552 LOCUST ST.SAINT MICHAEL, PA. 15951 814-495-9437 DOLLAR GENERAL 540 LOCUST ST.SIDMAN, PA. 15955 814-533-5800 BI-LO WINDBER 1514 JEFFERSON AVE.WINDBER, PA. 15963 814-467-6624 DOLLAR GENERAL 1500 SOMERSET AVE.WINDBER, PA. 15963 814-419-0579 MARTELLA'S PHARMACY 901 GRAHAM AVE.WINDBER, PA. 15963 814-467-9700 LEONE'S MARKET 1914 GRAHAM AVE.WINDBER, PA. 15963 814-467-4059 **Trending Recipes** Johnstown Magazine is a positive and forward-thinking monthly publication for the people of our region. **Most Popular** Articles Images Videos Commented HUMAN TRAFFICKING | 'That was normal behavior': Victim recalls being trafficked, then the aftermath of abuse New Starbucks location being planned in Somerset area, but timing uncertain Police: Johnstown man arrested after allegedly firing gun from car Father-son combinations create family ties on Ken Lantzy Classic's South roster Greater Johnstown approves administrator's retirement, teacher hires Pitt-Johnstown earns national recognitions Sheetz racial discrimination case on the chopping block as Trump rewrites civil rights 5 area baseball players picked for inaugural all-star game FEDERAL FALLOUT | 'Going to have a huge impact': Behavioral health professionals sound alarm on potential funding cuts 'Show them the designs': Plans for downtown Johnstown's Central Park shared with public at informational session Sorry, there are no recent results for popular commented articles. **Online Poll** **Obituaries** More Obituaries Sign up now to get our FREE breaking news coverage delivered right to your inbox. First Amendment:Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances. About Us Contact Us Advertise with Us Personnel Employment Opportunities Subscriber Services Submission Forms Cookie Preferences Home Local News Comics Puzzles Sports Community Local Columnists Obituaries Photos Video Gallery Weather Homes Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}