{"id": 1412, "name": "The Narwhal", "domain": "thenarwhal.ca", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://thenarwhal.ca/newsletter-manitoba-wildfires-misinformation/", "title": "Newsletter Manitoba Wildfires Misinformation", "content": "**Explore** News In-Depth Explainers Investigations On the ground Photo Essays Opinion Analysis The Moose Profiles Newsletter Inside The Narwhal **Trending Topics** Arctic Canada-U.S. Relations Carbon Tax Climate Change Coal Corporate Influence Democracy Forestry Fracking Great Lakes Indigenous Protected Areas Indigenous Rights LNG Mining Offshore Drilling Oilsands Renewable Energy Site C Dam Solutions Water Wildfires Wildlife **Fighting flames, sparking compassion** The thing is, wildfires are not simply natural disasters. People interact with fire in complicated ways, and building a better relationship between the two means taking both fire behaviour and human behaviour into account.Sometimes that means getting out ahead of wildfire misinformation, which can have deadly consequences in emergencies. This week, video producer Manuel Baechlin and Prairies reporter Drew Anderson collaborated to publish a short videoon our YouTubeandTikTok channelsto help separate fiction from fact. (Yes, a lot of wildfires are sparked by humans; no, that usually doesn’t mean arson. And yes, aggressively suppressing fires to protect logging industry interests contributes to the problem.)I hope you’ll keep thelink to the videohandy for the next time you spot a piece of wildfire misinformation that threatens to spread!And if you do take on the fight against false narratives, you won’t be alone. Last week, Matt reported onnew efforts by the BC Wildfire Serviceto engage with misinformation on social media, leading with kindness, compassion and, of course, facts.Learning how to live with fire, and even sometimes embrace it, is complicated — but possible. We can do it if we work together. The Narwhal will be keeping a close watch on wildfires across the country through the summer and beyond.Bookmark this pageto check out our latest coverage.Take care and spark compassion,Jacqueline RonsonAssistant editor **Got bill questions?** “Canadian politicians are in a schoolyard-style bragging competition about shortening approval times.” That’s how Ontario bureau chief Elaine Anselmi summed up the political moment, as Ontario and B.C. both make moves to fast-track major projects, and Prime Minister Mark Carney promises national legislation to the same end.In B.C.,Bill 15 was just passed, and Ontario ismoving forward on Bill 5. Both are hugely significant bills that give the provincial governments new and expanded powers to speed up industry, and both have been dogged by criticism and concern over how they could impact ecosystems, endangered species and Indigenous Rights.We’ve heard from many of our readers wondering about these bills — and the broader national picture — and we want to help you find answers.Got questions?Send them to us,and we’ll do our best to answer them in our upcoming coverage! **This week in The Narwhal** **See similar stories** **Alberta moves to weaken its carbon price amidst talk of national ‘grand bargain’** **Alberta moves to weaken its carbon price amidst talk of national ‘grand bargain’** Since the election of Prime Minister Mark Carney in April, Alberta and the federal government have been talking about a “grand bargain” to balance rapid... **Recent Posts** **From $2,600 to $775: how social housing is changing lives — and fighting climate change** **From $2,600 to $775: how social housing is changing lives — and fighting climate change** Can new homes be energy efficient, low emission, climate resilient and affordable? B.C. non-profits show... **‘Horrific impacts’: as B.C. prepares to fast-track projects, a mining watchdog warns past mistakes could be repeated** **‘Horrific impacts’: as B.C. prepares to fast-track projects, a mining watchdog warns past mistakes could be repeated** Mining regulations and environmental assessments were developed to protect the environment and public health and... **Ontario has ablack bearpeople problem** **Ontario has ablack bearpeople problem** Climate change and urban sprawl are blurring the lines between bear country and our front... SUBSCRIBEPeople always tell us they love our newsletter. Find out yourself with a weekly dose of our ad‑free, independent journalismGet The Narwhal in your inbox!SUBSCRIBEPeople always tell us they love our newsletter. Find out yourself with a weekly dose of our ad‑free, independent journalismGet The Narwhal in your inbox! **About Us** About us Our team Write for us Our ethics Ways to give Member FAQ **Get in Touch** Contact us Send a story tip Republish our stories **Support Independent Journalism** The Narwhal is ad-free, non-profit and supported by readers like you."}