{"id": 2229, "name": "The Beaverton", "domain": "thebeaverton.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://thebeaverton.com/2024/11/editorial-why-my-cheque-giveaway-is-great-whereas-doug-fords-cheque-giveaway-is-desperate-and-terrible-by-justin-trudeau/", "title": "Editorial Why My Cheque Giveaway Is Great Whereas Doug Fords Cheque Giveaway Is Desperate And Terrible By Justin Trudeau", "content": "NationalNationalLocalTorontoMontrealVancouverNorthCampusUniversity ReviewsCanada Votes 2015 National Local Toronto Montreal Vancouver North Campus University Reviews Canada Votes 2015 National Local Toronto Montreal Vancouver North Campus University Reviews Canada Votes 2015 WorldWorldU.S.Historical Archives World U.S. Historical Archives World U.S. Historical Archives SportsSports Sports Sports BusinessBusiness Business Business CultureCultureLifestyleHealthOpinionParentingStatsClassifieds Culture Lifestyle Health Opinion Parenting Stats Classifieds Culture Lifestyle Health Opinion Parenting Stats Classifieds BeavFeedBeavfeedChoice Your Own AdventureQuizSlideshowGuide To/How To Beavfeed Choice Your Own Adventure Quiz Slideshow Guide To/How To Beavfeed Choice Your Own Adventure Quiz Slideshow Guide To/How To Merch Support The Book Workshops NationalNationalLocalTorontoMontrealVancouverNorthCampusUniversity ReviewsCanada Votes 2015Carney limits G7 guests to one assassination eachPremiers united in belief that the best way to stand up to Trump is doing what they’ve always wanted to do anywaysCanada Post counters union negotiations, asking workers to split the bill on billion dollar deficitPierre Poilievre attends Speech From The Throne with face pressed against Senate windowFamily of 5 enjoys 24 hour window where nobody sickCTV announces 24 nanosecond news cycleLocal woman waiting to return her missed calls until she’s on crowded busForest Hill by-election to show Canada what people without problems think“Why is Toronto traffic so terrible?” wonders man in carLatest Drake track features his Mom asking Kendrick to stop bullying her sonReport: Juan Soto in talks with Ohtani about best way to get Canadians’ hopes up before crushing their dreamsToronto commuter unable to tell if Taylor Swift gridlock has startedJust for Laughs Festival files for bankruptcy protection just before jumping out of box wearing gorilla maskMontreal rioters concerned COVID rules are destroying small businesses before they can destroy small businessesToppling of statue causes temporal rift as John A. MacDonald erased from historyMontreal halts road construction until everyone can enjoy it againRick Tocchet announced as NDP party leaderReport: Killer Whales actively preparing to bring down a planeVancouver considers buying a second snowplowVancouver actor moves to L.A. to improve odds of getting cast in shows that shoot in VancouverTied Yukon election to be decided by traditional chainsaw throwYukon exposed to 2 cases of assholesYukon refuses to change clocks back in smug defiance of the will of DemeterRest of Canada happy to exchange NWT election results for federal oneYork Professor asks for a note from a dictator before agreeing to defer student’s examQueen’s students argue their campus outbreak will be way better than Western’sGaming the system: Recent 92-year-old university grad gets to die before she pays off her debtWestern University invites David Wooderson from “Dazed and Confused” to speak at convocationWestern University mandate 3 vaccine shots, 15 Jaegermeister shotsAcadia University: The Beaverton University ReviewsDalhousie University: The Beaverton University ReviewsOCAD University: University Reviews 2014NDP claim Liberals stole their idea to form majority governmentSun newspapers still reporting Harper majority90-year-old who has never voted proudly casts first ballot for Social Credit partyConservatives unveil last minute attack ad accusing Justin of supporting Kansas City National Local Toronto Montreal Vancouver North Campus University Reviews Canada Votes 2015 National Local Toronto Montreal Vancouver North Campus University Reviews Canada Votes 2015 WorldWorldU.S.Historical ArchivesMinister of International Trade says Canada should apply for EU membership: “Canada is only 19km from France.”Canada seeks new country to rip off every part of our culture fromOvechkin dedicates his record-breaking goal to the brave men and women bombing Ukrainian hospitalsWith Trump back in office, Greeks celebrate no longer being civilization that has fallen the furthestTrump reminds Americans he only promised not to start foreign warsTrump, Musk publicly feud over whose father loved them lessTrump says Canada would pay $61B for Golden Dome, or 50% off just to bribe him directlyUS campaign entices Canada tourists: “Come visit America and also maybe El Salvador!”Living History: Grandma exchanged letters with John Diefenbaker where he talks about his “Dief Beef”Toppling of statue causes temporal rift as John A. MacDonald erased from historyVillage virgin sick of donating blood to every ritual sacrificeJuly 24th, 1967: French President De Gaulle calls for Quebec to surrender, await for international help for liberation World U.S. Historical Archives World U.S. Historical Archives SportsSportsFederal government opens distress hotline for Canadians forced to cheer for OilersInventive refs develop new way to help Panthers win beyond the favourable whistleHockey players shake hands, say there are no hard feelings about the permanent brain damageConvoluted new UEFA Champions League structure forces PSG to play themselves in the final Sports Sports BusinessBusinessResearchers warn Tim Horton’s in-app NHL Hockey Challenge is a gateway to drinking their coffeeRogers celebrates 20 years of higher than expected call volumesREPORT: Meeting you didn’t pay attention in could’ve been an email you didn’t readFord insists dubious Therme Spa project met all the necessary bribes Business Business CultureCultureLifestyleHealthOpinionParentingStatsClassifieds“At least Mel Gibson is still a good guy,” states man with the memory of a grapeSnow White dethroned at box office by dimly lit video of man ranking Skittles flavoursCast of “Come From Away” pitch new ending where the Americans get beat upDisappointed fans slam White Lotus finale for never revealing whether rich people have problems tooTampax encourages women to channel their rage into bigger, better periodsConscientious driver slows to 30 km/h in school zone while hitting children with carReport: Exhausting, unfulfilling suburban life you hate is university student’s unattainable dreamMystical ayahuasca experience concludes with survey for chance to win $25 Amazon gift cardAds playing on gas pumps now leading cause of hearing lossDanielle Smith demands referendum to separate measles from Albertans“Is it possible you’re just pregnant?” asks doctor staring at woman’s fractured tibiaAlberta proves private healthcare is more efficient at generating scandalsOp-Ed : “Say what you will about us, at least we never blew a 27-point lead,” by Auston MatthewsThe Beaverton demands same debate invitation as The Rebel, even though we’re not as big a jokeEditorial: Trump underestimates how proud, united and, most importantly, petty Canadians areOp-Ed: The “Wicked” movie shows us what audiences really want — more films about green peopleMan who wants kids unaware he will be expected to parent themPhysicists launch study of temporal paradox allowing people younger than you to have kids alreadyChild abuse? This baby is wearing jeansToddler guzzling bathwater like Nero at Bacchanal in waning days of Roman Empire93% of Canadians will never pay off their blood debts86% of August e-mail traffic just duelling Out-Of-Office messages2014 Canadian Federal Budget PreviewMost frequent lies found on online dating profilesMissed Connections: You were the public urinator on Main and 5thLOTS OF JARS FULL OF APRICOT PITS.ESSAY WRITERS NEEDED ASAP. BIG MONEY $$$$$.UNIVERSITY student seeking mannequin to come alive and be my girlfriend. Culture Lifestyle Health Opinion Parenting Stats Classifieds Culture Lifestyle Health Opinion Parenting Stats Classifieds BeavFeedBeavfeedChoice Your Own AdventureQuizSlideshowGuide To/How ToMeet the Canadians who support U.S. annexation: this 42 year old accountant sucks shitCanadians who support the U.S. annexing us explain whyMost popular Thanksgiving Sides in every ProvinceCBC execs explain why they deserve their bonusesYou’re Jason Kenney. Can you find an excuse to get out of going to Calgary Pride?You just lit off a bunch of fireworks before realizing you were in the Art Gallery of Ontario. Can you save the priceless pieces of art?You magically turned into a bug! Can you live a happy and fulfilling life?You have a chance to punch a Nazi. Do you take it?Quiz: Should you watch Barbie, Oppenheimer or 2008 Canadian WWI drama PasschendaeleQuiz: Who should you vote for in Toronto’s Mayoral RaceQuiz: Who should you vote for in the Alberta Provincial ElectionQUIZ: Is it a pyramid scheme or just a regular cult?Canadians who support the U.S. annexing us explain whyFree speech champions explain why it’s OK that people are being cancelled for criticizing IsraelConservatives explain why Pierre Poilievre attacking ‘globalist elites’ isn’t antisemiticLiberals explain why they can’t do anything about the housing crisisHow To Go Vegan…Next WeekGuide To: EdmontonGuide To: St.John’sHow To Lose Weight Beavfeed Choice Your Own Adventure Quiz Slideshow Guide To/How To Beavfeed Choice Your Own Adventure Quiz Slideshow Guide To/How To Merch Support The Book Workshops **EDITORIAL: Why my cheque giveaway is great whereas Doug Ford’s cheque giveaway is desperate and terrible – by Justin Trudeau** Hello. It’s me,Canada’s most popular Prime Minister,Justin Trudeau. Here to tell you all the goodnews– that I feel your pain. I don’t mean feel your pain in a literal sense. I’m still the son of a Canadian political dynasty and just flew first class halfway across the globe to a G20 summit in Rio de Janeiro. It was awesome. But someone told me that all of you can’t afford to buy groceries, and I don’t think that’s a good thing. That is why I’m going to be personally mailing (almost) every Canadian a $250cheque, in a way that is completely different and superior to the recent desperation cheques announced byOntarioPremierDoug Ford. We all know that times are tough. For some, that might mean an inability to keep up with rising housing costs – or so I’m told, because I haven’t really paid for my own housing since at least 2008. It’s hard to remember. For others, tough times might mean not being able to find employment (again, never actually had to worry about unemployment, so I understand that one in a purely academic sense). Still, the toughest time of all that some Canadians are currently facing is a loomingelectionwhere polling numbers aren’t so good and you need to quickly enact a kneejerk financial giveaway to get voters back on your side. I am confident that this is a relatable quandary that many of you reading this are also currently facing. Clearly, there is a right way to hastily send out one-time rebate cheques to potential voters in lieu of a spring election, and a wrong way. With my cheques, aka “the right way”, recipients will receive $250 dollars, whereas with Doug Ford’s cheques (“the wrong way”, btw) people will only get $200 dollars. That is not only less money, but $50 DOLLARS LESS, which I am qualified to explain as a former publicschoolteacher. Point, me. The next way that my cheques are completely different is that I will only be sending them to people who earned under $150,000, whereas Doug Ford’s cheques will go to unpopular jerks who earned more money than that, like myself. Do you want some trust fund wiener like me getting the same amount of money in the mail that you do, even though I’m just going to laugh at the pitifully small amount and then toss the cheque as a chew toy for my purebred Portuguese water dog? My extensive internal polling shows that you definitely DON’T want that. Finally, the key difference between my awesome cheques and Doug Ford’s sucky cheques are that the $250 Federal cheques are being given away by me, JustinTrudeau. Whose face would you rather see smiling up at you from the front of a government cheque (note: We’re putting our faces on these, right?) Me, Canada’s raven-locked newly-single smiling heartthrob who’s still got it after only 9 flawless years in office? Or Doug, who looks like if they shaved down Donkey Kong and stuffed him into an off-the-rack Tip Top Tailors suit? I’d say the choice is obvious, as would all of my aides, who have been instructed to say that as well. Now sure, some naysayers might claim there’s no difference at all between the Federal and Ontario cheques: that both are cynical attempts to buy cheap votes leading up to an election being presented by scandal-ridden sons of privilege who’ve clung to power long past their best-before date. To those people saying nay, I would counter: do you know who my father is? In closing, please enjoy the $250 that I am mailing to you, and use it to buy candy or lottery tickets or whatever it is that people purchase down in your income bracket. Now if you’ll excuse me, I’m late for my box seats at the Eras Tour with Doug Ford. Subscribe to Our Newsletter Trump, Musk publicly feud over whose father loved them less Carney limits G7 guests to one assassination each Carney fights off harsh U.S. authoritarianism with slightly gentler Canadian authoritarianism Carney invites Mohammed bin Salman to G7, warns Air Canada will make him check bone saw \"Local Man Wears Funny T-Shirt\" T-Shirt \"Local Man Wears Funny T-Shirt\" T-Shirt \"This Is My Winter Coat\" Hoodie \"This Is My Winter Coat\" Hoodie \"I Thought The Beaverton Was Satire\" T-Shirt \"I Thought The Beaverton Was Satire\" T-Shirt \"House Hippo Dad\" T-Shirt \"House Hippo Dad\" T-Shirt \"North America's Trusted Source of News\" Contest Disclaimer Website Terms and Conditions Cookies Policy Privacy Policy About the Show Masthead Content Submission Guidelines"}