{"id": 386, "name": "Econofact", "domain": "econofact.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://econofact.org/factbrief/fact-check-have-inflation-adjusted-wages-increased-in-the-past-decades", "title": "Fact Check Have Inflation Adjusted Wages Increased In The Past Decades", "content": "The Econofact Network EF for Educators In the News About Support Us Facebook X / Twitter Bluesky Instagram LinkedIn Immigration Trade Debt and Deficits Housing climate change EF Explains Econofact Chats Factbrief Immigration Trade Debt and Deficits Housing climate change EF Explains Econofact Chats Factbrief The Econofact Network EF for Educators In the News About Support Us Facebook X / Twitter Bluesky Instagram LinkedIn **Fact Check: Have inflation-adjusted wages increased in the past decades?** **Yes** Real median wages, or the inflation-adjusted amount of money the middle earner makes, have risen in the U.S. since the 1980s. Real median weekly wages were 19% higher in Q1 2025 than in Q1 1985, according to the Bureau of Labor Statistics. A similar pattern can be seen across other measures of earnings: real median household income rose from $58,930 in 1984 (in 2023 inflation-adjusted dollars) to $80,610 in 2023, an increase of 37%. Both real median weekly wages and household income faced their greatest increases in the 2010s. The former peaked in Q2 2020 at $1,195 and the latter peaked in 2019 at $81,210. “Real” means the actual purchasing power of wages accounting for increases in the price of goods over time. “Median” is the middle value, meaning large income increases for top earners do not affect it. This fact brief is responsive to conversations such asthis one. **Sources:** Federal Reserve Bank of St. LouisEmployed full time: Median usual weekly real earnings: Wage and salary workers: 16 years and over Federal Reserve Bank of St. LouisReal Median Household Income in the United States Federal Reserve Bank of MinneapolisInflation Calculator Econofact is partnering withGigafact–an initiative focused on countering misinformation and spreading facts. View All Fact Briefs › Fact-based, unbiased memos and podcasts. Coverage of timely economic and social policy issues. Accessible analysis by leading economists. Fact Check: Are meat monopolies necessarily responsible for recent spikes in meat prices?byEconoFact **Fact Check: Are meat monopolies necessarily responsible for recent spikes in meat prices?** byEconoFact **Fact Check: Are meat monopolies necessarily responsible for recent spikes in meat prices?** byEconoFact Fact Check: Has Medicaid Expansion in states improved health outcomes?byKeshav Srikant **Fact Check: Has Medicaid Expansion in states improved health outcomes?** byKeshav Srikant **Fact Check: Has Medicaid Expansion in states improved health outcomes?** byKeshav Srikant Fact Check: Can governments make cash transfers to citizens without bank accounts?byEconoFact **Fact Check: Can governments make cash transfers to citizens without bank accounts?** byEconoFact **Fact Check: Can governments make cash transfers to citizens without bank accounts?** byEconoFact **U.S. Trade Policy: Going it Alone vs. Abiding by the World Trade Organization** **Understanding Trends in U.S. Labor Force Participation (VIDEO)** **SNAP: A Temporary, Fraud-Resistant, Family Friendly Policy** For questions, comments, submissions or media inquiries, please email EconoFact:contact@econofact.org Cancel your Premium Subscription REPRODUCING ECONOFACT CONTENT Fact-based, unbiased memos and podcasts. Coverage of timely economic and social policy issues. Accessible analysis by leading economists. Privacy Statement & Terms of Use"}