{"id": 1199, "name": "Roll Call", "domain": "rollcall.com", "bias": "center", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://rollcall.com/2025/06/09/we-dissent-nih-workers-protest-trump-policies-that-harm-the-health-of-americans/", "title": "We Dissent Nih Workers Protest Trump Policies That Harm The Health Of Americans", "content": "PoliticsCampaignsCongressWhite House Campaigns Congress White House Campaigns Congress White House PolicyDefenseEnergy/EnvironmentFintechHealth CareTechnologyTransportationAll Policy Defense Energy/Environment Fintech Health Care Technology Transportation All Policy Defense Energy/Environment Fintech Health Care Technology Transportation All Policy Heard on the Hill PodcastsCQ BudgetEqual TimeFintech BeatPolitical TheaterOversight CQ Budget Equal Time Fintech Beat Political Theater Oversight CQ Budget Equal Time Fintech Beat Political Theater Oversight Factba.seDonald TrumpDonald Trump TweetsWhite House CalendarWhite House ReleasesPress Seating ChartCorrespondents DinnerBlogJoe BidenKamala Harris Donald Trump Donald Trump Tweets White House Calendar White House Releases Press Seating Chart Correspondents Dinner Blog Joe Biden Kamala Harris Donald Trump Donald Trump Tweets White House Calendar White House Releases Press Seating Chart Correspondents Dinner Blog Joe Biden Kamala Harris Visuals MoreNewslettersCapitol InkRoll Call e-EditionOpinionEventsClassifieds Newsletters Capitol Ink Roll Call e-Edition Opinion Events Classifieds Newsletters Capitol Ink Roll Call e-Edition Opinion Events Classifieds PoliticsCampaignsCongressWhite House Campaigns Congress White House Campaigns Congress White House PolicyDefenseEnergy/EnvironmentFintechHealth CareTechnologyTransportationAll Policy Defense Energy/Environment Fintech Health Care Technology Transportation All Policy Defense Energy/Environment Fintech Health Care Technology Transportation All Policy Heard on the Hill PodcastsCQ BudgetEqual TimeFintech BeatPolitical TheaterOversight CQ Budget Equal Time Fintech Beat Political Theater Oversight CQ Budget Equal Time Fintech Beat Political Theater Oversight Factba.seDonald TrumpDonald Trump TweetsWhite House CalendarWhite House ReleasesPress Seating ChartCorrespondents DinnerBlogJoe BidenKamala Harris Donald Trump Donald Trump Tweets White House Calendar White House Releases Press Seating Chart Correspondents Dinner Blog Joe Biden Kamala Harris Donald Trump Donald Trump Tweets White House Calendar White House Releases Press Seating Chart Correspondents Dinner Blog Joe Biden Kamala Harris Visuals MoreNewslettersCapitol InkRoll Call e-EditionOpinionEventsClassifieds Newsletters Capitol Ink Roll Call e-Edition Opinion Events Classifieds Newsletters Capitol Ink Roll Call e-Edition Opinion Events Classifieds **‘We Dissent’: NIH Workers Protest Trump Policies That ‘Harm the Health of Americans’** **Staff argues cuts to NIH are causing ‘a dramatic reduction in life-saving research’** **** **** Facebook Twitter Email Reddit by Rachana Pradhan Hundreds of workers at the National Institutes of Health on Monday openly protested the Trump administration’s cuts to the agency and consequences for human lives, writing in a sharply worded letter that its actions are causing “a dramatic reduction in life-saving research.” In aJune 9 letterto NIH Director Jay Bhattacharya, NIH workers said they felt “compelled to speak up when our leadership prioritizes political momentum over human safety and faithful stewardship of public resources.” “For staff across the National Institutes of Health (NIH), we dissent to Administration policies that undermine the NIH mission, waste public resources, and harm the health of Americans and people across the globe,” they said. The letter is an extraordinary rebuke of the Trump administration’s actions against the NIH, which include: terminating hundreds of grantsfunding scientific and biomedical research; firing more than 1,000 employees this year; and moving to end billions in funds to partner institutions overseas, a move current and former NIH workers say will harm research on rare cancers and infectious diseases, as well as research that aims to minimize tobacco use and related chronic illnesses, among other areas. Some NIH workers signed their names publicly, openly daring to challenge a president who has sought to purge the government of employees he views as disloyal to him. Others signed anonymously. “It’s about the harm that these policies are having on research participants and American public health, and global public health,” said Jenna Norton, who works at the National Institute of Diabetes and Digestive and Kidney Diseases, one of NIH’s 27 institutes. “There are research participants who generously decide to donate their time and literal pieces of their body, with the understanding that that service is going to help advance research for diseases that they are living with and help the next person who comes along with that disease.” “These policies are preventing us from delivering on the promise we made to them and honoring the commitment that they made, and putting them at risk,” she said. The workers wrote that they hope Bhattacharya welcomes their criticisms given hisvows to prioritize “academic freedom”and to respect dissenting views as leader of the NIH, which is based in Bethesda, Maryland. Its authors called it the “Bethesda Declaration” — a play on the controversial “Great Barrington Declaration” that Bhattacharya co-authored during the covid-19 pandemic. Bhattacharya’s declaration advocated against lockdown measures and proposed that widespread immunity against covid could be achieved by allowing healthy people to get infected with the virus and instituting protective measures only for medically vulnerable people. It was criticized at the time by Francis Collins, then-director of the NIH, who called Bhattacharya and his co-authors “fringe epidemiologists,”according to emailsthe American Institute for Economic Research obtained through a Freedom of Information Act request. In their letter, NIH workers demanded that Bhattacharya restore grants that were “delayed or terminated for political reasons.” Those grants funded a range of projects, including those addressing Alzheimer’s disease, ways to boost vaccination rates, and efforts to combat health disparities or health misinformation. “Academic freedom should not be applied selectively based on political ideology. To achieve political aims, NIH has targeted multiple universities with indiscriminate grant terminations, payment freezes for ongoing research, and blanket holds on awards regardless of the quality, progress, or impact of the science,” the NIH workers wrote. The funding terminations, they said, “throw away years of hard work and millions of dollars,” “risk participant health,” and “damage hard-earned public trust, counter to your stated goal to improve trust in NIH.” In an emailed comment, Bhattacharya said, “The Bethesda Declaration has some fundamental misconceptions about the policy directions the NIH has taken in recent months, including the continuing support of the NIH for international collaboration. Nevertheless, respectful dissent in science is productive. We all want the NIH to succeed.” The NIH’s nearly $48 billion budget makes it the world’s largest public funder of scientific research. Its work has led to countless scientific discoveries that have helped improve health and save lives around the globe. But it hasn’t been without controversies, including instances ofresearch misconductandnot effectively monitoringgrant awards and the related research. Researchers and some states have sued NIH and HHS over the grant cuts. An April 3 deposition by NIH official Michelle Bulls said Rachel Riley, a senior adviser at HHS who is part of the Department of Government Efficiency created by executive order, provided NIH officials lists of grants to terminate and language for termination notices. Elon Musk, the world’s richest person, led DOGE through May. Norton has worked at the NIH as a federal employee or contractor for about a decade. She said the current administration’s policies are “definitely unethical and very likely illegal,” listing a string of developments in recent months. They include terminating studies early and putting participating patients at risk because they have had to abruptly stop taking medications, and holding up research that would predominantly or exclusively recruit participants from minority races and ethnicities, who have historically been underrepresented in medical research. “They’re saying that doing studies exclusively on Black Americans to try to develop interventions that work for that population, or interventions that are culturally tailored to Hispanic-Latino populations — that that kind of research can’t go forward is extremely problematic,” Norton said. “And, as a matter of fact, studies that over-recruit from white people have been allowed to go forward.” The NIH workers also demanded that Bhattacharya reinstate workers who were dismissed under recent mass firings and allow research that is done in partnership with institutions in foreign countries “to continue without disruption.” The NIH works with organizations around the globe to combat major public health issues, including types of cancer, tobacco-related illnesses, and HIV. In addition to the firing of probationary workers, NIH fired 1,200 civil servants as part of a rapid “reduction in force” at federal health agencies. During a May 19 town hall meeting with NIH staff, a recording of which was obtained by KFF Health News, Bhattacharya said the decisions about RIFs “happened before I got here. I actually don’t have any transparency into how those decisions were made.” He started at NIH on April 1, the day many workers at NIH and other agencies were told they were fired. Other workers have been fired since Bhattacharya took the helm — nearly all the National Cancer Institute’s communications staff were fired in early May, three former employees told KFF Health News. The letter is the latest salvo in a growing movement by scientists and others against the Trump administration’s actions. In addition to in-person protests outside HHS headquarters and elsewhere, some former employees are organizing patients to get involved. Peter Garrett, who led the National Cancer Institute’s communications work, has created an advocacy nonprofit called Patient Action for Cancer Research. The aim is to engage patients “in the conversation and federal funding and science policymaking,” he said in an interview. His group aims to get patients and their relatives to speak out about how federal cancer research affects them directly, he said — a “guerrilla lobbying” effort to put the issue squarely before members of Congress. Garrett said he retired early from the cancer institute because of concerns about political interference. Career officials routinely work under both Republican and Democratic presidents. It is par for the course for their priorities and assignments to evolve when a new president, Cabinet secretaries, and other political appointees take over. Usually, those changes occur without much protest. This time, workers said the upheaval and harm done to the NIH is so extensive that they felt they had no choice but to protest. In 11 years at NIH, Norton said, “I’ve never seen anything that comes anywhere near this.” In the June 9 letter, the workers said, “Many have raised these concerns to NIH leadership, yet we remain pressured to implement harmful measures.” “It’s not about our jobs,” said one NIH worker who signed the letter anonymously. “It is about humanity. It is about the future.” Senior correspondent Arthur Allen contributed to this report. **Recent Stories** **Iowa Democrats see signs of optimism for 2026 despite state’s hard-right turn** **Iowa Democrats see signs of optimism for 2026 despite state’s hard-right turn** **House adopts fixes to keep ‘big, beautiful bill’ filibuster-proof** **House adopts fixes to keep ‘big, beautiful bill’ filibuster-proof** **Meet 11 House candidates — or potential ones — who don’t fit the mold** **Meet 11 House candidates — or potential ones — who don’t fit the mold** **Appeals court extends pause on ruling that blocked Trump tariffs** **Appeals court extends pause on ruling that blocked Trump tariffs** **Hegseth gets bipartisan pushback for defense spending strategy** **Hegseth gets bipartisan pushback for defense spending strategy** **Bessent, House Democrats spar over budget package’s debt boost** **Bessent, House Democrats spar over budget package’s debt boost** **The Source for news onCapitol Hill since 1955** About Contact Us Advertise Events Privacy RC Jobs Newsletters The Staff Subscriptions"}