{"id": 1879, "name": "American Greatness", "domain": "amgreatness.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://amgreatness.com/2025/06/11/house-oversight-committee-launches-investigation-into-neville-singham-the-maoist-millionaire-funding-anti-ice-pro-hamas-demonstrations/", "title": "House Oversight Committee Launches Investigation Into Neville Singham The Maoist Millionaire Funding Anti Ice Pro Hamas Demonstrations", "content": "Join AG Plus Posts News Elections Great America Greatness Agenda Weekend Long Read First Principles Podcast Books & Culture America’s Talking Meet the Team Contact Winston84 Log In to AG Plus Join AG Plus Posts News Elections Great America Greatness Agenda Weekend Long Read First Principles Podcast Books & Culture America’s Talking Meet the Team Contact Winston84 Log In to AG Plus **House Oversight Committee Launches Investigation into Neville Singham, the Maoist Millionaire Funding Anti-ICE, Pro-Hamas Demonstrations** The House Committee on Oversight and Reform is about to focus its investigative powers on Neville Roy Singham, the pro-China Marxist multimillionaire behind many of the destructive far-left demonstrations plaguing the United States in recent years. The Committee is reportedly issuing a formal document request to Singham over his alleged financial support of the Party for Socialism and Liberation (PSL)—an extremist Marxist group that has been helping to organize violent anti-ICE riots in Los Angeles and elsewhere. As the main funder of The People’s Forum, Singham, 71, has also bankrolled the “Free Palestine” protests that erupted after 1,400 innocent Israelis were slaughtered by Hamas on October 7, 2023. The People’s Forum works closely with other organizations inSingham’s network,including PSL and the ANSWER Coalition, all of which have been involved in the anti-Israel protests and anti-ICE riots. PSLdescribes itselfas a revolutionary socialist party that believes “only a revolution can end capitalism and establish socialism.” The group supports the Communist Party of China (CCP) and argues that “militant political defense of the Chinese government” is necessary to stave off “counterrevolution, imperialist intervention and dismemberment.” As part of their national anti-Israel mobilization efforts, ANSWER and PSL have promoted slogans such as “Intifada revolution” and “resistance is justified.” A prior member of the PSL,Elias Rodriguez, opened fire outside of the Jewish Museum in Washington DC on May 21, resulting in a Jewish couple being murdered. A witness at the scene of the attack stated the shooter chanted “there’s only one solution, Intifada revolution,” raising concerns about PSL’s radical messaging and documented connections to Iran. The group is currently helping to organize anti-ICE demonstrations in LA, San Antonio, Oakland, Chicago and other U.S. cities. Singham, a Maoist who lives in Shanghai with special permission from the Chinese government as a “friend of the Party,” works closely with the Chinese Communist Party (CCP) and state media to help spread pro-Chinese government propaganda, according to athe New York Timesinvestigative report in August 2023. Singham reportedly manages this by donating to various groups and news organizations through his non-profit groups and shell companies. Following the NYT report, then-Senator Marco Rubio (R-Fla.) and Senator Lindsey Graham (R-S.C.) wrote to then-U.S. Attorney General Merrick Garland, asking him to open an investigation into Singham’s dark money operations for potential violations of the Foreign Agents Registration Act (FARA). Biden’s Justice Department took no action. The American-born tech entrepreneur reportedly helped finance the pro-Hamas encampments and student uprisings that began at Columbia University and spread to other campuses last year. Over the weekend, data expert @DataRepublicanreported on Xthat Singham has funneled over $20 million into far-left organizations in the U.S. though his dark money network. “Thanks to the investigative work of Data Republican, House Oversight will issue a formal document request to Neville Singham regarding his funding of a communist group linked to the LA riots and the CCP,” Rep. Anna Paulina Luna (R-Fla.) wrote on X Tuesday evening. She added: “IF HE REFUSES TO APPEAR, HE WILL BE SUBPOENAED, AND IF HE IGNORES THAT HE WILL BE REFERRED TO THE DOJ FOR PROSECUTION.” In a short video posted on social media, Luna asserted that the PSL is only using the immigration issue as a political wedge to promote its Communist agenda. In response to Data Republican’s posts, Rep. Marjorie Taylor Greene (R-Ga.), a member of the House Oversight Committee, signaled what questions could be asked of the Marxist multi-millionaire. “Is this war on ICE and America being funded by Neville Singham. Is it being funded by China? Was BLM riots funded by China? Are Antifa Communists funded by China? Are the cartels linked? This is an actual war being waged against our country,” Greenewrote on X. Singham is married to Marxist antiwar agitator Jodie Evans, 70, who co-founded Code Pink with Medea Benjamin in 2002 to protest the Iraq War. In 2020, Evans launched a “China Is Not Our Enemy” campaign, leading a series of webinars on Code Pink’s YouTube page where she praised China’s “beautiful history” and Communist political structure. Singham was once“a big fan”of Venezuelan Communist dictator Hugo Chavez, describing the beleaguered country under his rule (February 2, 1999 to April 11, 2002 and April 14, 2002 to March 5, 2013) as a “phenomenally democratic place.” On Wednesday, several leftist groups, including PSL, planned to hold “ICE-OUTs” in American cities, includingEugene, OregonandSeattle, Washington. **Get the news corporate media won't tell you.** Get caught up on today's must read stores! Δ **About Debra Heine** Debra Heine is a conservative Catholic mom of six and longtime political pundit. She has written for several conservative news websites over the years, including Breitbart and PJ Media. **Start the discussion atcommunity.amgreatness.com** Meet the Team Our Declaration Winston 84 Elections Greatness Agenda Great America First Principles Facebook Twitter Parler Contact Privacy Policy Terms of Service Privacy Policy Terms of Service"}