{"id": 1686, "name": "Charisma News", "domain": "charismanews.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://charismanews.com/news/trump-greenlights-all-such-action-necessary-to-pacify-la-illegal-criminal-rioters/", "title": "Trump Greenlights All Such Action Necessary To Pacify La Illegal Criminal Rioters", "content": "U.S. NewsCulturePoliticsMarketplaceOpinion Culture Politics Marketplace Opinion Culture Politics Marketplace Opinion World News Podcast Videos Shop My Charisma Newsletters **Trump and Netanyahu Stand at a Biblical Crossroads for Peace and Power** **Trump Honors America With Military Parade While Leftist Protesters Lash Out** **Fight, Mishap or Warning? Elon Musk’s Black Eye Fuels Theories** **Are We Approaching a ‘Nuclear Holocaust?’ Trump Admin Warns of Possible Annihilation** **Elon Musk Walks Back Trump Attacks, Issues Apology After Public Clash** **Terrorist Leader Demands Attacks on U.S.** **Huckabee Shocks with U.S. Policy Shift on Palestinian State** **4 Reasons Why Islam Is Growing Faster Than Christianity** **Scientists Unveil Orb They Believe Is a ‘Real’ UFO** **Christian Baker Terrorized by Disturbing Threats, Legal Chaos Over Cake Refusal** **Arizona Antisemitism Crackdown: New Bill Targets Bias in Classrooms** **Veterans Clinic Forced to Close After ‘Violent Mobs’ Target ICE Agents in LA** **Global Seismic Surge: Earthquakes and Volcanoes Are Increasing Everywhere** **Trump Celebrates Pentecost Sunday: ‘We Pray That The Holy Spirit Fills Our Nation’** **Miracle: Boy, 12, Saves Family from House Fire** **Trump Greenlights ‘All Such Action Necessary’ to Pacify LA, Illegal, Criminal Rioters** **‘Totally Different’ NFL Team Introduces Bible Study to Training Camp** **Trump Sends Troops to LA to Face Off with Anti-ICE Rioters** **Iran is Almost There. What Happens When it Gets the Bomb?** **JD Vance Cracks Perfect Joke in Midst of Trump-Musk Feud** **Dan Bongino Warns of Persistent, ‘Dramatic’ Threats** Charisma News Breaking News. Spiritual Perspective. Facebook X YouTube U.S. NewsCulturePoliticsMarketplaceOpinion Culture Politics Marketplace Opinion Culture Politics Marketplace Opinion World News Podcast Videos Shop My Charisma Newsletters **Trump Greenlights ‘All Such Action Necessary’ to Pacify LA, Illegal, Criminal Rioters** President Donald Trump threw down the gauntlet to left-wing rioters ravaging Los Angeles, alerting the feral mobs that he empowered the Department of Defense, the Department of Homeland Security and the Department of Justiceto restore law and orderby any means necessary. In a Truth Social post Sunday, the president wrote: “I am directing Secretary of Homeland Security Kristi Noem, Secretary of Defense Pete Hegseth, and Attorney General Pam Bondi, in coordination with all other relevant Departments and Agencies, to take all such action necessary to liberate Los Angeles from the Migrant Invasion, and put an end to these Migrant riots.” Donald J. Trump Truth Social 06.08.25 04:06 PM ESTpic.twitter.com/XJy2qwEZOk Breaking News.Spirit-Filled Stories. Subscribe to Charisma on YouTube now! “Order will be restored, the Illegals will be expelled, and Los Angeles will be set free,” Trump vowed. The president lamented that Los Angeles “has been invaded and occupied by Illegal Aliens and Criminals.” “Now violent, insurrectionist mobs are swarming and attacking our Federal Agents to try and stop our deportation operations — But these lawless riots only strengthen our resolve,” the president warned. As a reminder, violent riots erupted on Thursday and continued through Sunday, as left-wing thugs assaulted Immigration and Customs Enforcement officers who were conducting raids on hubs infested with illegal aliens. Feral mobs clashed with ICE officers and the Los Angeles Police Department as the riots escalated into the streets. There have been multiple reports of rioters throwing concrete, bottles, and other objects at law enforcement. Get your FREE CHARISMA NEWSLETTERS today! Stay up-to-date with current issues, Holy Spirit news, Christian teachings, Charisma videos & more! Leftists also blocked traffic on numerous streets, set cars on fire and looted local businesses. Rioters burned American flags and waved Mexican flags asthey celebrated mass vandalism and arson. Predictably, Democrats and their legacy media puppets condemned Trump’s move to deploy the National Guard to squelch the L.A. riots. Join Charisma Magazine Online to follow everything the Holy Spirit is doing around the world! Tellingly, the left cries crocodile tears for foreign invaders while showing no sympathy for the Americans who pay their taxes and suffer in silence amid this nauseating inversion of law and order. There’s nothing redeeming about leaving our borders open for daily invasions by unvetted armies of illegal aliens who drain public resources, commit crimes, and erode social cohesion. Unpatriotic leftists who side with foreign invaders who have no respect for U.S. sovereignty or its laws should voluntarily leave the country. This articleoriginally appeared on The Western Journal, and is reposted with permission. **Post navigation** **This One Choice Could Shape 20...** **Nephilim Agenda: Breeding Program Fallen Angels...** **Shocking Spiritual Encounters: What Seers See...** **Prophetic Warfare: The Lion's Army Reveals...** **Abducted: A Biblical Perspective on Supernatural...** **Scientific PROOF Jesus Was Resurrected -...** **PROPHETS BEWARE: God's Judgment on False...** **Supernatural Warfare: Decoding Aliens, Nephilim, and...** **End Times Unfolding? Global Leaders Shift...** **Pope Francis Dead on Easter Monday...** **What Really Happened To Nephilim Spirits...** **Major News Outlet Makes Stunning Claim...** **The Chosen EXPOSED: Passover Scene Leaves...** **The 80 Year UFO Cover Up...** **Unlocking Deliverance: The Power of Anointing,...** **The Chosen Changed Everything! What You...** **The Hidden War: Demons, False Teachings...** **Global UFO Sightings Indicate The Last...** **The Antichrist System and Mark of...** **Amanda Grace on Exposing False Prophets...** **The Chosen: Reveal Intense Last Supper...** **Understanding End-Time Prophecy And Its Relevance...** **The Chosen: Disciples Reveal the Raw...** **Pyramid Secrets Revealed Fallen Angel Technology...** **Unlocking Passover Secrets in 'The Chosen':...** **Exploring The Human Side Of Jesus...** **Scientists Just Created a \"Woolly Mouse\"—Are...** **Donald Trump and the Prophetic Meaning...** **The Unseen Battle: Prophetic Strategies for...** **Judas Unmasked: Luke Dimyan's Shocking Journey...** **Red Heifer Update: Are We Closer...** **Are Viable Red Heifers FINALLY Available...** **The Chosen Changes Our Understanding of...** **EXCLUSIVE The Chosen Season 5: Jonathan...** **Is The Antichrist Spirit Connected To...** **Most Popular Posts** **Subscribe to Our Newsletters** Charisma News Daily Prophetic Insight Charisma Magazine See all newsletters **CPN Podcasts** Charisma Media is…MyCharismaCharisma Podcast Network MyCharisma Charisma Podcast Network MyCharisma Charisma Podcast Network SectionsU.S.WorldPoliticsCultureMarketplaceOpinionCharisma Magazine U.S. World Politics Culture Marketplace Opinion Charisma Magazine U.S. World Politics Culture Marketplace Opinion Charisma Magazine AboutAbout Charisma MediaAbout Charisma NewsMeet the EditorsPrivacy PolicyStatement of Faith About Charisma Media About Charisma News Meet the Editors Privacy Policy Statement of Faith About Charisma Media About Charisma News Meet the Editors Privacy Policy Statement of Faith ConnectContact UsAdvertise With UsCustomer ServiceNewslettersCareersBecome a Podcast Host Contact Us Advertise With Us Customer Service Newsletters Careers Become a Podcast Host Contact Us Advertise With Us Customer Service Newsletters Careers Become a Podcast Host"}