{"id": 58, "name": "Alabama Now", "domain": "alabamanow.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://alabamanow.com/2024/10/17/30-years-after-baby-found-dead-along-gulf-coast-interstate-officials-identify-baby-locate-mother-but-not-before-she-too-was-found-dead/", "title": "30 Years After Baby Found Dead Along Gulf Coast Interstate Officials Identify Baby Locate Mother But Not Before She Too Was Found Dead", "content": "Home News Sports Culture Small Business Submit a news tip Submit a photo News Sports Culture **30 years after baby found dead along Gulf Coast interstate, officials identify baby, locate mother — but not before she, too, was found dead** Published 5:16 am Thursday, October 17, 2024 Byalabamanow After more than 30 years, Mississippi officials have identified a baby whose remains were found along Interstate 10 in December 1993. Officials with the Harrison County Sheriff’s Office also located the mother, who was found deceased from an apparent suicide. Timeline of events: On December 21, 1993, a newborn was found deceased in 1993 near the Lorraine Road exit on I-10 in Gulfport, Mississippi. An autopsy at the time determined the cause of death to be blood loss and exposure, ruling the case as a homicide. Despite an extensive investigation, authorities were unable to locate the mother of the baby, who was given the name “Mary Josephine,” and the case went cold. In December 2023, officials exhumed Mary Josephine’s body to obtain DNA for forensic analysis. On October 10, 2024, investigators received DNA results identifying potential family members. Through subsequent interviews, they pinpointed a woman believed to be Mary Josephine’s mother. A search warrant was obtained for DNA comparison. On October 11, 2024, investigators attempted to contact the woman at her home in Gautier, Mississippi, where they found her deceased from an apparent suicide. Inside her residence, a letter was discovered in which the woman claimed to be Mary Josephine’s mother. On Monday, Harrison County Sheriff Matt Haley announced the identification of baby Mary Josephine, a newborn found deceased in 1993 near the Lorraine Road exit on I-10 in Gulfport, Mississippi. **You Might Like** **Movies and TV shows casting in Huntsville** **Movies and TV shows casting in Huntsville** News Sports Culture Small Business Submit a news tip Submit a photo About Us Terms of Service"}