{"id": 1048, "name": "Oaklandside", "domain": "oaklandside.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://oaklandside.org/2025/05/29/on-the-last-day-of-school-outgoing-oakland-superintendent-wont-talk-about-her-early-departure/", "title": "On The Last Day Of School Outgoing Oakland Superintendent Wont Talk About Her Early Departure", "content": "Donate Latest News Arts & Community Business City Hall Education Equity Events Housing Nature & the City Nosh Public Safety Road Safety Nosh New Restaurants Nosh Features Newsletters Get in touch Advertise Facebook Instagram Newsletters Get in touch Advertise Facebook Instagram The Oaklandside The Oaklandside. Journalism for Oakland. Donate Latest News Arts & Community Business City Hall Education Equity Events Housing Nature & the City Nosh Public Safety Road Safety Nosh New Restaurants Nosh Features Nosh Logo (Highlight Menu) Nosh Marvin Boomer’s loved ones share their grief|Oakland “third places”|Early look at new restaurant Oken|Culture Makers: June 12 **On the last day of school, outgoing Oakland superintendent won’t talk about her early departure** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print Click to share on Reddit (Opens in new window)Reddit Click to share on Bluesky (Opens in new window)Bluesky Help us tell the Oakland stories that matter to you and your fellow Oaklanders. In a final planned press conference as Oakland schools superintendent, Kyla Johnson-Trammell talked about bringing the district back from the brink of insolvency, raising graduation and academic achievement rates, fostering millions of dollars in philanthropic support, and what’s on the horizon for the next district leader. One topic she refrained from discussing was the circumstances around her early departure. Thursday was the last day of school in Oakland Unified School District, and marked the end of Johnson-Trammell’s last academic year as superintendent. In August, shesigned an extensionthat would’ve lasted through 2027, but about a month ago, the OUSD boardannounced a separation agreementwith the superintendent. She will be stepping down from that role on June 30. Never miss a story.Sign up for The Oaklandside’s free daily newsletter. Δ Her last day coincides with the district’s final loan payment andexit from state receivership. The financial turnaround marked her tenure. When she became superintendent in 2017, the district had reserves lower than the 2% required by the state. They have now grown to over 15%, she said. But in order to remain on that path, the district’s next leader must consider closing schools. “We have absolutely no reason to be in fiscal crisis ever again, right? And part of making sure that’s possible is we have to reduce the number of schools,” Johnson-Trammell said. “That is not an option to not do that. Is it painful? Yes. Does it need to be done with the community? Yes. Do we need to make sure we’re not putting undue harm on Black and brown and immigrant families? Yes. But keeping things the way they are is hurting those communities.” Under her leadership, OUSD’s graduation rate has risen from 70% to 79%, the college completion rate has increased by 14%, and the share of students graduating who are eligible to enroll in the state’s public four-year colleges has grown from 35% to 50%, she said. Along with media, district administrators, current and former school board members, and community leaders were also in the room. Johnson-Trammell gave her remarks from the district’s new West Oakland headquarters, which following Wednesday night’s school board meeting, has been named the Marcus A. Foster Leadership Center. Oakland’s first Black superintendent and among the first Black superintendents of any urban school district, Foster is a revered educator who championed student success, especially for students of color. He was assassinated by the Symbionese Liberation Army in 1973. “It’s a fitting tribute to a remarkable leader and a leader who definitely shaped my leadership journey here, both as an educator and as a superintendent,” Johnson-Trammell said. “It has been an honor to serve the district that has raised me, both as a student and an educator. Today is not an ending. It is simply a handoff grounded in gratitude and an unshakeable belief in what Oakland will accomplish next.” The headquarters were built with Measure Y dollars, a $735 million facilities bond that Oakland voters approved in 2020 and has gone towards renovations at several school campuses. The school board is expected to name an interim superintendent to step in on July 1, and then begin a search for a permanent superintendent. Johnson-Trammell will remain in an advisory role as superintendent emeritus from July 1 to January 15, 2026. When asked, she declined to go into detail about her exit, stating: “We have to be aligned in terms of what it takes to continue to sustain financial stability, to get to the academic outcomes that I’ve talked about in great detail. So if we’re not on the same page, then it’s time to respectfully part ways.” Johnson-Trammell emphasized that the community must take an active role in the search and hiring of the next superintendent. “I have faith that folks will do whatever coalition building they need to hold the board accountable the same way they held me accountable for eight years. That’s their role.” **… We rely on your support** Hey, we know that most readers only scan a headline and a couple of paragraphs. Thank you for reading to the end of our story. Since you clearly appreciate the in-depth approach we take in reporting the stories that matter to Oaklanders, please consider chipping in to supercharge our newsroom. \"*\" indicates required fields Δ **Ashley McBride** x Ashley McBride writes about education equity for The Oaklandside. Her work covers Oakland’s public district and charter schools. Before joining The Oaklandside in 2020, Ashley was a reporter for the San Antonio Express-News and the San Francisco Chronicle as a Hearst Journalism Fellow. In 2024, Ashley received the California School Board Association's Golden Quill Award, which recognizes fair, accurate, and insightful reporting on public schools. Ashley earned her master’s degree in journalism from Syracuse University and holds a certificate in education finance from Georgetown University. Facebook Instagram We are part of **ABOUT** About The Oaklandside How We Work Contact us Write for us Advertise Careers Berkeleyside Richmondside **JOIN US** Get our newsletters Donate Facebook Instagram **OUR MISSION** We’re journalists for Oakland. We amplify community voices, share information resources, and investigate systems, not just symptoms.Learn more"}