{"id": 473, "name": "WNYW - Fox 5 -New York", "domain": "fox5ny.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.fox5ny.com/news/fox-news-sunday-with-shannon-bream", "title": "Fox News Sunday With Shannon Bream", "content": "Watch Live News Weather Good Day Good Night Contests More Local NYC News New York State News National News Politics Crime & Public Safety Entertainment Unusual Science Sports Seen on TV FOX News Sunday Newsletters Watch Live Forecast Closings Weather Alerts Traffic Travel News FOX 5 NY Weather App FOX Weather Good Day Cafe Good Day Street Talk Health Things to Do Watch Live How To Stream Meet The Team FOX 5 TV Schedule FOX Shows Get Our Apps Job Opportunities Public Affairs Contact Us Contests FCC Public File FCC Applications It's 10 p.m. Consumer Recalls Business The Economy Personal Finance Real Estate Street Soldiers The Tape Room Lew's View FOX 5 Flashback SkyFOX Videos Brand Spotlight New Jersey News - My9NJ Philadelphia News - FOX 29 Philadelphia Washington DC News - FOX 5 DC **FOX News Sunday with Shannon Bream: How and when to watch on FOX 5 NY** Share Copy Link Email Facebook Twitter LinkedIn Reddit Watch FOX News Sunday with Shannon Bream on FOX 5 NY starting at 10 a.m. on Sundays. NEW YORK-Shannon Bream has ushered in a new era of Sunday morning talk shows as she interviews the biggest newsmakers of the week on FOX News Sunday. You can catch all the action ofFOX News Sunday with Shannon Breamon FOX 5 NY from 10 a.m. to 11 a.m. on Sundays. Leading guests in providing context and analysis of the issues facing Americans, Bream’s weekly guest roster is among the most diverse in Sunday morning talk, featuring interviews with political, business and public affairs newsmakers from the U.S. and abroad. Before becoming the first woman to host FOX News Sunday in its nearly three-decade history, Bream served as anchor of FOX News @ Night for five years. In addition to her new role, she also continues to serve as the network’s chief legal correspondent. WatchFOX News Sunday with Shannon Breamon FOX 5 NY starting at 10 a.m. on Sundays. **Top Stories** **Jury in Weinstein retrial reach partial verdict: 'Not a victory' for Weinstein** **Sources say body of missing Bronx 2-year-old has been found near Whitestone Bridge** **Diddy trial latest: Prosecutors asking judge to dismiss a juror** **Overnight curfew imposed on Los Angeles** **NY News Update: Partial verdict on Weinstein reached; more anti-ICE demonstrations** Local NYC News New York State News National News Politics Crime & Public Safety Entertainment Unusual Science Sports Seen on TV FOX News Sunday Newsletters Watch Live Forecast Closings Weather Alerts Traffic Travel News FOX 5 NY Weather App FOX Weather Good Day Cafe Good Day Street Talk Health Things to Do Watch Live How To Stream Meet The Team FOX 5 TV Schedule FOX Shows Get Our Apps Job Opportunities Public Affairs Contact Us Contests FCC Public File FCC Applications It's 10 p.m. Consumer Recalls Business The Economy Personal Finance Real Estate Street Soldiers The Tape Room Lew's View FOX 5 Flashback SkyFOX Videos Brand Spotlight New Jersey News - My9NJ Philadelphia News - FOX 29 Philadelphia Washington DC News - FOX 5 DC facebook instagram TikTok YouTube X email New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File About Us Jobs at FOX 5 Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"}