{"id": 1, "name": "100 Days in Appalachia", "domain": "100daysinappalachia.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.100daysinappalachia.com/2024/08/life-changing-support-in-rural-north-carolina-a-program-for-treatment-of-substance-use-disorder-through-pregnancy-and-beyond-offers-care-and-counters-stigma/", "title": "Life Changing Support In Rural North Carolina A Program For Treatment Of Substance Use Disorder Through Pregnancy And Beyond Offers Care And Counters Stigma", "content": "**The INN Network** Latest News About Newsletter Pitch Us Subscribe Log in Donate Health **‘Life-changing Support’: In Rural North Carolina, a Program for Treatment of Substance Use Disorder Through Pregnancy and Beyond Offers Care and Counters Stigma** Jessie Greenblatt walks at a park with her son in Hendersonville, North Carolina on Wednesday, July 24, 2024. Credit: Jacob Biba/100 Days Jessie Greenblatt calls her hometown of Hendersonville, in the Blue Ridge Mountains of Western North Carolina, “a very quaint little town.” But, oh, how she’s seen it suffer. A woman Greenblatt went to high school with hosts a Facebook page that serves as a memorial to people roughly in the same age group who have died. Greenblatt, who’s 33 and has asked to be identified by her fiancé’s last name, says, “I can scroll through it, and I’ll be, ‘They overdosed. They overdosed…’” She recognizes how close she’s come to being numbered in that litany. By the time Greenblatt reached high school, oxycontin had laid siege to Hendersonville. She was introduced to it by an older boyfriend. After several years of use, she found her way to a rehab facility in Memphis, then into a sober living home there. She struggled to stay drug free. But with no long-term plan for recovery, no secure place in which to gain focus, she returned to use. State and federal governments had begun cracking down on the prescribing of opioids, and she was introduced to heroin. She bounced around a little before returning to Hendersonville. Fentanyl was now ubiquitous. It was a grim time in Greenblatt’s life. She experienced several relapses. Her grandfather agreed to pay for a detox facility in Philadelphia. She completed it, then immediately went on the medicationbuprenorphine. She’s remained in recovery since. But things got scary when Greenblatt learned she was pregnant: She was given what she came to learn was some potentially harmful, misguided information. The Hendersonville clinic at which she was receiving her buprenorphine told her she needed to taper off it completely — that if there was any in her system at the time of delivery, her baby would be taken from her. She already felt she’d been judged unfit for motherhood; now she was frightened, despondent. Fortunately, fatefully, Greenblatt was then connected withProject CARA— Care that Advocates Respect/Resilience/Recovery for All — an Asheville, North Carolina-based program that supports pregnant and parenting people with substance use disorders. Within theMountain Area Health Education Center’s obstetrics and gynecology department, Project CARA offers medical, substance use and behavioral health care and other support services in one place. Greenblatt was introduced to Sarah Peiffer, a family medicine specialist withBlue Ridge Health, a Project CARA spoke in Hendersonville. Peiffer quickly set the record straight on buprenorphine — she did not need to taper off her medication — and helped Greenblatt find her footing on the path to a healthy delivery. Survey data indicates that Project CARA patients attend more prenatal and postpartum appointments than those outside the program; they’re more likely to receive substance use treatment during their pregnancy; and they’re more satisfied with their care. “We know that if patients come to us and keep coming to us, what we do here is working,” says Amy Marietta, Project CARA’s medical director. “It’s helping them achieve their goals.” Jessie Greenblatt wants to tell her story. Her son was born August 23, 2021. His birth went smoothly — he received a single dose of methadone, which studies have shown to be an effective means of addressingneonatal opioid withdrawal syndrome— and he’s an active, inquisitive kid today, “all over the place,” Greenblatt says. Medical studies show children exposed to buprenorphine in uterodo not experience any negative effects to their physical, mental or behavioral development. This was true for Greenblatt’s son. Greenblatt withstood the stigma she encountered as a pregnant woman with a history of drug use; she withstood an ignorance of proper care. She found the support she needed to have a healthy pregnancy and deliver a healthy child, and she wants others to know it’s available. “You want to try and do everything right for your kid,” Greenblatt says, “but you’ve got nobody in your corner. It’s really hard. At Project CARA, I’ve always felt like I had somebody there.” “Dr. Peiffer was in my corner.” **‘I just want the best for my baby’** A game-changer for the treatment of perinatal substance use disorder, Marietta says, is the availability of buprenorphine in an outpatient setting. Transportation is a primary barrier to care in these mountains; Project CARA strives to provide as much assistance as possible in one visit. Easier access to buprenorphine is critical to recovery for so many, she stresses. The program employs a hub-and-spokes model, based onVermont’s system for treating opioid use disorder. The hub is in Asheville; there are seven spokes in the state’s 16 westernmost counties, most of which are largely rural, quite remote and generally underserved. OB-GYN services arefew and far-flung. Central to Project CARA’s mission, Marietta says, is “nourishing and developing” providers in those remote counties, supporting them with whatever they need to offer these services. Patients commonly arrive for a first visit to a Project CARA office having been subjected to stigma and fed misinformation. “We so often hear from patients that they’re terrified,” Marietta says. “‘I’m so confused. What should I do? I just want the best for my baby.’” “Pregnancy is such a unique, motivational moment,” says Caitlin Hettich, a Project CARA behavioral health clinician. It’s critical to seize that moment. For patients with a history of drug use, it’s also an intensely vulnerable time. Tammy Cody, director of navigation, says, “Knowing that the end result may be going to the hospital and not taking that child home — this is the level of fear that we’re talking about having to overcome to get in the door.” “We hear over and over from our patients that the hardest part is actually walking through the door,” Marietta says. “So we celebrate when people come. And many times, our patients tell us it’s the first time they ever felt safe or heard or listened to in any sort of medical environment.” Greenblatt acknowledges the fear she felt. She didn’t learn she was pregnant until three months in. “I was like, ‘Oh my God, I’ve got six months. I’ve gotta get off [buprenorphine]. I was freaking out. ‘They’re gonna take my baby’ — because that’s what these people were telling me.” Peiffer assured her that wasn’t going to happen. Greenblatt was able to continue to receive treatment in a discreet setting. “This isn’t the only thing they’re here for,” Peiffer says. “They’re going to come in to visit me and I’m going to check in on, ‘How’s the other mood stuff you’ve been dealing with? How’s your thyroid disorder been?’ In addition to, ‘Are you having any withdrawal symptoms? Are you having any problems with cravings?’” Bayla Ostrach is a Western North Carolina-based medical anthropologist who studies reproductive health care access, substance use disorder treatment and the ways stigma can affect access to care. “When I first observed in their clinic, I was struck by how much time the whole clinic team spends listening to patients talk about not only their clinical needs, but also the larger context of what was happening in their lives and how it brought them to where they are now,” Ostrach says. “The research on what pregnant and parenting people with substance use disorders need to successfully access evidence-based care, especially in rural Appalachian areas where there is less treatment available, is clear,” Ostrach says. “Patients appreciate supportive, nonjudgmental care, and providers that offer it can help patients overcome other barriers, including stigma. Project CARA does just that.” The pact is that the patient is in charge. That’s understood from the outset. Should you choose to walk out the door, that’s your prerogative, says Anna Gerhardt, Project CARA’s lead nurse, “and we’ll still be here if you decide to come back.” **No dancing around it** Some Project CARA patients remain in active use. “No one dances around the subject,” Hettich says. “Our providers say, ‘When was your last use?’ They welcome honesty. They say, ‘I’m so glad you told me that. Now let’s talk about the next steps.’ And I think that’s a unique thing.” Patients arrive feeling very guarded about what they can say about their drug use, says Judi Layton, a Project CARA certified nurse midwife who recently left the program to take a position as a psychiatric nurse practitioner, because they’ve so often experienced “a lot of very prejudicial treatment and a lot of hostility and anger from providers.” Admitting to a relapse is frightening. “They know we’re not going to judge them,” Layton says. The freedom to be honest builds trust, which enhances the probability they’ll return for that next visit. “We have patients who come to us who have been in recovery for 10 years and we have people who use in the parking lot before they come upstairs,” Gerhardt says. The next step is, “‘Okay, what support can we offer you, wherever you’re at.’” Naloxone is offered at every visit. “We talk a lot about theNever Use Alone hotline, which we’re big fans of,” Marietta says. “We provide information aboutsyringe exchange programs, harm reduction programs.” The federal Substance Abuse and Mental Health Services Administration affirms that harm reduction initiatives play a significant role in preventing drug-related deaths and increasing access to health care, social services and treatment. A study conducted in Seattle, for example, found that new participants in a syringe exchange program were five times more likely to enter treatment than those who weren’t in the program. Marietta says that when their patients continue to use, the philosophy of harm reduction, based in respect for their rights and humanity, prevails. And there’s so much that can be done for people even as they continue to use drugs. “We want to support them in achieving their goals, and if their goal is to stop using substances, we want to help them get there,” she says. “But we focus so much on the process and building that rapport, which I think is arguably the most important part. “We have nine months,” she adds, “to really get them invested in not just taking care of the baby but themselves, and in their recovery process.” **‘This is what we’re going to do’** “They treated me with respect,” Greenblatt says. “They didn’t judge me. They were there for me.” Greenblatt calls her experience at Project CARA “life-changing.” Peiffer remains her primary care provider, as well as her son’s, and oversees her buprenorphine treatment. Peiffer says she’s encouraged by what she perceives as a mounting interest among colleagues in integrating perinatal care and substance use treatment. Forums on the subject at conferences are packed. “We’ve had residents say, ‘Hey, we’ve been told these patients are too high risk for us to manage,’” she says. Now they’re saying, “‘Okay, this is what we’re going to do.’” Layton says of her patients, “They want to be with their babies, and they should be, and they should be given tools to be able to do that, to be able to be successful. You hear that refrain, ‘Well, just stop using. If you loved your baby, you would.’ That’s BS.” Substance use disorder is a chronic, relapsing brain disease, Marietta attests. The American Society of Addiction Medicine’sdefinition of the diseasestates that use continuesdespitethe harmful consequences a person experiences. Addiction is not a choice; patience is paramount. “They beat themselves up more than anyone else could ever,” Layton says. “They know the things that they’re going to face, and that they might be separated from their baby. And that’s terrifying. It’s terrifying.” Jessie Greenblatt talked with her mom about the possible repercussions of publicly sharing her history with drugs. They agreed it would take a pretty low-character person to judge harshly someone who’s been through so much and emerged whole. “That’s a ‘you’ problem,” she says, “not ‘me.’” The support and respect Greenblatt’s been given bolsters the foundation from which she counters the stigma. She wants the care she’s received to be the norm. Again, it’s life-changing. **Taylor Sisk** **Georgia's Property Tax Referendum Misses the Point** **Georgia's Property Tax Referendum Misses the Point** **Appalachia’s Young Voters Could Impact the 2024 Election** **Appalachia’s Young Voters Could Impact the 2024 Election** Copyright © 2024 — 100 Days in Appalachia. All Rights Reserved Designed byWPZOOM"}