{"id": 90, "name": "APTN National News", "domain": "aptnnews.ca", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.aptnnews.ca/investigates/im-not-hiring-no-indian-indigenous-man-says-winnipeg-tried-to-muzzle-his-complaints-with-non-disclosure-agreement/", "title": "Im Not Hiring No Indian Indigenous Man Says Winnipeg Tried To Muzzle His Complaints With Non Disclosure Agreement", "content": "APTN News Stories about First Nations, Métis and Inuit peoples APTN News AboutAbout APTN NewsNews TeamTell us your StoryJoin our Team About APTN News News Team Tell us your Story Join our Team About APTN News News Team Tell us your Story Join our Team Your TerritoryAlbertaBritish ColumbiaManitobaNew BrunswickNewfoundland and LabradorNorthwest TerritoriesNova ScotiaNunavutOntarioPrince Edward IslandQuebecSaskatchewanYukon Alberta British Columbia Manitoba New Brunswick Newfoundland and Labrador Northwest Territories Nova Scotia Nunavut Ontario Prince Edward Island Quebec Saskatchewan Yukon Alberta British Columbia Manitoba New Brunswick Newfoundland and Labrador Northwest Territories Nova Scotia Nunavut Ontario Prince Edward Island Quebec Saskatchewan Yukon Our ShowsAPTN National NewsNewscastFace to FaceAbout Face to FacePodcastNation to NationAbout Nation to NationPodcastInvestigatesAbout InvestigatesInvestigates Full EpisodesPodcastNouvelles NationalesÀ ProposÉpisodes CompletsReportages APTN National NewsNewscast Newscast Face to FaceAbout Face to FacePodcast About Face to Face Podcast Nation to NationAbout Nation to NationPodcast About Nation to Nation Podcast InvestigatesAbout InvestigatesInvestigates Full EpisodesPodcast About Investigates Investigates Full Episodes Podcast Nouvelles NationalesÀ ProposÉpisodes CompletsReportages À Propos Épisodes Complets Reportages APTN National NewsNewscast Newscast Newscast Face to FaceAbout Face to FacePodcast About Face to Face Podcast About Face to Face Podcast Nation to NationAbout Nation to NationPodcast About Nation to Nation Podcast About Nation to Nation Podcast InvestigatesAbout InvestigatesInvestigates Full EpisodesPodcast About Investigates Investigates Full Episodes Podcast About Investigates Investigates Full Episodes Podcast Nouvelles NationalesÀ ProposÉpisodes CompletsReportages À Propos Épisodes Complets Reportages À Propos Épisodes Complets Reportages Videos PodcastsAPTN News BriefInvestigatesNation To NationFace To FaceInFocusTruth & Politics APTN News Brief Investigates Nation To Nation Face To Face InFocus Truth & Politics APTN News Brief Investigates Nation To Nation Face To Face InFocus Truth & Politics APTN TV Investigates National News **‘I’m not hiring no Indian’: Indigenous man says Winnipeg tried to muzzle his complaints with non-disclosure agreement** Manitoba justice minister says he’s open to seeking advice on what are known as NDAs. Borrowing a biblical phrase – “Woe unto them that decree unrighteous decrees” [Isaiah 10:1] – is what got activist and then-editor of the Western Labor News J.S. Woodsworth thrown in jail in the summer of 1919 for seditious libel during the Winnipeg General Strike. One hundred years later, at the same spot where young men pushed over a street car in a riot,APTN Investigates: Unmutedfocuses on a contemporary way of silencing labour voices with a non-disclosure agreement, or NDA. The episode opens with a small workers’ meeting – organized by the reporter – at Winnipeg’s monument to the violent culmination of the 1919 strike, which dramatically depicts a day known as Bloody Saturday when a streetcar was pushed over and two were shot dead by the North-West Mounted Police. The Bloody Saturday monument is fittingly a streetcar tilted over just like the real one was back in 1919. For City of Winnipeg employee and proud Métis man Dennis Smith, it helps to meet at the epicentre of Winnipeg’s labour history and commiserate with others – like his advocate, self-described “recovering politician” Dougald Lamont, who until recently led the provincial Liberals and Marcel Williamson, who formerly worked for the province in IT support. “It’s good, it’s empowering, it’s nice to see other people stepping forward because that’s what we need,” says Smith. “Step forward, speak, even if you have an NDA case too.” Smith called Lamont one day to ask for help with a situation he was struggling with at work. “So, he says, ‘I was working in this department where they do inspections,’” says Lamont. “And I knew what he was talking about because there had been an investigation – private investigators had been hired and they found out that all these people weren’t doing their jobs.” Employees in the department were caught on video doing errands, shopping and not going to work. This was a news story in 2019, and eight employees were fired and 20 employees in total were disciplined. But not Dennis Smith – he was doing his job just fine and wasn’t disciplined. The people Smith worked with seemed to believe he was involved with the anonymous group of citizens who funded the surveillance of the city workers. “I was by the photocopier one day and a guy says, ‘if I find out who’s the rat, I’m going to freaking kill him,’” says Smith. “And I said, ‘buddy, are you accusing me of something? I’m the only one standing here.’” This was just one incident in a campaign of harassment Smith says he endured at work, which included someone reprogramming his phone so it would forward calls elsewhere, spraying cologne over his desk area, breaking his stapler and taping over the microphone on his phone. Lamont has listened to all of Smith’s stories about the way he’s treated at work and believes it’s related to the media exposé of goings-on in the department. “He’s been abused and treated horribly when he’s the one person in the department who’s been honest and has been trying to get things done properly,” says Lamont. Smith’s misery at work hit bottom at a meeting called to try to deal with the ongoing problems he was encountering. In the meeting, Smith suggested hiring an Indigenous mediator to which a manager said, “I’m not hiring no Indian.” Things got so bad that Smith went on a Workers Compensation Board-endorsed medical leave for just over a year, with a psychological injury related to his experiences at work. Throughout the ordeal, Smith felt unsupported by the union, especially, he says, when they negotiated a deal on his behalf, which involved signing an NDA and an offer of $20,000 in compensation. “He had to sign an NDA which means he would be absolutely forbidden from ever speaking to anyone, speaking the truth to anyone,” says Lamont. “He’s not the one who’s done anything wrong so he’s being asked to keep a secret that other people have done wrong and he’s still being punished in my view. “So, they expected him to be silent. They offered him that money only if he was silent and part of the deal was that he loses his job. What the hell kind of deal is that?” APTN Investigatesreached out to Smith’s union CUPE [the Canadian Union of Public Employees] as well as the City of Winnipeg requesting interviews. CUPE has not responded and the city sent a statement saying that “all City of Winnipeg employees are entitled to be treated fairly and with dignity, free from harassment or discrimination in the workplace.” Even though Smith rejected the offer and didn’t sign, he discovered the city had deposited $20,000 into his account anyway, without his permission. Smith had his bank return the money. ‘Can’t Buy My Silence’ A brave move on his part and one that lawyer and NDA expert Julie MacFarlane admires. “I think it showed real initiative and courage,” says MacFarlane, “and that’s something that we like to support people to do, to push back.” MacFarlane is a former law professor who co-leads an international campaign against the misuse of NDAs called Can’t Buy My Silence. There’s a myth, MacFarlane says, that NDAs bring closure for people in situations like Dennis Smith’s. “The reality is that NDAs don’t bring people closure,” says MacFarlane. “We hear constantly that this means they have an albatross around their necks for the rest of their lives because the NDA is forever and they must live in constant trepidation of breaking the agreement and possibly therefore forfeiting their compensation.” MacFarlane advocates for legislation that restricts the use of a non-disclosure agreement in silencing victims of harassment or sexual misconduct. Prince Edward Island already has itsNon-disclosure Agreements Actwhich took effect in 2022 and MacFarlane is supporting the development of similar legislation in Manitoba. “I think that Manitoba with the very large Indigenous community and the clear evidence that we have that this is having a disproportionate impact on Indigenous people, gives them even more reason to want to be in the forefront of this,” says MacFarlane. When he was an MLA, Dougald Lamont introduced NDA bills twice – in 2022 and 2023 – but they died both times. As part of Lamont’s legislative efforts, a committee hearing was held to give people silenced by NDAs an opportunity to speak. Marcel Williamson – a Winnipegger with roots in Shoal Lake 39 Ojibwe Nation and Fisher River First Nation – was one of the people who testified. Like Dennis Smith, Williamson chose to refuse the NDA that had been presented to him with an offer of compensation by management. Shared Health Manitoba terminated Williamson’s job after he complained about a number of incidents that he alleges he endured, including racist comments and assaults. While admitting to just one of Williamson’s allegations [that a supervisor had broken a respectful workplace policy when he used the term “warpath” in a meeting to describe angry department clients] management presented him with an offer of over $60,000 in compensation – which Williamson rejected, along with the NDA that came with the offer. APTN requested an interview with Shared Health but they provided a statement instead. “While we will not discuss individual employment matters, we can confirm that, as part of the standard process for resolving employment terminations, a non-disclosure agreement is included in the final settlement terms. However, it would be inaccurate to suggest that financial settlements are provided solely in exchange for signing an NDA.” Williamson is hopeful the NDP government under Ojibway author, journalist, and rapper – Premier Wab Kinew – will do something to bolster his position in negotiating a better outcome. “Hopefully with this government, the new NDP government under Mr. Kinew, we can maybe rehash that and see what the options are,” says Williamson. And provincial Justice Minister Matt Wiebe is keeping the door open on a new NDA bill. “We’re looking forward to meeting further with Professor McFarlane and very interested in the work that she’s done in researching this and bringing together some of these ideas for us to continue to listen to and look at,” says Wiebe. Dennis Smith still has his job with the City of Winnipeg, and wants to keep it – so he may have the most to lose. He’s hired a lawyer to pursue a more satisfactory resolution, but whatever comes out of that can’t repair the effect this has had on him and his family. “Basically everything that I’ve been put through has changed my DNA,” says Smith. “I used to be the happiest, most lucky guy that you would ever meet. Not anymore.” **Continue Reading** **More Stories** **Wildfires force out another 1,000 residents in Manitoba** **Mi’kmaw and supporters gather in Halifax to push back ag...** **Grand chief in Ontario says repeal of Bill 5 starting poin...** **First Nations in B.C. to meet with senior officials in Ott...** **Coal mines on Alberta’s eastern slopes could push fi...** **Indigenous consultation and an advisory council: Feds intr...** **Sidebar Social Icons** **Sidebar Ad Box 1** **Sidebar Ad Box 2** **Contribute** **Poll** Yes No Unsure Yes No Not all projects Yes No Unsure **APTN News** News Team Tell Us Your Story Live Podcasts Videos **APTN News Programs** APTN National News Face to Face Nation To Nation Investigates Nouvelles Nationales d'APTN **APTN Corporate** Corporate Info Careers Media Centre Advertise with Us Contact APTN **APTN TV** Schedule APTN Shows APTN Languages Shows Documentaries Movies Kids Stream APTN lumi **Find us on** **** **Want to stay informed?** Signup to our newsletter and receive this week's top stories every Saturday morning."}