{"id": 1788, "name": "Prevent Genocide 2030", "domain": "preventgenocide2030.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "very-low", "questionable": null, "url": "https://preventgenocide2030.org/oppose-casey-means-for-surgeon-general/", "title": "Oppose Casey Means For Surgeon General", "content": "**** HOMEFreedom Fighters’ Prayer Freedom Fighters’ Prayer Freedom Fighters’ Prayer UNwinding from the UN Save Our Ostriches THE AGENDA Podcast Library URGENT ACTIONSUSA EXIT the UNRubio – Tell Trump to Exit the UNRFK Jr. REMOVE WHO FROM HHSOPPOSE Casey Means for Surgeon GeneralSave Our OstrichesC3 – Council of Concerned Citizens USA EXIT the UN Rubio – Tell Trump to Exit the UN RFK Jr. REMOVE WHO FROM HHS OPPOSE Casey Means for Surgeon General Save Our Ostriches C3 – Council of Concerned Citizens USA EXIT the UN Rubio – Tell Trump to Exit the UN RFK Jr. REMOVE WHO FROM HHS OPPOSE Casey Means for Surgeon General Save Our Ostriches C3 – Council of Concerned Citizens UN: GLOBAL DESTRUCTIONLAWTEDROSThe UN’s War On ChildrenTrans Gender Delusion LAW TEDROS The UN’s War On Children Trans Gender Delusion LAW TEDROS The UN’s War On Children Trans Gender Delusion Deep DiveVaccine Truth ReportsResourcesMotivationsThe World PictureDr. Rima’s RantsYou Will Save The World Vaccine Truth Reports Resources Motivations The World Picture Dr. Rima’s Rants You Will Save The World Vaccine Truth Reports Resources Motivations The World Picture Dr. Rima’s Rants You Will Save The World DOCUMENTS Press RoomMUSICLEVITY MUSIC LEVITY MUSIC LEVITY Contact UsAbout Us About Us About Us DonateDonate to C3Donate to PreventGenocide2030.org Donate to C3 Donate to PreventGenocide2030.org Donate to C3 Donate to PreventGenocide2030.org **Casey Means as Surgeon General?Say ‘NO!’** I urge you to oppose Casey Means’ nomination as Surgeon General in order to protect the health of America. Ms. Means, who is no longer a licensed physician, is a strong advocate of biometric surveillance and transhumanism. After quitting her residency training program, she founded two companies promoting biomedical surveillance and transhumanism, which she currently owns. Means is the co-founder and Chief Medical Officer of “Levels”, a company which sells trans-cutaneous continuous glucose monitors and is involved in her brother’s company, Truemed, which sells supplements, fitness equipment and tracking devices online.Her enthusiasm for transhumanism and participation in its popularization alone should disqualify her to lead our Public Health efforts. Her lack of clinical experience and the blurring of lines between medical care and marketing are further indications of established conflicts of interest and poor judgement.Help protect America’s health and privacy by rejecting this ill-conceived and dangerous nomination for the important post of America’s Surgeon General. Take this action to tell your senators to reject Casey Means’ nomination for Surgeon General. Without clinical licence or experience, but with a deep commitment to highly invasive, totalitarian biometric surveillance, Casey Means is a disastrous choice to lead the US Public Health charge as the Commanding General of the US Public Health Service Commissioned Corps (USPHSCC), an armed branch of the US military. After failing to complete her surgical residency (Ear, Nose & Throat), Casey Means switched her attention to biometric surveillance, an essential component of the globalist plans for bio-digital convergence, Transhumanism, and incorporating all of us into the “internet of bodies.” Means burst onto the public stage in an obviously carefully orchestrated media blitz focusing on her alleged mastery of, and practice of, functional medicine. Her medical licence, inactivated in 2019, has never been reactivated, yet she claims to “practice” functional medicine and has written a widely lauded, but scientifically and medically vapid rehash of very old biochemical, nutritional and clinical “news.” She is, however, far more successful as a bio surveillance entrepreneur and CMO, inexplicably raising hundreds of millions of dollars for a first time start up venture with an inexperienced team lacking managerial or business experience. The sole product of her company, “Levels,” is a subcutaneous biometric surveillance device for continuous glucose monitoring. Serious questions about the actual number of subscribers to her monitoring service have been raised. America’s Public Health is too important to put into the hands of a globalist puppet. Tell your Senators to protect America’s health by voting “NO” on Casey Means’ nomination as Surgeon General. FREE SUBSTACKS– NO PAYWALL – Dr. Rimahttps://drrimatruthreports.substack.com/ Connie Shieldshttps://unlockalberta.substack.com/ Rapph Fucetolahttps://freedomadvocate23.substack.com/ **Casey Means Supports Biometric Surveillance. We Don’t.Tell the Senate toBlock her Nomination.** Unlicensed* Surgeon General Nominee Casey Means Wants to Track Your Bio Markers All the Time. So Does Her Friend, Bobby. She’s Riding a Trojan Horse into DC. What Could Possibly Go Wrong? * Unlicensed Surgeon General Nominee Casey Means Wants to Track Your Bio Markers All the Time. So Does Her Friend, Bobby. She’s Riding a Trojan Horse into DC. What Could Possibly Go Wrong? **Peggy Hall (The Healthy American) hits it out of the ballpark with this critically important video. Call the Senate to block her nomination.** RIMA E LAIBOW MD MAY 11, 2025 47 1815 Share 1 Peggy Hall is sounding the alarm about Trump’s second nominee for US Surgeon General. Casey Means, MD, (unlicensed – keep reading) is riding into Washington DC on an engineered Trojan Horse built of media hype and globalist positioning. Now, it must be said that President Trump’s vetting process for candidates to fill this post is woefully poor. His first nominee, gushingly enthusiastic mRNA “vaccine” and Operation Warp Speed promoter, the devout Dr. Janette Nesheiwat, who is a member of a favored family (her sister served as Trump’s Homeland Security Advisor during his first term and is married to Mike Waltz, the once and former National Security Adviser), famously maintained in a 2021 Fox News opinion piece,“I’m optimistic we are on our way toending the needless loss of lives starting with the nothing short of miraculous coronavirus vaccine and the development of therapeutics.We have many vaccines in existence that treat a variety of non-life-threatening diseases but to have aCOVID vaccine, i.e. aPfizeror Moderna mRNA that will actually save you from dying is a gift from God.“[Emphasis added – REL] Paying no attention whatsoever to science or logic, she praised social distancing, mask wearing (including masking children) and thanked Face Book for censoring covid “vaccine” questions, praying that other social media sites would do the same. She also lied shamelessly about her credentials Despite actually being Board Certified in Family Medicine and a director of an urgent care company (CityMD), Dr. Nesheiwat [criminally?] misrepresented her academic and military history [!] by claiminig that her medical degree was from the University of Arkansas for Medical Sciences when she actually graduated from the [accredited, but far less prestigious] American University of the Carribean. She falsely claimed Board Certification in Emergency Medicine and lied about being commissioned as an Army officer. President Trump’s vetting process is more than a little weak. And the same lack of care in providing the American public with qualified, let alone suitable, candidates which was so evident in the sycophantic Dr. Nesheiwat’s absurd nomination for Surgeon General, a major post in the US “Health” “Care” system, is even more evident in the deeply worrisome nomination of Casey Means for the post of Surgeon General (SG) of the United States. What does the SG do, and with whom does s/he do it? Most of us don’t really focus very much on that office, but it turns out to be an important one since the SG is the Commanding General of the United States Public Health Service Commissioned Corps, which is woven into a vast number of government functions: 2 TheU.S. SGserves as the leading government spokesperson on matters of public health. S/He speaks for the government on public health issues. USPHSCC’s mission is toprotect, promote, and advance the health and safety of the nation, providing Americans with the best scientific information available on how to improve health and reduce risk of illness and injury. USPHSCC is an armed servicedirectly under the Department of Health and Human Services. The information of how many of its 6000 members carry weapons is not available to the public. It is, in essence, a separate and private army answerable to the Secretary of Health and Human Services, whose emergency powers are, in many ways, much more significant than those of the President.Its commissioned officers are eligible for the same benefits as active-duty military personnel subject to the Uniform Code of Military Justice. Trump’s second candidate for the position of Surgeon General is even less qualified than the first. Dr. Nesheiwat is at least a [singly, not doubly] Board Certified licensed physician, although she is unable or unwilling to exert scientific and clinical discernment in a political context and is both a liar and a sycophant. Casey Means is far more frightening and far less qualified to fill the post than the prior nominee, which is saying quite a lot. Dr. Naomi Wolf, herself a Tech CEO, raises deep and highly significant questions about Casey Means Outspoken with Dr Naomi Wolf The Imaginary Casey Means Yes, there is a fight right now among MAHA activists. Yes, it has to do with the announcement on May 7 2025 that “wellness influencer” and bestselling author Casey Means was replacing Dr Janette Nesheiwat as President Trump’s nominee for the office of Surgeon General. Dr… Read more 2 days ago · 672 likes · 416 comments · Dr Naomi Wolf Dr Wolf says,“Isaid — and I stand by every word — that it looks to me as if both Casey Means and Calley Means have been sent to us by scarier interests than the CIA. Silicon Valley is scarier than any government agency, and far more powerful. The Means siblings, I maintain, are representing Silicon Valley’s interests, and not ours. I said — and again, I stand by every word — thatthey both appear to be tasked with representing Big Tech’s interests in the rush to exploit the gold mine that is the pristine, valuable data — especially our private medical data – that is currently held behind secure doors by the United States Government.” and makes the case, eloquently and, to my mind, compellingly, that Casey Means is a plant, a created, inauthentic and bogus “authority” and “entrepreneur” who is riding a Trojan Horse to bring us endless biometric surveillance and bring her masters and benefactors the limitless profitability of our personal and medical data – forever. Dr. Wolf points out that the funding patterns and amounts, which are enormous, make as little sense as Dr. Means’ clinical, medical and academic history, questioning why hundreds of millions of dollars suddenly and inexplicably became available for a company with no track record, product history or managerial experience. She surmises lack of merit and creativity do not account for this investment, but another agenda, which is not in the service of either the public or health freedom, accounts for the meteoric economic, media and career rise of the attractive Dr. Means. Not coincidentally, since the way her boss, Bobby Kennedy, is going to figure out “by September” “what causes autism” involves throwing open all data banks currently available in the Federal Government which pertain in any way to autism and autistic people, we are seeing the Trojan Horse being led with flower petals on the streets and garlands around its neck into the Federal Government Data Banks so bringing down any vestiges of privacy, personal choice or personal autonomy. This is, of course, completely consistent with Project Stargate, “announced”, but actually borrowed from the Biden regime unchanged, on Day 2 of President Trump’s current term. 3 Bio surveillance is, after all, pretty much Casey Means’ middle name. She founded, and is the CMO ofLevels, 4 a company that uses a filament inserted into, and under, the wearer’s skin to track continuous glucose levels (and nothing else?). She believes in the use of “wearable devices” (although hers is invasive, not wearable) to surveille biomarkers like glucose and inflammatory markers continuously to enhance “good energy” and health. Her brother’s company,TrueMed.com, sells a wealth of health and fitness devices, including tracking and surveillance ones. Casey Means is heavily involved with that company as well. Who better than pretty, photogenic, Dr. Casey, MD, to “influence” us into compliance with her Good Energy for the Greater Good? I am convinced that Dr. Means’ nomination as Surgeon General is a very, very bad idea. In addition to the entrepreneurial meteoric rise, there is the medical one. And I ask myself, as a licensed physician with 55 years of experience in diagnosing, treating and, yes, curing people and their chronic, degenerative diseases, and one who knows and uses functional medicine, by the way, how Dr. Means got so famous so fast and was so very fortunate? As a surgeon who dropped out of her Residency in Ear, Nose and Throat Surgerywith less than 6 months to go to complete her post graduate training, she is a curious sort of expert, after all. And as a “Functional Medicine” “practitioner”without a license, I do not understand what her medical experience could possibly be. A quick search for an office where I might make an appointment with Dr. Means comes up dry. Let’s talk about that “Doctor” thing, shall we? Although her MD degree from Stanford University travels with her (she gets to keep the “MD” designation whether she is licensed or not), Casey Means, MD, is not a licensed physician and has not been since 2019 when her license became inactive. That’s when she dropped out of her Residency. Her license at that time was provisional as a Post Graduate trainee (that’s what the PG stands for, below) 5. On a side note, since she graduated in 2014 from Stanford University and was in a 5-year ENT Residency, which she was due to finish in 2019, why did she leave that program 6 months before its end, not enter another and not maintain her license? In my experience, Residents who get into serious trouble generally refit the story to tell people that they decided they did not believe in allopathic medicine or surgery anymore and chose instead to strike out on a bold, new and totally independent path. It does happen, but mostly that story is self-serving BS served up as camouflage for whatever the problem was that cost them their position and derailed finishing their training program. It is NOT a requirement for a medical license to finish a Residency program in the United States. Taking the necessary examinations, graduating from an accredited Medical School and having internship (1-2 years) or equivalent postgraduate training is sufficient to obtain and maintain a license. As the Oregon.gov website specified, 6 Dr. Means’ Oregon license has been inactive since 2019 (although Wikipedia mistakenly says that it has been inactive since 2024.)7 The last year a license was granted to her was 2018. It expired in 2019 at the close of her Residency year. So, Dr. Means tells us that she has been “practicing functional medicine” since that time. How? Without a license? We are being told that the post of Surgeon General will be filled by a physician practicing functional medicine without a license? Or will it be filled by one without any clinical experience in the area she claims to be an “expert” and an “influencer” in because she recycled obvious and superficial information, claiming to understand the cause and cure for all diseases just because she said so? Really? Seriously? As a physician with 55 years of experience, that does seem remarkable to me! Does any else see a problem here? And that does not even deal with what Peggy Hall and Dr. Wolf focused on. I am trained in functional medicine, and it forms a part of the framework for my medical world view, interventions, treatments, choices and understanding. The term “functional medicine” was created by Jeffrey Bland, who founded The Institute for Functional Medicine (IFM) in the early 1990s. It means basically applied biochemistry, which is what nutrition really is, after all, with a good deal of creative and intelligent clinical chemistry (that is, lab tests) used to direct that effort. I find its teachings about heavy metal poisoning, adrenal fatigue, toxic environmental inputs and how to deal with them, nutrition and other areas to be useful tools in my much, much wider tool kit. Many physicians, however, do not find functional medicine at all convincing, meaningful or helpful and reject it as the same sort of pseudoscience that doctors like me reject vaccination as being. There is, sadly, an enormous divide between these positions and, tangentially, I am quite concerned that an untrained, inexperienced, intellectually and scientifically vapid “spokesperson” for this way of approaching health and disease will help the allopathic mafia to drive a stake into the heart of meaningful medical approaches which do not depend on pharmaceutical manipulation. Casey Means is a long-term danger to long term health as well as a bio-surveillance Trojan Horse rider. She is not able to help Make America Healthy Again because she is not what she claims to be. I use the tools of functional medicine, when I do, as part of a MEDICAL practice, relying on the legality of doing so under the permission granted by my MEDICAL licenses. Casey Means has not done so and cannot do so. But that is how she represents herself and allows others to do the same. Robert F. Kennedy, Jr., insider and former Presidential bid running mate, Nicole Shanahan, wrote on X,“I was promised that if I supported RFK Jr. in hisSenateconfirmation” that Means would not work under the Department of Health and Human Services (HHS)…. I don’t know if RFK very clearly lied to me, or what is going on.”Why would Ms. Shanahan want to be promised that?Hmmmmm…. Dr. Means and her food-industry brother’s book (her only publication, as far as I know), Good Energy, and its little spin-offs, extolls the jaw dropping glories of functional medicine in glowing hyperbole which, itself, has been met with glowing hyperbole: “groundbreaking”, “surprising” “tour de force”, “a must read for holistic health and wellness” because it tells us the massively unsurprising fact (and it as a fact), that there is a connection between metabolism and health. Um, yeah, right. Who would have imagined such a thing! A PubMed search of metabolism and health is rather productive, 8, giving us1,225,154 results over 122,516 pages. A search using metabolism and the trendier term “holistic health” cuts it down some and gives us a mere2,001 results on just 201 pages. 9 Dr. Means continues to astound and astonish by offering widely available, but rather attractively packaged, boringly obvious, long-established common sense “secrets” which are actually embarrassing because they are so generally known and non-specific, but all gussied up in pretty new wrapping paper. 10 As we all know by now, this super nova super star burst on the screen and scene with her appearance along with her brother onTucker Carlson’s showin August, 2024 (and has since been pretty much everywhere), turning medicine and medical issues, which are very real, into a sort of homogenized, pasteurized, over-promising new age life-style-is-all pablum in which bio-surveillance and good food choices will MAHA and make everything all right. Doublehmmmmmmmmm…… Casey Means is a bio-surveillance operative riding a Trojan Horse into the US government halls of power. Robert F. Kennedy, Jr. is her stable hand. President Trump said he had no idea who she was, but she was the best! Who, exactly, is driving the Trojan Horse? 1BEWARE — Casey Means (Trump Surgeon General Pick) OWNS MED-TECH COMPANIES TO TRACK YOUR BIO DATA!! 2About Us | Commissioned Corps of the U.S. Public Health Service 3The Stargate Project: Trump Touts $500 Billion Bid For AI Dominance 4Levels – Unlock Your Metabolic Health 5MD191266 – Means, Casey, MD – OR License Verification – 05/11/2025 09:36:57 PM 6Oregon Medical Board : Application Requirements and Instructions : Licensing : State of Oregon 7Casey Means – Wikipedia 8metabolism, health – Search Results – PubMed 9metabolism, holistic health – Search Results – PubMed 10Free Guide: Dr. Casey’s Ultimate Food List — Casey Means MD Casey Means, the Bio Metric Surveillance Princess, Must NOT Be Confirmed as Surgeon General. Share This Action Item to Make Sure That Does Not Happen **We need a Surgeon General with clinical experience, perspective, no conflict of interest and a clear voice for real science who serves US, not Big Data – and worse. Casey Means is NOT that person.** RIMA E LAIBOW MD MAY 14, 2025 43 1917 Share Casey Means, the Bio Metric Surveillance Princess, is a pretty young woman who presents a major danger to your privacy and rights. Share Your data is your property, not a treasure trove to be picked over by invasive techno-vultures. But Casey Means thinks that everything about us is up for bio surveillance. And that means that she just happens to agree with the masters of death looking for a way to make you part of the Internet of Bodies. Informed Consent? Let’s make sure that the US Senate understands clearly that Casey Means is not acceptable to the people of the United States. Please send your audience, your contacts, your readers, your advocates, your followers, your supporters, your friends, your colleagues, your family and your listeners toPreventGenocide2030.orgso they can take a moment to send a powerful letter directing the Senate NOT to confirm Casey Means as Surgeon General. Dr Rima Truth Reports Substack is a paywall-free reader-supported publication. Support your health and my work by purchasing discounted professional quality supplements:US.FullScript.com/welcome/RLaibowSubscribed Casey Means as Surgeon General would be a danger to us all. She was nominated on May 7, 2025, following a whirlwind media op which thrust her into the public eye as a “functional medicine practitioner”, making her appointment seem as if it were a victory for natural medicine and health freedom proponents. In fact, it is nothing short of a potential disaster since Means is deeply committed to massive bio digital surveillance. She advocates for having every aspect of our biology, behavior and activity monitored, putting her firmly in the camp of those advocating and advancing the globalist goal of weaving all of us into the Internet of Bodies, which is totally consistent with, and necessary for, Transhumanism and Bio Digital Convergence. She is the CMO ofLevels,1a company she founded, which makes and markets a​n invasive, subdermal continuous glucose surveillance monitor. Its highly suspicious funding history and client base reports, like her sudden media prominence, are ​deeply concerning, but even if she were just an obscure bio digital convergence advocate, she would still be a disastrous choice for the position of Surgeon General. Leave a comment In that office, Means would be the leading, and automatically authoritative, voice of Public Health in the United States and the Commanding General of an armed branch of the US Military, the US Public Health Service Commissioned Corps (USPHSCC). Means’ persona is filled with concerning inconsistencies which support her unsuitability for the post of Surgeon General. For example, Means represents herself as a doctor “practicing functional medicine”. She is, however, unlicensed since her trainee license lapsed at the end of 2019 following her premature withdrawal 6 months before the end of her ENT surgical residency in Oregon and, so far as our research has been able to discern, she does not hold another medical license in that or any other state. Misrepresenting oneself as a licensed medical professional is both a Class A and a Class C felony in Oregon. As Naomi Wolf makes clear in her close and very important examination of Means’ company, history and persona (cited in my article here,(100) Unlicensed Surgeon General Nominee Casey Means Wants to Track Your Bio Markers All the Time. So Does Her Friend, Bobby. She’s Riding a Trojan Horse into DC. What Could Possibly Go Wrong?), Means is not only unqualified to hold the office of Surgeon General, she clearly lacks what we need in the Surgeon General: clinical perspective and experience, personal and professional integrity, lack of conflicts of interest and a deep commitment to essential medical and social values like privacy and Informed Consent. Making America Healthy Again does not include capturing our data as an untapped treasure trove of economic advantage for tech companies and a means of enslavement. But that is precisely what Means and her buddies have in mind. I urge you to sharehttps://PreventGenocide2030.orgwith your everyone you can reach and motivate them to take the Action Item there to flood the Senate with opposition to Means’ confirmation as Surgeon General. As we have seen over the past 5 years, the use of Public Health against the public health is a very real and powerful tool. The Biometric Surveillance Princess will be able to wield it against us in a whole new way if we make the mistake of allowing her to become our Surgeon General. Open Facebook in a new tab Open Twitter in a new tab Open Instagram in a new tab Open LinkedIn in a new tab Open Xing in a new tab Open Pinterest in a new tab Open YouTube in a new tab Open Spotify in a new tab Open GitHub in a new tab Open TikTok in a new tab Open Mastodon in a new tab Feedback? Website Problems? CONTACT US"}