{"id": 823, "name": "Law360", "domain": "law360.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.law360.com/pulse/content/associate-salary-bonus-tracker", "title": "Associate Salary Bonus Tracker", "content": "Advanced Search Search Law360 Law360 Tax Authority Home Federal State & Local International Cannabis Coronavirus Oppertunity Zones Transfer Pricing Tax Authority Map Remote Seller Map Marketplace Facilitator Map Testimonials About Tax Authority Contact Us Sign up for our newsletters Try ourAdvanced Searchfor more refined results California Pulse Connecticut Pulse DC Pulse Delaware Pulse Florida Pulse Georgia Pulse New Jersey Pulse New York Pulse Pennsylvania Pulse Texas Pulse California Pulse **2025 Associate Salary and 2024 Bonus Tracker** ByLaw360 Staff·November 27, 2024, 11:20 AM EST **Want to continue reading?** **Take a 7 Day FREE Trial** Unlock thesebenefitstoday when you sign-up for a FREE 7-day trial: Gain acompetitive edgewithexclusive data visualization toolsto tailor to your practice Stay informedwithdaily newsletters and custom alertsacross 14+ coverage areas relevant to you Streamline your business of law needswith integrated news and research in asingle destination Already have an account?Sign In Now **Find More** Read more on the latest California legal trends in Lexis **Discover** **Related Sections** **Trending Stories** Office Snapshot: Sheppard Mullin's New Digs In Downtown LACalifornia Pulse Retired San Diego Judge Joins JAMSCalifornia Pulse Law Firm Data Breaches Hit New High As Threats EscalateCalifornia Pulse **Got a tip?** © 2025, Portfolio Media, Inc. |About Law360 Pulse|Contact Us|Terms|Privacy Policy **Law360** **Rankings** **National Sections** **Regional Sections** **Site Menu** **Get instant access to the one-stop news source for business lawyers** **Sign up now for free access to this content** Email(NOTE: Free email domains not supported) First Name Last Name Phone Number (###-###-####) PLEASE NOTE:A verification email will be sent to your address before you can access your trial. Password(at least 8 characters required) Confirm Password Job Title Law360 Pulse may contact you in your professional capacity with information about our other products, services and events that we believe may be of interest.You’ll be able to update your communication preferences via the unsubscribe link provided within our communications.We take your privacy seriously. Please see ourPrivacy Policy. **Already have access?** Email: Password:Forgot your password? Remember login Sign In **You must correct or enter the following before you can sign up:** Law360 Pulse takes your privacy seriously. Please see ourPrivacy Policy. **Thank You!**"}