{"id": 482, "name": "Freedom House", "domain": "freedomhouse.org", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://freedomhouse.org/report/freedom-world/2025/uphill-battle-to-safeguard-rights", "title": "Uphill Battle To Safeguard Rights", "content": "NEW: The Effects of the US Foreign Aid Freeze on Freedom House NEW: The Effects of the US Foreign Aid Freeze on Freedom House **Primary Navigation** Freedom Map Countries Issues Perspectives Policy Recommendations **Quicklinks** Perspectives Blog Find A Country Explore The Map Events **Mega Menu** ReportsFreedom in the WorldFreedom on the NetNations in TransitTransnational RepressionElection Watch for the Digital AgeArchives Freedom in the World Freedom on the Net Nations in Transit Transnational Repression Election Watch for the Digital Age Archives Freedom in the World Freedom on the Net Nations in Transit Transnational Repression Election Watch for the Digital Age Archives Our IssuesCountering AuthoritarianismSupporting Defenders for Democratic ChangePromoting a Global Democratic Landscape Countering Authoritarianism Supporting Defenders for Democratic Change Promoting a Global Democratic Landscape Countering Authoritarianism Supporting Defenders for Democratic Change Promoting a Global Democratic Landscape ProgramsFree Them All: The Fred Hiatt Program to Free Political Prisoners Free Them All: The Fred Hiatt Program to Free Political Prisoners Free Them All: The Fred Hiatt Program to Free Political Prisoners Policy RecommendationsTestimony and Advocacy LettersStrengthening US Democracy Testimony and Advocacy Letters Strengthening US Democracy Testimony and Advocacy Letters Strengthening US Democracy Countries Events Perspectives Blog News Releases & StatementsMedia Center Media Center Media Center About UsHistoryBoard and LeadershipOur ExpertsWays to GiveFinancialsCareersContact Us History Board and Leadership Our Experts Ways to Give Financials Careers Contact Us History Board and Leadership Our Experts Ways to Give Financials Careers Contact Us Sign Up for Updates Freedom in the World 2025 Map Policy Recommendations Regional Trends Acknowledgements Methodology Download PDF **The Uphill Battle to Safeguard Rights** Students gather in Dhaka, Bangladesh to protest the police and the ruling party, the Awami League. Nearly 100 people were killed and hundreds more injured as a result of the 2024 antigovernment protests that swept across Bangladesh. (Photo Credit: Suvra Kanti Das/Alamy Live News) Violence and the repression of political opponents during elections, ongoing armed conflicts, and the spread of authoritarian practices contributed to the 19th year of declining freedom. In the year to come, all those who understand the value of political rights and civil liberties must work together in the defense of democracy. **** **Key Findings** Global freedom declined for the 19th consecutive year in 2024.Sixty countries experienced deterioration in their political rights and civil liberties, and only 34 secured improvements. El Salvador, Haiti, Kuwait, and Tunisia were the countries with the largest score declines for the year, while Bangladesh, Bhutan, Sri Lanka, and Syria recorded the largest gains. During an unprecedented year of elections, many contests were marred by violence and authoritarian efforts to restrict voters’ choices.In over 40 percent of the countries and territories that held national elections in 2024, candidates were targeted with assassination attempts or assaults, polling places were attacked, or postelection protests were suppressed with disproportionate force. Elections in authoritarian countries were manipulated to prevent genuine opposition candidates from participating. Conflicts spread instability and thwarted democratic progress around the world.Ongoing civil wars and interstate conflict as well as violence perpetrated by armed militias, mercenaries, and criminal organizations undermined security and prevented the exercise of fundamental rights, making the world not only less safe but also less free in 2024. Positive developments demonstrated the potential for democratic breakthroughs.Despite the overall global decline in freedom, bright spots emerged around the world as a result of competitive elections or following the collapse of long-standing authoritarian regimes. New governments will now face the difficult task of building and strengthening democratic institutions while also protecting individual rights. Democratic solidarity will be crucial in the coming year.Global freedom faces serious challenges in 2025, including security threats from multiple armed conflicts, deepening repression in both entrenched and emerging autocracies, and democratically elected leaders who seek to advance their goals by overriding institutional checks on their power. It is in the vital interest of all those who believe in democracy to invest in democratic institutions at home, call out attacks on rights abroad, work together to promote lasting peace, and support human rights defenders wherever they operate. Only sustained and coordinated action can reverse the nearly two decades of decline in global freedom and ensure that more countries enjoy security, prosperity, and all the other benefits of democratic rule. **** **The Year in Brief** Freedom declined around the world for the 19th consecutive year in 2024. People experienced deterioration in their political rights and civil liberties in 60 countries, and secured improvements in only 34 countries. In settings where conditions worsened, key factors driving the degradation in rights and liberties included violence and the repression of political opponents during elections, ongoing armed conflicts, and the spread of authoritarian practices. Global elections brought mixed results for freedom Violence emerged as a major theme during the year of global elections, affecting 27 of the 66 countries and territories where national voting took place in 2024. The most common form of election violence was attacks on candidates, which occurred in 20 countries. In Mexico and South Africa, the violence was perpetrated by criminal groups trying to wield political influence and control territory. In France, Japan, South Korea, the United Kingdom, and the United States, among others, extremism or partisan grievances motivated physical assaults on individuals campaigning for office. Voters too were exposed directly to violence: voting places were attacked during elections in 14 countries and territories, making it dangerous or impossible for people to cast their ballots. Violence during election-related protests was widespread, taking place in 11 countries, including Georgia and Mozambique, where security forces used disproportionate force against protesters. While elections in countries rated Free were largely competitive and conducted fairly, voters in authoritarian countries and territories had little genuine choice. From Azerbaijan and Algeria to Russia and Rwanda, authoritarian incumbents had their political opponents arrested, imprisoned, or disqualified to eliminate even the slightest possibility of defeat. In Tunisia, which received one of the year’s two largest score declines, President Kaïs Saïed oversaw an escalating crackdown that included arbitrary prosecutions of journalists, trade union leaders, and other perceived critics of his regime. He was reelected in October after the regime-controlled electoral commission disqualified most of his opponents and refused to reverse its decision even after being ordered to do so by a court. Attempts to ban opposition candidates did not always go according to plan for autocrats. In Venezuela, where freedoms have declined precipitously over the last 12 years under Nicolás Maduro, authorities disqualified the country’s most popular opposition leader, María Corina Machado, from July’s presidential poll and threatened those who participated in an opposition primary with criminal prosecution. After the disqualification, Machado encouraged her supporters to rally around another, lesser-known opposition candidate: Edmundo Gonzáles Urrutia. On election night, the National Electoral Council declared Maduro the winner without publishing any supporting evidence. Unable to quash the opposition before and during the election, the regime used armed gangs and security forces to identify, intimidate, and arbitrarily arrest thousands of citizens who rejected the baseless official results. Despite these negative trends, which drove scores down globally, a handful of elections produced improvements in rights. Bhutan, which joined Senegal in moving from Partly Free to Free status in 2024, held elections that helped consolidate a long democratic reform process whereby political power and influence has shifted from the king to an elected parliament. The return of elections to Indian Kashmir, which is assessed separately from India, resulted in a status change from Not Free to Partly Free. The long-delayed elections did not fully undo the damage to rights caused by the Indian government’s 2019 reorganization of the territory and revocation of its special autonomous status, but they did restore some political representation for the local population, which had been under direct federal rule for over five years. Another territory, Somaliland, also had a large score improvement because authorities finally held the long-delayed presidential election, which was both peaceful and competitive. Jordan improved from Not Free to Partly Free. Its September elections featured the implementation of reforms meant to increase the representation of political parties in the kingdom’s parliament. Ongoing armed conflicts compromised both safety and rights Years-long armed conflicts—including civil wars, clashes between states, and fighting that involved nonstate armed groups—had a detrimental impact on security and freedom and formed the second major theme of 2024. By the end of the year, 20 percent of the world’s countries and territories scored a 0 out of 4 onFreedom in the World’s indicator for physical security and freedom from the illegitimate use of force. Beyond their direct impact on local civilian populations, these conflicts pose a clear threat to the safety and sovereignty of democratic nations specifically and all nations in general. They fuel the spread of illicit trades in arms and other contraband, provide safe havens for criminal organizations that target foreigners online, create opportunities for the growth of terrorist and other extremist groups, disrupt global shipping and commerce, and—in the worst cases—enable authoritarian regimes to seize territory from or outright destroy democratic governments. For example, the civil war in Myanmar continued to take a deadly toll in 2024 after years of fighting. Originally sparked by a military coup against an elected government in 2021, the conflict has resulted in thousands of civilian deaths, the arrests of tens of thousands of people, and the displacement of 2.7 million others, according to the United Nations. In February 2024, the military junta began forced conscription of men and women in an effort to bolster the army’s ranks, which led many young people to attempt to flee the country. Targeting the most vulnerable, the military reportedly abducted as many as 1,000 members of the Rohingya ethnic minority group during nighttime raids in Rakhine State, shortly after forced conscription was introduced. The Rohingya have long been persecuted by Myanmar’s government and were stripped of citizenship in 1982; hundreds of thousands fled the country to escape a wave of military-led massacres that began in 2017. As the war drags on, some of the belligerents have an incentive to raise revenue from illicit sources, hosting transnational criminal groups that manufacture and export synthetic drugs or operate sprawling cybercrime centers, which undermines the security of other countries inside and outside the region. Sudan’s civil war also ground on during the year. Mass displacement and targeted attacks on media workers, women, and ethnic minorities caused egregious suffering and degraded freedoms even further in the country, making it one of the least free places in the world. More than 26,000 people have died as a direct result of the ongoing conflict and over half of the population faces extreme food insecurity. As many as eight million have been displaced internally and externally, with many fleeing to already overcrowded refugee camps in Chad, Ethiopia, and South Sudan. Both sides in the fighting have received support from foreign governments, which has weakened the efficacy of international sanctions, stalled peace talks, and stimulated the illegal trading of weapons and natural resources. The Kremlin’s war on Ukraine continued, and for the first time featured the deployment of thousands of troops sent by the North Korean regime to aid the Russian military. Within the Russian-occupied portions of Ukraine, Moscow’s efforts to eliminate Ukrainian identity intensified. The campaign included forcing residents to adopt Russian passports and, with the help of Alyaksandr Lukashenka’s regime in Belarus, removing and indoctrinating Ukrainian children in a bid to “Russify” them and even train them for Russian military service. The war in the Gaza Strip passed the one-year mark in 2024. Following the deadly October 7, 2023, terrorist attack on Israel by Hamas, the Israeli military undertook a campaign in Gaza that killed and forcibly displaced Palestinians on a massive scale, systematically obstructed the delivery of humanitarian aid, and destroyed most farmland and life-sustaining civilian infrastructure. Armed violence not only exacerbated suffering but also obliterated the few rights and liberties that had remained to residents of the territory. As a result of this extreme pressure on the Palestinian population, the Gaza Strip, which is assessed separately from both Israel and the Israeli-occupied West Bank, joined the small group of settings that receive score downgrades for deliberate actions by a government or occupying power that forcibly change the ethnic composition of the country or territory through tactics including violence, displacement, and resettlement. The Israel-Hamas conflict also reverberated across the Middle East, involving Hamas allies in Iran, Iraq, Lebanon, Syria, and Yemen. Hezbollah began launching rockets from Lebanon into Israel in support of Hamas shortly after the October 2023 attack, forcing some 60,000 Israelis to flee their homes in the north of the country. The Israeli military responded by increasing air strikes on Lebanon and eventually mounted a ground invasion in October 2024, during which thousands of Lebanese people were killed or wounded and 1.2 million others were displaced. Some violence continued at year’s end despite a cease-fire agreement in late November. Repression deepened and spread Efforts by authoritarian governments to extinguish opposition to their rule drove four countries to decline from Partly Free to Not Free in 2024. In Thailand, the Constitutional Court disbanded the Move Forward Party, an opposition group that won the most votes in the 2023 parliamentary elections, and separately toppled a prime minister from the second-ranked party. The country’s status was downgraded as a result of these actions, which amounted to a reassertion of power by the kingdom’s unelected establishment following voters’ endorsement of democratic forces a year earlier. A similar situation unfolded in Kuwait, where the emir, Sheikh Meshaal al-Ahmad al-Jaber al-Sabah, responded to the election of an opposition-controlled parliament in April by indefinitely dissolving the body and ruling alone through his appointed cabinet, eliminating the people’s chosen representatives from government. Both countries declined from Partly Free to Not Free. Niger, where the elected government was ousted by a military junta in 2023, declined to Not Free because General Abdourahamane Tchiani’s regime dissolved local councils, suspended media outlets, and denied due process to supporters of the deposed civilian leadership. Tanzania accounted for the fourth decline from Partly Free to Not Free, which came after years of deterioration in rights and liberties under President Samia Suluhu Hassan. In 2024, Tanzanian authorities used mass detention against protesters and continued efforts to forcibly evict Indigenous Maasai communities from a planned game reserve. These negative status changes were in keeping with a broader trend that has affectedFreedom in the Worlddata for over a decade: further attacks on rights, especially freedom of expression and the rule of law, in countries where people already lacked access to many fundamental freedoms. Of the civil liberties tracked byFreedom in the World, freedom of expression has declined the most over the last 19 years. The number of countries and territories where the indicator for freedom of the media is scored at 0 out of 4—meaning there is virtually no space for independent media to operate—has almost tripled between 2005 and 2024, rising from 13 to 34. Last year, attacks on the media in the form of censorship, arrests and imprisonment of journalists, physical and legal harassment, or violence were recorded in over 120 countries and territories. In Hong Kong, where Beijing has tightened its control in recent years, most acts of perceived dissent, including independent journalism, have been criminalized under the repressive National Security Law (NSL). The NSL trial of Jimmy Lai, former publisher of theApple Daily, for reports on the 2019 prodemocracy protest movement continued last year. Forty-five prodemocracy activists were also sentenced for conspiracy to commit subversion under the NSL, having helped to organize a semiformal opposition primary for legislative candidates in 2020. A foreign judge who resigned from Hong Kong’s Court of Final Appeal noted that local judges are under immense pressure to conform to the government’s repressive goals, which has “profoundly compromised” the rule of law in the territory. One striking example of the way in which two harmful phenomena—attacks on the media and transnational repression—are increasingly intersecting came from Vietnam, where a Hanoi court sentenced blogger Duong Van Thai to 12 years in prison in October for social media posts and videos that criticized the Communist Party government. He had become a victim of transnational repression in 2023, when he was kidnapped from Thailand and returned to Vietnam to face charges. Like the silencing of media workers, pressure on members of the legal profession is an increasingly common authoritarian tactic around the globe. According toFreedom in the Worlddata, judges, prosecutors, and defense lawyers have been imprisoned, detained, or charged for politically motivated reasons in at least 78 countries over the last decade. In 2024, some of the most extreme cases of such repression occurred in Russia and Belarus. In Russia, criminal trials began for the lawyers who had represented the slain opposition leader Aleksey Navalny and the journalist Ivan Safronov. In Belarus, lawyers representing political prisoners became prisoners themselves, charged with “extremism” based solely on their work. To recognize that authoritarianism has deepened in many countries is not to say that all hope is lost. The sudden fall of Syrian President Bashar al-Assad in December 2024, more than 13 years after he touched off a civil war by brutally crushing peaceful prodemocracy protests, reminded the world that despotic control is often more fragile than it appears. Syria’s score had been among the lowest in the world, but it was tied for the second-largest improvement among countries last year as political prisoners were freed en masse and the regime’s restrictions on freedoms of movement and assembly were eased. While there are still many obstacles to a democratic future for the Syrian people, they now have an opportunity for progress that seemed unimaginable just a year earlier. Challenges on the horizon Three issues will likely exert an important influence on global freedom in 2025 and beyond. First, countries where new leaders emerged from contested elections last year, as in Senegal and Sri Lanka, or who took office after the collapse of authoritarian regimes, as in Bangladesh, may prove to be bright spots for democracy. But much will depend on how these governments pursue reforms, and whether they ensure that individual freedoms and the rule of law are protected and expanded in the process. Second, among a small but growing group of democracies, including Slovakia and Mexico, elected leaders are trying to undermine institutions that are meant to serve as a check on their powers, such as the media, anticorruption bodies, and the judiciary. Over time, these attacks have the potential to erode political rights and civil liberties. Finally, from Sudan to Haiti and Honduras, people are living amid extreme violence perpetrated by nonstate armed groups. These lawless forces are not only imperiling physical safety, but also undercutting freedom and serving authoritarian interests. A plan to deal with such groups will have to be part of any domestic or international effort to establish peace and security in the world’s most dangerous places. A large number of people gather in Umayyad Square in Damascus, Syria to celebrate the fall of the Bashar al-Assad regime. (Photo Credit: Juma Muhammad/Alamy Live News) **New Governments Bring New Hope** Despite the continued global decline in freedom, a number of countries proved to be democratic bright spots last year, experiencing a significant opening for political change or positive momentum for reforms. Beyond providing a much-needed ray of hope, developments in such countries can offer useful lessons on how to initiate and sustain democratic progress. Much of the reporting on these bright spots simply describes the competitive elections or other events that unseated authoritarian or illiberal leaders. But a change in leadership is only the beginning. As new governments embark on promised reforms that have the potential to meaningfully expand freedom and strengthen democratic institutions, they must also confront long-standing socioeconomic problems and the entrenched remnants of the former regimes. Experience shows that while lasting democratic improvements are possible, the process can be extremely challenging. Bright spots of 2024 Political reform in Bangladesh, which emerged abruptly from a decade and a half of deepening repression under Prime Minister Sheikh Hasina, will be a daunting task. Unlike in the world’s other bright spots in 2024, change in Bangladesh arrived as a result of mass protests rather than an election. In July, students launched peaceful demonstrations against an unpopular system of quotas for government jobs. Police and security services responded with disproportionate force, leading to the deaths of more than 1,500 people. After the protest movement intensified and leaders of the military and police refused to continue the lethal crackdown, Hasina resigned and fled the country. An interim government, led by economist and Nobel Peace Prize winner Muhammad Yunus, was established shortly thereafter. The ouster of Hasina’s Awami League government swiftly eased long-standing state pressure on other political parties, the media, labor unions, judges, university students, and faculty members, causing Bangladesh to tie with Bhutan for the year’s largest score improvement. But much remains to be done. The new government’s agenda includes ambitious political, economic, and legal reforms. It aims to amend or redraft the constitution, ensure accountability for last year’s violence as well as other human rights abuses, increase judicial independence, and reestablish anticorruption institutions. The government is also facing demands to hold elections, reduce emerging religious tensions, stabilize the economy, and decide what to do about Hasina, who is now decrying the country’s political situation from neighboring India. In Sri Lanka, newly elected President Anura Kumara Dissanayake, who campaigned on an anticorruption platform, will have to address the state’s heavy foreign debt burden and deep economic inequality. Constitutional reforms intended to shift power from the presidency to the parliament are also on the new government’s agenda. These reforms have the potential to reinforce the improvements in political participation already seen during the country’s peaceful and competitive presidential and parliamentary elections. The contests, the first since protests toppled the last elected government amid a severe economic crisis in 2022, were a remarkable step forward from previous votes, which had been marred by problems including violence and intimidation. A record 38 candidates ran in the presidential election, which for the first time featured regulations on campaign spending, a serious concern in a country plagued by corruption. A voter shows their painted finger near a polling station in Colombo, Sri Lanka after voting in the 2024 elections. (Photo Credit: Ruwan Walpola/Pacific Press/Alamy Live News) Senegal is poised to potentially reverse an erosion of rights overseen by former President Macky Sall. The 2024 presidential election represented an especially impressive victory for democratic norms and helped to elevate the country from Partly Free to Free—a status it had lost in the 2019 edition of this report. The voting took place in March despite outgoing President Sall’s attempts to delay balloting and his pattern of targeting opponents with politically motivated criminal prosecutions. In the end, the Constitutional Court, supported by popular protests and other democratic forces, ensured that the election proceeded. Opposition candidate Bassirou Diomaye Faye was elected president a mere 10 days after being released from prison. Faye’s political party then won a majority in snap parliamentary elections in November, paving the way for his reform agenda. One promised reform would restore balance among the branches of government and reduce the powers of the presidency. This is especially important given Senegal’s history of presidents attempting to remain in office after their constitutionally limited terms have expired. But the new leadership must also deal with other urgent issues, including high youth unemployment and the continued underrepresentation of women in politics. Botswana’s October general elections marked a historic change for the country, as it brought the first defeat of the Botswana Democratic Party (BDP) since the country gained independence in 1966. While elections in Botswana have typically been free and fair, the peaceful transfer of power between rival political parties was an important achievement for democracy in Southern Africa. Botswana’s new leaders will face economic and political challenges, including rising unemployment among young people and dwindling profits from diamond exports. Another pressing issue, after decades of rule by one party, is the need to limit the influence of patronage networks and increase transparency within public procurement procedures. Lessons learned The experiences of other newly elected reformist governments may hold lessons for those that rose to power in 2024. In 2023, despite antidemocratic headwinds, elections in Guatemala and Poland resulted in transfers of power from illiberal incumbents to opposition figures who espoused explicitly democratic goals. Some progress has been made in the year since, but reform continues to be inhibited by vestiges of the former governments and powerful elites who have benefited from corruption, suggesting that while damage to democratic institutions accumulates quickly, repair efforts can be slow. In Guatemala, PresidentBernardo Arévalo, who faced sustained pressure from incumbent authorities while campaigning and even after winning the election in 2023, has tried to make good on his promises to combat corruption since taking office in January 2024. To date, his government has filed over 169 complaints of corruption with prosecutors and worked to increase government transparency by establishing the National Commission Against Corruption. Arévalo has also tried to lead by example, making a public declaration of his assets in July and dismissing members of his own government for misuse of state resources. In addition, his administration has been able to attract new economic investment in the country. Arévalo’s agenda has faced major obstacles. His party, Movimiento Semilla, controls only 23 of 160 seats in Congress, hampering legislative progress. After surviving one politically motivated attempt to suspend it in 2023, the party faced a similar effort at the end of 2024. The greatest challenge to the government has come from the public prosecutor’s office, headed by Attorney General María Consuelo Porras, which has hindered anticorruption investigations, targeted members of Semilla with arrest, opened new criminal investigations into Arévalo himself, and continued to prosecute judges and human rights defenders who worked on corruption cases. Under current law, Arévalo is prohibited from unilaterally dismissing Porras, who is subject to US and European Union (EU) sanctions for obstructing justice. Although he made repeated proposals to change the law in 2024, these have been ignored by Congress. Poland’s parliamentary elections in October 2023 were a pivotal moment for the country’s political trajectory. Voter turnout was the highest since 1989, and the outcome, in which a centrist opposition coalition defeated the incumbent right-wing populist Law and Justice (PiS) party, was hailed by democracy scholars as an opportunity for recovery after eight years of illiberal rule and democratic erosion. But the postelection path to reform has been bumpy. The new government, headed by Prime Minister Donald Tusk, made organizational and personnel changes at three public media outlets. The moves were meant to counteract what researchers and civil society groups have characterized as the propagandistic use of these networks to promote the interests of PiS and denigrate its political opponents. However, the government’s decisions drew objections from President Andrzej Duda, a PiS ally, and prompted a legal review at the Constitutional Tribunal, as they were seen by some as an inappropriate application of powers under a law on commercial ownership to reorganize public broadcasters. The case was ultimately resolved in the government’s favor, and the reforms were described in positive terms in a 2024 report on the rule of law from the European Commission. The government is also pursuing much-needed legislation to protect editorial independence and reforms to media regulations, but these may face similar political and legal resistance from PiS and its allies within state institutions. A presidential election is scheduled for 2025, and its results could either facilitate reform efforts or stall them further. **Elected Leaders Are Undermining Democratic Institutions** Late last year, South Korean President Yoon Suk-yeol declared martial law in an attempt to circumvent the opposition-controlled parliament and suppress its investigations of his wife and cabinet, throwing the country into a dramatic constitutional crisis. The move highlighted one of the biggest threats faced by democracies around the world: elected leaders who attack democratic institutions. Protesters with placards that say “Insurrection, Yoon Suk-yeol, Impeachment” gather outside the National Assembly building in Seoul, South Korea (Photo Credit: Viola Kam/Sipa USA/ Alamy Live News) The declaration of martial law was quickly nullified in South Korea, as legislators, civil society, and ordinary people came together to defend their freedoms. But other countries have not been as lucky. Elected leaders in democracies are increasingly seeking to undermine checks on their power, focusing their assaults on the media, anticorruption authorities, and the courts. These attacks endanger both democracy and basic freedoms. Persecuting the media Independent media are increasingly coming under pressure in Free and Partly Free countries. Before President Yoon tried to seize control by declaring martial law, South Korean authorities had routinely targeted individual journalists and news organizations that produced critical or embarrassing coverage of Yoon’s administration, launching civil and criminal defamation investigations and police raids against them. Rather than imprisoning or killing journalists, powerful figures within democracies have employed more nuanced forms of control and intimidation, including threats, smear campaigns, and legal harassment that hinder the ability of journalists to do their work. Serbia under the leadership of President Aleksandar Vučić and his Serbian Progressive Party (SNS) provides an informative example of the ways in which elected leaders have undermined the media. The country declined from Free to Partly Free in the 2019 edition ofFreedom in the Worldand has lost a further 11 points since then, as rights and liberties have steadily deteriorated. Attacks on journalists and tightening control of the media environment have been among the most prominent features of this erosion. Investigative journalists have faced smear campaigns, punitive tax inspections, threats from leading politicians, and arrests. Authorities have used their control over regulation and licensing to aid progovernment media outlets. A lack of transparency in media ownership, indirect government subsidies for media, and the politicized allocation of advertising have also helped progovernment media dominate the market. More recently, members of the ruling party have used strategic lawsuits against public participation (SLAPPs) to intimidate independent outlets and journalists. All of this manipulation has created an environment in which positive coverage of Vučić and the SNS swamps the information landscape, especially ahead of elections, and critical voices are increasingly silenced. Unleashing corruption Corruption is an incredibly powerful antidemocratic force. In the most extreme cases, corruption has hollowed out the state and public services, and governments exist to distribute ill-gotten wealth among a small group of cronies. In democracies, while corruption scandals can be shocking, the revelation and eventual punishment of graft usually signals that safeguards might be working well. However, a growing number of leaders in democracies have sought to dismantle anticorruption mechanisms and roll back related laws, enabling the diversion of public resources for private gain. Nowhere was this trend more apparent in 2024 than in Slovakia, where the government of Prime Minister Robert Fico and his Direction–Slovak Social Democracy (Smer) party undermined anticorruption institutions that had previously investigated Fico and prosecuted his allies. A series of legislative changes—which were adopted outside the regular process on a shortened timeline that allowed for less debate or consultation with stakeholders—reduced protections for whistleblowers, cut sentences and reduced the statute of limitations for financial crimes, and abolished the Special Prosecutor’s Office. The impact of many of these reforms has been immediate. Citing the newly truncated statute of limitations, a prosecutor dropped charges against the deputy speaker of parliament, Peter Žiga, a former Smer member who was accused of bribing a Supreme Court judge. The interior minister suspended several police officers who had been investigating high-profile corruption cases linked to Smer members, despite the fact that the officers were legally protected as whistleblowers. The government also disbanded the National Crime Agency, which examined cases of corruption and terrorism and had investigated Fico in the past. Subduing the rule of law The rule of law is a fundamental feature of democracy, ensuring that independent courts and trained legal professionals can protect individual rights and serve as a check on the actions of political authorities. But elected leaders have increasingly used three key tactics to weaken judicial independence: taking control of how judges are disciplined, changing the remit of judicial oversight, and controlling court appointments. In 2024, Mexican lawmakers adopted a major constitutional reform that replaced judicial appointments with direct elections, reduced the number and tenure of Supreme Court judges, and replaced the Federal Judiciary Council with a new administrative body that will oversee disciplinary matters. The five members of the new Judicial Disciplinary Tribunal will be elected by popular vote, and they will have broad powers to investigate, dismiss, or impeach judges, including those on the Supreme Court. The decisions of the tribunal will be final and not subject to appeal. Legal scholars have argued that the popular election of members of the disciplinary tribunal, from a list of candidates approved by the executive and legislative branches, could compromise the independence of judges by subjecting them to partisan oversight and thus make it more difficult for judges to render decisions against the government. The reform was opposed by tens of thousands of Mexico’s legal professionals as well as the United Nations’ special rapporteur on the independence of judges and lawyers. Limiting the jurisdiction of the courts remains a common method used by political forces to weaken judicial checks on their authority. In 2023, Israeli Prime Minister Benjamin Netanyahu’s government pursued legal reforms that, among other things, would have prevented the country’s Supreme Court from using the standard of “reasonableness” to assess government decisions. In the past, the Supreme Court had used this standard to reverse government policies and to prevent Netanyahu from appointing a minister with a criminal conviction. The Israeli parliament adopted a bill that eliminated this form of review in July 2023, despite persistent mass protests against the government’s judicial agenda, but the Supreme Court itself struck down the legislation in January 2024. Having failed to circumscribe the power of the courts by getting rid of the reasonableness standard, the Israeli government tried to employ one of the other common tactics for undermining the independence of the judiciary: controlling appointments. As of January 2025, Justice Minister Yariv Levin had stalled the appointment of a new president of the Supreme Court for over a year. The president of the Supreme Court is chosen from among the members of the court and appointed by the president of Israel on the recommendation of the Judicial Selection Committee, over which Levin exercises statutory authority. Traditionally, the most senior judge serving on the court is appointed. However, Levin has tried to change the composition of the committee, in which a majority of seats are filled by Supreme Court justices and members of the Israel Bar Association. Failing that, Levin simply refused to convene the committee, leaving the Supreme Court without a permanent president since September 2023. These efforts prevented the current most senior justice, who has been critical of the government, from becoming the new president of the Supreme Court at a time when many of the government’s decisions about the conduct of the war in the Gaza Strip could come under judicial review, and when Netanyahu himself faced corruption charges. In India, the government of Prime Minister Narendra Modi has similarly sought to gain more influence over judicial appointments. In 2014, it tried to replace the Collegium system, whereby new judges are nominated by their colleagues, with a new commission that would include members of the government in addition to sitting judges. The Supreme Court struck down the law in 2015, but since then the Modi government has delayed appointments and rejected nominations made by the Collegium without explanation. Judicial vacancies have increased as a result, contributing to a backlog of cases at every level of the court system. The 34-seat Supreme Court, which hears cases in small panels, now has seven vacancies and over 70,000 pending cases. For the time being, courts in Israel and India have continued to push back against government overreach, but they remain vulnerable, and political rights and civil liberties have deteriorated substantially in both countries over the past 10 years. Checks and balances at risk Democratic systems protect individual rights and liberties because they operate with checks and balances, meaning those in positions of power, including elected leaders, are constrained by legislatures, independent agencies, the courts, and nongovernmental institutions like a free press. Such constraints prevent both deliberate abuse and inadvertent error, ensuring that major decisions and policies can be properly reviewed both before and after implementation. But as the world has increasingly witnessed, these checks and balances can be weakened over time, threatening fundamental democratic norms and raising the risk of harmful outcomes for ordinary people. Leaders who harness political populism are especially prone to disregarding or undermining institutional checks as they seek to deliver quickly on their promises to upend the status quo. One pivotal country to watch will be the United States. The country held free, fair, and credible elections in 2024, and its score improved because, unlike in the two previous presidential contests, there were no significant efforts to interfere with, question, or overturn the outcome. As with elections in other democracies during the year, however, the US campaign was tarnished by threats against candidates in both major parties, as well as some election workers. Donald Trump, the Republican Party nominee and eventual winner of the vote, was targeted in two assassination attempts, one of which injured him and killed a rallygoer in July. During the campaign, Trump made a number of promises with regard to domestic and foreign policy that could substantially impact freedoms at home and abroad. He warned that he would prosecute his political opponents and reduce the independence of institutions—including federal law enforcement agencies, the civil service, and the media—that have traditionally protected the rule of law, ensured transparency, and served as beneficial checks on presidential discretion. Trump also expressed an interest in quickly ending ongoing foreign wars, which could help bring peace and security to affected regions of the world. It is important, however, that any solutions uphold national sovereignty, protect and expand democratic progress, and strengthen respect for fundamental rights. Both democratic and autocratic countries look to the United States to justify their own actions, so the course charted by President Trump over the next four years will have global reverberations. **Armed Nonstate Actors Are Contributing to a Less Free, Less Safe World** Just as the world has become less free over the last 19 years, it has also become less safe. According to this year’sFreedom in the Worlddata, a total of 41 countries and territories received a score of 0 out of 4 on the report’s indicator for physical security, meaning people lacked even minimal protections from the violence of war, insurgency, crime, and police brutality. In 2005, the number of such countries and territories was 25. Nonstate armed groups—which include militias, terrorist groups, criminal organizations, and mercenaries—are responsible for an increasing share of this lawless violence. Nonstate armed groups are partly or fully external to state or intergovernmental military structures, and they use violence to achieve political, ideological, or economic goals. They degrade not only general safety and security, but also freedom of movement, property rights, and the right to equal treatment for different ethnic and religious communities. When nonstate armed groups infiltrate state institutions, they erode elected civilian rule, anticorruption mechanisms, due process, and judicial independence. While they can wield considerable power in practice, they lack legal standing in the international system and are largely unrecognized by the world’s governments. Complicating matters even further, nonstate armed groups are often deeply intertwined with the populations under their control and take part in violence in both densely populated areas and across national borders. The involvement of these groups in conflicts and crises around the world has narrowed the range of viable domestic and international policy solutions to armed violence. In Africa over the past year, nonstate armed groups fueled Sudan’s brutal civil war, while Russian state-backed mercenary forces used violence to prop up authoritarian regimes in the Sahel. Across Latin America and the Caribbean, criminal organizations perpetuated devastating violence while protecting their stakes in the illegal drug trade and other rackets. In Haiti, for example, heavily armed gangs contributed to the collapse of the country’s state institutions. In Ecuador and Mexico, criminal groups attacked politicians and disrupted democratic processes. Leaders in some countries, including El Salvador and Honduras, adopted repressive measures in response to gang-related violence, further damaging the rights of civilians. Challenging international efforts to restore freedom and security in the Sahel Nonstate armed groups—including mercenaries, extremist militias, and paramilitary groups, each with a different background and goals—played a prominent part in gutting physical security and perpetuating violence across the Sahel region of Africa in 2024. Their involvement has simultaneously propped up military regimes, weakened states’ control over their own territories, and frustrated efforts by the international community to restore peace and elected civilian rule. Several coups in recent years have fueled instability in the region, with military juntas often citing civilian governments’ failure to suppress jihadist insurgencies. These conditions have been exacerbated by Russian state-backed mercenary groups, such as Africa Corps (a successor of Wagner Group), which peddle brutality and regime defense to autocrats and military leaders in the region under the guise of counterterrorism. In 2024, Russian mercenaries supported government security forces in the Central African Republic as they carried out lethal attacks against the country’s Muslim and ethnic Fulani population in an attempt to suppress local rebel groups. In return for its services, the government of President Faustin-Archange Touadéra has allowed companies affiliated with Africa Corps to dominate the country’s gold mines. Even as these mercenaries have bolstered harmful authoritarian practices, they have been decidedly ineffective in their efforts to curb violent insurgencies. In Mali, Russian mercenaries working with Malian security forces suffered major setbacks during the year, and the security situation continued to deteriorate as Islamist militant groups carried out attacks in the country’s northern and central areas. Niger moved from Partly Free to Not Free in 2024, as insurgent activity intensified in the southwest despite a 2023 military coup that was meant to address insecurity. The arrival of Russian mercenaries in April aided Niger’s junta in consolidating its hold on power and contributed to the closure of a US counterterrorism facility in the country. Conflicts involving nonstate armed groups are exceptionally detrimental to human rights and freedoms, and they are also extremely difficult for the international community to address. In Sudan, the civil war between the regular Sudanese Armed Forces and the rebellious paramilitary Rapid Support Forces (RSF), which began in April 2023, has led to a catastrophic humanitarian crisis. Nearly 20 percent of the population has been internally displaced, and more than 26,000 people have been killed. The conflict has been characterized by shocking levels of violence on both sides, though the RSF has been widely condemned for engaging in systematic sexual violence, forced disappearances, and atrocities against non-Arab ethnic groups in the Darfur region especially. Efforts by the United States, Saudi Arabia, and Switzerland to broker a cease-fire in Sudan have been unsuccessful. The effectiveness of US sanctions against the RSF has been limited because the United Arab Emirates, which has an interest in Sudan’s mineral wealth and other material assets, continues to provide the paramilitary group with financial support and weaponry. These failures illustrate the challenges associated with addressing violent conflicts involving nonstate armed actors: the groups typically operate in defiance of national and international law, have no formal diplomatic representation, pursue murky or extreme political goals, and have access to illicit economies or clandestine support from external authoritarian powers. Organized crime in Latin America and the Caribbean In many parts of Latin America and the Caribbean, countries are facing a triple threat to freedom: violence caused by criminal organizations, the corruption and hollowing out of democratic institutions by these groups, and the normalization of repressive tactics as states attempt to respond. Some criminal groups have also managed to develop or join much larger and more sophisticated transnational networks that not only expand their illicit activities across borders but also pose further challenges to any localized efforts to contain them. Criminal violence continued to drag down political rights and civil liberties in Haiti, which experienced one of the year’s largest score declines. Escalating attacks by a complex array of heavily armed gangs have driven the country into a state of political disorder and severely undermined the basic safety of civilians. In April, after gangs swept through the capital and forced the closure of its airport, Prime Minister Ariel Henry resigned in favor of an internationally backed transitional council, which has yet to restore control. There are some 20 different gangs in Port-au-Prince alone, and they hold around 85 percent of the city, according to the United Nations. In December, nearly 200 people were killed in a vicious gang attack that overwhelmingly targeted elderly people who were believed to be Vodou practitioners. Over the course of 2024, more than 4,500 people were killed and over 700,000 were displaced as a direct result of gang-related violence. Efforts by the international community to alleviate the suffering of ordinary residents have faced significant challenges. Past international peacekeeping interventions in Haiti have at times led to increased harms for Haitians without providing a lasting solution to gang-related violence. A mission that ended in 2017 was marred by allegations of sexual assault at the hands of peacekeepers, who also inadvertently caused a cholera outbreak that killed some 10,000 Haitians. More recently, a US-led resolution to create a new UN peacekeeping mission faced pushback at the UN Security Council. A more limited police mission led by Kenya is currently operating in the country, but it has lacked sufficient funding and is widely viewed as ineffective. The situation in Haiti, where armed gangs have contributed to near-total state collapse, is an extreme case. Yet elsewhere in the region, criminal groups are also chipping away at the integrity of democratic institutions. In Mexico, criminal organizations and cartels have managed to secure relative impunity by co-opting law enforcement agencies and government officials. In some instances, they have financed political campaigns or galvanized voter support in exchange for access to state resources or protection from prosecution. These groups also regularly use violence to eliminate political threats to their interests, and as a result, the 2024 general elections featured historically high levels of political violence. In Ecuador, organized crime has become deeply entrenched in the country’s political and legal system, including its judiciary, complicating efforts to quell recent spikes in criminal violence. Investigations by the attorney general in early 2024 found massive levels of collusion between public servants, including those in the justice department, and criminal gangs. A study by the Ecuadorian Organized Crime Observatory found that only 10 percent of narcotrafficking investigations resulted in convictions between 2019 and 2022. While remedial action is clearly needed, many leaders in the region have failed to strengthen safeguards against government corruption and collusion, instead pursuing broad crackdowns on gang-related violence that have led to further deterioration in citizens’ rights and liberties. In Ecuador, President Daniel Noboa declared a state of “internal armed conflict” in January, applying military means and special authorities in an effort to stem rising criminal violence. In June, Honduran President Xiomara Castro announced sweeping measures to reduce organized crime, including terrorist designations for criminal groups and collective trials for gang members. Many of these approaches were inspired by the example of President Nayib Bukele of El Salvador, whose heavy-handed strategy to crush that country’s gangs has become widely popular both there and elsewhere in the region despite its serious implications for human rights and the rule of law. While the official homicide rate in El Salvador has dropped significantly since President Bukele came to power in 2019, increased security has come at the cost of many basic rights and freedoms in the country. El Salvador has experienced the third-largest score decline globally over the last 10 years. The rule of law has been demolished as authorities, under a “state of exception,” have carried out extrajudicial killings and jailed tens of thousands of people without due process. Bukele has also consolidated power by purging the judiciary, installing loyalists in the highest courts, and changing electoral rules to favor his political party. Manipulated elections in February 2024 further strengthened his hold on power, and as a result, El Salvador recorded the year’s second-largest decline in freedom globally. Violence by nonstate armed groups continues to pose a major threat to safety and freedom around the world, yet few of the solutions implemented to date have been able to sustainably reduce this violence without degrading political rights, civil liberties, and the rule of law. Moreover, the increasing prominence of transnational criminal organizations has elevated the problem from a national to a regional or global one. The challenges posed by such groups are multifold, but without basic physical security, citizens are unable to exercise any other freedoms, and they will be tempted to hand unchecked power to leaders who promise to restore order. Elected leaders must demonstrate that democracy can deliver both safety and liberty, and remind the public that one cannot long endure without the other. **The World Needs New Approaches to Old Problems** Armed conflict, attacks on democratic institutions by elected leaders, and deepening authoritarianism drove a large part of the decline in global freedom in 2024. Though serious, these phenomena are not new. Some of the largest score declines over the past 19 years have occurred in El Salvador, Serbia, and Venezuela, where leaders’ steady dismantling of democratic institutions progressed into an entrenchment of authoritarian rule. Other countries that have experienced major declines since 2005 include the Central African Republic, Haiti, and Mali, where endemic violence and insecurity have long impeded people’s ability to live in peace and access their fundamental rights. As the world approaches two full decades of declining freedom, it is clear that new solutions—and far more vigorous and comprehensive efforts—are needed to address these persistently expanding threats to the security and survival of democracy. Should the current global trends continue, not even the most powerful democratic states will be able to guarantee the freedom and prosperity of their people. There are many encouraging examples around the world from which to draw inspiration. Events in Bangladesh, Senegal, and South Korea over the past year showed, not for the first time, that ordinary citizens have the power to reject authoritarianism, protect free institutions, and hold their leaders to account. Sustained democratic reform efforts in Guatemala and Poland highlighted the fact that rebuilding damaged institutions is arduous, yet possible. While Syria’s future remains uncertain, the sudden fall of the Assad regime proved once again that even the most extreme authoritarian systems are not immutable. In the year to come, all those who understand the value of political rights and civil liberties must work together in the defense of democracy and be prepared to exploit opportunities for progress when they arise. Democratic governments, international organizations, civil society groups, the private sector, and ordinary people have critical roles to play in safeguarding institutions at home, supporting democracy advocates and human rights defenders abroad, and finding durable resolutions to armed conflicts that give the affected populations an opportunity to live in freedom. **Explore the Report** **Policy Recommendations** **Policy Recommendations** Democratic governments, donors, and the private sector must deepen their solidarity with front-line allies, hold dictators accountable for rights abuses and corruption, and invest in democratic institutions at home and abroad. **Explore the Map** **Explore the Map** Explore the interactiveFreedom in the World 2025map here, where you can see country scores, Freedom Status, and trends. **About the Report** **About the Report** Freedom in the Worldis Freedom House’s flagship annual report, assessing the condition of political rights and civil liberties around the world. It is composed of numerical ratings and supporting descriptive texts for 195 countries and 15 territories.Freedom in the Worldhas been published since 1973, allowing Freedom House to track global trends in freedom for more than 50 years. Acknowledgements For over 50 years,Freedom in the Worldhas been widely used by policymakers, researchers, students, international organizations, and investors.Donate todayto help us ensure the future of this vital resource. **Be the first to know what's happening.** Join the Freedom House weekly newsletter **Footer Main Menu** Our Issues Countries Policy Recommendations Explore the Map Donate News & Perspectives Reports Events About Careers **Address** 1850 M St. NW Floor 11 Washington, DC 20036 **General Inquiries** **Press & Media** **Footer Social Menu** **Follow** Facebook Twitter Instagram Threads **Footer** Site Map Contact Us Manage Subscriptions Privacy Policy Content Permissions Disclosure Statements"}