{"id": 1498, "name": "KERO TV - 23ABC", "domain": "turnto23.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.turnto23.com/news/in-your-neighborhood/shafter-wasco-lost-hills/california-high-speed-rail-authority-project-faces-funding-threat-from-federal-authorities", "title": "California High Speed Rail Authority Project Faces Funding Threat From Federal Authorities", "content": "Menu Local News In Your NeighborhoodBakersfieldTaft / MaricopaShafter / Wasco / Lost HillsKern River ValleyDelano / McFarlandEdwards Air Force Base / Rosamond / MojaveCalifornia CityArvin / LamontFrazier Park / GrapevineTehachapi / Stallion SpringsRidgecrestOildale Bakersfield Taft / Maricopa Shafter / Wasco / Lost Hills Kern River Valley Delano / McFarland Edwards Air Force Base / Rosamond / Mojave California City Arvin / Lamont Frazier Park / Grapevine Tehachapi / Stallion Springs Ridgecrest Oildale Bakersfield Taft / Maricopa Shafter / Wasco / Lost Hills Kern River Valley Delano / McFarland Edwards Air Force Base / Rosamond / Mojave California City Arvin / Lamont Frazier Park / Grapevine Tehachapi / Stallion Springs Ridgecrest Oildale NewsLocal NewsState NewsUS & World NewsHealthEntertainment Local News State News US & World News Health Entertainment Local News State News US & World News Health Entertainment WeatherSchool Closings & DelaysWeather RadarDaily ForecastWeather AlertsHourly Forecast School Closings & Delays Weather Radar Daily Forecast Weather Alerts Hourly Forecast School Closings & Delays Weather Radar Daily Forecast Weather Alerts Hourly Forecast SportsFriday Night Live Friday Night Live Friday Night Live About 23ABCNewstipsStaff BiosContact 23ABC NewsTV ListingsAdvertise23ABC JobsSupportHow To Watch KEROBakersfield Baby ShowerSenior Food Drive Newstips Staff Bios Contact 23ABC News TV Listings Advertise 23ABC Jobs Support How To Watch KERO Bakersfield Baby Shower Senior Food Drive Newstips Staff Bios Contact 23ABC News TV Listings Advertise 23ABC Jobs Support How To Watch KERO Bakersfield Baby Shower Senior Food Drive 23ABC Mobile App Ready-Set Back 2 School Contests Gas Prices Kern's Kindness Kern Living TV Listings LIVE Video 23ABC ON SOCIAL Facebook Instagram Twitter YouTube Sign In Newsletters Sign Out Manage Emails Apps Careers Search Taft / Maricopa Shafter / Wasco / Lost Hills Kern River Valley Delano / McFarland Edwards Air Force Base / Rosamond / Mojave California City Arvin / Lamont Bakersfield Frazier Park / Grapevine Tehachapi / Stallion Springs Ridgecrest Oildale **Actions** Facebook Tweet Email **California High-Speed Rail Authority project faces funding threat from federal authorities** Shafter, Wasco, and Lost Hills Neighborhood Reporter SHAFTER, Calif. (KERO) — After announcing the review in February, the Federal Railroad Administration published a report regarding the CHSRA. The report advocates for pulling $4 billion in federal funds. In February, theFederal Railroad Administration (FRA) announced it would review $4 billion in federal funding for California High-Speed Rail. FRA threatens to withdraw funding unless the California High-Speed Rail Authority (CHSRA) address several key findings in its report. A 300-page report highlights what the FRA's believes to be CHSRA's failure to meet obligations and deliver the Early Operating Segment of the project by 2033. California politicians criticize the project, labeling it a government waste and failure. CHSRA disputes the FRA's findings and emphasizes its commitment to completing the high-speed rail project. For your convenience, the skimmable summary above is generated with the assistance of AI and fact checked by our team prior to publication. Read the full story as originally reported below. BROADCAST TRANSCRIPT: Back in February, the Federal Railroad Administration announced it would be conducting a review of about $4 billion dollars in federal funding for the California High Speed Rail project. I'm Sam Hoyle, your neighborhood reporter. Now the government agency says they plan to pull the funding unless the High Speed Rail Authority is able to come up with some answers. According to a release from the Department of Transportation, the FRA feels High Speed Rail has fallen short of its obligations and is considering pulling the funding. According to a release from the Department of Transportation, the 300-page report compiled over the last several months contains 9 key findings covering a variety of issues the FRA says it found during its review pointing towards issues like funding, but the overarching theme is the final key finding, \"CHSRA lacks the capacity to deliver the Early Operating Segment by 2033.\" As part of the release, Transportation Secretary Sean Duffy said in part: \"CHSRA is on notice — If they can't deliver on their end of the deal, it could soon be time for these funds to flow to other projects that can achieve President Trump's vision of building great, big, beautiful things again.\" Politicians across the state are weighing in on the announcement. Looking closer to home, area Congressman Vince Fong taking a shot at the project via press release saying: \"The California High-Speed Rail project has become one of the most glaring examples of government waste in our state's history.\" Congressman David Valadao adding, \"The Federal Railroad Administration's report on the California High-Speed Rail Authority reinforces what we've known all along—this project has been an expensive failure from the start with no viable path forward.\" In an email, a High Speed Rail Authority spokesperson provided this statement: \"The Authority strongly disagrees with the FRA's conclusions, which are misguided and do not reflect the substantial progress made to deliver high-speed rail in California. We remain firmly committed to completing the nation's first true high-speed rail system connecting the major population centers in the state. While continued federal partnership is important to the project, the majority of our funding has been provided by the state. To that end, the Governor's budget proposal, which is currently before the Legislature, extends at least $1 billion per year in funding for the next 20 years, providing the necessary resources to complete the project's initial operating segment. The Authority will fully address and correct the record in our formal response to the FRA's notice.\" The funding hasn't been officially pulled yet. According to the DOT release, CA High Speed Rail has 37 days to officially respond to the report in an effort to save the funding. Stay in Touch with UsAnytime,Anywhere: Download Our Free App forAppleandAndroid Sign Up for Our DailyE-mail Newsletter Like Us onFacebook Follow Us onInstagram Subscribe to Us onYouTube **Sign up for theHeadlines Newsletterand receive up to date information.** **now signed up to receive theHeadlines Newsletter.** , **Weather** **Daily Forecast** Day Conditions HI / LO Precip Wednesday 06/11/2025 Clear -° / 68° 0% Thursday 06/12/2025 Clear 95° / 67° 0% Friday 06/13/2025 Mostly Clear 95° / 65° 0% Saturday 06/14/2025 Partly Cloudy 97° / 67° 0% Sunday 06/15/2025 Clear 97° / 66° 0% Monday 06/16/2025 Clear 95° / 67° 0% Tuesday 06/17/2025 Clear 97° / 71° 0% Wednesday 06/18/2025 Clear 102° / 73° 0% Local News National News Weather Sports Entertainment Lifestyle Don't Waste Your Money Support Sitemap Contact Us Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public Files FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact Retransmission Consent Letter 23ABCBakersfield 23ABCNews 23ABCNews"}