{"id": 2164, "name": "Uproxx", "domain": "uproxx.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://uproxx.com/music/governors-ball-in-photos-backstage-with-mannequin-pussy-conan-gray-more/", "title": "Governors Ball In Photos Backstage With Mannequin Pussy Conan Gray More", "content": "Sound+Vision MusicMusicIndieCountry Music Indie Country Music Indie Country Film/TV Life/Travel HipHop DX Dime Mag FollowInstagramYouTubeTikTokFacebookTwitter Instagram YouTube TikTok Facebook Twitter Instagram YouTube TikTok Facebook Twitter Search for:Search InfoAboutPrivacyTermsCookies PolicyCOOKIES SETTINGS About Privacy Terms Cookies Policy COOKIES SETTINGS About Privacy Terms Cookies Policy COOKIES SETTINGS **Governors Ball In Photos: Backstage With Mannequin Pussy, Conan Gray, & More** If Coachella is the place to spot celebrities,Governors Ballis where music fans go to soak up thevibes. The atmosphere, the attitude, thegritty, vibrant, unmistakably New York energy that even hours-long storm delays can’t damper – that’s what sets the festival, which just celebrated its 15th year, apart from the rest of the summer circuit. Here,the mood and the music take the spotlight, and it’s the artists – rising indie hopefuls, punk rock icons, pop princesses, and weirdo-rap savants – that set the tone, urging fans to ignore the heat, the rain, and the mud in exchange for a once-in-a-lifetime experience that outlives the gram. We caught up with a handful of the coolest acts to grace the Gov Ball stages this past weekend, capturing a bit of their magic with a backstage portrait session that gives fans a hint of what it takes to hype the “city that never sleeps” crowd. Whether it’s Conan Gray donning aSailor Moonfit and staging a mini-musical for an awed crowd or Mannequin Pussy stoking a bit of anarchy with their rebellious strain of rock, the story starts here. From hip-hop duo Joey Valence & Brae to English pop siblings Wasia Project, here are some exclusive looks at how Gov Ball’s most exciting artists embraced their “made it” moment. **Conan Gray** **Mannequin Pussy** **Joey Valence & Brae** **Militarie Gun** **Wasia Project** **Snow Wife** **Mark Ambor** **Olivia Lunny** Facebook Twitter Flipboard Email uproxx.it"}