{"id": 1313, "name": "Gladbrook Sun-Courier", "domain": "sun-courier.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.sun-courier.com/news/local-news/2025/05/30/area-sheriffs-911-dispatchers-concerned-about-language-in-recently-passed-budget-bill/", "title": "Area Sheriffs 911 Dispatchers Concerned About Language In Recently Passed Budget Bill", "content": "NewsLocal NewsCourt NewsCOVID-19EducationGarwin NewsGovernmentReinbeck NewsTama County News Local News Court News COVID-19 Education Garwin News Government Reinbeck News Tama County News Local News Court News COVID-19 Education Garwin News Government Reinbeck News Tama County News SportsLocal Sports Local Sports Local Sports OpinionLetters to the Editor Letters to the Editor Letters to the Editor ObituariesView ObituariesPlace Obit View Obituaries Place Obit View Obituaries Place Obit Contact UsContact UsStatement of Values Contact Us Statement of Values Contact Us Statement of Values Public NoticesView a NoticePlace Notice View a Notice Place Notice View a Notice Place Notice News Sports Opinion Obituaries Contact Us Place Notice June 08, 2025 | Submit News **Area sheriffs, 911 dispatchers concerned about language in recently passed budget bill** **** May 30, 2025 Marshall County 911 Dispatcher Shane Andrews takes a call at the Marshall County Communications Commission headquarter inside the Marshalltown Police/Fire building. Representatives of county 911 boards and law enforcement agencies are concerned about language in a budget bill that would authorize the state to request reimbursement from each joint 911 service board for “reasonable costs” and require local 911 service boards to reimburse the Iowa Department of Homeland Security and Emergency Management within 30 days. CONTRIBUTED PHOTO MARSHALLTOWN – Like most if not all of their counterparts across Iowa, sheriffs and county 911 professionals in the Times-Republican/Tama-Grundy Publishing coverage area including both Tama and Grundy counties have strong reservations about a portion of a larger budget bill passed near the end of the 2025 legislative session — which has not yet been signed or vetoed by Gov. Kim Reynolds as of presstime (Monday, May 26) — that authorizes the state to“request reimbursement from each joint 911 service board for reasonable costs”and requires local 911 service boards to reimburse the Iowa Department of Homeland Security and Emergency Management within 30 days. “Basically what it comes down to is (that) instead of having a cap or a percentage or an amount, they’ve given a blank check to the state, so that sliding rule can go forward, it can go backward, it can do all kinds of things,”Marshall County 911 Communications Director Rhonda Braudis said.“Unfortunately, there is a shortfall with the state, so they’re needing more money.” The 911 system is currently funded by a $1 surcharge on phone bills, of which 60 percent of the money goes to the county 911 board and 40 percent goes to the state. If the bill is signed with the current language in place and no line item veto, Braudis predicted a loss of $40,000 with the annual county budget already completed and certified. In a KCRG news story, Sen. Tim Kraayenbrink (R-Fort Dodge) called the bill“a one-time request”and told the outlet the state spent“more than its share”to cover infrastructure upgrades. Local 911 boards should pitch in as they have a combined surplus of more than $60 million. Braudis responded, however, that the surpluses are simply a result of financial responsibility as county boards save money for major projects to avoid raising levy rates or asking voters to pass a bond referendum. Locally, Marshall County recently spent millions to upgrade its radio towers. “By doing the right thing for my community and saving that money, they’re saying we have too much money because I don’t want to put that on the taxpayers,”she said.“Essentially what they’re saying is if you are being mindful and fiscally prudent thinking about the future, we’re gonna punish you… There are some counties where this is going to be absolutely detrimental.” Sheriff Joel Phillips added that he supports statewide improvements to 911 equipment and infrastructure, but not at the expense of individual counties. “What kind of gets me is Marshall County has invested in our 911 system. Back in 2021, we knew our volunteer services were working on borrowed time, equipment that was outdated. The county invested millions of dollars to upgrade infrastructure,”Phillips said.“We’re using those funds to put back into the community, and then now this comes out and they want to charge us for those. They send money back to the state to be dispersed. The Marshall County Communications Commission’s been very proactive. That radio equipment is extremely expensive.” The sheriff compared the board’s actions to homeowners saving money for a rainy day fund when repairs become necessary and commended RACOM, a Marshalltown-based company, for being on the“cutting edge”in emergency communication technology. Phillips also didn’t feel that specific needs had been laid out at the state level, but rather just general expenses. “I think there could’ve been more thought put into it, and I really have concerns that it’s kind of a last minute deal where there could’ve been at least some outside influence in that where we could talk about what this is for, come up with parameters and limitations and at least have it structured,”he said.“I don’t think there’s too many people that would sign up for a service where the provider can bill you anytime for how much they decide without knowing the terms.” Braudis also felt the language was snuck back into the bill after she had testified against previous iterations that were proposed but ultimately removed from it. This iteration passed the House by a 78-3 tally on May 15 — with local Reps. David Blom (R-Marshalltown), Brett Barker (R-Nevada) and Dean Fisher (R-Montour) — all in favor. The Senate passed the bill by a 28-11 margin, and Sen. Kara Warme (R-Ames) voted in favor. At presstime, Barker, Fisher and Warme had not responded to a request for comment, and Blom said it was an issue he hadn’t worked much on but would plan to look further into as conversations continued. Newly elected Tama County Sheriff Casey Schmidt took a similar stance on the matter, outlining his concerns about a lack of clarity in the language in a statement shared with the T-R. “The bill does not specify how much local counties will be asked to contribute, nor does it set any caps on the amounts the state could charge. From what I have gathered, local counties may be required to cover some of the costs associated with maintaining and upgrading the 911 system. However, without clear guidelines or concrete figures, it is impossible to know what that financial burden might look like. This leaves counties like Tama in a difficult position, unable to plan effectively for the future,” Schmidt said. “While it is true that many local agencies have reserve funds, the suggestion that those funds should be used to cover these added costs raises significant concerns. Reserves are typically set aside for specific needs or emergencies, not for unforeseen and undefined costs like these. Even if Tama had larger reserves, using them to cover such uncertainty would take away from other vital services our communities and county need.” Schmidt added that he has been a steadfast supporter of a proposal to increase the 911 surcharge on phone bills by 25 cents as a means of addressing budgetary issues. “Ultimately, while I strongly support the goal of ensuring Iowa’s 911 system is modern, effective, and prepared for the future, it is essential that we have a funding plan that is clear, sustainable, and fair for all counties. Local governments should not be expected to shoulder an undefined financial burden without knowing how much will be required or whether they can reasonably absorb the costs,” he said. “Given these concerns, I would respectfully urge Governor Reynolds to very seriously consider line item vetoing this provision of the bill so that we can work to create a clearly defined and fair path forward for Iowa’s 911 system.” Grundy County Sheriff Kirk Dolleslager also opposes this provision of the bill and voiced frustration with the fact that representatives from county 911 boards and communication centers were not consulted on it. “We have been saving up for years in order to build a 911 communications tower in the southern part of our county. This bill could put that in jeopardy among other projects like new radios for Deputies, Firemen, EMS personnel, fire trucks, ambulances and squad cars. These are very expensive projects to complete. A single radio for an emergency vehicle is nearly $8,000. Our local dispatch center is currently funded 100 percent by the 911 surcharge, other than salaries and benefits of the dispatchers. This bill could change that where the county will have to compensate from the General Fund to help the 911 system continue to operate,”he said.“I would hope by now the Governor has received enough information that she would veto that portion of the poorly written bill.” **Local News** **Local News** **Traer Historical Museum BBQ fundraiser set for June 8** **Traer Historical Museum BBQ fundraiser set for June 8** **The problem of enforcement** **The problem of enforcement** **Gladbrook Panther Pavilion dedication set for June 14** **Gladbrook Panther Pavilion dedication set for June 14** **Grundy County Bible Reading Marathon June 9-10 at Courthouse** **Grundy County Bible Reading Marathon June 9-10 at Courthouse** GRUNDY CENTER – The Grundy County Bible Reading Marathon will be hosting its 9th Bible reading at the Grundy ... **G-R Facility Task Force presents recommendations to school board** **G-R Facility Task Force presents recommendations to school board** **Sophia Folkerts named to Central College Dean’s List** **Sophia Folkerts named to Central College Dean’s List** **Newsletter** Today's breaking news and more in your inbox Daily Newsletter Breaking News NewsLocal NewsCOVID-19Education Local News COVID-19 Education Local News COVID-19 Education Obituaries SportsLocal Sports Local Sports Local Sports Contact Us Copyright © Sun Courier | https://www.sun-courier.com | 107 Broad Street, P.O. Box 0, Reinbeck, IA 50669 |Terms of Service"}