{"id": 1923, "name": "Colombia Reports", "domain": "colombiareports.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://colombiareports.com/colombias-opposition-disavow-petro-as-electoral-guarantor-seek-meeting-with-military/", "title": "Colombias Opposition Disavow Petro As Electoral Guarantor Seek Meeting With Military", "content": "Contact About Support Newsletter News Data Profiles Travel Select Page **Colombia’s opposition disavow Petro as electoral guarantor, seek meeting with military** byAdriaan Alsema|Jun 11, 2025 Colombia’s opposition parties have refused to take part in the commission that seeks to guarantee free and fair elections after disavowing President Gustavo Petro as electoral guarantor. Instead of participating in the National Commission for the Coordination and Follow-up of Electoral Processes, the opposition politicians met with Inspector General Gregorio Eliach to create the parallel National Commission for Electoral Surveillance and Control. Following this meeting, Senate president Efrain Cepeda of the Conservative Party said that he would request a meeting with the military “so that we can have a calm electoral debate, and not one that resembles those times of drug trafficking in Colombia.” Petro was quick to point out that he is the commander-in-chief and that he wouldn’t authorize a meeting between the military and accused Cepeda and his allies of seeking a coup d’état. According to Cepeda and his allies, the attempted assassination of far-right Senator Miguel Uribe over the weekend are the result of Petro’s “hate speech” towards the opposition and the business elite. According to Petro, “Colombia is under attack by one enemy, which is called the mafia.” The meeting was also rejected by moderate members of the liberal U Party who said that they were never consulted about any decision to disavow the president and seek ad hoc security guarantees. “As the majority of the U Party congressmen, we distance ourselves from anything that represents a disregard of the powers granted to the President by the Constitution,” said U Party Senator Antonio Correa on social media platform X. Interior Minister Armando Benedetti said that also the directors of the Liberal Party and the Green Alliance party acted without the support of representatives in Congress. The group that is using the attack on Uribe to disavow the president is more or less the same as the one that has successfully tanked the government’s attempt to push a labor reform through Congress. **Related posts:** Colombia’s opposition disavow Petro as electoral guarantor, seek meeting with military Class solidarity in Colombia At least three killed in wave of bomb attacks in southwest Colombia Colombia’s protection chief investigated over failures to protect shot senator Extremely violent warm-up to Colombia’s 2026 elections Website development byDigitale Zaken"}