{"id": 462, "name": "KRIV - Fox 26 - Houston", "domain": "fox26houston.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.fox26houston.com/morning-show/heres-how-to-submit-a-question-for-chris-tritico", "title": "Heres How To Submit A Question For Chris Tritico", "content": "Live News Weather Morning News Sports Uploads Tell 26 More FOX 26 on FOX LOCAL Newscasts & Replays LiveNOW from FOX YouTube FOX Soul Local Texas National World You Decide Money FOX News Sunday Sullivan's Smart Sense Border Watch Dallas News - FOX 4 News Austin News - FOX 7 Austin Making the Grade Dr. Viviana Coles Finding Families Health Matters Pets Submit Your Legal Questions to Chris Tritico Here Your Legal Questions FOX Family Feast Live Radar Live Houston-area webcams Tropical Weather JD's Hurricane Gear Test Mondays with Mike ERCOT News Traffic Weather App Pump Patrol FOX Weather Astros Texans Rockets College Sports Dynamo Dash Roughnecks Friday Football Fever Player of the Week World Cup Isiah Factor Uncensored The Nightcap The News Edge Chattin' With Chelsea What's Your Point? What's Your Point? Overtime Texas: The Issue Is Bayou City Buzz Caroline & Rashi Allison's Cooking Diary Breaking Bond FOX 26 Crime Files FOX 26 in Focus FOX Faceoff Dollar$ & $en$e Foodies and Friends Remember When Pet Pawcast Lunch for the Soul The Missing The Drop Backstage OL The Backstage Experience FOX PRIMETIME SHOWS Contests The Now with Cris Meet the FOX 26 Team WATCH FOX 26 ON FOX LOCAL What's On FOX Email Newsletter Jobs at FOX 26 & My20 Internship Opportunities Mobile App Contests KRIV/KTXH FCC Public File Closed Captioning FCC Applications **Here's how to submit a question for Chris Tritico** Share Copy Link Email Facebook Twitter LinkedIn Reddit HOUSTON-FOX 26 Senior Legal Analyst answers viewers' questions on Houston's Morning Show every Tuesday and Thursday morning. To submit a question simply emailFOX26LAW@fox.com. Remember this is all general legal information, for specific advice, make sure to consult your own attorney. Christopher L. Tritico, a native of Houston, Texas, received his Bachelors Degree at Sam Houston State University and his Doctor of Jurisprudence at South Texas College of Law. A criminal defense attorney with Tritico Rainey PLLC, Mr. Tritico handles cases in both state and federal courts; ranging from environmental law to capital murder. Mr. Tritico is the host of Fox26Law on Fox, 26, KRIV and the legal analyst for Fox 26. **Latest News** **Isle Royale camping deaths: FBI assisting in investigation of two found dead** **Hiker missing in India, San Francisco family desperate to find him** **Woman, 66, hit by car that drove into downtown protest crowd, CPD says** **Newsom claims Trump 'chose theatrics over safety' in deploying National Guard to LA** **Galveston Co. discovery: Bride-to-be loses engagement ring, later located thanks to FOX 26 and Galveston Club** **Download FOX LOCAL for Free** **Trending** **DAILY NEWSLETTER** All the news you need to know, every day By clicking Sign Up, I confirmthat I have read and agreeto thePrivacy PolicyandTerms of Service. FOX 26 on FOX LOCAL Newscasts & Replays LiveNOW from FOX YouTube FOX Soul Local Texas National World You Decide Money FOX News Sunday Sullivan's Smart Sense Border Watch Dallas News - FOX 4 News Austin News - FOX 7 Austin Making the Grade Dr. Viviana Coles Finding Families Health Matters Pets Submit Your Legal Questions to Chris Tritico Here Your Legal Questions FOX Family Feast Live Radar Live Houston-area webcams Tropical Weather JD's Hurricane Gear Test Mondays with Mike ERCOT News Traffic Weather App Pump Patrol FOX Weather Astros Texans Rockets College Sports Dynamo Dash Roughnecks Friday Football Fever Player of the Week World Cup Isiah Factor Uncensored The Nightcap The News Edge Chattin' With Chelsea What's Your Point? What's Your Point? Overtime Texas: The Issue Is Bayou City Buzz Caroline & Rashi Allison's Cooking Diary Breaking Bond FOX 26 Crime Files FOX 26 in Focus FOX Faceoff Dollar$ & $en$e Foodies and Friends Remember When Pet Pawcast Lunch for the Soul The Missing The Drop Backstage OL The Backstage Experience FOX PRIMETIME SHOWS Contests The Now with Cris Meet the FOX 26 Team WATCH FOX 26 ON FOX LOCAL What's On FOX Email Newsletter Jobs at FOX 26 & My20 Internship Opportunities Mobile App Contests KRIV/KTXH FCC Public File Closed Captioning FCC Applications facebook twitter instagram email New Privacy Policy Updated Terms of Use Your Privacy Choices KRIV/KTXH FCC Public File EEO Public File Closed Captioning About Us Jobs at FOX 26 & My20 Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"}