{"id": 904, "name": "Metro Weekly", "domain": "metroweekly.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.metroweekly.com/2025/06/koby-falks-gay-adult-film-star-and-onlyfans-creator-dies-at-42/", "title": "Koby Falks Gay Adult Film Star And Onlyfans Creator Dies At 42", "content": "Latest Posts ArtsStageMusicFilmReel AffirmationsTelevisionGay Films Everyone Should See Stage Music FilmReel Affirmations Reel Affirmations Television Gay Films Everyone Should See Stage Music FilmReel Affirmations Reel Affirmations Reel Affirmations Television Gay Films Everyone Should See ScenePhotosVideo Photos Video Photos Video The Magazine Advertisers Newsletter World Pride Guide Advertising Advertise With Metro Weekly Subscribe to our Daily E-Mail Metro Weekly Store Past Issues Facebook Twitter Instagram YouTube LinkedIn RSS Latest Posts ArtsStageMusicFilmReel AffirmationsTelevisionGay Films Everyone Should See Stage Music FilmReel Affirmations Reel Affirmations Television Gay Films Everyone Should See Stage Music FilmReel Affirmations Reel Affirmations Reel Affirmations Television Gay Films Everyone Should See ScenePhotosVideo Photos Video Photos Video The Magazine Advertisers Newsletter World Pride Guide Advertising **Koby Falks, Gay Adult Film Star and OnlyFans Creator, Dies at 42** **Instagram tribute confirms death of the popular Australian performer, known for his raw honesty, viral videos, and large LGBTQ following.** ByJohn Rileyon June 10, 2025@JRileyMW Koby Falks, a gay Australian adult film actor and OnlyFans creator whose Facebook and Instagram Reels earned him a devoted LGBTQ following, died on May 28 at the age of 42. A representative for Falks — known to family and friends as Anthony Cox — announced his death in a June 1Instagram post. The tribute included a photo of Falks standing outdoors with his arms crossed, an image of him sharing a kiss with his partner, Sam Brownell, and another of him posing alongside a friend. “Koby Falks passed away earlier this week. He was loved by many and will be missed,” the post reads. No official cause of death has been reported publicly at this time. A post shared by Koby Falks (@kobyfalks) The Instagram post also encouraged anyone affected by Falks’ death to contact Lifeline at 13 11 14, a 24/7 confidential crisis support service in Australia for those experiencing emotional distress or contemplating suicide. As reported byPeople, Falks’ last Instagram post, on May 28, featured a throwback photo of himself sitting on the bedroom floor. “Took me years to drop the act. Turns out, the scariest thing wasn’t being rejected — it was being seen. No more masks. No more performance. Just me, as I am. Raw. Real. Free,” he wrote. “Yeah, I fucked up along the way. Yeah, I wore the armor a bit too long. But I never stopped searching for the bloke underneath it all. This is for the younger me who just wanted to be loved without pretending. And for anyone else out there still hiding — You don’t have to be a symbol. Just be you. Rough edges and all. That’s where the beauty is.” Falks’ death follows a series of unexpected losses within the adult entertainment industry over the span of less than three months. In March,TimTalesco-founder and performer Tim Kruger died at age 44 in what was described as a “tragic accident.” In April, adult film starDamien Stonepassed away at 32. In May, just a week before Falks’ passing,Colton Ford— a former adult film actor turned musician — died at age 62. Though active in the adult film industry for only three years, Falks was credited with up to 76 projects during that time, according to Canadian LGBTQ magazineIn. His work appeared on RawFuckClub and was also released independently via his OnlyFans page. SUBSCRIBE TO METRO WEEKLY MAGAZINE FOR FREE! Falks was a prolific poster of digital content, sharing not only collaborations with other adult film stars on his OnlyFans or JustForFans pages, but a series of short videos commenting on his life, his past experiences, his workout routine, and opinions on topics in the news. Those videos also documented a number of in-person appearances he made, such as when he hosted events at venues like the Sydney Sauna. At the time of his death, he had amassed more than 127,000 followers on Instagram and 60,000 followers on Facebook. Falks was a prolific digital creator, sharing not only collaborations with fellow adult film performers on his OnlyFans and JustForFans pages, but also a steady stream of short videos reflecting on his life, past experiences, fitness routine, and views on current events. His content often included footage from in-person appearances, such as hosting events at venues like the Sydney Sauna. At the time of his death, he had garnered more than 127,000 followers on Instagram and 60,000 on Facebook. Falks’ manager and publicist, Matthew Leigh, a.k.a. “Mista PR,” shared a lengthy tribute to the star and offered condolences to his family and loved ones onInstagram. “Though our time working together was brief, the impact Koby had was anything but small. From the moment we connected, I was struck by his warmth, his charisma, and his incredible professionalism,” Leigh wrote. “He was organized, kind-hearted, and deeply respectful — the kind of person you instantly felt grateful to work with. “It was an honor to represent his remarkable body of work and to witness firsthand the power of his presence, both on and off screen,” Leigh continued. His ability to connect with people, not just here in Australia but across the world, was something truly special. Koby wasn’t just a client — he was a light, a creative force, and a genuinely beautiful soul.” Falks’ partner, Sam Brownell, offered a more succinct tribute, posting an Instagram Story that read: “I will love you always.” SUBSCRIBE TO METRO WEEKLY MAGAZINE FOR FREE! **READ NEXT** 2AM Ricky Breaks Barriers as Black Trans Rap Star David Archuleta Embraces the Sweet Life Shooting and Stabbings Rock Dupont Circle During WorldPride Michael Urie Puts Queer Stories Center Stage with Pride Plays **Dealer Gets 19 Years in Death of Trans Activist Cecilia Gentili** **Michael Kuilan will serve nearly two decades for selling the fentanyl-laced drugs that killed the beloved trans activist and \"Pose\" actress.** ByJohn Rileyon June 3, 2025@JRileyMW A New York City man will spend the next two decades in prison for selling fentanyl-laced heroin that caused the fatal overdose of prominent transgender activist Cecilia Gentili, found dead in her home on February 6, 2024. The 52-year-old was killed from a mixture of fentanyl, heroin, xylazine (also known as \"tranq,\" a veterinary sedative that is often mixed with other drugs related to overdoses), and cocaine, according to the New York City Medical Examiner's Office. Police used text messages, along with cell site data, to link two men to Gentili's death, with 53-year-old Antonio Venti of Babylon, N.Y., selling the fentanyl-laced mixture to the veteran LGBTQ activist and 44-year-old Michael Kuilan supplying the drugs to Venti. **35 Youths Arrested in Gay Dating App Attack Spree** **Police in Victoria, Australia, have arrested 35 people for allegedly using dating apps to lure, rob, and attack gay men.** ByJohn Rileyon May 17, 2025@JRileyMW Police in the Australian state of Victoria have arrested 35 individuals -- primarily males aged 13 to 20 -- for allegedly targeting victims using gay dating apps. According to police, over the past eight months, the alleged perpetrators deployed fake profiles on dating apps to lure gay men to locations where they were then assaulted, robbed, and subjected to homophobic abuse. In some cases, the attacks were filmed and shared on social media, reports theStar Observer. \"These incidents have occurred in various suburbs across Melbourne, including Manningham, Casey, Hume, Moorabbin, and Knox,\" Victoria Police said in a statement. **Teen Sentenced in D.C. DJ The Barber’s Murder** **16-year-old will remain in juvenile detention until 21 after pleading guilty in the 2024 fatal robbery of beloved D.C. DJ Bryan Smith.** ByJohn Rileyon June 10, 2025@JRileyMW A 16-year-old was sentenced to a juvenile facility until he turns 21 after pleading guilty to five charges related to the October 2024 murder of 39-year-old Bryan Smith, a.k.a. \"The Barber,\" a beloved local DJ, barber, and stylist who died after being robbed in the 500 block of T Street NW. The youth did not react as D.C. Superior Court Judge James Crowell read the charges -- including robbery, felony murder, and assault -- and told him: \"A life was taken and your role in that cannot be erased.\" **Support Metro Weekly’s Journalism** These are challenging times for news organizations. And yet it’s crucial we stay active and provide vital resources and information to both our local readers and the world. So won’t you please take a moment and consider supporting Metro Weekly with a membership? For as little as $5 a month, you can help ensure Metro Weekly magazine and MetroWeekly.com remain free, viable resources as we provide the best, most diverse, culturally-resonant LGBTQ coverage in both the D.C. region and around the world. Memberships come with exclusive perks and discounts, your own personal digital delivery of each week’s magazine (and an archive), access to our Member's Lounge when it launches this fall, and exclusive members-only items like Metro Weekly Membership Mugs and Tote Bags!Check out all our membership levels here and please join us today! The Magazine **The Magazine** **The Magazine** Most PopularMost ViewedLatest PostsTeen Sentenced in D.C. DJ The Barber's MurderTrans Woman Burned in Philly Acid Attack by JuvenilesGina Ortiz Jones Elected as San Antonio’s First LGBTQ MayorKoby Falks, Gay Adult Film Star and OnlyFans Creator, Dies at 42Log Cabin Republicans’ Trump Tower Pride Gala Sparks BacklashJonathan Groff Astounds as Bobby Darin in Just in TimeDC/DOX Returns With Powerful LGBTQ DocumentariesMasked Attacker Strikes Gay Man With Rock in Northeast D.C.Shooting and Stabbings Rock Dupont Circle During WorldPrideMichael Urie Puts Queer Stories Center Stage with Pride PlaysSouthern Baptists Declare War on Marriage EqualityMasked Attacker Strikes Gay Man With Rock in Northeast D.C.Jonathan Groff Astounds as Bobby Darin in Just in Time'I Don't Understand You' is Hit or Miss (Mostly Miss)Teen Sentenced in D.C. DJ The Barber's Murder'Andy Warhol in Iran' Skewers Fame and FascismTrans Woman Burned in Philly Acid Attack by JuvenilesLog Cabin Republicans’ Trump Tower Pride Gala Sparks Backlash'Frankenstein' Reimagined as a Marital DramaDC/DOX Returns With Powerful LGBTQ Documentaries **Most Popular** Most Viewed Latest Posts Teen Sentenced in D.C. DJ The Barber's Murder Trans Woman Burned in Philly Acid Attack by Juveniles Gina Ortiz Jones Elected as San Antonio’s First LGBTQ Mayor Koby Falks, Gay Adult Film Star and OnlyFans Creator, Dies at 42 Log Cabin Republicans’ Trump Tower Pride Gala Sparks Backlash Jonathan Groff Astounds as Bobby Darin in Just in Time DC/DOX Returns With Powerful LGBTQ Documentaries Masked Attacker Strikes Gay Man With Rock in Northeast D.C. Shooting and Stabbings Rock Dupont Circle During WorldPride Michael Urie Puts Queer Stories Center Stage with Pride Plays Southern Baptists Declare War on Marriage Equality Masked Attacker Strikes Gay Man With Rock in Northeast D.C. Jonathan Groff Astounds as Bobby Darin in Just in Time 'I Don't Understand You' is Hit or Miss (Mostly Miss) Teen Sentenced in D.C. DJ The Barber's Murder 'Andy Warhol in Iran' Skewers Fame and Fascism Trans Woman Burned in Philly Acid Attack by Juveniles Log Cabin Republicans’ Trump Tower Pride Gala Sparks Backlash 'Frankenstein' Reimagined as a Marital Drama DC/DOX Returns With Powerful LGBTQ Documentaries **Most Popular** Most Viewed Latest Posts Teen Sentenced in D.C. DJ The Barber's Murder Trans Woman Burned in Philly Acid Attack by Juveniles Gina Ortiz Jones Elected as San Antonio’s First LGBTQ Mayor Koby Falks, Gay Adult Film Star and OnlyFans Creator, Dies at 42 Log Cabin Republicans’ Trump Tower Pride Gala Sparks Backlash Jonathan Groff Astounds as Bobby Darin in Just in Time DC/DOX Returns With Powerful LGBTQ Documentaries Masked Attacker Strikes Gay Man With Rock in Northeast D.C. Shooting and Stabbings Rock Dupont Circle During WorldPride Michael Urie Puts Queer Stories Center Stage with Pride Plays Southern Baptists Declare War on Marriage Equality Masked Attacker Strikes Gay Man With Rock in Northeast D.C. Jonathan Groff Astounds as Bobby Darin in Just in Time 'I Don't Understand You' is Hit or Miss (Mostly Miss) Teen Sentenced in D.C. DJ The Barber's Murder 'Andy Warhol in Iran' Skewers Fame and Fascism Trans Woman Burned in Philly Acid Attack by Juveniles Log Cabin Republicans’ Trump Tower Pride Gala Sparks Backlash 'Frankenstein' Reimagined as a Marital Drama DC/DOX Returns With Powerful LGBTQ Documentaries SceneCapital Pride HonorsWorld Pride's International March on Washington for FreedomWorld Pride Music FestivalMore Scene **Scene** More Scene **Scene** More Scene Metro WeeklyWashington's LGBTQ MagazineP.O. Box 11559Washington, DC 20008(202) 527-9624About Us pageFollow Us:·Facebook·Twitter·Flipboard·YouTube·Instagram·RSS News|RSS Scene **Metro Weekly** Washington's LGBTQ MagazineP.O. Box 11559Washington, DC 20008(202) 527-9624About Us page Follow Us:·Facebook·Twitter·Flipboard·YouTube·Instagram·RSS News|RSS Scene **Metro Weekly** Washington's LGBTQ MagazineP.O. Box 11559Washington, DC 20008(202) 527-9624About Us page Follow Us:·Facebook·Twitter·Flipboard·YouTube·Instagram·RSS News|RSS Scene ArchivesArchivesSelect MonthJune 2025 (42)May 2025 (67)April 2025 (75)March 2025 (96)February 2025 (54)January 2025 (69)December 2024 (80)November 2024 (72)October 2024 (78)September 2024 (79)August 2024 (68)July 2024 (85)June 2024 (91)May 2024 (88)April 2024 (84)March 2024 (86)February 2024 (73)January 2024 (86)December 2023 (118)November 2023 (116)October 2023 (161)September 2023 (117)August 2023 (136)July 2023 (147)June 2023 (166)May 2023 (153)April 2023 (180)March 2023 (165)February 2023 (154)January 2023 (149)December 2022 (154)November 2022 (144)October 2022 (154)September 2022 (117)August 2022 (136)July 2022 (113)June 2022 (146)May 2022 (150)April 2022 (139)March 2022 (133)February 2022 (104)January 2022 (107)December 2021 (116)November 2021 (115)October 2021 (118)September 2021 (132)August 2021 (132)July 2021 (142)June 2021 (144)May 2021 (129)April 2021 (153)March 2021 (166)February 2021 (142)January 2021 (118)December 2020 (148)November 2020 (124)October 2020 (174)September 2020 (132)August 2020 (135)July 2020 (133)June 2020 (151)May 2020 (143)April 2020 (153)March 2020 (146)February 2020 (128)January 2020 (140)December 2019 (102)November 2019 (109)October 2019 (150)September 2019 (135)August 2019 (155)July 2019 (134)June 2019 (136)May 2019 (158)April 2019 (123)March 2019 (133)February 2019 (121)January 2019 (122)December 2018 (103)November 2018 (113)October 2018 (131)September 2018 (110)August 2018 (157)July 2018 (161)June 2018 (154)May 2018 (187)April 2018 (153)March 2018 (182)February 2018 (150)January 2018 (144)December 2017 (111)November 2017 (139)October 2017 (143)September 2017 (128)August 2017 (151)July 2017 (129)June 2017 (171)May 2017 (139)April 2017 (154)March 2017 (174)February 2017 (149)January 2017 (172)December 2016 (135)November 2016 (122)October 2016 (130)September 2016 (139)August 2016 (121)July 2016 (124)June 2016 (161)May 2016 (132)April 2016 (94)March 2016 (115)February 2016 (92)January 2016 (98)December 2015 (92)November 2015 (110)October 2015 (116)September 2015 (131)August 2015 (117)July 2015 (119)June 2015 (144)May 2015 (127)April 2015 (138)March 2015 (171)February 2015 (121)January 2015 (118)December 2014 (101)November 2014 (100)October 2014 (129)September 2014 (86)August 2014 (151)July 2014 (111)June 2014 (112)May 2014 (151)April 2014 (110)March 2014 (144)February 2014 (156)January 2014 (125)December 2013 (112)November 2013 (141)October 2013 (171)September 2013 (153)August 2013 (171)July 2013 (131)June 2013 (152)May 2013 (181)April 2013 (151)March 2013 (161)February 2013 (134)January 2013 (177)December 2012 (122)November 2012 (118)October 2012 (178)September 2012 (166)August 2012 (197)July 2012 (217)June 2012 (184)May 2012 (218)April 2012 (183)March 2012 (229)February 2012 (197)January 2012 (233)December 2011 (211)November 2011 (161)October 2011 (265)September 2011 (178)August 2011 (174)July 2011 (196)June 2011 (241)May 2011 (215)April 2011 (228)March 2011 (250)February 2011 (216)January 2011 (196)December 2010 (253)November 2010 (220)October 2010 (256)September 2010 (239)August 2010 (214)July 2010 (211)June 2010 (174)May 2010 (151)April 2010 (139)March 2010 (174)February 2010 (119)January 2010 (130)December 2009 (125)November 2009 (131)October 2009 (192)September 2009 (139)August 2009 (109)July 2009 (104)June 2009 (130)May 2009 (131)April 2009 (147)March 2009 (112)February 2009 (106)January 2009 (90)December 2008 (93)November 2008 (117)October 2008 (204)September 2008 (156)August 2008 (140)July 2008 (146)June 2008 (228)May 2008 (146)April 2008 (101)March 2008 (78)February 2008 (77)January 2008 (73)December 2007 (55)November 2007 (32)October 2007 (129)September 2007 (76)August 2007 (55)July 2007 (43)June 2007 (89)May 2007 (68)April 2007 (57)March 2007 (46)February 2007 (42)January 2007 (54)December 2006 (39)November 2006 (49)October 2006 (104)September 2006 (58)August 2006 (46)July 2006 (34)June 2006 (43)May 2006 (47)April 2006 (40)March 2006 (46)February 2006 (35)January 2006 (37)December 2005 (37)November 2005 (36)October 2005 (97)September 2005 (43)August 2005 (37)July 2005 (28)June 2005 (54)May 2005 (34)April 2005 (39)March 2005 (49)February 2005 (34)January 2005 (29)December 2004 (37)November 2004 (35)October 2004 (102)September 2004 (45)August 2004 (38)July 2004 (39)June 2004 (67)May 2004 (44)April 2004 (48)March 2004 (60)February 2004 (44)January 2004 (36)December 2003 (42)November 2003 (38)October 2003 (108)September 2003 (49)August 2003 (25)July 2003 (42)June 2003 (29)May 2003 (41)April 2003 (48)March 2003 (48)February 2003 (42)January 2003 (46)December 2002 (32)November 2002 (22)October 2002 (90)September 2002 (34)August 2002 (23)July 2002 (36)June 2002 (9)May 2002 (4)April 2002 (7)March 2002 (4)February 2002 (6)January 2002 (3)December 2001 (3)June 2001 (1)January 2001 (1)November 1999 (3)September 1999 (1)June 1999 (1)March 1999 (1)September 1998 (1)July 1996 (1)January 1996 (1)July 1995 (1)May 1994 (4)0 (1) **Archives** **Archives** Copyright ©2025 Jansi LLC. Donate to Metro Weekly Past Issues Site Map Support MW RSS Feed **** **** You must belogged into post a comment. ****"}