{"id": 540, "name": "Frontiers in Drug Discovery", "domain": "frontiersin.org/journals/drug-discovery", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/drug-discovery/articles/10.3389/fddsv.2025.1628789/full", "title": "Drug Discovery", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Anti-Cancer Drugs Anti-Infective Agents Anti-inflammatory and Immunomodulating Agents Cardiovascular and Hematologic Drugs Dermatologic Drugs In silico Methods and Artificial Intelligence for Drug Discovery Neurological Drugs Technologies and Strategies to Enable Drug Discovery Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Anti-Cancer Drugs Anti-Infective Agents Anti-inflammatory and Immunomodulating Agents Cardiovascular and Hematologic Drugs Dermatologic Drugs In silico Methods and Artificial Intelligence for Drug Discovery Neurological Drugs Technologies and Strategies to Enable Drug Discovery Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Anti-Cancer Drugs Anti-Infective Agents Anti-inflammatory and Immunomodulating Agents Cardiovascular and Hematologic Drugs Dermatologic Drugs In silico Methods and Artificial Intelligence for Drug Discovery Neurological Drugs Technologies and Strategies to Enable Drug Discovery Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office MINI REVIEW article Front. Drug Discov. Sec. In silico Methods and Artificial Intelligence for Drug Discovery Volume 5 - 2025 |doi: 10.3389/fddsv.2025.1628789 **AI-Driven Innovation in Antibody-Drug Conjugate Design** 1Department of Pharmaceutical Sciences, College of Pharmacy, Howard University, Washington, D.C., United States 2Artificial Intelligence and Drug Discovery (AIDD) Core Laboratory for District of Columbia Center for AIDS Research (DC CFAR), Washington DC, United States The final, formatted version of the article will be published soon. Select one of your emails You have multiple emails registered with Frontiers: Notify me on publication Please enter your email address: If you already have an account, pleaselogin You don't have a Frontiers account ? You canregister here Antibody-drug conjugates (ADCs) represent a mechanistically defined class of targeted therapeutics that combine monoclonal antibodies with cytotoxic payloads to achieve selective delivery to antigen-expressing carcinoma cells. Conventional ADC development has primarily relied on empirical screening and structure-based design, often limited by incomplete structural information, non-systematic linker-payload selection, and constraints in experimental throughput. Computational methods, including artificial intelligence and machine learning (AI/ML) are increasingly being integrated into ADC discovery and optimization workflows (i.e. AI-driven ADC Design) to address these limitations. This review is organized into six sections: (1) the progression from traditional modeling approaches to AI-driven design of individual ADC components; (2) the application of deep learning (DL) to antibody structure prediction and identification of optimal conjugation sites; (3) the use of AI/ML models for forecasting pharmacokinetic properties and toxicity profiles; (4) emerging generative algorithms for antibody sequence diversification and affinity optimization;(5) case studies demonstrating the integration of computational tools with experimental pipelines, including systems that link in silico predictions to high-throughput validation; and (6) persistent challenges, including data sparsity, model interpretability, validation complexity, and regulatory considerations. The review concludes with a discussion of future directions, emphasizing the role of multimodal data integration, reinforcement learning (RL), and closedloop design frameworks to support iterative ADC development. Keywords:AI/ML (Artificial Intelligence/Machine Learning), antibody-drug conjugate (ADC), AlphaFold 3, Neural ODEs, Generative & algorithmic design Received:15 May 2025;Accepted:02 Jun 2025. Copyright:© 2025Noriega and Wang. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) or licensor are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. * Correspondence:Heather A Noriega, Department of Pharmaceutical Sciences, College of Pharmacy, Howard University, Washington, D.C., United States Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Share on Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}