{"id": 1797, "name": "Right Wing News", "domain": "rightwingnews.com", "bias": "fake-news", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://rightwingnews.com/column-2/after-20-years-in-politics-here-are-20-pieces-of-political-advice-for-conservatives/", "title": "After 20 Years In Politics Here Are 20 Pieces Of Political Advice For Conservatives", "content": "0 0 0 0 Home About Writers Contact Us Media/Marketing Inquiries Privacy Home FeaturedArchivesBest of RWN HumorJohn HawkinsInterviewsQuotesSpecial to RWNPolling Archives Best of RWN Humor John Hawkins Interviews Quotes Special to RWN Polling Archives Best of RWN Humor John Hawkins Interviews Quotes Special to RWN Polling Advertising FAQ RSS Feed PJ Media YouTube Right Report **After 20 Years in Politics, Here Are 20 Pieces of Political Advice for Conservatives** 12SHARES Share Tweet Comment Now0 I have been in politics now since 2001 and I’ve done a lot in that time. My websiteRight Wing Newswas one of the 10,000 biggest websites in America, I was a social media consultant for Duncan Hunter’s presidential campaign, I’ve been one of the most-read conservative columnists in America (I’ve been published in Townhall, Human Events, PJ Media, National Review, Hot Air, Gateway Pundit, BizPac Review, the Western Journal, The Dispatch, The Daily Wire, and numerous other outlets), I had a book that was in thetop 50 in the self-help sectionwhen it came out, I’ve done hundreds of hours of radio, I’ve helped raise hundreds of thousands of dollars for Republican candidates, was behind a$600,000 GoFundMe for Brett Kavanaugh, built one of the biggest conservative Facebook pages in America, and was one of the first people to have that Facebook page targeted for cancelation by Mark Zuckerberg and company. There are lots of other things I could add, but you get the idea. I didn’t just roll off the turnip truck yesterday. I’ve been doing this stuff for a long time. I’ve done a lot and I’ve learned a lot. With that in mind, let me take that twenty years of grassroots political experience and turn it into a column with 20 pieces of political advice for conservatives.1) The slippery slope:Usually, when conservatives predict that we may be going down a slippery slope, we turn out to be right, and if anything, we usually end up underselling it. Whether you are talking about spending, gay marriage, Obamacare, statues, immigration, or anything else, if you give an inch, the Left will take a mile and end up doing every single thing they swear up and down on a stack of Bibles that they would never do.2) Until you understand this, you don’t understand politicians:“No one will really understand politics until they understand that politicians are not trying to solve our problems. They are trying to solve their own problems — of which getting elected and re-elected are No. 1 and No. 2. Whatever is No. 3 is far behind.”— Thomas Sowell3) Politics is a racket:One of my favorite philosophers is Eric Hoffer and he was right when he said,“Every great cause begins as a movement, becomes a business, and eventually degenerates into a racket.”It sounds cynical, but if you want to understand why the PACs, the news organizations, the talking heads, the consultants, and the politicians do what they do and say what they say, assume it has to do with money and you’ll be right most of the time. The sheer amount of money that flows into politics without accomplishing anything other than making some hack’s wallet fatter is almost beyond belief.4) Culture matters:Like the late, great Andrew Breitbart famously said,“Politics is downstream from culture.”If you have a culture with a withered Christian church, that lauds abortion, celebrates drag queen story hours, and teaches people that America is a bad place to live and its Founding Fathers are evil because they weren’t woke liberals, what do you think the politicians that come out of that culture are going to be like? Where do you think the Overton Window is going to be for what they can possibly do? If your culture is a toilet, you can’t expect politics to be anything other than a sewer.5) My 80% friend:Ronald Reagan once said that,“My eighty-percent friend is not my twenty-percent enemy.”It needed to be said because conservatives have a horrible tendency to viciously crap all over people who mostly agree with them and it regularly ends up badly hurting the Republican Party.6) This country is going to go broke: Our debt situation is orders of magnitude worse than people think it is, yet there is very little pressure on Washington to reduce spending. What that means is that we are going broke, Social Security and Medicare are not going to be there in their current form, probably for even middle-aged Americans, and all the “elites” will just move somewhere else. If you aren’t one of the people rich enough to do that, buy guns, start learning to prep and plan accordingly for thecomplete havoc that will ensue when the U.S. government can’t pay its bills.7) Post-persuasion America:We are in what Jeff Deist calls, “post persuasion” America. Most people believe things today because their “tribe” tells them to, not because of logic, proof, or good arguments. There aren’t many open-minded people or original thinkers left and trying to “logic” the others out of the position they adopted because of emotion and tribalism usually turns out to be pointless. What that means in Jeff Deist’s words is that politics is now more “about mobilization rather than persuasion.” That doesn’t mean persuasion is pointless, just that in and of itself, it isn’t enough.8) We don’t need a new law:The problem is almost never that we don’t have a law, it’s either that we aren’t following laws that have already been passed or some other law has created a problem that liberals want to solve with a new law.9) When to really look out:Whenever Republicans and Democrats come together and cooperate to pass a bill, usually during an “emergency,” you can be 100% sure that it’s going to waste an incredible amount of money or be really bad for the country.10) The media is worse than it ever has been:Between social media, the rise of conspiracy theories, the rapid deterioration of the mainstream media, and the corporate, profit-oriented takeover of the news business, there is no way for the average person to get accurate news about the world anymore. Most of the information you hear is propaganda, heavily slanted, or just plain wrong. How we get back to news people can trust, I don’t know.11) Politics 101:The first thing you need to do as a politician is keep your base happy and then after that’s done, you can feel free to reach out to independents in ways that won’t aggravate your supporters. Republicans often forget this rule, but Democrats never do.12) Style vs. principle:The great Thomas Jefferson once said,“In matters of style, swim with the current; in matters of principle, stand like a rock.”Don’t give up your principles, but don’t feel like you have to do things as they have always been done or stick with the same stale agenda either. The country and the world changes on a regular basis and your ideology should address those changes to stay relevant.13) If there are enough people buying, someone will be selling:It doesn’t matter if you want to hear that lizard people rule the earth or that George Bush is going to combine America with Canada and Mexico, if there are enough people that want to hear a message, someone will rise up to give up, whether it’s true, false, sane, nuts, or anywhere in-between. Be very careful that you don’t become the embodiment of that verse from 2 Timothy 4:“For the time will come when they will not endure sound doctrine; but after their own lusts shall they heap to themselves teachers, having itching ears; And they shall turn away their ears from the truth, and shall be turned unto fables.”14) A conservative third party is doomed to fail:The establishment conservatives and the grassroots conservatives need each other to succeed and the more the establishment types forget that, the more the grassroots conservatives want to start a third party. If grassroots conservatives can’t even take over the Republican Party, why would anyone think they could create and maintain a successful third party that would be ideologically less competitive than the GOP in blue and even many purple districts? At the end of the day, you don’t win elections by splitting your vote, you win elections by gathering all your supporters together and finding a way to add more people.15) Don’t ever, ever, ever…:apologize to an online mobthat only wants your scalp. They will use your apology as evidence that they were right to persecute you and redouble their efforts while you grovel even more without effect. Instead, be completely shameless, laugh in their face, and don’t back up one inch. The people that do the best in the face of these mobs never back down.16) The nature of liberals:There is almost nothing a liberal is incapable of doing if you don’t have some kind of figurative stick to hit them with. Liberals don’t care about human decency, intellectual honesty, morality, the good of the country, the results of their programs, or the Constitution. What they do understand and care about is, “This may have negative consequences for me or liberalism.” Remember that and act accordingly.17) Having a moral, decent, well-mannered populace matters far more than most people realize. Maybe more than anything else:“A general dissolution of principles and manners will more surely overthrow the liberties of America than the whole force of the common enemy. While the people are virtuous they cannot be subdued; but when once they lose their virtue then will be ready to surrender their liberties to the first external or internal invader.”—Samuel Adams, 177918) Government is a necessary evil, not a good:The bigger the government gets, the smaller the economy becomes, the more people become dependent on it, the less freedom you have, the more problems it causes, and the worse off we all are. Our government does not solve problems, it masks problems while creating new ones in their place at the cost of a staggering amount of money. Dig into the worst problems America has and at their root, you will almost always find things the government has done that created the problems in the first place.19) What’s radical for liberals today will be mainstream tomorrow:Because of the obsessive need for liberals to top each other in virtue signaling just how compassionate, sensitive, and racially aware they are, they are now prone to radically shift their positions to the Left in fairly short time periods. What that means is that many of the craziest ideas on the liberal fringes today will be relatively popular on the Left in 5 years and will be the position of the Democratic Party in 10-12 years. If you don’t buy that, look how many orders of magnitude crazier the mainstream positions of the Democrats are today than they were just 12 years ago when Barack Obama was first elected.20) Fix immigration or nothing else matters:The Democrats have rigged our entire immigration system in a way so that it’s set on autopilot to increase their number of voters every year. They bring in people from socialist countries, encourage them to use our welfare programs, and not to assimilate. Then, those voters go heavily for Democrats. Ultimately, either this issue gets fixed or we lose on every other issue because the country is being deliberately demographically overwhelmed with people that are heavily predisposed to vote Democrat.John Hawkins is the author of101 Things All Young Adults Should Knowand you can follow him on Parlerhere. This originallyappearedonBongino.com. I have been in politics now since 2001 and I’ve done a lot in that time. My websiteRight Wing Newswas one of the 10,000 biggest websites in America, I was a social media consultant for Duncan Hunter’s presidential campaign, I’ve been one of the most-read conservative columnists in America (I’ve been published in Townhall, Human Events, PJ Media, National Review, Hot Air, Gateway Pundit, BizPac Review, the Western Journal, The Dispatch, The Daily Wire, and numerous other outlets), I had a book that was in thetop 50 in the self-help sectionwhen it came out, I’ve done hundreds of hours of radio, I’ve helped raise hundreds of thousands of dollars for Republican candidates, was behind a$600,000 GoFundMe for Brett Kavanaugh, built one of the biggest conservative Facebook pages in America, and was one of the first people to have that Facebook page targeted for cancelation by Mark Zuckerberg and company. There are lots of other things I could add, but you get the idea. I didn’t just roll off the turnip truck yesterday. I’ve been doing this stuff for a long time. I’ve done a lot and I’ve learned a lot. With that in mind, let me take that twenty years of grassroots political experience and turn it into a column with 20 pieces of political advice for conservatives. 1) The slippery slope:Usually, when conservatives predict that we may be going down a slippery slope, we turn out to be right, and if anything, we usually end up underselling it. Whether you are talking about spending, gay marriage, Obamacare, statues, immigration, or anything else, if you give an inch, the Left will take a mile and end up doing every single thing they swear up and down on a stack of Bibles that they would never do. 2) Until you understand this, you don’t understand politicians:“No one will really understand politics until they understand that politicians are not trying to solve our problems. They are trying to solve their own problems — of which getting elected and re-elected are No. 1 and No. 2. Whatever is No. 3 is far behind.”— Thomas Sowell 3) Politics is a racket:One of my favorite philosophers is Eric Hoffer and he was right when he said,“Every great cause begins as a movement, becomes a business, and eventually degenerates into a racket.”It sounds cynical, but if you want to understand why the PACs, the news organizations, the talking heads, the consultants, and the politicians do what they do and say what they say, assume it has to do with money and you’ll be right most of the time. The sheer amount of money that flows into politics without accomplishing anything other than making some hack’s wallet fatter is almost beyond belief. 4) Culture matters:Like the late, great Andrew Breitbart famously said,“Politics is downstream from culture.”If you have a culture with a withered Christian church, that lauds abortion, celebrates drag queen story hours, and teaches people that America is a bad place to live and its Founding Fathers are evil because they weren’t woke liberals, what do you think the politicians that come out of that culture are going to be like? Where do you think the Overton Window is going to be for what they can possibly do? If your culture is a toilet, you can’t expect politics to be anything other than a sewer. 5) My 80% friend:Ronald Reagan once said that,“My eighty-percent friend is not my twenty-percent enemy.”It needed to be said because conservatives have a horrible tendency to viciously crap all over people who mostly agree with them and it regularly ends up badly hurting the Republican Party. 6) This country is going to go broke: Our debt situation is orders of magnitude worse than people think it is, yet there is very little pressure on Washington to reduce spending. What that means is that we are going broke, Social Security and Medicare are not going to be there in their current form, probably for even middle-aged Americans, and all the “elites” will just move somewhere else. If you aren’t one of the people rich enough to do that, buy guns, start learning to prep and plan accordingly for thecomplete havoc that will ensue when the U.S. government can’t pay its bills. 7) Post-persuasion America:We are in what Jeff Deist calls, “post persuasion” America. Most people believe things today because their “tribe” tells them to, not because of logic, proof, or good arguments. There aren’t many open-minded people or original thinkers left and trying to “logic” the others out of the position they adopted because of emotion and tribalism usually turns out to be pointless. What that means in Jeff Deist’s words is that politics is now more “about mobilization rather than persuasion.” That doesn’t mean persuasion is pointless, just that in and of itself, it isn’t enough. 8) We don’t need a new law:The problem is almost never that we don’t have a law, it’s either that we aren’t following laws that have already been passed or some other law has created a problem that liberals want to solve with a new law. 9) When to really look out:Whenever Republicans and Democrats come together and cooperate to pass a bill, usually during an “emergency,” you can be 100% sure that it’s going to waste an incredible amount of money or be really bad for the country. 10) The media is worse than it ever has been:Between social media, the rise of conspiracy theories, the rapid deterioration of the mainstream media, and the corporate, profit-oriented takeover of the news business, there is no way for the average person to get accurate news about the world anymore. Most of the information you hear is propaganda, heavily slanted, or just plain wrong. How we get back to news people can trust, I don’t know. 11) Politics 101:The first thing you need to do as a politician is keep your base happy and then after that’s done, you can feel free to reach out to independents in ways that won’t aggravate your supporters. Republicans often forget this rule, but Democrats never do. 12) Style vs. principle:The great Thomas Jefferson once said,“In matters of style, swim with the current; in matters of principle, stand like a rock.”Don’t give up your principles, but don’t feel like you have to do things as they have always been done or stick with the same stale agenda either. The country and the world changes on a regular basis and your ideology should address those changes to stay relevant. 13) If there are enough people buying, someone will be selling:It doesn’t matter if you want to hear that lizard people rule the earth or that George Bush is going to combine America with Canada and Mexico, if there are enough people that want to hear a message, someone will rise up to give up, whether it’s true, false, sane, nuts, or anywhere in-between. Be very careful that you don’t become the embodiment of that verse from 2 Timothy 4: “For the time will come when they will not endure sound doctrine; but after their own lusts shall they heap to themselves teachers, having itching ears; And they shall turn away their ears from the truth, and shall be turned unto fables.” 14) A conservative third party is doomed to fail:The establishment conservatives and the grassroots conservatives need each other to succeed and the more the establishment types forget that, the more the grassroots conservatives want to start a third party. If grassroots conservatives can’t even take over the Republican Party, why would anyone think they could create and maintain a successful third party that would be ideologically less competitive than the GOP in blue and even many purple districts? At the end of the day, you don’t win elections by splitting your vote, you win elections by gathering all your supporters together and finding a way to add more people. 15) Don’t ever, ever, ever…:apologize to an online mobthat only wants your scalp. They will use your apology as evidence that they were right to persecute you and redouble their efforts while you grovel even more without effect. Instead, be completely shameless, laugh in their face, and don’t back up one inch. The people that do the best in the face of these mobs never back down. 16) The nature of liberals:There is almost nothing a liberal is incapable of doing if you don’t have some kind of figurative stick to hit them with. Liberals don’t care about human decency, intellectual honesty, morality, the good of the country, the results of their programs, or the Constitution. What they do understand and care about is, “This may have negative consequences for me or liberalism.” Remember that and act accordingly. 17) Having a moral, decent, well-mannered populace matters far more than most people realize. Maybe more than anything else:“A general dissolution of principles and manners will more surely overthrow the liberties of America than the whole force of the common enemy. While the people are virtuous they cannot be subdued; but when once they lose their virtue then will be ready to surrender their liberties to the first external or internal invader.”—Samuel Adams, 1779 18) Government is a necessary evil, not a good:The bigger the government gets, the smaller the economy becomes, the more people become dependent on it, the less freedom you have, the more problems it causes, and the worse off we all are. Our government does not solve problems, it masks problems while creating new ones in their place at the cost of a staggering amount of money. Dig into the worst problems America has and at their root, you will almost always find things the government has done that created the problems in the first place. 19) What’s radical for liberals today will be mainstream tomorrow:Because of the obsessive need for liberals to top each other in virtue signaling just how compassionate, sensitive, and racially aware they are, they are now prone to radically shift their positions to the Left in fairly short time periods. What that means is that many of the craziest ideas on the liberal fringes today will be relatively popular on the Left in 5 years and will be the position of the Democratic Party in 10-12 years. If you don’t buy that, look how many orders of magnitude crazier the mainstream positions of the Democrats are today than they were just 12 years ago when Barack Obama was first elected. 20) Fix immigration or nothing else matters:The Democrats have rigged our entire immigration system in a way so that it’s set on autopilot to increase their number of voters every year. They bring in people from socialist countries, encourage them to use our welfare programs, and not to assimilate. Then, those voters go heavily for Democrats. Ultimately, either this issue gets fixed or we lose on every other issue because the country is being deliberately demographically overwhelmed with people that are heavily predisposed to vote Democrat. John Hawkins is the author of101 Things All Young Adults Should Knowand you can follow him on Parlerhere. This originallyappearedonBongino.com. I have been in politics now since 2001 and I’ve done a lot in that time. My websiteRight Wing Newswas one of the 10,000 biggest websites in America, I was a social media consultant for Duncan Hunter’s presidential campaign, I’ve been one of the most-read conservative columnists in America (I’ve been published in Townhall, Human Events, PJ Media, National Review, Hot Air, Gateway Pundit, BizPac Review, the Western Journal, The Dispatch, The Daily Wire, and numerous other outlets), I had a book that was in thetop 50 in the self-help sectionwhen it came out, I’ve done hundreds of hours of radio, I’ve helped raise hundreds of thousands of dollars for Republican candidates, was behind a$600,000 GoFundMe for Brett Kavanaugh, built one of the biggest conservative Facebook pages in America, and was one of the first people to have that Facebook page targeted for cancelation by Mark Zuckerberg and company. There are lots of other things I could add, but you get the idea. I didn’t just roll off the turnip truck yesterday. I’ve been doing this stuff for a long time. I’ve done a lot and I’ve learned a lot. With that in mind, let me take that twenty years of grassroots political experience and turn it into a column with 20 pieces of political advice for conservatives. 1) The slippery slope:Usually, when conservatives predict that we may be going down a slippery slope, we turn out to be right, and if anything, we usually end up underselling it. Whether you are talking about spending, gay marriage, Obamacare, statues, immigration, or anything else, if you give an inch, the Left will take a mile and end up doing every single thing they swear up and down on a stack of Bibles that they would never do. 2) Until you understand this, you don’t understand politicians:“No one will really understand politics until they understand that politicians are not trying to solve our problems. They are trying to solve their own problems — of which getting elected and re-elected are No. 1 and No. 2. Whatever is No. 3 is far behind.”— Thomas Sowell 3) Politics is a racket:One of my favorite philosophers is Eric Hoffer and he was right when he said,“Every great cause begins as a movement, becomes a business, and eventually degenerates into a racket.”It sounds cynical, but if you want to understand why the PACs, the news organizations, the talking heads, the consultants, and the politicians do what they do and say what they say, assume it has to do with money and you’ll be right most of the time. The sheer amount of money that flows into politics without accomplishing anything other than making some hack’s wallet fatter is almost beyond belief. 4) Culture matters:Like the late, great Andrew Breitbart famously said,“Politics is downstream from culture.”If you have a culture with a withered Christian church, that lauds abortion, celebrates drag queen story hours, and teaches people that America is a bad place to live and its Founding Fathers are evil because they weren’t woke liberals, what do you think the politicians that come out of that culture are going to be like? Where do you think the Overton Window is going to be for what they can possibly do? If your culture is a toilet, you can’t expect politics to be anything other than a sewer. 5) My 80% friend:Ronald Reagan once said that,“My eighty-percent friend is not my twenty-percent enemy.”It needed to be said because conservatives have a horrible tendency to viciously crap all over people who mostly agree with them and it regularly ends up badly hurting the Republican Party. 6) This country is going to go broke: Our debt situation is orders of magnitude worse than people think it is, yet there is very little pressure on Washington to reduce spending. What that means is that we are going broke, Social Security and Medicare are not going to be there in their current form, probably for even middle-aged Americans, and all the “elites” will just move somewhere else. If you aren’t one of the people rich enough to do that, buy guns, start learning to prep and plan accordingly for thecomplete havoc that will ensue when the U.S. government can’t pay its bills. 7) Post-persuasion America:We are in what Jeff Deist calls, “post persuasion” America. Most people believe things today because their “tribe” tells them to, not because of logic, proof, or good arguments. There aren’t many open-minded people or original thinkers left and trying to “logic” the others out of the position they adopted because of emotion and tribalism usually turns out to be pointless. What that means in Jeff Deist’s words is that politics is now more “about mobilization rather than persuasion.” That doesn’t mean persuasion is pointless, just that in and of itself, it isn’t enough. 8) We don’t need a new law:The problem is almost never that we don’t have a law, it’s either that we aren’t following laws that have already been passed or some other law has created a problem that liberals want to solve with a new law. 9) When to really look out:Whenever Republicans and Democrats come together and cooperate to pass a bill, usually during an “emergency,” you can be 100% sure that it’s going to waste an incredible amount of money or be really bad for the country. 10) The media is worse than it ever has been:Between social media, the rise of conspiracy theories, the rapid deterioration of the mainstream media, and the corporate, profit-oriented takeover of the news business, there is no way for the average person to get accurate news about the world anymore. Most of the information you hear is propaganda, heavily slanted, or just plain wrong. How we get back to news people can trust, I don’t know. 11) Politics 101:The first thing you need to do as a politician is keep your base happy and then after that’s done, you can feel free to reach out to independents in ways that won’t aggravate your supporters. Republicans often forget this rule, but Democrats never do. 12) Style vs. principle:The great Thomas Jefferson once said,“In matters of style, swim with the current; in matters of principle, stand like a rock.”Don’t give up your principles, but don’t feel like you have to do things as they have always been done or stick with the same stale agenda either. The country and the world changes on a regular basis and your ideology should address those changes to stay relevant. 13) If there are enough people buying, someone will be selling:It doesn’t matter if you want to hear that lizard people rule the earth or that George Bush is going to combine America with Canada and Mexico, if there are enough people that want to hear a message, someone will rise up to give up, whether it’s true, false, sane, nuts, or anywhere in-between. Be very careful that you don’t become the embodiment of that verse from 2 Timothy 4: “For the time will come when they will not endure sound doctrine; but after their own lusts shall they heap to themselves teachers, having itching ears; And they shall turn away their ears from the truth, and shall be turned unto fables.” 14) A conservative third party is doomed to fail:The establishment conservatives and the grassroots conservatives need each other to succeed and the more the establishment types forget that, the more the grassroots conservatives want to start a third party. If grassroots conservatives can’t even take over the Republican Party, why would anyone think they could create and maintain a successful third party that would be ideologically less competitive than the GOP in blue and even many purple districts? At the end of the day, you don’t win elections by splitting your vote, you win elections by gathering all your supporters together and finding a way to add more people. 15) Don’t ever, ever, ever…:apologize to an online mobthat only wants your scalp. They will use your apology as evidence that they were right to persecute you and redouble their efforts while you grovel even more without effect. Instead, be completely shameless, laugh in their face, and don’t back up one inch. The people that do the best in the face of these mobs never back down. 16) The nature of liberals:There is almost nothing a liberal is incapable of doing if you don’t have some kind of figurative stick to hit them with. Liberals don’t care about human decency, intellectual honesty, morality, the good of the country, the results of their programs, or the Constitution. What they do understand and care about is, “This may have negative consequences for me or liberalism.” Remember that and act accordingly. 17) Having a moral, decent, well-mannered populace matters far more than most people realize. Maybe more than anything else:“A general dissolution of principles and manners will more surely overthrow the liberties of America than the whole force of the common enemy. While the people are virtuous they cannot be subdued; but when once they lose their virtue then will be ready to surrender their liberties to the first external or internal invader.”—Samuel Adams, 1779 18) Government is a necessary evil, not a good:The bigger the government gets, the smaller the economy becomes, the more people become dependent on it, the less freedom you have, the more problems it causes, and the worse off we all are. Our government does not solve problems, it masks problems while creating new ones in their place at the cost of a staggering amount of money. Dig into the worst problems America has and at their root, you will almost always find things the government has done that created the problems in the first place. 19) What’s radical for liberals today will be mainstream tomorrow:Because of the obsessive need for liberals to top each other in virtue signaling just how compassionate, sensitive, and racially aware they are, they are now prone to radically shift their positions to the Left in fairly short time periods. What that means is that many of the craziest ideas on the liberal fringes today will be relatively popular on the Left in 5 years and will be the position of the Democratic Party in 10-12 years. If you don’t buy that, look how many orders of magnitude crazier the mainstream positions of the Democrats are today than they were just 12 years ago when Barack Obama was first elected. 20) Fix immigration or nothing else matters:The Democrats have rigged our entire immigration system in a way so that it’s set on autopilot to increase their number of voters every year. They bring in people from socialist countries, encourage them to use our welfare programs, and not to assimilate. Then, those voters go heavily for Democrats. Ultimately, either this issue gets fixed or we lose on every other issue because the country is being deliberately demographically overwhelmed with people that are heavily predisposed to vote Democrat. John Hawkins is the author of101 Things All Young Adults Should Knowand you can follow him on Parlerhere. This originallyappearedonBongino.com. 12SHARES Share Tweet Comment Now0 **John Hawkins** **Trending on RightWingNews.com** **The 15 Best Conservative News Sites On The Internet** **The 15 Best Conservative News Sites On The Internet** **5 Reasons Thinking of Yourself as a Victim Makes Your Life Worse** **5 Reasons Thinking of Yourself as a Victim Makes Your Life Worse** **Why Rush Limbaugh Was Right When He Said America Is “Trending Toward Secession”** **Why Rush Limbaugh Was Right When He Said America Is “Trending Toward Secession”** **How to Fix Almost Everything Wrong With America in a Single Sentence** **How to Fix Almost Everything Wrong With America in a Single Sentence** **A New Slogan For Obama’s 2012 Campaign (Pic)** **A New Slogan For Obama’s 2012 Campaign (Pic)** **NFL Investors Reconsider Their Support After Nat’l Anthem Protests – This Is Going To Hurt!** **NFL Investors Reconsider Their Support After Nat’l Anthem Protests – This Is Going To Hurt!** **Right Report** **Permalinks** Culturcidal Grumpy Sloth Crypto Instapundit Intellectual Conservative Matt Lewis David Limbaugh The Last Tradition Likelihood of Confusion Linkiest Moonbattery Noisy Room Pirate’s Cove The Other McCain Doug Ross Trending Views Wintery Knight © 2001-2025 CopyrightJohn Hawkins. All Rights reserved.Proudly built byWPDevelopers **Loading, Please Wait!** **Share this!** Share Tweet"}