{"id": 1173, "name": "Eaton Register-Herald", "domain": "registerherald.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.registerherald.com/2025/06/09/city-of-eaton-awarded-275k-for-north-maple-street-sidewalk-upgrades/#respond", "title": "City Of Eaton Awarded 275k For North Maple Street Sidewalk Upgrades", "content": "NewsLatest NewsSubmit News Tip Latest News Submit News Tip Latest News Submit News Tip SportsLatest SportsSubmit ScoresSubmit Sports NewsSports Betting Latest Sports Submit Scores Submit Sports News Sports Betting Latest Sports Submit Scores Submit Sports News Sports Betting ObituariesSubmit Obituary Submit Obituary Submit Obituary OpinionLatest OpinionSubmit Letter To The Editor Latest Opinion Submit Letter To The Editor Latest Opinion Submit Letter To The Editor Life & CultureCommunity NewsLocal EntertainmentSubmit AnniversarySubmit BirthSubmit BirthdaySubmit EngagementSubmit Wedding Community News Local Entertainment Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding Community News Local Entertainment Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding ClassifiedsJob Match OhioOhio Public Notices Job Match Ohio Ohio Public Notices Job Match Ohio Ohio Public Notices Businesses Connect with usAbout UsAdvertise with UsDigital AdvertisingContact UsPrivacy Policy About Us Advertise with Us Digital Advertising Contact Us Privacy Policy About Us Advertise with Us Digital Advertising Contact Us Privacy Policy E-Edition NewsLatest NewsSubmit News Tip Latest News Submit News Tip Latest News Submit News Tip SportsLatest SportsSubmit ScoresSubmit Sports NewsSports Betting Latest Sports Submit Scores Submit Sports News Sports Betting Latest Sports Submit Scores Submit Sports News Sports Betting ObituariesSubmit Obituary Submit Obituary Submit Obituary OpinionLatest OpinionSubmit Letter To The Editor Latest Opinion Submit Letter To The Editor Latest Opinion Submit Letter To The Editor Life & CultureCommunity NewsLocal EntertainmentSubmit AnniversarySubmit BirthSubmit BirthdaySubmit EngagementSubmit Wedding Community News Local Entertainment Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding Community News Local Entertainment Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding ClassifiedsJob Match OhioOhio Public Notices Job Match Ohio Ohio Public Notices Job Match Ohio Ohio Public Notices Businesses Connect with usAbout UsAdvertise with UsDigital AdvertisingContact UsPrivacy Policy About Us Advertise with Us Digital Advertising Contact Us Privacy Policy About Us Advertise with Us Digital Advertising Contact Us Privacy Policy News Top Stories **City of Eaton awarded $275K for North Maple Street sidewalk upgrades** EATON — The City of Eaton will receive $275,303 in state funding to reconstruct sidewalks along North Maple Street as part of a broader effort to improve pedestrian and bicycle safety across Ohio. Governor Mike DeWine and Ohio Department of Transportation Director Pamela Boratyn announced nearly $52 million in Transportation Alternatives Program (TAP) grants last week, with Eaton’s Phase 3 North Maple Street Reconstruction Project included among the 44 projects funded in 33 counties. The Eaton project, scheduled for 2028, includes replacing damaged sidewalks on both sides of North Maple Street with ADA-compliant sidewalks and curb ramps, enhancing accessibility and safety for pedestrians in the community. “The Transportation Alternatives Program makes vital investments to support safer, more connected spaces for walking and biking,” DeWine said. “This program helps improve quality of life, enhance public safety, and build sustainable transportation networks that make our cities and towns stronger and more vibrant.” The TAP program supports infrastructure projects that promote active transportation, including pedestrian and bicycle facilities, recreational trails, and Safe Routes to School projects. According to ODOT, project selection prioritized safety, connectivity, implementation readiness, and need. “Biking and walking are great modes of transportation that are not only fun, but foster connections, support local economies, and contribute to a healthier lifestyle,” Boratyn said. “We are proud to do our part to support active transportation in Ohio.” Funding through TAP is awarded over a four-year period, with emphasis on both shovel-ready efforts and long-term projects of statewide significance. Reach Eddie Mowen Jr. at 937-683-4061 and follow on X @emowenjr. **No posts to display**"}