{"id": 713, "name": "Jessamine Journal", "domain": "jessaminejournal.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://jessaminejournal.com/2025/05/28/trabue-chapter-daughters-of-the-american-revolution-holds-new-member-and-office-induction-ceremony/", "title": "Trabue Chapter Daughters Of The American Revolution Holds New Member And Office Induction Ceremony", "content": "Home E-Edition News Sports Obituaries Records Contests Services Classifieds Calendar Public Notices Home NewsFeaturesOpinion Features Opinion Features Opinion Sports Obituaries Records Contests ServicesAbout UsPoliciesPhotosSubmit a News TipSubmit a Sports StorySubmit a PhotoLetters to EditorPay Subscription About Us Policies Photos Submit a News Tip Submit a Sports Story Submit a Photo Letters to Editor Pay Subscription About Us Policies Photos Submit a News Tip Submit a Sports Story Submit a Photo Letters to Editor Pay Subscription Classifieds Calendar Public Notices E-Edition **Trabue Chapter Daughters of the American Revolution Holds New Member and Office Induction Ceremony** Published 4:52 pm Wednesday, May 28, 2025 BySpecial to The Jessamine Journal The Trabue Chapter of the Daughters of the American Revolution held their New Member Induction and Officer Installation at Duncan Tavern in Paris, Kentucky, recently. The chapter inducted a record annual number of 16 new members into the Jessamine County chapter. Before becoming a member of the Trabue chapter, each woman swore an oath to faithfully uphold the Constitution of the United States and to respect the Flag of the United States. They each promised to always promote the objectives of the National Society, to the best of their abilities. The objectives of the National Society of the Daughters of the American Revolution are: Historic Preservation, Education, and Patriotism. The new members are as follows: Sharon Bremer, Vivian Curl, Grace Dillow, Karen Dismuke, Carol Hill, Caroline Jones, Claire Jones, Kimberly Jones, Meredith Kretz, Diana Mobley, Campbell Mobley, Melissa Peel, Anita Placido, Janelle Shaner, Charlotte Slack, and Judy Woolums. **Email newsletter signup** Officers for the 2025-2028 term were also elected. They are as follows: Regent – Margie Maloney, Vice-Regent – Jamie Dunn, Chaplain – Diana Maldonado, Recording Secretary – Rhonda Watkins, Corresponding Secretary – Mary Roseman, Treasurer – Billie Goodwill, Registrar – Susan Buffin, Historian – Terrye Perkins, and Librarian – Pat Brell. Afterwards, the Daughters enjoyed a luncheon consisting of Salad, Kentucky Hot Brown, and Dessert. During the luncheon, the gavel was passed on to the new Regent, Margie Maloney, by the outgoing Regent, Kelley Cole. The gavel was originally presented to the Trabue Chapter in 1908. It was made from wood rescued from the historic Old North Church in Boston, Massachusetts. Following the luncheon, a tour of the historic Tavern was offered to new members. Duncan Tavern was built in 1788 by Joseph Duncan, who served in the Revolutionary War as a civilian armorer, and was inducted into the Virginia Militia as a Captain. Later on, he attained the rank of Major. By 1803, the tavern was called theGoddess of Liberty.Through several transitions, the structure fell onto hard times and by the early 20th century was condemned by the City of Paris in 1940. The large dilapidated home, the largest stone structure in Paris, was slated for demolition when it was offered for sale to Julia Spencer Ardery and her DAR Chapter, Jemima Johnson, for the price of $1.00. The sale came with a caveat by which they had to agree to renovate the structure and have it ready for use in one year. Mrs. Ardery assumed the enormous task and led the renovation. The renovated building contains a museum and a library and became the Kentucky Society of the Daughters of the American Revolution (KSDAR) official headquarters in 1941, when the building’s ownership was formally accepted by the Kentucky Society DAR Executive Board. Any woman 18 years and older who can prove lineal, bloodline descent from an ancestor who aided in achieving American Independence is eligible to join the DAR. She must provide documentation for each statement of birth, marriage and death, as well as of the Revolutionary War service of her Patriot ancestor. For additional information, contact Susan Buffin, Registrar, atfoster4188@aol.com By: Diana Maldonado, Chaplin, Trabue Chapter Contact Phone Number: 859-797-1934 **Featured Local Savings** **You Might Like** **Nicholasville Police Reports** **Nicholasville Police Reports** **400 Mile Yard Sale returns to Wilmore, Jessamine County** **400 Mile Yard Sale returns to Wilmore, Jessamine County** **George Allen Rhodus, 61** **George Allen Rhodus, 61** **Beyond stereotypes: Survey provides insights about trans Americans from trans Americans** **Beyond stereotypes: Survey provides insights about trans Americans from trans Americans** Upcoming Events **Upcoming Events** **Upcoming Events** Home News Sports Obituaries Opinion Public Records Contests Classifieds Small Business E-Edition Submit a News Tip Submit a Photo Submit a Sports Story Letters to Editor Public Notices About Us Terms of Use"}