{"id": 1046, "name": "New Zealand Herald", "domain": "nzherald.co.nz", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.nzherald.co.nz/lifestyle/society-insider-chef-al-brown-dating-businesswoman-wendy-francis-ching-the-carlin-hotels-transformation-former-st-kents-students-ivy-league-dreams/F55SJNOKL5AX7JDJI4SOVZEA4Y/", "title": "Society Insider Chef Al Brown Dating Businesswoman Wendy Francis Ching The Carlin Hotels Transformation Former St Kents Students Ivy League Dreams", "content": "Home Latest news Herald NOW Video New Zealand Sport World Business Entertainment Podcasts Quizzes Opinion Lifestyle Travel Viva Weather **Subscriptions** Herald Premium Viva Premium The Listener BusinessDesk **Sections** Latest news New ZealandAll New ZealandCrimePoliticsEducationOpen JusticeScam Update All New Zealand Crime Politics Education Open Justice Scam Update All New Zealand Crime Politics Education Open Justice Scam Update Herald NOW On The Up WorldAll WorldAustraliaAsiaUKUnited StatesMiddle EastEuropePacific All World Australia Asia UK United States Middle East Europe Pacific All World Australia Asia UK United States Middle East Europe Pacific BusinessAll BusinessMarketsSharesCurrencyCommoditiesStock TakesCryptoMarkets with MadisonMedia InsiderBusiness analysisPersonal financeKiwiSaverInterest ratesTaxInvestmentEconomyInflationGDPOfficial cash rateEmploymentSmall businessBusiness reportsMood of the BoardroomProject AucklandSustainable business and financeCapital markets reportAgribusiness reportInfrastructure reportDynamic businessDeloitte Top 200 AwardsCompaniesAged CareAgribusinessAirlinesBanking and financeConstructionEnergyFreight and logisticsHealthcareManufacturingMedia and MarketingRetailTelecommunicationsTourism All Business MarketsSharesCurrencyCommoditiesStock TakesCrypto Markets with Madison Media Insider Business analysis Personal financeKiwiSaverInterest ratesTaxInvestment EconomyInflationGDPOfficial cash rateEmployment Small business Business reportsMood of the BoardroomProject AucklandSustainable business and financeCapital markets reportAgribusiness reportInfrastructure reportDynamic business Deloitte Top 200 Awards CompaniesAged CareAgribusinessAirlinesBanking and financeConstructionEnergyFreight and logisticsHealthcareManufacturingMedia and MarketingRetailTelecommunicationsTourism All Business MarketsSharesCurrencyCommoditiesStock TakesCrypto Markets with Madison Media Insider Business analysis Personal financeKiwiSaverInterest ratesTaxInvestment EconomyInflationGDPOfficial cash rateEmployment Small business Business reportsMood of the BoardroomProject AucklandSustainable business and financeCapital markets reportAgribusiness reportInfrastructure reportDynamic business Deloitte Top 200 Awards CompaniesAged CareAgribusinessAirlinesBanking and financeConstructionEnergyFreight and logisticsHealthcareManufacturingMedia and MarketingRetailTelecommunicationsTourism OpinionAll OpinionAnalysisEditorialsBusiness analysisPremium opinionLetters to the editor All Opinion Analysis Editorials Business analysis Premium opinion Letters to the editor All Opinion Analysis Editorials Business analysis Premium opinion Letters to the editor Politics SportAll SportOlympicsParalympicsRugbySuper RugbyNPCAll BlacksBlack FernsRugby sevensSchool rugbyCricketBlack CapsWhite FernsRacingNetballSilver FernsLeagueWarriorsNRLFootballWellington PhoenixAuckland FCAll WhitesFootball FernsEnglish Premier LeagueGolfNZ OpenMotorsportFormula 1BoxingUFCBasketballNBABreakersTall BlacksTall FernsTennisCyclingAthleticsSailingAmerica's CupSailGPRowing All Sport OlympicsParalympics RugbySuper RugbyNPCAll BlacksBlack FernsRugby sevensSchool rugby CricketBlack CapsWhite Ferns Racing NetballSilver Ferns LeagueWarriorsNRL FootballWellington PhoenixAuckland FCAll WhitesFootball FernsEnglish Premier League GolfNZ Open MotorsportFormula 1 Boxing UFC BasketballNBABreakersTall BlacksTall Ferns Tennis Cycling Athletics SailingAmerica's CupSailGP Rowing All Sport OlympicsParalympics RugbySuper RugbyNPCAll BlacksBlack FernsRugby sevensSchool rugby CricketBlack CapsWhite Ferns Racing NetballSilver Ferns LeagueWarriorsNRL FootballWellington PhoenixAuckland FCAll WhitesFootball FernsEnglish Premier League GolfNZ Open MotorsportFormula 1 Boxing UFC BasketballNBABreakersTall BlacksTall Ferns Tennis Cycling Athletics SailingAmerica's CupSailGP Rowing LifestyleAll LifestyleViva - Food, fashion & beautySociety InsiderRoyalsSex & relationshipsFood & drinkRecipesRecipe collectionsRestaurant reviewsRestaurant bookingsHealth & wellbeingFashion & beautyPets & animalsThe Selection - Shop the trendsShop fashionShop beautyShop entertainmentShop giftsShop home & livingMilford's Investing Place All Lifestyle Viva - Food, fashion & beauty Society Insider Royals Sex & relationships Food & drinkRecipesRecipe collectionsRestaurant reviewsRestaurant bookings Health & wellbeing Fashion & beauty Pets & animals The Selection - Shop the trendsShop fashionShop beautyShop entertainmentShop giftsShop home & living Milford's Investing Place All Lifestyle Viva - Food, fashion & beauty Society Insider Royals Sex & relationships Food & drinkRecipesRecipe collectionsRestaurant reviewsRestaurant bookings Health & wellbeing Fashion & beauty Pets & animals The Selection - Shop the trendsShop fashionShop beautyShop entertainmentShop giftsShop home & living Milford's Investing Place EntertainmentAll EntertainmentTVMoviesMovie reviewsMusicMusic reviewsBooksBook reviewsCultureReviewsBook reviewsMovie reviewsMusic reviewsRestaurant reviews All Entertainment TV MoviesMovie reviews MusicMusic reviews BooksBook reviews Culture ReviewsBook reviewsMovie reviewsMusic reviewsRestaurant reviews All Entertainment TV MoviesMovie reviews MusicMusic reviews BooksBook reviews Culture ReviewsBook reviewsMovie reviewsMusic reviewsRestaurant reviews TravelAll TravelNewsNew ZealandNorthlandAucklandWellingtonCanterburyOtago / QueenstownNelson-TasmanBest NZ beachesInternational travelAustraliaPacific IslandsEuropeUKUSAAfricaAsiaRail holidaysCruise holidaysSki holidaysLuxury travelAdventure travel All Travel News New ZealandNorthlandAucklandWellingtonCanterburyOtago / QueenstownNelson-TasmanBest NZ beaches International travelAustraliaPacific IslandsEuropeUKUSAAfricaAsia Rail holidays Cruise holidays Ski holidays Luxury travel Adventure travel All Travel News New ZealandNorthlandAucklandWellingtonCanterburyOtago / QueenstownNelson-TasmanBest NZ beaches International travelAustraliaPacific IslandsEuropeUKUSAAfricaAsia Rail holidays Cruise holidays Ski holidays Luxury travel Adventure travel Kāhu Māori news EnvironmentAll EnvironmentOur Green Future All Environment Our Green Future All Environment Our Green Future Talanoa Pacific news PropertyAll PropertyProperty InsiderInterest rates trackerResidential property listingsCommercial property listings All Property Property Insider Interest rates tracker Residential property listings Commercial property listings All Property Property Insider Interest rates tracker Residential property listings Commercial property listings Health TechnologyAll TechnologyAISocial media All Technology AI Social media All Technology AI Social media RuralAll RuralDairy farmingSheep & beef farmingHorticultureAnimal healthRural businessRural lifeRural technologyOpinionAudio & podcasts All Rural Dairy farming Sheep & beef farming Horticulture Animal health Rural business Rural life Rural technology Opinion Audio & podcasts All Rural Dairy farming Sheep & beef farming Horticulture Animal health Rural business Rural life Rural technology Opinion Audio & podcasts Weather forecastsAll Weather forecastsKaitaiaWhangāreiDargavilleAucklandThamesTaurangaHamiltonWhakatāneRotoruaTokoroaTe KuitiTaumaranuiTaupōGisborneNew PlymouthNapierHastingsDannevirkeWhanganuiPalmerston NorthLevinParaparaumuMastertonWellingtonMotuekaNelsonBlenheimWestportReeftonKaikōuraGreymouthHokitikaChristchurchAshburtonTimaruWānakaOamaruQueenstownDunedinGoreInvercargill All Weather forecasts Kaitaia Whangārei Dargaville Auckland Thames Tauranga Hamilton Whakatāne Rotorua Tokoroa Te Kuiti Taumaranui Taupō Gisborne New Plymouth Napier Hastings Dannevirke Whanganui Palmerston North Levin Paraparaumu Masterton Wellington Motueka Nelson Blenheim Westport Reefton Kaikōura Greymouth Hokitika Christchurch Ashburton Timaru Wānaka Oamaru Queenstown Dunedin Gore Invercargill All Weather forecasts Kaitaia Whangārei Dargaville Auckland Thames Tauranga Hamilton Whakatāne Rotorua Tokoroa Te Kuiti Taumaranui Taupō Gisborne New Plymouth Napier Hastings Dannevirke Whanganui Palmerston North Levin Paraparaumu Masterton Wellington Motueka Nelson Blenheim Westport Reefton Kaikōura Greymouth Hokitika Christchurch Ashburton Timaru Wānaka Oamaru Queenstown Dunedin Gore Invercargill Meet the journalists Promotions & competitions OneRoof property listings Driven car news **Puzzles & Quizzes** PuzzlesAll PuzzlesSudokuCode CrackerCrosswordsCryptic crosswordWordsearch All Puzzles Sudoku Code Cracker Crosswords Cryptic crossword Wordsearch All Puzzles Sudoku Code Cracker Crosswords Cryptic crossword Wordsearch QuizzesAll QuizzesMorning quizAfternoon quizSports quiz All Quizzes Morning quiz Afternoon quiz Sports quiz All Quizzes Morning quiz Afternoon quiz Sports quiz **Regions** NorthlandAll NorthlandFar NorthKaitaiaKerikeriKaikoheBay of IslandsWhangareiDargavilleKaiparaMangawhai All Northland Far North Kaitaia Kerikeri Kaikohe Bay of Islands Whangarei Dargaville Kaipara Mangawhai All Northland Far North Kaitaia Kerikeri Kaikohe Bay of Islands Whangarei Dargaville Kaipara Mangawhai Auckland WaikatoAll WaikatoHamiltonCoromandel & HaurakiMatamata & PiakoCambridgeTe AwamutuTokoroa & South WaikatoTaupō & Tūrangi All Waikato Hamilton Coromandel & Hauraki Matamata & Piako Cambridge Te Awamutu Tokoroa & South Waikato Taupō & Tūrangi All Waikato Hamilton Coromandel & Hauraki Matamata & Piako Cambridge Te Awamutu Tokoroa & South Waikato Taupō & Tūrangi Bay of PlentyAll Bay of PlentyKatikatiTaurangaMount MaunganuiPāpāmoaTe PukeWhakatāne All Bay of Plenty Katikati Tauranga Mount Maunganui Pāpāmoa Te Puke Whakatāne All Bay of Plenty Katikati Tauranga Mount Maunganui Pāpāmoa Te Puke Whakatāne Rotorua Hawke's BayAll Hawke's BayNapierHastingsHavelock NorthCentral Hawke's BayWairoa All Hawke's Bay Napier Hastings Havelock North Central Hawke's Bay Wairoa All Hawke's Bay Napier Hastings Havelock North Central Hawke's Bay Wairoa TaranakiAll TaranakiStratfordNew PlymouthHāwera All Taranaki Stratford New Plymouth Hāwera All Taranaki Stratford New Plymouth Hāwera Manawatū - WhanganuiAll Manawatū - WhanganuiWhanganuiPalmerston NorthManawatūTararuaHorowhenua All Manawatū - Whanganui Whanganui Palmerston North Manawatū Tararua Horowhenua All Manawatū - Whanganui Whanganui Palmerston North Manawatū Tararua Horowhenua WellingtonAll WellingtonKapitiWairarapaUpper HuttLower Hutt All Wellington Kapiti Wairarapa Upper Hutt Lower Hutt All Wellington Kapiti Wairarapa Upper Hutt Lower Hutt Nelson & TasmanAll Nelson & TasmanMotuekaNelsonTasman All Nelson & Tasman Motueka Nelson Tasman All Nelson & Tasman Motueka Nelson Tasman Marlborough West Coast CanterburyAll CanterburyKaikōuraChristchurchAshburtonTimaru All Canterbury Kaikōura Christchurch Ashburton Timaru All Canterbury Kaikōura Christchurch Ashburton Timaru OtagoAll OtagoOamaruDunedinBalcluthaAlexandraQueenstownWanaka All Otago Oamaru Dunedin Balclutha Alexandra Queenstown Wanaka All Otago Oamaru Dunedin Balclutha Alexandra Queenstown Wanaka SouthlandAll SouthlandInvercargillGoreStewart Island All Southland Invercargill Gore Stewart Island All Southland Invercargill Gore Stewart Island Gisborne **Media** VideoAll VideoNZ news videoHerald NOWBusiness news videoPolitics news videoSport videoWorld news videoLifestyle videoEntertainment videoTravel videoMarkets with MadisonKea Kids news All Video NZ news video Herald NOW Business news video Politics news video Sport video World news video Lifestyle video Entertainment video Travel video Markets with Madison Kea Kids news All Video NZ news video Herald NOW Business news video Politics news video Sport video World news video Lifestyle video Entertainment video Travel video Markets with Madison Kea Kids news PodcastsAll PodcastsThe Front PageOn the TilesAsk me AnythingThe Little Things All Podcasts The Front Page On the Tiles Ask me Anything The Little Things All Podcasts The Front Page On the Tiles Ask me Anything The Little Things Cartoons Photo galleries Today's Paper - E-editions Photo sales Classifieds **NZME Network** Advertise with NZME OneRoof Driven Car Guide BusinessDesk Newstalk ZB Sunlive ZM The Hits Coast Radio Hauraki The Alternative Commentary Collective Gold Flava iHeart Radio Hokonui Radio Wanaka iHeartCountry New Zealand Restaurant Hub NZME Events **Society Insider: Chef Al Brown dating businesswoman Wendy Francis-Ching; The Carlin hotel’s transformation; former St Kent’s student’s Ivy League dreams** **Subscribe to listen** **Share this article** Reminder, this is a Premium article and requires a subscription to read. Copy Link Email Facebook Twitter/X LinkedIn Reddit Kevin Carlin (left) died a year after opening his luxury boutique hotel The Carlin in Queenstown – it's now being transformed into a private residence collective; former St Kent's student Peyton Leigh is fulfilling her dreams at Princeton; Al Brown is said to be in a new relationship with an Auckland-based businesswoman. Photo / Herald composite Man about town Ricardo Simich brings youSociety Insider. This week, Al Brown’s new romance revealed; Buyers sought to co-own a slice of $30m Queenstown hotel; meet the former St Kent’s student fulfilling her Ivy League dreams **NZ celebrity chef Al Brown dating a fellowentrepreneur** A new romance is said to have blossomed between beloved Kiwi chef Al Brown and Auckland businesswoman Wendy Francis-Ching. The pair are said to have been dating for more than six months, although they have mixed in some of the same Auckland social circles for several years. Francis-Ching is the former wife of Rich Lister Mark Ching, renowned for his work in the shipping industry. The couple told Society Insider that althoughBrownhad a public profile, they prefer to keep their relationship private. Sources close to the couple say the pair, who both have adult children and have been married previously, complement each other perfectly. “Al’s wit and humour are a perfect match for Wendy; they both match each other with their strong personalities in social situations,” says a source. The pair’s entrepreneurial similarities and get-up-and-go attitude are said to have ignited sparks. After living in and decorating several fabulous homes in the eastern suburbs, Francis-Ching – formerly a sales executive atTVNZ– used her love of decor to start the successful upmarket business Consignment Furniture in 2016. The business sold high-end designer brands, includingAntonio Citterio, B&B Italia,Minotti, Philippe Starck, andArmani Casa, and was a huge hit with buyers and well-to-do sellers. Late last year, after a tough few years of trading in Newmarket, Francis-Ching closed Consignment Furniture. There is talk about town that Francis-Ching, a doyenne of the eastern suburbs, may even buy a house with Brown on his side of town, Ponsonby. It is understood that if the pair buy real estate together, they will harness their creative sides on a great design project. Brown has based himself in Ponsonbyand its surrounds since he made the move from Wellington to Auckland 15 years ago, when he took on the city’s hospitality scene by openingDepot Eateryand Oyster Bar as part of SkyCity’s redevelopment of Federal St in 2011. As well as Depot, his businesses now include Federal Delicatessen,Best Ugly Bagels, and a range of products includingcoffee, olive oil, mustards, and ketchups. After becoming a household name with several television shows, Brown joined theMasterChef worldin 2015 in TV3’s version of the hit show, alongsideMichelin star chef Josh Emettand restaurateur Mark Wallbank. Francis-Ching and Wallbank have been friends since Wallbank’s days running Parnell restaurant Cibo in the 1990s. Brown’s down-to-earth approach to cooking, appealing to everyday Kiwis, has seen him write five popular books spanning cooking, fishing and even the Kiwi bach. Last summer, Brown is said to have shown Francis-Ching some of his favourite fishing spots in Northland. Throughout the past five years, Brown has become the unofficial cheerleader of the hospitality scene as it fights for survival. Friends of the pair say they admire each other’s tenacity, and Francis-Ching has been impressed by Brown’s philanthropy. For nearly 10 years, Brown has been an ambassador for Garden to Table, helping schools nationwide teach children about good nutrition. In 2021, Brown launchedTipping Point, a wine range with Constellation Wines, which supports New Zealand charities while celebrating the country’s regions. That journey turned into a six-part video series celebrating regions and entrepreneurs. After the devastation caused by Cyclone Gabrielle in 2023,Brown teamed up with the Restaurant Associationand held New Zealand’s biggest dinner party, with various restaurants joining in to raise money for the mayoral funds. Over the past few years, Brown has become a dab hand with content creation on social media. Hyundai is among the brands Brown works with, and last year he teamed up with his daughter Constance, one of Brown’s two daughters with his former wife, Lizzie Lang. Constance is an influencer and co-hosts the podcast Everyday Solitude. The father and daughter worked together for a campaign with the Australian brand R.M. Williams, wearing the brand’s iconic footwear. Brown seems to have helped Francis-Ching with her content creation. In her one and only Instagram post last November, Francis-Ching posted some gardening gloves from a break in Northland. Brown was quick to copy and post one of her hashtags, #ladygardener, in support. **Award-winning boutique luxury Queenstown hotel to get new life after owner’s death** When it opened, exclusive Queenstown boutique hotelThe Carlinwas described as “beyond guests’ six-star dreams”. But after its owner, United States property developerKevin Carlin, died suddenly aged 69 of hypertensive heart disease, the hotel was placed into receivership. Now, it is set to be given a new future, relaunched as a private residence collective – with high-net-worth buyers given the chance to invest in the property in a co-ownership model. The $30 million hotel, with views overLake Wakatipu, was the retirement project of Queenstown-based Carlin. Stays could cost more than $6000 a night, and it was rumoured to be attracting several big-name celebrity guests. As well as having eight suites and an award-winning restaurant, it was Carlin’s private retreat. The Californian native had a singing career and worked as a chef to Hollywood celebrities before patenting mobile kitchens used on movie sets and by the US Army. In the 1990s, he sold his US business and moved to Queenstown, where he made a name for himself as a property developer. Among his projects were New Zealand’s first gated community, the41-section Lakeside Estates, as well as the Waterfront Hotel in Queenstown. But less than a year after opening his dream property, Carlin died. BDO Christchurch, appointed to settle Carlin’s estate, found debt of $45 million and some substantial assets. Stepping in to reinvigorate Carlin’s dream is NZ’s Duchamp Collective, which is partnering with US global co-ownership expert Elite Alliance to relaunch the hotel as The Carlin Residence Club. Elite has created 120 residence club properties in more than 20 countries; its first was in Deer Valley in Utah in 2001. After visiting Elite’s residences atDeer Valley, Duchamp Collective’s veteran South Island developer Richmond Paynter says he saw an opportunity to transform the iconic Queenstown property. Eight private residences are available for co-ownership, which include six two-bedroom suites, a penthouse and a presidential residence. The suites are being sold for between $5.5m and $8.95m, with up to 10 shares available in each, meaning investors can spend between $550k and $895k per co-ownership share. Co-owners will get a certain number of nights to spend in the property per year, with it being available to rent out when not in use. Rental returns are expected to be between $3000 to $9000 per night. Other benefits for co-owners include being able to exchange nights in their Carlin suite for ones in other Elite Alliance properties in destinations including the US, South America, Europe, Asia and Africa. “For decades, we’ve seen how residence clubs empower travellers to own remarkable holiday homes – without the burden of full-time management,” says Elite Alliance president Rob Goodyear. “The Carlin Residences Club is a perfect fit for our network, and we’re thrilled to bring this model to New Zealand for the first time.” Paynter says the Elite model is “elegant, sustainable, and responsive to how today’s luxury buyers want to travel: flexibly, globally, and with everything taken care of”. Elite describes its co-owners as high-net-worth individuals, second-home investors, or seasoned global travellers who enjoy luxury hotel facilities, complete with concierge and airport transfers. Duchamp’s interior designers, Susie and Teassa Paynter, are planning refurbishments as part of the transition from a luxury hotel to a private residence club. Included will be enhancements to internal spaces and the addition of new amenities such as a private owners’ lounge and upgraded fitness facilities. After it completes The Carlin Residence Club, Elite says it is considering other opportunities in high-value resort and holiday destinations in New Zealand and Australia. **Kiwi Ivy League student running for NZ** Aucklander Peyton Leigh achieved her dream of attending American Ivy League college Princeton University. But the 21-year-old says she is most proud of her latest achievement, qualifying to compete for New Zealand at next month’s Fisu (International University Sports Federation) World University Games in Germany. The former St Kent’s student is on summer break from her second year of study at Princeton, but isn’t resting on her laurels. Leigh is training hard before she travels to the Rhine-Ruhr region in West Germany in mid-July, where 8500 student athletes from more than 150 countries will compete. “The games are one of the largest international multi-sport events for student athletes who are currently at university,” Leigh tells Society Insider. “I’m incredibly proud to have qualified for the 5000m and to represent my country on this world stage, it means the world to me.” Leigh’s Ōrākei-based parents are Auckland property investors Melanie and Duncan Leigh. Melanie is a former media advertising executive, and Duncan made his mark as an industrial chemist and a director of Chemiplas, one of Australia’s leading suppliers of raw materials. The world’s third-wealthiest man, Jeff Bezos, attended Princeton. His eldest son, Preston, reportedly recently attended too. There are whispers around campus that one of his younger children is now also attending, but such things are kept very private. Athletics New Zealand has a 19-strong World University Games team attending Fisu this year. Also competing in the 5000m is University of Otago student Eva Pringle. The Fisu World University Games will be the first time the Leighs will see their daughter compete for her country. Leigh first competed for New Zealand at the Pacific Games in the Solomon Islands in 2023. She took out silver in the 1500m but unfortunately her parents were unable to be there. “Seeing Peyton compete for her country for the first time will be a proud moment for Duncan and me,” says Melanie. “She has trained, worked hard and made many sacrifices to be able to compete in Germany.” Leigh is balancing being a student athlete at Princeton while majoring in neuroscience. She had originally planned to study geophysics, as did her father, who got his master’s in geoscience at Waikato University. “An amazing thing about Princeton is, it takes you out of your comfort zone by requiring you to study a set of liberal arts such as literature, history, languages and sciences,” says Leigh. “It was studying the sciences that set me on the new path of neuroscience.” Leigh began running competitively at age 14 and quickly fell in love with the sport. She knew she wanted to study in the US, where she could pursue both athletics and academics at a high level. Leigh says her goal shaped many of her decisions during her high school years at St Kentigern College, where she chose to study the International Baccalaureate (IB) curriculum instead of NCEA. “It was a tough programme, and mixed with training and competing, there were moments I doubted whether I’d made the right choice. “It challenged me in all the right ways and prepared me well for the academic rigour at Princeton.” For anyone wanting to follow in her footsteps and study in the US, Leigh says her best advice is to “be persistent”. “The road isn’t linear, and it definitely takes sacrifice, but the work you put in now will open doors you may not even know exist yet.” Leigh describes the 278-year-old institution in the town of Princeton, New Jersey, as her favourite place on Earth. “The history, the Gothic-style campus, my friends, teammates, coaches, and professors make the experience so special.” Leigh, who hasADHD, says balancing everything has its challenges. Most days involve one to two training sessions, classes, and hours of studying, which can leave her little time for anything else. “This year, I’ve been proud of how I’ve managed my time, and it’s allowed me to enjoy a bit of downtime in the evenings and on weekends.” One of her most exciting moments was being part of the team that won the Ivy League Triple Crown, taking home the championship titles in cross country, indoor track, and outdoor track. “Individually, I contributed points in several events,” Leigh says. With the 5000m discipline now among her achievements, a friend encouraged her to apply for the Fisu games a couple of months ago. “When I got the call that I’d made the team, I was shocked and so grateful,” she says. “Wearing the national singlet again, especially at such a prestigious global event, is something I’ll never take for granted.” **Party People of the Week** 2025 NZ Radio & Podcast Awards More than 700 guests packed into Auckland’s SkyCity Theatre last Thursday evening for the annual2025 NZ Radio & Podcast Awards, followed by an after-party at Sweat Shop Brewed Kitchen. Awards guests included Labour Party broadcasting and media spokesmanReuben Davidson, Radio Broadcasting Association chairJana Rangooniand CEO Al Jamison, NZME chief executiveMichael Boggsand NZME chief audio officer Jason Winstanley. NZME’s radio host favourites were also suited and booted for the evening, including Newstalk ZB breakfast hostMike Hosking, who stepped out in his now-famous shoes he wore forKing Charles’ coronation, a perfect fit for his 11th win as best talk presenter breakfast/drive. Newstalk ZB Drive presenterHeather du-Plessis Allanmissed the ceremony due to her show being on air while the awards were being handed out, but attended the after-party after winning the coveted Paul Holmes Broadcaster of the Year. Other NZME stars there included ZM’s Carl Fletcher, Vaughan Smith, Hayley Sproull, Georgia Burt, Clint Roberts and Bree Tomasel, The Hits Jono Pryor, Ben Boyce, Megan Papas, Matty McLean, PJ Harding, Matilda Green, and Coast’s Toni Street, Sam Wallace, Jason Reeves and Lorna Riley. SO/ Auckland hosts Rooftop Caviar Celebration SO/ Auckland hotel’s HI-SO Rooftopwas abuzz on Friday, celebratingNew Zealand’s alpine salmon caviar seasoncelebration. More than 180 guests enjoyed a fresh sashimi station and yakitori, alongside salmon-centric canapes, including caviar tartlets, grilled salmon wings and a rich salmon risotto. Drinks included Zenkuro Sake cocktails and Perrier-Jouet champagne. Among huge ice sculptures, guests bumped various types of Mt Cook caviar, including Ikura and Malossal, and were the first to taste a new pink gin infusion that won’t hit shelves until next year. The standout was a roving caviar, pringle and creme-fraiche belt by Mt Cook’s Michael Sprague. Guests includedHerald NOWhostRyan Bridge,Cuisine MagazineeditorKelli Brett, wine writer Mary Blair,Tanné Snowden, the founder of Tronque, author and artist Clare Lambert-Grove, real estate starAman Gulia, content creator and creativeJess Molina,MasterChefwinnerSam Low, food reviewerJasmine Kimand sake and wine educatorMeg Abbott. **Conversation for a Cure at Flockhill Lodge** Eighty guests gathered in the majestic Craigieburn Valley last weekend for Conversation for a Cure, an intimate fundraising event by Breast Cancer Cure at luxury lodge Flockhill. Two long-time BCC ambassadors, fashion designerKaren Walkerand broadcasterPetra Bagust, guided the day’s conversations, with guests including fashion stylist Lou Heller, broadcasterWilhelmina Shrimpton, and artist Carrie Broomhall. Set on a 14,568-hectare working sheep station, whichThe Robb Reportrecently named one of the top three “greatest luxury hotels on Earth”, the event was made possible thanks toFlockhillmanagersAndrew and Sandra Cullenand their team. The afternoon began with a progressive long lunch at the lodge’s restaurant, Sugarloaf, led byexecutive chef Taylor Cullenand with ingredients sourced almost entirely from the land around them. Throughout the day, guests bid on exclusive live and silent auction items, raising more than $72,000 – vital funds to supportbreast cancer research in Aotearoa. Ricardo Simichhas been with theHeraldsince 2008 where he contributed to The Business Insider. In 2012 he took over Spy at theHerald on Sunday, which has since evolved into Society Insider. The weekly column gives a glimpse into the worlds of the rich and famous. **Share this article** Reminder, this is a Premium article and requires a subscription to read. Copy Link Email Facebook Twitter/X LinkedIn Reddit **Latest from Lifestyle** **A tooth to a Christmas ham: The wildest things Kiwis have left in Ubers** **A tooth to a Christmas ham: The wildest things Kiwis have left in Ubers** **After years of his lying about drinking, how do I trust my husband again?** **After years of his lying about drinking, how do I trust my husband again?** **Seven ways to dementia-proof yourself in midlife** **Seven ways to dementia-proof yourself in midlife** **BV or thrush? Know the difference** **BV or thrush? Know the difference** **Latest from Lifestyle** **A tooth to a Christmas ham: The wildest things Kiwis have left in Ubers** **A tooth to a Christmas ham: The wildest things Kiwis have left in Ubers** The data also revealed NZ's most forgetful city and the most commonly forgotten items. **After years of his lying about drinking, how do I trust my husband again?** **After years of his lying about drinking, how do I trust my husband again?** **Seven ways to dementia-proof yourself in midlife** **Seven ways to dementia-proof yourself in midlife** **Extremely life-like dolls cause a frenzy in Brazil** **Extremely life-like dolls cause a frenzy in Brazil** **It was just a stopover – 18 months later, they call it home** **It was just a stopover – 18 months later, they call it home** About NZ Herald Meet the journalists Newsletters Classifieds Help & support Contact us House rules Privacy Policy Terms of use Competition terms & conditions Our use of AI NZ Herald e-editions Daily puzzles & quizzes Manage your digital subscription Manage your print subscription Subscribe to the NZ Herald newspaper Subscribe to Herald Premium Gift a subscription Subscriber FAQs Subscription terms & conditions Promotions and subscriber benefits The New Zealand Herald The Northland Age The Northern Advocate Waikato Herald Bay of Plenty Times Rotorua Daily Post Hawke's Bay Today Whanganui Chronicle Viva NZ Listener What the Actual Newstalk ZB BusinessDesk OneRoof Driven CarGuide iHeart Radio Restaurant Hub About NZME NZME careers Advertise with NZME Digital self-service advertising Book your classified ad Photo sales NZME Events © Copyright2025NZME Publishing Limited"}