{"id": 1102, "name": "Public Library of Science", "domain": "plos.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://theplosblog.plos.org/2024/12/plos-receives-3-3m-grant-to-support-open-access-publishing-business-model-transformation/", "title": "Plos Receives 3 3m Grant To Support Open Access Publishing Business Model Transformation", "content": "AboutOur mission and visionResearch integrity and publication ethicsSustainabilityThe Executive TeamThe Board of DirectorsThe Scientific Advisory CouncilGovernanceCareers at PLOSContact us Our mission and vision Research integrity and publication ethics Sustainability The Executive Team The Board of Directors The Scientific Advisory Council Governance Careers at PLOS Contact us Our mission and vision Research integrity and publication ethics Sustainability The Executive Team The Board of Directors The Scientific Advisory Council Governance Careers at PLOS Contact us Open ScienceWhat is Open Science?Open Science Publishing> Research journals> Publication metrics> Publication feesOpen Science Practice> Research by PLOSOpen Science Policy> DORA What is Open Science? Open Science Publishing> Research journals> Publication metrics> Publication fees > Research journals > Publication metrics > Publication fees Open Science Practice> Research by PLOS > Research by PLOS Open Science Policy> DORA > DORA What is Open Science? Open Science Publishing> Research journals> Publication metrics> Publication fees > Research journals > Publication metrics > Publication fees > Research journals > Publication metrics > Publication fees Open Science Practice> Research by PLOS > Research by PLOS > Research by PLOS Open Science Policy> DORA > DORA > DORA LibrariesInstitutional SalesSupporting researchersInstitutional agreementsOur partnersTerms of serviceFAQs Institutional Sales Supporting researchers Institutional agreements Our partners Terms of service FAQs Institutional Sales Supporting researchers Institutional agreements Our partners Terms of service FAQs CommunityCancerDigital healthImpacts of hazardsMarine ecosystemsPopulation and agingSmart citiesTerrestrial ecosystems Cancer Digital health Impacts of hazards Marine ecosystems Population and aging Smart cities Terrestrial ecosystems Cancer Digital health Impacts of hazards Marine ecosystems Population and aging Smart cities Terrestrial ecosystems AnnouncementsPLOS’s response to US Executive OrdersAn exciting new eraPLOS receives $3.3m grantRedefining publishingPLOS pledgeBlogs PLOS’s response to US Executive Orders An exciting new era PLOS receives $3.3m grant Redefining publishing PLOS pledge Blogs PLOS’s response to US Executive Orders An exciting new era PLOS receives $3.3m grant Redefining publishing PLOS pledge Blogs PressMedia inquiriesEmbargo policyAuthor media toolkitGuidelines Media inquiries Embargo policy Author media toolkit Guidelines Media inquiries Embargo policy Author media toolkit Guidelines CareersWhy join PLOS? Why join PLOS? Why join PLOS? PLOS is a non-profit organization on a mission to drive open science forward with measurable, meaningful change in research publishing, policy, and practice. Building on a strong legacy of pioneering innovation, PLOS continues to be a catalyst, reimagining models to meet open science principles, removing barriers and promoting inclusion in knowledge creation and sharing, and publishing research outputs that enable everyone to learn from, reuse and build upon scientific knowledge. We believe in a better future where science is open to all, for all. PLOS Biology PLOS Climate PLOS Complex Systems PLOS Computational Biology PLOS Digital Health PLOS Genetics PLOS Global Public Health PLOS Medicine PLOS Mental Health PLOS Neglected Tropical Diseases PLOS One PLOS Pathogens PLOS Sustainability and Transformation PLOS Water PLOS Blogs PLOS Collections About This Blog Contact Staff BlogsOfficial PLOS BlogEveryONE BlogLatitudeSpeaking of MedicinePLOS BiologuePLOS Collections Official PLOS Blog EveryONE Blog Latitude Speaking of Medicine PLOS Biologue PLOS Collections Official PLOS Blog EveryONE Blog Latitude Speaking of Medicine PLOS Biologue PLOS Collections Independent BlogsAbsolutely MaybeDNA SciencePLOS ECR CommunitySciCommAll Models Are WrongYour Say Absolutely Maybe DNA Science PLOS ECR Community SciComm All Models Are Wrong Your Say Absolutely Maybe DNA Science PLOS ECR Community SciComm All Models Are Wrong Your Say AboutAbout PLOS BlogsContact About PLOS Blogs Contact About PLOS Blogs Contact **PLOS receives $3.3M grant to support Open Access publishing & business model transformation** Note: PLOS issued the following press release on Tuesday, December 10.PLOS has been awarded a $3.3million grant from the Bill & Melinda Gates Foundation, underscoring its commitment to pioneer a shift away from traditional publishing models. The 3-year funding package from the Gates Foundation will support PLOS’ transition towards APC-free publishing by enabling authors, funded by the foundation, to publish with PLOS without facing APC barriers, and to contribute to open access publishing options for authors who do not have access to funding. This 3-year grant offers support while PLOS is actively working on new publishing models grounded in open science starting with an ongoingresearch & design project. The grant will also support improvements to enhance the capture and dissemination of funding metadata and to experiment with the posting of peer reviews alongside preprints during the evaluation process, promoting greater transparency in scholarly communication. The transition away from APCs is not a new concept for PLOS, which has been actively developing alternative business models since 2020 with the express aim of reducing financial barriers in scholarly publishing and fostering open access for a broader range of researchers. PLOS has been a vocal champion regarding the benefits of preprints for theearly sharing of researchand has significant partnerships with bioRxiv, medRxiv and earthRxiv. “Our goal is to demonstrate the feasibility of APC-free, open science-based publishing models and inspire a transformative shift across the scholarly communication landscape,” said Niamh O’ Connor, Chief Publishing Officer at PLOS. “We are grateful for the foundation’s funding support as we explore ways to transition publishing services away from ‘per published unit’ based pricing and incentivize sharing the form of output most appropriate to the research.” Diversity, Equity and InclusionUpdated version of the “How Equitable Is It?” tool for assessing equity in scholarly communication modelsMay 14, 2025ByPLOSNote: PLOS, cOAlition S and Jisc issued the following press release on Wednesday, May 14, 2025 [Strasbourg, 14 May 2025] The “How…Read more Note: PLOS, cOAlition S and Jisc issued the following press release on Wednesday, May 14, 2025 [Strasbourg, 14 May 2025] The “How… Note: PLOS, cOAlition S and Jisc issued the following press release on Wednesday, May 14, 2025 [Strasbourg, 14 May 2025] The “How… In the NewsPLOS announces new partnership in ChinaApril 1, 2025ByPLOSNote: PLOS issued the following press release on Tuesday, April 1, 2025 San Francisco, California, United States – The Public Library of…Read more Note: PLOS issued the following press release on Tuesday, April 1, 2025 San Francisco, California, United States – The Public Library of… Note: PLOS issued the following press release on Tuesday, April 1, 2025 San Francisco, California, United States – The Public Library of… Scholarly publishingPLOS statement on recent US Executive Orders and scientific integrityFebruary 21, 2025ByPLOSSince its founding over twenty five years ago PLOS has been dedicated to advancing open science, ensuring that knowledge is accessible to…Read more Since its founding over twenty five years ago PLOS has been dedicated to advancing open science, ensuring that knowledge is accessible to… Since its founding over twenty five years ago PLOS has been dedicated to advancing open science, ensuring that knowledge is accessible to… Bluesky Facebook Linkedin Connect Contact Blogs Advertise Finance Financial Overview Pay Invoice Payment Terms and Conditions Legal Privacy Policy Cookie Policy Terms of Use Accessibility Sign Up"}