{"id": 1982, "name": "Geopolitical Intelligence Services", "domain": "gisreportsonline.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.gisreportsonline.com/e/liechtenstein-prince-michael-of/", "title": "Liechtenstein Prince Michael Of", "content": "POLITICS ECONOMY ENERGY SECURITY TECHNOLOGY Regions WHO WE ARE SHOP ADVISORY SENIOR EXPERTS WEBINAR PODCAST Twitter Facebook LinkedIn YouTube **Prince Michael of Liechtenstein** Prince Michael of Liechtenstein graduated from the Vienna University of Economics and Business with a master’s degree in business administration. During his studies, he worked with banks and manufacturing companies in Canada, the United States and Belgium. From 1978 to 1987 he worked for Nestlé SA in the fields of controlling, marketing and management in various markets throughout Europe and Africa. In 1987 he returned to Liechtenstein where he took over the position of Managing Director with Industrie- und Finanzkontor Ets., a leading trust company with tradition and expertise in long-term, multi-generational preservation of wealth, family values and businesses. Today, Prince Michael of Liechtenstein is the company’s executive chairman. He is also founder and chairman of Geopolitical Intelligence Services AG, publisher of Der Pragmaticus and a co-founder of the International Institute of Longevity and Longevity Center. Prince Michael of Liechtenstein is a member of various professional organizations such as STEP, and is Chairman of the European Center of Austrian Economics Foundation in Vaduz. **Reports305 Reports** **A confusing world without a hegemon** **The global and European relevance of the Kashmir conflict** **Debt and an oversized state: The real threat to Western democracies** **Rousing Europe from its slumber** **Germany’s reckoning, with Europe on the line** **A ceasefire in Ukraine: What comes next** **‘Trump shock’ for the world economy** **The losers win in European democracies** **Trump’s tariff surprise: The grand disruption** **Podcasts16 Podcasts** **The Future German Leadership** **Reasons for optimism in 2025** **Webinar: U.S. election 2024: Key takeaways and global impact** **Finding oil does not guarantee economic growth** **Uncharted threats to European security** **The challenges facing European leadership** **Moral leadership requires competence** **Is innovation in life science at risk?** **Scrutinizing the OECD’s global tax plan** Cookie settings GDPR Terms of use Imprint POLITICS ECONOMY ENERGY SECURITY TECHNOLOGY Regions WHO WE ARE SHOP ADVISORY SENIOR EXPERTS WEBINAR PODCAST Twitter Facebook LinkedIn YouTube"}