{"id": 1992, "name": "Huffington Post", "domain": "huffpost.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.huffpost.com/entry/trump-screened-troops-standing-behind-him-at-fort-bragg-for-looks-beliefs-report_n_6849e126e4b0f2259d60aa3d", "title": null, "content": "Already contributed?Log in to hide these messages. **Main Menu** **News** **Politics** **Opinion** **Entertainment** **Life** **Voices** **HuffPost Personal** **NEW: Games** **Horoscopes** **Video** **From Our Partners** **Newsletters** **International** **Follow Us** **What's Hot** **Trump Screened Troops Standing Behind Him At Fort Bragg For Looks, Beliefs: Report** Reporter, HuffPost Reporter, HuffPost PresidentDonald Trumptook the podium at North Carolina’s Fort Bragg on Tuesday before rows of young soldiers in camo-printed fatigues who had been selected for their body shape and personal politics,according to the news site Military.com. The bit of stage design reflected Trump’s obsession with appearances and popularity, but it was highly unusual for the military, which has long sought to portray itself as indifferent to partisan politics. Military.com reviewed written orders it said were sent out in preparation for the event. One order reportedly read, “No fat soldiers.” The troops were reportedly told they could object to being placed in the stands behind Trump if their personal values were in conflict with his politics. Trump’s speech at Fort Bragg sounded no different from a campaign rally, featuring insults for political foes like Los Angeles Mayor Karen Bass and California Gov. Gavin Newsom, bothDemocrats. The troops’ reactions were similarly striking. They cheered some of the president’s most inflammatory remarks, such as when he characterized immigration as an “invasion.” Elsewhere at Fort Bragg, Military.com reported that Trump campaign merchandise was for sale. One item, a fake credit card, reportedly read, “White Privilege Card: Trumps Everything.” An unnamed commander told Military.com the event was “shameful.” “This has been a bad week for the Army for anyone who cares about us being a neutral institution,” the commander said. The Army is nearing the 250th anniversary of its founding, which will culminate with a massive military parade on Saturday, June 14 — coincidentally, Trump’s 79th birthday. The Department of Defense specifically prohibits active-duty soldiers from engaging in partisan political activity. A “quick guide” on the rules for service members dated last year states that “all members of the Armed Forces should always avoid actions that could reasonably be perceived as implying DoD sponsorship, approval or endorsement of partisan political activity.” It does not appear, however, that the soldiers will face any repercussions for engaging in Trump’s speech this week. For two decades, HuffPost has been fearless, unflinching, and relentless in pursuit of the truth.Support our missionto keep us around for the next 20 — we can't do this without you. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever.We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever.We hope you will join us once again. Already contributed?Log in to hide these messages. For two decades, HuffPost has been fearless, unflinching, and relentless in pursuit of the truth.Support our missionto keep us around for the next 20 — we can't do this without you. Already contributed?Log in to hide these messages. Read more onMilitary.com. **Related** **Trump Thinks Fort Bragg Still Honors A Confederate General — But It Doesn’t** **Trump Thinks Fort Bragg Still Honors A Confederate General — But It Doesn’t** **GOP Senator Says Trump's Military Parade Reminds Him Of North Korea** **GOP Senator Says Trump's Military Parade Reminds Him Of North Korea** **GOP Senators Freak Out When Asked About Trump’s Military Parade Costing $45 Million** **GOP Senators Freak Out When Asked About Trump’s Military Parade Costing $45 Million** **From Our Partner** **From Our Partner** **HuffPost Shopping'sBest Finds** **ON THIS DAY INHUFFPOST HISTORY** **** FAIR, FEARLESS REPORTINGSINCE 2005 **Politics** By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to ourTerms of ServiceandPrivacy Policy. **What's Hot** **More In Politics**"}