{"id": 791, "name": "KTVH - Helena News", "domain": "ktvh.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ktvh.com/big-sky-conference/montana-state-bobcats/montana-state-athletes-prepared-excited-for-ncaa-outdoor-track-and-field-championships", "title": "Montana State Athletes Prepared Excited For Ncaa Outdoor Track And Field Championships", "content": "Menu NewsHelena NewsGreat Falls NewsMontana NewsMontana PoliticsCrime and CourtsScripps News National Coverage Helena News Great Falls News Montana News Montana Politics Crime and Courts Scripps News National Coverage Helena News Great Falls News Montana News Montana Politics Crime and Courts Scripps News National Coverage Wildfire Watch Montana Politics Olympics WeatherInteractive RadarWeather CamerasWeather WiseDaily ForecastHourly ForecastWeather Rookie Interactive Radar Weather Cameras Weather Wise Daily Forecast Hourly Forecast Weather Rookie Interactive Radar Weather Cameras Weather Wise Daily Forecast Hourly Forecast Weather Rookie Sports Obituaries CommunityEvents CalendarWellness 101Heart of HelenaIndian CountryContestsMontana Made Events Calendar Wellness 101 Heart of Helena Indian Country Contests Montana Made Events Calendar Wellness 101 Heart of Helena Indian Country Contests Montana Made VideosPhoto GalleriesOn KTVH Photo Galleries On KTVH Photo Galleries On KTVH About UsNews TeamJobs at KTVHKTVH AppsClosed CaptioningOn KTVH News Team Jobs at KTVH KTVH Apps Closed Captioning On KTVH News Team Jobs at KTVH KTVH Apps Closed Captioning On KTVH Sign In Newsletters Sign Out Manage Emails Apps Careers Search **Actions** Facebook Tweet Email **Montana State athletes prepared, excited for NCAA Outdoor Track and Field Championships** BOZEMAN — The NCAA outdoor championships for track and field commence Wednesday, with a handful of Montana State athletes headed Hayward field in Eugene, Ore., to compete on the national stage. The list of MSU qualifiers is as follows: Hailey Coey, long jump Harvey Cramb, 1,500 meters Rob McManus, 3,000-meter steeplechase Olivia Lewis, Giulia Gandolfi, Caroline Hawkes and Peyton Garrison, 4x400m relay Bobcats showed out in Texas!What a group. What a week. 💙💛#GoCatsGopic.twitter.com/t7s7YWH3nH The Bobcat women's team made history as Coey and the 4x400m relay team became the first from the program to represent in their respective event at nationals. \"It means a lot,\" Coey said. \"I’m super honored to be able to represent MSU on a national stage, especially being the first long jumper in school history, super excited and I hope I do well job representing us.\" \"Fortunately, we have a really close four-by-four team, we’re together every single day,\" Garrison said. \"We show up to the track, we work together, we got out and eat together, we spend so much time, and I think that helps a lot.\" All the Emotions on a Texas-Sized Night Under the Lights 🎟️#GoCatsGopic.twitter.com/fTNPjOhkM6 The relay team made it to nationals in dramatic fashion, as they were the final team to punch their ticket on the last day. The team who initially finished in front of Bobcats in the event — Northern Arizona — was ultimately disqualified to give MSU a berth. The Bobcats waited after a protest was filed and eventually the results were made official as Lewis, Gandolfi, Hawkes and Garrison were awarded a top-12 finish. \"At first we were for sure sad because we thought we were the last team out, and then a couple of us girls looked up at the TV, and the TV had said that we had made it,\" Garrison explained. \"Unfortunately, the team that got kicked out was of course another Big Sky school, and of course we wanted them to make it, but fortunately we made it.\" On the men’s team, McManus will be headed to his third outdoor nationals in his signature event, the 3,000-meter steeplechase. He reflected on how he’s grown since the first time on this stage. \"I think there was a little uncertainty to where I fit in at the national stage, and then last year getting the big Q at regionals, making the national meet, I think I felt a lot more secure,\" he said. \"This year, just coming back again, I think I feel even more confident in myself and my ability. I’ve run PRs this season, so I’m just excited to get back.” 𝗧𝗜𝗖𝗞𝗘𝗧 𝗣𝗨𝗡𝗖𝗛𝗘𝗗 👊🎟️Rob McManus becomes the third Bobcat in history to qualify for three straight NCAA Outdoor Track & Field Championships!#GoCatsGopic.twitter.com/Djo7RCbPsj To round out the qualifiers, sophomore Cramb earned his first berth to outdoor nationals in the 1,500 meters. \"Oh it’s such an honor, and to do it like you said, my sophomore year is a great opportunity, and to be there and put your name with some of the best in the country is pretty awesome,\" Cramb explained. \"I’m pretty excited, I mean this is the sort of thing you dream of when you think about coming to the NCAA, and so to get the opportunity, I’m really pumped about it.\" For the full schedule of events at the meet, clickhere. **Sign up for theBreaking News Newsletterand receive up to date information.** **now signed up to receive theBreaking News Newsletter.** **Coverage of your favorite teams from Montana's Sports Leader** **Coverage of your favorite teams from Montana's Sports Leader** News Weather Community Sports Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact KTVHNews/ ktvhnews ktvhnews"}