{"id": 1915, "name": "Christian Post", "domain": "christianpost.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.christianpost.com/podcast/after-duck-dynasty-star-phil-robertsons-death-a-look-inside-his-faith-life-and-legacy.html", "title": "After Duck Dynasty Star Phil Robertsons Death A Look Inside His Faith Life And Legacy.html", "content": "The Christian Post To enjoy our website, you'll need to enableJavaScriptin your web browser. Pleaseclick hereto learn how. **Sections** Home Page Latest News Featured Special Series Opinion Church & Ministries U.S. World Politics Entertainment Living Business Sports Education Books Podcast News Topics Give to CP's Mission **More** Newsletters Videos Podcasts CP Magazine Events Brand Solutions Shopping Job Board Home The Inside Story: From the Christian Post **After 'Duck Dynasty' Star Phil Robertson's Death: A Look Inside His Faith, Life And Legacy** \"Duck Dynasty\" patriarch Phil Robertson died May 25 at the age of 79 after a battle with Alzheimer's, sparking touching tributes from his family members and fellow celebrities. The Christian Post's Leah Klett joins \"The Inside Story\" to share with Billy Hallowell her take on Robertson's life, faith — and legacy. Klett, who has interviewed Robertson and fellow family members, offered a touching and important look at the reality TV star's monumental impact in spreading the Gospel message. **Also available on:** **More Episodes** 12:22Major Evangelical Institution Announces Major Move...to Canada: Here's Everything You Need to KnowMay 23, 2025 **Major Evangelical Institution Announces Major Move...to Canada: Here's Everything You Need to Know** **Major Evangelical Institution Announces Major Move...to Canada: Here's Everything You Need to Know** 12:00Proposed Muslim Community in Texas Sparks Debate, Investigations: Here's What We KnowMay 16, 2025 **Proposed Muslim Community in Texas Sparks Debate, Investigations: Here's What We Know** **Proposed Muslim Community in Texas Sparks Debate, Investigations: Here's What We Know** 09:46What to Expect From the Papal Conclave: History, Meaning and What Comes NextMay 07, 2025 **What to Expect From the Papal Conclave: History, Meaning and What Comes Next** **What to Expect From the Papal Conclave: History, Meaning and What Comes Next** 09:39Battle Heats Up After Jesus Painting Removed From the U.S. Merchant Marine Academy, Some Demand Its ReturnApril 18, 2025 **Battle Heats Up After Jesus Painting Removed From the U.S. Merchant Marine Academy, Some Demand Its Return** **Battle Heats Up After Jesus Painting Removed From the U.S. Merchant Marine Academy, Some Demand Its Return** 08:39Why Are US Christians Less Antisemitic, More Pro-Israel Than UK Believers?April 07, 2025 **Why Are US Christians Less Antisemitic, More Pro-Israel Than UK Believers?** **Why Are US Christians Less Antisemitic, More Pro-Israel Than UK Believers?** 13:09Should Churches Fear Artificial Intelligence? How Are Christians Responding?March 29, 2025 **Should Churches Fear Artificial Intelligence? How Are Christians Responding?** **Should Churches Fear Artificial Intelligence? How Are Christians Responding?** 09:51Racial Tensions and 'Affinity Groups': The Inside Story on the Presbyterian Church in America DebateMarch 22, 2025 **Racial Tensions and 'Affinity Groups': The Inside Story on the Presbyterian Church in America Debate** **Racial Tensions and 'Affinity Groups': The Inside Story on the Presbyterian Church in America Debate** 08:51Inside Trump's Record-Breaking Speech and the Democratic Response: Everything You Need to KnowMarch 08, 2025 **Inside Trump's Record-Breaking Speech and the Democratic Response: Everything You Need to Know** **Inside Trump's Record-Breaking Speech and the Democratic Response: Everything You Need to Know** **Group of Brands** The Christian Post **Overall Navigation** **News** Home Page Latest News Featured Special Series Church & Ministries U.S. World Politics Entertainment Living Business Books Sports **Opinion** Opinion Home Columnists Op-Eds Editorials **MORE** Newsletters Videos Podcasts CP Magazine Events Topics Brand Solutions Shopping Deals **About** About Us Statement Of Faith Leadership Public Relations General Disclaimer Permissions Policy Editorial Policy Terms Of Service Privacy Policy Email Whitelisting **Connect** My Account Submit an Article Contact Us Media Contact Advertise With Us RSS Feed Archives Corrections Commenting FAQ Community Guidelines Employment Opportunities **Follow Us** Facebook Twitter Instagram Youtube Linkedin Gettr Apple News Google News Telegram Flipboard **Mobile Apps** iOS app Android app ****"}