{"id": 1479, "name": "Tonganoxie Mirror", "domain": "tonganoxiemirror.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.tonganoxiemirror.com/top-news/2025/may/08/tonganoxie-city-council-approves-lease-for-tongie-tidal-waves-special-alcohol-permit-for-longtime-community-festival/", "title": "Tonganoxie City Council Approves Lease For Tongie Tidal Waves Special Alcohol Permit For Longtime Community Festival", "content": "NewsLocalBusinessEducationGovernment Local Business Education Government Local Business Education Government Sports Obituaries Opinion LivingAnnouncementsArtsEntertainmentFeaturesRecreation Announcements Arts Entertainment Features Recreation Announcements Arts Entertainment Features Recreation Classifieds ContactAdvertising InformationContactStatement of ValuesTerms of Use Advertising Information Contact Statement of Values Terms of Use Advertising Information Contact Statement of Values Terms of Use News Sports Obituaries Opinion Living Classifieds **Tonganoxie City Council approves lease for Tongie Tidal Waves, special alcohol permit for longtime community festival** **** Shawn LinenbergerTonganoxie City Council Chambers are moving to the former public library at Third and Bury streets. In-person meetings also available for viewing on a city YouTube Channel could start with the Jan. 19 regular meeting. Shawn Linenberger Shawn Linenberger Tonganoxie City Council approved a temporary use lease for Tonganoxie Water Park for Gretchen Meitler. The request passed, 3-0. Council Members Loralee Stevens and Chris Donnelly were absent. Council members Jake Dale and Jennifer McCutchen were present and fellow Council Member Matt Partridge participated via phone call as Mayor David Frese presided over the meeting. Meitler was representing the Tongie Tidal Waves swim team. The team has used the water park each summer for practices and home swim meets and will do the same again this summer. The agreement is for rental of the facility from May 27-June 27 at a cost of $1,260. Practices will be early mornings before public hours at the water park, with two home meets scheduled on June 6 and June 20. Total estimated rental time of the pool is about 54 hours, with 84 hours of total required lifeguard staff time factoring into the rental fee determination. Tongie Tidal Wave has called Tonganoxie Water Park home each summer for the last 15 years. Special permit OK’d for alcohol offerings at Tonganoxie Days Council members approved Ordinance No. 1530 allowing consumption of alcohol on certain public property for Tonganoxie Days. Tonganoxie Days is working with Alberto Yaluk of 1866 restaurant and Z&M Twisted Vines to offer wine and other alcohol in a designated space at Tonganoxie Days, which will be June 14 in the Gallagher Park area near Third and Main streets. The fee for temporary alcohol permits is $150 per application. The ordinance passed, 3-0. Council has short executive session Council members met in executive session for 5 minutes to discuss acquisition of real property. Mayor David Frese, Council Members Jennifer McCutchen, Jake Dale and Matt Partridge (Partridge via phone) met in executive session with City Manager George Brajkovic, Assistant City Manager Dan Porter, City Clerk Lindsay Huntington and City Attorney Anna Krstulic. After the council returned to regular session after the closed-door meeting, Frese said no action was taken during the executive session. **Local** **Local** **Tonganoxie Days returning to its roots Saturday** **Tonganoxie Days returning to its roots Saturday** **Remember When: A Community Review for Tonganoxie for June 11, 2025** **Remember When: A Community Review for Tonganoxie for June 11, 2025** **Kansas Supreme Court rules drug-dog search at Wichita traffic stop was constitutional** **Kansas Supreme Court rules drug-dog search at Wichita traffic stop was constitutional** By Tim Carpenter Kansas Reflector TOPEKA — Wichita police officers Donald Bailey and Shawn Isham were ... News Sports Obituaries Opinion Living Contact Copyright © The Mirror | www.tonganoxiemirror.com | P.O. Box 71, Tonganoxie, KS 66086"}