{"id": 758, "name": "CityNews Kitchener", "domain": "kitchener.citynews.ca", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://kitchener.citynews.ca/2025/06/11/elizabeth-ziegler-ps-to-undergo-significant-repairs-students-will-attend-alternate-schools-for-2025-26/", "title": "Elizabeth Ziegler Ps To Undergo Significant Repairs Students Will Attend Alternate Schools For 2025 26", "content": "Calgary Edmonton Halifax Kitchener Montreal Ottawa Toronto Vancouver Winnipeg AboutAbout UsOur Team About Us Our Team About Us Our Team Contact Newsletters News Insiders NewsAllLocalCanadaWorldBusiness Local Canada World Business Local Canada World Business Watch ListenAllListen LiveThe Mike Farwell ShowThe Big Story PodcastSeekr Audio AppAll Shows Listen Live The Mike Farwell Show The Big Story Podcast Seekr Audio App All Shows Listen Live The Mike Farwell Show The Big Story Podcast Seekr Audio App All Shows Traffic Weather Gas Prices CommunityAllShowcaseEventsContests & Offers Showcase Events Contests & Offers Showcase Events Contests & Offers KitchenerAllKitchenerCalgaryEdmontonHalifaxKitchenerMontrealOttawaTorontoVancouverWinnipeg Kitchener Calgary Edmonton Halifax Kitchener Montreal Ottawa Toronto Vancouver Winnipeg Kitchener Calgary Edmonton Halifax Kitchener Montreal Ottawa Toronto Vancouver Winnipeg AboutAllAbout UsOur Team About Us Our Team About Us Our Team Contact Newsletters News Insiders **Elizabeth Ziegler PS to undergo major repairs, students to attend alternate schools** ByJosh Piercey Posted Jun 11, 2025 09:28:23 AM. Last Updated Jun 11, 2025 10:20:50 AM. The Waterloo Region District School Board (WRDSB) shared a significant update about Elizabeth Ziegler Public School, informing the public that the school is set to undergo significant repairs, but will not be demolished altogether. The school wasforced to closein April after a concrete slab fell from the exterior façade, unveiling a long list of structural issues that needed repair before students were allowed back. Since then, the school’s population has transferredto alternate schools,like Sandown Public School in Waterloo, for the remainder of the school year. At acommunity meetingin March, the school board explained that it would need to hear the advice of structural engineers before deciding on the next steps for the nearly 100-year-old building. On Wednesday, the WRDSB shared results of the final report from the structural engineering firm, including months of testing of the school’s internal and external structures. Related: ‘Grossly over capacity’: Parents concerned as two Waterloo schools prepare to merge Parents meet face-to-face with school board over Elizabeth Ziegler Public School Elizabeth Ziegler PS closed for the rest of the school year amid structural concerns Based on the engineering report, the school board plans on restoring and repairing the original structure of Elizabeth Ziegler through the construction of a new interior steel frame and additional foundations. It also includes the reinforcement and repairs of the building’s exterior masonry. The WRDSB also explained that a new elevator will be installed, and that the upgrades will extend the life of the century-old building. “We are working with the Ministry of Education to finalize the funding source and seeking approval for the restoration from the City of Waterloo, Municipal Heritage Committee and Building Services,” the board said in a press release. Students will continue to attend alternate schools in 2025/26, and the school board is unable to offer a timeline of when the work will be completed. More details of this project are set to be shared at a public meeting on June 25. **Top Stories** More changes are coming to addiction and treatment services in Waterloo Region. Back in May, regional council decided it would stop funding the Waterloo Region Integrated Drugs Strategy (WRIDS) at the... 1h ago More changes are coming to addiction and treatment services in Waterloo Region. Back in May, regional council decided it would stop funding the Waterloo Region Integrated Drugs Strategy (WRIDS) at the... 1h ago The Waterloo Regional Police Service (WRPS) is asking for help in locating a missing magazine. The service says the ammunition was lost during an arrest on Tuesday. Officers responded to a reported... 1h ago The Waterloo Regional Police Service (WRPS) is asking for help in locating a missing magazine. The service says the ammunition was lost during an arrest on Tuesday. Officers responded to a reported... 1h ago Regional police have released photos of a person they're trying to identify, after a purse-snatching incident in Waterloo Tuesday night. It happened uptown, just after 10:30 p.m., as a victim was sitting... 2h ago Regional police have released photos of a person they're trying to identify, after a purse-snatching incident in Waterloo Tuesday night. It happened uptown, just after 10:30 p.m., as a victim was sitting... 2h ago There's a few openings for a popular campground at a local conservation area. The Grand River Conservation Authority (GRCA) says eight seasonal camp sites have recently become available at Pinehurst... 46m ago There's a few openings for a popular campground at a local conservation area. The Grand River Conservation Authority (GRCA) says eight seasonal camp sites have recently become available at Pinehurst... 46m ago **Trending Now** McLeod the 'architect': Crown begins closing argument in hockey player sex assault trial Fundraiser started for family of mother killed in Hwy. 401 crash Major Guelph company fined after worker hurt on the job Fewer post-secondary students leads to dip in GRT ridership Teens warned against doing the 'Chromebook challenge' **Top Stories** More changes are coming to addiction and treatment services in Waterloo Region. Back in May, regional council decided it would stop funding the Waterloo Region Integrated Drugs Strategy (WRIDS) at the... 1h ago More changes are coming to addiction and treatment services in Waterloo Region. Back in May, regional council decided it would stop funding the Waterloo Region Integrated Drugs Strategy (WRIDS) at the... 1h ago The Waterloo Regional Police Service (WRPS) is asking for help in locating a missing magazine. The service says the ammunition was lost during an arrest on Tuesday. Officers responded to a reported... 1h ago The Waterloo Regional Police Service (WRPS) is asking for help in locating a missing magazine. The service says the ammunition was lost during an arrest on Tuesday. Officers responded to a reported... 1h ago Regional police have released photos of a person they're trying to identify, after a purse-snatching incident in Waterloo Tuesday night. It happened uptown, just after 10:30 p.m., as a victim was sitting... 2h ago Regional police have released photos of a person they're trying to identify, after a purse-snatching incident in Waterloo Tuesday night. It happened uptown, just after 10:30 p.m., as a victim was sitting... 2h ago There's a few openings for a popular campground at a local conservation area. The Grand River Conservation Authority (GRCA) says eight seasonal camp sites have recently become available at Pinehurst... 46m ago There's a few openings for a popular campground at a local conservation area. The Grand River Conservation Authority (GRCA) says eight seasonal camp sites have recently become available at Pinehurst... 46m ago **Most Watched Today** Peel Regional Police say they have seized the largest drug bust ever reported in the region as nearly $50 million dollars worth of cocaine was raided. Peel Regional Police say they have seized the largest drug bust ever reported in the region as nearly $50 million dollars worth of cocaine was raided. Both DHL and Canada Post continue to be clouded by delivery disruptions as negotiations drag on for both couriers with its worker's union. Both DHL and Canada Post continue to be clouded by delivery disruptions as negotiations drag on for both couriers with its worker's union. DHL workers on strike briefly clashed with a bus full of contract workers who were brought on to temporarily replace workers that were locked out by the courier. DHL workers on strike briefly clashed with a bus full of contract workers who were brought on to temporarily replace workers that were locked out by the courier. Israel has intercepted the Gaza-bound aid ship 'The Madleen' flotilla and has detained several prominent activists including Greta Thunberg. Israel has intercepted the Gaza-bound aid ship 'The Madleen' flotilla and has detained several prominent activists including Greta Thunberg. DHL Canada Express workers hit the picket lines after 2,100 of them were locked out for not accepting concessions by the courier, according to Unifor. DHL Canada Express workers hit the picket lines after 2,100 of them were locked out for not accepting concessions by the courier, according to Unifor. Get the CityNews AppListen live to NewsRadio Kitchener anytime and get breaking news, traffic, and weather alerts from CityNews Kitchener – available for both Android and iOS. **Get the CityNews App** Listen live to NewsRadio Kitchener anytime and get breaking news, traffic, and weather alerts from CityNews Kitchener – available for both Android and iOS. **Get the CityNews App** Listen live to NewsRadio Kitchener anytime and get breaking news, traffic, and weather alerts from CityNews Kitchener – available for both Android and iOS. Apple Store Google Play Store About Us News Policy Contact Us Privacy Policy Ad Choices Political Ads Registry Accessibility Feedback Terms of Service"}