{"id": 301, "name": "CT Mirror", "domain": "ctmirror.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://ctmirror.org/2025/06/10/with-cheers-for-child-care-lamont-begins-soft-reelection-campaign/", "title": "With Cheers For Child Care Lamont Begins Soft Reelection Campaign", "content": "**Get Connecticut public policy news at your fingertips.** Subscribe to CT Mirror's free daily newsletters. NEWSLETTERS DONATE 2025 Bill Tracker Politics Money Environment Education Justice Government Health Explainers Opinion Staff Contact Us Board & Friends Sponsors and Funders Advertising Investigations Newsletters Search Donate **Topics** Politics Money / State Budget Housing Economy Health Education Environment Government Justice Human Services Explainers Crossing Connecticut Charting CT **Opinion** Community Editorial Board CT Viewpoints Student Voice **Engage** Connecticut News Quiz CT Mirror en Español Events Podcasts **About** Mission Board Staff Resources **Columns** Talking Transportation Investigations Newsletters Search Donate **Topics** Politics Money / State Budget Housing Economy Health Education Environment Government Justice Human Services Explainers Crossing Connecticut Charting CT **Opinion** Community Editorial Board CT Viewpoints Student Voice **Engage** Connecticut News Quiz CT Mirror en Español Events Podcasts **About** Mission Board Staff Resources **Columns** Talking Transportation Staff Contact Us Board & Friends Sponsors and Funders Advertising CT Mirror Connecticut's Nonprofit Journalism. NEWSLETTERS DONATE 2025 Bill Tracker Politics Money Environment Education Justice Government Health Explainers Opinion **With cheers for child care, Lamont begins soft reelection campaign** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to share on X (Opens in new window)X Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Reddit (Opens in new window)Reddit Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print Republish This Story **Republish this article** This work is licensed under aCreative Commons Attribution-NoDerivatives 4.0 International License. You must use the HTML code below (including the Canonical code). You must include a byline, ideally in this format: \"by Ginny Monk, CT Mirror.\" Access to CT Mirror content that you republish must remain free. You may not sell access to this article, place it behind a paywall, or grant downstream publication rights to other publishers. You must receive approval from CT MirrorPublisher Bruce Puttermanprior to re-publishing your first CT Mirror story. See additional Republishing Guidelines, including conditions by which you may make small changes to story content,here. **With cheers for child care, Lamont begins soft reelection campaign** by Mark Pazniokas, CT MirrorJune 10, 2025 Support trusted journalism in Connecticut. Join CT Mirror’s members today and make an impact. Gov. Ned Lamont’s celebration Tuesday of a groundbreaking advance in early childhood education funding and his simultaneous struggle to calm concerns about a housing bill underscore the advantages and liabilities of incumbency as he edges towards a reelection campaign. Lamont, 71, a Democrat who has scored high approval ratings since rebounding during COVID-19 from a difficult first year, shared his inclination to seek a third term on Thursday, the morning after the conclusion of the 2025 legislative session. One immediate result is the heightened interest in how ably Lamont frames and exploits his legislative wins and how nimbly he can navigate, minimize or resolve controversies. Both tasks were on display Tuesday. Lamont, who was preparing to take an overnight flight to the Paris Air Show, twice updated reporters on his conversations with legislative leaders about hisreservations over elements of House Bill 5002, the housing legislation passed by relatively narrow margins. By day’s end, Lamont said he was inclined to sign the bill — assuming a deal is struck assuring that his misgivings would be addressed prior to it taking effect in October. Other sections would take effect next year. **Want to read more in-depth Connecticut news?** Get CT Mirror's latest government and public policy reporting in your inbox daily. “We’re desperately short of housing. That impacts affordability, impacts economic growth. This bill goes a long way to solving that,” Lamont said. “I think they went over the top in a couple of places.” His misgivings included a section requiring communities to divide housing need among towns and assign each town a number of units to plan and zone for. He called that “a planning tool” but one that is being misread as a mandate. **Childhood education bill celebrated** A celebration ofSenate Bill 1, a measure that will create a trust fund projected to raise salaries for child care workers, increase access and lower costs for parents, had all the ingredients of a campaign ad, save one. The forecast of rain moved the event from a telegenic play area outside an early childhood education and care center to a third-floor function room in the state Capitol. But the vibe was happy to the point of giddy. **More STORIES in Politics** **CT officials denounce Trump, defend right to protest** **Lamont seeking revisions to controversial housing bill** Beth Bye, who has run a well-regarded preschool, helped create the Office of Early Childhood as a state senator in 2013 and has run that office since Lamont took office in 2019, commanded the audience to rise for a sing a long as she once did for little children. The room was packed with advocates, including day-care teachers and parents who readily complied. They sang “If You’re Happy And You Know It.” And yes, someone eventually thrust an infant into the arms of the governor. The child wore a yellow shirt with the message, “Thank you governor.” Lamont proclaimed the press event to be “the happiest” of his tenure. The new off-budget early childhood trust fund drew opposition from Republicans, who saw it as weakening the state’s fiscal guardrails by drawing some surplus funds away from paying down debt and the unfunded pension liability. But Bye said it provides a structural solution to what the late Gwen Morgan, a national advocate and strategist on child care, termed the “trilemma” of simultaneously addressing quality, accessibility and affordability. “Gwen Morgan made up this term in the 1980s to highlight the inherent tradeoff policy makers were constantly making, and same with providers, because when you can improve one goal, sometimes it would undermine the other,” Bye said. Improving quality meant higher costs. Higher cost meant less accessibility. Controlling costs often meant lower wages, higher turnover and poorer quality. The Lamont administration’s initiative has roots in the COVID-19 pandemic, when the governor said that he was dramatically reminded of how the absence of adequate child care can shut vital services and the economy. “All of a sudden, I heard from nurses, ‘We cannot go to the hospital to take care of those folks most in need, unless we have a place where our kids can go, where they can be safe.’ And all of a sudden you realize how vital quality early childhood is for our economy,” Lamont said. Kyla Siegmann, the executive director of the Trinity College Community Child Center, said the governor was hardly alone in that realization. “Despite the critical role early educators play in shaping the future, we have operated in the shadows, underfunded, undervalued and often unseen,” she said. “Then came the COVID-19 pandemic, and in that time of crisis, a light was cast upon our work, not a spotlight, but a beacon.” The trust fund will increase availability beginning next year but will bring more dramatic improvements in 2027 through 2032. Early childhood education programs will have access to state grants that will require adherence to a pay structure equal to public school teachers, Bye said. Child care teachers earn on average about $36,000 annually, Bye said. “This endowment will increase reimbursement rates by 88% for participating programs who will need to agree to paying teachers on par with public school teachers,” Bye said. Trusted, independent and not going anywhere. Across the country, trust in news is eroding. Powerful figures are challenging stories they don’t like with legal threats. Local newsrooms are shrinking or closing. As that happens, misinformation, government corruption, political polarization, and even the cost of government all go up. And voter turnout, civic engagement, knowledge of candidates and government accountability all go down. As trust in national news organizations plummets, trust in CT Mirror continues to remain high. As newsrooms face pressure to pull their punches, CT Mirror operates fiercely independently. As local newsrooms wither, CT Mirror continues to grow. CT Mirror is a local journalism success story. All without a subscription fee or paywall. That’s because fair, accurate, unbiased news should be available to everyone, not just those who can afford it. So where does CT Mirror’s funding come from? It comes from a community of readers who understand that journalism strengthens our state. There’s more work to do. As major disruptions take place in Connecticut, CT Mirror tells you what’s happening and why. The more investigative reporting we do, the more we see a need to do more investigative reporting. Holding government accountable will always require tough questions, in-depth research, and painstaking reporting. If you agree, can you start a $15/month recurring donation today? Thank you. **Mark PazniokasCapitol Bureau Chief** x Mark is the Capitol Bureau Chief and a co-founder of CT Mirror. He is a frequent contributor to WNPR, a former state politics writer for The Hartford Courant and Journal Inquirer, and contributor for The New York Times. **Start** News Viewpoints Events ‘In the Room’ Podcasts In-Depth Series Investigations CT Mirror Explains Crossing Connecticut En Español Economic Indicator Dashboard Legal and Public Notices Toolbox **Engage** Sign Up for Newsletters Donate News Quiz Submit to CT Viewpoints Manage Your CT Mirror Membership Advertise With Us Publish Branded Storytelling Free Nonprofit Advertising Request a Speaking Engagement Use CT Mirror Photography **Learn** About Us History Impact Awards Financial Strategic Plan Policies Privacy Policy FAQ **Connect** Board of Directors Staff 2024 Community Editorial Board Sponsors and Funders Donors Friends of The Connecticut Mirror Work for Us Intern with Us Contact Us"}