{"id": 1956, "name": "End Time Headlines", "domain": "endtimeheadlines.org", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://endtimeheadlines.org/2025/06/joe-rogan-exposes-provision-in-controversial-big-beautiful-bill-that-prohibits-state-and-local-governments-from-passing-laws-regulating-ai-for-the-next-ten-years/", "title": "Joe Rogan Exposes Provision In Controversial Big Beautiful Bill That Prohibits State And Local Governments From Passing Laws Regulating Ai For The Next Ten Years", "content": "Home AboutWhat We BelieveContact UsCorrections PolicyAdvertise With ETH What We Believe Contact Us Corrections Policy Advertise With ETH What We Believe Contact Us Corrections Policy Advertise With ETH Support PodcastSpotifyApple Podcast Spotify Apple Podcast Spotify Apple Podcast Watch WMN Follow ETHFACEBOOKTWITTERYOUTUBERUMBLEINSTAGRAMTELEGRAM FACEBOOK TWITTER YOUTUBE RUMBLE INSTAGRAM TELEGRAM FACEBOOK TWITTER YOUTUBE RUMBLE INSTAGRAM TELEGRAM Select Page **Joe Rogan exposes provision in controversial “Big Beautiful Bill” that prohibits state and local governments from passing laws regulating AI for the next ten years** Jun 6, 2025 **Joe Rogan exposes provision in controversial “Big Beautiful Bill” that prohibits state and local governments from passing laws regulating AI for the next ten years** Jun 6, 2025 In a recent discussion, top podcast host Joe Rogan brought attention to a contentious provision tucked into President Donald Trump’s expansive legislative proposal, dubbed the “Big Beautiful Bill.” This bill, officially titled the “One Big Beautiful Bill Act,” has sparked debate due to a clause that prohibits state and local governments from regulating artificial intelligence (AI) for a decade. The revelation, amplified byInfowars, has raised concerns about the implications of such a sweeping federal moratorium on AI governance. Advertisement According to Infowars, Rogan broke down the provision during a recent episode, highlighting its potential to centralize AI regulation at the federal level while stifling state-led efforts to address issues like privacy, safety, and discrimination in AI systems. The clause explicitly states: “No State or political subdivision thereof may enforce any law or regulation regulating artificial intelligence models, artificial intelligence systems, or automated decision systems during the 10-year period beginning on the date of the enactment of this Act.” This is an attempt to created an AI dictatorship. Over all I support the BBB, but this extremely dangerous section MUST be PULLED out of the Senate version. Below Rogan’s quick breakdown, I provide the deep dive..https://t.co/BBdZ5EAwz5pic.twitter.com/JppYPB8ELo — Alex Jones (@RealAlexJones)June 6, 2025 This measure, if passed, would invalidate existing state AI laws and prevent new ones, affecting states like California, Colorado, and Utah, which have already enacted or proposed AI-related legislation. Infowars’ Alex Jones commented on the issue, describing the provision as an attempt to create an “AI dictatorship” by removing state oversight and potentially giving tech companies unchecked power. Jones, while expressing general support for the bill’s broader objectives, urged that this “extremely dangerous section” be removed from the Senate version of the legislation. His concerns echo those of critics who argue that the moratorium could undermine consumer protections and local governance, leaving AI development largely unregulated at a time when its societal impact is under intense scrutiny. The “Big Beautiful Bill,” which passed the House with a narrow 215-214 vote on May 22, 2025, encompasses a wide range of Republican priorities, including tax cuts, immigration policies, and increased funding for autonomous weapons. However, the AI regulation ban has drawn particular attention due to its potential to reshape the tech landscape. Proponents, such as Rep. Jay Obernolte (R-Calif.), argue that a patchwork of state regulations creates challenges for small startups and innovators, necessitating a unified federal approach. Critics, however, warn that preempting state laws without robust federal alternatives could expose consumers to risks like biased AI systems and unchecked deepfake technologies. The debate over this provision is far from settled, as the bill now faces scrutiny in the Senate, where procedural hurdles like the Byrd Rule could strip the AI moratorium for being non-budgetary. As Rogan’s discussion and Infowars’ coverage have brought this issue to a wider audience, it underscores the growing tension between innovation and regulation in the rapidly evolving AI industry. End Time Headlines is a ministry founded, owned, and operated by Ricky Scaparo, established in 2010 to equip believers and inform discerning individuals about the “Signs and Seasons” of the times in which we live. Ricky authors original articles and curates news from mainstream sources, carefully selecting topics, verifying information, and utilizing artificial intelligence tools to ensure content is both timely and accurate. Every piece is personally reviewed and edited by Ricky to align with the ministry’s mission of providing a prophetic perspective on current events. Facebook X Share: Designed byTecGuru|Corrections Policy|Privacy Policy"}