{"id": 1852, "name": "WOSH - 1490AM - Appleton", "domain": "1490wosh.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.1490wosh.com/news/pharmacy-in-brillion-announces-permanent-closure-cites-industry-challenges-inability-to-find-replacement-pharmacist/", "title": "Pharmacy In Brillion Announces Permanent Closure Cites Industry Challenges Inability To Find Replacement Pharmacist", "content": "ShowsWOSH Program ScheduleWeather WOSH Program Schedule Weather WOSH Program Schedule Weather LISTENStation App Station App Station App News Tip/Contact/DXStation InformationEmployment OpportunitiesFacebookDX ReportWOSH eClub Membership Station Information Employment Opportunities Facebook DX Report WOSH eClub Membership Station Information Employment Opportunities Facebook DX Report WOSH eClub Membership ContestsContest Rules Contest Rules Contest Rules News Sweet DealsBilling & Purchase Questions Billing & Purchase Questions Billing & Purchase Questions Advertising **Pharmacy in Brillion announces permanent closure, cites industry challenges & inability to find replacement pharmacist** BRILLION, Wis. (WFRV) – The Hometown Pharmacy in Brillion is shutting its doors for good as of June 16, 2025, thedrugstore announced on Wednesday. According to the release, the ‘difficult’ decision was influenced by industry challenges from Pharmacy Benefit Managers and struggles in finding a replacement pharmacist for the area. Wisconsin energy company to permanently close facility, 66 employees laid off While its location closes for good on June 16, the last day with open doors is on Friday, June 13. “Thank you for allowing us to serve you and for being such an important part of our Brillion community,” the release said. “We hope to see you soon at one of our other locations.” Brillion Fire Department welcomes and congratulates its first-ever Fire Cadets Those who need to transfer prescriptions should call and make changes quickly; however, the release added that nearby locations in Kimberly, Northland, Appleton and Neenah are still open and available for transfers. Transfer forms can be filled out byclicking this link. **Free Apps** Privacy Policy Terms of Service General Contest Rules Advertise With Us Contact Us Employment Opportunities WOSH Online Public File Cumulus Media Corporate EEO Public File Report FCC Applications Copyright 2020 Cumulus Media / Cumulus Media is an equal opportunity employer / AA View Full Site"}