{"id": 2222, "name": "De Speld", "domain": "speld.nl", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://speld.nl/2025/06/11/analyse-nederlands-elftal-op-iedere-positie-sterk-bezet-maar-als-spits-helaas-de-topscorer-van-oranje-aller-tijden/", "title": "Analyse Nederlands Elftal Op Iedere Positie Sterk Bezet Maar Als Spits Helaas De Topscorer Van Oranje Aller Tijden", "content": "De Speld op Facebook De Speld op Twitter\" De Speld op Instagram De Speld op Youtube De Speld mobile app op ios De Speld Mobile app op android MenuMijn AccountArchiefDe Speld LIVENieuwsbriefAdverterenContactVacatures Mijn Account Archief De Speld LIVE Nieuwsbrief Adverteren Contact Vacatures Mijn Account Archief De Speld LIVE Nieuwsbrief Adverteren Contact Vacatures CategorieënDe SpeldHomeVoetbalWielrennenFormule 1SchaatsenDarten De Speld Home Voetbal Wielrennen Formule 1 Schaatsen Darten De Speld Home Voetbal Wielrennen Formule 1 Schaatsen Darten Zoeken Home Darten Formule 1 Schaatsen Voetbal Wielrennen De Speld Mijn Vage Kennis Zoeken De Speld Home Voetbal Wielrennen Formule 1 Schaatsen Darten PRO SHOTS / Toin Damen **Analyse Nederlands elftal: op iedere positie sterk bezet, maar als spits helaas de topscorer van Oranje aller tijden** 11 juni 2025 doorJasper Schilder Na het nodige Nations League-geweld en twee kwalificatiewedstrijden, maken we graag de balans op over dit Nederlands elftal. De analyse: we zijn op iedere positie buitengewoon sterk bezet, maar als spits zitten we helaas opgescheept met de topscorer van Oranje aller tijden. Als je kijkt naar de breedte en kwaliteit van de huidige Oranje-selectie, dan hebben we een ouderwets goed stel. Middenvelders die furore maken bij grootmachten. Een blik verdedigers waar zelfs de Italianen U of “Mamma Mia” tegen zeggen. Aanvallende opties op de flanken hebben we ook zéér zeker! Je voelt dat we weer “een generatie” lijken te hebben. Maar dan, de spitspositie. Joshua Zirkzee pakte het stokje niet over, ondanks een veelbelovende transfer. Brobbey is fysiek ijzersterk, maar allergisch voor scoren. En Wout Weghorst is Wout Weghorst. Dus zitten we met – laten we hem geen rotte appel noemen – een behoorlijk zompige appel te kijken: een gozer die slechts meer doelpunten in Oranje maakte dan oudgedienden als Van Persie, Huntelaar, Kluivert en Bergkamp.And still counting. Het is hopen op een wonder, maar vooral een scorend wonderkind voordat het WK volgend jaar losbarst. **Uw reactie telt. Juist nu.Reactie annuleren** Reactie* Je e-mailadres wordt niet gepubliceerd.Vereiste velden zijn gemarkeerd met* Naam* E-mail* Mijn naam, e-mail en site opslaan in deze browser voor de volgende keer wanneer ik een reactie plaats. Δ Gerelateerd nieuws **Dit is wat de dikte van Trumps oranje make-uplaag zegt over de handelsoorlog** **Farioli verbolgen over speler die met het k-woord scheldt** **Nederland gestraft voor opstellen B-bondscoach** **Nederlanders vormen menselijke cirkel om Weghorst zodat niemand hoeft te zien dat hij aan het juichen is** Ibrahim Afellay voor vijftiende jaar op rij even oud gebleven Ibrahim Afellay voor vijftiende jaar op rij even oud gebleven 5 maatregelen om koppen veiliger te maken 5 maatregelen om koppen veiliger te maken Meerenner Johan (43) haalt 3.500 euro op bij Alpe d’Huez Meerenner Johan (43) haalt 3.500 euro op bij Alpe d’Huez Ook voor wielerfan John is de Dauphine een goede voorbereiding op de Tour Ook voor wielerfan John is de Dauphine een goede voorbereiding op de Tour Analyse Nederlands elftal: op iedere positie sterk bezet, maar als spits helaas de topscorer van Oranje aller tijden Analyse Nederlands elftal: op iedere positie sterk bezet, maar als spits helaas de topscorer van Oranje aller tijden **Blijf globaal op de hoogte met onze nieuwsbrief!** Dagelijks Wekelijks Vacatures Contact Adverteren"}