{"id": 1497, "name": "TruthorFiction.com", "domain": "truthorfiction.com", "bias": "center", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://www.truthorfiction.com/the-richest-1-evade-163-billion-in-taxes-every-year-the-united-states-literally-has-a-yacht-tax-deduction/", "title": "The Richest 1 Evade 163 Billion In Taxes Every Year The United States Literally Has A Yacht Tax Deduction", "content": "Home Fact ChecksMenu ToggleViral ContentPoliticsDisinformationEntertainment Viral Content Politics Disinformation Entertainment Viral Content Politics Disinformation Entertainment Search News Support Us!Menu ToggleAbout About About Home Fact Checks Viral Content ‘The Richest 1% Evade $163 Billion in Taxes Every Year, the United States Literally Has a Yacht Tax Deduction’ **‘The Richest 1% Evade $163 Billion in Taxes Every Year, the United States Literally Has a Yacht Tax Deduction’** On August 28 2023, an unlinked post by former United States Secretary of Labor Robert Reich was shared to Reddit’sr/WhitePeopleTwitter; it alleged that the “richest 1%” of Americans “evade $163 billion” in taxes each year, and that the United States “literally has a yacht tax deduction”: **Fact Check** Claim:\"Remember: The real freeloaders in this country are the rich, not the poor. The richest 1% evade 3 billion in taxes every year. The United States literally has a yacht tax deduction.\" Description:The claim suggests that the wealthiest 1% of Americans evade 3 billion in taxes each year and that there is a specific tax deduction for yacht purchases in the United States. Rating:Decontextualized Rating Explanation:The claim about the tax evasion by the 1% is supported by a report from the United States Department of Treasury, however, the ‘Yacht Tax Deduction’ is an interpretation of a complex IRS tax code section that allows for certain major purchases like yachts to be written off under specific circumstances. **Robert Reich’s “Yacht Tax Deduction” Posts and Social Media Discourse** The post was titled “$163,000,000,000 Every Year,” and information like the date of the post was cropped out; it did not link to the original tweet. Its text read: Remember: The real freeloaders in this country are the rich, not the poor. The richest 1% evade $163 billion in taxes every year. The United States literally has a yacht tax deduction. The most upvotedcommentto the post responded: It blows my mind that so many people put so much focus/anger on some poor person on welfare being “undeserving” but seemingly have no issue with rich ass people skimping out on taxes and hoarding their wealth like some dragon sitting on a pile of gold. It wasn’t visually clear where the post attributed to Reich initially appeared. On August 24 2023, Reich published a similartweet(with “Hello?” at the end): On August 25 2023, Reich shared a screenshot of the tweet (with a white background) toInstagram. In an appended post, Reich added: The oligarchs who control our economy and democracy seek to divide us so they can become more powerful. They want us to turn on each other so we don’t look up and see where all the wealth and power have gone. Remember: We have more in common with each other than we do with them. It was possible that Reich shared the post to additional platforms such as Mastodon, or that the Reddit poster screencapped the tweet in “night mode.” The posts contained two specific claims — that the wealthiest one percent of Americans “evaded” $163,000,000,000 per year in taxes, and that the United States “literally has a yacht tax deduction.” **‘The Richest 1% Evade $163 Billion in Taxes Every Year’** The first of the two claims held that the richest one percent of Americans evaded $136 billion in taxes each year. Reddit u/sillychillly submitted ther/WhitePeopleTwitterpost. Underneath the image, the user linked to a September 2021New York Timesarticlecorroborating the first claim, with the headline, “The top 1 percent are evading $163 billion a year in taxes, the Treasury finds.” It began: The wealthiest 1 percent of Americans are the nation’s most egregious tax evaders, failing to pay as much as $163 billion in owed taxes per year, according to a Treasury Department report released on [September 8 2021]. The analysis comes as the Biden administration pushes lawmakers to embrace its ambitious proposal to beef up the Internal Revenue Service to narrow the “tax gap,” which it estimates amounts to $7 trillion in unpaid taxes over a decade. The White House has proposed investing $80 billion in the agency over the next 10 years to hire more enforcement staff, overhaul its technology and usher in new information-reporting requirements that would give the government greater insight into tax evasion schemes. On September 7 2021, the U.S. Treasury Departmentpublished“The Case for a Robust Attack on the Tax Gap.” It included a slightly rounder version of the same figure, citing the nonpartisan National Bureau of Economic Research (NBER): A well-functioning tax system requires that everyone pays the taxes they owe. Today, the “tax gap”—the difference between taxes that are owed and collected—totals around $600 billion annually and will mean approximately $7 trillion of lost tax revenue over the next decade. The sheer magnitude of lost revenue is striking: it is equal to 3 percent of GDP, or all the income taxes paid by the lowest earning 90 percent of taxpayers. The tax gap can be a major source of inequity. Today’s tax code contains two sets of rules: one for regular wage and salary workers who report virtually all the income they earn; and another for wealthy taxpayers, who are often able to avoid a large share of the taxes they owe. As Table 1 demonstrates, estimates from academic researchers suggest that more than $160 billion lost annually is from taxes that top 1 percent choose not to pay. Reich’s figure was supported by a report from the United States Department of the Treasury, based on NBER research. **‘The United States Literally Has a Yacht Tax Deduction’** One commenterobjectedto the “yacht tax deduction” portion of the tweet, asserting there was “no such thing as a ‘yacht tax deduction’ simply for owning a yacht that exists.” A search for “yacht tax deduction” returned results published prior to Reich’s August 2023 posts, indicating that the concept was not novel or exclusive. One of the results was a December 2020tweetby Reich: In a threadedtweet, Reich linked to a source for his assertion: Reich linked to an April 2015Washington Postarticle(“The rich get government handouts just like the poor. Here are 10 of them”), which reported: The yacht tax deduction. If you’ve got a boat and you’re paying interest on it, that interest is tax-deductible – provided your boat is really, really big. If it has sleeping quarters, a kitchen and a toilet – e.g., it is a yacht – then it can be considered a second home and any interest you pay on it is deductible. But if you just have a garden-variety fishing boat or canoe, sorry – no deduction for you. Beyond that, if you have a yacht you can loan it out to a charter business for part of the year, and keep it for personal use the rest of the time. This allows you to deduct the purchase price, insurance, maintenance and slip fees too. Narrowing the search to results published on or before April 1 2015 returned a single result, a November 2013 post to Reddit’sr/Ask_Politics: In the most upvotedcomment, one section mentioned yacht tax deductions: The fourth major loophole is the rarest, but also (I think) the most unpalatable: special exemptions. Certain luxury items that are purchased exclusively by very wealthy people can be bought tax-free. Yachts, airplanes, those sorts of things. All of the money spent on these sorts of things can be “written off” (which is to say, if Mr. CEO spends $100,000,000 on a custom luxury yacht, the IRS will see it as though Mr. CEO made $100,000,000 less than he did this year–though more often the price of the yacht would be paid off over a period of years to lower Mr. CEO’s taxable income substantially for a while… plus he also gets a yacht). Another commenter posited that yacht taxes were harder to avoid, requiring “routing” the purchase through a special corporation. A user (“[deleted]”)responded: No need. The yacht is tax deductible (or at least the interest on the financing is) if you live on it for at least two weeks per year. Essentially you claim it as a second home and you get the yacht equivalent of the mortgage interest deduction. If you let your boat be chartered for two other weeks per year, you can claim your yacht as a business asset. It’s incredibly simple. What made you think it needed to involve an S/C corp? In a third response, “[deleted]” furtherclarified: I’m not sure you’re going to find [the “yacht tax deduction”] in the letter of the tax code in a way that is easily accessible. However, go spend some time checking out websites for companies that sell yachts–they’ll talk about the basic tax deductions that exist. This [link] has a good breakdown about how it works, and it talks a lot about using a charter system to get additional benefits. Take note that this particular site is discussing yachts at the $2,000,000 mark and below; bear in mind the rule of thumb from my first post: the more money that is at stake, the more worthwhile it becomes to use exotic ways to avoid tax liability. Unsurprisingly, the years-old link was no longer functional. We located other versions of thepage, “Your Yacht as a Tax Deduction,” whichexplained: For years savvy yacht buyers have recognized that there is a completely legitimate way to significantly reduce the cost of owning a yacht by structuring ownership in a manner that allows you to write-off the purchase price of your yacht and deduct most ownership expenses (insurance, slip fee, maintenance) against your employment income. This can be done by placing the yacht in charter while still having it available for your use and following some basic tax law guidelines. In addition to providing a tax shelter, your yacht will also generate charter income to help offset ownership expenses. Near the end of the page, a section detailed ways to evade taxes as of 2013: Here is a summary of the tax and income benefits available to the owners of new yachts purchased and placed in charter in 2013: Under Section 179 of the Internal Revenue Code, you can take a one-time expense deduction in the year of purchase equal to the purchase price of your yacht up to a maximum deduction of $500,000. This benefit is reduced for yachts priced over $2,000,000 (a subject beyond the scope of this article); plus You also can take a bonus depreciation deduction in the year of purchase of 50% of the amount of the purchase price over $500,000; plus You can depreciate the adjusted cost basis of your yacht (the balance of the purchase price after deducting the Section 179 expense deduction and 50% bonus depreciation deduction) over 10 years; plus You can deduct against your charter income and other employment income all ordinary and necessary charter related expenses including, for example, slip fees, insurance, repairs, loan interest, property tax, etc.; plus You will receive income from the charter of your yacht, the amount of which varies depending on the size of your yacht and the charter company you use. As an example, on the purchase of a $600,000 yacht placed in charter in 2013, the total deduction available to you under paragraphs 1 – 3, above, is $560,000 resulting in a tax savings of $196,000 in the year of purchase (assuming you are in the 35% tax bracket and can utilize the full deduction). To see how this deduction is calculated, see the Section 179 Tax Deduction Calculator. Several othersites(many of which were, incidentally,sellingyachts) alsoreferencedInternal Revenue CodeSection 179. A brief 2020 press release which announced updated guidelinesexplainedits utility: March 16, 2020 Section 179 of the tax code allows business taxpayers to deduct the cost of certain property as an expense when the property is first placed in service. Starting in 2018, the maximum deduction increased to $1 million. However, the deduction begins to phaseout at $2.5 million. This deduction applies to tangible property, such as machinery and equipment purchased for use in a trade or business. Eligible property includes qualified real property and certain property used to furnish lodging. Qualified real property includes improvements to roofs, HVAC, fire alarm systems and security systems to nonresidential real property. See IRS.gov formore information. Financial site NerdWallet.com explainedSection 179in more detail: A Section 179 expense is a business asset that can be written off for tax purposes right away rather than being depreciated over time. Section 179 of the U.S. tax code sets aside a large category of major purchases whose entire value can be used to write down a business’s taxable income in the year the purchased items are put into service. For example, if you buy a new piece of machinery for your factory, and begin using it right away, you may be able to deduct the entire cost from your business’s taxable income when you file taxes the next year. This is true even though the purchase will continue to have value to you in future years. Office furniture, computers and off-the-shelf software are among the business equipment covered by Section 179. It doesn’t generally cover real estate. While some vehicles, such as cargo vans, are eligible as Section 179 expenses, the federal government has narrowed businesses’ ability to write off vehicles traditionally used for personal transportation. Reich twice referenced a “literal yacht tax deduction,” phrasing that was slightly inexact. We first saw the concept of a “yacht tax deduction” emerge on Reddit in 2013, later appearing in aWashington Postarticle about “government handouts” to the wealthy in 2015. **Summary** A social media post about “the yacht tax deduction” and how the “richest 1% evade $163 billion in taxes every year” by Robert Reich was shared to Reddit’s r/WhitePeopleTwitter on August 28 2023. Reich’s $136 billion figure appeared in a U.S. Treasury report in September 2021, and was based on projections by NBER. The “yacht tax deduction” portion was a bit less well supported — but it referred to a specific IRS section, and it was backed up not just by financial articles but by pages advertising boat sales, which encouraged the ownership of yachts in terms of “providing a tax shelter.” $163,000,000,000 Every Year | Reddit $163,000,000,000 Every Year | Reddit Remember: The real freeloaders in this country are the rich, not the poor. The richest 1% evade $163 billion in taxes every year. The United States literally has a yacht tax deduction. Hello? | Robert Reich/Twitter Remember: The real freeloaders in this country are the rich, not the poor. The richest 1% evade $163 billion in taxes every year. The United States literally has a yacht tax deduction. Hello? | Robert Reich/Instagram r/WhitePeopleTwitter | Tag The top 1 percent are evading $163 billion a year in taxes, the Treasury finds. The Case for a Robust Attack on the Tax Gap | United States Department of the Treasury $163,000,000,000 Every Year | Reddit We have a literal yacht tax deduction in this country, and our politicians have the nerve to call a survival check a handout. | Robert Reich/Twitter We have a literal yacht tax deduction in this country, and our politicians have the nerve to call a survival check a handout. | Robert Reich/Twitter The rich get government handouts just like the poor. Here are 10 of them. What exactly are the loopholes, exemptions and laws that the top .1% are exploiting? | Reddit What exactly are the loopholes, exemptions and laws that the top .1% are exploiting? | Reddit What exactly are the loopholes, exemptions and laws that the top .1% are exploiting? | Reddit YOUR YACHT AS A TAX DEDUCTION Home Fact Checks Search News Support Us!"}