{"id": 1687, "name": "Children's Health Defense", "domain": "childrenshealthdefense.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://live.childrenshealthdefense.org/chd-tv/events/committee-hearings/made-in-america-strengthening-domestic-manufacturing-and-the-health-care-supply-chain/", "title": "Made In America Strengthening Domestic Manufacturing And The Health Care Supply Chain", "content": "Jun 11, 2025 Jun 11, 2025 **Made in America: Strengthening Domestic Manufacturing and the Health Care Supply Chain** WASHINGTON, D.C. – Congressman Brett Guthrie (KY-02), Chairman of the House Committee on Energy and Commerce, and Congressman Buddy Carter (GA-01), Chairman of the Subcommittee on Health, announced a hearing titled Made in America: Strengthening Domestic Manufacturing and the Health Care Supply Chain. “We have long been champions of policies that support efforts to onshore U.S.-based manufacturing and bolster our domestic supply chain, while, at the same time, strengthening our national security interests and economic goals,” said Chairmen Guthrie and Carter. “Reducing America’s reliance on other nations for essential medications and health care products has been a long-standing priority of the Subcommittee on Health, and we look forward to examining the current challenges and opportunities to best incentivize and establish a reliable, safe, resilient, and efficient health care supply chain.” **Witnesses:** Patrick Cashman— President, USAntibiotics Ronald T. Piervincenzi, Ph.D.— Chief Executive Officer, United States Pharmacopeia Josh Bolin— Associate Executive Director, Government Affairs and Innovation, National Association of Boards of Pharmacy Dawn O’Connell— Former Assistant Secretary for Preparedness and Response John Murphy, III— President and Chief Executive Officer, Association for Accessible Medicines *The opinions expressed by the hosts and guests in this show are not necessarily the views of Children’s Health Defense. Related Videos Pathways to Farming: The Next Generation of Farmers | June 5 Pathways to Farming: The Next Generation of Farmers | June 5 National Institutes of Health (NIH) Budget Hearing | May 23 National Institutes of Health (NIH) Budget Hearing | May 23 Water, Wildlife + Fisheries Budget Hearing Water, Wildlife + Fisheries Budget Hearing Improving Access and Opportunities for Hunting, Fishing, and Outdoor Recreation on America's Federal Lands | May 13 Improving Access and Opportunities for Hunting, Fishing, and Outdoor Recreation on America's Federal Lands | May 13 Children's Health Defense®is a 501(c)(3) non-profit organization. Our mission is ending childhood health epidemics by eliminating toxic exposure. We will restore and protect the health of children by eliminating environmental exposures, holding responsible parties accountable, and establishing safeguards to prevent future harm of children's health. Protecting Children. Exposing Harms. Seeking Justice. Donations are tax deductible to the full extent of the law. EIN #26-0388604 •Children's Health Defense •Legal Disclaimer •Terms of Use •Privacy Policy •Donate •Work for CHD •Contact •Social © 2016 -2025Children's Health Defense®•All Rights Reserved"}