{"id": 1604, "name": "Wolf Street", "domain": "wolfstreet.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://wolfstreet.com/2025/05/30/how-financial-services-a-market-plunge-in-april-and-a-historic-cliff-dive-by-recreation-services-messed-with-pce-inflation-today-but-a-snap-back-cometh/#comments", "title": "How Financial Services A Market Plunge In April And A Historic Cliff Dive By Recreation Services Messed With Pce Inflation Today But A Snap Back Cometh", "content": "**Wolf Street** **Main menu** HomeWolf RichterFederal ReserveHousing Bubble 2Donate?CommentingContact Wolf RichterFederal ReserveHousing Bubble 2Donate?CommentingContact Federal ReserveHousing Bubble 2Donate?CommentingContact Housing Bubble 2Donate?CommentingContact Donate?CommentingContact CommentingContact Contact Wolf RichterFederal ReserveHousing Bubble 2Donate?CommentingContact Federal ReserveHousing Bubble 2Donate?CommentingContact Housing Bubble 2Donate?CommentingContact Donate?CommentingContact CommentingContact Contact Federal ReserveHousing Bubble 2Donate?CommentingContact Housing Bubble 2Donate?CommentingContact Donate?CommentingContact CommentingContact Contact Housing Bubble 2Donate?CommentingContact Donate?CommentingContact CommentingContact Contact Donate?CommentingContact CommentingContact Contact CommentingContact Contact Contact **Sub menu** IMPLODED STOCKS Brick & Mortar Meltdown BanksCaliforniaCanadaCRE, the Epic MessCredit BubbleDebtor NationDrunken SailorsEuropeFederal ReserveHousing Bubble 2Inflation & DevaluationJapanJobsMarkets & CompaniesOil, Gas, PowerRetailTrucks & CarsTrade & Transportation **How Financial Services, a Market Plunge in April, and a Historic Cliff-Dive by Recreation Services Messed with PCE Inflation Today. But a Snap-Back Cometh** **by Wolf Richter •May 30, 2025•56 Comments** **Outside of two heroes that pushed down the overall indices, there isn’t anything benign about this PCE inflation data.** The PCE price index, released today by the Bureau of Economic Analysis, was benign. The overall PCE price index and the core PCE price index barely ticked up on a month-to-month basis, and on a year-over-year basis decelerated further toward the Fed’s 2% target. And that’s nice. But why? And the answer is not nice. Two very unusual things happened – one has never to that extent happened before in the data going back to 1960, and the other hasn’t happened to that extent since the market crash in 2020 – which pushed down the core services PCE price index, the core PCE price index, and the overall PCE price index. What’s not nice is that we know that those two components will snap back violently. The PCE (Personal Consumption Expenditure) price index tracks not only goods and services that are included in the CPI (Consumer Price Index), but also other categories that consumers don’t pay for directly, such as many financial services, and it tracks many of the components not by observing transaction prices, but by “imputing” price levels from other data, including from financial markets. This PCE price index for “financial services”with its “imputed” prices that consumers don’t pay for directly was one of the two stars of the show today. The “financial services” PCE price index, which features heavily in core services, plunged month-to-month by 1.69% (-18.6% annualized) in April, by far the biggest drop since April 2020, when it plunged even more based on the values it imputed from the crash of the financial markets at the time. April 2025 experienced a big stock market sell-off, a five-day drop totaling 12.4% of the Wilshire 5000 index, though markets recovered afterwards. And the PCE price index with its imputed values went haywire – but we know that it won’t last, that it will snap back violently: These are financial services many of which consumers don’t pay for directly, and much of it is imputed from other data. “For example, the imputed value of banking services to deposit holders is calculated based on factors like interest rates and the volume of deposits,” explains the BEA. It includes fees and commissions at banks, brokers, funds, portfolio management, etc. It includes “financial services furnished without payments” for which imputed values are used; it includes services provided by pension plans; commercial banks and credit unions; regulated investment companies; portfolio management and investment advice firms; trust, fiduciary, and custody activities, etc. Some of the sources from which values are imputed are FDIC data, PPI data, data from stock exchanges and markets — to impute the values for the components for portfolio management and investment advice services, for example — various government data, etc. And this financial services PCE price index is hugely volatile, some of it related to sharp movements in the financial markets, as in April 2020 and in April 2025. And it will snap back. The Fed knows all this, and Powell has occasionally mentioned the Financial Services component when it acts up in one or the other direction, and he might mention it again. Another hero: Recreation Services PCE price indexplunged month-to-month by 0.73% (-8.4% annualized), the biggest plunge in the entire history of the data going back to 1960. So this was another huge outlier. And it has nothing to do with foreigners not coming to the US suddenly, or whatever. Recreation services don’t include lodging, airfares, etc. The index includes cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipment. And we know it too will snap back, by just looking at this crazy chart of month-to-month changes: The Core Services PCE price indexwas pushed down substantially by these two heroes – Financial Services and Recreation Services: It rose by only 0.06% (+0.77% annualized) month-to-month in April, the smallest increase since April 2020, when, you guessed it, it had been pushed down even further by the Financial Services index due to the turmoil in the financial market at the time. However, the remaining core services categories showed significant inflation, except for “Other services.” Month-to-month annualized: Housing: +4.3% second highest since October Health care: +4.0% Transportation services: +9.3% Food services: +4.3% Insurance: +3.3% Non-energy utilities: +3.5% Other services: -0.8% So outside of those two heroes, there isn’t anything benign about this inflation data. And it will snap back too because financial services and recreation services will snap back. The “market-based PCE price index” was not benign.The BEA also produces an alternative “market based” PCE price index that excludes most imputed data (except owners’ equivalent of rent); and importantly, it excludes imputed components of financial services. It includes only prices that are based on actual transactions. This market-based services PCE price indexincreased month-to-month by 3.3% annualized, a slight deceleration from the prior month; and it increased year-over-year by 3.2%, a slight acceleration. The market-based core PCE Price indexrose by 3.1% annualized, a sharp acceleration. The six-month index accelerated to 2.5% annualized. And the year-over-year increase remained at 2.3%, roughly where it has been for the past four months: The snap-back cometh. Whatever inflation will do over the next couple of months, one thing we know: the PCE price index measures will include a snap-back from the plunge of the Financial Services index and the Recreation index. The Fed knows all this, obviously, and Powell occasionally mentioned the Financial Services component when it acted up in one or the other direction, and at the June FOMC meeting he might mention both, the plunge of the Financial Services index and the historic cliff-dive of the Recreation index, and might add a word or two about the coming snap-back of them. Enjoy reading WOLF STREET and want to support it? You can donate. I appreciate it immensely. Click on the mug to find out how: **To subscribe to WOLF STREET...** Enter your email address to receive notifications of new articles by email. It's free. Email Address Subscribe Email to a friend **Post navigation** **56 comments for “How Financial Services, a Market Plunge in April, and a Historic Cliff-Dive by Recreation Services Messed with PCE Inflation Today. But a Snap-Back Cometh”** Gattopardosays:May 30, 2025 at 2:12 pmCountdown until a certain someone says this is “BEAUTFUL” and “NO INFLATION”.This more complicated explanation will 1) go way over the heads of voters, and 2) not be explained to voters anyway. The Fed will just have to hang in there while they get badgered by b.s.Anthony Acesays:Jun 5, 2025 at 10:38 amWell since just about EVERYONE that you probably watch on TV has been saying these tariffs will destroy our economy, country and inflation will skyrocket despite 2018 numbers and we actually have inflation go down the last two months it sort of proves that maybe those talking heads you like are not honest. one reason I come to Wolf he is honest but sure cherry pick away to support your “belief system” Countdown until a certain someone says this is “BEAUTFUL” and “NO INFLATION”. This more complicated explanation will 1) go way over the heads of voters, and 2) not be explained to voters anyway. The Fed will just have to hang in there while they get badgered by b.s. Anthony Acesays:Jun 5, 2025 at 10:38 amWell since just about EVERYONE that you probably watch on TV has been saying these tariffs will destroy our economy, country and inflation will skyrocket despite 2018 numbers and we actually have inflation go down the last two months it sort of proves that maybe those talking heads you like are not honest. one reason I come to Wolf he is honest but sure cherry pick away to support your “belief system” Well since just about EVERYONE that you probably watch on TV has been saying these tariffs will destroy our economy, country and inflation will skyrocket despite 2018 numbers and we actually have inflation go down the last two months it sort of proves that maybe those talking heads you like are not honest. one reason I come to Wolf he is honest but sure cherry pick away to support your “belief system” Countdown until a certain someone says this is “BEAUTFUL” and “NO INFLATION”. This more complicated explanation will 1) go way over the heads of voters, and 2) not be explained to voters anyway. The Fed will just have to hang in there while they get badgered by b.s. Anthony Acesays:Jun 5, 2025 at 10:38 amWell since just about EVERYONE that you probably watch on TV has been saying these tariffs will destroy our economy, country and inflation will skyrocket despite 2018 numbers and we actually have inflation go down the last two months it sort of proves that maybe those talking heads you like are not honest. one reason I come to Wolf he is honest but sure cherry pick away to support your “belief system” Well since just about EVERYONE that you probably watch on TV has been saying these tariffs will destroy our economy, country and inflation will skyrocket despite 2018 numbers and we actually have inflation go down the last two months it sort of proves that maybe those talking heads you like are not honest. one reason I come to Wolf he is honest but sure cherry pick away to support your “belief system” Well since just about EVERYONE that you probably watch on TV has been saying these tariffs will destroy our economy, country and inflation will skyrocket despite 2018 numbers and we actually have inflation go down the last two months it sort of proves that maybe those talking heads you like are not honest. one reason I come to Wolf he is honest but sure cherry pick away to support your “belief system” Chris Bsays:May 30, 2025 at 2:38 pmSo financial services spending (imputed) declined because asset prices and/or consumer bank balances went down? I.e. the expense ratio my ETF charges me was a smaller amount because the value went down? Is that explanation at odds with an increase in the April Personal Savings Rate to 4.9%.And what explanation could we have for Recreational Services other than that consumers genuinely reduced their spending in this area? What reason do we have to think it will “snap back” other than reversion to the mean? Are we applying the same rationale to categories that snapped up in April and predicting they will revert to their means in May?Mostly, I’m surprised goods inflation had not shown up yet by April. That was the height of the tariff war but apparently the higher costs did not show up yet. Who lost money selling inventory that could only be replaced at much higher prices? If anything snaps back, I suspect it will be the earnings of supply chain companies.Wolf Richtersays:May 30, 2025 at 2:51 pm“So financial services spending (imputed) declined…”This is NOT “spending” data, this is INFLATION data (= rate of change of price levels).The fees and commissions by the “portfolio management” component and similar components are imputed from financial markets, and a market plunge causes the imputed level of those fees and commissions to plunge – even if consumers never pay those fees and commissions, and even if they actually never plunge.I didn’t check what caused the prices in Recreation Services to plunge by the most ever. I’m not really that interested in it. I don’t think it matters. I know it will violently snap back next month or two.These kinds of issues are why the PCE price index is not really a consumer price index. The CPI serves that role well enough. But we have to talk about this crazy PCE price index because everyone talks about it because the Fed uses is as its yardstick.Anthony A.says:May 30, 2025 at 3:14 pmI did a ten day vacation two weeks ago and the hotels I stayed at were pretty much empty. Maybe the high prices at those places finally sank in for travelers? Even the freeways were pretty empty.Of course, we are now entering the summer vacation period as schools are out for the summer and possibly the recreation stuff will snap back.Wolf Richtersays:May 30, 2025 at 5:14 pm1. the recreation services index doesn’t include lodging and airfares.It includes:Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipmentThat sudden historic month-to-month plunge had nothing to do with reality. It’s in the nature the PCE price index, and it will snap back, just look at the chart.2. to respond your comment: I just made reservations at a bunch of hotels in California and prices are out the wazoo, availability was limited, lots of dates at lots of places were booked. So maybe not as bad as last year, which was utter mayhem, but still bad (from a traveler’s point of view). Memorial Day travel was a record breaker. So there isn’t any kind of “historic” collapse going on.Wolf Richtersays:May 30, 2025 at 6:07 pmAlso, right before Memorial Day is a slow period, every year.Celtsays:May 30, 2025 at 7:27 pmNon-group tour bookings in my area have fallen off a cliff (-53%) compared to last May. Hopefully, this is a temporary aberaton.TrBondsays:May 31, 2025 at 9:13 amWhich begs the question, why does the Fed put such credence in the PCE inflation index vis a vis the CPI?I fear the answer is that the PCE inflation index has historically been lower than the CPI and thus has allowed the Fed to pursue a more accommodative monetary stance than could otherwise be.They have stated in the past that it’s the different month to month volatility between the two indices, but I think they just prefer more freedom from doing unpleasant stuff like hiking rates, which tends towards a bias to be accommodative, which in turn provides a bias for Inflation to rise.Wolf Richtersays:May 31, 2025 at 9:29 amAmong the reasons the Fed cited for using the PCE index are 1. that housing is a much smaller component in PCE than in CPI, and 2. that the index is broader by including categories that the CPI doesn’t include.I’m not sure the Fed cited this as a reason, but PCE uses “substitution” while CPI does not. When beef gets too expensive and some consumers then buy pork instead, the PCE price index will lower the weight of beef in the basket and increase the weight of pork. The CPI doesn’t do that.crazytownsays:May 31, 2025 at 9:41 amThat’s interesting, Wolf. The substitutions probably match reality of what consumers actually do in the face of rising prices (can’t buy what you can’t afford), but it’s not a great way to set monetary policy. So financial services spending (imputed) declined because asset prices and/or consumer bank balances went down? I.e. the expense ratio my ETF charges me was a smaller amount because the value went down? Is that explanation at odds with an increase in the April Personal Savings Rate to 4.9%. And what explanation could we have for Recreational Services other than that consumers genuinely reduced their spending in this area? What reason do we have to think it will “snap back” other than reversion to the mean? Are we applying the same rationale to categories that snapped up in April and predicting they will revert to their means in May? Mostly, I’m surprised goods inflation had not shown up yet by April. That was the height of the tariff war but apparently the higher costs did not show up yet. Who lost money selling inventory that could only be replaced at much higher prices? If anything snaps back, I suspect it will be the earnings of supply chain companies. Wolf Richtersays:May 30, 2025 at 2:51 pm“So financial services spending (imputed) declined…”This is NOT “spending” data, this is INFLATION data (= rate of change of price levels).The fees and commissions by the “portfolio management” component and similar components are imputed from financial markets, and a market plunge causes the imputed level of those fees and commissions to plunge – even if consumers never pay those fees and commissions, and even if they actually never plunge.I didn’t check what caused the prices in Recreation Services to plunge by the most ever. I’m not really that interested in it. I don’t think it matters. I know it will violently snap back next month or two.These kinds of issues are why the PCE price index is not really a consumer price index. The CPI serves that role well enough. But we have to talk about this crazy PCE price index because everyone talks about it because the Fed uses is as its yardstick.Anthony A.says:May 30, 2025 at 3:14 pmI did a ten day vacation two weeks ago and the hotels I stayed at were pretty much empty. Maybe the high prices at those places finally sank in for travelers? Even the freeways were pretty empty.Of course, we are now entering the summer vacation period as schools are out for the summer and possibly the recreation stuff will snap back.Wolf Richtersays:May 30, 2025 at 5:14 pm1. the recreation services index doesn’t include lodging and airfares.It includes:Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipmentThat sudden historic month-to-month plunge had nothing to do with reality. It’s in the nature the PCE price index, and it will snap back, just look at the chart.2. to respond your comment: I just made reservations at a bunch of hotels in California and prices are out the wazoo, availability was limited, lots of dates at lots of places were booked. So maybe not as bad as last year, which was utter mayhem, but still bad (from a traveler’s point of view). Memorial Day travel was a record breaker. So there isn’t any kind of “historic” collapse going on.Wolf Richtersays:May 30, 2025 at 6:07 pmAlso, right before Memorial Day is a slow period, every year.Celtsays:May 30, 2025 at 7:27 pmNon-group tour bookings in my area have fallen off a cliff (-53%) compared to last May. Hopefully, this is a temporary aberaton.TrBondsays:May 31, 2025 at 9:13 amWhich begs the question, why does the Fed put such credence in the PCE inflation index vis a vis the CPI?I fear the answer is that the PCE inflation index has historically been lower than the CPI and thus has allowed the Fed to pursue a more accommodative monetary stance than could otherwise be.They have stated in the past that it’s the different month to month volatility between the two indices, but I think they just prefer more freedom from doing unpleasant stuff like hiking rates, which tends towards a bias to be accommodative, which in turn provides a bias for Inflation to rise.Wolf Richtersays:May 31, 2025 at 9:29 amAmong the reasons the Fed cited for using the PCE index are 1. that housing is a much smaller component in PCE than in CPI, and 2. that the index is broader by including categories that the CPI doesn’t include.I’m not sure the Fed cited this as a reason, but PCE uses “substitution” while CPI does not. When beef gets too expensive and some consumers then buy pork instead, the PCE price index will lower the weight of beef in the basket and increase the weight of pork. The CPI doesn’t do that.crazytownsays:May 31, 2025 at 9:41 amThat’s interesting, Wolf. The substitutions probably match reality of what consumers actually do in the face of rising prices (can’t buy what you can’t afford), but it’s not a great way to set monetary policy. “So financial services spending (imputed) declined…” This is NOT “spending” data, this is INFLATION data (= rate of change of price levels). The fees and commissions by the “portfolio management” component and similar components are imputed from financial markets, and a market plunge causes the imputed level of those fees and commissions to plunge – even if consumers never pay those fees and commissions, and even if they actually never plunge. I didn’t check what caused the prices in Recreation Services to plunge by the most ever. I’m not really that interested in it. I don’t think it matters. I know it will violently snap back next month or two. These kinds of issues are why the PCE price index is not really a consumer price index. The CPI serves that role well enough. But we have to talk about this crazy PCE price index because everyone talks about it because the Fed uses is as its yardstick. Anthony A.says:May 30, 2025 at 3:14 pmI did a ten day vacation two weeks ago and the hotels I stayed at were pretty much empty. Maybe the high prices at those places finally sank in for travelers? Even the freeways were pretty empty.Of course, we are now entering the summer vacation period as schools are out for the summer and possibly the recreation stuff will snap back.Wolf Richtersays:May 30, 2025 at 5:14 pm1. the recreation services index doesn’t include lodging and airfares.It includes:Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipmentThat sudden historic month-to-month plunge had nothing to do with reality. It’s in the nature the PCE price index, and it will snap back, just look at the chart.2. to respond your comment: I just made reservations at a bunch of hotels in California and prices are out the wazoo, availability was limited, lots of dates at lots of places were booked. So maybe not as bad as last year, which was utter mayhem, but still bad (from a traveler’s point of view). Memorial Day travel was a record breaker. So there isn’t any kind of “historic” collapse going on.Wolf Richtersays:May 30, 2025 at 6:07 pmAlso, right before Memorial Day is a slow period, every year.Celtsays:May 30, 2025 at 7:27 pmNon-group tour bookings in my area have fallen off a cliff (-53%) compared to last May. Hopefully, this is a temporary aberaton. I did a ten day vacation two weeks ago and the hotels I stayed at were pretty much empty. Maybe the high prices at those places finally sank in for travelers? Even the freeways were pretty empty. Of course, we are now entering the summer vacation period as schools are out for the summer and possibly the recreation stuff will snap back. Wolf Richtersays:May 30, 2025 at 5:14 pm1. the recreation services index doesn’t include lodging and airfares.It includes:Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipmentThat sudden historic month-to-month plunge had nothing to do with reality. It’s in the nature the PCE price index, and it will snap back, just look at the chart.2. to respond your comment: I just made reservations at a bunch of hotels in California and prices are out the wazoo, availability was limited, lots of dates at lots of places were booked. So maybe not as bad as last year, which was utter mayhem, but still bad (from a traveler’s point of view). Memorial Day travel was a record breaker. So there isn’t any kind of “historic” collapse going on. 1. the recreation services index doesn’t include lodging and airfares. It includes: Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipment That sudden historic month-to-month plunge had nothing to do with reality. It’s in the nature the PCE price index, and it will snap back, just look at the chart. 2. to respond your comment: I just made reservations at a bunch of hotels in California and prices are out the wazoo, availability was limited, lots of dates at lots of places were booked. So maybe not as bad as last year, which was utter mayhem, but still bad (from a traveler’s point of view). Memorial Day travel was a record breaker. So there isn’t any kind of “historic” collapse going on. Wolf Richtersays:May 30, 2025 at 6:07 pmAlso, right before Memorial Day is a slow period, every year. Also, right before Memorial Day is a slow period, every year. Celtsays:May 30, 2025 at 7:27 pmNon-group tour bookings in my area have fallen off a cliff (-53%) compared to last May. Hopefully, this is a temporary aberaton. Non-group tour bookings in my area have fallen off a cliff (-53%) compared to last May. Hopefully, this is a temporary aberaton. TrBondsays:May 31, 2025 at 9:13 amWhich begs the question, why does the Fed put such credence in the PCE inflation index vis a vis the CPI?I fear the answer is that the PCE inflation index has historically been lower than the CPI and thus has allowed the Fed to pursue a more accommodative monetary stance than could otherwise be.They have stated in the past that it’s the different month to month volatility between the two indices, but I think they just prefer more freedom from doing unpleasant stuff like hiking rates, which tends towards a bias to be accommodative, which in turn provides a bias for Inflation to rise.Wolf Richtersays:May 31, 2025 at 9:29 amAmong the reasons the Fed cited for using the PCE index are 1. that housing is a much smaller component in PCE than in CPI, and 2. that the index is broader by including categories that the CPI doesn’t include.I’m not sure the Fed cited this as a reason, but PCE uses “substitution” while CPI does not. When beef gets too expensive and some consumers then buy pork instead, the PCE price index will lower the weight of beef in the basket and increase the weight of pork. The CPI doesn’t do that.crazytownsays:May 31, 2025 at 9:41 amThat’s interesting, Wolf. The substitutions probably match reality of what consumers actually do in the face of rising prices (can’t buy what you can’t afford), but it’s not a great way to set monetary policy. Which begs the question, why does the Fed put such credence in the PCE inflation index vis a vis the CPI?I fear the answer is that the PCE inflation index has historically been lower than the CPI and thus has allowed the Fed to pursue a more accommodative monetary stance than could otherwise be.They have stated in the past that it’s the different month to month volatility between the two indices, but I think they just prefer more freedom from doing unpleasant stuff like hiking rates, which tends towards a bias to be accommodative, which in turn provides a bias for Inflation to rise. Wolf Richtersays:May 31, 2025 at 9:29 amAmong the reasons the Fed cited for using the PCE index are 1. that housing is a much smaller component in PCE than in CPI, and 2. that the index is broader by including categories that the CPI doesn’t include.I’m not sure the Fed cited this as a reason, but PCE uses “substitution” while CPI does not. When beef gets too expensive and some consumers then buy pork instead, the PCE price index will lower the weight of beef in the basket and increase the weight of pork. The CPI doesn’t do that. Among the reasons the Fed cited for using the PCE index are 1. that housing is a much smaller component in PCE than in CPI, and 2. that the index is broader by including categories that the CPI doesn’t include. I’m not sure the Fed cited this as a reason, but PCE uses “substitution” while CPI does not. When beef gets too expensive and some consumers then buy pork instead, the PCE price index will lower the weight of beef in the basket and increase the weight of pork. The CPI doesn’t do that. crazytownsays:May 31, 2025 at 9:41 amThat’s interesting, Wolf. The substitutions probably match reality of what consumers actually do in the face of rising prices (can’t buy what you can’t afford), but it’s not a great way to set monetary policy. That’s interesting, Wolf. The substitutions probably match reality of what consumers actually do in the face of rising prices (can’t buy what you can’t afford), but it’s not a great way to set monetary policy. So financial services spending (imputed) declined because asset prices and/or consumer bank balances went down? I.e. the expense ratio my ETF charges me was a smaller amount because the value went down? Is that explanation at odds with an increase in the April Personal Savings Rate to 4.9%. And what explanation could we have for Recreational Services other than that consumers genuinely reduced their spending in this area? What reason do we have to think it will “snap back” other than reversion to the mean? Are we applying the same rationale to categories that snapped up in April and predicting they will revert to their means in May? Mostly, I’m surprised goods inflation had not shown up yet by April. That was the height of the tariff war but apparently the higher costs did not show up yet. Who lost money selling inventory that could only be replaced at much higher prices? If anything snaps back, I suspect it will be the earnings of supply chain companies. Wolf Richtersays:May 30, 2025 at 2:51 pm“So financial services spending (imputed) declined…”This is NOT “spending” data, this is INFLATION data (= rate of change of price levels).The fees and commissions by the “portfolio management” component and similar components are imputed from financial markets, and a market plunge causes the imputed level of those fees and commissions to plunge – even if consumers never pay those fees and commissions, and even if they actually never plunge.I didn’t check what caused the prices in Recreation Services to plunge by the most ever. I’m not really that interested in it. I don’t think it matters. I know it will violently snap back next month or two.These kinds of issues are why the PCE price index is not really a consumer price index. The CPI serves that role well enough. But we have to talk about this crazy PCE price index because everyone talks about it because the Fed uses is as its yardstick.Anthony A.says:May 30, 2025 at 3:14 pmI did a ten day vacation two weeks ago and the hotels I stayed at were pretty much empty. Maybe the high prices at those places finally sank in for travelers? Even the freeways were pretty empty.Of course, we are now entering the summer vacation period as schools are out for the summer and possibly the recreation stuff will snap back.Wolf Richtersays:May 30, 2025 at 5:14 pm1. the recreation services index doesn’t include lodging and airfares.It includes:Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipmentThat sudden historic month-to-month plunge had nothing to do with reality. It’s in the nature the PCE price index, and it will snap back, just look at the chart.2. to respond your comment: I just made reservations at a bunch of hotels in California and prices are out the wazoo, availability was limited, lots of dates at lots of places were booked. So maybe not as bad as last year, which was utter mayhem, but still bad (from a traveler’s point of view). Memorial Day travel was a record breaker. So there isn’t any kind of “historic” collapse going on.Wolf Richtersays:May 30, 2025 at 6:07 pmAlso, right before Memorial Day is a slow period, every year.Celtsays:May 30, 2025 at 7:27 pmNon-group tour bookings in my area have fallen off a cliff (-53%) compared to last May. Hopefully, this is a temporary aberaton.TrBondsays:May 31, 2025 at 9:13 amWhich begs the question, why does the Fed put such credence in the PCE inflation index vis a vis the CPI?I fear the answer is that the PCE inflation index has historically been lower than the CPI and thus has allowed the Fed to pursue a more accommodative monetary stance than could otherwise be.They have stated in the past that it’s the different month to month volatility between the two indices, but I think they just prefer more freedom from doing unpleasant stuff like hiking rates, which tends towards a bias to be accommodative, which in turn provides a bias for Inflation to rise.Wolf Richtersays:May 31, 2025 at 9:29 amAmong the reasons the Fed cited for using the PCE index are 1. that housing is a much smaller component in PCE than in CPI, and 2. that the index is broader by including categories that the CPI doesn’t include.I’m not sure the Fed cited this as a reason, but PCE uses “substitution” while CPI does not. When beef gets too expensive and some consumers then buy pork instead, the PCE price index will lower the weight of beef in the basket and increase the weight of pork. The CPI doesn’t do that.crazytownsays:May 31, 2025 at 9:41 amThat’s interesting, Wolf. The substitutions probably match reality of what consumers actually do in the face of rising prices (can’t buy what you can’t afford), but it’s not a great way to set monetary policy. “So financial services spending (imputed) declined…” This is NOT “spending” data, this is INFLATION data (= rate of change of price levels). The fees and commissions by the “portfolio management” component and similar components are imputed from financial markets, and a market plunge causes the imputed level of those fees and commissions to plunge – even if consumers never pay those fees and commissions, and even if they actually never plunge. I didn’t check what caused the prices in Recreation Services to plunge by the most ever. I’m not really that interested in it. I don’t think it matters. I know it will violently snap back next month or two. These kinds of issues are why the PCE price index is not really a consumer price index. The CPI serves that role well enough. But we have to talk about this crazy PCE price index because everyone talks about it because the Fed uses is as its yardstick. Anthony A.says:May 30, 2025 at 3:14 pmI did a ten day vacation two weeks ago and the hotels I stayed at were pretty much empty. Maybe the high prices at those places finally sank in for travelers? Even the freeways were pretty empty.Of course, we are now entering the summer vacation period as schools are out for the summer and possibly the recreation stuff will snap back.Wolf Richtersays:May 30, 2025 at 5:14 pm1. the recreation services index doesn’t include lodging and airfares.It includes:Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipmentThat sudden historic month-to-month plunge had nothing to do with reality. It’s in the nature the PCE price index, and it will snap back, just look at the chart.2. to respond your comment: I just made reservations at a bunch of hotels in California and prices are out the wazoo, availability was limited, lots of dates at lots of places were booked. So maybe not as bad as last year, which was utter mayhem, but still bad (from a traveler’s point of view). Memorial Day travel was a record breaker. So there isn’t any kind of “historic” collapse going on.Wolf Richtersays:May 30, 2025 at 6:07 pmAlso, right before Memorial Day is a slow period, every year.Celtsays:May 30, 2025 at 7:27 pmNon-group tour bookings in my area have fallen off a cliff (-53%) compared to last May. Hopefully, this is a temporary aberaton. I did a ten day vacation two weeks ago and the hotels I stayed at were pretty much empty. Maybe the high prices at those places finally sank in for travelers? Even the freeways were pretty empty. Of course, we are now entering the summer vacation period as schools are out for the summer and possibly the recreation stuff will snap back. Wolf Richtersays:May 30, 2025 at 5:14 pm1. the recreation services index doesn’t include lodging and airfares.It includes:Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipmentThat sudden historic month-to-month plunge had nothing to do with reality. It’s in the nature the PCE price index, and it will snap back, just look at the chart.2. to respond your comment: I just made reservations at a bunch of hotels in California and prices are out the wazoo, availability was limited, lots of dates at lots of places were booked. So maybe not as bad as last year, which was utter mayhem, but still bad (from a traveler’s point of view). Memorial Day travel was a record breaker. So there isn’t any kind of “historic” collapse going on. 1. the recreation services index doesn’t include lodging and airfares. It includes: Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipment That sudden historic month-to-month plunge had nothing to do with reality. It’s in the nature the PCE price index, and it will snap back, just look at the chart. 2. to respond your comment: I just made reservations at a bunch of hotels in California and prices are out the wazoo, availability was limited, lots of dates at lots of places were booked. So maybe not as bad as last year, which was utter mayhem, but still bad (from a traveler’s point of view). Memorial Day travel was a record breaker. So there isn’t any kind of “historic” collapse going on. Wolf Richtersays:May 30, 2025 at 6:07 pmAlso, right before Memorial Day is a slow period, every year. Also, right before Memorial Day is a slow period, every year. Celtsays:May 30, 2025 at 7:27 pmNon-group tour bookings in my area have fallen off a cliff (-53%) compared to last May. Hopefully, this is a temporary aberaton. Non-group tour bookings in my area have fallen off a cliff (-53%) compared to last May. Hopefully, this is a temporary aberaton. TrBondsays:May 31, 2025 at 9:13 amWhich begs the question, why does the Fed put such credence in the PCE inflation index vis a vis the CPI?I fear the answer is that the PCE inflation index has historically been lower than the CPI and thus has allowed the Fed to pursue a more accommodative monetary stance than could otherwise be.They have stated in the past that it’s the different month to month volatility between the two indices, but I think they just prefer more freedom from doing unpleasant stuff like hiking rates, which tends towards a bias to be accommodative, which in turn provides a bias for Inflation to rise.Wolf Richtersays:May 31, 2025 at 9:29 amAmong the reasons the Fed cited for using the PCE index are 1. that housing is a much smaller component in PCE than in CPI, and 2. that the index is broader by including categories that the CPI doesn’t include.I’m not sure the Fed cited this as a reason, but PCE uses “substitution” while CPI does not. When beef gets too expensive and some consumers then buy pork instead, the PCE price index will lower the weight of beef in the basket and increase the weight of pork. The CPI doesn’t do that.crazytownsays:May 31, 2025 at 9:41 amThat’s interesting, Wolf. The substitutions probably match reality of what consumers actually do in the face of rising prices (can’t buy what you can’t afford), but it’s not a great way to set monetary policy. Which begs the question, why does the Fed put such credence in the PCE inflation index vis a vis the CPI?I fear the answer is that the PCE inflation index has historically been lower than the CPI and thus has allowed the Fed to pursue a more accommodative monetary stance than could otherwise be.They have stated in the past that it’s the different month to month volatility between the two indices, but I think they just prefer more freedom from doing unpleasant stuff like hiking rates, which tends towards a bias to be accommodative, which in turn provides a bias for Inflation to rise. Wolf Richtersays:May 31, 2025 at 9:29 amAmong the reasons the Fed cited for using the PCE index are 1. that housing is a much smaller component in PCE than in CPI, and 2. that the index is broader by including categories that the CPI doesn’t include.I’m not sure the Fed cited this as a reason, but PCE uses “substitution” while CPI does not. When beef gets too expensive and some consumers then buy pork instead, the PCE price index will lower the weight of beef in the basket and increase the weight of pork. The CPI doesn’t do that. Among the reasons the Fed cited for using the PCE index are 1. that housing is a much smaller component in PCE than in CPI, and 2. that the index is broader by including categories that the CPI doesn’t include. I’m not sure the Fed cited this as a reason, but PCE uses “substitution” while CPI does not. When beef gets too expensive and some consumers then buy pork instead, the PCE price index will lower the weight of beef in the basket and increase the weight of pork. The CPI doesn’t do that. crazytownsays:May 31, 2025 at 9:41 amThat’s interesting, Wolf. The substitutions probably match reality of what consumers actually do in the face of rising prices (can’t buy what you can’t afford), but it’s not a great way to set monetary policy. That’s interesting, Wolf. The substitutions probably match reality of what consumers actually do in the face of rising prices (can’t buy what you can’t afford), but it’s not a great way to set monetary policy. “So financial services spending (imputed) declined…” This is NOT “spending” data, this is INFLATION data (= rate of change of price levels). The fees and commissions by the “portfolio management” component and similar components are imputed from financial markets, and a market plunge causes the imputed level of those fees and commissions to plunge – even if consumers never pay those fees and commissions, and even if they actually never plunge. I didn’t check what caused the prices in Recreation Services to plunge by the most ever. I’m not really that interested in it. I don’t think it matters. I know it will violently snap back next month or two. These kinds of issues are why the PCE price index is not really a consumer price index. The CPI serves that role well enough. But we have to talk about this crazy PCE price index because everyone talks about it because the Fed uses is as its yardstick. Anthony A.says:May 30, 2025 at 3:14 pmI did a ten day vacation two weeks ago and the hotels I stayed at were pretty much empty. Maybe the high prices at those places finally sank in for travelers? Even the freeways were pretty empty.Of course, we are now entering the summer vacation period as schools are out for the summer and possibly the recreation stuff will snap back.Wolf Richtersays:May 30, 2025 at 5:14 pm1. the recreation services index doesn’t include lodging and airfares.It includes:Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipmentThat sudden historic month-to-month plunge had nothing to do with reality. It’s in the nature the PCE price index, and it will snap back, just look at the chart.2. to respond your comment: I just made reservations at a bunch of hotels in California and prices are out the wazoo, availability was limited, lots of dates at lots of places were booked. So maybe not as bad as last year, which was utter mayhem, but still bad (from a traveler’s point of view). Memorial Day travel was a record breaker. So there isn’t any kind of “historic” collapse going on.Wolf Richtersays:May 30, 2025 at 6:07 pmAlso, right before Memorial Day is a slow period, every year.Celtsays:May 30, 2025 at 7:27 pmNon-group tour bookings in my area have fallen off a cliff (-53%) compared to last May. Hopefully, this is a temporary aberaton. I did a ten day vacation two weeks ago and the hotels I stayed at were pretty much empty. Maybe the high prices at those places finally sank in for travelers? Even the freeways were pretty empty. Of course, we are now entering the summer vacation period as schools are out for the summer and possibly the recreation stuff will snap back. Wolf Richtersays:May 30, 2025 at 5:14 pm1. the recreation services index doesn’t include lodging and airfares.It includes:Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipmentThat sudden historic month-to-month plunge had nothing to do with reality. It’s in the nature the PCE price index, and it will snap back, just look at the chart.2. to respond your comment: I just made reservations at a bunch of hotels in California and prices are out the wazoo, availability was limited, lots of dates at lots of places were booked. So maybe not as bad as last year, which was utter mayhem, but still bad (from a traveler’s point of view). Memorial Day travel was a record breaker. So there isn’t any kind of “historic” collapse going on. 1. the recreation services index doesn’t include lodging and airfares. It includes: Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipment That sudden historic month-to-month plunge had nothing to do with reality. It’s in the nature the PCE price index, and it will snap back, just look at the chart. 2. to respond your comment: I just made reservations at a bunch of hotels in California and prices are out the wazoo, availability was limited, lots of dates at lots of places were booked. So maybe not as bad as last year, which was utter mayhem, but still bad (from a traveler’s point of view). Memorial Day travel was a record breaker. So there isn’t any kind of “historic” collapse going on. Wolf Richtersays:May 30, 2025 at 6:07 pmAlso, right before Memorial Day is a slow period, every year. Also, right before Memorial Day is a slow period, every year. Celtsays:May 30, 2025 at 7:27 pmNon-group tour bookings in my area have fallen off a cliff (-53%) compared to last May. Hopefully, this is a temporary aberaton. Non-group tour bookings in my area have fallen off a cliff (-53%) compared to last May. Hopefully, this is a temporary aberaton. I did a ten day vacation two weeks ago and the hotels I stayed at were pretty much empty. Maybe the high prices at those places finally sank in for travelers? Even the freeways were pretty empty. Of course, we are now entering the summer vacation period as schools are out for the summer and possibly the recreation stuff will snap back. Wolf Richtersays:May 30, 2025 at 5:14 pm1. the recreation services index doesn’t include lodging and airfares.It includes:Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipmentThat sudden historic month-to-month plunge had nothing to do with reality. It’s in the nature the PCE price index, and it will snap back, just look at the chart.2. to respond your comment: I just made reservations at a bunch of hotels in California and prices are out the wazoo, availability was limited, lots of dates at lots of places were booked. So maybe not as bad as last year, which was utter mayhem, but still bad (from a traveler’s point of view). Memorial Day travel was a record breaker. So there isn’t any kind of “historic” collapse going on. 1. the recreation services index doesn’t include lodging and airfares. It includes: Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipment That sudden historic month-to-month plunge had nothing to do with reality. It’s in the nature the PCE price index, and it will snap back, just look at the chart. 2. to respond your comment: I just made reservations at a bunch of hotels in California and prices are out the wazoo, availability was limited, lots of dates at lots of places were booked. So maybe not as bad as last year, which was utter mayhem, but still bad (from a traveler’s point of view). Memorial Day travel was a record breaker. So there isn’t any kind of “historic” collapse going on. 1. the recreation services index doesn’t include lodging and airfares. It includes: Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipment That sudden historic month-to-month plunge had nothing to do with reality. It’s in the nature the PCE price index, and it will snap back, just look at the chart. 2. to respond your comment: I just made reservations at a bunch of hotels in California and prices are out the wazoo, availability was limited, lots of dates at lots of places were booked. So maybe not as bad as last year, which was utter mayhem, but still bad (from a traveler’s point of view). Memorial Day travel was a record breaker. So there isn’t any kind of “historic” collapse going on. Wolf Richtersays:May 30, 2025 at 6:07 pmAlso, right before Memorial Day is a slow period, every year. Also, right before Memorial Day is a slow period, every year. Also, right before Memorial Day is a slow period, every year. Celtsays:May 30, 2025 at 7:27 pmNon-group tour bookings in my area have fallen off a cliff (-53%) compared to last May. Hopefully, this is a temporary aberaton. Non-group tour bookings in my area have fallen off a cliff (-53%) compared to last May. Hopefully, this is a temporary aberaton. Non-group tour bookings in my area have fallen off a cliff (-53%) compared to last May. Hopefully, this is a temporary aberaton. TrBondsays:May 31, 2025 at 9:13 amWhich begs the question, why does the Fed put such credence in the PCE inflation index vis a vis the CPI?I fear the answer is that the PCE inflation index has historically been lower than the CPI and thus has allowed the Fed to pursue a more accommodative monetary stance than could otherwise be.They have stated in the past that it’s the different month to month volatility between the two indices, but I think they just prefer more freedom from doing unpleasant stuff like hiking rates, which tends towards a bias to be accommodative, which in turn provides a bias for Inflation to rise.Wolf Richtersays:May 31, 2025 at 9:29 amAmong the reasons the Fed cited for using the PCE index are 1. that housing is a much smaller component in PCE than in CPI, and 2. that the index is broader by including categories that the CPI doesn’t include.I’m not sure the Fed cited this as a reason, but PCE uses “substitution” while CPI does not. When beef gets too expensive and some consumers then buy pork instead, the PCE price index will lower the weight of beef in the basket and increase the weight of pork. The CPI doesn’t do that.crazytownsays:May 31, 2025 at 9:41 amThat’s interesting, Wolf. The substitutions probably match reality of what consumers actually do in the face of rising prices (can’t buy what you can’t afford), but it’s not a great way to set monetary policy. Which begs the question, why does the Fed put such credence in the PCE inflation index vis a vis the CPI?I fear the answer is that the PCE inflation index has historically been lower than the CPI and thus has allowed the Fed to pursue a more accommodative monetary stance than could otherwise be.They have stated in the past that it’s the different month to month volatility between the two indices, but I think they just prefer more freedom from doing unpleasant stuff like hiking rates, which tends towards a bias to be accommodative, which in turn provides a bias for Inflation to rise. Wolf Richtersays:May 31, 2025 at 9:29 amAmong the reasons the Fed cited for using the PCE index are 1. that housing is a much smaller component in PCE than in CPI, and 2. that the index is broader by including categories that the CPI doesn’t include.I’m not sure the Fed cited this as a reason, but PCE uses “substitution” while CPI does not. When beef gets too expensive and some consumers then buy pork instead, the PCE price index will lower the weight of beef in the basket and increase the weight of pork. The CPI doesn’t do that. Among the reasons the Fed cited for using the PCE index are 1. that housing is a much smaller component in PCE than in CPI, and 2. that the index is broader by including categories that the CPI doesn’t include. I’m not sure the Fed cited this as a reason, but PCE uses “substitution” while CPI does not. When beef gets too expensive and some consumers then buy pork instead, the PCE price index will lower the weight of beef in the basket and increase the weight of pork. The CPI doesn’t do that. crazytownsays:May 31, 2025 at 9:41 amThat’s interesting, Wolf. The substitutions probably match reality of what consumers actually do in the face of rising prices (can’t buy what you can’t afford), but it’s not a great way to set monetary policy. That’s interesting, Wolf. The substitutions probably match reality of what consumers actually do in the face of rising prices (can’t buy what you can’t afford), but it’s not a great way to set monetary policy. Which begs the question, why does the Fed put such credence in the PCE inflation index vis a vis the CPI?I fear the answer is that the PCE inflation index has historically been lower than the CPI and thus has allowed the Fed to pursue a more accommodative monetary stance than could otherwise be.They have stated in the past that it’s the different month to month volatility between the two indices, but I think they just prefer more freedom from doing unpleasant stuff like hiking rates, which tends towards a bias to be accommodative, which in turn provides a bias for Inflation to rise. Wolf Richtersays:May 31, 2025 at 9:29 amAmong the reasons the Fed cited for using the PCE index are 1. that housing is a much smaller component in PCE than in CPI, and 2. that the index is broader by including categories that the CPI doesn’t include.I’m not sure the Fed cited this as a reason, but PCE uses “substitution” while CPI does not. When beef gets too expensive and some consumers then buy pork instead, the PCE price index will lower the weight of beef in the basket and increase the weight of pork. The CPI doesn’t do that. Among the reasons the Fed cited for using the PCE index are 1. that housing is a much smaller component in PCE than in CPI, and 2. that the index is broader by including categories that the CPI doesn’t include. I’m not sure the Fed cited this as a reason, but PCE uses “substitution” while CPI does not. When beef gets too expensive and some consumers then buy pork instead, the PCE price index will lower the weight of beef in the basket and increase the weight of pork. The CPI doesn’t do that. Among the reasons the Fed cited for using the PCE index are 1. that housing is a much smaller component in PCE than in CPI, and 2. that the index is broader by including categories that the CPI doesn’t include. I’m not sure the Fed cited this as a reason, but PCE uses “substitution” while CPI does not. When beef gets too expensive and some consumers then buy pork instead, the PCE price index will lower the weight of beef in the basket and increase the weight of pork. The CPI doesn’t do that. crazytownsays:May 31, 2025 at 9:41 amThat’s interesting, Wolf. The substitutions probably match reality of what consumers actually do in the face of rising prices (can’t buy what you can’t afford), but it’s not a great way to set monetary policy. That’s interesting, Wolf. The substitutions probably match reality of what consumers actually do in the face of rising prices (can’t buy what you can’t afford), but it’s not a great way to set monetary policy. That’s interesting, Wolf. The substitutions probably match reality of what consumers actually do in the face of rising prices (can’t buy what you can’t afford), but it’s not a great way to set monetary policy. andysays:May 30, 2025 at 2:49 pmAny history buffs here? How much stocks need to drop for Monday to be a “Black Monday”? Can circuit breakers delay it to let’s say “Black Thursday”? Should I be worried at all?Anthony A.says:May 30, 2025 at 3:16 pmAndy, just remember, for every seller, there is a buyer, and vice versa! You can be either or both!Eric86says:May 30, 2025 at 3:26 pmNo. Probably not. Unless you just love media headlines.D Diamondsays:May 30, 2025 at 6:22 pmSP 500 Current market-wide circuit breakers are set as follows:Level 1: 7% decline before 3:25 p.m. ET, trading halts for 15 minutes. If it occurs after that time, trading does not halt.Level 2: 13% decline before 3:25 p.m. ET, trading halts for 15 minutes. If it occurs after that time, trading does not halt.Level 3: 20% decline at any time of day, trading halts for the remainder of the day.we had a level 1 day during covid March 2020. I thought for sure we would have a level 2 day in April but Trump capitulated on reciprocal tariffs to the 10% level. Still waiting for level 2 to go off, the yen and $vix will spike forcing the algo to react, just not sure what the news will be.we will never be down more than 20% in a day due to the above circuit breakers, like oct 1987. we could have savage week. I think the bear market rally ended May 19, i am looking at 87ish days from May 19 or so for new 52 week low. calm sailing right now, but the nor’easter storm can happen anytime, but more common in April September October.Anthony Acesays:Jun 5, 2025 at 10:41 amAll those black monday people should be fired intensified after market selling and lots of poeple lost money for an even that not only did not happen the market was up the next few days … Any history buffs here? How much stocks need to drop for Monday to be a “Black Monday”? Can circuit breakers delay it to let’s say “Black Thursday”? Should I be worried at all? Anthony A.says:May 30, 2025 at 3:16 pmAndy, just remember, for every seller, there is a buyer, and vice versa! You can be either or both! Andy, just remember, for every seller, there is a buyer, and vice versa! You can be either or both! Eric86says:May 30, 2025 at 3:26 pmNo. Probably not. Unless you just love media headlines. No. Probably not. Unless you just love media headlines. D Diamondsays:May 30, 2025 at 6:22 pmSP 500 Current market-wide circuit breakers are set as follows:Level 1: 7% decline before 3:25 p.m. ET, trading halts for 15 minutes. If it occurs after that time, trading does not halt.Level 2: 13% decline before 3:25 p.m. ET, trading halts for 15 minutes. If it occurs after that time, trading does not halt.Level 3: 20% decline at any time of day, trading halts for the remainder of the day.we had a level 1 day during covid March 2020. I thought for sure we would have a level 2 day in April but Trump capitulated on reciprocal tariffs to the 10% level. Still waiting for level 2 to go off, the yen and $vix will spike forcing the algo to react, just not sure what the news will be.we will never be down more than 20% in a day due to the above circuit breakers, like oct 1987. we could have savage week. I think the bear market rally ended May 19, i am looking at 87ish days from May 19 or so for new 52 week low. calm sailing right now, but the nor’easter storm can happen anytime, but more common in April September October. SP 500 Current market-wide circuit breakers are set as follows: Level 1: 7% decline before 3:25 p.m. ET, trading halts for 15 minutes. If it occurs after that time, trading does not halt.Level 2: 13% decline before 3:25 p.m. ET, trading halts for 15 minutes. If it occurs after that time, trading does not halt.Level 3: 20% decline at any time of day, trading halts for the remainder of the day. we had a level 1 day during covid March 2020. I thought for sure we would have a level 2 day in April but Trump capitulated on reciprocal tariffs to the 10% level. Still waiting for level 2 to go off, the yen and $vix will spike forcing the algo to react, just not sure what the news will be.we will never be down more than 20% in a day due to the above circuit breakers, like oct 1987. we could have savage week. I think the bear market rally ended May 19, i am looking at 87ish days from May 19 or so for new 52 week low. calm sailing right now, but the nor’easter storm can happen anytime, but more common in April September October. Anthony Acesays:Jun 5, 2025 at 10:41 amAll those black monday people should be fired intensified after market selling and lots of poeple lost money for an even that not only did not happen the market was up the next few days … All those black monday people should be fired intensified after market selling and lots of poeple lost money for an even that not only did not happen the market was up the next few days … Any history buffs here? How much stocks need to drop for Monday to be a “Black Monday”? Can circuit breakers delay it to let’s say “Black Thursday”? Should I be worried at all? Anthony A.says:May 30, 2025 at 3:16 pmAndy, just remember, for every seller, there is a buyer, and vice versa! You can be either or both! Andy, just remember, for every seller, there is a buyer, and vice versa! You can be either or both! Andy, just remember, for every seller, there is a buyer, and vice versa! You can be either or both! Eric86says:May 30, 2025 at 3:26 pmNo. Probably not. Unless you just love media headlines. No. Probably not. Unless you just love media headlines. No. Probably not. Unless you just love media headlines. D Diamondsays:May 30, 2025 at 6:22 pmSP 500 Current market-wide circuit breakers are set as follows:Level 1: 7% decline before 3:25 p.m. ET, trading halts for 15 minutes. If it occurs after that time, trading does not halt.Level 2: 13% decline before 3:25 p.m. ET, trading halts for 15 minutes. If it occurs after that time, trading does not halt.Level 3: 20% decline at any time of day, trading halts for the remainder of the day.we had a level 1 day during covid March 2020. I thought for sure we would have a level 2 day in April but Trump capitulated on reciprocal tariffs to the 10% level. Still waiting for level 2 to go off, the yen and $vix will spike forcing the algo to react, just not sure what the news will be.we will never be down more than 20% in a day due to the above circuit breakers, like oct 1987. we could have savage week. I think the bear market rally ended May 19, i am looking at 87ish days from May 19 or so for new 52 week low. calm sailing right now, but the nor’easter storm can happen anytime, but more common in April September October. SP 500 Current market-wide circuit breakers are set as follows: Level 1: 7% decline before 3:25 p.m. ET, trading halts for 15 minutes. If it occurs after that time, trading does not halt.Level 2: 13% decline before 3:25 p.m. ET, trading halts for 15 minutes. If it occurs after that time, trading does not halt.Level 3: 20% decline at any time of day, trading halts for the remainder of the day. we had a level 1 day during covid March 2020. I thought for sure we would have a level 2 day in April but Trump capitulated on reciprocal tariffs to the 10% level. Still waiting for level 2 to go off, the yen and $vix will spike forcing the algo to react, just not sure what the news will be.we will never be down more than 20% in a day due to the above circuit breakers, like oct 1987. we could have savage week. I think the bear market rally ended May 19, i am looking at 87ish days from May 19 or so for new 52 week low. calm sailing right now, but the nor’easter storm can happen anytime, but more common in April September October. SP 500 Current market-wide circuit breakers are set as follows: Level 1: 7% decline before 3:25 p.m. ET, trading halts for 15 minutes. If it occurs after that time, trading does not halt.Level 2: 13% decline before 3:25 p.m. ET, trading halts for 15 minutes. If it occurs after that time, trading does not halt.Level 3: 20% decline at any time of day, trading halts for the remainder of the day. we had a level 1 day during covid March 2020. I thought for sure we would have a level 2 day in April but Trump capitulated on reciprocal tariffs to the 10% level. Still waiting for level 2 to go off, the yen and $vix will spike forcing the algo to react, just not sure what the news will be.we will never be down more than 20% in a day due to the above circuit breakers, like oct 1987. we could have savage week. I think the bear market rally ended May 19, i am looking at 87ish days from May 19 or so for new 52 week low. calm sailing right now, but the nor’easter storm can happen anytime, but more common in April September October. Anthony Acesays:Jun 5, 2025 at 10:41 amAll those black monday people should be fired intensified after market selling and lots of poeple lost money for an even that not only did not happen the market was up the next few days … All those black monday people should be fired intensified after market selling and lots of poeple lost money for an even that not only did not happen the market was up the next few days … All those black monday people should be fired intensified after market selling and lots of poeple lost money for an even that not only did not happen the market was up the next few days … Glensays:May 30, 2025 at 3:15 pmDoubt it will significant but international travel to the US has declined by about 10%. Not nearly the decline that mainstream media would give the impression, but still a lot of money unless US demand offsets it. Might even be some deals to be had.Wolf Richtersays:May 30, 2025 at 5:17 pmThe recreation services PCE price index doesn’t include lodging and airfares. It includes:Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipmentBTW: Memorial Day travel was a record breaker.David Brailsfordsays:May 30, 2025 at 6:11 pmWell sometimes I think you’re cranky and you’re replies. But in this case I had to laugh. You were so nice and kind and you’re repeating yourself over and over and over again. LolWolf Richtersays:May 30, 2025 at 7:17 pmI’ve just not been myself recently. Doc says, “take two Aspirin and call me if it doesn’t blow over in a couple of days.”Harvey Mushmansays:May 31, 2025 at 3:25 pm@Wolf RichterThat reminds of a high school German teacher that I had. He was tough. He would walk up and down the aisles in class and drill us with questions. He would pick on the students randomly and drill them. You had be on your toes because you just knew he was going to pick you. If you screwed up, he would get pissed and move on to the next student. It was high pressure and humiliating if you messed up. Anyways, after two years of German, I had full filled the requirements for college so I was done. But, one of my friends continued on with German class. I saw him the next year and asked facetiously how German class was going. He said,“Oh it’s wonderful!, Mr. Hoffman had a heart attack and now he has to take it easy. No more stress, no more pressure.”I chuckled to my 17 year old self, but thought it was a shame. I really learned the material in his class. But, now he was forced to dial it back.Chase Dsays:May 30, 2025 at 8:16 pmGreat article. Super informative as always. All the news outlets will act surprised when the next numbers come out because no except you gets into the details. We all appreciate your patience :-) Doubt it will significant but international travel to the US has declined by about 10%. Not nearly the decline that mainstream media would give the impression, but still a lot of money unless US demand offsets it. Might even be some deals to be had. Wolf Richtersays:May 30, 2025 at 5:17 pmThe recreation services PCE price index doesn’t include lodging and airfares. It includes:Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipmentBTW: Memorial Day travel was a record breaker.David Brailsfordsays:May 30, 2025 at 6:11 pmWell sometimes I think you’re cranky and you’re replies. But in this case I had to laugh. You were so nice and kind and you’re repeating yourself over and over and over again. LolWolf Richtersays:May 30, 2025 at 7:17 pmI’ve just not been myself recently. Doc says, “take two Aspirin and call me if it doesn’t blow over in a couple of days.”Harvey Mushmansays:May 31, 2025 at 3:25 pm@Wolf RichterThat reminds of a high school German teacher that I had. He was tough. He would walk up and down the aisles in class and drill us with questions. He would pick on the students randomly and drill them. You had be on your toes because you just knew he was going to pick you. If you screwed up, he would get pissed and move on to the next student. It was high pressure and humiliating if you messed up. Anyways, after two years of German, I had full filled the requirements for college so I was done. But, one of my friends continued on with German class. I saw him the next year and asked facetiously how German class was going. He said,“Oh it’s wonderful!, Mr. Hoffman had a heart attack and now he has to take it easy. No more stress, no more pressure.”I chuckled to my 17 year old self, but thought it was a shame. I really learned the material in his class. But, now he was forced to dial it back.Chase Dsays:May 30, 2025 at 8:16 pmGreat article. Super informative as always. All the news outlets will act surprised when the next numbers come out because no except you gets into the details. We all appreciate your patience :-) The recreation services PCE price index doesn’t include lodging and airfares. It includes: Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipment BTW: Memorial Day travel was a record breaker. David Brailsfordsays:May 30, 2025 at 6:11 pmWell sometimes I think you’re cranky and you’re replies. But in this case I had to laugh. You were so nice and kind and you’re repeating yourself over and over and over again. LolWolf Richtersays:May 30, 2025 at 7:17 pmI’ve just not been myself recently. Doc says, “take two Aspirin and call me if it doesn’t blow over in a couple of days.”Harvey Mushmansays:May 31, 2025 at 3:25 pm@Wolf RichterThat reminds of a high school German teacher that I had. He was tough. He would walk up and down the aisles in class and drill us with questions. He would pick on the students randomly and drill them. You had be on your toes because you just knew he was going to pick you. If you screwed up, he would get pissed and move on to the next student. It was high pressure and humiliating if you messed up. Anyways, after two years of German, I had full filled the requirements for college so I was done. But, one of my friends continued on with German class. I saw him the next year and asked facetiously how German class was going. He said,“Oh it’s wonderful!, Mr. Hoffman had a heart attack and now he has to take it easy. No more stress, no more pressure.”I chuckled to my 17 year old self, but thought it was a shame. I really learned the material in his class. But, now he was forced to dial it back. Well sometimes I think you’re cranky and you’re replies. But in this case I had to laugh. You were so nice and kind and you’re repeating yourself over and over and over again. Lol Wolf Richtersays:May 30, 2025 at 7:17 pmI’ve just not been myself recently. Doc says, “take two Aspirin and call me if it doesn’t blow over in a couple of days.” I’ve just not been myself recently. Doc says, “take two Aspirin and call me if it doesn’t blow over in a couple of days.” Harvey Mushmansays:May 31, 2025 at 3:25 pm@Wolf RichterThat reminds of a high school German teacher that I had. He was tough. He would walk up and down the aisles in class and drill us with questions. He would pick on the students randomly and drill them. You had be on your toes because you just knew he was going to pick you. If you screwed up, he would get pissed and move on to the next student. It was high pressure and humiliating if you messed up. Anyways, after two years of German, I had full filled the requirements for college so I was done. But, one of my friends continued on with German class. I saw him the next year and asked facetiously how German class was going. He said,“Oh it’s wonderful!, Mr. Hoffman had a heart attack and now he has to take it easy. No more stress, no more pressure.”I chuckled to my 17 year old self, but thought it was a shame. I really learned the material in his class. But, now he was forced to dial it back. @Wolf RichterThat reminds of a high school German teacher that I had. He was tough. He would walk up and down the aisles in class and drill us with questions. He would pick on the students randomly and drill them. You had be on your toes because you just knew he was going to pick you. If you screwed up, he would get pissed and move on to the next student. It was high pressure and humiliating if you messed up. Anyways, after two years of German, I had full filled the requirements for college so I was done. But, one of my friends continued on with German class. I saw him the next year and asked facetiously how German class was going. He said,“Oh it’s wonderful!, Mr. Hoffman had a heart attack and now he has to take it easy. No more stress, no more pressure.” I chuckled to my 17 year old self, but thought it was a shame. I really learned the material in his class. But, now he was forced to dial it back. Chase Dsays:May 30, 2025 at 8:16 pmGreat article. Super informative as always. All the news outlets will act surprised when the next numbers come out because no except you gets into the details. We all appreciate your patience :-) Great article. Super informative as always. All the news outlets will act surprised when the next numbers come out because no except you gets into the details. We all appreciate your patience :-) Doubt it will significant but international travel to the US has declined by about 10%. Not nearly the decline that mainstream media would give the impression, but still a lot of money unless US demand offsets it. Might even be some deals to be had. Wolf Richtersays:May 30, 2025 at 5:17 pmThe recreation services PCE price index doesn’t include lodging and airfares. It includes:Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipmentBTW: Memorial Day travel was a record breaker.David Brailsfordsays:May 30, 2025 at 6:11 pmWell sometimes I think you’re cranky and you’re replies. But in this case I had to laugh. You were so nice and kind and you’re repeating yourself over and over and over again. LolWolf Richtersays:May 30, 2025 at 7:17 pmI’ve just not been myself recently. Doc says, “take two Aspirin and call me if it doesn’t blow over in a couple of days.”Harvey Mushmansays:May 31, 2025 at 3:25 pm@Wolf RichterThat reminds of a high school German teacher that I had. He was tough. He would walk up and down the aisles in class and drill us with questions. He would pick on the students randomly and drill them. You had be on your toes because you just knew he was going to pick you. If you screwed up, he would get pissed and move on to the next student. It was high pressure and humiliating if you messed up. Anyways, after two years of German, I had full filled the requirements for college so I was done. But, one of my friends continued on with German class. I saw him the next year and asked facetiously how German class was going. He said,“Oh it’s wonderful!, Mr. Hoffman had a heart attack and now he has to take it easy. No more stress, no more pressure.”I chuckled to my 17 year old self, but thought it was a shame. I really learned the material in his class. But, now he was forced to dial it back.Chase Dsays:May 30, 2025 at 8:16 pmGreat article. Super informative as always. All the news outlets will act surprised when the next numbers come out because no except you gets into the details. We all appreciate your patience :-) The recreation services PCE price index doesn’t include lodging and airfares. It includes: Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipment BTW: Memorial Day travel was a record breaker. David Brailsfordsays:May 30, 2025 at 6:11 pmWell sometimes I think you’re cranky and you’re replies. But in this case I had to laugh. You were so nice and kind and you’re repeating yourself over and over and over again. LolWolf Richtersays:May 30, 2025 at 7:17 pmI’ve just not been myself recently. Doc says, “take two Aspirin and call me if it doesn’t blow over in a couple of days.”Harvey Mushmansays:May 31, 2025 at 3:25 pm@Wolf RichterThat reminds of a high school German teacher that I had. He was tough. He would walk up and down the aisles in class and drill us with questions. He would pick on the students randomly and drill them. You had be on your toes because you just knew he was going to pick you. If you screwed up, he would get pissed and move on to the next student. It was high pressure and humiliating if you messed up. Anyways, after two years of German, I had full filled the requirements for college so I was done. But, one of my friends continued on with German class. I saw him the next year and asked facetiously how German class was going. He said,“Oh it’s wonderful!, Mr. Hoffman had a heart attack and now he has to take it easy. No more stress, no more pressure.”I chuckled to my 17 year old self, but thought it was a shame. I really learned the material in his class. But, now he was forced to dial it back. Well sometimes I think you’re cranky and you’re replies. But in this case I had to laugh. You were so nice and kind and you’re repeating yourself over and over and over again. Lol Wolf Richtersays:May 30, 2025 at 7:17 pmI’ve just not been myself recently. Doc says, “take two Aspirin and call me if it doesn’t blow over in a couple of days.” I’ve just not been myself recently. Doc says, “take two Aspirin and call me if it doesn’t blow over in a couple of days.” Harvey Mushmansays:May 31, 2025 at 3:25 pm@Wolf RichterThat reminds of a high school German teacher that I had. He was tough. He would walk up and down the aisles in class and drill us with questions. He would pick on the students randomly and drill them. You had be on your toes because you just knew he was going to pick you. If you screwed up, he would get pissed and move on to the next student. It was high pressure and humiliating if you messed up. Anyways, after two years of German, I had full filled the requirements for college so I was done. But, one of my friends continued on with German class. I saw him the next year and asked facetiously how German class was going. He said,“Oh it’s wonderful!, Mr. Hoffman had a heart attack and now he has to take it easy. No more stress, no more pressure.”I chuckled to my 17 year old self, but thought it was a shame. I really learned the material in his class. But, now he was forced to dial it back. @Wolf RichterThat reminds of a high school German teacher that I had. He was tough. He would walk up and down the aisles in class and drill us with questions. He would pick on the students randomly and drill them. You had be on your toes because you just knew he was going to pick you. If you screwed up, he would get pissed and move on to the next student. It was high pressure and humiliating if you messed up. Anyways, after two years of German, I had full filled the requirements for college so I was done. But, one of my friends continued on with German class. I saw him the next year and asked facetiously how German class was going. He said,“Oh it’s wonderful!, Mr. Hoffman had a heart attack and now he has to take it easy. No more stress, no more pressure.” I chuckled to my 17 year old self, but thought it was a shame. I really learned the material in his class. But, now he was forced to dial it back. Chase Dsays:May 30, 2025 at 8:16 pmGreat article. Super informative as always. All the news outlets will act surprised when the next numbers come out because no except you gets into the details. We all appreciate your patience :-) Great article. Super informative as always. All the news outlets will act surprised when the next numbers come out because no except you gets into the details. We all appreciate your patience :-) The recreation services PCE price index doesn’t include lodging and airfares. It includes: Cable and satellite services, broadband, amusement parks, campgrounds, concerts, spectator sports, movies, theaters, gambling, video streaming, vet services, package tours, memberships, clubs, participant sports centers, museums, maintenance and repair of recreational and sports equipment BTW: Memorial Day travel was a record breaker. David Brailsfordsays:May 30, 2025 at 6:11 pmWell sometimes I think you’re cranky and you’re replies. But in this case I had to laugh. You were so nice and kind and you’re repeating yourself over and over and over again. LolWolf Richtersays:May 30, 2025 at 7:17 pmI’ve just not been myself recently. Doc says, “take two Aspirin and call me if it doesn’t blow over in a couple of days.”Harvey Mushmansays:May 31, 2025 at 3:25 pm@Wolf RichterThat reminds of a high school German teacher that I had. He was tough. He would walk up and down the aisles in class and drill us with questions. He would pick on the students randomly and drill them. You had be on your toes because you just knew he was going to pick you. If you screwed up, he would get pissed and move on to the next student. It was high pressure and humiliating if you messed up. Anyways, after two years of German, I had full filled the requirements for college so I was done. But, one of my friends continued on with German class. I saw him the next year and asked facetiously how German class was going. He said,“Oh it’s wonderful!, Mr. Hoffman had a heart attack and now he has to take it easy. No more stress, no more pressure.”I chuckled to my 17 year old self, but thought it was a shame. I really learned the material in his class. But, now he was forced to dial it back. Well sometimes I think you’re cranky and you’re replies. But in this case I had to laugh. You were so nice and kind and you’re repeating yourself over and over and over again. Lol Wolf Richtersays:May 30, 2025 at 7:17 pmI’ve just not been myself recently. Doc says, “take two Aspirin and call me if it doesn’t blow over in a couple of days.” I’ve just not been myself recently. Doc says, “take two Aspirin and call me if it doesn’t blow over in a couple of days.” Harvey Mushmansays:May 31, 2025 at 3:25 pm@Wolf RichterThat reminds of a high school German teacher that I had. He was tough. He would walk up and down the aisles in class and drill us with questions. He would pick on the students randomly and drill them. You had be on your toes because you just knew he was going to pick you. If you screwed up, he would get pissed and move on to the next student. It was high pressure and humiliating if you messed up. Anyways, after two years of German, I had full filled the requirements for college so I was done. But, one of my friends continued on with German class. I saw him the next year and asked facetiously how German class was going. He said,“Oh it’s wonderful!, Mr. Hoffman had a heart attack and now he has to take it easy. No more stress, no more pressure.”I chuckled to my 17 year old self, but thought it was a shame. I really learned the material in his class. But, now he was forced to dial it back. @Wolf RichterThat reminds of a high school German teacher that I had. He was tough. He would walk up and down the aisles in class and drill us with questions. He would pick on the students randomly and drill them. You had be on your toes because you just knew he was going to pick you. If you screwed up, he would get pissed and move on to the next student. It was high pressure and humiliating if you messed up. Anyways, after two years of German, I had full filled the requirements for college so I was done. But, one of my friends continued on with German class. I saw him the next year and asked facetiously how German class was going. He said,“Oh it’s wonderful!, Mr. Hoffman had a heart attack and now he has to take it easy. No more stress, no more pressure.” I chuckled to my 17 year old self, but thought it was a shame. I really learned the material in his class. But, now he was forced to dial it back. Well sometimes I think you’re cranky and you’re replies. But in this case I had to laugh. You were so nice and kind and you’re repeating yourself over and over and over again. Lol Wolf Richtersays:May 30, 2025 at 7:17 pmI’ve just not been myself recently. Doc says, “take two Aspirin and call me if it doesn’t blow over in a couple of days.” I’ve just not been myself recently. Doc says, “take two Aspirin and call me if it doesn’t blow over in a couple of days.” I’ve just not been myself recently. Doc says, “take two Aspirin and call me if it doesn’t blow over in a couple of days.” Harvey Mushmansays:May 31, 2025 at 3:25 pm@Wolf RichterThat reminds of a high school German teacher that I had. He was tough. He would walk up and down the aisles in class and drill us with questions. He would pick on the students randomly and drill them. You had be on your toes because you just knew he was going to pick you. If you screwed up, he would get pissed and move on to the next student. It was high pressure and humiliating if you messed up. Anyways, after two years of German, I had full filled the requirements for college so I was done. But, one of my friends continued on with German class. I saw him the next year and asked facetiously how German class was going. He said,“Oh it’s wonderful!, Mr. Hoffman had a heart attack and now he has to take it easy. No more stress, no more pressure.”I chuckled to my 17 year old self, but thought it was a shame. I really learned the material in his class. But, now he was forced to dial it back. @Wolf RichterThat reminds of a high school German teacher that I had. He was tough. He would walk up and down the aisles in class and drill us with questions. He would pick on the students randomly and drill them. You had be on your toes because you just knew he was going to pick you. If you screwed up, he would get pissed and move on to the next student. It was high pressure and humiliating if you messed up. Anyways, after two years of German, I had full filled the requirements for college so I was done. But, one of my friends continued on with German class. I saw him the next year and asked facetiously how German class was going. He said,“Oh it’s wonderful!, Mr. Hoffman had a heart attack and now he has to take it easy. No more stress, no more pressure.” I chuckled to my 17 year old self, but thought it was a shame. I really learned the material in his class. But, now he was forced to dial it back. @Wolf RichterThat reminds of a high school German teacher that I had. He was tough. He would walk up and down the aisles in class and drill us with questions. He would pick on the students randomly and drill them. You had be on your toes because you just knew he was going to pick you. If you screwed up, he would get pissed and move on to the next student. It was high pressure and humiliating if you messed up. Anyways, after two years of German, I had full filled the requirements for college so I was done. But, one of my friends continued on with German class. I saw him the next year and asked facetiously how German class was going. He said,“Oh it’s wonderful!, Mr. Hoffman had a heart attack and now he has to take it easy. No more stress, no more pressure.” I chuckled to my 17 year old self, but thought it was a shame. I really learned the material in his class. But, now he was forced to dial it back. Chase Dsays:May 30, 2025 at 8:16 pmGreat article. Super informative as always. All the news outlets will act surprised when the next numbers come out because no except you gets into the details. We all appreciate your patience :-) Great article. Super informative as always. All the news outlets will act surprised when the next numbers come out because no except you gets into the details. We all appreciate your patience :-) Great article. Super informative as always. All the news outlets will act surprised when the next numbers come out because no except you gets into the details. We all appreciate your patience :-) D Diamondsays:May 30, 2025 at 3:32 pmI think the market missed this today: Personal income was up .8% in April, that’s huge followed by .6% Jan, .7% feb and .5% in March. labor inflation is raging; the Inflation pump is primed. High personal income growth during full employment eventually creates higher inflation added to higher medical insurance its not good for small to middle market businesses. Prices have to rise unless profits are taking the hit or productivity is rising at equal rates. official Productivity has been on ripper for a long its due for revision to mean, To be honest i have little experience with seeing increase productivity. Our business health insurance went up 30% YOY. Sad! I think the market missed this today: Personal income was up .8% in April, that’s huge followed by .6% Jan, .7% feb and .5% in March. labor inflation is raging; the Inflation pump is primed. High personal income growth during full employment eventually creates higher inflation added to higher medical insurance its not good for small to middle market businesses. Prices have to rise unless profits are taking the hit or productivity is rising at equal rates. official Productivity has been on ripper for a long its due for revision to mean, To be honest i have little experience with seeing increase productivity. Our business health insurance went up 30% YOY. Sad! I think the market missed this today: Personal income was up .8% in April, that’s huge followed by .6% Jan, .7% feb and .5% in March. labor inflation is raging; the Inflation pump is primed. High personal income growth during full employment eventually creates higher inflation added to higher medical insurance its not good for small to middle market businesses. Prices have to rise unless profits are taking the hit or productivity is rising at equal rates. official Productivity has been on ripper for a long its due for revision to mean, To be honest i have little experience with seeing increase productivity. Our business health insurance went up 30% YOY. Sad! Eric86says:May 30, 2025 at 3:34 pmI was waiting for this article and hoping for good news lol. Oh well, thanks wolf I was waiting for this article and hoping for good news lol. Oh well, thanks wolf I was waiting for this article and hoping for good news lol. Oh well, thanks wolf Xavier Caveatsays:May 30, 2025 at 4:43 pmInsurance: +3.3%Ha ha, ha!Reality begs to differ.Wolf Richtersays:May 30, 2025 at 5:34 pmTo make sure you understand: that figure you cited is month-to-month annualized.My auto insurance premium actually declined for this year. They jacked it up in 2022-2024. But now they lowered it some again. So that’s negative inflation. People never pay attention to falling prices. They forget them and tune them out. But when prices rise, they see it.TSonder305says:May 30, 2025 at 6:21 pmMine too, and I had a claim. Just a broken windshield claim, but a claim nonetheless.Acesays:May 31, 2025 at 4:15 pmMy auto insurance is lower too, but only because I took the defensive driving course which lowers my premium by ten percent for three years. I highly recommend it. It costs 30 bucks, you spend five hours watching videos online, and you save a lot of money. I don’t know why anyone would NOT do it. I think it should be mandatory. Too many people drive like lunatics. If everyone was required to take the defensive driving course, there would be a lot fewer accidents, lives would be saved, and insurance would probably be cheaper.Davidsays:Jun 1, 2025 at 7:53 amMy car insurance declined. As did my Florida home insurance. My California home insurance increased by over 30% though.No claims. Insurance: +3.3% Ha ha, ha! Reality begs to differ. Wolf Richtersays:May 30, 2025 at 5:34 pmTo make sure you understand: that figure you cited is month-to-month annualized.My auto insurance premium actually declined for this year. They jacked it up in 2022-2024. But now they lowered it some again. So that’s negative inflation. People never pay attention to falling prices. They forget them and tune them out. But when prices rise, they see it.TSonder305says:May 30, 2025 at 6:21 pmMine too, and I had a claim. Just a broken windshield claim, but a claim nonetheless.Acesays:May 31, 2025 at 4:15 pmMy auto insurance is lower too, but only because I took the defensive driving course which lowers my premium by ten percent for three years. I highly recommend it. It costs 30 bucks, you spend five hours watching videos online, and you save a lot of money. I don’t know why anyone would NOT do it. I think it should be mandatory. Too many people drive like lunatics. If everyone was required to take the defensive driving course, there would be a lot fewer accidents, lives would be saved, and insurance would probably be cheaper. To make sure you understand: that figure you cited is month-to-month annualized. My auto insurance premium actually declined for this year. They jacked it up in 2022-2024. But now they lowered it some again. So that’s negative inflation. People never pay attention to falling prices. They forget them and tune them out. But when prices rise, they see it. TSonder305says:May 30, 2025 at 6:21 pmMine too, and I had a claim. Just a broken windshield claim, but a claim nonetheless. Mine too, and I had a claim. Just a broken windshield claim, but a claim nonetheless. Acesays:May 31, 2025 at 4:15 pmMy auto insurance is lower too, but only because I took the defensive driving course which lowers my premium by ten percent for three years. I highly recommend it. It costs 30 bucks, you spend five hours watching videos online, and you save a lot of money. I don’t know why anyone would NOT do it. I think it should be mandatory. Too many people drive like lunatics. If everyone was required to take the defensive driving course, there would be a lot fewer accidents, lives would be saved, and insurance would probably be cheaper. My auto insurance is lower too, but only because I took the defensive driving course which lowers my premium by ten percent for three years. I highly recommend it. It costs 30 bucks, you spend five hours watching videos online, and you save a lot of money. I don’t know why anyone would NOT do it. I think it should be mandatory. Too many people drive like lunatics. If everyone was required to take the defensive driving course, there would be a lot fewer accidents, lives would be saved, and insurance would probably be cheaper. Davidsays:Jun 1, 2025 at 7:53 amMy car insurance declined. As did my Florida home insurance. My California home insurance increased by over 30% though.No claims. My car insurance declined. As did my Florida home insurance. My California home insurance increased by over 30% though.No claims. Insurance: +3.3% Ha ha, ha! Reality begs to differ. Wolf Richtersays:May 30, 2025 at 5:34 pmTo make sure you understand: that figure you cited is month-to-month annualized.My auto insurance premium actually declined for this year. They jacked it up in 2022-2024. But now they lowered it some again. So that’s negative inflation. People never pay attention to falling prices. They forget them and tune them out. But when prices rise, they see it.TSonder305says:May 30, 2025 at 6:21 pmMine too, and I had a claim. Just a broken windshield claim, but a claim nonetheless.Acesays:May 31, 2025 at 4:15 pmMy auto insurance is lower too, but only because I took the defensive driving course which lowers my premium by ten percent for three years. I highly recommend it. It costs 30 bucks, you spend five hours watching videos online, and you save a lot of money. I don’t know why anyone would NOT do it. I think it should be mandatory. Too many people drive like lunatics. If everyone was required to take the defensive driving course, there would be a lot fewer accidents, lives would be saved, and insurance would probably be cheaper. To make sure you understand: that figure you cited is month-to-month annualized. My auto insurance premium actually declined for this year. They jacked it up in 2022-2024. But now they lowered it some again. So that’s negative inflation. People never pay attention to falling prices. They forget them and tune them out. But when prices rise, they see it. TSonder305says:May 30, 2025 at 6:21 pmMine too, and I had a claim. Just a broken windshield claim, but a claim nonetheless. Mine too, and I had a claim. Just a broken windshield claim, but a claim nonetheless. Acesays:May 31, 2025 at 4:15 pmMy auto insurance is lower too, but only because I took the defensive driving course which lowers my premium by ten percent for three years. I highly recommend it. It costs 30 bucks, you spend five hours watching videos online, and you save a lot of money. I don’t know why anyone would NOT do it. I think it should be mandatory. Too many people drive like lunatics. If everyone was required to take the defensive driving course, there would be a lot fewer accidents, lives would be saved, and insurance would probably be cheaper. My auto insurance is lower too, but only because I took the defensive driving course which lowers my premium by ten percent for three years. I highly recommend it. It costs 30 bucks, you spend five hours watching videos online, and you save a lot of money. I don’t know why anyone would NOT do it. I think it should be mandatory. Too many people drive like lunatics. If everyone was required to take the defensive driving course, there would be a lot fewer accidents, lives would be saved, and insurance would probably be cheaper. To make sure you understand: that figure you cited is month-to-month annualized. My auto insurance premium actually declined for this year. They jacked it up in 2022-2024. But now they lowered it some again. So that’s negative inflation. People never pay attention to falling prices. They forget them and tune them out. But when prices rise, they see it. TSonder305says:May 30, 2025 at 6:21 pmMine too, and I had a claim. Just a broken windshield claim, but a claim nonetheless. Mine too, and I had a claim. Just a broken windshield claim, but a claim nonetheless. Mine too, and I had a claim. Just a broken windshield claim, but a claim nonetheless. Acesays:May 31, 2025 at 4:15 pmMy auto insurance is lower too, but only because I took the defensive driving course which lowers my premium by ten percent for three years. I highly recommend it. It costs 30 bucks, you spend five hours watching videos online, and you save a lot of money. I don’t know why anyone would NOT do it. I think it should be mandatory. Too many people drive like lunatics. If everyone was required to take the defensive driving course, there would be a lot fewer accidents, lives would be saved, and insurance would probably be cheaper. My auto insurance is lower too, but only because I took the defensive driving course which lowers my premium by ten percent for three years. I highly recommend it. It costs 30 bucks, you spend five hours watching videos online, and you save a lot of money. I don’t know why anyone would NOT do it. I think it should be mandatory. Too many people drive like lunatics. If everyone was required to take the defensive driving course, there would be a lot fewer accidents, lives would be saved, and insurance would probably be cheaper. My auto insurance is lower too, but only because I took the defensive driving course which lowers my premium by ten percent for three years. I highly recommend it. It costs 30 bucks, you spend five hours watching videos online, and you save a lot of money. I don’t know why anyone would NOT do it. I think it should be mandatory. Too many people drive like lunatics. If everyone was required to take the defensive driving course, there would be a lot fewer accidents, lives would be saved, and insurance would probably be cheaper. Davidsays:Jun 1, 2025 at 7:53 amMy car insurance declined. As did my Florida home insurance. My California home insurance increased by over 30% though.No claims. My car insurance declined. As did my Florida home insurance. My California home insurance increased by over 30% though.No claims. My car insurance declined. As did my Florida home insurance. My California home insurance increased by over 30% though.No claims. TSonder305says:May 30, 2025 at 6:42 pmThe Fed’s balance sheet dropped by $40 billion in the last two weeks, and since only $5 billion a month in treasuries are running off, I’m wondering if there was a flurry of selling of real estate and paying down mortgages. Anyone know how to find the breakdown? I can’t find it on the St. Louis site.Wolf Richtersays:May 30, 2025 at 7:30 pmThe Fed has not yet started selling any MBS. A couple of Fed governors have talked about it, but there was no mention in the minutes this time. So we’ll still have to wait for it. There may be too much pressure from Bessent and Trump on the Fed for them to start planning this seriously.Here is April, and I’ll report on May next Thursday evening:https://wolfstreet.com/2025/05/01/fed-balance-sheet-qt-14-billion-in-april-2-26-trillion-from-peak-to-6-71-trillion-lowest-since-april-2020/About $15 billion in MBS run off every month. So with $5 billion a month in Treasuries (new pace that started in April), that works about to be about $20 billion a month, in theory. But there is other stuff that happens that increases or decreases those amounts, and when they get larger, I usually discuss them in my balance sheet articles.In April, $14 billion in total rolled off. And the other stuff that had reduced that amount from $20 billion was:Discount Window borrowing increased by $1.3 billion, which increased the balance sheet by $1.3 billion.“Other assets” increased by $5 billion, mostly of accrued interest from its bond holdings that the Fed set up as a receivable (an asset) in April. When it receives that interest payment in May, the Fed destroys that money and it comes off the balance sheet, and the account declines by that amount.TSonder305says:May 30, 2025 at 10:14 pmThank you! Regardless of the breakdown, I’m glad to see it. We’re back to April 2020, which seems like a lifetime ago now.SRKsays:May 30, 2025 at 11:33 pmWolf,“There may be too much pressure from Bessent and Trump on the Fed for them to start planning this seriously.”I am guessing FED can sell those MBS at losses as those losses wont matter to FED. But if FED starts selling MBS, it will put pressure on long term yields. It will further reduce demand for Treasury securities. Only higher yields can solve that demand problem. So if Treasury wants to sell more bonds, they have to pay higher rates. So this will be again put pressure on Debt levels which is Trump and Bessent trying to avoid.Is this correct understanding?Wolf Richtersays:May 30, 2025 at 11:51 pmYup. The Fed’s balance sheet dropped by $40 billion in the last two weeks, and since only $5 billion a month in treasuries are running off, I’m wondering if there was a flurry of selling of real estate and paying down mortgages. Anyone know how to find the breakdown? I can’t find it on the St. Louis site. Wolf Richtersays:May 30, 2025 at 7:30 pmThe Fed has not yet started selling any MBS. A couple of Fed governors have talked about it, but there was no mention in the minutes this time. So we’ll still have to wait for it. There may be too much pressure from Bessent and Trump on the Fed for them to start planning this seriously.Here is April, and I’ll report on May next Thursday evening:https://wolfstreet.com/2025/05/01/fed-balance-sheet-qt-14-billion-in-april-2-26-trillion-from-peak-to-6-71-trillion-lowest-since-april-2020/About $15 billion in MBS run off every month. So with $5 billion a month in Treasuries (new pace that started in April), that works about to be about $20 billion a month, in theory. But there is other stuff that happens that increases or decreases those amounts, and when they get larger, I usually discuss them in my balance sheet articles.In April, $14 billion in total rolled off. And the other stuff that had reduced that amount from $20 billion was:Discount Window borrowing increased by $1.3 billion, which increased the balance sheet by $1.3 billion.“Other assets” increased by $5 billion, mostly of accrued interest from its bond holdings that the Fed set up as a receivable (an asset) in April. When it receives that interest payment in May, the Fed destroys that money and it comes off the balance sheet, and the account declines by that amount.TSonder305says:May 30, 2025 at 10:14 pmThank you! Regardless of the breakdown, I’m glad to see it. We’re back to April 2020, which seems like a lifetime ago now.SRKsays:May 30, 2025 at 11:33 pmWolf,“There may be too much pressure from Bessent and Trump on the Fed for them to start planning this seriously.”I am guessing FED can sell those MBS at losses as those losses wont matter to FED. But if FED starts selling MBS, it will put pressure on long term yields. It will further reduce demand for Treasury securities. Only higher yields can solve that demand problem. So if Treasury wants to sell more bonds, they have to pay higher rates. So this will be again put pressure on Debt levels which is Trump and Bessent trying to avoid.Is this correct understanding?Wolf Richtersays:May 30, 2025 at 11:51 pmYup. The Fed has not yet started selling any MBS. A couple of Fed governors have talked about it, but there was no mention in the minutes this time. So we’ll still have to wait for it. There may be too much pressure from Bessent and Trump on the Fed for them to start planning this seriously. Here is April, and I’ll report on May next Thursday evening: https://wolfstreet.com/2025/05/01/fed-balance-sheet-qt-14-billion-in-april-2-26-trillion-from-peak-to-6-71-trillion-lowest-since-april-2020/ About $15 billion in MBS run off every month. So with $5 billion a month in Treasuries (new pace that started in April), that works about to be about $20 billion a month, in theory. But there is other stuff that happens that increases or decreases those amounts, and when they get larger, I usually discuss them in my balance sheet articles. In April, $14 billion in total rolled off. And the other stuff that had reduced that amount from $20 billion was: Discount Window borrowing increased by $1.3 billion, which increased the balance sheet by $1.3 billion. “Other assets” increased by $5 billion, mostly of accrued interest from its bond holdings that the Fed set up as a receivable (an asset) in April. When it receives that interest payment in May, the Fed destroys that money and it comes off the balance sheet, and the account declines by that amount. TSonder305says:May 30, 2025 at 10:14 pmThank you! Regardless of the breakdown, I’m glad to see it. We’re back to April 2020, which seems like a lifetime ago now. Thank you! Regardless of the breakdown, I’m glad to see it. We’re back to April 2020, which seems like a lifetime ago now. SRKsays:May 30, 2025 at 11:33 pmWolf,“There may be too much pressure from Bessent and Trump on the Fed for them to start planning this seriously.”I am guessing FED can sell those MBS at losses as those losses wont matter to FED. But if FED starts selling MBS, it will put pressure on long term yields. It will further reduce demand for Treasury securities. Only higher yields can solve that demand problem. So if Treasury wants to sell more bonds, they have to pay higher rates. So this will be again put pressure on Debt levels which is Trump and Bessent trying to avoid.Is this correct understanding?Wolf Richtersays:May 30, 2025 at 11:51 pmYup. Wolf,“There may be too much pressure from Bessent and Trump on the Fed for them to start planning this seriously.” I am guessing FED can sell those MBS at losses as those losses wont matter to FED. But if FED starts selling MBS, it will put pressure on long term yields. It will further reduce demand for Treasury securities. Only higher yields can solve that demand problem. So if Treasury wants to sell more bonds, they have to pay higher rates. So this will be again put pressure on Debt levels which is Trump and Bessent trying to avoid. Is this correct understanding? Wolf Richtersays:May 30, 2025 at 11:51 pmYup. Yup. The Fed’s balance sheet dropped by $40 billion in the last two weeks, and since only $5 billion a month in treasuries are running off, I’m wondering if there was a flurry of selling of real estate and paying down mortgages. Anyone know how to find the breakdown? I can’t find it on the St. Louis site. Wolf Richtersays:May 30, 2025 at 7:30 pmThe Fed has not yet started selling any MBS. A couple of Fed governors have talked about it, but there was no mention in the minutes this time. So we’ll still have to wait for it. There may be too much pressure from Bessent and Trump on the Fed for them to start planning this seriously.Here is April, and I’ll report on May next Thursday evening:https://wolfstreet.com/2025/05/01/fed-balance-sheet-qt-14-billion-in-april-2-26-trillion-from-peak-to-6-71-trillion-lowest-since-april-2020/About $15 billion in MBS run off every month. So with $5 billion a month in Treasuries (new pace that started in April), that works about to be about $20 billion a month, in theory. But there is other stuff that happens that increases or decreases those amounts, and when they get larger, I usually discuss them in my balance sheet articles.In April, $14 billion in total rolled off. And the other stuff that had reduced that amount from $20 billion was:Discount Window borrowing increased by $1.3 billion, which increased the balance sheet by $1.3 billion.“Other assets” increased by $5 billion, mostly of accrued interest from its bond holdings that the Fed set up as a receivable (an asset) in April. When it receives that interest payment in May, the Fed destroys that money and it comes off the balance sheet, and the account declines by that amount.TSonder305says:May 30, 2025 at 10:14 pmThank you! Regardless of the breakdown, I’m glad to see it. We’re back to April 2020, which seems like a lifetime ago now.SRKsays:May 30, 2025 at 11:33 pmWolf,“There may be too much pressure from Bessent and Trump on the Fed for them to start planning this seriously.”I am guessing FED can sell those MBS at losses as those losses wont matter to FED. But if FED starts selling MBS, it will put pressure on long term yields. It will further reduce demand for Treasury securities. Only higher yields can solve that demand problem. So if Treasury wants to sell more bonds, they have to pay higher rates. So this will be again put pressure on Debt levels which is Trump and Bessent trying to avoid.Is this correct understanding?Wolf Richtersays:May 30, 2025 at 11:51 pmYup. The Fed has not yet started selling any MBS. A couple of Fed governors have talked about it, but there was no mention in the minutes this time. So we’ll still have to wait for it. There may be too much pressure from Bessent and Trump on the Fed for them to start planning this seriously. Here is April, and I’ll report on May next Thursday evening: https://wolfstreet.com/2025/05/01/fed-balance-sheet-qt-14-billion-in-april-2-26-trillion-from-peak-to-6-71-trillion-lowest-since-april-2020/ About $15 billion in MBS run off every month. So with $5 billion a month in Treasuries (new pace that started in April), that works about to be about $20 billion a month, in theory. But there is other stuff that happens that increases or decreases those amounts, and when they get larger, I usually discuss them in my balance sheet articles. In April, $14 billion in total rolled off. And the other stuff that had reduced that amount from $20 billion was: Discount Window borrowing increased by $1.3 billion, which increased the balance sheet by $1.3 billion. “Other assets” increased by $5 billion, mostly of accrued interest from its bond holdings that the Fed set up as a receivable (an asset) in April. When it receives that interest payment in May, the Fed destroys that money and it comes off the balance sheet, and the account declines by that amount. TSonder305says:May 30, 2025 at 10:14 pmThank you! Regardless of the breakdown, I’m glad to see it. We’re back to April 2020, which seems like a lifetime ago now. Thank you! Regardless of the breakdown, I’m glad to see it. We’re back to April 2020, which seems like a lifetime ago now. SRKsays:May 30, 2025 at 11:33 pmWolf,“There may be too much pressure from Bessent and Trump on the Fed for them to start planning this seriously.”I am guessing FED can sell those MBS at losses as those losses wont matter to FED. But if FED starts selling MBS, it will put pressure on long term yields. It will further reduce demand for Treasury securities. Only higher yields can solve that demand problem. So if Treasury wants to sell more bonds, they have to pay higher rates. So this will be again put pressure on Debt levels which is Trump and Bessent trying to avoid.Is this correct understanding?Wolf Richtersays:May 30, 2025 at 11:51 pmYup. Wolf,“There may be too much pressure from Bessent and Trump on the Fed for them to start planning this seriously.” I am guessing FED can sell those MBS at losses as those losses wont matter to FED. But if FED starts selling MBS, it will put pressure on long term yields. It will further reduce demand for Treasury securities. Only higher yields can solve that demand problem. So if Treasury wants to sell more bonds, they have to pay higher rates. So this will be again put pressure on Debt levels which is Trump and Bessent trying to avoid. Is this correct understanding? Wolf Richtersays:May 30, 2025 at 11:51 pmYup. Yup. The Fed has not yet started selling any MBS. A couple of Fed governors have talked about it, but there was no mention in the minutes this time. So we’ll still have to wait for it. There may be too much pressure from Bessent and Trump on the Fed for them to start planning this seriously. Here is April, and I’ll report on May next Thursday evening: https://wolfstreet.com/2025/05/01/fed-balance-sheet-qt-14-billion-in-april-2-26-trillion-from-peak-to-6-71-trillion-lowest-since-april-2020/ About $15 billion in MBS run off every month. So with $5 billion a month in Treasuries (new pace that started in April), that works about to be about $20 billion a month, in theory. But there is other stuff that happens that increases or decreases those amounts, and when they get larger, I usually discuss them in my balance sheet articles. In April, $14 billion in total rolled off. And the other stuff that had reduced that amount from $20 billion was: Discount Window borrowing increased by $1.3 billion, which increased the balance sheet by $1.3 billion. “Other assets” increased by $5 billion, mostly of accrued interest from its bond holdings that the Fed set up as a receivable (an asset) in April. When it receives that interest payment in May, the Fed destroys that money and it comes off the balance sheet, and the account declines by that amount. TSonder305says:May 30, 2025 at 10:14 pmThank you! Regardless of the breakdown, I’m glad to see it. We’re back to April 2020, which seems like a lifetime ago now. Thank you! Regardless of the breakdown, I’m glad to see it. We’re back to April 2020, which seems like a lifetime ago now. Thank you! Regardless of the breakdown, I’m glad to see it. We’re back to April 2020, which seems like a lifetime ago now. SRKsays:May 30, 2025 at 11:33 pmWolf,“There may be too much pressure from Bessent and Trump on the Fed for them to start planning this seriously.”I am guessing FED can sell those MBS at losses as those losses wont matter to FED. But if FED starts selling MBS, it will put pressure on long term yields. It will further reduce demand for Treasury securities. Only higher yields can solve that demand problem. So if Treasury wants to sell more bonds, they have to pay higher rates. So this will be again put pressure on Debt levels which is Trump and Bessent trying to avoid.Is this correct understanding?Wolf Richtersays:May 30, 2025 at 11:51 pmYup. Wolf,“There may be too much pressure from Bessent and Trump on the Fed for them to start planning this seriously.” I am guessing FED can sell those MBS at losses as those losses wont matter to FED. But if FED starts selling MBS, it will put pressure on long term yields. It will further reduce demand for Treasury securities. Only higher yields can solve that demand problem. So if Treasury wants to sell more bonds, they have to pay higher rates. So this will be again put pressure on Debt levels which is Trump and Bessent trying to avoid. Is this correct understanding? Wolf Richtersays:May 30, 2025 at 11:51 pmYup. Yup. Wolf,“There may be too much pressure from Bessent and Trump on the Fed for them to start planning this seriously.” I am guessing FED can sell those MBS at losses as those losses wont matter to FED. But if FED starts selling MBS, it will put pressure on long term yields. It will further reduce demand for Treasury securities. Only higher yields can solve that demand problem. So if Treasury wants to sell more bonds, they have to pay higher rates. So this will be again put pressure on Debt levels which is Trump and Bessent trying to avoid. Is this correct understanding? Wolf Richtersays:May 30, 2025 at 11:51 pmYup. Yup. Yup. dishonestsays:May 30, 2025 at 6:48 pmAny data that give Jerome an excuse to cut rates are not benign. Any data that give Jerome an excuse to cut rates are not benign. Any data that give Jerome an excuse to cut rates are not benign. SoCalBeachDudesays:May 30, 2025 at 7:18 pmDM: America’s top banker Jamie Dimon issues chilling warning about the country’s ‘enemy within’JPMorgan Chase CEO Jamie Dimon has sounded the alarm about the ‘enemy within’ America, which he warned is a bigger threat than China.Dimon claims that the United States is suffering from a worrying government ‘mismanagement’ issue which has the potential to ‘kill us’.‘China is a potential adversary. They’re doing a lot of things well, they have a lot of problems,’ he said at the Reagan National Economic Forum on Friday.‘But what I really worry about is us. Can we get our own act together – our own values, our own capability, our own management?’Dimon, the boss of America’s biggest bank, cautioned that the ‘mismanagement’ that occurs at all levels of government could be the biggest catalyst for the nation’s economic demise.‘The amount of mismanagement is extraordinary – by state, by city, for pensions, and that stuff is going to kill us,’ the billionaire banker told the forum.Dimon sounded the alarm on a ‘crack’ appearing in the bond market as a result of the wildly soaring national debt – which Trump is set to compound with the $3 trillion Big Beautiful Bill awaiting Senate approval.A ‘crack’ in the bond market occurs when investors lose confidence in the government’s ability to service its debt. Bonds are sold, yields go higher and the cost of borrowing increases for all Americans, including the government itself.‘You are going to see a crack in the bond market. It is going to happen,’ Dimon told the economic forum, predicting it could appear in six months to six years.Waionosays:May 31, 2025 at 1:15 pmLMAO!Jamie sounding an alarm is like Clinton or Trump telling your 14 year old kid how to live a moral life.Anthony Acesays:Jun 5, 2025 at 10:44 amThis is all this guy does while CA burns you should focus on local issues mate your state is in huge trouble and SoCal and I have a house there so I know first hand the decline the last 10 years … DM: America’s top banker Jamie Dimon issues chilling warning about the country’s ‘enemy within’ JPMorgan Chase CEO Jamie Dimon has sounded the alarm about the ‘enemy within’ America, which he warned is a bigger threat than China. Dimon claims that the United States is suffering from a worrying government ‘mismanagement’ issue which has the potential to ‘kill us’. ‘China is a potential adversary. They’re doing a lot of things well, they have a lot of problems,’ he said at the Reagan National Economic Forum on Friday. ‘But what I really worry about is us. Can we get our own act together – our own values, our own capability, our own management?’ Dimon, the boss of America’s biggest bank, cautioned that the ‘mismanagement’ that occurs at all levels of government could be the biggest catalyst for the nation’s economic demise. ‘The amount of mismanagement is extraordinary – by state, by city, for pensions, and that stuff is going to kill us,’ the billionaire banker told the forum. Dimon sounded the alarm on a ‘crack’ appearing in the bond market as a result of the wildly soaring national debt – which Trump is set to compound with the $3 trillion Big Beautiful Bill awaiting Senate approval. A ‘crack’ in the bond market occurs when investors lose confidence in the government’s ability to service its debt. Bonds are sold, yields go higher and the cost of borrowing increases for all Americans, including the government itself. ‘You are going to see a crack in the bond market. It is going to happen,’ Dimon told the economic forum, predicting it could appear in six months to six years. Waionosays:May 31, 2025 at 1:15 pmLMAO!Jamie sounding an alarm is like Clinton or Trump telling your 14 year old kid how to live a moral life. LMAO! Jamie sounding an alarm is like Clinton or Trump telling your 14 year old kid how to live a moral life. Anthony Acesays:Jun 5, 2025 at 10:44 amThis is all this guy does while CA burns you should focus on local issues mate your state is in huge trouble and SoCal and I have a house there so I know first hand the decline the last 10 years … This is all this guy does while CA burns you should focus on local issues mate your state is in huge trouble and SoCal and I have a house there so I know first hand the decline the last 10 years … DM: America’s top banker Jamie Dimon issues chilling warning about the country’s ‘enemy within’ JPMorgan Chase CEO Jamie Dimon has sounded the alarm about the ‘enemy within’ America, which he warned is a bigger threat than China. Dimon claims that the United States is suffering from a worrying government ‘mismanagement’ issue which has the potential to ‘kill us’. ‘China is a potential adversary. They’re doing a lot of things well, they have a lot of problems,’ he said at the Reagan National Economic Forum on Friday. ‘But what I really worry about is us. Can we get our own act together – our own values, our own capability, our own management?’ Dimon, the boss of America’s biggest bank, cautioned that the ‘mismanagement’ that occurs at all levels of government could be the biggest catalyst for the nation’s economic demise. ‘The amount of mismanagement is extraordinary – by state, by city, for pensions, and that stuff is going to kill us,’ the billionaire banker told the forum. Dimon sounded the alarm on a ‘crack’ appearing in the bond market as a result of the wildly soaring national debt – which Trump is set to compound with the $3 trillion Big Beautiful Bill awaiting Senate approval. A ‘crack’ in the bond market occurs when investors lose confidence in the government’s ability to service its debt. Bonds are sold, yields go higher and the cost of borrowing increases for all Americans, including the government itself. ‘You are going to see a crack in the bond market. It is going to happen,’ Dimon told the economic forum, predicting it could appear in six months to six years. Waionosays:May 31, 2025 at 1:15 pmLMAO!Jamie sounding an alarm is like Clinton or Trump telling your 14 year old kid how to live a moral life. LMAO! Jamie sounding an alarm is like Clinton or Trump telling your 14 year old kid how to live a moral life. LMAO! Jamie sounding an alarm is like Clinton or Trump telling your 14 year old kid how to live a moral life. Anthony Acesays:Jun 5, 2025 at 10:44 amThis is all this guy does while CA burns you should focus on local issues mate your state is in huge trouble and SoCal and I have a house there so I know first hand the decline the last 10 years … This is all this guy does while CA burns you should focus on local issues mate your state is in huge trouble and SoCal and I have a house there so I know first hand the decline the last 10 years … This is all this guy does while CA burns you should focus on local issues mate your state is in huge trouble and SoCal and I have a house there so I know first hand the decline the last 10 years … Spencersays:May 30, 2025 at 8:35 pmA supply side oil shock is keeping inflation lower than it otherwise would be. A supply side oil shock is keeping inflation lower than it otherwise would be. A supply side oil shock is keeping inflation lower than it otherwise would be. Double Bluffsays:May 31, 2025 at 12:20 amDon’t know if anyone tracks this stuff but our local property taxes (schools, fire, hospital, port, recreation, library, etc.) are rising fast, as are utilities like water, electric, TV, and of course all types of insurance. Makes it hard on everyone.Wolf Richtersays:May 31, 2025 at 12:45 amIn theory, this is included in Owners Equivalent or Rent under the assumption that homeowners if they rent out their home would want to recoup the costs of higher insurance, etc.1234says:Jun 5, 2025 at 12:33 amThe people dont seem to know it but by voting (99% in last election) for the Republicans and Democrats, they are voting for more taxes, whether its actual taxes or inflation, because the Republicans and Democrats are constantly deficit spending, and that has to be paid for. There aren’t just two choices on the ballot. The Libertarians are on the ballot and for a balanced budget and reducing debt. If people are finding it hard, they can vote for an alternative.Anthony Acesays:Jun 5, 2025 at 10:51 amno way you cut the budget 50% with the golden goose entitlements being the lefts go to rally cry no matter how many illegals, fraudsters or issues there are making it hard to touch for the GOP that is the only way we reduce this budget to the levels we can pay of the national debt in the 20 years it took to triple it – 12 yrs gop prez 35% of deficit (thanks to bush sort of thanks to clinton) – 12 yrs dems prez 65% of deficit thanks to biden crazy spending and obama give away to boost the economy post 2008 – and before you say they had all the issues GOP had 1 yr of Covid, Dot com, and 9/11 Don’t know if anyone tracks this stuff but our local property taxes (schools, fire, hospital, port, recreation, library, etc.) are rising fast, as are utilities like water, electric, TV, and of course all types of insurance. Makes it hard on everyone. Wolf Richtersays:May 31, 2025 at 12:45 amIn theory, this is included in Owners Equivalent or Rent under the assumption that homeowners if they rent out their home would want to recoup the costs of higher insurance, etc. In theory, this is included in Owners Equivalent or Rent under the assumption that homeowners if they rent out their home would want to recoup the costs of higher insurance, etc. 1234says:Jun 5, 2025 at 12:33 amThe people dont seem to know it but by voting (99% in last election) for the Republicans and Democrats, they are voting for more taxes, whether its actual taxes or inflation, because the Republicans and Democrats are constantly deficit spending, and that has to be paid for. There aren’t just two choices on the ballot. The Libertarians are on the ballot and for a balanced budget and reducing debt. If people are finding it hard, they can vote for an alternative.Anthony Acesays:Jun 5, 2025 at 10:51 amno way you cut the budget 50% with the golden goose entitlements being the lefts go to rally cry no matter how many illegals, fraudsters or issues there are making it hard to touch for the GOP that is the only way we reduce this budget to the levels we can pay of the national debt in the 20 years it took to triple it – 12 yrs gop prez 35% of deficit (thanks to bush sort of thanks to clinton) – 12 yrs dems prez 65% of deficit thanks to biden crazy spending and obama give away to boost the economy post 2008 – and before you say they had all the issues GOP had 1 yr of Covid, Dot com, and 9/11 The people dont seem to know it but by voting (99% in last election) for the Republicans and Democrats, they are voting for more taxes, whether its actual taxes or inflation, because the Republicans and Democrats are constantly deficit spending, and that has to be paid for. There aren’t just two choices on the ballot. The Libertarians are on the ballot and for a balanced budget and reducing debt. If people are finding it hard, they can vote for an alternative. Anthony Acesays:Jun 5, 2025 at 10:51 amno way you cut the budget 50% with the golden goose entitlements being the lefts go to rally cry no matter how many illegals, fraudsters or issues there are making it hard to touch for the GOP that is the only way we reduce this budget to the levels we can pay of the national debt in the 20 years it took to triple it – 12 yrs gop prez 35% of deficit (thanks to bush sort of thanks to clinton) – 12 yrs dems prez 65% of deficit thanks to biden crazy spending and obama give away to boost the economy post 2008 – and before you say they had all the issues GOP had 1 yr of Covid, Dot com, and 9/11 no way you cut the budget 50% with the golden goose entitlements being the lefts go to rally cry no matter how many illegals, fraudsters or issues there are making it hard to touch for the GOP that is the only way we reduce this budget to the levels we can pay of the national debt in the 20 years it took to triple it – 12 yrs gop prez 35% of deficit (thanks to bush sort of thanks to clinton) – 12 yrs dems prez 65% of deficit thanks to biden crazy spending and obama give away to boost the economy post 2008 – and before you say they had all the issues GOP had 1 yr of Covid, Dot com, and 9/11 Don’t know if anyone tracks this stuff but our local property taxes (schools, fire, hospital, port, recreation, library, etc.) are rising fast, as are utilities like water, electric, TV, and of course all types of insurance. Makes it hard on everyone. Wolf Richtersays:May 31, 2025 at 12:45 amIn theory, this is included in Owners Equivalent or Rent under the assumption that homeowners if they rent out their home would want to recoup the costs of higher insurance, etc. In theory, this is included in Owners Equivalent or Rent under the assumption that homeowners if they rent out their home would want to recoup the costs of higher insurance, etc. In theory, this is included in Owners Equivalent or Rent under the assumption that homeowners if they rent out their home would want to recoup the costs of higher insurance, etc. 1234says:Jun 5, 2025 at 12:33 amThe people dont seem to know it but by voting (99% in last election) for the Republicans and Democrats, they are voting for more taxes, whether its actual taxes or inflation, because the Republicans and Democrats are constantly deficit spending, and that has to be paid for. There aren’t just two choices on the ballot. The Libertarians are on the ballot and for a balanced budget and reducing debt. If people are finding it hard, they can vote for an alternative.Anthony Acesays:Jun 5, 2025 at 10:51 amno way you cut the budget 50% with the golden goose entitlements being the lefts go to rally cry no matter how many illegals, fraudsters or issues there are making it hard to touch for the GOP that is the only way we reduce this budget to the levels we can pay of the national debt in the 20 years it took to triple it – 12 yrs gop prez 35% of deficit (thanks to bush sort of thanks to clinton) – 12 yrs dems prez 65% of deficit thanks to biden crazy spending and obama give away to boost the economy post 2008 – and before you say they had all the issues GOP had 1 yr of Covid, Dot com, and 9/11 The people dont seem to know it but by voting (99% in last election) for the Republicans and Democrats, they are voting for more taxes, whether its actual taxes or inflation, because the Republicans and Democrats are constantly deficit spending, and that has to be paid for. There aren’t just two choices on the ballot. The Libertarians are on the ballot and for a balanced budget and reducing debt. If people are finding it hard, they can vote for an alternative. Anthony Acesays:Jun 5, 2025 at 10:51 amno way you cut the budget 50% with the golden goose entitlements being the lefts go to rally cry no matter how many illegals, fraudsters or issues there are making it hard to touch for the GOP that is the only way we reduce this budget to the levels we can pay of the national debt in the 20 years it took to triple it – 12 yrs gop prez 35% of deficit (thanks to bush sort of thanks to clinton) – 12 yrs dems prez 65% of deficit thanks to biden crazy spending and obama give away to boost the economy post 2008 – and before you say they had all the issues GOP had 1 yr of Covid, Dot com, and 9/11 no way you cut the budget 50% with the golden goose entitlements being the lefts go to rally cry no matter how many illegals, fraudsters or issues there are making it hard to touch for the GOP that is the only way we reduce this budget to the levels we can pay of the national debt in the 20 years it took to triple it – 12 yrs gop prez 35% of deficit (thanks to bush sort of thanks to clinton) – 12 yrs dems prez 65% of deficit thanks to biden crazy spending and obama give away to boost the economy post 2008 – and before you say they had all the issues GOP had 1 yr of Covid, Dot com, and 9/11 The people dont seem to know it but by voting (99% in last election) for the Republicans and Democrats, they are voting for more taxes, whether its actual taxes or inflation, because the Republicans and Democrats are constantly deficit spending, and that has to be paid for. There aren’t just two choices on the ballot. The Libertarians are on the ballot and for a balanced budget and reducing debt. If people are finding it hard, they can vote for an alternative. Anthony Acesays:Jun 5, 2025 at 10:51 amno way you cut the budget 50% with the golden goose entitlements being the lefts go to rally cry no matter how many illegals, fraudsters or issues there are making it hard to touch for the GOP that is the only way we reduce this budget to the levels we can pay of the national debt in the 20 years it took to triple it – 12 yrs gop prez 35% of deficit (thanks to bush sort of thanks to clinton) – 12 yrs dems prez 65% of deficit thanks to biden crazy spending and obama give away to boost the economy post 2008 – and before you say they had all the issues GOP had 1 yr of Covid, Dot com, and 9/11 no way you cut the budget 50% with the golden goose entitlements being the lefts go to rally cry no matter how many illegals, fraudsters or issues there are making it hard to touch for the GOP that is the only way we reduce this budget to the levels we can pay of the national debt in the 20 years it took to triple it – 12 yrs gop prez 35% of deficit (thanks to bush sort of thanks to clinton) – 12 yrs dems prez 65% of deficit thanks to biden crazy spending and obama give away to boost the economy post 2008 – and before you say they had all the issues GOP had 1 yr of Covid, Dot com, and 9/11 no way you cut the budget 50% with the golden goose entitlements being the lefts go to rally cry no matter how many illegals, fraudsters or issues there are making it hard to touch for the GOP that is the only way we reduce this budget to the levels we can pay of the national debt in the 20 years it took to triple it – 12 yrs gop prez 35% of deficit (thanks to bush sort of thanks to clinton) – 12 yrs dems prez 65% of deficit thanks to biden crazy spending and obama give away to boost the economy post 2008 – and before you say they had all the issues GOP had 1 yr of Covid, Dot com, and 9/11 jerome01says:May 31, 2025 at 12:33 amcan you please explain why the PCE only inched up by 0.1%, when all were mostly above 4%, but the two heroes were -1.69 and -0.73%Do these have higher waits ?ThanksWolf Richtersays:May 31, 2025 at 12:44 amHousing has a much smaller weight in the PCE than in the CPI. The two heroes have fairly substantial weights. But you also have to look at the massive drop of the two, especially of financial services. A huge drop like that, even with a small weight, moves the needle. As I mentioned in the article, “other” services also dropped.So that’s in terms of services.Food prices also fell month-to-month (-0.28%) after the jump in March. But energy went up. So that kind of balanced out.Acesays:May 31, 2025 at 4:48 pmHaircuts have gone up, and they’ve gone up A LOT. In New York (where of course everything costs more) barbers charge $30-$40 now for a regular haircut. WTF??!! I’m done. I AM FINISHED. I am going to cut my own hair, like I did during the pandemic when all the barbershops were closed. Maybe I’ll shave my head. I’ll be like Jeff Bezos, but without the $200 Billion.Wolf Richtersays:Jun 1, 2025 at 12:16 amGo for it!! Been cutting my hair since 2020. Works great. Zero inflation. No tips. And I got a lot less bad at it.jonsays:Jun 2, 2025 at 9:03 pmBeing a minimalist, I stopped getting haircut outside home for the last 6 years.Like everyone else, I have some desire to look good ( hence the fancy haircut people pay for ). To fulfil that desire I try to stay healthy and fit. can you please explain why the PCE only inched up by 0.1%, when all were mostly above 4%, but the two heroes were -1.69 and -0.73%Do these have higher waits ?Thanks Wolf Richtersays:May 31, 2025 at 12:44 amHousing has a much smaller weight in the PCE than in the CPI. The two heroes have fairly substantial weights. But you also have to look at the massive drop of the two, especially of financial services. A huge drop like that, even with a small weight, moves the needle. As I mentioned in the article, “other” services also dropped.So that’s in terms of services.Food prices also fell month-to-month (-0.28%) after the jump in March. But energy went up. So that kind of balanced out.Acesays:May 31, 2025 at 4:48 pmHaircuts have gone up, and they’ve gone up A LOT. In New York (where of course everything costs more) barbers charge $30-$40 now for a regular haircut. WTF??!! I’m done. I AM FINISHED. I am going to cut my own hair, like I did during the pandemic when all the barbershops were closed. Maybe I’ll shave my head. I’ll be like Jeff Bezos, but without the $200 Billion.Wolf Richtersays:Jun 1, 2025 at 12:16 amGo for it!! Been cutting my hair since 2020. Works great. Zero inflation. No tips. And I got a lot less bad at it.jonsays:Jun 2, 2025 at 9:03 pmBeing a minimalist, I stopped getting haircut outside home for the last 6 years.Like everyone else, I have some desire to look good ( hence the fancy haircut people pay for ). To fulfil that desire I try to stay healthy and fit. Housing has a much smaller weight in the PCE than in the CPI. The two heroes have fairly substantial weights. But you also have to look at the massive drop of the two, especially of financial services. A huge drop like that, even with a small weight, moves the needle. As I mentioned in the article, “other” services also dropped. So that’s in terms of services. Food prices also fell month-to-month (-0.28%) after the jump in March. But energy went up. So that kind of balanced out. Acesays:May 31, 2025 at 4:48 pmHaircuts have gone up, and they’ve gone up A LOT. In New York (where of course everything costs more) barbers charge $30-$40 now for a regular haircut. WTF??!! I’m done. I AM FINISHED. I am going to cut my own hair, like I did during the pandemic when all the barbershops were closed. Maybe I’ll shave my head. I’ll be like Jeff Bezos, but without the $200 Billion.Wolf Richtersays:Jun 1, 2025 at 12:16 amGo for it!! Been cutting my hair since 2020. Works great. Zero inflation. No tips. And I got a lot less bad at it.jonsays:Jun 2, 2025 at 9:03 pmBeing a minimalist, I stopped getting haircut outside home for the last 6 years.Like everyone else, I have some desire to look good ( hence the fancy haircut people pay for ). To fulfil that desire I try to stay healthy and fit. Haircuts have gone up, and they’ve gone up A LOT. In New York (where of course everything costs more) barbers charge $30-$40 now for a regular haircut. WTF??!! I’m done. I AM FINISHED. I am going to cut my own hair, like I did during the pandemic when all the barbershops were closed. Maybe I’ll shave my head. I’ll be like Jeff Bezos, but without the $200 Billion. Wolf Richtersays:Jun 1, 2025 at 12:16 amGo for it!! Been cutting my hair since 2020. Works great. Zero inflation. No tips. And I got a lot less bad at it. Go for it!! Been cutting my hair since 2020. Works great. Zero inflation. No tips. And I got a lot less bad at it. jonsays:Jun 2, 2025 at 9:03 pmBeing a minimalist, I stopped getting haircut outside home for the last 6 years.Like everyone else, I have some desire to look good ( hence the fancy haircut people pay for ). To fulfil that desire I try to stay healthy and fit. Being a minimalist, I stopped getting haircut outside home for the last 6 years.Like everyone else, I have some desire to look good ( hence the fancy haircut people pay for ). To fulfil that desire I try to stay healthy and fit. can you please explain why the PCE only inched up by 0.1%, when all were mostly above 4%, but the two heroes were -1.69 and -0.73%Do these have higher waits ?Thanks Wolf Richtersays:May 31, 2025 at 12:44 amHousing has a much smaller weight in the PCE than in the CPI. The two heroes have fairly substantial weights. But you also have to look at the massive drop of the two, especially of financial services. A huge drop like that, even with a small weight, moves the needle. As I mentioned in the article, “other” services also dropped.So that’s in terms of services.Food prices also fell month-to-month (-0.28%) after the jump in March. But energy went up. So that kind of balanced out.Acesays:May 31, 2025 at 4:48 pmHaircuts have gone up, and they’ve gone up A LOT. In New York (where of course everything costs more) barbers charge $30-$40 now for a regular haircut. WTF??!! I’m done. I AM FINISHED. I am going to cut my own hair, like I did during the pandemic when all the barbershops were closed. Maybe I’ll shave my head. I’ll be like Jeff Bezos, but without the $200 Billion.Wolf Richtersays:Jun 1, 2025 at 12:16 amGo for it!! Been cutting my hair since 2020. Works great. Zero inflation. No tips. And I got a lot less bad at it.jonsays:Jun 2, 2025 at 9:03 pmBeing a minimalist, I stopped getting haircut outside home for the last 6 years.Like everyone else, I have some desire to look good ( hence the fancy haircut people pay for ). To fulfil that desire I try to stay healthy and fit. Housing has a much smaller weight in the PCE than in the CPI. The two heroes have fairly substantial weights. But you also have to look at the massive drop of the two, especially of financial services. A huge drop like that, even with a small weight, moves the needle. As I mentioned in the article, “other” services also dropped. So that’s in terms of services. Food prices also fell month-to-month (-0.28%) after the jump in March. But energy went up. So that kind of balanced out. Acesays:May 31, 2025 at 4:48 pmHaircuts have gone up, and they’ve gone up A LOT. In New York (where of course everything costs more) barbers charge $30-$40 now for a regular haircut. WTF??!! I’m done. I AM FINISHED. I am going to cut my own hair, like I did during the pandemic when all the barbershops were closed. Maybe I’ll shave my head. I’ll be like Jeff Bezos, but without the $200 Billion.Wolf Richtersays:Jun 1, 2025 at 12:16 amGo for it!! Been cutting my hair since 2020. Works great. Zero inflation. No tips. And I got a lot less bad at it.jonsays:Jun 2, 2025 at 9:03 pmBeing a minimalist, I stopped getting haircut outside home for the last 6 years.Like everyone else, I have some desire to look good ( hence the fancy haircut people pay for ). To fulfil that desire I try to stay healthy and fit. Haircuts have gone up, and they’ve gone up A LOT. In New York (where of course everything costs more) barbers charge $30-$40 now for a regular haircut. WTF??!! I’m done. I AM FINISHED. I am going to cut my own hair, like I did during the pandemic when all the barbershops were closed. Maybe I’ll shave my head. I’ll be like Jeff Bezos, but without the $200 Billion. Wolf Richtersays:Jun 1, 2025 at 12:16 amGo for it!! Been cutting my hair since 2020. Works great. Zero inflation. No tips. And I got a lot less bad at it. Go for it!! Been cutting my hair since 2020. Works great. Zero inflation. No tips. And I got a lot less bad at it. jonsays:Jun 2, 2025 at 9:03 pmBeing a minimalist, I stopped getting haircut outside home for the last 6 years.Like everyone else, I have some desire to look good ( hence the fancy haircut people pay for ). To fulfil that desire I try to stay healthy and fit. Being a minimalist, I stopped getting haircut outside home for the last 6 years.Like everyone else, I have some desire to look good ( hence the fancy haircut people pay for ). To fulfil that desire I try to stay healthy and fit. Housing has a much smaller weight in the PCE than in the CPI. The two heroes have fairly substantial weights. But you also have to look at the massive drop of the two, especially of financial services. A huge drop like that, even with a small weight, moves the needle. As I mentioned in the article, “other” services also dropped. So that’s in terms of services. Food prices also fell month-to-month (-0.28%) after the jump in March. But energy went up. So that kind of balanced out. Acesays:May 31, 2025 at 4:48 pmHaircuts have gone up, and they’ve gone up A LOT. In New York (where of course everything costs more) barbers charge $30-$40 now for a regular haircut. WTF??!! I’m done. I AM FINISHED. I am going to cut my own hair, like I did during the pandemic when all the barbershops were closed. Maybe I’ll shave my head. I’ll be like Jeff Bezos, but without the $200 Billion.Wolf Richtersays:Jun 1, 2025 at 12:16 amGo for it!! Been cutting my hair since 2020. Works great. Zero inflation. No tips. And I got a lot less bad at it.jonsays:Jun 2, 2025 at 9:03 pmBeing a minimalist, I stopped getting haircut outside home for the last 6 years.Like everyone else, I have some desire to look good ( hence the fancy haircut people pay for ). To fulfil that desire I try to stay healthy and fit. Haircuts have gone up, and they’ve gone up A LOT. In New York (where of course everything costs more) barbers charge $30-$40 now for a regular haircut. WTF??!! I’m done. I AM FINISHED. I am going to cut my own hair, like I did during the pandemic when all the barbershops were closed. Maybe I’ll shave my head. I’ll be like Jeff Bezos, but without the $200 Billion. Wolf Richtersays:Jun 1, 2025 at 12:16 amGo for it!! Been cutting my hair since 2020. Works great. Zero inflation. No tips. And I got a lot less bad at it. Go for it!! Been cutting my hair since 2020. Works great. Zero inflation. No tips. And I got a lot less bad at it. jonsays:Jun 2, 2025 at 9:03 pmBeing a minimalist, I stopped getting haircut outside home for the last 6 years.Like everyone else, I have some desire to look good ( hence the fancy haircut people pay for ). To fulfil that desire I try to stay healthy and fit. Being a minimalist, I stopped getting haircut outside home for the last 6 years.Like everyone else, I have some desire to look good ( hence the fancy haircut people pay for ). To fulfil that desire I try to stay healthy and fit. Haircuts have gone up, and they’ve gone up A LOT. In New York (where of course everything costs more) barbers charge $30-$40 now for a regular haircut. WTF??!! I’m done. I AM FINISHED. I am going to cut my own hair, like I did during the pandemic when all the barbershops were closed. Maybe I’ll shave my head. I’ll be like Jeff Bezos, but without the $200 Billion. Wolf Richtersays:Jun 1, 2025 at 12:16 amGo for it!! Been cutting my hair since 2020. Works great. Zero inflation. No tips. And I got a lot less bad at it. Go for it!! Been cutting my hair since 2020. Works great. Zero inflation. No tips. And I got a lot less bad at it. Go for it!! Been cutting my hair since 2020. Works great. Zero inflation. No tips. And I got a lot less bad at it. jonsays:Jun 2, 2025 at 9:03 pmBeing a minimalist, I stopped getting haircut outside home for the last 6 years.Like everyone else, I have some desire to look good ( hence the fancy haircut people pay for ). To fulfil that desire I try to stay healthy and fit. Being a minimalist, I stopped getting haircut outside home for the last 6 years.Like everyone else, I have some desire to look good ( hence the fancy haircut people pay for ). To fulfil that desire I try to stay healthy and fit. Being a minimalist, I stopped getting haircut outside home for the last 6 years.Like everyone else, I have some desire to look good ( hence the fancy haircut people pay for ). To fulfil that desire I try to stay healthy and fit. Hoemersays:May 31, 2025 at 2:08 pmSo it appears next month Core PCE will go back up again, at what point will this start an actual decline?? It seems it will stabilize between 2.5%-2.9% staying indefinitely above the Fed’s target, it has been stuck between this since MAY 2024 when the rate was at its highest 5.33. I assume moving forward the new target will be to keep it down below 3% or 2.5% and this will be our new normal, I just fear that if the FED cuts rates more that inflation will go up yet again, Powell’s term ends May 2026 so it will be interesting to see if the inflation target moves from below 3% to something ridiculous like below 5%.Hoemersays:May 31, 2025 at 3:25 pmLooking back at the data I am completely puzzled WHY the Fed even cut rates in AUGUST 2024 when inflation was clearly not showing signs of going below 2%, the unemployment rate was also still very low at 4.2% so I do not buy that it was because of the unemployment rate! It seems very suspicious from the Fed especially cutting rates before election season, I am not accusing them of anything but I do not see any VALID reason why rates needed to keep being cut from August to January unless there were some cracks going on behind the scenes… However, Headline PCE was trending downward from May to September to 2.1%!! Seems that MIGHT be the explanation even if they tell us they use Core PCE…but because of this mess the Fed is in a sticky situation!!! So much for being FORWARD-LOOKING! Headline PCE is back at 2.1% so I wonder what the Fed will do this time around…. So it appears next month Core PCE will go back up again, at what point will this start an actual decline?? It seems it will stabilize between 2.5%-2.9% staying indefinitely above the Fed’s target, it has been stuck between this since MAY 2024 when the rate was at its highest 5.33. I assume moving forward the new target will be to keep it down below 3% or 2.5% and this will be our new normal, I just fear that if the FED cuts rates more that inflation will go up yet again, Powell’s term ends May 2026 so it will be interesting to see if the inflation target moves from below 3% to something ridiculous like below 5%. Hoemersays:May 31, 2025 at 3:25 pmLooking back at the data I am completely puzzled WHY the Fed even cut rates in AUGUST 2024 when inflation was clearly not showing signs of going below 2%, the unemployment rate was also still very low at 4.2% so I do not buy that it was because of the unemployment rate! It seems very suspicious from the Fed especially cutting rates before election season, I am not accusing them of anything but I do not see any VALID reason why rates needed to keep being cut from August to January unless there were some cracks going on behind the scenes… However, Headline PCE was trending downward from May to September to 2.1%!! Seems that MIGHT be the explanation even if they tell us they use Core PCE…but because of this mess the Fed is in a sticky situation!!! So much for being FORWARD-LOOKING! Headline PCE is back at 2.1% so I wonder what the Fed will do this time around…. Looking back at the data I am completely puzzled WHY the Fed even cut rates in AUGUST 2024 when inflation was clearly not showing signs of going below 2%, the unemployment rate was also still very low at 4.2% so I do not buy that it was because of the unemployment rate! It seems very suspicious from the Fed especially cutting rates before election season, I am not accusing them of anything but I do not see any VALID reason why rates needed to keep being cut from August to January unless there were some cracks going on behind the scenes… However, Headline PCE was trending downward from May to September to 2.1%!! Seems that MIGHT be the explanation even if they tell us they use Core PCE…but because of this mess the Fed is in a sticky situation!!! So much for being FORWARD-LOOKING! Headline PCE is back at 2.1% so I wonder what the Fed will do this time around…. So it appears next month Core PCE will go back up again, at what point will this start an actual decline?? It seems it will stabilize between 2.5%-2.9% staying indefinitely above the Fed’s target, it has been stuck between this since MAY 2024 when the rate was at its highest 5.33. I assume moving forward the new target will be to keep it down below 3% or 2.5% and this will be our new normal, I just fear that if the FED cuts rates more that inflation will go up yet again, Powell’s term ends May 2026 so it will be interesting to see if the inflation target moves from below 3% to something ridiculous like below 5%. Hoemersays:May 31, 2025 at 3:25 pmLooking back at the data I am completely puzzled WHY the Fed even cut rates in AUGUST 2024 when inflation was clearly not showing signs of going below 2%, the unemployment rate was also still very low at 4.2% so I do not buy that it was because of the unemployment rate! It seems very suspicious from the Fed especially cutting rates before election season, I am not accusing them of anything but I do not see any VALID reason why rates needed to keep being cut from August to January unless there were some cracks going on behind the scenes… However, Headline PCE was trending downward from May to September to 2.1%!! Seems that MIGHT be the explanation even if they tell us they use Core PCE…but because of this mess the Fed is in a sticky situation!!! So much for being FORWARD-LOOKING! Headline PCE is back at 2.1% so I wonder what the Fed will do this time around…. Looking back at the data I am completely puzzled WHY the Fed even cut rates in AUGUST 2024 when inflation was clearly not showing signs of going below 2%, the unemployment rate was also still very low at 4.2% so I do not buy that it was because of the unemployment rate! It seems very suspicious from the Fed especially cutting rates before election season, I am not accusing them of anything but I do not see any VALID reason why rates needed to keep being cut from August to January unless there were some cracks going on behind the scenes… However, Headline PCE was trending downward from May to September to 2.1%!! Seems that MIGHT be the explanation even if they tell us they use Core PCE…but because of this mess the Fed is in a sticky situation!!! So much for being FORWARD-LOOKING! Headline PCE is back at 2.1% so I wonder what the Fed will do this time around…. Looking back at the data I am completely puzzled WHY the Fed even cut rates in AUGUST 2024 when inflation was clearly not showing signs of going below 2%, the unemployment rate was also still very low at 4.2% so I do not buy that it was because of the unemployment rate! It seems very suspicious from the Fed especially cutting rates before election season, I am not accusing them of anything but I do not see any VALID reason why rates needed to keep being cut from August to January unless there were some cracks going on behind the scenes… However, Headline PCE was trending downward from May to September to 2.1%!! Seems that MIGHT be the explanation even if they tell us they use Core PCE…but because of this mess the Fed is in a sticky situation!!! So much for being FORWARD-LOOKING! Headline PCE is back at 2.1% so I wonder what the Fed will do this time around…. Donnysays:May 31, 2025 at 2:54 pmWonderful article, offering a much more useful view of the recent data than what one finds on all the “big shows.” Wonderful article, offering a much more useful view of the recent data than what one finds on all the “big shows.” Wonderful article, offering a much more useful view of the recent data than what one finds on all the “big shows.” Natesays:May 31, 2025 at 4:54 pmThanks for explaining why the Fed is still being wait and see instead of just meanies.For my fixed side of the portfolio, I am FiIK. 75% broad bonds and 25% tips. Long term inflation case looks weak based on historical trends on tariffs and inflation, but we haven’t seen TACO trade policy has few examples, either, from what I have read. Thanks for explaining why the Fed is still being wait and see instead of just meanies. For my fixed side of the portfolio, I am FiIK. 75% broad bonds and 25% tips. Long term inflation case looks weak based on historical trends on tariffs and inflation, but we haven’t seen TACO trade policy has few examples, either, from what I have read. Thanks for explaining why the Fed is still being wait and see instead of just meanies. For my fixed side of the portfolio, I am FiIK. 75% broad bonds and 25% tips. Long term inflation case looks weak based on historical trends on tariffs and inflation, but we haven’t seen TACO trade policy has few examples, either, from what I have read. Nick Kellysays:May 31, 2025 at 10:41 pmVice President JD Vance this week became the first sitting vice president to address the bitcoin community directly, framing crypto as a hedge against inflation, censorship, and “unelected bureaucrats.” And in a further move to boost bitcoin, the Department of Labor rolled back guidance that had discouraged bitcoin investments in retirement plans.What do you think WR?Wolf Richtersays:Jun 1, 2025 at 12:38 amLet it burn.Cloud Coversays:Jun 1, 2025 at 3:05 pmYikes. Between this, and the Trump family’s promotion of and profiting from his DogeCoin (or whatever cryptos he is pushing)….this could be another topic for Mr. WR later this year or beyond…. Vice President JD Vance this week became the first sitting vice president to address the bitcoin community directly, framing crypto as a hedge against inflation, censorship, and “unelected bureaucrats.” And in a further move to boost bitcoin, the Department of Labor rolled back guidance that had discouraged bitcoin investments in retirement plans. What do you think WR? Wolf Richtersays:Jun 1, 2025 at 12:38 amLet it burn. Let it burn. Cloud Coversays:Jun 1, 2025 at 3:05 pmYikes. Between this, and the Trump family’s promotion of and profiting from his DogeCoin (or whatever cryptos he is pushing)….this could be another topic for Mr. WR later this year or beyond…. Yikes. Between this, and the Trump family’s promotion of and profiting from his DogeCoin (or whatever cryptos he is pushing)….this could be another topic for Mr. WR later this year or beyond…. Vice President JD Vance this week became the first sitting vice president to address the bitcoin community directly, framing crypto as a hedge against inflation, censorship, and “unelected bureaucrats.” And in a further move to boost bitcoin, the Department of Labor rolled back guidance that had discouraged bitcoin investments in retirement plans. What do you think WR? Wolf Richtersays:Jun 1, 2025 at 12:38 amLet it burn. Let it burn. Let it burn. Cloud Coversays:Jun 1, 2025 at 3:05 pmYikes. Between this, and the Trump family’s promotion of and profiting from his DogeCoin (or whatever cryptos he is pushing)….this could be another topic for Mr. WR later this year or beyond…. Yikes. Between this, and the Trump family’s promotion of and profiting from his DogeCoin (or whatever cryptos he is pushing)….this could be another topic for Mr. WR later this year or beyond…. Yikes. Between this, and the Trump family’s promotion of and profiting from his DogeCoin (or whatever cryptos he is pushing)….this could be another topic for Mr. WR later this year or beyond…. Debt-Free-Bubbasays:Jun 2, 2025 at 8:52 amHowdy. Houston, We have a problem???? I sure think so.Today is National Bubba Day also. Howdy. Houston, We have a problem???? I sure think so.Today is National Bubba Day also. Howdy. Houston, We have a problem???? I sure think so.Today is National Bubba Day also. Comments are closed. **FRONT PAGE** **Tariff-Inflation Watch: CPI Inflation in Light of the Tariffs** **by Wolf Richter •Jun 11, 2025** No signs yet of tariffs getting passed through to consumers, neither in durable goods nor in clothing and footwear. **Inventory of Homes for Sale in the Biggest Florida Metros Piles Up to Highest in Years as Demand Has Withered** **by Wolf Richter •Jun 10, 2025** Active Listings versus 2019: Tampa +40%, Orlando +42%, Jacksonville +25%, Cape Coral-Fort Myers +36%, North Port-Sarasota +36%, Lakeland +80%. Miami a little behind: +5%. **Despite Tesla’s Sales Drop, Total EV Penetration in the US Rises to Record 9.8%: BY Model & USA-Made Content** **by Wolf Richter •Jun 10, 2025** Tariffs don’t apply to USA-made content. Some EVs are mostly made in the USA, others are mostly made in foreign countries. **Collapse of the Once High-Flying Solar Stocks: Another Bankruptcy among our 8 Imploded Solar Stocks** **by Wolf Richter •Jun 9, 2025** The stock market’s solar craziness gets cleaned out stock by stock, even as solar-power generation continues to soar. Copyright © 2011 - 2025 Wolf Street Corp. All Rights Reserved. See ourPrivacy Policy.Do not sell my personal information"}