{"id": 1459, "name": "Longmont Times-Call", "domain": "timescall.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.timescall.com/2025/06/10/no-charges-filed-in-april-incident-where-pro-palestine-protesters-were-thrown-out-of-cu-boulder-classroom/", "title": "No Charges Filed In April Incident Where Pro Palestine Protesters Were Thrown Out Of Cu Boulder Classroom", "content": "e-Edition e-Edition NewsNewsLongmont Area NewsCarbon Valley NewsBusiness NewsBusiness SpotlightBest ReviewsCrime & Public SafetyEducationHealthState NewsPoliticsElectionWeatherWorld News News Longmont Area News Carbon Valley News Business News Business Spotlight Best Reviews Crime & Public Safety Education Health State News Politics Election Weather World News News Longmont Area News Carbon Valley News Business News Business Spotlight Best Reviews Crime & Public Safety Education Health State News Politics Election Weather World News SportsSportsHigh School SportsCollege SportsBroncosRockiesNuggetsAvalanche Sports High School Sports College Sports Broncos Rockies Nuggets Avalanche Sports High School Sports College Sports Broncos Rockies Nuggets Avalanche Things to DoEntertainmentEvents CalendarLifestylesFood & DrinkScreensMusicTheater & ArtFaith DirectoryLongmont Magazine Entertainment Events Calendar Lifestyles Food & Drink Screens Music Theater & Art Faith Directory Longmont Magazine Entertainment Events Calendar Lifestyles Food & Drink Screens Music Theater & Art Faith Directory Longmont Magazine OpinionOpinionEditorialsLetters to the EditorOpinion ColumnistsTC-Line Opinion Editorials Letters to the Editor Opinion Columnists TC-Line Opinion Editorials Letters to the Editor Opinion Columnists TC-Line ObituariesObituariesNews ObituariesSubmit an Obituary Obituaries News Obituaries Submit an Obituary Obituaries News Obituaries Submit an Obituary MarketplaceClassifiedsReal EstateJobsRaised in the RockiesSpecial SectionsBusiness DirectoryToday’s AdsCouponsAdvertise With UsFaith DirectoryLongmont MagazineSubmitSponsored ContentPublic Notices Classifieds Real Estate Jobs Raised in the Rockies Special Sections Business Directory Today’s Ads Coupons Advertise With Us Faith Directory Longmont Magazine Submit Sponsored Content Public Notices Classifieds Real Estate Jobs Raised in the Rockies Special Sections Business Directory Today’s Ads Coupons Advertise With Us Faith Directory Longmont Magazine Submit Sponsored Content Public Notices atHome ColoradoatHome ColoradoatHome Real EstateatHome RentalsatHome New Home CommunitiesatHome Home & GardenNew Home MapOpen HomesatHome Featured AgentatHome Real Estate TransactionsFind HomesAdvertise/Contact Us atHome Colorado atHome Real Estate atHome Rentals atHome New Home Communities atHome Home & Garden New Home Map Open Homes atHome Featured Agent atHome Real Estate Transactions Find Homes Advertise/Contact Us atHome Colorado atHome Real Estate atHome Rentals atHome New Home Communities atHome Home & Garden New Home Map Open Homes atHome Featured Agent atHome Real Estate Transactions Find Homes Advertise/Contact Us Advice Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Subscribe Log In Logout e-Edition Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Reddit (Opens in new window)Reddit Click to share on X (Opens in new window)X Subscribe Log In Sign up for email newsletters Subscribe Log In e-Edition e-Edition News Sports Things to Do Opinion Obituaries Election Marketplace Trending: Shock Art voting ends soon New Mead-area roadway Universal school meals ballot issues SVVSD pre-law summer camp After attack: 'Not going to stop walking' **No charges filed in April incident where pro-Palestinian protesters were thrown out of CU Boulder classroom** **University says there's no evidence the professor broke any laws** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Reddit (Opens in new window)Reddit Click to share on X (Opens in new window)X No criminal charges will be filed in thevideoed incidentduring which three pro-Palestinian protesters interrupted a University of Colorado Boulder class in April and were physically thrown out of the classroom. Video clips of the incident, which were posted onsocial media, show that what began as a protest quickly escalated into physical altercations. One clip shows two men physically dragging a protester out of the classroom, and another shows a man yanking and pulling a protester’s head around by grabbing their keffiyeh, which is a traditional Arab headdress. Despite the Boulder Students for Justice in Palestine group saying that this incident was aviolent assaulton students, the CU Boulder Police Department submitted an arrest warrant on April 10 for the one pro-Palestine student protester they could identify, according to a police report obtained through a public records request. But the Boulder County District Attorney’s office denied the arrest warrant. “After careful consideration of the information contained in the warrant, the surveillance videos shown to me, and the conversation we had … about this case, myself and my office have determined that we will not approve the warrant,” Chief Trial Deputy District Attorney Kelsey Waldorf wrote in an email to CUPD on April 11. “Ultimately, we think these cases are going to be highly difficult to prove to a jury because the conduct doesn’t fit neatly into the criminal statutes governing this kind of conduct.” Casondra Heiss, the student for whom CUPD submitted the arrest warrant, declined to comment. The two other people who reportedly entered the classroom with her remain unknown. If the warrant had been approved, CU Boulder would have “utilized (it) as a template for arrest warrants” for three additional students who did not enter the classroom, and for David Preedy, an outside mentor who physically assaulted multiple protesters, according to the police report. Two of the three additional students who did not enter the classroom, Max Inman and Mari Rosenfeld, havefiled a lawsuitagainst the University of Colorado, alleging free speech and due process violations after being banned from campus following a pro-Palestine protest. The proposed charge for Heiss and the additional three students was conspiracy to commit interference with staff, faculty or students of educational institutions, a Class 2 misdemeanor, according to Mueksch. CU Boulder said in a statement that the university has excluded Preedy from campus property. Preedy was an outside mentor who was visiting the class on the day of the disruption. During the incident, Preedy “grabbed” and “shoved” one of the women protesters out of the room and then “chased … down” the other protesters to forcibly remove their face and head coverings, according to the police report. Peruniversity policy, campus exclusions may be executed to ensure the safety and well-being of the campus community. CU Boulder spokesperson Nicole Mueksch said criminal charges are not required to execute a campus exclusion. “Preedy mentioned that he was also fearful that they were going to harm the people in the classroom so he jumped up and forced them out of the classroom,” according to the police report. “… Preedy explained to me that he was afraid they may try and harm other people and that’s why he chased them down and tried to pull their masks off.” Mueksch said the proposed charge for Preedy was harassment, a Class 1 misdemeanor. Preedy could not be reached for comment. CU Boulder releaseda statementon Monday saying the university had consulted with the Boulder County District Attorney’s office after reviewing the evidence in the investigation of the incident. “After a careful evaluation, and under the consideration that the standard for filing criminal charges requires that there be a reasonable likelihood of conviction, the agencies determined that criminal charges would not be filed,” according to aCU Boulder statement. CU Boulder said it cannot disclose actions involving students due to federal law, noting, however, that all students are subject to the CU Boulder Student Code of Conduct. Any student found responsible for violating the Student Code of Conduct will be subject to appropriate sanctions, the statement read. “The safety of all students, faculty, staff and visitors at CU Boulder remains a top priority, and the university is committed to protecting public safety on campus while also supporting free speech that does not violate laws or university policies,” according to the statement. “CUPD appreciates the Boulder County District Attorney’s support in evaluating this case.” The professor of the class was Andrew Meyer, according to the police report. Despite allegations by the Boulder Students for Justice in Palestine group that the professor had “violently assaulted” the protesting students, Meyer was listed as a witness on the police report, not a suspect. The university said there was no evidence that the instructor of the class broke any laws in the April 2 incident. At the time of the disruption, Meyer was teaching “a class on matters involving defense security for the government,” according to the police report. Meyer reported to the police that he “immediately was terrified” because the people who entered the classroom were wearing all black and were covered by face masks, so he felt that they “may have had weapons and malicious intent” to harm him and his students. Meyer could not be reached for a comment. Boulder Students for Justice in Palestine, which is not affiliated with CU Boulder, called on the university to issue a public condemnation of the assault and grant the students amnesty from any student conduct charges. “In (Monday’s) statement, CU Boulder does not condemn the violence …,” the group wrote in an email to the Daily Camera on Tuesday. “In previous official remarks, the university equated physical violence to a policy violation for students disrupting a class. … Any CU student employee will know that a part of our training is learning to de-escalate situations with students, even if we disagree with them. This professor, like any other CU employee, had an obligation to at the very least de-escalate the situation. … This university, where classroom disruptions are routine as part of the induction process for fraternities, has only taken a clear stance against disruption when students are speaking out against their university taking an active part in genocide.” Boulder Students for Justice in Palestine was placed in bad standing by the university in October followingreported policy violations. The group remains active but unaffiliated with CU Boulder. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Reddit (Opens in new window)Reddit Click to share on X (Opens in new window)X **RevContent Feed** **Events** **Most Popular** Johnnie St. Vrain: With so much precipitation, why are Longmont’s reservoirs low?Johnnie St. Vrain: With so much precipitation, why are Longmont's reservoirs low? **Johnnie St. Vrain: With so much precipitation, why are Longmont’s reservoirs low?** **Johnnie St. Vrain: With so much precipitation, why are Longmont’s reservoirs low?** Longmont police notes: Marijuana vape device possession at schoolLongmont police notes: Marijuana vape device possession at school **Longmont police notes: Marijuana vape device possession at school** **Longmont police notes: Marijuana vape device possession at school** Longmont police notes: Drivers elude officersLongmont police notes: Drivers elude officers **Longmont police notes: Drivers elude officers** **Longmont police notes: Drivers elude officers** Voting for Longmont ‘Shock Art’ murals ends SundayVoting for Longmont ‘Shock Art’ murals ends Sunday **Voting for Longmont ‘Shock Art’ murals ends Sunday** **Voting for Longmont ‘Shock Art’ murals ends Sunday** New High Plains Boulevard road project to provide alternate route to I-25 in Mead areaNew High Plains Boulevard road project to provide alternate route to I-25 in Mead area **New High Plains Boulevard road project to provide alternate route to I-25 in Mead area** **New High Plains Boulevard road project to provide alternate route to I-25 in Mead area** Home prices down, listings up in May across much of northern Front RangeHome prices down, listings up in May across much of northern Front Range **Home prices down, listings up in May across much of northern Front Range** **Home prices down, listings up in May across much of northern Front Range** Lyons summer road work starts soonLyons summer road work starts soon **Lyons summer road work starts soon** **Lyons summer road work starts soon** TC Line calls for Tuesday, June 10, 2025TC Line calls for Tuesday, June 10, 2025 **TC Line calls for Tuesday, June 10, 2025** **TC Line calls for Tuesday, June 10, 2025** 1 dead, 4 injured in Denver crash on I-25 involving wrong-way driver1 dead, 4 injured in Denver crash on I-25 involving wrong-way driver **1 dead, 4 injured in Denver crash on I-25 involving wrong-way driver** **1 dead, 4 injured in Denver crash on I-25 involving wrong-way driver** No charges filed in April incident where pro-Palestinian protesters were thrown out of CU Boulder classroomNo charges filed in April incident where pro-Palestinian protesters were thrown out of CU Boulder classroom **No charges filed in April incident where pro-Palestinian protesters were thrown out of CU Boulder classroom** **No charges filed in April incident where pro-Palestinian protesters were thrown out of CU Boulder classroom** **More in Local News** At the Market: A simple recipe for green garlic powder **At the Market: A simple recipe for green garlic powder** **At the Market: A simple recipe for green garlic powder** New High Plains Boulevard road project to provide alternate route to I-25 in Mead area **New High Plains Boulevard road project to provide alternate route to I-25 in Mead area** **New High Plains Boulevard road project to provide alternate route to I-25 in Mead area** Lyons summer road work starts soon **Lyons summer road work starts soon** **Lyons summer road work starts soon** Longmont police notes: Marijuana vape device possession at school **Longmont police notes: Marijuana vape device possession at school** **Longmont police notes: Marijuana vape device possession at school** 2025 June 10 Prairie Mountain MediaSpecial SectionsBuffzone.comBocoPreps.comBroomfield EnterpriseGreeley TribuneRaised in the RockiesMy Town ColoradoLongmont MagazineColorado Hometown WeeklyColorado Box Office Special Sections Buffzone.com BocoPreps.com Broomfield Enterprise Greeley Tribune Raised in the Rockies My Town Colorado Longmont Magazine Colorado Hometown Weekly Colorado Box Office Special Sections Buffzone.com BocoPreps.com Broomfield Enterprise Greeley Tribune Raised in the Rockies My Town Colorado Longmont Magazine Colorado Hometown Weekly Colorado Box Office Subscribee-EditionSign Up for Newsletters e-Edition Sign Up for Newsletters e-Edition Sign Up for Newsletters Contact UsSubmitWork With UsMobile AppsPublic NoticesAccessibilitySitemap Submit Work With Us Mobile Apps Public Notices Accessibility Sitemap Submit Work With Us Mobile Apps Public Notices Accessibility Sitemap Advertise With UsPrairie Mountain Media AdvertisingNetwork AdvertisingAdtaxi SolutionsPlace a Classified Ad Prairie Mountain Media Advertising Network Advertising Adtaxi Solutions Place a Classified Ad Prairie Mountain Media Advertising Network Advertising Adtaxi Solutions Place a Classified Ad Business DirectoryClassifiedsReal EstateJobsToday’s AdsCoupons Classifieds Real Estate Jobs Today’s Ads Coupons Classifieds Real Estate Jobs Today’s Ads Coupons Customer CarePurchase PhotosNewspaper in EducationArchivesAudio Headlines Purchase Photos Newspaper in Education Archives Audio Headlines Purchase Photos Newspaper in Education Archives Audio Headlines Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration MediaNews Group Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}