{"id": 1033, "name": "National Organization for Women", "domain": "now.org", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://now.org/media-center/press-release/what-a-colossal-waste-of-money-instead-of-an-ego-driven-army-parade-lets-celebrate-women-in-the-military/", "title": "What A Colossal Waste Of Money Instead Of An Ego Driven Army Parade Lets Celebrate Women In The Military", "content": "NOWCore IssuesNational Action CampaignMore Ways To GiveGet InvolvedNOW Young FeministsBlog PostsAbout NOW PAC NOW FoundationAbout the FoundationLove Your BodyCrisis In Family CourtsGlobal FeminismVoter Mobilization Media CenterPress ReleasesNOW In The NewsNOW Read This Events Members Only Donate **What A Colossal Waste of Money Instead of an Ego Driven Army Parade, Let’s Celebrate Women in the Military** Released onJune 10, 2025 Statement by National NOW President Christian F. Nunes WASHINGTON–Women in the military are warfighters, patriots, leaders and dedicated members of the community who, if they meet the standard, deserve the opportunity to serve their country, with no exceptions. The Army’s 250thbirthday celebration is an appropriate time to reflect on the honor and value of military service, and to also honor those who serve. But the June 14thobservance in Washington, D.C. has become another offering to Donald Trump’s ego. He sees the parade of 70, one-ton tanks, thousands of soldiers and more than 100 other vehicles not as a celebration of military service, but of service and loyalty to himself. We choose to march on a different path. We celebrate women in the military by recalling their achievements, their victories and their leadership. And we rally with them as they stand up for their right to serve, with all the respect and support they so richly deserve. Last year was the first time in several years that the Army achieved its goals for recruitment—mainly due to an increase in female recruits, according to data reviewed byMilitary.com. There was an 18 percent jump in the number of women signing up for active duty in 2024 over the previous year, while male recruitment rose by just eight percent. We need women in the military—the numbers prove it. But Trump’s executive orders and defense funding bill are bringing harmful and divisive policies that would hurt women, threaten military readiness and endanger the health and security of military families. It seems like Trump wants less women, not more. On day one of his second term, Admiral Linda Fagan, the first female to lead the Coast Guard, was fired for reasons including an excessive focus on diversity issues. Since then, the firings have stepped up to include: Vice Admiral Shoshana Chatfield, the U.S. Representative to NATO’s military committee; Lt. Gen. Jennifer Short, the first female Senior Military Assistant to the Secretary of Defense; and Lisa Franchetti, the first female Chief of Naval Operations; leaving the military without a single woman in a four-star general or admiral leadership position. Woman servicemembers make up nearly 20% of the total military, and are vital to our nation’s defense, and to the strength of communities where military families live. Surveys of active-duty troops have shown that men who serve alongside womensupport a gender-integrated military, and even the Marine Corps has begun graduating mixed-gender battalions. Representation of women in the military has increased to 17 percent, a far cry from the 2 percent representation in 1970. We should be using this Army birthday celebration to ensure that our nation’s military remains strong by recruiting—and supporting—more women. It’s not news that Donald Trump disrespects women—but his callous disregard for women in the military, their service and their accomplishments are even more odious than usual. Our military has long been a place where women could rise and be judged on merit. That’s a bedrock value that we must all now defend. Contact:Press Team,press@now.org, **Media Center** Press Releases NOW In The News NOW Read This **NOW is Taking Action** Attacks on abortion care keep coming. But NOW is defending our access to reproductive freedom. facebook instagram bluesky youtube flickr spotify Home Core Issues Media Center Get Involved About Contact Us © 2025 National Organization for Women. All rights reserved. National Organization for Women FoundationCombined Federal CampaignFC #11215"}