{"id": 1117, "name": "Portland Tribune", "domain": "portlandtribune.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://portlandtribune.com/2025/06/08/kotek-other-democratic-governors-call-trumps-use-of-national-guard-troops-an-alarming-abuse-of-power/", "title": "Kotek Other Democratic Governors Call Trumps Use Of National Guard Troops An Alarming Abuse Of Power", "content": "Home Weather ServicesAbout UsContact UsNewsletters About Us Contact Us Newsletters About Us Contact Us Newsletters eEditionSpecial Sections Special Sections Special Sections NewsPublic Safety Public Safety Public Safety SportsHigh SchoolCollegeProfessional High School College Professional High School College Professional LifestyleFeaturesAnnouncementsWheels Features Announcements Wheels Features Announcements Wheels Events OpinionOpinion HighlightEditorialsColumnistsLetters to the EditorSubmit An Opinion Opinion Highlight Editorials Columnists Letters to the Editor Submit An Opinion Opinion Highlight Editorials Columnists Letters to the Editor Submit An Opinion ObituariesPet TributesSubmit An Obit Pet Tributes Submit An Obit Pet Tributes Submit An Obit Business Contests ClassifiedsBid NoticesPublic NoticesPlace An Ad Bid Notices Public Notices Place An Ad Bid Notices Public Notices Place An Ad News Sports ObituariesSubmit An Obit Submit An Obit Submit An Obit OpinionSubmit An Opinion Submit An Opinion Submit An Opinion Lifestyle Events Newsletters ClassifiedsPublic NoticesBid NoticesPlace An Ad Public Notices Bid Notices Place An Ad Public Notices Bid Notices Place An Ad eEditionSpecial Sections Special Sections Special Sections **Kotek, other Democratic governors call Trump’s use of National Guard troops an ‘alarming abuse of power.’** Published 2:53 pm Sunday, June 8, 2025 By Danny Peterson, KOIN 6 News A coalition of Democratic governors is condemning President Donald Trump’s deployment of the California National Guard in Los Angeles to quell anti-ICE protests “an alarming abuse of power.” Thejoint statementwas released on Sunday by the Democratic Governors Association. It included Oregon Governor Tina Kotek and Washington Governor Bob Ferguson, among many others. They indicated they were standing with California Governor Gavin Newsom, who characterized Trump’s move as something that would worsen an already tense situation. Trump had announced the deployment of 2,000 California National Guard troops to the LA area after a second day of clashes between hundreds of protestors and federal immigration authorities in riot gear. “President Trump’s move to deploy California’s National Guard is an alarming abuse of power. Governors are the Commanders in Chief of their National Guard and the federal government activating them in their own borders without consulting or working with a state’s governor is effective and dangerous,” the DGA statement said. KOIN 6 News is a news partner of the Portland Tribune. Their full story can be found atkoin.com. **You Might Like** **Serial robber pleads guilty to Portland-area crimes, gets prison sentence** **Serial robber pleads guilty to Portland-area crimes, gets prison sentence** **City Council expected to take more testimony about Portland police budget on Tuesday** **City Council expected to take more testimony about Portland police budget on Tuesday** **Suspect arsonist of Sacred Heart Catholic Church in Portland turns themself in** **Suspect arsonist of Sacred Heart Catholic Church in Portland turns themself in** **Volunteers sought to help beautify Portland’s MLKJr Boulevard** **Volunteers sought to help beautify Portland’s MLKJr Boulevard** News Obituaries Opinion Sports Lifestyle Events Weather Submission Forms eEdition Classifieds Newsletters Contract Publishing About Us Contact Us The Bee Business Tribune Estacada News The Outlook Sandy Post Beaverton Valley Times Columbia County Spotlight Forest Grove News Times Hillsboro News Times The Newberg Graphic Valley Times Woodburn Independent Lake Oswego Review Milwaukie Review Oregon City News West Linn Tidings Wilsonville Spokesman Central Oregonian The Madras Pioneer YourOregonNews.com"}