{"id": 1681, "name": "BonSens", "domain": "bonsens.info", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://bonsens.info/echec-de-leppo-des-avocats-de-mme-von-der-leyen-et-de-pfizer-dans-leurs-tentatives-de-faire-enterrer-laffaire-des-smsgate-la-chambre-belge-a-decide-que-les-plaidoiries-auront-bien/", "title": "Echec De Leppo Des Avocats De Mme Von Der Leyen Et De Pfizer Dans Leurs Tentatives De Faire Enterrer Laffaire Des Smsgate La Chambre Belge A Decide Que Les Plaidoiries Auront Bien", "content": "Accueil Missions ActionsEtudes scientifiquesActions juridiquesLes expertsSoutien à l’organisation de conférences scientifiques et médicalesSondages indépendants Etudes scientifiques Actions juridiques Les experts Soutien à l’organisation de conférences scientifiques et médicales Sondages indépendants Etudes scientifiques Actions juridiques Les experts Soutien à l’organisation de conférences scientifiques et médicales Sondages indépendants Live Toutes les actualitésActualités et Communiqués de PresseLive BonSensVidéos Actualités et Communiqués de Presse Live BonSens Vidéos Actualités et Communiqués de Presse Live BonSens Vidéos Adhérer Faire un Don Infos utilesContactDocuments juridiquesCharte BonSensAdhésionsRéférents locaux Contact Documents juridiquesCharte BonSens Charte BonSens Adhésions Référents locaux Contact Documents juridiquesCharte BonSens Charte BonSens Charte BonSens Adhésions Référents locaux **Échec de l’EPPO, des avocats de Mme von der Leyen et de Pfizer dans leurs tentatives de faire enterrer l’affaire des SMSGate : la Chambre Belge a décidé que les plaidoiries auront bien lieu.** **et rappel des procédures lancées par BonSens.org et Mr Frédéric Baldan, contre Madame Ursula Von der Leyen et contre Pfizer Inc.** Le 17 mai 2024, le tribunal de Liège a dit en substance : – Que l’affaire était d’importance ;– Que la compétence de l’EPPO n’était à ce stade pas prouvée ; et devait être démontrée par l’EPPO,– Que le juge Belge était libre de mener à bien les devoirs supplémentaires demandés par la Hongrie,– Et a fixé la date du 6 décembre pour les plaidoiries, afin de laisser aux parties le temps d’approfondir les questions de la compétence de l’EPPO, de l’immunité éventuelle de Mme von der Leyen, et de l’intérêt et la qualité des plaignants à agir. – Que l’affaire était d’importance ; – Que la compétence de l’EPPO n’était à ce stade pas prouvée ; et devait être démontrée par l’EPPO, – Que le juge Belge était libre de mener à bien les devoirs supplémentaires demandés par la Hongrie, – Et a fixé la date du 6 décembre pour les plaidoiries, afin de laisser aux parties le temps d’approfondir les questions de la compétence de l’EPPO, de l’immunité éventuelle de Mme von der Leyen, et de l’intérêt et la qualité des plaignants à agir. – Que l’affaire était d’importance ; – Que la compétence de l’EPPO n’était à ce stade pas prouvée ; et devait être démontrée par l’EPPO, – Que le juge Belge était libre de mener à bien les devoirs supplémentaires demandés par la Hongrie, – Et a fixé la date du 6 décembre pour les plaidoiries, afin de laisser aux parties le temps d’approfondir les questions de la compétence de l’EPPO, de l’immunité éventuelle de Mme von der Leyen, et de l’intérêt et la qualité des plaignants à agir. **En réalité, cette décision est un échec pour Madame von der Leyen et Monsieur Bourla de la société Pfizer inc. qui demandaient que l’affaire en reste là et soit jugée le 17 mai avant les élections européennes.** **C’est donc déjà une grande victoire pour les plaignants.** **Rappel des actions menées par Me Protat pour Frédéric Baldan et pour BonSens.org** Le docteur en droit Olivier Frot télécharge une version non caviardée des contrats ( en août 21) mis en ligne de manière accidentelle et pour peu de temps sur le site de la Commission.Dans un debriefing BonSens.org en partenariat avecFrance-Soir,Olivier Frot évaluait ces contrats anormalement à l’avantage des industriels. Des travaux étaient lancés pour BonSens.org afin de préparer des procédures juridiques. L’association BonSens lance une procédure en France auprès du Tribunal Administratif visant à juger nuls les contrats d’acquisition des vaccinscontre la Covid-19 conclus par l’Union Européenne.BonSens perd sa requête. Requête de BonSens en appel devant la Cour Administrative d’appel de PARIS. Signalement par BonSens et ses adhérents de soupçons de faits de corruption commis par Ursula Von der Leyendans le cadre des contrats d’acquisition de vaccin au Parquet Européen et demande d’une ouverture d’enquête à l’EPPO (parquet européen). BonSens lance une procédure aux Etats-Unis en collaboration avec l’association ICAN visant à obtenir les SMS entre M Bourla et Mme Von der Leyen, dans le cadre d’une procédure Discovery International, pour les transmettre au juge administratif français. L’obtention des SMS permettrait au juge de voir si ces échanges renferment un pacte de corruption, ce qui rendrait nul les contrats d’achats de vaccins (principe en droit, la fraude corrompt tout) BonSens perd à la Cour administrative d’appel et mais BonSens fait un pourvoi.Les défendeurs sont Pfizer et Santé Publique France. LeNew-York Timeslance devant le Tribunal de l’Union Européenne une procédure (AFF T-36/23 STEVI et New-York Times c/ Commission) aux fins de divulgation des échanges entretenus entre Madame Von Der Leyen et Monsieur Bourla. Le juge new-yorkais rejette le recours de l’association BonSens.org et l’invite à la présenter de nouveau à un stade ultérieur de la procédure. BonSens.org fait appel avec l’aide de leurs conseillers Me Diane Protat, William Snyder et Brendan Berne et du cabinet New-Yorkais Siri & Glimstad. BonSens dépose une intervention volontaire dans l’affaire du New-York Times au soutien des demandes. Me Diane PROTAT représentant monsieur Frédéric Baldan dépose une plainte pénalecontre la Présidente de la Commission européenne Ursula Von der Leyen visant les qualifications d’« usurpation de fonctions et de titre », de « destruction de documents publics » et de « prise illégale d’intérêts et corruption » et se constitue partie civile entre les mains d’un des juges d’instruction du Tribunal de première instance de Liège en Belgique. LeTribunal de l’Union Européenne rejette la demande d’intervention volontaire de BonSens.orgdans l’affaire duNew-York Timesprétendant que BonSens.org n’aurait pas d’intérêt à agir. BonSens.org formule un pourvoi devant la Cour de Justice de l’Union Européenne pour être admis à se joindre à l’affaire entamée par le New-York Times considérant à avoir tout autant intérêt à agir qu’un journal américain.Ce pourvoi a été rejeté le 12 janvier 2024 et depuis lors aucune décision des juridictions européennes n’est intervenue dans cette affaire…. Le Conseil d’Etat a rejeté le pourvoi de Bonsens.org qui entendait contester les contrats d’achats de vaccins passés par la Commission européenne et exécutés par Santé Publique France, en ce qu’ils exonéraient le fabricant de toute responsabilité concernant les conséquences d’éventuels effets secondaires. L’audience pénale de Mme von der Leyen dans l’affaire l’opposant à Monsieur Baldan, a conduit la Chambre belge à fixer au 6 décembre 2024 les plaidoiries, qui permettront aux parties d’exposer leurs arguments sur les questions de la compétence de l’EPPO, de l’immunité éventuelle de Mme von der Leyen, et de l’intérêt et la qualité des plaignants à agir. L’association BonSens.org continue sa contestation des contratsdevant un tribunal Belge, et demande à nouveauà la cour de New-York, la divulgation des SMS échangésentre Monsieur Bourla et Mme von der Leyen dans le cadre d’uneDiscovery International. BonSens.org appelle ses adhérents à se porter partie civile dans l’affaire opposant Monsieur Frédéric Baldan et Mme von der Leyen. Nous vous tiendrons informés de la procédure à suivred’ici quelques jours, la mise en place d’un processus pour rassembler potentiellement plusieurs milliers de dossiers prend un peu de temps. Actions juridiques Actions juridiques Actions juridiques ✍️ Pétition de @BonsensOrg :Nous demandons des excuses publiques posthumes envers le Professeur Luc Montagnier de la part du gouvernement et des médiasÀ signer et à partager 🙏 🚨 La Commission Européenne désavouée par le juge européenLa cour de Justice de l’Union Européenne a jugé que Ursula von der Leyen aurait dû donner accès à ses SMS avec le PDG de PFIZER au @nytimes sur le fondement du droit à la Transparence.@BonsensOrg avait fait une… SONDAGE EXCLUSIF @france_soir @BonsensOrgVIA MIS GROUP[Echantillon représentatif de 1200 personnes - Méthode des quotas]🟥 INTERNATIONAL🟠 60 % des Français préfèrent une Europe des Nations contre 15 % favorables à une Europe fédérale🟠 64 % soutiennent l’initiative de… Suite à la résolution citoyenne réclamant le respect de la voix du peuple sur l'engagement des forces françaises en Ukraine, le sénateur @alainhoupert a déposé une résolution au @Senat pour renforcer le contrôle parlementaire sur les engagements militaires de la France🔽🔽🔽 J’ai écouté la résolution citoyenne signée par près de 20 000 personnes, j’ai entendu la volonté des Français dans un sondage et j’ai déposé une résolution au Sénat pour renforcer le contrôle parlementaire sur les engagements militaires et financiers de la France en Ukraine. J’ai écouté la résolution citoyenne signée par près de 20 000 personnes, j’ai entendu la volonté des Français dans un sondage et j’ai déposé une résolution au Sénat pour renforcer le contrôle parlementaire sur les engagements militaires et financiers de la France en Ukraine. 🕊️@BonsensOrg continue à s’engager pour la paixUne Résolution citoyenne a été notifiée aux 2 assemblées par huissier le 17 avril 2025, à l’initiative de militaires, réclamant le respect de la souveraineté populaire sur l’engagement des ressources et des forces militaires de… La Commission Européenne désavouée par le juge européen14 mai 2025+ + + BonSens.org continue à s’engager pour la paix21 avril 2025+ + + Traitement de la grippe sévère : hypothèse sur l’efficacité de l’hydroxychloroquine associée à un macrolide – publication soutenue par BonSens.org5 juin 2025+ + + Les Enjeux de la PollutionPrincipaux Polluants Extérieurs et Intérieurs et leur Impact sur la Santé et la Mortalité Mondiales20 mars 2025+ **Principaux Polluants Extérieurs et Intérieurs et leur Impact sur la Santé et la Mortalité Mondiales** + **Principaux Polluants Extérieurs et Intérieurs et leur Impact sur la Santé et la Mortalité Mondiales** **Principaux Polluants Extérieurs et Intérieurs et leur Impact sur la Santé et la Mortalité Mondiales** + Christian PerronneVoir + Voir + Voir + Gérard GuillaumeVoir + Voir + Voir + Jean-François LesgardsVoir + Voir + Voir + Martin ZiziVoir + Voir + Voir + Jean-Paul BourdineaudVoir + Voir + Voir + Laurent ToubianaVoir + Voir + Voir + Christian VélotVoir + Voir + Voir + Pierre ChaillotVoir + Voir + Voir + Laurent PeléVoir + Voir + Voir + Jean-Dominique MichelVoir + Voir + Voir + Facebook Twitter Youtube Telegram Crowdbunker Accueil Missions Référents locaux Mentions légalesPolitique de confidentialitéPolitique de cookies (UE) Politique de confidentialité Politique de cookies (UE) Politique de confidentialité Politique de cookies (UE) Faire un Don Contact"}