{"id": 95, "name": "Arkansas Times", "domain": "arktimes.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://arktimes.com/rock-candy/2025/06/11/trailer-released-for-the-lost-bus-starring-lr-native-ashlie-atkinson-matthew-mcconaughey-and-america-ferrera", "title": "Trailer Released For The Lost Bus Starring Lr Native Ashlie Atkinson Matthew Mcconaughey And America Ferrera", "content": "**Wanted: Dragon Slayers!** We’re here to “slay dragons” and hold power accountable, but we can’t do it alone. By contributing today, you ensure that independent journalism not only survives but thrives in Arkansas. Together, we can make a difference—join the fight. Re-subscribe today. **Wanted: Dragon Slayers!** We’re here to “slay dragons” and hold power accountable, but we can’t do it alone. By contributing today, you ensure that independent journalism not only survives but thrives in Arkansas. Together, we can make a difference—join the fight. Re-subscribe today. Not a subscriber yet? Get a full month of unlimited access for just $1. Help Subscribe Sign In Arkansas Blog Rock Candy Eat Arkansas Cannabiz For AR Info IssuesOpen dropdown menuDigital IssuesSpecial SectionsOpen dropdown menuCollege GuideNurses GuideBest Lawyers Digital Issues Special SectionsOpen dropdown menuCollege GuideNurses GuideBest Lawyers College Guide Nurses Guide Best Lawyers Digital Issues Special SectionsOpen dropdown menuCollege GuideNurses GuideBest Lawyers College Guide Nurses Guide Best Lawyers College Guide Nurses Guide Best Lawyers Donate Special Pubs Resistance Calendar EventsOpen dropdown menuArkansas Times EventsLecture Series Arkansas Times Events Lecture Series Arkansas Times Events Lecture Series PollsOpen dropdown menuBest of ArkansasStore Best of Arkansas Store Best of Arkansas Store Advertising Facebook Page Twitter Instagram Facebook Page Twitter Instagram Arkansas Times Arkansas news, politics, opinion, restaurants, music, movies and art Help Subscribe Sign In Arkansas Blog Rock Candy Eat Arkansas Cannabiz For AR Info IssuesOpen dropdown menuDigital IssuesSpecial SectionsOpen dropdown menuCollege GuideNurses GuideBest Lawyers Digital Issues Special SectionsOpen dropdown menuCollege GuideNurses GuideBest Lawyers College Guide Nurses Guide Best Lawyers Digital Issues Special SectionsOpen dropdown menuCollege GuideNurses GuideBest Lawyers College Guide Nurses Guide Best Lawyers College Guide Nurses Guide Best Lawyers Donate Special Pubs Resistance Calendar EventsOpen dropdown menuArkansas Times EventsLecture Series Arkansas Times Events Lecture Series Arkansas Times Events Lecture Series PollsOpen dropdown menuBest of ArkansasStore Best of Arkansas Store Best of Arkansas Store Advertising **Trailer released for ‘The Lost Bus,’ starring LR native Ashlie Atkinson, Matthew McConaughey and America Ferrera** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to email a link to a friend (Opens in new window)Email Click to share on Reddit (Opens in new window)Reddit Click to share on Bluesky (Opens in new window)Bluesky Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Threads (Opens in new window)Threads Click to print (Opens in new window)Print Little Rock nativeAshlie Atkinson, a Brooklyn-based actress who still manages an unrivaled loyalty to Arkansas, is starring in a new film, and a teaser trailer dropped a few days ago. Directed by Paul Greengrass (“Captian Phillips,” “The Bourne Ultimatum”) and produced by Jamie Lee Curtis, “The Lost Bus” is a dramatization of the 2018 Camp Fire, the deadliest and most destructive wildfire in California history. The film focuses on a bus driver played by Matthew McConaughey who’s tasked with rescuing 23 stranded elementary school students and their teacher (America Ferrera). The trailer is artfully sparse when it comes to details (minus a harrowing glimpse of McConaughey’s school bus weaving through a flame-drenched thicket of trees), but if you listen closely, you’ll recognize Atkinson’s voice as the calm yet authoritative radio dispatcher asking if anyone can “go and pick these kids up.” Check it out below: According toDeadline, “The Lost Bus” is based on the book “Paradise: One Town’s Struggle to Survive an American Wildfire.” The film is set to release on Apple TV+ and in select theaters in the fall. **It's dragon-slaying time!** In a time when critical voices are increasingly silenced, theArkansas Timesstands as a beacon of truth, tirelessly defending the fundamental rights and freedoms within our community. With Arkansas at the epicenter of a sweeping culture war affecting our libraries, schools, and public discourse, our mission to deliver unflinching journalism has never been more vital. We’re here to “slay dragons” and hold power accountable, but we can’t do it alone. By contributing today, you ensure that independent journalism not only survives but thrives in Arkansas. Together, we can make a difference — join the fight. **Daniel Grear** Daniel Grear is the print editor at the Arkansas Times. He also writes about culture. Send tips to danielgrear@arktimes.comMore by Daniel Grear **Sign up for our newsletters!** Get top news stories, highlights of local entertainment and breaking news in your inbox. Arkansas Times Insiders Daily Update Weekly Bites Events & Discounts **Latest** **Wednesday Open Line** **Arkansas DHS secretary Kristi Putnam to depart agency next month** **Pope County writer Eli Cranor longlisted for Mark Twain literary prize** **Little Rock FBI office has assisted ICE with more than 630 arrests and detainments in 2025** About Us Contact Us Advertise With Us Events Special Publications **About Arkansas Times** Founded in 1974, the Arkansas Times is a lively, opinionated source for news, politics & culture in Arkansas. Our monthly magazine is free at over 500 locations in Central Arkansas. **Read this month's issue** Facebook Page Twitter Instagram **Choose an option to continue reading** Already have an account?Sign In. **Monthly** $10per month $1 for the first month Unlimited access to our content Support quality journalism **Annual** $120per year $1 for the first month Unlimited access to our content Our appreciation and love **Sign in** Enter the code sent to your email. Email address Enter your password Sign in by entering the code we sent to, or clicking the magic link in the email. Privacy Policy. This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. **Complete your transaction**"}