{"id": 541, "name": "Frontiers in Drug Safety and Regulation", "domain": "frontiersin.org/journals/drug-safety-and-regulation", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/drug-safety-and-regulation/articles/10.3389/fdsfr.2025.1574430/full", "title": "Drug Safety And Regulation", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Advanced Methods in Pharmacovigilance and Pharmacoepidemiology Cardiovascular Drug Safety Maternal-Fetal Medicine Pharmaceutical Policy and Regulation Respiratory Drug Safety Rheumatic Drug Safety Substance-Based Medical Devices Vaccine Safety and Regulation Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Advanced Methods in Pharmacovigilance and Pharmacoepidemiology Cardiovascular Drug Safety Maternal-Fetal Medicine Pharmaceutical Policy and Regulation Respiratory Drug Safety Rheumatic Drug Safety Substance-Based Medical Devices Vaccine Safety and Regulation Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Advanced Methods in Pharmacovigilance and Pharmacoepidemiology Cardiovascular Drug Safety Maternal-Fetal Medicine Pharmaceutical Policy and Regulation Respiratory Drug Safety Rheumatic Drug Safety Substance-Based Medical Devices Vaccine Safety and Regulation Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Drug Saf. Regul. Sec. Advanced Methods in Pharmacovigilance and Pharmacoepidemiology Volume 5 - 2025 |doi: 10.3389/fdsfr.2025.1574430 **Identifying regulatory outcomes of non-interventional Post Authorisation Safety Studies in the European repository of studies using publicly available information** 1IQVIA (Portugal), Porto Salvo, Portugal 2Agenzia Regionale di Sanità Toscana, Tuscany, Italy 3University of Verona, Verona, Veneto, Italy 4Agency for Medicinal Products and Medical Devices, Zagreb, Croatia 5Andrija Stampar Teaching Institute of Public Health, Zagreb, Croatia 6Epidemiology and Real-World Science, Parexel, Gothenburg, Sweden 7IQVIA Epidemiology and Database Studies, Amsterdam, Netherlands 8Late Phase and Real World Evidence ICON Plc, Frankfurt, Germany The final, formatted version of the article will be published soon. Select one of your emails You have multiple emails registered with Frontiers: Notify me on publication Please enter your email address: If you already have an account, pleaselogin You don't have a Frontiers account ? You canregister here Post Authorisation Safety Studies (PASS) generate evidence that may support regulators to evaluate the medicinal products and to take regulatory actions when needed. The European Medicine Agency (EMA) promoted decision-making transparency by publishing regulatory guidelines and endorsing the registration of PASS in the European Post-Authorisation Study (EU PAS) Register. A recent analysis of the EU PAS Register showed a marked increase of PASS conducted as multidatabase studies (MDS) during the last decade. This study aimed to assess the feasibility of using public information from the EMA website to identify regulatory outcomes of PASS and, to describe those outcomes by MDS and non-MDS. An equal number of MDS and non-MDS PASS, were selected from the EU PAS Register if: completed between 07/2012 and 12/2020, part of the Risk Management Plan (RMP), required by a European regulator, and conducted in ≥1 EU/UK country. Mentions of the PASS were searched in the Pharmacovigilance Risk Assessment Committee (PRAC) meeting minutes, the European Public Assessment Report (EPAR), and other EMA webpages using study title, acronym, protocol, or regulatory number. Whenever identified, the regulatory outcome information was retrieved. A total of 84 PASS (42 MDS and 42 non-MDS) were analysed., of which, 77% were found in at least one of the sources but the information available was scarce. Regulatory outcomes were identified for 46% of all 84 PASS, with no differences between MDS and non-MDS. Outcomes were more frequently identified for imposed (78%) than non-imposed PASS (34%). The availability of regulatory outcomes increased from 25% for PASS completed in the years 2012-2014 to 56% for those completed in 2018-2020. The regulatory outcome information was unspecific for two thirds of the PASS with outcomes, limiting our description of outcome types.The attempt to identify and describe the regulatory outcomes of MDS and compare them to non-MDS, was impaired by difficulties in identifying PASS, lack of information, granularity, standardisation and consistency across sources. We advocate for an increased transparency of the regulatory outcomes of PASS through the use of a unique PASS identifier and for a complete regulatory outcome publication to understand the regulatory impact of the PASS. Keywords:Post authorisation safety studies, Regulatory outcomes, European Medicines Agency, Transparency, Risk Management, EU PAS Register Received:10 Feb 2025;Accepted:02 Jun 2025. Copyright:© 2025Almas, Girardi, Crisafulli, Gvozdanovic, Hakkarainen, Hyeraci, Hoogendoorn, Rillmann, Roberto, Vitturi and Trifirò. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) or licensor are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. * Correspondence:Mariana Ferreira Almas, IQVIA (Portugal), Porto Salvo, Portugal Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Share on Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}