{"id": 1386, "name": "Stanford Interior Journal", "domain": "theinteriorjournal.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://theinteriorjournal.com/2025/05/27/npr-sues-trump-administration-over-executive-order-to-cut-finding-to-public-media/", "title": "Npr Sues Trump Administration Over Executive Order To Cut Finding To Public Media", "content": "Home E-Edition News Sports Obituaries Records Contests Services Classifieds Calendar Public Notices Home NewsFeaturesOpinion Features Opinion Features Opinion Sports Obituaries Records Contests ServicesAbout UsSubmit a News TipSubmit a PhotoSubmit a Sports StoryPay Subscription About Us Submit a News Tip Submit a Photo Submit a Sports Story Pay Subscription About Us Submit a News Tip Submit a Photo Submit a Sports Story Pay Subscription Classifieds Calendar Public Notices E-edition **NPR sues Trump administration over executive order to cut finding to public media** Published 1:19 pm Tuesday, May 27, 2025 ByKentucky Today WASHINGTON (AP) — National Public Radio and three local stations filed a lawsuit Tuesday against President Donald Trump, arguing that an executive order aimed at cutting federal funding for the organization is illegal. The lawsuit, filed in federal court in Washington by NPR, Colorado Public Radio, Aspen Public Radio and KUTE, Inc. argues that Trump’s executive order to slash public subsidies to PBS and NPR violates the First Amendment. Trump issued the executive order earlier this month that instructs the Corporation for Public Broadcasting and other federal agencies “to cease Federal funding for NPR and PBS” and requires that they work to root out indirect sources of public financing for the news organizations. Trump issued the order after alleging there is “bias” in the broadcasters’ reporting. **Email newsletter signup** “The Order’s objectives could not be clearer: the Order aims to punish NPR for the content of news and other programming the President dislikes and chill the free exercise of First Amendment rights by NPR and individual public radio stations across the country,” the lawsuit alleges. “The Order is textbook retaliation and viewpoint-based discrimination in violation of the First Amendment, and it interferes with NPR’s and the Local Member Stations’ freedom of expressive association and editorial discretion,” it said. **Featured Local Savings** **You Might Like** **TC Energy proposes 40-mile pipeline through Lincoln and Pulaski Counties** **TC Energy proposes 40-mile pipeline through Lincoln and Pulaski Counties** **Disaster application deadline extended to July 25** **Disaster application deadline extended to July 25** **Stanford man enters Alford plea in 2016 death** **Stanford man enters Alford plea in 2016 death** **James “Timmy” Joseph Smith, 75** **James “Timmy” Joseph Smith, 75** Upcoming Events **Upcoming Events** **Upcoming Events** Home News Sports Obituaries Opinion Public Records Contests Classifieds Small Business E-Edition Submit a News Tip Submit a Photo Submit a Sports Story Letters to Editor About Us"}