{"id": 999, "name": "The News Literacy Project", "domain": "newslit.org", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://newslit.org/updates/trial-by-media-the-free-press-and-the-criminal-justice-system-2/", "title": "Trial By Media The Free Press And The Criminal Justice System 2", "content": "The News Literacy Project Skip to navigation [n] Skip to content [c] Skip to footer [f] **Menu** For Educators★ Resource LibraryThe Sift®Checkology® virtual classroomProfessional DevelopmentNewsroom to ClassroomDistrict FellowshipAboutCurrent fellowsAlumniEducator Help Center ★ Resource Library The Sift® Checkology® virtual classroom Professional Development Newsroom to Classroom District FellowshipAboutCurrent fellowsAlumni About Current fellows Alumni Educator Help Center ★ Resource Library The Sift® Checkology® virtual classroom Professional Development Newsroom to Classroom District FellowshipAboutCurrent fellowsAlumni About Current fellows Alumni About Current fellows Alumni Educator Help Center For EveryoneTools for EveryoneRumorGuardGet Smart About News® NewsletterTrainingCampaigns/Research2024 Election MisinformationNews Literacy in AmericaNational News Literacy WeekIsrael-Hamas war Misinformation Tools for EveryoneRumorGuardGet Smart About News® Newsletter RumorGuard Get Smart About News® Newsletter Training Campaigns/Research2024 Election MisinformationNews Literacy in AmericaNational News Literacy WeekIsrael-Hamas war Misinformation 2024 Election Misinformation News Literacy in America National News Literacy Week Israel-Hamas war Misinformation Tools for EveryoneRumorGuardGet Smart About News® Newsletter RumorGuard Get Smart About News® Newsletter RumorGuard Get Smart About News® Newsletter Training Campaigns/Research2024 Election MisinformationNews Literacy in AmericaNational News Literacy WeekIsrael-Hamas war Misinformation 2024 Election Misinformation News Literacy in America National News Literacy Week Israel-Hamas war Misinformation 2024 Election Misinformation News Literacy in America National News Literacy Week Israel-Hamas war Misinformation AboutMissionOur FounderSupport NLPWays to GiveVisionary CircleLegacy SocietyGift Acceptance PolicyOur SupportersNLP NewsUpdatesEventsNLP in the NewsTeam & Careers Mission Our Founder Support NLPWays to GiveVisionary CircleLegacy SocietyGift Acceptance PolicyOur Supporters Ways to Give Visionary Circle Legacy Society Gift Acceptance Policy Our Supporters NLP NewsUpdatesEventsNLP in the News Updates Events NLP in the News Team & Careers Mission Our Founder Support NLPWays to GiveVisionary CircleLegacy SocietyGift Acceptance PolicyOur Supporters Ways to Give Visionary Circle Legacy Society Gift Acceptance Policy Our Supporters Ways to Give Visionary Circle Legacy Society Gift Acceptance Policy Our Supporters NLP NewsUpdatesEventsNLP in the News Updates Events NLP in the News Updates Events NLP in the News Team & Careers Search Subscribe Donate **TrialbyMedia?TheFreePressandtheCriminalJusticeSystem** Published on May 1, 2025Updates Facebook Linked In Flipboard Email In today’s fast-moving information landscape, journalists play a critical role in uncovering the truth. While social media has opened doors for reporters to reach wider audiences with accessible content, these platforms create additional challenges in the dissemination of credible information. Ahead of World Press Freedom Day on May 3, the News Literacy Project hosted a conversation with reporterMeghann Cuniff, a longtime legal affairs journalist, about researching and reporting high-profile legal proceedings, including the role of social media in covering cases involving celebrities like Sean “Diddy” Combs and Megan Thee Stallion. Preview Cuniff’s approach to uncovering events inside the courtroom below and pick up strategies for teaching students about the role of a free press. For more,view the webinar in fullon edWeb. **🪄 Demystify high-profile news** Journalists like Cuniff transform complex events into comprehensible reports so the public can stay informed. To make the details of celebrity trials accessible, Cuniff often posts live updates on social media. The platforms create an “escape from the paywalled world of legal journalism,” she said. With this alternative to limited access to articles from legal journals, more people can gain an understanding of what is happening in the courtroom. Cuniff’s role is especially important given the level of public interest, especially among young people, in high-profile, celebrity trials. With many eyes and ears on these proceedings, Cuniff knows she has a responsibility to ensure that her readers’ understanding of the case and of the legal system itself is shaped accurately. “There are so many people paying attention to [celebrity cases], that it really shapes their view of the legal system. It’s crucial to provide some education there.” **🤳 Understand citizen journalism** With the decline of many traditional newsrooms around the country, citizen journalists, or individuals without formal journalism training who gather and share information on news events, have stepped onto the scene. While citizen journalists may unlock information that would not have otherwise been widely available, their existence emphasizes the need to ask questions about the basis for a reported story, Cuniff said. Citizen journalists often are not trained in the standards or ethical practices of professional journalists. News literacy skills like understandingstandards of quality journalismand investigating the source help ensure that internet users can sort through credible reporting and avoid spreading falsehoods. “It’s a good reminder about the need to educate people about news literacy, what you’re reading, what you’re consuming, and who’s using primary sources.” **💨 Take a breath** When reporting a trial, Cuniff may only have a ten-minute break in the action to post updates for readers. To ensure that she does not sacrifice accuracy in her mission to get breaking news out quickly, Cuniff has a simple practice: taking a deep breath and slowing down. Cuniff prioritizes using her news judgment to get the basic, most important details out first, recognizing that the nuances of the story can come later, once they have been confirmed. Just as Cuniff does when she is reporting breaking news, readers can follow the same practice of slowing down and pausing before sharing information online. Taking a few extra minutes to explore the source behind a claim and looking for confirmation from multiple sources goes a long way in curbing the spread of falsehoods. “It’s all about trying to take a deep breath and to calm down and then focus on the basics.” **Do your students know their First Amendment Rights?** A core standard of news literacy involves acknowledging the importance of the First Amendment and a free press to an informed public. In “The First Amendment,” a FREE interactive lesson on the Checkology® virtual classroom, students learn why the First Amendment’s five rights and freedoms are vital to American democracy. Through case studies, they will weigh in on Supreme Court decisions in which these protections were challenged. **MoreUpdates** **ForEducationWeek,educatorssharehowtheyteachstudentstoquestionhealthinfluencers** An opinion piece in EducationWeek by two educators from New York featured the News Literacy Project’s District Fellowship program. The commentary described how the program supported their efforts to teach students to critically evaluate health and wellness claims on social media. “By the end, our teens had developed habits of healthy skepticism when scrolling their… Published on Jun 4, 2025NLP in the News **InCNNpiece,NLPurgescareandtransparencyasjournalismembracesAI** Peter Adams, the News Literacy Project’s Senior Vice President of Research and Design, was featured in a CNN article examining the use of artificial intelligence to generate content in newsrooms and the challenges it raises around verification and transparency. “It is precisely because AI is prone to errors that newsrooms must maintain the ‘fundamental standards… Published on Jun 4, 2025NLP in the News **InsiderSpotlight:GennaSarnak** Welcome to the Insider Spotlight section, where we feature real questions from our team and answers from educators who are making a difference teaching news literacy. This month, our featured educator is Genna Sarnak from Northfield, Massachusetts, where she teaches digital media literacy to middle school students. Published on Jun 3, 2025Updates SearchClose Email Signup Donate to NLP Today See who supports us Facebook LinkedIn Flipboard TikTok Instagram YouTube Threads Bluesky © 2025 The News Literacy Project5335 Wisconsin Ave. NW, Suite 440Washington, DC 20015Tax ID: 27-4011343 Newsroom Careers FAQ Privacy Policy Contact"}