{"id": 1291, "name": "The Stanford Daily", "domain": "stanforddaily.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://stanforddaily.com/2025/06/01/even-harvard-has-a-spine-faculty-students-rally-for-research-funding-international-students/", "title": "Even Harvard Has A Spine Faculty Students Rally For Research Funding International Students", "content": "**‘Even Harvard Has a Spine’: Faculty, students rally for research funding, international students** Around 200 Stanford faculty and students gathered in White Plaza Friday in a rally to support higher education, academic research and international students. The rally was sponsored by the American Association of University Professors (AAUP) and arose amid the Trump administration’s continued moves tocutresearch funding across the country andhaltthe enrollment of international students at Harvard. Faculty in attendance held posters with messages including “Science Not Silence,” “Even Harvard Has a Spine” and “Hands Off Our Research.” “We need people like you to remain engaged,” said anesthesiology professor Alyssa Burgart, the co-president of the Stanford chapter of AAUP and an organizer of the rally, in one of several speeches by faculty and students. Organizations such as Tech for Liberation, Stanford Faculty and Staff for Justice in Palestine (FSJP) and the student group Education and Democracy United (EDU) also tabled at the event. “There have been really startling actions in the national scape… There have been pressure points on universities to compromise their academic integrity, shut down entire departments and crack down on student protests,” said Turner Van Slyke ’28, afounderof Stanford’s EDU chapter who spoke at the rally. “At Stanford, there have been huge cuts to our budget,” Van Slyke added. School deans weredirectedon April 29 to begin simulating budget cuts up to 15% in response to changes in federal research funding. A proposal working its way through Congress couldimposea 21% endowment tax on Stanford. To begin the rally, political science professor Larry Diamond B.A. ’74 M.A. ’78 Ph.D. ’80 criticized Trump’s policies — which he called “populist authoritarianism” — as “making life miserable for anyone in the media, the arts and universities.” Diamond called on students and faculty to oppose Trump’s policies together. The best form of resistance, he argued, was to build alliances across ethnic, political and other boundaries. After professors delivered speeches, the Raging Grannies — a local activist organization composed of older women — performed a song about protecting academic freedom and international students. Political science professor Hakeem Jefferson condemned the Trump administration’sbanon international student enrollment at Harvard and itsplansto withdraw $9 billion in federal funds from the school, calling these actions “extortion.” Stanford, he added, should lend greater support to Harvard. “Silence doesn’t protect us, it only emboldens those working to dismantle what we’ve worked so hard to build,” he said. Jefferson also argued for the importance of diversity, equity and inclusion (DEI) efforts, saying that Stanford must continue to acknowledge the varied identities of students and faculty. In another speech, law professor Shirin Sinnar J.D. ’03 called attention to the number of non-American professors who now question whether they can continue to teach about politically charged subjects like Palestine or climate change due to fears of government retaliation or deportation. Sinnar also advocated for the protection of undocumented and international students, many of whom are hesitant to publish their work and concerned about receiving even minor legal infractions — like traffic violations — for fear of deportation. Many professors and students echoed her concern for international students. If Trump broadened his ban on international students, Van Slyke said, “It would be a really sad turning point in America’s openness to the world and our acceptance to foreign perspectives.” Diamond stressed the importance of international students in facilitating America’s scientific and technological innovation. U.S. Immigration and Customs Enforcement (ICE)revokedthe visas of six current Stanford students and two recent graduates on April 4. By April 27, seven of the eight visas had beenrestored. Many speakers ended with a call to action for both University leaders and the wider community. “At some point, neutrality becomes complicity,” Jefferson said. University Academics Campus Life Graduate Students Business & Technology Data Equity Project Fall Sports Winter Sports Spring Sports Screen Culture Music Reads Columnists Editorials Letters from the Editor Letters to the Editor Op-Eds Video Podcasts Cartoons Graphics Tech © 2025 THE STANFORD DAILY PUBLISHING CORPORATION Privacy PolicyAccessibilityAdvertise Proudly Powered by WordPress Donateand support The Daily when you shop onAmazon **Login or create an account**"}