{"id": 954, "name": "WBTS - NBC 10 - Boston", "domain": "nbcboston.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.nbcboston.com/investigations/small-town-secrets/the-way-i-was-treated-was-wrong-dedham-sergeant-receives-1-3m-after-suing-police-chief/3736637/", "title": "The Way I Was Treated Was Wrong Dedham Sergeant Receives 1 3m After Suing Police Chief", "content": "**‘The way I was treated was wrong': Dedham sergeant receives $1.3M after suing police chief** **A sergeant with the Dedham Police Department received a $1.3 million settlement in a lawsuit alleging discrimination and retaliation. Marissa Holland spoke exclusively with the NBC10 Boston Investigators about her case, which originated from a promotion decision in 2020.** In an exclusive interview with the NBC10 Boston Investigators, a Massachusetts police officer described her four-year legal battle against the department where she has worked for more than a decade. \"The only way I can describe it is they're clipping your wings,\" Marissa Holland, now a sergeant with the Dedham Police Department, told NBC10 Boston. \"They know you can see it. They know you're more than capable of obtaining it. But they'll do everything in their power to stop you from getting there.\" Stream NBC10 Boston news for free, 24/7, wherever you are. Holland grew up in Dedham and wanted to follow in the public service footsteps of her late father, a Vietnam War veteran who enlisted in the Marines. It was a dream when her hometown department hired her in 2011. Get updates on what's happening in Boston to your inbox with our News Headlines newsletter. After graduating from the academy, Holland said she worked hard to advance in her law enforcement career by taking courses and conducting field training for new officers. On two occasions, Holland said her supervisors nominated her for officer of the year recognition. When two openings for sergeant surfaced, Holland studied up and took the promotional exam in 2020. Her score on the test put her at second on the list. \"I was very proud of my score,\" Holland said. \"I'm thinking, 'This is it.' This is going to be the time when I get my promotion that I'd been seeking for so long.\" However, Holland said she received a call from Dedham Police Chief Michael d'Entremont, who informed her the department would be promoting an officer who scored lower than her on the exam. Holland immediately appealed her bypass through the Massachusetts Civil Service Commission. She eventually prevailed and later received the promotion to sergeant. But during the appeal process, Holland also decided there was ample evidence to pursue a lawsuit for gender discrimination. For instance, Holland said she asked to step away from leading de-escalation training for other officers to give her more time to prepare for the promotional exam. It is something Holland said male officers had also requested without pushback from the police chief, but she later learned her request hurt her promotional chances. \"There was a lot of things have gone on and were used against me that male counterparts had done, and they were not used against them,\" Holland said. Holland continued working as a police officer after filing the lawsuit against her boss. She said every day she reported for her shift, it felt like she was walking on eggshells. Joseph Sulman is Holland's attorney, who told NBC10 Boston why he felt his client's situation rose to the level of litigation. \"What happened here is the chief went after her after she filed and said, 'You challenged me. We're going to try to ruin your career,'\" Sulman said. In the wake of the lawsuit, Sulman said d'Entremont placed Holland on administrative leave for five months and told her the testimony she gave during her Civil Service appeal was the subject of an internal investigation. At that point, Holland and her attorney added a retaliation claim to the case. \"This is on the town government, as well. They're not clueless in this,\" Sulman said. \"They have to do better. They have to take responsibility.\" Just weeks before the case was scheduled for trial last month, court records show the sides reached a settlement: a $1.3 million judgement against the town. NBC10 Boston reached out to the police chief, the town administrator and the chair of the Dedham Select Board. In response to our inquiries, we received the following statement from a town spokesperson: \"While the Town does not admit to any intentional wrongdoing, this settlement enables us all to put this matter in the past. Sergeant Holland is a valued member of the Dedham Police Department, and we look forward to her continued service to the community.\" Holland believes that taxpayers should hold town leaders accountable for what she experienced. She reached out to the NBC10 Boston Investigators afterseeing our stories about a female police officer in Bridgewaterwho accused the police chief of discrimination and retaliation. \"I hope that what I went through, and what I prevailed in, will help other females in law enforcement,\" Holland said. \"The way I was treated was wrong. This type of treatment should never happen anywhere, let alone a police department responsible for protecting people's rights.\" **More Small Town Secrets** **State says female Bridgewater police officer should be promoted, receive back pay** **‘Mistreatment of K9 heroes': Lawsuit accuses Seekonk employees of triggering dogs' PTSD** **Trending Stories** Animals and WildlifeBison gores man in Yellowstone after visitors get too close New HampshireAmbulance rolls over near hospital entrance, trapping 2 EMTs inside MilitaryNavy sailor who vanished is found dead, another sailor held in her death Karen ReadRecap: Karen Read defense rests their case after heated cross-examination MassachusettsMissing fishing boat found sunk off Cape Cod; divers on scene **Weather Forecast** Facebook Instagram TikTok About NBC10 Boston NBC Sports Boston Our News Standards Submit a Tip for Investigations Connect With Us Newsletters Xfinity: Internet, TV, streaming, more WBTS Public Inspection File WBTS Accessibility WBTS Employment Information FCC Applications NBC Non-Profit News Partnership Reports Send Feedback Terms of Service Privacy Policy Your Privacy Choices CA Notice Ad Choices Advertise with us Facebook Instagram TikTok"}