{"id": 202, "name": "CBS News", "domain": "cbsnews.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.cbsnews.com/news/louisianas-whitney-planation-among-several-historic-landmarks-in-jeopardy-amid-changing-federal-policy/", "title": "Louisianas Whitney Planation Among Several Historic Landmarks In Jeopardy Amid Changing Federal Policy", "content": "LatestU.S.LA ProtestsWorldPoliticsEntertainmentHealthWatchMoneyWatchCrimeSpaceSportsBrand Studio U.S. LA Protests World Politics Entertainment HealthWatch MoneyWatch Crime Space Sports Brand Studio U.S. LA Protests World Politics Entertainment HealthWatch MoneyWatch Crime Space Sports Brand Studio Local NewsBaltimoreBay AreaBostonChicagoColoradoDetroitLos AngelesMiamiMinnesotaNew YorkPhiladelphiaPittsburghSacramentoTexas Baltimore Bay Area Boston Chicago Colorado Detroit Los Angeles Miami Minnesota New York Philadelphia Pittsburgh Sacramento Texas Baltimore Bay Area Boston Chicago Colorado Detroit Los Angeles Miami Minnesota New York Philadelphia Pittsburgh Sacramento Texas LiveCBS News 24/7BaltimoreBay AreaBostonChicagoColoradoDetroitLos AngelesMiamiMinnesotaNew YorkPhiladelphiaPittsburghSacramentoTexas48 Hours60 Minutes CBS News 24/7 Baltimore Bay Area Boston Chicago Colorado Detroit Los Angeles Miami Minnesota New York Philadelphia Pittsburgh Sacramento Texas 48 Hours 60 Minutes CBS News 24/7 Baltimore Bay Area Boston Chicago Colorado Detroit Los Angeles Miami Minnesota New York Philadelphia Pittsburgh Sacramento Texas 48 Hours 60 Minutes Shows48 Hours60 MinutesAmerica DecidesCBS Evening NewsCBS MorningsCBS Morning NewsCBS ReportsCBS Saturday MorningThe Daily ReportThe DishFace the NationSunday MorningThe TakeoutThe Uplift 48 Hours 60 Minutes America Decides CBS Evening News CBS Mornings CBS Morning News CBS Reports CBS Saturday Morning The Daily Report The Dish Face the Nation Sunday Morning The Takeout The Uplift 48 Hours 60 Minutes America Decides CBS Evening News CBS Mornings CBS Morning News CBS Reports CBS Saturday Morning The Daily Report The Dish Face the Nation Sunday Morning The Takeout The Uplift CBS News InvestigatesCBS News ConfirmedCBS VillagePodcastsNewslettersDownload Our AppCBS News TeamExecutive TeamBrand StudioParamount+Join Our Talent CommunityRSS FeedsDavos InterviewsA Moment With...Innovators & DisruptorsEconomy 4.0 CBS News Investigates CBS News Confirmed CBS Village Podcasts Newsletters Download Our App CBS News Team Executive Team Brand Studio Paramount+ Join Our Talent Community RSS Feeds Davos Interviews A Moment With... Innovators & Disruptors Economy 4.0 CBS News Investigates CBS News Confirmed CBS Village Podcasts Newsletters Download Our App CBS News Team Executive Team Brand Studio Paramount+ Join Our Talent Community RSS Feeds Davos Interviews A Moment With... Innovators & Disruptors Economy 4.0 CBS Evening News | Full Episodes Eye On America On the Road Watch CBS News Watch CBS News **Sites preserving American history in jeopardy nationwide amid changing federal policies** June 11, 2025 / 3:08 PM EDT/ CBS News As federal policies and staffing levels rapidly change in the name of government efficiency and energy independence, historical sites across the United States — sites that help the public understand the cultures that came before them and built their communities of today — are in jeopardy of losing out on important federal protections. In southern Louisiana, a project aimed at preserving the story of slavery in the Deep South and the unique path of formerly enslaved people transitioning to landowners after the Civil War has been halted amid the federal changes and staffing cuts impacting historic preservation offices in several agencies. The project — called Great River Road — is an 11-mile stretch of land following the winding path of the Mississippi River, spanning a few small towns that so far remain untouched by encroaching industrial development. The descendants of slaves and environmental activists in this community have been fighting industry proposals for decades. The Whitney Plantation in Wallace, Louisiana, is one of more than 600 sites in the region found to be historically significant in a comprehensive study completed in 2024. Once a slave plantation, today Whitney serves as an educational museum. \"I think so many people feel a sense of reverence in the fact that they're walking on the exact ground that these people walked on,\" said Ashley Rogers, Executive Director of Whitney Plantation. \"It means everything to me to try to preserve this place for future generations… I want this place to still be here in 100 years.\" The study was a major win for the hope of securing federal protection for the region, finding that formerly enslaved farmers once cultivated the land — descendants of those people still use historical farming techniques to this day. As a result, the region was listed as eligible to be placed on the National Register of Historic Places, which listed 99,800 historically significant properties as of last March, according to a CBS News analysis of data provided by the National Park Service. Great River Road was expected to go even higher. It was anticipated to soon receive the coveted National Historic Landmark title — a special designation given to only about 2,600 sites across the country. But the project was halted after President Trump returned to the White House for a second term. \"We found out on the news. This was not information that was shared with any members. We found out the same way everyone else found out,\" Rogers said. The request for the Great River Road to be removed from the National Register came from the State Historic Preservation Office, with documentation provided by local preservationists sent to the National Park Service, according to officials familiar with the project. The Louisiana Office of Historic Preservation declined to comment. While Rogers says local environmental and industrial struggles were a factor, historic preservation sources close to the project say the changing political landscape at a federal level paved the way for the project to lose steam for the foreseeable future. In fact, the National Park System Advisory Board, which designates historic landmarks, was quietly dissolved in May, CBS News learned, halting all applications for sites like Great River Road across the country. Across the entire National Park Service, sources close to the agency tell CBS News 13% of employees have been pushed out since January, a loss of up to 3,000 workers, adding the New Orleans Jazz National Historical Park has lost half its staff already. Sources close to NPS said some PhD researchers and park rangers are now cleaning bathrooms at many protected park service sites and monuments across America because they are the last employees left at those sites. Historians say they're deeply concerned about the more than 3 million artifacts preserved at these sites, which are also at risk due to the staffing cuts. Other historians tell CBS News several other agencies have also faced significant cuts. In the Government Services Administration, preservationist positions in charge of managing historic properties have been reduced by 80%, down from 40 employees to only eight. A few other staffing positions with the Advisory Council on Historic Preservation — a small, independent federal agency tasked with advising the president and Congress on preservation policy — have also been chopped. At the Department of the Interior, historians fighting the federal policy changes say an order was recently issued proposing to reduce payroll expenses by another 30%, but that may not necessarily constitute a 30% reduction in staff. And while earlier termination notices that were part of the Trump administration's sweeping cuts to the federal workforce are still pending judicial review, they leave activists concerned that historic properties considered irreplaceable could suffer as a result. With nearly $1 billion in budget cuts to the National Park Service proposed for next year, national parks advocates estimate 350 additional historical, cultural or natural sites nationwide are at risk of closing. Carol Quillen, president and CEO of the National Trust For Historic Preservation — one of many groups fighting against drastic budget cuts and low staffing at National Parks and historic sites — told CBS News, \"We are concerned when the infrastructure that supports preservation activities is dismantled in such a way so that we can't quite figure out how these activities are going to happen now.\" Her organization is even suing the federal government over the impact the cuts and policy changes are having on important places in American history. The White House says the changes are important for ensuring government efficiency, and are an effort to \"restore truth and sanity to depictions of American history.\" \"President Trump is ensuring agencies across the country run more efficiently while preserving great services for the American people, like access to our beautiful national parks,\" said Anna Kelly, a White House spokesperson, in a written statement to CBS News. \"Secretary Burgum is doing an incredible job keeping our parks ready for peak season, ensuring they are in pristine condition for visitors, and restoring truth and sanity to depictions of American history in line with the President'sExecutive Order.\" But Rogers says, \"It's a cynical view to think that we can't spend any government money on things that bring us joy and learning. There are very few places in this country where you can even hear this story, let alone in the place where it happened.\" She remains hopeful the Great River Road project will regain traction again down the line. Another advocate involved in the project says Great River Road's demise was \"crazy.\" But despite state requests for the site to be removed from eligibility, technically, the Great River Road still stands a chance for federal protections in the future. According to a CBS News analysis of U.S. Park Service data on theNational Register of Historic Placesand updated data for 2025 provided by NPS, Great River Road was among about 28 properties that were submitted to the Register and considered eligible for listing as of last year. Getting added to the Register requires passing several procedural steps, with some 428 properties having been added to the National Register so far this year, compared to 1,178 total last year, according to 2025 data provided by the Park Service. So far in 2025, 32 properties have been removed from the Register, including 16 properties that were demolished in Kansas City, Missouri. There were 57 removals in all of 2024, and another 57 removals in 2023. Thirty-four properties were determined to be ineligible for listing last year. Asked about Great River Road, as well as the spending and staffing cuts, the National Park Service says employees may need to take on additional responsibilities amid the cuts, offering the following written statement: \"National Park Service employees are deeply committed to preserving our public lands and serving visitors. At times, team members may step into a range of responsibilities outside their usual scope to help ensure continued access, safety, and stewardship across the park system. This flexibility reflects the dedication and collaborative spirit of our workforce. \"Our parks have long stood as symbols of our shared heritage, resilience, and natural beauty, and continue to offer inspiring experiences to millions of visitors each year. The National Park Service is focused on once again ensuring that every visitor has the chance to explore and connect with the incredible, iconic spaces of our national parks. \"We encourage travelers to do a bit of advance planning to ensure a safe and enjoyable experience. Our parks offer incredible natural beauty and recreational opportunities, and thoughtful preparation helps make the most of every visit. Checking Park alerts, reviewing maps, understanding site-specific guidelines, and planning for varying conditions are all great ways to support a positive and memorable trip. We appreciate everyone's cooperation in preserving these treasured places for all to enjoy. **More from CBS News** Kati Weis is a Murrow Award-winning reporter for CBS News based in New Orleans, covering the Southeast. She previously worked as an investigative reporter at CBS News Colorado in their Denver newsroom. © 2025 CBS Interactive Inc. All Rights Reserved. **More from CBS News** Copyright ©2025 CBS Interactive Inc. All rights reserved."}