{"id": 809, "name": "Lahaina News", "domain": "lahainanews.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.lahainanews.com/news/local-news/2024/07/31/fundraising-event-celebrates-the-resiliency-of-maui-from-the-lahaina-fires-three-days-at-various-venues/", "title": "Fundraising Event Celebrates The Resiliency Of Maui From The Lahaina Fires Three Days At Various Venues", "content": "NewsLocal NewsBusinessCommunity NewsEntertainmentHawaii NewsNational News Local News Business Community News Entertainment Hawaii News National News Local News Business Community News Entertainment Hawaii News National News SportsLocal sportsHawaii SportsNational Sports Local sports Hawaii Sports National Sports Local sports Hawaii Sports National Sports OpinionColumnsEditorialLetters to Editor Columns Editorial Letters to Editor Columns Editorial Letters to Editor Lahaina Scene Real Estate features ContactContact UsStatement of ValuesTerms of Service Contact Us Statement of Values Terms of Service Contact Us Statement of Values Terms of Service Facebook Twitter News Sports Opinion **Fundraising event celebrates the resiliency of Maui from the Lahaina fires, three days at various venues** **** FILE - Rays of sunlight pierce through the clouds Thursday, Aug. 10, 2023, above homes burned by wildfires in Lahaina, Hawaii. Days after Maui's wildfires killed scores of people and destroyed 2,000 homes, a shocking claim spread with alarming speed on YouTube and TikTok: The blaze was set deliberately, using futuristic energy weapons developed by the U.S. military. (AP Photo/Rick Bowmer, File) The Maui News KAHULUI–Hua Momona Foundation is excited to reveal the musical lineup for its inaugural Maui Music & Food Experience, taking place from September 5-7, 2024. The event will feature a host of acclaimed musicians, including special guest Mick Fleetwood of Fleetwood Mac. This multi-night celebration of music and culinary arts will raise crucial funding for food, housing, and mental health support for survivors of the Lahaina fire of August 2023. For the First Annual Maui Music & Food Experience, organizers have brought together an impressive array of musical talent, creating a quintessential series of unique concert events. Led by legendary Chicago musician and Experience Music Director Nicholas Tremulis, the roster of performing artists includes: ¯ Mick Fleetwood (Fleetwood Mac) ¯ Billy Cox (Jimi Hendrix Experience and Band of Gypsys in what might be his final concert performance) ¯ Ron Artis II (participating in a special Jimmy Hendrix set) ¯ Ronnie Baker Brooks ¯ Wayne Baker Brooks ¯ Keni Blue (participating in the Hendrix set) ¯ Bernard Fowler (Rolling Stones) ¯ Ernie Isley (Isley Brothers) ¯ Darryl Jones (Rolling Stones) ¯ Ivan Julian ¯ Howard Levy ¯ Ivan Neville ¯ The Nicholas Tremulis 4 ¯ Charlie Sexton ¯ Isaiah Sharkey The Experience is especially meaningful to Mick Fleetwood whose Maui restaurant, Fleetwood’s on Front Street, was among the many businesses and homes to suffer from the devastating wildfires. His participation highlights the deep personal connection and commitment to the recovery efforts for the Lahaina community. Attendees will also be treated to what might be the final live performance by legendary bassist Billy Cox, who played with Jimi Hendrix as well as Band of Gypsys. Also appearing in support of the Lahaina community will be popular local Maui music artists including: ¯ Jason Arcilla & The Mad Steppas ¯ Ron Artis II ¯ Keni Blue ¯ Naiwi Teruya & Kealii Lum ¯ Sheryl Renee ¯ Gretchen Rhodes Band ¯ Brian Santana Band ¯ Gail Swanson ¯ Marty Dread ¯ Vene Chun ¯ Roger McKinley ¯ Paul West “We are thrilled to bring together such a unique and eclectic set of artists for the Maui Music & Food Experience,”said Gary Grube, Founder of Hua Momona Foundation.“This is a once-in-a-lifetime opportunity to see many of these artists and we encourage music lovers not to miss out. For those who can’t make it to the event, you can still support our efforts by visiting the Maui Music & Food Experience website. Every contribution helps us continue our vital recovery work for the Lahaina community.” Experience attendees will enjoy exclusive benefits over the three-day event, including: Thursday, September 5:“Night at the Farm”– An intimate night at Hua Momona Farms where our top patrons will welcome the artists to Maui; featuring chef stations, world-class wines and solo music performances. Friday, September 6:“Celebration at The Ritz-Carlton Maui”– A gala at The Ritz-Carlton Maui, Kapalua, Aloha Pavilion, showcasing celebrity chefs, a live auction, and historic music performances. Saturday, September 7:“Music at the MACC”– A one-of-a-kind outdoor concert at the Maui Arts & Cultural Center, followed by a special indoor concert in the Castle Theatre, including a tribute to Jimi Hendrix and the 1970 concert film Rainbow Bridge, filmed on Maui. Check out the Experience website for attendance options and special donation packages. Guests traveling to Maui for this event are encouraged to stay at The Ritz-Carlton Maui, Kapalua, the host resort for the Experience. The resort is offering a 30% discount for attendees who reserve with the booking code: FVJ. The best way to support Maui’s recovery is to donate and/or visit. Maui is a world-class travel destination with so much to offer, and the Maui Music & Food Experience is a unique opportunity to both experience the island and support the Lahaina recovery. Learn more about this extraordinary event and Hua Momona Foundation’s ongoing efforts by visiting www.mauimusicandfoodex **Local News** **Local News** **Small businesses desperate for help a year after devastating fire** **Small businesses desperate for help a year after devastating fire** **Mick Fleetwood on the upcoming Lahaina benefit, the loss of friends and new music** **Mick Fleetwood on the upcoming Lahaina benefit, the loss of friends and new music** **How Lahaina’s more than 150-year-old banyan tree is coming back to life after Maui’s fire** **How Lahaina’s more than 150-year-old banyan tree is coming back to life after Maui’s fire** News Sports Opinion Contact Us Copyright © 2025 Hawaii Publications, Inc. | https://www.lahainanews.com | 143 Dickenson St. - No. 203, Lahaina, Maui, HI 96761 | 808-667-7866"}