{"id": 184, "name": "Canadaland", "domain": "canadaland.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.canadaland.com/cabinet-minister-rebecca-chartrand-apologizes-for-facebook-post-after-findings-that-she-humiliated-and-harassed-an-employee/", "title": "Cabinet Minister Rebecca Chartrand Apologizes For Facebook Post After Findings That She Humiliated And Harassed An Employee", "content": "PodcastsAllThe Copernic AffairThe Worst PodcastA Field Guide to Gay AnimalsPretendiansThe BackbenchCANADALANDcanadaLANDBACKCommonsDétoursShort CutsThunder BayWag the Doug All The Copernic Affair The Worst Podcast A Field Guide to Gay Animals Pretendians The Backbench CANADALAND canadaLANDBACK Commons Détours Short Cuts Thunder Bay Wag the Doug All The Copernic Affair The Worst Podcast A Field Guide to Gay Animals Pretendians The Backbench CANADALAND canadaLANDBACK Commons Détours Short Cuts Thunder Bay Wag the Doug NewsAllSearch All Search All Search AboutAbout UsAdvertise with UsAdvertising PolicyDisclosureEventsJobsPitch UsSponsorsTransparency Report About Us Advertise with Us Advertising Policy Disclosure Events Jobs Pitch Us Sponsors Transparency Report About Us Advertise with Us Advertising Policy Disclosure Events Jobs Pitch Us Sponsors Transparency Report SupportSupport UsHow to SupportFAQ for Paid SupportersSupporter Login via Supercast Support Us How to Support FAQ for Paid Supporters Supporter Login via Supercast Support Us How to Support FAQ for Paid Supporters Supporter Login via Supercast CanadaLabsAudio ContestFellowshipsEvents and WorkshopsContact Audio Contest Fellowships Events and Workshops Contact Audio Contest Fellowships Events and Workshops Contact Search PodcastsAllThe Copernic AffairThe Worst PodcastA Field Guide to Gay AnimalsPretendiansThe BackbenchCANADALANDcanadaLANDBACKCommonsDétoursShort CutsThunder BayWag the Doug All The Copernic Affair The Worst Podcast A Field Guide to Gay Animals Pretendians The Backbench CANADALAND canadaLANDBACK Commons Détours Short Cuts Thunder Bay Wag the Doug All The Copernic Affair The Worst Podcast A Field Guide to Gay Animals Pretendians The Backbench CANADALAND canadaLANDBACK Commons Détours Short Cuts Thunder Bay Wag the Doug NewsAllSearch All Search All Search AboutAbout UsAdvertise with UsAdvertising PolicyDisclosureEventsJobsPitch UsSponsorsTransparency Report About Us Advertise with Us Advertising Policy Disclosure Events Jobs Pitch Us Sponsors Transparency Report About Us Advertise with Us Advertising Policy Disclosure Events Jobs Pitch Us Sponsors Transparency Report SupportSupport UsHow to SupportFAQ for Paid SupportersSupporter Login via Supercast Support Us How to Support FAQ for Paid Supporters Supporter Login via Supercast Support Us How to Support FAQ for Paid Supporters Supporter Login via Supercast CanadaLabsAudio ContestFellowshipsEvents and WorkshopsContact Audio Contest Fellowships Events and Workshops Contact Audio Contest Fellowships Events and Workshops Contact **Cabinet Minister Rebecca Chartrand Apologizes for Facebook Post after Findings that she “Humiliated” and “Harassed” an Employee** featured Liberal Party Mark Carney Rebecca Chartrand Facebook Twitter A Minister in Mark Carney’s new cabinet bullied, humiliated and harassed a subordinate while working in a previous role at a community college, Canadaland has learned. Rebecca Chartrand currently serves as the Minister of Northern and Arctic Affairs, and Minister responsible for the Canadian Northern Economic Development Agency. Chartrand is a Liberal Member of Parliament for the Churchill—Keewatinook Aski Riding in Manitoba. This is the first public office Chartrand has held. In 2019, she worked at Red River College in Winnipeg, as Executive Director of Indigenous Strategy. According to an independent review that Red River College commissioned from a law firm that year, Chartrand engaged in conduct that: “Amounted to personal harassment in that over a period of time, the manner in which she engaged with [the complainant] and the approach used to assign work and manage [the complainant’s] performance, constituted conduct which was severe in that such conduct could reasonably cause an individual to be humiliated or intimidated and was repeated, and had a lasting, harmful effect on [the complainant].” Canadaland has obtained two separate documents about Chartrand’s conduct at Red River College. The one noted above is from December 19, 2019, and contains the results of an investigation conducted by law firm Rachlis Neville LLP. It contains a summary of the investigation as explained by Curtis Craven, Director of Human Resources for the college at the time. The letter goes on to offer mental health support to the complainant. This document states that at its time of publication, Chartrand was no longer employed by the college. When asked for clarification, Red River College told Canadaland that Chartrand resigned in December of 2019 to pursue new opportunities. They did not comment on any other aspect of this story, citing privacy concerns. Rachlis Law (known as Rachlis Neville LLP in 2019) did not respond to our request for comment. Allegations The second document is from September 25, 2019, and titled “CONFIDENTIAL COMPLAINT SUMMARY.” It’s a Human Resources document, listing Red River College policies allegedly violated by Chartrand and indicating that the college determined that Chartrand did indeed engage in the behaviors described in “retaliation” against the complainant. The document contains 18 allegations of workplace conduct violations by Chartrand. Among them are: an allegation that Chartrand told the complainant’s direct reports that they need not recognize the complainant’s authority, an allegation that Chartrand negatively interfered with the complainant’s career and reputation, and that during a conference trip, Chartrand assigned to the complainant a 50 page presentation, due in two days. The presentation was never used. Survey Canadaland interviewed the complainant, whose name we have agreed to not include due to possible consequences on her career. This former employee of Chartrand says the workplace troubles started with acontroversial survey that Chartrand’s department gave to prospective Indigenous studentsin 2019. The survey was intended to evaluate how much financial assistance prospective students would receive. It included questions to students about their drug and alcohol use, and gave multiple choice options that suggested homes characterized by neglect and domestic violence. Some students quickly and strongly objected to the survey, resulting in local news coverage. Prospective students interviewed by Global News in 2019 said they found the survey insensitive and supportive of harmful stereotypes. Chartrand issued a media statement after the survey was publicized, saying: “This is a new pilot project and the survey has been a work in progress. The survey received by the media is an earlier version that was revised when concerns were raised. To date, the survey has been used on a very limited basis and all information collected has been destroyed. The College recognizes that more work is needed in order to develop an assessment tool that is effective and culturally sensitive.” The survey is also referenced on the Complaint Summary, dated several months after the Global News story. It says Chartrand was found to have told “the complainant [Chartrand’s] trust was broken in the complainant because the Complainant didn’t support the student assessments.” The complainant told Canadaland that she urged Chartrand to reconsider the survey, but was ignored, and then began to experience harassment from Chartrand. Multiple sources who worked at RRC during this time say at least one person was terminated after the survey was published, and at least one resigned in frustration over its handling. Years later, and soon after Chartrand’s appointment to Cabinet in 2025, a former Red River College student, Kyle Van Rösenhoff, published a comment about the survey incident to Facebook. “How quickly people forget that she was fired from her job, for allowing this inappropriate survey to be distributed to Indigenous students at RRC in 2019,” Rösenhoff’s post read. “Watching old news clips and her apology is not believable at all. But I’m sure she’s a changed person and doesn’t have those views on Indigenous people anymore.” Red River College has stated to Canadaland that Chartrand resigned, rather than being terminated. Rösenhoff did not respond to our request for comment on this story. Chartrand, at this point an MP-elect, responded on Facebook, writing “I need to makes (sic) a public statement.” She accused Van Rösenhoff of slander and “lateral violence,” and solicited information from others about where he lives and works. An “Open Letter Regarding Online Behaviour by MP-elect Rebecca Chartrand” waspostedto Facebook on May 2, 2025. The author, Mihskakwan James Harper, identifies himself as the fiancee of the man targeted by Chartrand, and a former member of the Liberal party. The letter is also signed by one Kyle Ross. In it, Harper accuses Chartrand of trying to intimidate his fiancee for “engaging in civil critique”. He demands a public apology from Chartrand and a statement from the Liberal Party. Since we started reporting this story, the name on the associated Facebook page has changed from Chartrand Rebecca toWapinoong Chartrand, and the post has been removed from public view. Wapinoong is her traditionalname. Chartrand’s former employee tells Canadaland that she tried to alert the Liberal Party to the finding of workplace bullying and harassment during the 2025 federal election campaign. She says they never responded to her. In response to our requests for comment, a Liberal Party spokesperson sent the following statement to Canadaland: “Canadians expect all political parties to do their due diligence on all prospective candidates, and the Liberal Party of Canada has a rigorous process to appropriately conduct such reviews.” For reasons of confidentiality, we do not comment on the specifics of individual candidates’ applications,” and referred us to Chartrand’s Chief of Staff. Subsequently, Chatrand’s Chief of Staff issued the following statement: “Minister Chartrand is committed to fostering a healthy work environment for all persons in the workplace, characterized by collegiality and mutual respect. The Liberal Party of Canada maintains a rigorous due diligence process, in which Minister Chartrand participated in the course of becoming a candidate. Regarding the social media post referenced, Minister Chartrand deeply regrets the language and tone she expressed. She unreservedly offers her apologies for the language of the post.” Facebook Twitter PodcastsAllThe Copernic AffairThe Worst PodcastA Field Guide to Gay AnimalsPretendiansThe BackbenchCANADALANDcanadaLANDBACKCommonsDétoursShort CutsThunder BayWag the Doug All The Copernic Affair The Worst Podcast A Field Guide to Gay Animals Pretendians The Backbench CANADALAND canadaLANDBACK Commons Détours Short Cuts Thunder Bay Wag the Doug All The Copernic Affair The Worst Podcast A Field Guide to Gay Animals Pretendians The Backbench CANADALAND canadaLANDBACK Commons Détours Short Cuts Thunder Bay Wag the Doug NewsAllSearch All Search All Search AboutAbout UsAdvertise with UsAdvertising PolicyDisclosureEventsJobsPitch UsSponsorsTransparency Report About Us Advertise with Us Advertising Policy Disclosure Events Jobs Pitch Us Sponsors Transparency Report About Us Advertise with Us Advertising Policy Disclosure Events Jobs Pitch Us Sponsors Transparency Report SupportSupport UsHow to SupportFAQ for Paid SupportersSupporter Login via Supercast Support Us How to Support FAQ for Paid Supporters Supporter Login via Supercast Support Us How to Support FAQ for Paid Supporters Supporter Login via Supercast CanadaLabsAudio ContestFellowshipsEvents and WorkshopsContact Audio Contest Fellowships Events and Workshops Contact Audio Contest Fellowships Events and Workshops Contact"}