{"id": 2175, "name": "The Watchers", "domain": "watchers.news", "bias": "pro-science", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://watchers.news/2025/06/11/ranch-fire-explodes-to-over-1-700-ha-4-200-acres-forces-evacuations-in-san-bernardino-county-california/", "title": "Ranch Fire Explodes To Over 1 700 Ha 4 200 Acres Forces Evacuations In San Bernardino County California", "content": "Rare snowfall disrupts South Africa, five dead as cut-off low sweeps country18 hours ago Severe thunderstorm hits Bonham, causing extensive damage, Texas1 day ago Strong and shallow M6.3 earthquake hits Colombia, damaging homes and structures3 days ago Tornado damages over 50 structures in De Soto, Missouri3 days ago Satellites capture wildfire smoke as Toronto records the worst air quality in the world, Canada4 days ago Record Sargassum influx inundates Caribbean shores, impacting tourism and ecosystems5 days ago ApplicationsExpandThe WatchersWatching the world evolve and transformSWXSpace weather monitorSAMSeismic activity monitorStormWallStorm-chasing videos The WatchersWatching the world evolve and transform SWXSpace weather monitor SAMSeismic activity monitor StormWallStorm-chasing videos The WatchersWatching the world evolve and transform SWXSpace weather monitor SAMSeismic activity monitor StormWallStorm-chasing videos ConnectExpandContact usNews tipsNewsletterGoogle NewsTelegramTwitterYouTubeFacebookRSS Contact us News tips Newsletter Google News Telegram Twitter YouTube Facebook RSS Contact us News tips Newsletter Google News Telegram Twitter YouTube Facebook RSS Earth changesExpandVolcanoesEarthquakesTsunamisLandslidesSinkholesDroughtWildfiresEarth cracksExtreme coldHeat wavesLakes and riversPole shiftPollutionWater crisisArctic & Antarctic Volcanoes Earthquakes Tsunamis Landslides Sinkholes Drought Wildfires Earth cracks Extreme cold Heat waves Lakes and rivers Pole shift Pollution Water crisis Arctic & Antarctic Volcanoes Earthquakes Tsunamis Landslides Sinkholes Drought Wildfires Earth cracks Extreme cold Heat waves Lakes and rivers Pole shift Pollution Water crisis Arctic & Antarctic Severe weatherExpandTropical cyclonesSevere stormsWinter stormsTornadoesDust stormsSandstormsWeather phenomena Tropical cyclones Severe storms Winter storms Tornadoes Dust storms Sandstorms Weather phenomena Tropical cyclones Severe storms Winter storms Tornadoes Dust storms Sandstorms Weather phenomena Space weatherExpandGeomagnetic stormsSolar activity Geomagnetic storms Solar activity Geomagnetic storms Solar activity SpaceExpandNight SkyNear-Earth ObjectsMeteor activityPlanets and space bodiesSatellites and space missionsSpace exploration Night Sky Near-Earth Objects Meteor activity Planets and space bodies Satellites and space missions Space exploration Night Sky Near-Earth Objects Meteor activity Planets and space bodies Satellites and space missions Space exploration Research …ExpandAtmosphereEnvironmental disastersEnergyVideo galleryEconomic crisisNuclear eventsRadiationSatellite imageryAgricultureArcheologyEpidemicsWildlifeTechnologyMysteriesSeafloorOcean Atmosphere Environmental disasters Energy Video gallery Economic crisis Nuclear events Radiation Satellite imagery Agriculture Archeology Epidemics Wildlife Technology Mysteries Seafloor Ocean Atmosphere Environmental disasters Energy Video gallery Economic crisis Nuclear events Radiation Satellite imagery Agriculture Archeology Epidemics Wildlife Technology Mysteries Seafloor Ocean **Ranch Fire explodes to over 1 700 ha (4 200 acres), forces evacuations in San Bernardino County, California** The Ranch Fire ignited near Apple Valley, California at 14:33 LT on June 10, 2025, consuming 1 702 ha (4 205 acres) in a matter of hours.Evacuation orders and shelter activations are in place as strong winds and low humidity continue to fuel the fire’s rapid spread. Ranch Fire, San Bernardino, California - June 2025. Credit: CALFIRE BDU The Ranch Fire began at 14:33 LT on June 10, near Bowen Ranch Road and Coxey Truck Trail, approximately 97 km (60 miles) northeast of Los Angeles. As of the latest update, the fire has scorched 1 702 ha (4 205 acres) and remains at 0% containment. Favorable conditions for fire growth, sustained winds up to 30 km/h (19 mph), and low relative humidity have driven the rapid expansion of the fire front. The San Bernardino County Sheriff’s Department issued evacuation orders at 16:30 LT for residents from Milpas Drive to High Road, south of Highway 18. A Reverse 9-1-1 emergency alert was sent to notify residents of the immediate threat. #RanchFirepic.twitter.com/muA0ocDBUz Shelters have been established at Sitting Bull Academy, 19445 Sitting Bull Road, for displaced individuals. Victorville Fairgrounds, located at 14800 7th Street, is accepting evacuated animals. The fire is under Unified Command involving CAL FIRE, San Bernardino County Fire Department, Apple Valley Fire Protection District, Bureau of Land Management, and the San Bernardino County Sheriff’s Department. Aerial firefighting resources are on “No Divert” status, meaning they are prioritized exclusively for this incident to protect threatened structures. A Damage Inspection Team is currently assessing structural impacts in and around the affected areas of Apple Valley. The cause of the Ranch Fire remains under investigation. Reet is a science journalist and researcher with a keen focus on extreme weather, space phenomena, and climate-related issues. With a strong foundation in astronomy and a history of environmental activism, she approaches every story with a sharp scientific lens and a deep sense of purpose. Driven by a lifelong love for writing, and a curiosity about the universe, Reet brings urgency and insight to some of the most important scientific developments of our time. Reet Kaurhttps://watchers.news/author/reet-kaur/NWS confirms EF-1 tornado in Great Valley, New York Reet Kaurhttps://watchers.news/author/reet-kaur/Severe flooding hits Cagayan de Oro City, Philippines Reet Kaurhttps://watchers.news/author/reet-kaur/One dead, hundreds evacuated as floods sweep northern Vietnam Reet Kaurhttps://watchers.news/author/reet-kaur/Severe storm, suspected tornado cause damage in Cattaraugus County, New York **Post navigation** Related by tag and category Related by tag Related by category **Severe thunderstorm hits Bonham, causing extensive damage, Texas** **Tornado damages over 50 structures in De Soto, Missouri** **Intense supercell produces multiple tornadoes and flooding west of Lubbock, Texas** **Perchman Fire burns through 343 ha (849 acres) in Ocala National Forest, Putnam County, Florida** **Saharan dust plume to reach Florida by weekend, Texas by next week** **Historic buildings damaged as Camp Fire burns near Fort Stanton, New Mexico** **Rare superbolt rattles homes in Tulsa, Oklahoma** **NWS confirms EF-1 tornado in Great Valley, New York** **Extreme heat forecast for weekend triggers Extreme Heat Watch in Southwest U.S.** **Multiple rounds of storms forecast to impact southern Plains through Friday** **Severe storm, suspected tornado cause damage in Cattaraugus County, New York** **Severe thunderstorm hits Bonham, causing extensive damage, Texas** **Barbara weakens into tropical storm after becoming the first hurricane of the season** **Barbara becomes the first hurricane of the 2025 eastern Pacific season** **Rare snowfall disrupts South Africa, five dead as cut-off low sweeps country** **Severe thunderstorm hits Bonham, causing extensive damage, Texas** **Rapidly spreading wildfire in Jerusalem’s Ein Kerem, Israel, contained after evacuations** **Strong and shallow M6.3 earthquake hits Colombia, damaging homes and structures** **Tornado damages over 50 structures in De Soto, Missouri** **Satellites capture wildfire smoke as Toronto records the worst air quality in the world, Canada** **Intense supercell produces multiple tornadoes and flooding west of Lubbock, Texas** **Commenting rules and guidelines** We value the thoughts and opinions of our readers and welcome healthy discussions on our website. In order to maintain a respectful and positive community, we ask that all commenters follow theserules. **Leave a replyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Save my name, email, and website in this browser for the next time I comment. **Support us** Subscribe to watchers.news today and unlock exclusive access to our entire library of articles and all our applications, presented in fast and user-friendly interface free of ads. **Support us** Subscribe to watchers.news today and unlock exclusive access to our entire library of articles and all our applications, presented in fast and user-friendly interface free of ads. **Latest articles** **Shallow M6.4 earthquake hits near Hualien City, Taiwan** **NWS confirms EF-1 tornado in Great Valley, New York** **Extreme heat forecast for weekend triggers Extreme Heat Watch in Southwest U.S.** **Multiple rounds of storms forecast to impact southern Plains through Friday** **Severe flooding hits Cagayan de Oro City, Philippines** **From the same category** **Rare snowfall disrupts South Africa, five dead as cut-off low sweeps country** **Severe thunderstorm hits Bonham, causing extensive damage, Texas** **Rapidly spreading wildfire in Jerusalem’s Ein Kerem, Israel, contained after evacuations** **Strong and shallow M6.3 earthquake hits Colombia, damaging homes and structures** **Most read** 24 hours 7 days 30 days **Rare snowfall disrupts South Africa, five dead as cut-off low sweeps country** **One dead, hundreds evacuated as floods sweep northern Vietnam** **Severe flooding hits Cagayan de Oro City, Philippines** **Severe storm, suspected tornado cause damage in Cattaraugus County, New York** **Multiple rounds of storms forecast to impact southern Plains through Friday** **NWS confirms EF-1 tornado in Great Valley, New York** **Extreme heat forecast for weekend triggers Extreme Heat Watch in Southwest U.S.** **Campi Flegrei sees renewed seismic activity with multiple tremors** **Satellites capture wildfire smoke as Toronto records the worst air quality in the world, Canada** **Increased explosive activity, large pyroclastic flows at Fuego volcano, Guatemala** **Severe weather outbreak brings giant hail, flash floods, and rare June blizzards to Europe** **Intense supercell produces multiple tornadoes and flooding west of Lubbock, Texas** **Hailstorm devastates wheat crops in Deaf Smith and Randall counties, Texas** **Severe weather outbreak spawns multiple tornadoes in Heilongjiang, China** **M6.1 earthquake south of Crete, Greece prompts tsunami warning** **Long-duration M8.1 solar flare produces strong Earth-directed CME, impact expected on June 1** **Rare superbolt rattles homes in Tulsa, Oklahoma** **G4 – Severe geomagnetic storm watch issued for June 2 following strong Earth-directed CME** **Earthquake swarm prompts state of emergency for Campi Flegrei, Italy** **Ashfall blankets Kagoshima City after eruption at Sakurajima volcano, Japan** **Tornado Emergency issued as violent tornado strikes Marion, Illinois** Use the form below to have our daily news roundup delivered to your inbox every day at midnight UTC. The newsletter is free and you can unsubscribe anytime. Loading... You have successfully joined our subscriber list. About us Contact us Updates & announcements Terms & conditions Privacy policy Cookie policy Editorial policy Advertise Support **Follow us** The Watchers— Watching the world evolve and transform Except where otherwise noted, content on this site is licensed under aCreative Commons Attribution-NonCommercial 4.0 International License- 2025 Earth changesToggle child menuExpandVolcanoesEarthquakesTsunamisLandslidesSinkholesDroughtWildfiresEarth cracksExtreme coldHeat wavesLakes and riversPole shiftPollutionWater crisisArctic & Antarctic Volcanoes Earthquakes Tsunamis Landslides Sinkholes Drought Wildfires Earth cracks Extreme cold Heat waves Lakes and rivers Pole shift Pollution Water crisis Arctic & Antarctic Volcanoes Earthquakes Tsunamis Landslides Sinkholes Drought Wildfires Earth cracks Extreme cold Heat waves Lakes and rivers Pole shift Pollution Water crisis Arctic & Antarctic Severe weatherToggle child menuExpandTropical cyclonesSevere stormsWinter stormsTornadoesDust stormsSandstormsWeather phenomena Tropical cyclones Severe storms Winter storms Tornadoes Dust storms Sandstorms Weather phenomena Tropical cyclones Severe storms Winter storms Tornadoes Dust storms Sandstorms Weather phenomena Space weatherToggle child menuExpandGeomagnetic stormsSolar activity Geomagnetic storms Solar activity Geomagnetic storms Solar activity SpaceToggle child menuExpandNight SkyNear-Earth ObjectsMeteor activityPlanets and space bodiesSatellites and space missionsSpace exploration Night Sky Near-Earth Objects Meteor activity Planets and space bodies Satellites and space missions Space exploration Night Sky Near-Earth Objects Meteor activity Planets and space bodies Satellites and space missions Space exploration Research …Toggle child menuExpandAtmosphereEnvironmental disastersEnergyVideo galleryEconomic crisisNuclear eventsRadiationSatellite imageryAgricultureArcheologyEpidemicsWildlifeTechnologyMysteriesSeafloorOcean Atmosphere Environmental disasters Energy Video gallery Economic crisis Nuclear events Radiation Satellite imagery Agriculture Archeology Epidemics Wildlife Technology Mysteries Seafloor Ocean Atmosphere Environmental disasters Energy Video gallery Economic crisis Nuclear events Radiation Satellite imagery Agriculture Archeology Epidemics Wildlife Technology Mysteries Seafloor Ocean Our applications SAM - Seismic Activity MonitorSWX - Space Weather MonitorStormWall - Storm-chasing videos"}