{"id": 2189, "name": "Socialist Standard", "domain": "worldsocialism.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.worldsocialism.org/wsm/%d0%b8%d1%81%d0%bf%d0%be%d0%b2%d0%b5%d0%b4%d1%8c-%d0%bf%d0%b0%d1%82%d1%80%d0%b8%d0%be%d1%82%d0%b0-%d1%8f-%d0%b2%d1%81%d0%b5%d0%b3%d0%b4%d0%b0-%d0%b3%d0%be%d1%82%d0%be%d0%b2-%d1%83%d0%bc%d0%b5%d1%80/", "title": null, "content": "Home Who we areIntroduction and WelcomeIntroducing the World Socialist MovementHow the WSM Is Different From Other GroupsCompanion parties of the W.S.M.Object and Declaration of Principles Introduction and Welcome Introducing the World Socialist Movement How the WSM Is Different From Other Groups Companion parties of the W.S.M. Object and Declaration of Principles Introduction and Welcome Introducing the World Socialist Movement How the WSM Is Different From Other Groups Companion parties of the W.S.M. Object and Declaration of Principles Introductory MaterialF.A.Q.What is Capitalism?What is Socialism?Revolution or Reform?Introductory ArticlesIntroducing the World Socialist MovementThe Problems of ReformismIt’s a Nice Idea, But Could It Work?How the WSM Is Different From Other GroupsObject and Declaration of PrinciplesAssumption and Ignorance Versus Reason and Reality F.A.Q. What is Capitalism? What is Socialism? Revolution or Reform? Introductory ArticlesIntroducing the World Socialist MovementThe Problems of ReformismIt’s a Nice Idea, But Could It Work?How the WSM Is Different From Other GroupsObject and Declaration of PrinciplesAssumption and Ignorance Versus Reason and Reality Introducing the World Socialist Movement The Problems of Reformism It’s a Nice Idea, But Could It Work? How the WSM Is Different From Other Groups Object and Declaration of Principles Assumption and Ignorance Versus Reason and Reality F.A.Q. What is Capitalism? What is Socialism? Revolution or Reform? Introductory ArticlesIntroducing the World Socialist MovementThe Problems of ReformismIt’s a Nice Idea, But Could It Work?How the WSM Is Different From Other GroupsObject and Declaration of PrinciplesAssumption and Ignorance Versus Reason and Reality Introducing the World Socialist Movement The Problems of Reformism It’s a Nice Idea, But Could It Work? How the WSM Is Different From Other Groups Object and Declaration of Principles Assumption and Ignorance Versus Reason and Reality Introducing the World Socialist Movement The Problems of Reformism It’s a Nice Idea, But Could It Work? How the WSM Is Different From Other Groups Object and Declaration of Principles Assumption and Ignorance Versus Reason and Reality AnalysisDream On?EconomicsGlobal EconomyOwnershipThe StateRacismResourcesThe EnvironmentPoliticsHistorySociety and CultureSocialist Writers Dream On? Economics Global Economy Ownership The State Racism Resources The Environment Politics History Society and Culture Socialist Writers Dream On? Economics Global Economy Ownership The State Racism Resources The Environment Politics History Society and Culture Socialist Writers Langues / LenguasCeskáNěkteré aspekty Marxovy politické ekonomieSocialismusCymraegSOSIALAETH: Y BYD YN UNDeutschAnmerkungen der Sozialistischen Partei zur Europawahl 2009Die solidarische Gesellschaft, das unbekannte WesenKinderkramMarktwirtschaftEuropäischer Kapitalismus oder weltweiter Sozialismus?WeltsozialismusDie Probleme der heutigen Gesellschaft und ihre Ursache. (1949)Español¿A FAVOR DE PALESTINA O EN CONTRADE LA GUERRA?UNA PLAGA EN LAS CASAS DE AMBOSEL ESTADO Y LA REVOLUCIÓN SOCIALISTA, POR J. MARTOVEl papel de los soviets en la revolución burguesa rusa: El punto de vista de Julio Mártov¿QUÉ ES EL MARXISMO?Rosa LuxemburgoRosa Luxemburgo y la Cuestión NacionalPinochet y SocialismoCómo se diferencia el Movimiento Socialista Mundial de los demás gruposRusia nunca fue SocialistaEl engaño del anti-imperialismoAuges y recesiones económicas: ¿qué los causa?Breve historia del Partido Socialista Mundial de Estados Unidos [WSPUS]Capítulo 1 – El papel cambiante de las mujeresCapítulo 1 – ¿Qué es la naturaleza humana?Capítulo 2 – Los hechos de la vidaCapítulo 2 – ¿En qué está equivocada la teoría feminista?Capítulo 3 – ¿Cómo llegamos aquí?Capítulo 4 – Darwinismo anti-socialCapítulo 5 – ¿Genes para todo?Capítulo 6 – Comportamiento y socialismoHacen nuestros genes imposible el socialismo?La Guerra en GeorgiaDe nuevo es tiempo de eleccionesEl engaño del anti-imperialismoEl marxismo en contraste con el leninismoEl mito de la sociedad transicionalLa cooperación adquiere sentidoLA FUTILIDAD DEL SIONISMOLa Guerra Fria Se Re-CalientaLa leyenda de Marx o “Engels el fundador”Las mujeres y el socialismoLenin, teórico del NacionalismoLevantar el bloqueoLos economistas no son de este planetaLos trabajadores contra los BolcheviquesMartov: social-demócrata ruso¿Nación o Clase?Partido Socialista Mundial -Solicitud de afiliaciónPaz en Palestina es mucho mejor que la guerraPorque los socialistas se opusieron a el Vietcong, y se oponen a los movimientos nacionalistas, al anti-imperialismo, a todo tipo de gobiernos¿Por qué las utilidades tienen prioridad?Posesion Estatal versus Posesion Comun ( o Socialismo )¿Que fue el Fascismo ?Sentando los fundamentosSOCIALISMO Y RELIGIÓNTecnología de la información y socialismoUna sociedad dividida en dos clases socialesUtopía Socialista: ¿Proyecto Realizable O Sueño Inaccesible?¿Que Se Ha De Hacer?¿Qué se ha de hacer? 2Carta abierta a ……El Socialismo nunca ha sido probadoNo seáis ni líderes ni seguidoresPreguntas respondidas -y formuladas¿QUÉ DIABLOS ES EL MARXISMO CULTURAL?EL SOCIALISMO SIN MERCADO ES FACTIBLESE ESTÁ PREPARANDO UNA TORMENTA?EL SOCIALISMO Y LA CUESTIÓN ARANCELARIAEsperanto“Solidarnosc” erare paŝis (1989)BonvenonĈu utopio aŭ ĥaoso?Demandoj kaj respondojLa Mondsocialisma MovadoFrançaisArrêtons la machine folle du capitalismeBaisser La Tête Ou Construire L’Espoir?La fin du travail?Un capitalisme européen ou un socialisme mondial?Une Societe Sans ArgentPour le socialisme mondialGlosaPlu qestio e responde de socialismoHindiलोग … या लाभसिद्धांतों की घोषणाHrvatskiDobrodošli na stranice WMS-aItalianoChe cos’è il SocialismoChe cos’è la proprietà comune?È ancora tempo di elezioniIl bisogno di socialismoLa delusione antimperialistaStiamo andando incontro a una fame di massa?Il socialismo non di mercato è fattibileUn capitalismo europeo o un socialismo mondiale?NederlandsDe grondbeginselen van het socialismeEen kijk op de vervuilingproblematiekEuropees kapitalisme of wereldsocialisme?Het ontstaan van de “Socialist Party of Great Britain” (S.P.G.B.)Mensen….of winst?Edgar hardcastle archiefNorskOm oss selvPolskaAnarchizm-a cóź to nowego?Dlaczego system zysków musi odejść?Na pomoc jesteś w klatcePrzyszłość pracyTo jest socjalizmZnowu wyboryPortuguêsO Movimento Socialista MundialSvenskaFria resor i Köpenhamn?Lenin: bara en rysk revolutionärMyten om övergångssamhället av A. BuickNu är det val igenSocialdemokraterna- ett kapitalistiskt partiSocialism betyderSocialism betyder fri tillgångTrotskisterna och statskapitalismenUttalande till en tysk arbetarkonferens i Augsburg (1969)TagalogANG SOSYALISMO Isang Mabilis na Sangguniang PatnubayANO ANG KAIBAHAN NG KILUSANG PANDAIGDIGANG SOSYALISTA (WORLD SOCIALIST MOVEMENT) KAYSA IBANG MGA PANGKATIN?ANO ANG MGA KADAHILANAN NG KAHIRAPAN SA MUNDO?MGA LAYUNIN AT SIMULAIN IMGA LAYUNIN AT SIMULAIN IITürkçeDünya sosyalızım hakkinda sorulardünya sosyalzm hakkinda sorular ve yanitlarİnsan ya da Kâr?ΕλληνικάΕΝΑ ΔΙΑΦΟΡΕΤΙΚΟ ΕΙΔΟΣ ΠΟΛΙΤΙΚΗΣΠαρουσιάζοντας το Παγκόσμιο Σοσιαλιστικό ΚίνημαΠροβλήματα και λύσειςΤι είναι ΣοσιαλισμόςРусский языкMoжет ли социалист быть националистом?Война как бизнесИсповедь патриота: я всегда готов умереть за всякой страныМиф советского социализмаУТВЕРЖДЕНИЕ ПРИНЦИПОВ ДВИЖЕНИЯ ЗА МИРОВОЙ СОЦИАЛИЗМעבריתמה זה קפיטליזם?বাংলাDarwin 1Darwin 2日本 語世 界社会主義運動（WSM）の「目標と原則宣言」 CeskáNěkteré aspekty Marxovy politické ekonomieSocialismus Některé aspekty Marxovy politické ekonomie Socialismus CymraegSOSIALAETH: Y BYD YN UN SOSIALAETH: Y BYD YN UN DeutschAnmerkungen der Sozialistischen Partei zur Europawahl 2009Die solidarische Gesellschaft, das unbekannte WesenKinderkramMarktwirtschaftEuropäischer Kapitalismus oder weltweiter Sozialismus?WeltsozialismusDie Probleme der heutigen Gesellschaft und ihre Ursache. (1949) Anmerkungen der Sozialistischen Partei zur Europawahl 2009 Die solidarische Gesellschaft, das unbekannte Wesen Kinderkram Marktwirtschaft Europäischer Kapitalismus oder weltweiter Sozialismus? Weltsozialismus Die Probleme der heutigen Gesellschaft und ihre Ursache. (1949) Español¿A FAVOR DE PALESTINA O EN CONTRADE LA GUERRA?UNA PLAGA EN LAS CASAS DE AMBOSEL ESTADO Y LA REVOLUCIÓN SOCIALISTA, POR J. MARTOVEl papel de los soviets en la revolución burguesa rusa: El punto de vista de Julio Mártov¿QUÉ ES EL MARXISMO?Rosa LuxemburgoRosa Luxemburgo y la Cuestión NacionalPinochet y SocialismoCómo se diferencia el Movimiento Socialista Mundial de los demás gruposRusia nunca fue SocialistaEl engaño del anti-imperialismoAuges y recesiones económicas: ¿qué los causa?Breve historia del Partido Socialista Mundial de Estados Unidos [WSPUS]Capítulo 1 – El papel cambiante de las mujeresCapítulo 1 – ¿Qué es la naturaleza humana?Capítulo 2 – Los hechos de la vidaCapítulo 2 – ¿En qué está equivocada la teoría feminista?Capítulo 3 – ¿Cómo llegamos aquí?Capítulo 4 – Darwinismo anti-socialCapítulo 5 – ¿Genes para todo?Capítulo 6 – Comportamiento y socialismoHacen nuestros genes imposible el socialismo?La Guerra en GeorgiaDe nuevo es tiempo de eleccionesEl engaño del anti-imperialismoEl marxismo en contraste con el leninismoEl mito de la sociedad transicionalLa cooperación adquiere sentidoLA FUTILIDAD DEL SIONISMOLa Guerra Fria Se Re-CalientaLa leyenda de Marx o “Engels el fundador”Las mujeres y el socialismoLenin, teórico del NacionalismoLevantar el bloqueoLos economistas no son de este planetaLos trabajadores contra los BolcheviquesMartov: social-demócrata ruso¿Nación o Clase?Partido Socialista Mundial -Solicitud de afiliaciónPaz en Palestina es mucho mejor que la guerraPorque los socialistas se opusieron a el Vietcong, y se oponen a los movimientos nacionalistas, al anti-imperialismo, a todo tipo de gobiernos¿Por qué las utilidades tienen prioridad?Posesion Estatal versus Posesion Comun ( o Socialismo )¿Que fue el Fascismo ?Sentando los fundamentosSOCIALISMO Y RELIGIÓNTecnología de la información y socialismoUna sociedad dividida en dos clases socialesUtopía Socialista: ¿Proyecto Realizable O Sueño Inaccesible?¿Que Se Ha De Hacer?¿Qué se ha de hacer? 2Carta abierta a ……El Socialismo nunca ha sido probadoNo seáis ni líderes ni seguidoresPreguntas respondidas -y formuladas¿QUÉ DIABLOS ES EL MARXISMO CULTURAL?EL SOCIALISMO SIN MERCADO ES FACTIBLESE ESTÁ PREPARANDO UNA TORMENTA?EL SOCIALISMO Y LA CUESTIÓN ARANCELARIA ¿A FAVOR DE PALESTINA O EN CONTRADE LA GUERRA? UNA PLAGA EN LAS CASAS DE AMBOS EL ESTADO Y LA REVOLUCIÓN SOCIALISTA, POR J. MARTOV El papel de los soviets en la revolución burguesa rusa: El punto de vista de Julio Mártov ¿QUÉ ES EL MARXISMO? Rosa Luxemburgo Rosa Luxemburgo y la Cuestión Nacional Pinochet y Socialismo Cómo se diferencia el Movimiento Socialista Mundial de los demás grupos Rusia nunca fue Socialista El engaño del anti-imperialismo Auges y recesiones económicas: ¿qué los causa? Breve historia del Partido Socialista Mundial de Estados Unidos [WSPUS] Capítulo 1 – El papel cambiante de las mujeres Capítulo 1 – ¿Qué es la naturaleza humana? Capítulo 2 – Los hechos de la vida Capítulo 2 – ¿En qué está equivocada la teoría feminista? Capítulo 3 – ¿Cómo llegamos aquí? Capítulo 4 – Darwinismo anti-social Capítulo 5 – ¿Genes para todo? Capítulo 6 – Comportamiento y socialismo Hacen nuestros genes imposible el socialismo? La Guerra en Georgia De nuevo es tiempo de elecciones El engaño del anti-imperialismo El marxismo en contraste con el leninismo El mito de la sociedad transicional La cooperación adquiere sentido LA FUTILIDAD DEL SIONISMO La Guerra Fria Se Re-Calienta La leyenda de Marx o “Engels el fundador” Las mujeres y el socialismo Lenin, teórico del Nacionalismo Levantar el bloqueo Los economistas no son de este planeta Los trabajadores contra los Bolcheviques Martov: social-demócrata ruso ¿Nación o Clase? Partido Socialista Mundial -Solicitud de afiliación Paz en Palestina es mucho mejor que la guerra Porque los socialistas se opusieron a el Vietcong, y se oponen a los movimientos nacionalistas, al anti-imperialismo, a todo tipo de gobiernos ¿Por qué las utilidades tienen prioridad? Posesion Estatal versus Posesion Comun ( o Socialismo ) ¿Que fue el Fascismo ? Sentando los fundamentos SOCIALISMO Y RELIGIÓN Tecnología de la información y socialismo Una sociedad dividida en dos clases sociales Utopía Socialista: ¿Proyecto Realizable O Sueño Inaccesible? ¿Que Se Ha De Hacer? ¿Qué se ha de hacer? 2 Carta abierta a …… El Socialismo nunca ha sido probado No seáis ni líderes ni seguidores Preguntas respondidas -y formuladas ¿QUÉ DIABLOS ES EL MARXISMO CULTURAL? EL SOCIALISMO SIN MERCADO ES FACTIBLE SE ESTÁ PREPARANDO UNA TORMENTA? EL SOCIALISMO Y LA CUESTIÓN ARANCELARIA Esperanto“Solidarnosc” erare paŝis (1989)BonvenonĈu utopio aŭ ĥaoso?Demandoj kaj respondojLa Mondsocialisma Movado “Solidarnosc” erare paŝis (1989) Bonvenon Ĉu utopio aŭ ĥaoso? Demandoj kaj respondoj La Mondsocialisma Movado FrançaisArrêtons la machine folle du capitalismeBaisser La Tête Ou Construire L’Espoir?La fin du travail?Un capitalisme européen ou un socialisme mondial?Une Societe Sans ArgentPour le socialisme mondial Arrêtons la machine folle du capitalisme Baisser La Tête Ou Construire L’Espoir? La fin du travail? Un capitalisme européen ou un socialisme mondial? Une Societe Sans Argent Pour le socialisme mondial GlosaPlu qestio e responde de socialismo Plu qestio e responde de socialismo Hindiलोग … या लाभसिद्धांतों की घोषणा लोग … या लाभ सिद्धांतों की घोषणा HrvatskiDobrodošli na stranice WMS-a Dobrodošli na stranice WMS-a ItalianoChe cos’è il SocialismoChe cos’è la proprietà comune?È ancora tempo di elezioniIl bisogno di socialismoLa delusione antimperialistaStiamo andando incontro a una fame di massa?Il socialismo non di mercato è fattibileUn capitalismo europeo o un socialismo mondiale? Che cos’è il Socialismo Che cos’è la proprietà comune? È ancora tempo di elezioni Il bisogno di socialismo La delusione antimperialista Stiamo andando incontro a una fame di massa? Il socialismo non di mercato è fattibile Un capitalismo europeo o un socialismo mondiale? NederlandsDe grondbeginselen van het socialismeEen kijk op de vervuilingproblematiekEuropees kapitalisme of wereldsocialisme?Het ontstaan van de “Socialist Party of Great Britain” (S.P.G.B.)Mensen….of winst?Edgar hardcastle archief De grondbeginselen van het socialisme Een kijk op de vervuilingproblematiek Europees kapitalisme of wereldsocialisme? Het ontstaan van de “Socialist Party of Great Britain” (S.P.G.B.) Mensen….of winst? Edgar hardcastle archief NorskOm oss selv Om oss selv PolskaAnarchizm-a cóź to nowego?Dlaczego system zysków musi odejść?Na pomoc jesteś w klatcePrzyszłość pracyTo jest socjalizmZnowu wybory Anarchizm-a cóź to nowego? Dlaczego system zysków musi odejść? Na pomoc jesteś w klatce Przyszłość pracy To jest socjalizm Znowu wybory PortuguêsO Movimento Socialista Mundial O Movimento Socialista Mundial SvenskaFria resor i Köpenhamn?Lenin: bara en rysk revolutionärMyten om övergångssamhället av A. BuickNu är det val igenSocialdemokraterna- ett kapitalistiskt partiSocialism betyderSocialism betyder fri tillgångTrotskisterna och statskapitalismenUttalande till en tysk arbetarkonferens i Augsburg (1969) Fria resor i Köpenhamn? Lenin: bara en rysk revolutionär Myten om övergångssamhället av A. Buick Nu är det val igen Socialdemokraterna- ett kapitalistiskt parti Socialism betyder Socialism betyder fri tillgång Trotskisterna och statskapitalismen Uttalande till en tysk arbetarkonferens i Augsburg (1969) TagalogANG SOSYALISMO Isang Mabilis na Sangguniang PatnubayANO ANG KAIBAHAN NG KILUSANG PANDAIGDIGANG SOSYALISTA (WORLD SOCIALIST MOVEMENT) KAYSA IBANG MGA PANGKATIN?ANO ANG MGA KADAHILANAN NG KAHIRAPAN SA MUNDO?MGA LAYUNIN AT SIMULAIN IMGA LAYUNIN AT SIMULAIN II ANG SOSYALISMO Isang Mabilis na Sangguniang Patnubay ANO ANG KAIBAHAN NG KILUSANG PANDAIGDIGANG SOSYALISTA (WORLD SOCIALIST MOVEMENT) KAYSA IBANG MGA PANGKATIN? ANO ANG MGA KADAHILANAN NG KAHIRAPAN SA MUNDO? MGA LAYUNIN AT SIMULAIN I MGA LAYUNIN AT SIMULAIN II TürkçeDünya sosyalızım hakkinda sorulardünya sosyalzm hakkinda sorular ve yanitlarİnsan ya da Kâr? Dünya sosyalızım hakkinda sorulardünya sosyalzm hakkinda sorular ve yanitlar İnsan ya da Kâr? ΕλληνικάΕΝΑ ΔΙΑΦΟΡΕΤΙΚΟ ΕΙΔΟΣ ΠΟΛΙΤΙΚΗΣΠαρουσιάζοντας το Παγκόσμιο Σοσιαλιστικό ΚίνημαΠροβλήματα και λύσειςΤι είναι Σοσιαλισμός ΕΝΑ ΔΙΑΦΟΡΕΤΙΚΟ ΕΙΔΟΣ ΠΟΛΙΤΙΚΗΣ Παρουσιάζοντας το Παγκόσμιο Σοσιαλιστικό Κίνημα Προβλήματα και λύσεις Τι είναι Σοσιαλισμός Русский языкMoжет ли социалист быть националистом?Война как бизнесИсповедь патриота: я всегда готов умереть за всякой страныМиф советского социализмаУТВЕРЖДЕНИЕ ПРИНЦИПОВ ДВИЖЕНИЯ ЗА МИРОВОЙ СОЦИАЛИЗМ Moжет ли социалист быть националистом? Война как бизнес Исповедь патриота: я всегда готов умереть за всякой страны Миф советского социализма УТВЕРЖДЕНИЕ ПРИНЦИПОВ ДВИЖЕНИЯ ЗА МИРОВОЙ СОЦИАЛИЗМ עבריתמה זה קפיטליזם? מה זה קפיטליזם? বাংলাDarwin 1Darwin 2 Darwin 1 Darwin 2 日本 語世 界社会主義運動（WSM）の「目標と原則宣言」 世 界社会主義運動（WSM）の「目標と原則宣言」 CeskáNěkteré aspekty Marxovy politické ekonomieSocialismus Některé aspekty Marxovy politické ekonomie Socialismus Některé aspekty Marxovy politické ekonomie Socialismus CymraegSOSIALAETH: Y BYD YN UN SOSIALAETH: Y BYD YN UN SOSIALAETH: Y BYD YN UN DeutschAnmerkungen der Sozialistischen Partei zur Europawahl 2009Die solidarische Gesellschaft, das unbekannte WesenKinderkramMarktwirtschaftEuropäischer Kapitalismus oder weltweiter Sozialismus?WeltsozialismusDie Probleme der heutigen Gesellschaft und ihre Ursache. (1949) Anmerkungen der Sozialistischen Partei zur Europawahl 2009 Die solidarische Gesellschaft, das unbekannte Wesen Kinderkram Marktwirtschaft Europäischer Kapitalismus oder weltweiter Sozialismus? Weltsozialismus Die Probleme der heutigen Gesellschaft und ihre Ursache. (1949) Anmerkungen der Sozialistischen Partei zur Europawahl 2009 Die solidarische Gesellschaft, das unbekannte Wesen Kinderkram Marktwirtschaft Europäischer Kapitalismus oder weltweiter Sozialismus? Weltsozialismus Die Probleme der heutigen Gesellschaft und ihre Ursache. (1949) Español¿A FAVOR DE PALESTINA O EN CONTRADE LA GUERRA?UNA PLAGA EN LAS CASAS DE AMBOSEL ESTADO Y LA REVOLUCIÓN SOCIALISTA, POR J. MARTOVEl papel de los soviets en la revolución burguesa rusa: El punto de vista de Julio Mártov¿QUÉ ES EL MARXISMO?Rosa LuxemburgoRosa Luxemburgo y la Cuestión NacionalPinochet y SocialismoCómo se diferencia el Movimiento Socialista Mundial de los demás gruposRusia nunca fue SocialistaEl engaño del anti-imperialismoAuges y recesiones económicas: ¿qué los causa?Breve historia del Partido Socialista Mundial de Estados Unidos [WSPUS]Capítulo 1 – El papel cambiante de las mujeresCapítulo 1 – ¿Qué es la naturaleza humana?Capítulo 2 – Los hechos de la vidaCapítulo 2 – ¿En qué está equivocada la teoría feminista?Capítulo 3 – ¿Cómo llegamos aquí?Capítulo 4 – Darwinismo anti-socialCapítulo 5 – ¿Genes para todo?Capítulo 6 – Comportamiento y socialismoHacen nuestros genes imposible el socialismo?La Guerra en GeorgiaDe nuevo es tiempo de eleccionesEl engaño del anti-imperialismoEl marxismo en contraste con el leninismoEl mito de la sociedad transicionalLa cooperación adquiere sentidoLA FUTILIDAD DEL SIONISMOLa Guerra Fria Se Re-CalientaLa leyenda de Marx o “Engels el fundador”Las mujeres y el socialismoLenin, teórico del NacionalismoLevantar el bloqueoLos economistas no son de este planetaLos trabajadores contra los BolcheviquesMartov: social-demócrata ruso¿Nación o Clase?Partido Socialista Mundial -Solicitud de afiliaciónPaz en Palestina es mucho mejor que la guerraPorque los socialistas se opusieron a el Vietcong, y se oponen a los movimientos nacionalistas, al anti-imperialismo, a todo tipo de gobiernos¿Por qué las utilidades tienen prioridad?Posesion Estatal versus Posesion Comun ( o Socialismo )¿Que fue el Fascismo ?Sentando los fundamentosSOCIALISMO Y RELIGIÓNTecnología de la información y socialismoUna sociedad dividida en dos clases socialesUtopía Socialista: ¿Proyecto Realizable O Sueño Inaccesible?¿Que Se Ha De Hacer?¿Qué se ha de hacer? 2Carta abierta a ……El Socialismo nunca ha sido probadoNo seáis ni líderes ni seguidoresPreguntas respondidas -y formuladas¿QUÉ DIABLOS ES EL MARXISMO CULTURAL?EL SOCIALISMO SIN MERCADO ES FACTIBLESE ESTÁ PREPARANDO UNA TORMENTA?EL SOCIALISMO Y LA CUESTIÓN ARANCELARIA ¿A FAVOR DE PALESTINA O EN CONTRADE LA GUERRA? UNA PLAGA EN LAS CASAS DE AMBOS EL ESTADO Y LA REVOLUCIÓN SOCIALISTA, POR J. MARTOV El papel de los soviets en la revolución burguesa rusa: El punto de vista de Julio Mártov ¿QUÉ ES EL MARXISMO? Rosa Luxemburgo Rosa Luxemburgo y la Cuestión Nacional Pinochet y Socialismo Cómo se diferencia el Movimiento Socialista Mundial de los demás grupos Rusia nunca fue Socialista El engaño del anti-imperialismo Auges y recesiones económicas: ¿qué los causa? Breve historia del Partido Socialista Mundial de Estados Unidos [WSPUS] Capítulo 1 – El papel cambiante de las mujeres Capítulo 1 – ¿Qué es la naturaleza humana? Capítulo 2 – Los hechos de la vida Capítulo 2 – ¿En qué está equivocada la teoría feminista? Capítulo 3 – ¿Cómo llegamos aquí? Capítulo 4 – Darwinismo anti-social Capítulo 5 – ¿Genes para todo? Capítulo 6 – Comportamiento y socialismo Hacen nuestros genes imposible el socialismo? La Guerra en Georgia De nuevo es tiempo de elecciones El engaño del anti-imperialismo El marxismo en contraste con el leninismo El mito de la sociedad transicional La cooperación adquiere sentido LA FUTILIDAD DEL SIONISMO La Guerra Fria Se Re-Calienta La leyenda de Marx o “Engels el fundador” Las mujeres y el socialismo Lenin, teórico del Nacionalismo Levantar el bloqueo Los economistas no son de este planeta Los trabajadores contra los Bolcheviques Martov: social-demócrata ruso ¿Nación o Clase? Partido Socialista Mundial -Solicitud de afiliación Paz en Palestina es mucho mejor que la guerra Porque los socialistas se opusieron a el Vietcong, y se oponen a los movimientos nacionalistas, al anti-imperialismo, a todo tipo de gobiernos ¿Por qué las utilidades tienen prioridad? Posesion Estatal versus Posesion Comun ( o Socialismo ) ¿Que fue el Fascismo ? Sentando los fundamentos SOCIALISMO Y RELIGIÓN Tecnología de la información y socialismo Una sociedad dividida en dos clases sociales Utopía Socialista: ¿Proyecto Realizable O Sueño Inaccesible? ¿Que Se Ha De Hacer? ¿Qué se ha de hacer? 2 Carta abierta a …… El Socialismo nunca ha sido probado No seáis ni líderes ni seguidores Preguntas respondidas -y formuladas ¿QUÉ DIABLOS ES EL MARXISMO CULTURAL? EL SOCIALISMO SIN MERCADO ES FACTIBLE SE ESTÁ PREPARANDO UNA TORMENTA? EL SOCIALISMO Y LA CUESTIÓN ARANCELARIA ¿A FAVOR DE PALESTINA O EN CONTRADE LA GUERRA? UNA PLAGA EN LAS CASAS DE AMBOS EL ESTADO Y LA REVOLUCIÓN SOCIALISTA, POR J. MARTOV El papel de los soviets en la revolución burguesa rusa: El punto de vista de Julio Mártov ¿QUÉ ES EL MARXISMO? Rosa Luxemburgo Rosa Luxemburgo y la Cuestión Nacional Pinochet y Socialismo Cómo se diferencia el Movimiento Socialista Mundial de los demás grupos Rusia nunca fue Socialista El engaño del anti-imperialismo Auges y recesiones económicas: ¿qué los causa? Breve historia del Partido Socialista Mundial de Estados Unidos [WSPUS] Capítulo 1 – El papel cambiante de las mujeres Capítulo 1 – ¿Qué es la naturaleza humana? Capítulo 2 – Los hechos de la vida Capítulo 2 – ¿En qué está equivocada la teoría feminista? Capítulo 3 – ¿Cómo llegamos aquí? Capítulo 4 – Darwinismo anti-social Capítulo 5 – ¿Genes para todo? Capítulo 6 – Comportamiento y socialismo Hacen nuestros genes imposible el socialismo? La Guerra en Georgia De nuevo es tiempo de elecciones El engaño del anti-imperialismo El marxismo en contraste con el leninismo El mito de la sociedad transicional La cooperación adquiere sentido LA FUTILIDAD DEL SIONISMO La Guerra Fria Se Re-Calienta La leyenda de Marx o “Engels el fundador” Las mujeres y el socialismo Lenin, teórico del Nacionalismo Levantar el bloqueo Los economistas no son de este planeta Los trabajadores contra los Bolcheviques Martov: social-demócrata ruso ¿Nación o Clase? Partido Socialista Mundial -Solicitud de afiliación Paz en Palestina es mucho mejor que la guerra Porque los socialistas se opusieron a el Vietcong, y se oponen a los movimientos nacionalistas, al anti-imperialismo, a todo tipo de gobiernos ¿Por qué las utilidades tienen prioridad? Posesion Estatal versus Posesion Comun ( o Socialismo ) ¿Que fue el Fascismo ? Sentando los fundamentos SOCIALISMO Y RELIGIÓN Tecnología de la información y socialismo Una sociedad dividida en dos clases sociales Utopía Socialista: ¿Proyecto Realizable O Sueño Inaccesible? ¿Que Se Ha De Hacer? ¿Qué se ha de hacer? 2 Carta abierta a …… El Socialismo nunca ha sido probado No seáis ni líderes ni seguidores Preguntas respondidas -y formuladas ¿QUÉ DIABLOS ES EL MARXISMO CULTURAL? EL SOCIALISMO SIN MERCADO ES FACTIBLE SE ESTÁ PREPARANDO UNA TORMENTA? EL SOCIALISMO Y LA CUESTIÓN ARANCELARIA Esperanto“Solidarnosc” erare paŝis (1989)BonvenonĈu utopio aŭ ĥaoso?Demandoj kaj respondojLa Mondsocialisma Movado “Solidarnosc” erare paŝis (1989) Bonvenon Ĉu utopio aŭ ĥaoso? Demandoj kaj respondoj La Mondsocialisma Movado “Solidarnosc” erare paŝis (1989) Bonvenon Ĉu utopio aŭ ĥaoso? Demandoj kaj respondoj La Mondsocialisma Movado FrançaisArrêtons la machine folle du capitalismeBaisser La Tête Ou Construire L’Espoir?La fin du travail?Un capitalisme européen ou un socialisme mondial?Une Societe Sans ArgentPour le socialisme mondial Arrêtons la machine folle du capitalisme Baisser La Tête Ou Construire L’Espoir? La fin du travail? Un capitalisme européen ou un socialisme mondial? Une Societe Sans Argent Pour le socialisme mondial Arrêtons la machine folle du capitalisme Baisser La Tête Ou Construire L’Espoir? La fin du travail? Un capitalisme européen ou un socialisme mondial? Une Societe Sans Argent Pour le socialisme mondial GlosaPlu qestio e responde de socialismo Plu qestio e responde de socialismo Plu qestio e responde de socialismo Hindiलोग … या लाभसिद्धांतों की घोषणा लोग … या लाभ सिद्धांतों की घोषणा लोग … या लाभ सिद्धांतों की घोषणा HrvatskiDobrodošli na stranice WMS-a Dobrodošli na stranice WMS-a Dobrodošli na stranice WMS-a ItalianoChe cos’è il SocialismoChe cos’è la proprietà comune?È ancora tempo di elezioniIl bisogno di socialismoLa delusione antimperialistaStiamo andando incontro a una fame di massa?Il socialismo non di mercato è fattibileUn capitalismo europeo o un socialismo mondiale? Che cos’è il Socialismo Che cos’è la proprietà comune? È ancora tempo di elezioni Il bisogno di socialismo La delusione antimperialista Stiamo andando incontro a una fame di massa? Il socialismo non di mercato è fattibile Un capitalismo europeo o un socialismo mondiale? Che cos’è il Socialismo Che cos’è la proprietà comune? È ancora tempo di elezioni Il bisogno di socialismo La delusione antimperialista Stiamo andando incontro a una fame di massa? Il socialismo non di mercato è fattibile Un capitalismo europeo o un socialismo mondiale? NederlandsDe grondbeginselen van het socialismeEen kijk op de vervuilingproblematiekEuropees kapitalisme of wereldsocialisme?Het ontstaan van de “Socialist Party of Great Britain” (S.P.G.B.)Mensen….of winst?Edgar hardcastle archief De grondbeginselen van het socialisme Een kijk op de vervuilingproblematiek Europees kapitalisme of wereldsocialisme? Het ontstaan van de “Socialist Party of Great Britain” (S.P.G.B.) Mensen….of winst? Edgar hardcastle archief De grondbeginselen van het socialisme Een kijk op de vervuilingproblematiek Europees kapitalisme of wereldsocialisme? Het ontstaan van de “Socialist Party of Great Britain” (S.P.G.B.) Mensen….of winst? Edgar hardcastle archief NorskOm oss selv Om oss selv Om oss selv PolskaAnarchizm-a cóź to nowego?Dlaczego system zysków musi odejść?Na pomoc jesteś w klatcePrzyszłość pracyTo jest socjalizmZnowu wybory Anarchizm-a cóź to nowego? Dlaczego system zysków musi odejść? Na pomoc jesteś w klatce Przyszłość pracy To jest socjalizm Znowu wybory Anarchizm-a cóź to nowego? Dlaczego system zysków musi odejść? Na pomoc jesteś w klatce Przyszłość pracy To jest socjalizm Znowu wybory PortuguêsO Movimento Socialista Mundial O Movimento Socialista Mundial O Movimento Socialista Mundial SvenskaFria resor i Köpenhamn?Lenin: bara en rysk revolutionärMyten om övergångssamhället av A. BuickNu är det val igenSocialdemokraterna- ett kapitalistiskt partiSocialism betyderSocialism betyder fri tillgångTrotskisterna och statskapitalismenUttalande till en tysk arbetarkonferens i Augsburg (1969) Fria resor i Köpenhamn? Lenin: bara en rysk revolutionär Myten om övergångssamhället av A. Buick Nu är det val igen Socialdemokraterna- ett kapitalistiskt parti Socialism betyder Socialism betyder fri tillgång Trotskisterna och statskapitalismen Uttalande till en tysk arbetarkonferens i Augsburg (1969) Fria resor i Köpenhamn? Lenin: bara en rysk revolutionär Myten om övergångssamhället av A. Buick Nu är det val igen Socialdemokraterna- ett kapitalistiskt parti Socialism betyder Socialism betyder fri tillgång Trotskisterna och statskapitalismen Uttalande till en tysk arbetarkonferens i Augsburg (1969) TagalogANG SOSYALISMO Isang Mabilis na Sangguniang PatnubayANO ANG KAIBAHAN NG KILUSANG PANDAIGDIGANG SOSYALISTA (WORLD SOCIALIST MOVEMENT) KAYSA IBANG MGA PANGKATIN?ANO ANG MGA KADAHILANAN NG KAHIRAPAN SA MUNDO?MGA LAYUNIN AT SIMULAIN IMGA LAYUNIN AT SIMULAIN II ANG SOSYALISMO Isang Mabilis na Sangguniang Patnubay ANO ANG KAIBAHAN NG KILUSANG PANDAIGDIGANG SOSYALISTA (WORLD SOCIALIST MOVEMENT) KAYSA IBANG MGA PANGKATIN? ANO ANG MGA KADAHILANAN NG KAHIRAPAN SA MUNDO? MGA LAYUNIN AT SIMULAIN I MGA LAYUNIN AT SIMULAIN II ANG SOSYALISMO Isang Mabilis na Sangguniang Patnubay ANO ANG KAIBAHAN NG KILUSANG PANDAIGDIGANG SOSYALISTA (WORLD SOCIALIST MOVEMENT) KAYSA IBANG MGA PANGKATIN? ANO ANG MGA KADAHILANAN NG KAHIRAPAN SA MUNDO? MGA LAYUNIN AT SIMULAIN I MGA LAYUNIN AT SIMULAIN II TürkçeDünya sosyalızım hakkinda sorulardünya sosyalzm hakkinda sorular ve yanitlarİnsan ya da Kâr? Dünya sosyalızım hakkinda sorulardünya sosyalzm hakkinda sorular ve yanitlar İnsan ya da Kâr? Dünya sosyalızım hakkinda sorulardünya sosyalzm hakkinda sorular ve yanitlar İnsan ya da Kâr? ΕλληνικάΕΝΑ ΔΙΑΦΟΡΕΤΙΚΟ ΕΙΔΟΣ ΠΟΛΙΤΙΚΗΣΠαρουσιάζοντας το Παγκόσμιο Σοσιαλιστικό ΚίνημαΠροβλήματα και λύσειςΤι είναι Σοσιαλισμός ΕΝΑ ΔΙΑΦΟΡΕΤΙΚΟ ΕΙΔΟΣ ΠΟΛΙΤΙΚΗΣ Παρουσιάζοντας το Παγκόσμιο Σοσιαλιστικό Κίνημα Προβλήματα και λύσεις Τι είναι Σοσιαλισμός ΕΝΑ ΔΙΑΦΟΡΕΤΙΚΟ ΕΙΔΟΣ ΠΟΛΙΤΙΚΗΣ Παρουσιάζοντας το Παγκόσμιο Σοσιαλιστικό Κίνημα Προβλήματα και λύσεις Τι είναι Σοσιαλισμός Русский языкMoжет ли социалист быть националистом?Война как бизнесИсповедь патриота: я всегда готов умереть за всякой страныМиф советского социализмаУТВЕРЖДЕНИЕ ПРИНЦИПОВ ДВИЖЕНИЯ ЗА МИРОВОЙ СОЦИАЛИЗМ Moжет ли социалист быть националистом? Война как бизнес Исповедь патриота: я всегда готов умереть за всякой страны Миф советского социализма УТВЕРЖДЕНИЕ ПРИНЦИПОВ ДВИЖЕНИЯ ЗА МИРОВОЙ СОЦИАЛИЗМ Moжет ли социалист быть националистом? Война как бизнес Исповедь патриота: я всегда готов умереть за всякой страны Миф советского социализма УТВЕРЖДЕНИЕ ПРИНЦИПОВ ДВИЖЕНИЯ ЗА МИРОВОЙ СОЦИАЛИЗМ עבריתמה זה קפיטליזם? מה זה קפיטליזם? מה זה קפיטליזם? বাংলাDarwin 1Darwin 2 Darwin 1 Darwin 2 Darwin 1 Darwin 2 日本 語世 界社会主義運動（WSM）の「目標と原則宣言」 世 界社会主義運動（WSM）の「目標と原則宣言」 世 界社会主義運動（WSM）の「目標と原則宣言」 Contact 21st May 2025Por un mundo de acceso libre 21st May 2025For a world of free‭ ‬access 12th May 2025New Multilingual Website 18th December 2024New Spanish Translation – Socialism and the Tariff Issue 3rd December 2024New translations 25th November 2024New Spanish Translation: Non-market socialism is feasible **** Home Исповедь патриота: я всегда готов умереть за всякой страны **Исповедь патриота: я всегда готов умереть за всякой страны** 17th March 2019 Как настоящий патриот, я был бы рад умереть в боем за своей родины. Я люблю свою страну больше, чем саму жизнь. Но я тоже был бы очень рад умереть во имя, скажем, Ирландии, Панамы, Японии, Российской Федерации или Чешской Республики. Наиболее грандиозное действие – это отдать свою жизнь за своей собственной страны. Или за другой страны. Главное – за какой-нибудь страны. Как те славные герои, которые пролили свою кровь в борьбе за независимость северо-американских штатов от Британской Империи, я всегда готов пожертвовать всë за священное право быть подчинены политикам в своей собственной столице а не в какой-то другой столице в незнакомом месте. Нет ничего более сладко и красиво, чем умереть за своей страны, за соседной страны или за какой-то другой страны! Действительно, есть очень много стран в мире, каждая из которых достойна моей смерти. Я сожалею только, что у меня лишь одна жизнь, что я могу умереть только за одной страны и не за всех, как хотелось бы. Я готов без колебаний отдать свою жизнь за или против всякой благородной нации – даже в перекрестном огне каких-то миротворческих сил, если только моя смерть каким-то образом связана со страной какого-то рода. Как мне лучше продемонстрировать свой глубочайший патриотизм? Нынешние государственные границы надо защищать всякой ценой. Когда эти границы будут перемещаться, надо будет защищать новые границы всякой ценой. Вот мой священный долг как патриот. Иначе, за что умерли столько патриотических героев? Простите меня, дорогие друзья, если как-то я ошибаюсь и защищаю уже изменивяиеся границы. Умереть зря, за ошибку, за ничего – какая страшная судьба! Мне повезло: я имел честь родиться в одной из двухсот величайших стран мира. Уже давно я внутренне решился никогда не забывать об этом, ни при никаких обстоятельствах! Я надеюсь, что у меня будет возможность защищать эту великую страну против тех, кто хотели бы причинить ей вред. Или защищать какую-то другую великую страну против тех, кто хотели бы причинить ей вред. Или наоборот. Моя вдова и дети найдут утешение в знании того, что я умер во имя какого-то великого дела, близкого сердцам граждан той или другой нации – не важно какой. Я прошу похороны достойные солдата и патриота. В могиле хочу крепко держать в руке флаг той страны за которой боролся и умер. Когда я умру на службе той или другой страны, я буду думать с удовольствием но и с уважением o тех врагах, которых я убил. Ведь они тоже умрут за какой-то страны, как герои и патриоты. Верность какой-то стране – высшая ценность. ONN, 2-ое ноября 2008 г. (перевод статьи на сайтe Мировой Социалистической Партии США, под рубрикой «юмор») **WSM Companion Parties** Canada – SPCGreat Britain – SPGBIndia – WSPINew Zealand – WSPNZUSA – WSPUS **Free Socialist Literature** Submit form atwspus.org Submit form atSPGB **Socialist Party of Canada** Official website of theSocialist Party of Canada Journal of the SPC With several articles in French-Canadian For more reading, the Socialist Fulcum 1968-1984, atSocialist Fulcrum – Socialist Party of Canada (libcom.org) WORLD SOCIALIST PARTY (NEW ZEALAND) The World Socialist Party (New Zealand) was formed in 1930 as the Socialist Party of New Zealand, then, later added the word “World” to its name. Website:Home - World Socialist Party (NZ) (worldsocialism.org) **Archives** May 2025 December 2024 November 2024 October 2024 August 2024 May 2024 September 2023 August 2023 July 2023 June 2023 March 2023 February 2023 January 2023 December 2022 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 January 2021 December 2020 November 2020 October 2020 May 2020 April 2020 March 2020 January 2020 December 2019 November 2019 October 2019 August 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 November 2018 **** **** | Powered byWordPress| Theme byTheBootstrapThemes"}