{"id": 728, "name": "Jewish Telegraphic Agency (JTA)", "domain": "jta.org", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.jta.org/2025/06/10/united-states/brooklyn-pride-interfaith-service-cancelled-allegedly-over-synagogues-public-alignment-with-pro-israel-positions", "title": "Brooklyn Pride Interfaith Service Cancelled Allegedly Over Synagogues Public Alignment With Pro Israel Positions", "content": "**Sections** US Israel Global New York Obituaries Culture Sports Ideas Politics Food Archive Teen Fellowship **Get JTA in your inbox** By submitting the above I agree to theprivacy policyandtermsof use of JTA.org US Israel Global Politics Sports New York **Brooklyn Pride interfaith service canceled, allegedly over synagogue’s ‘public alignment with pro-Israel positions’** Kane Street Synagogue’s rabbi wrote that she was “crushed/offended” by the “discriminatory decision” to cancel the event. **Share this:** Twitter Facebook WhatsApp Email The Brooklyn 2025 Pride festivities will not include an interfaith service this year after at least one group allegedly pulled out due to the hosting synagogue’s “public alignment with pro-Israel political positions.” Kane Street Synagogue, a historic Conservative synagogue in Brooklyn, was set to host the 15th annual interfaith service on Wednesday before it was canceled last week. Mickey Heller, a co-chair of Brooklyn Pride, said the cancellation followed low registration and after a number of participating organizations and choirs had “for whatever reason” said they were unable to attend this year. In an email to Kane Street congregants on Friday,Rabbi Michelle Dardashtisaid that while the reason stated by organizers for the cancellation of the interfaith service was an inability to “garner sufficient involvement,” an email sent by one participating musical group cited the synagogue’s Israel politics. “The leader of one of the musical groups which pulled out shared that, indeed, they did so both because many in their community (largely comprised on LGBT people of color and also immigrants) feel uncomfortable with police presence and also, that ‘we were also made aware of Kane Street Synagogue’s public alignment with pro-Israel political positions,’” the email read. Dardashti’s email did not name the group that she quoted. Kane Street’s leadership declined to comment further. Of the groups that participated in the service last year, only one responded to inquiries from the Jewish Telegraphic Agency. Rev. Micah Ma of the First Unitarian Congregational Society of Brooklyn, whose choir sang at last year’s service, declined to comment. The cancellation of Brooklyn Pride’s interfaith service comes as Pride celebrations commence throughout the nation — along with clashes over the Israeli-Palestinian conflict. In recent years, as queer activism has grown increasingly aligned with anti-Zionism, some Jews in the LGBTQ community havefaced exclusion from Pride celebrations. At San Diego Pride this year,all participating Jewish groups pulled out of the festivitiesover the headlining performance byR&B singer Kehlani, whom they accused of antisemitism for herpro-Palestinian stances. New York City’s Dyke March has alsofaced scrutiny from Jewish participantswho have felt alienated by the march’s anti-Zionist stances. Last year, the march’s annual event was titled “Dykes Against Genocide,” which spurred agroup of Jewish lesbians to host their own Pride party. In an interview, Heller said the registration for this year’s Brooklyn Pride interfaith service had only two registrations a week before its scheduled date, while in past years it would have had “at least close to 100” at that point. He said that he could not speak to individual groups’ issues with Kane Street, saying that it would be “unfair” to those organizations, and attributed the cancellation to a lack of interest. “It’s very difficult to speculate as to why,” Heller said. “I’ll only say that there’s a lot going on all over the country these days, and there are some very disturbing ripples going on, and sadly, at this time, when we really do need to all come together, people are getting afraid.” Past participants in the interfaith Pride service included several choirs as well as Jewish, Christian, Muslim and Zen Buddhist leaders. The list of participants for this year’s interfaith service was not available online after the cancellation. A Pride flyer distributed by a Brooklyn church advertised the interfaith service scheduled for Kane Street Synagogue. (Screenshot) Heller told JTA that he did not personally have information on the participants, and suggested that Brooklyn Pride could not comment on who the participants would have been due to confidentiality concerns. In the email to her congregation, Dardashti wrote she was “crushed/offended” by the “discriminatory decision” to cancel the event. “I was both grateful for the transparency (and that this person had ‘replied all’ to the thread) and also crushed/offended by the many assumptions made and the discriminatory decision to cancel without taking time to reach out and inquire or discuss,” she wrote. Dardashti lamented the cancellation and articulated Kane Street’s ties to Israel in an email to the group of clergy and musicians who would have participated in the interfaith service, which she excerpted in her email to congregants. “I’m saddened that this event has become an example of bridges burned rather than built,” she wrote, adding, “I would be glad to share with you — with any of you — about our community; about the deep and complex relationships to Israel our members hold and our broad rejection of the current Israeli administration; about prayers we recite weekly for a cessation of the violence, return of the hostages and salvation for the civilians in Gaza; and about the Jewish community more broadly.” Dardashti — who isthe founder of a nonprofit aimed at improving discourse about Israel and antisemitism among Jews— told her congregants that she had also shareda recent New York Times op-edabout how recent attacks have exacerbated the fear that Jews are feeling. “I explained that Jews are not only being vilified for any association with Israel (as Kane Street was by them in this instance and as is, sadly, not new), but also violently targeted as a result of that association, and that these extreme recent physical attacks are coming from the anti-Zionists,” she wrote. Heller said Brooklyn Pride hopes to resume the interfaith service next year. He also said he was sorry that this year’s celebration had been canceled so abruptly. “As the chair of Brooklyn Pride, I want to apologize to all people who have been so supportive to our interfaith over the years. I do want to give words of encouragement to everybody, I don’t want to say especially our Jewish congregation members, but everybody, because we are in a time that is become, for certain reasons, fairly divisive,” Heller said. He continued, “And it’s in those times when we have to, no matter who we are, we have to allow our lights to shine and come together and support each other, because there’s a lot more we need to band together about than we need to bring us apart.” **Share this:** Twitter Facebook WhatsApp Email JTA has documentedJewish history in real-timefor over a century.Keep our journalism strongby joining us in supporting independent, award-winning reporting. **Recommended from JTA** **California ICE protests spark calls for ‘nonviolence’ from Jewish community leaders** **Arizona governor vetoes bill that would let parents sue teachers over antisemitism** **I joined the crowds for Boulder’s Run for Their Lives on Sunday. I’m worried about next week.** **The head of a new RFK Jr. support group believes the Protocols of the Elders of Zion are real** **Marjorie Taylor Greene and Rashida Tlaib vote ‘present’ on resolution to condemn antisemitic attacks** **The Latest** California ICE protests spark calls for ‘nonviolence’ from Jewish community leaders 10,000 free copies of ‘The Diary of Anne Frank’ will be distributed to New Yorkers this summer Arizona governor vetoes bill that would let parents sue teachers over antisemitism Another Irish band airs pro-Palestinian message at festival: ‘Israel is committing genocide’ The head of a new RFK Jr. support group believes the Protocols of the Elders of Zion are real Meet Theo Von, the mega-popular podcaster who asked JD Vance about Israel’s ‘genocide’ in Gaza **Get JTA in your inbox** By submitting the above I agree to theprivacy policyandtermsof use of JTA.org Instagram Facebook Twitter YouTube About Us Syndication Contact Newsletters Advertise Donate **Get JTA in your inbox** I accept thePrivacy Policy. Jewish Telegraphic Agency New York Jewish Week The Nosher Kveller Hey Alma My Jewish Learning Privacy Policy Terms of Use and Re-Using Content"}