{"id": 1234, "name": "Selma Times-Journal", "domain": "selmatimesjournal.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.selmatimesjournal.com/2025/06/08/bishop-being-master-of-your-mouth-and-eyes-protects-your-heart/", "title": "Bishop Being Master Of Your Mouth And Eyes Protects Your Heart", "content": "Home NewsBusinessRecordsFaith Business Records Faith Business Records Faith Sports Opinion Obituaries Lifestyles Contests Selma The Magazine Classifieds Public Notices ServicesAbout UsDelivery ProblemsSocial MediaFacebookTwitterInstagram About Us Delivery Problems Social MediaFacebookTwitterInstagram Facebook Twitter Instagram About Us Delivery Problems Social MediaFacebookTwitterInstagram Facebook Twitter Instagram Facebook Twitter Instagram E-Edition **BISHOP: Being master of your mouth and eyes protects your heart** Published 9:47 am Sunday, June 8, 2025 ByGuest Columnist 16 “You shall not bear false witness against your neighbor. 17 “You shall not covet your neighbor’s house; you shall not covet your neighbor’s wife, nor his male servant, nor his female servant, nor his ox, nor his donkey, nor anything that is your neighbor’s.” — Exodus 20:16-17 (NKJV) **By Austin Bishop** **Email newsletter signup** How we treat all people is important to God. That goes double for those who our actions affect on a daily basis. Being a Christian involves being part of a community and having a constant desire to not only improve our relationships with those inside of the community but grow it by having a positive impact on those on the outside. The tongue, and how we use it, is a powerful weapon that can both draw people to the Body of Christ and can also, when misused, cause great damage to our witness and cripple our effectiveness. What you say, and how you say it, matters. Only allow the truth to come out of your mouth. Remember, your opinion may not always be the truth. Often, it’s just your perception of it. Carefully and prayerfully gauge and temper your words when talking to, or about, others. Know what you are talking about and stay away from assumptions. It’s possible to give false testimony without realizing it is false. You don’t always have to share all of the information you obtain. Put what you hear and see in perspective and measure your response against the Word of God. Don’t form your opinions upon what others tell you about a person or situation, but on what the Holy Spirit reveals to you from the accurate information you have gathered. While verse 16 teaches us to be wise about what we say about others, verse 17 warns us to guard about letting what those around us possess affect our thoughts, actions, attitudes, and desires. Being consumed with a heart for what the world offers opens the door to the spiritual disease of covetousness. It is a real and deadly thing. The insatiable longing and desire for something that does not belong to you will snuff out your spiritual light. Covetousness will lead us to a spiritual grave, not the altar where we belong. Lust, greed, and dissatisfaction are chief among the tools the enemy uses to both distract and destroy us. Focus on what God has for you, not what He has chosen to give others. Keeping your eyes on the gifts, talents, or possessions of those around you, will pull your focus away from the true prize, which is an eternal relationship with Jesus Christ. Remember: A glance can become a stare and a stare can morph into an obsession. Keep your heart pure and your eyes focused on your personal relationship with God. Do that, and everything else will fall into place. Austin Bishop is an ordained minister and has been a journalist for 50 years. Those wishing to receive his daily devotional/Bible study notes may sign up by texting @morning24 to 81010. He can be reached by e-mail at starsportsboss@yahoo.com. **Selma Food Bank schedules giveaway event at Selma University** **Community Calendar for June 1** **Brown Chapel AME honored at awards dinner in NY** **Van Sprague: A Leader Stands** Home News Sports Obituaries Opinion Records Classifieds Small Business About Us Subscriptions © 2025, The Selma Times‑Journal"}