{"id": 1180, "name": "La Repubblica", "domain": "repubblica.it", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.repubblica.it/cronaca/dossier/universit-2025-2026/2025/05/17/news/ingegneria_della_creativita_digitale_e_scienze_dell_architettura_per_il_patrimonio_nuovi_corsi_del_politecnico_di_bari-424211051/", "title": "Ingegneria_della_creativita_digitale_e_scienze_dell_architettura_per_il_patrimonio_nuovi_corsi_del_politecnico_di_bari 424211051", "content": "Contenuti per gli abbonati Tutte le offerte SezioniPoliticaEconomiaEsteriItaliaCronacaCommentiScuolaCulturaSportSpettacoliSerie TVVideoMetropolisRubrichePodcastSaluteGreen&BlueItalian TechIl GustoLa ZampaMotoriDesignVaticanoLondraViaggiElezioniMondo SolidaleRepubblica@Scuola Sezioni Politica Economia Esteri Italia Cronaca Commenti Scuola Cultura Sport Spettacoli Serie TV Video Metropolis Rubriche Podcast Salute Green&Blue Italian Tech Il Gusto La Zampa Motori Design Vaticano Londra Viaggi Elezioni Mondo Solidale Repubblica@Scuola Sezioni Politica Economia Esteri Italia Cronaca Commenti Scuola Cultura Sport Spettacoli Serie TV Video Metropolis Rubriche Podcast Salute Green&Blue Italian Tech Il Gusto La Zampa Motori Design Vaticano Londra Viaggi Elezioni Mondo Solidale Repubblica@Scuola Edizioni LocaliRomaMilanoBariBolognaFirenzeGenovaNapoliPalermoTorino Edizioni Locali Roma Milano Bari Bologna Firenze Genova Napoli Palermo Torino Edizioni Locali Roma Milano Bari Bologna Firenze Genova Napoli Palermo Torino Dirette SportiveDiretta Serie ADiretta Serie BDiretta Coppa ItaliaDiretta Champions LeagueDiretta Europa LeagueDiretta Formula 1Diretta Moto GP Dirette Sportive Diretta Serie A Diretta Serie B Diretta Coppa Italia Diretta Champions League Diretta Europa League Diretta Formula 1 Diretta Moto GP Dirette Sportive Diretta Serie A Diretta Serie B Diretta Coppa Italia Diretta Champions League Diretta Europa League Diretta Formula 1 Diretta Moto GP InsertiAffari&FinanzaDIl VenerdiRobinsonU Inserti Affari&Finanza D Il Venerdi Robinson U Inserti Affari&Finanza D Il Venerdi Robinson U SpecialiOncologiaSalute SenoGiochi senza barriereEuropa, ItaliaRepubblica dei cavalli Speciali Oncologia Salute Seno Giochi senza barriere Europa, Italia Repubblica dei cavalli Speciali Oncologia Salute Seno Giochi senza barriere Europa, Italia Repubblica dei cavalli Servizi e partnerAnnunciAsteBibliotecaCodici ScontoConsigli.itEdicolaGiochi e scommesseGiochi onlineIlmiolibroLavoroMeteoNecrologieNewsletterOroscopoPreventivi auto Servizi e partner Annunci Aste Biblioteca Codici Sconto Consigli.it Edicola Giochi e scommesse Giochi online Ilmiolibro Lavoro Meteo Necrologie Newsletter Oroscopo Preventivi auto Servizi e partner Annunci Aste Biblioteca Codici Sconto Consigli.it Edicola Giochi e scommesse Giochi online Ilmiolibro Lavoro Meteo Necrologie Newsletter Oroscopo Preventivi auto DizionariDizionario di ItalianoDizionario di IngleseDizionario dei sinonimi Dizionari Dizionario di Italiano Dizionario di Inglese Dizionario dei sinonimi Dizionari Dizionario di Italiano Dizionario di Inglese Dizionario dei sinonimi Codici ScontoCodice sconto UnieuroCodice sconto Zalando PrivéCodice sconto MediaworldCodice sconto ITA AirwaysCodice sconto Luisa Via Roma Codici Sconto Codice sconto Unieuro Codice sconto Zalando Privé Codice sconto Mediaworld Codice sconto ITA Airways Codice sconto Luisa Via Roma Codici Sconto Codice sconto Unieuro Codice sconto Zalando Privé Codice sconto Mediaworld Codice sconto ITA Airways Codice sconto Luisa Via Roma Redazione Scriveteci **Ingegneria della creatività Digitale e Scienze dell’Architettura per il Patrimonio nuovi corsi del Politecnico di Bari** Il settore scientifico dell’Università di Bari offre invece 18 triennali e 22 specialistiche che comprendono Fisica, Matematica, Chimica e Agraria e quattro magistrali a ciclo unico tra cui Conservazione e restauro dei beni culturali e Farmacia All’Università di Bari, arrivata a festeggiare il suo centenario, gli studenti potranno scegliere tra 136 corsi erogati in 19 dipartimenti suddivisi in cinque macro aree per l'anno accademico 2025/2026. Il settore scientifico offre 18 triennali e 22 specialistiche che comprendonoFisica, Matematica, Chimica e Agraria e quattro magistrali a ciclo unico tra cui Conservazione e restauro dei beni culturali e Farmacia(interateneo con Università di Tirana). Il mondo medico - sanitario conta 20 triennali, come Ostetrica, Infermieristica e Fisioterapia, oltre a sei specialistiche. E poi le lauree a ciclo unico di Medicina e Chirurgia, anche in inglese a Bari e con un’altra sede a Taranto,Medicina Veterinaria e Odontoiatriae protesi dentaria. Nell’ambito umanistico linguistico tra i corsi più recenti ci sonoil Dams (Discipline dell'audiovisivo, della musica e dello spettacolo), che ha attirato negli ultimi anni tanti giovani desiderosi di far cinema e Lingue e culture per il Turismo e la Mediazione internazionale. Fiore all’occhiello dell’Ateneo è certamente l'area antichistica. Tra le magistrali spiccano due corsi con doppi titoli: Scienze Filosofiche, corso internazionale con l’Università di Granada e Traduzione Specialistica (con il rilascio di doppio titolo con l’Universidad de Sevilla). L’area umanistica vanta in magistrale il corso di Archeologia, interateneo con l’Università di Foggia. In area economica giuridica i corsi triennali sono dieci, alcuni suddivisi tra le sedi di Taranto con Scienze giuridiche per l'immigrazione,i diritti umani e l’interculturalità, di Brindisi con Economia aziendale, e numerosi indirizzi a Bari. E poi un ampio ventaglio di scelte nell’ambito delle lauree magistrali, circa dieci, con un corso interateneo insieme al Politecnico di Bari di Scienze strategiche marittimo portuali. Rimane la tradizionale laurea a ciclo unico di Giurisprudenza che comprende l'indirizzo per le imprese. Nell'ambito delle Scienze sociali sono sei invece i corsi di laurea triennali e sette quelli magistrali. Fra gli ultimi erogati c’è Sociologia, che ha riscontrato un buon successo. Un tassello che mancava dopo la vita accademica coltivata in Ateneo dello studioso Franco Cassano. Nell’ambito delle magistrali a ciclo unico è presente anche Scienze della formazione primaria. Rispetto all’anno scorso all'Università di Bari sono stati introdotti due nuovi corsi:la magistrale in Decision Science(in lingua inglese) del dipartimento interateneo di Fisica e la specialistica in Economia e Management per le Pubbliche amministrazioni. Il Politecnico di Bari per l’anno accademico 2025/2026 erogherà ben 45 corsi di studio suddivisi in 14 triennali, 19 magistrali e 12 indirizzi tra dottorati di ricerca e scuole di specializzazione. Percorsi smistati nei seguenti dipartimenti: Ingegneria elettrica e dell’informazione; Ingegneria civile, ambientale, del territorio, edile e di chimica; Architettura, costruzione e design; Meccanica, matematica e management e dipartimento interateneo di Fisica. Quest’anno sono stati inaugurati due nuovi corsi:Ingegneria della creatività Digitale, in convenzione conl’Università della Basilicata, sede Matera e Scienze dell’Architettura per il Patrimonioin convenzione con Università di Valona (Albania). Si tratta di un corso internazionale con rilascio del joint degree (un unico titolo congiunto con atenei convenzionati). Il primo pone l’enfasi sull'intersezione tra ingegneria e tecnologie per l’industria creativa, preparando il laureato a lavorare in settori come il design di prodotto digitale, lo sviluppo di contenuti multimediali, l'animazione, la produzione video e l'arte digitale. Il secondo corso di laurea, Scienze dell’Architettura per il Patrimonio, è stato attivato congiuntamente conla Universiteti Ismail Qemali – Vlorë (Albania), con cui PoliBa vanta una collaborazione da tempo. Si attende l’approvazione ufficiale di nuovi tre corsi di laurea e per questa ragione PoliBa attende di svelarne i contenuti. In questo ricco contesto di studi, si fa spazio anchela Libera Università Mediterranea \"Giuseppe Degennaro”, più nota sotto la sigla Lum, per l’ampio ventaglio di indirizzi garantiti a chi dovrà affacciarsi a partire dall’anno prossimo nel mondo universitario. I dipartimenti disponibili sono Management, finanza e tecnologia; Medicina e chirurgia; Ingegneria e Scienze giuridiche e dell’Impresa. Nella prima area si potrà scegliere tra le triennali in Economia e gestione aziendale, inBusiness economics and organizatione per la magistrale Economia e Management con uno sguardo internazionale, sul mondo digital ed anche al retail, ovvero per la gestione di reti di vendita. Le specializzazioni approfondiscono soprattutto l’ambito della finanza. Per le triennali in ingegneria ci sono fra le altre Gestionale con indirizzo inDigital Management e Informatica per la Transizione. Anche qui sono garantite le lauree a ciclo unico quali Giurisprudenza, Medicina e Chirurgia e quella in Odontoiatria e Protesi Dentaria. In ambito medico - sanitario c’è anche Infermieristica. **Question time con i ministri Giorgetti, Lollobrigida, Musumeci e Abodi - in diretta dalla Camera** **Leggi anche** **Raccomandati per te** GEDI News Network S.p.A. P.Iva 01578251009 ISSN 2499-0817 **App** Iphone|Android **Social** **Supplementi Repubblica** Affari e Finanza D Il Venerdì Robinson **Gedi News Network** La Stampa HuffPost Italia Fem Formula Passion VD News **Quotidiani locali** La Provincia Pavese La Sentinella del Canavese **Periodici** Le Scienze Limes National Geographic **Radio** DeeJay Capital m2o **Iniziative Editoriali** In edicola Biblioteca Digitale **Partnership** LAB MyMovies AutoXY Formula Passion Sport.it **Servizi, tv e consumi** Annunci Ilmiolibro Necrologie Miojob Enti e Tribunali Meteo Tvzap Dizionario italiano Dizionario inglese/italiano Consigli.it Codici Sconto **Network Lena** Die Welt El Pais Gazeta Wyborcza Le Figaro Le Soir Tages Anzeiger Tribune de Geneve Mappa del sito Redazione Scriveteci Per inviare foto e video Servizio Clienti Pubblicità Cookie Policy Privacy Codice Etico e Best Practices Dichiarazione di accessibilità Riserva TDM"}