{"id": 287, "name": "KCFC - NPR - Boulder", "domain": "cpr.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.cpr.org/event/join-us-at-the-juneteenth-music-festival-3/", "title": "Join Us At The Juneteenth Music Festival 3", "content": "News Classical Indie 102.3 KRCC Politics Environment Justice Arts MusicClassicalIndie 102.3 Classical Indie 102.3 Classical Indie 102.3 Economy Education Denver Southern Colorado Audio & RadioWays to ListenShows and PodcastsCPR News Radio ScheduleCPR ClassicalIndie 102.3 Ways to Listen Shows and Podcasts CPR News Radio Schedule CPR Classical Indie 102.3 Ways to Listen Shows and Podcasts CPR News Radio Schedule CPR Classical Indie 102.3 NewslettersAll NewslettersThe LookoutDenverite All Newsletters The Lookout Denverite All Newsletters The Lookout Denverite About CPRMission & VisionStaff & HostsCareersStaff DEI ReportRecent AwardsPress RoomContact Us Mission & Vision Staff & Hosts Careers Staff DEI Report Recent Awards Press Room Contact Us Mission & Vision Staff & Hosts Careers Staff DEI Report Recent Awards Press Room Contact Us Ways to supportAll the ways to give!Login to the Member CenterMake a donationDonate your carCorporate sponsorshipCPR Shop All the ways to give! Login to the Member Center Make a donation Donate your car Corporate sponsorship CPR Shop All the ways to give! Login to the Member Center Make a donation Donate your car Corporate sponsorship CPR Shop Politics Money Arts Justice Environment Newsletter Ways to support **Join CPR at the Juneteenth Music Festival** **When** Sunday, June 15, 2025 12:00 PM – 8:00 PM **Where** **Event Description** Colorado Public Radio is proud to be a media sponsor of the Juneteenth Music Festival, taking placeJune 15 in Denver's historic Five Points neighborhood. Come visit our booth and say hello! Learn more about the festival at:https://www.juneteenthmusicfestival.com/ **Price** Free **More Info** www.juneteenthmusicfestival.com **Event Contact** Colorado Public Radio 303-871-9191 [email protected] https://www.cpr.org/about/contact/ **Categories** Concerts / Live Music Fairs and Festivals Family Friendly In-Person **Ways To Support CPR** You make the news and music from Colorado Public Radio possible. Your active support builds our community, grounds us in shared experiences, and improves the lives of Coloradans. Support the stories and songs you and your neighbors rely on! Become A Member Become A Sponsor Donate Your Car Donate Real Estate **Latest Stories** **Boulder’s Samba Queen and King Colorado showcase offers a night of ‘roots, remembrance, resistance’** **Boulder’s Samba Queen and King Colorado showcase offers a night of ‘roots, remembrance, resistance’** **US Justice Department says Trump can cancel national monuments that protect landscapes** **US Justice Department says Trump can cancel national monuments that protect landscapes** **We’re in for another hot summer. Health care providers are preparing for more heat-related illnesses** **We’re in for another hot summer. Health care providers are preparing for more heat-related illnesses** **Many musicians suffer playing-related pain and stress. A retiring CU professor says wellness is the solution** **Many musicians suffer playing-related pain and stress. A retiring CU professor says wellness is the solution** **Sign Up For Our Newsletters** It takes a good day’s drive to cover Colorado, but we’ll help you do it in a few minutes. Our newsletters bring you a closer look at the stories that affect you and the music that inspires you. Get A Newsletter From The Climate Team Sign Up For The Lookout Sign Up For The Quotie Monthly Get The Inside Track On Denver Music Classical Music Playlists And More **Upcoming Events** **Join CPR at the Juneteenth Music Festival** **Join CPR at Denver PrideFest** **Indie 102.3’s INDIEVERSE** **Listen to a Colorado Postcard** **Listen to a Colorado Postcard** Colorado Postcards are snapshots of our colorful state in sound. They give brief insights into our people and places, our flora and fauna, and our past and present, from every corner of Colorado.Listen now. **News That Matters, Delivered To Your Inbox** Our Mission Staff and Hosts Careers at CPR General Contest Rules FCC Applications & Files Contact Us Member Support Connect With CPR Opt Out of Targeted Advertising Ways to Listen Listening Help On-Air Schedule Make a Donation Donate Your Car Become a Sponsor Corporate Supporters CPR Shop © 2025 Colorado Public Radio. All Rights Reserved.Privacy Policy."}