{"id": 1129, "name": "Press Gazette", "domain": "pressgazette.co.uk", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://pressgazette.co.uk/publishing-services-content/https-pressgazette-co-uk-publishing-services-content-audience-monetisation-for-publishers-utm_sourcepg-websiteutm_mediumsponsored-articleutm_idpg-november/", "title": "Https Pressgazette Co Uk Publishing Services Content Audience Monetisation For Publishers Utm_sourcepg Websiteutm_mediumsponsored Articleutm_idpg November", "content": "Sign In Sign Out Account Fighting for quality news media in the digital age. B2B Broadcast Journalism Digital Journalism Magazines National Newspapers Regional Newspapers Photography Wires and Agencies Subscribe Newsletter Podcast Latest AI PublishersBack to all sectionsB2BBroadcast JournalismDigital JournalismMagazinesNational NewspapersRegional NewspapersPhotographyWires and Agencies Back to all sections B2B Broadcast Journalism Digital Journalism Magazines National Newspapers Regional Newspapers Photography Wires and Agencies Back to all sections B2B Broadcast Journalism Digital Journalism Magazines National Newspapers Regional Newspapers Photography Wires and Agencies Platforms PG Events DataBack to all sectionsAudience DataBusiness Data Back to all sections Audience Data Business Data Back to all sections Audience Data Business Data All Latest Articles News Generative AI in Publishing Comment North America Paywalls Podcasts Newsletters Obituaries Ads & Marketing B2B National Newspapers Broadcast Journalism Digital Journalism Magazines Regional Newspapers Wires and Agencies Media Business Media Law Partner Content **Monetising digital audiences: A call for alignment across strategy, teams, and tech** Mather Senior Managing Director, Pete Doucette, explains how publishers can address digital revenue challenges ByPete Doucette The news industry has experienced profound disruption over the past thirty years as audience behaviours change and revenue dollars follow, driving publishers to rethink their business models. While digital consumption has skyrocketed,digital revenuegrowthhas not kept pace. Many publishers struggle to fully capitalise on the revenue potential of their digital audiences despite having various monetisation opportunities at their disposal. This shortfall stems from the internal disruption caused by digital transformation to their legacy product strategy, organisational structure, andtechnology infrastructure. It’s not the lack of opportunity that is holding publishers back. The good news is that we now have enough industry evidence to know there is a path. For example, look at The New York Times’ Q3 2024 quarterly earnings report, which shows total digital revenues up 13.0% year over year and digital subscription and digital advertising revenue up 14.2% and 8.8%, respectively. To succeed in the digital age, news media publishers must overcome these obstacles and evolve their monetisation approach for consumers and advertisers. This article explores key barriers and opportunities acrossrevenue strategy, organisational structure, and technology. **Strategy: Thinking in terms of a demand curve** One of the key issues with current strategies is that publishers often think of their audience uniformly rather than considering the diversity in potential monetisation approaches for their audience. To fully unlock their digital revenue potential, publishers should adopt a more segmented approach, viewing their audience as existing on a demand curve where specific segments can be monetised differently. Here’s a breakdown of the potential digital revenue streams by segment based on Mather’s client experience: **Digital revenue streams for publishers:** **1) Direct monetisation (10%)** This group, representing approximately 10% of users, can be monetised through various consumer revenue streams such as subscriptions, memberships, paid newsletters, micropayments, and time-based access. These users are the most valuable, generating the highest digital revenue per user. Offering premium or basic subscriptions ensures a consistent revenue flow, while targeted verticals or specialised content can attract niche subscriptions. Additionally, due to the high level of engagement and valuable first-party data from these users, there are significant advertising sponsorship opportunities that can complement the paid consumer experience. However, monetising this group requires a strong focus on value delivery and relevant experiences—such as targeted newsletters—to retain them over time. In fact, Mather data shows a ~17% improvement in retention among subscribers who receive targeted newsletters. **2) Premium advertising (15%)** The next group of users to monetise typically shows high engagement but low subscription rates, representing about 15% of the user base. They can be identified using AI-based tools like adynamic paywall engine. Monetisation strategies for this segment include custom audience segments based on first-party data, e-commerce partnerships, vertical ad networks, and private marketplace advertising. Although they generate less revenue from direct monetisation, they provide more value than mass advertising. Publishers can enhance their worth through data collection and strategic partnerships, making them a vital part of a balanced revenue strategy. **3) Mass advertising (75%)** The remaining 75% of users fall into the mass advertising category, where revenue is primarily generated through programmatic advertising. While the digital revenue per user is the lowest in this group, these users can still contribute to a publisher's bottom line through data enrichment, which allows publishers to leverage valuable insights toimprove ad targeting and effectiveness. Monetising this segment efficiently requires a robust programmatic ad stack and innovative approaches to optimise user data collection and advertising exposure. For this strategy to succeed, publishers need to allocate resources and focus based on where each group lies on the demand curve, ensuring that each segment is being monetised appropriately. **Organisational structure: Breaking down departmental silos** One of the most significant challenges holding back digital revenue growth is how publishers structure their digital revenue functions. Traditionally, publishers organise their digital efforts into two distinct departments, with often competing objectives: **B2C subscription department** This team focuses on gaining and retaining subscribers through marketing strategies, aiming to convert users into paying subscribers, often supporting strict paywalls. **B2B advertising sales department** Responsible for selling ads via direct campaigns or programmatic methods, this department seeks to enhance audience size and ad impressions, typically advocating for looser paywalls to ensure wider content access. Additionally,advertisingdepartments often face short-term pressure, driving an immediate focus that can conflict with the consumer revenue team's long-term subscriber growth strategy. The solution lies in integrating these digital revenue functions into a unified department. With a Chief Revenue Officer (CRO) overseeing both streams, publishers can eliminate these conflicts and drive a cohesive strategy that maximises revenue across all user segments. This alignment enables publishers to approach paywall decisions, audience segmentation, anduser engagementholistically, optimising revenue without compromising one department’s goals for the other and ensuring sustained long-term success. **Technology: Simplifying and integrating the tech stack** Technology poses a significant challenge for publishers. Often, they invest in costly digital tools that are not fully implemented or integrated into their overall technology infrastructure. This leads to missedopportunities to leverage data, enhance user experiences, and optimise audience monetisation. A significant issue is that very few solutions are designed to address both B2C (business-to-consumer) and B2B (business-to-business) revenue functions. Typically, the subscription department selects subscription platforms, while the ad sales department chooses advertising technology. This lack of integration results in redundant systems that slow down website performance, leading to longer page load times and preventing a comprehensive understanding of the audience. Furthermore, publishers often lack the capital to invest in new technology and the patience to implement solutions fully, and they face the real burden of legacy “tech debt.” To tackle this challenge, publishers should move away from isolated point solutions and adopt technology platforms focusing on comprehensive audience monetisation. They must also commit to backend data integrations to fully leverage these tools. These platforms should offer the flexibility to achieve both consumer revenue and advertising goals while providing a unified dashboard for data analysis and optimisation. By investing in integrated technology solutions, publishers can enhance user experience, foster greater engagement, and ultimately boost revenue. Below is an illustration of a publishertech stack that maximises total digital revenuethroughout the user journey. **Conclusion: The path forward for digital revenue growth** To thrive in today’s digital landscape, news publishers must adopt a total audience monetisation strategy that optimises the value of every user across both B2C and B2B revenue streams. This requires more than just tactical changes; it demands an integrated approach to strategy, organisational structure, and technology. First, publishers need to view their audience as existing on a demand curve, where different segments can be monetised differently but contribute to the overall revenue mix. Next, they need to break down the silos between subscription and advertising departments, creating a unified revenue function under a CRO who can align goals and drive holistic revenue growth. Finally, publishers must invest in integrated technology platforms that enable total audience monetisation rather than fragmented solutions that hinder performance. By making these changes, publishers can unlock their full digital revenue potential and ensure lasting success. To connect with Pete Doucette, feel free to reach out atpdoucette@mathereconomics.com. Discover more about Mather and their innovative solutions atwww.mathereconomics.com Emailpged@pressgazette.co.ukto point out mistakes, provide story tips or send in a letter for publication on our \"Letters Page\" blog **Pete Doucette** **More of this topic** **Recent Podcasts** About us Home Page Contact us Advertising & Partnerships Facebook Twitter Editorial standards/Complaints and Corrections Privacy Policy Terms and Conditions"}