{"id": 2139, "name": "The Resurgent", "domain": "thefirsttv.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.thefirsttv.com/watch/the-dana-show-maxine-the-media-now-lying-to-defend-la-violence-06-10-25/", "title": "The Dana Show Maxine The Media Now Lying To Defend La Violence 06 10 25", "content": "Home About Hosts Podcasts Watch LIVE Must See Videos Sign In Support Home About Hosts Podcasts Watch LIVE Must See Videos Support **The Dana Show – Maxine & The Media Now LYING To Defend LA Violence | 06-10-25** Maxine Waters tells people to not believe what they see in Los Angeles as the media continues to defend illegal immigrants. The stalker of President Trump’s granddaughter, Kai, showed up in Dana’s town. Fox Business’ Charles Payne joins us to discuss Wall Street’s freakout over tariffs, the Big, Beautiful Bill, inflation expectations and more. Did a Minnesota State Representative admit to being an illegal immigrant on the MN House Floor? Ret. Navy SEAL Jared Ogden joins us to react to Gavin Newsom’s claim that our troops are being treated “disrespectfully” by President Trump. In 2021, Newsom deployed 1,000 National Guard members to help the California Highway Patrol protect the CA State Capitol from “insurrectionists”. **More Like This** **The Dana Show – Los Angeles BURNS As The Media Covers It Up | 06-09-25** **The Dana Show – Los Angeles BURNS As The Media Covers It Up | 06-09-25** **The Dana Show – Los Angeles BURNS As The Media Covers It Up | 06-09-25** **The Dana Show – Los Angeles BURNS As The Media Covers It Up | 06-09-25** Violent Protests In LA, Riley Gaines & Simone Biles Beef Online, Kilmar Abrego Garcia Returned To The U.S., @LAScanner Vanishes From X, Red State Rino Hunting, Today in Wokery, Quickfive, FL Man, Today in Stupidity, and more. Violent Protests In LA, Riley Gaines & Simone Biles Beef Online, Kilmar Abrego Garcia Returned To The U.S., @LAScanner Vanishes From X, Red State Rino Hunting, Today in Wokery, Quickfive, FL Man, Today in Stupidity, and more. **The Dana Show – Trump & Musk Have A GENERATIONAL Fallout | 06-06-25** **The Dana Show – Trump & Musk Have A GENERATIONAL Fallout | 06-06-25** **The Dana Show – Trump & Musk Have A GENERATIONAL Fallout | 06-06-25** **The Dana Show – Trump & Musk Have A GENERATIONAL Fallout | 06-06-25** Dana breaks down the timeline of the Trump vs. Musk beef and how this will play out in the future of the party. Is this the biggest Republican fight since 2009? Are people still going to vandalize Teslas’? Critics are freaking out about the possibility of Marvel Comics introducing a new White Black Panther named Ketema. Dana breaks down the timeline of the Trump vs. Musk beef and how this will play out in the future of the party. Is this the biggest Republican fight since 2009? Are people still going to vandalize Teslas’? Critics are freaking out about the possibility of Marvel Comics introducing a new White Black Panther named Ketema. **The Dana Show – Trump vs. Musk Hits Its BREAKING POINT | 06-05-25** **The Dana Show – Trump vs. Musk Hits Its BREAKING POINT | 06-05-25** **The Dana Show – Trump vs. Musk Hits Its BREAKING POINT | 06-05-25** **The Dana Show – Trump vs. Musk Hits Its BREAKING POINT | 06-05-25** Trump vs. Elon Musk, KJP Leaving The Democratic Party, Boulder Terror Attack Update, Meghan Markle Shares Cringe Twerking Video, Rep. Thomas Massie joins the show, Red State Rino Hunting, Today in Wokery, Quickfive, FL Man, Today in Stupidity, and more. Trump vs. Elon Musk, KJP Leaving The Democratic Party, Boulder Terror Attack Update, Meghan Markle Shares Cringe Twerking Video, Rep. Thomas Massie joins the show, Red State Rino Hunting, Today in Wokery, Quickfive, FL Man, Today in Stupidity, and more. **The Dana Show – Elon Musk GHOSTS Mike Johnson As Schumer Fears DEATH? | 06-04-25** **The Dana Show – Elon Musk GHOSTS Mike Johnson As Schumer Fears DEATH? | 06-04-25** **The Dana Show – Elon Musk GHOSTS Mike Johnson As Schumer Fears DEATH? | 06-04-25** **The Dana Show – Elon Musk GHOSTS Mike Johnson As Schumer Fears DEATH? | 06-04-25** Trump’s Big Beautiful Bill, MTG Criticized For Not Reading The BBB, Navy Set To Rename More Ships, Modern Conservatism, Pride Month, David Mamet & Rep. Rich McCormick join the show, Red State Rino Hunting, Today in Wokery, Quickfive, FL Man, Today in Stupidity, and more. Trump’s Big Beautiful Bill, MTG Criticized For Not Reading The BBB, Navy Set To Rename More Ships, Modern Conservatism, Pride Month, David Mamet & Rep. Rich McCormick join the show, Red State Rino Hunting, Today in Wokery, Quickfive, FL Man, Today in Stupidity, and more. **The Dana Show – Elon Musk BLASTS The Big, Beautiful Bill | 06-03-25** **The Dana Show – Elon Musk BLASTS The Big, Beautiful Bill | 06-03-25** **The Dana Show – Elon Musk BLASTS The Big, Beautiful Bill | 06-03-25** **The Dana Show – Elon Musk BLASTS The Big, Beautiful Bill | 06-03-25** Elon Musk Slams Spending Bill, Pride Month, The Rescissions Package Explained, Texas THC Ban Update, Sesame Street Pride Month Backlash, John Burk & Joseph Wade Miller join the show, Red State Rino Hunting, Today in Wokery, Quickfive, FL Man, Today in Stupidity, and more. Elon Musk Slams Spending Bill, Pride Month, The Rescissions Package Explained, Texas THC Ban Update, Sesame Street Pride Month Backlash, John Burk & Joseph Wade Miller join the show, Red State Rino Hunting, Today in Wokery, Quickfive, FL Man, Today in Stupidity, and more. **The Dana Show – Terror Attack In Boulder | 06-02-25** **The Dana Show – Terror Attack In Boulder | 06-02-25** **The Dana Show – Terror Attack In Boulder | 06-02-25** **The Dana Show – Terror Attack In Boulder | 06-02-25** Democratic Effort To Subpoena Musk, Boulder Terror Attack, Sen. Cory Booker’s ‘Nazi’ Salute, Harvard Professor Fired For Dishonesty In Study on Dishonesty, Trans Athlete Wins Second Straight State Title, Trump’s Big Beautiful Bill, Stephen Yates joins the show, Red State Rino Hunting, Today in Wokery, Quickfive, FL Man, Today in Stupidity, and more. Democratic Effort To Subpoena Musk, Boulder Terror Attack, Sen. Cory Booker’s ‘Nazi’ Salute, Harvard Professor Fired For Dishonesty In Study on Dishonesty, Trans Athlete Wins Second Straight State Title, Trump’s Big Beautiful Bill, Stephen Yates joins the show, Red State Rino Hunting, Today in Wokery, Quickfive, FL Man, Today in Stupidity, and more. **Get the Daily Email!** **Bill O’Reilly on your TV!** **Follow Us** **Stay Informed!** **Stay Informed!** Home About Hosts Podcasts Watch LIVE Must See Videos Terms of Service Privacy Policy **Don't let Big Tech silence free speech** Join the First TV and fight back against the liberal media's progressive agenda. Already a Supporter?"}