{"id": 414, "name": "Athens News Courier", "domain": "enewscourier.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://enewscourier.com/2025/06/01/tennessee-man-faces-attempted-murder-charges-following-alleged-i-65-gunfire-incident-in-limestone-county/", "title": "Tennessee Man Faces Attempted Murder Charges Following Alleged I 65 Gunfire Incident In Limestone County", "content": "Home Subscriptions Newsletter signup E-Edition NewsNews News News Obituaries Opinion Sports Lifestyles Best of The Best Classifieds Public Notices ServicesAbout UsContact Us About Us Contact Us About Us Contact Us Home News Opinion Best of The Best Obituaries Sports Classifieds Public Notices E-Edition **Tennessee man faces attempted murder charges following alleged I-65 gunfire incident in Limestone County** Published 1:51 pm Sunday, June 1, 2025 ByBen Bullard A Tennessee man faces attempted murder charges after allegedly shooting into a vehicle traveling on Interstate 65 in Limestone County on Saturday (May 31). According to the Limestone County Sheriff’s Office (LCSO), a 30 year-old male from Centerville, Tennessee was arrested after being stopped approximately 10 miles from the alleged shooting incident, which law enforcement says occurred near the 347 mile marker (Huntsville Brownsferry Road) of I-65. No injuries were reported to the occupants of the vehicle allegedly targeted by the gunfire. “A 911 caller reported that a man on a motorcycle fired shots at him and his family while they were traveling northbound,” LCSO said in a statement on Sunday. “The gunfire struck the victim’s vehicle, endangering the lives of the occupants.” **Email newsletter signup** “Following the alert issued with a detailed description of the suspect, troopers with the Alabama Law Enforcement Agency (ALEA) located the individual approximately 10 miles from the scene,” added the sheriff’s office. The suspect has been charged with three counts of attempted murder, as well as a single count of shooting into an occupied vehicle. LCSO said the suspect “was found in possession of a loaded pistol, two additional loaded magazines, and was wearing a bullet-resistant vest beneath an Outcast Motorcycle Club vest” at the time of his arrest. “This reckless violence has no place on our highways,” said Limestone County Joshua Sheriff McLaughlin in the statement. “We are thankful no innocent lives were lost, and we will continue to work closely with our law enforcement partners to ensure the public’s safety.” No bond had been set for the suspect as of Sunday. An Aniah’s Law hearing, in which Alabama judges weigh whether to deny defendants bail if charged with certain violent crimes, also will be scheduled at a later time. **You Might Like** **Athens man held in connection with alleged shooting death of stepson** **Athens man held in connection with alleged shooting death of stepson** **ALL-COUNTY SOFTBALL: West Limestone’s Lilly Bethune named Overall MVP** **ALL-COUNTY SOFTBALL: West Limestone’s Lilly Bethune named Overall MVP** **How to recognize fake vs. real bills** **How to recognize fake vs. real bills** **Addiction Eviction rally returns to Swan Creek Park on Saturday, June 7** **Addiction Eviction rally returns to Swan Creek Park on Saturday, June 7** Home News Opinion Obituaries Lifestyles Sports Newsletter signup e-Edition Subscriptions Classifieds Public Notices About Us Contact Us"}