{"id": 407, "name": "Elon University Polling", "domain": "elon.edu/u/elon-poll", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.elon.edu/u/elon-poll/elon-poll-confederate-statues-and-monuments/", "title": "Elon Poll Confederate Statues And Monuments", "content": "Jump to main content Jump to search Jump to the footer About Admissions Academics Global Campus Life Athletics Alumni Students Faculty & Staff Parents OnTrack Moodle Calendar News Library Maps Directory Email Give Apply Home Elon University Poll Elon Poll – Confederate statues and monuments **Elon Poll – Confederate statues and monuments** **N.C. residents support keeping Confederate monuments in place** Full Report with Methodology & Cross TabsThe latest survey by the Elon University Poll conducted Nov. 4-6, 2019, asked N.C. resident their opinions about whether Confederate statues and monuments should be removed from public property, as well as how they viewed other Confederate symbols and the legacy of slavery today. NOVEMBER 20, 2019— There is strong support among North Carolina residents to keep Confederate statues and monuments on public property, even as another monument at the center of a prolonged legal battle has come down, according to the results of a new survey by the Elon University Poll. Early Wednesday morning, the Confederate statue in downtown Pittsboro in Chatham County was removed from its place in front of the county courthouse following recent court rulings and clashes between demonstrators. But a recent Elon University Poll survey has found that a solid majority of North Carolinians believe those symbols should remain. The survey of nearly 1,500 North Carolina residents found that nearly two-thirds (65 percent) believe that Confederate monuments should remain on public, government-owned property such as parks, city squares and courthouses. The remaining 35 percent say the monuments should be removed. “Our findings suggest that a compromise might have broad support in local communities grappling with controversies about Confederate monuments,” said Jason Husser, director of the Elon University Poll and associate professor of political science. “While we found a substantial majority do not want the monuments removed from public property, we found an even larger majority who support efforts to add context through historical plaques.” The survey gauged support for other steps that could be taken regarding Confederate monuments, with 72 percent saying adding plaques that offer historical context to the monument was a good idea. Sixty-five percent said moving the monuments and statues to history museums was a good idea, 55 percent said it would be a good idea to move them to Confederate cemeteries or memorials, and 37 percent said it would be a good idea to replace them with monuments to honor Southerners who fought to end slavery. Asked about the impact the removal of Confederate monuments would have on race relations, 35.5 percent said they believe taking the monuments down will “mostly hurt” race relations while 25 percent said it would “mostly help.” The largest segment — 40 percent — said it “does not make much of a difference.” The survey also explored opinions about Confederate flags and symbols, and the level of knowledge about the Civil War. The survey of 1,467 North Carolina residents was conducted Nov. 4-6, 2019, through an online opt-in sample marketplace. The survey had a credibility interval of +/- 2.8 percent. Different from a margin of error, the credibility interval is used to measure the accuracy of nonprobability surveys such as opt-in online surveys. A fuller explanation of the credibility interval and the survey methodology are available in the full report. While two in three North Carolinians support keeping Confederate statues and monuments in place on public property, opinions vary greatly when race and political leanings are taken into account. Among white residents, 77 percent believe the monuments should remain in place, while only 27 percent of black residents hold that view. Republicans overwhelmingly support keeping Confederate statues and monuments on public property, with 91 percent holding that view, while just 36 percent of Democrats support keeping them where they are. Seventy-seven percent of independents want the statues and monuments to remain on public property. “Perceptions of the past are powerful. We see clear evidence of this in factors that influence support for Confederate monuments remaining on public property,” Husser said. “Those viewing the Civil War as more about slavery than states’ rights and those seeing slavery as having a lasting legacy on African Americans are quite likely to favor removing the monuments.” Additionally, older residents — those over the age of 65 — are more likely to say monuments should remain on public property than younger residents. Women are more likely to say the monuments should remain (68 percent) than men (62 percent) and those with less than a college education are more likely to say they should remain on public property (68 percent) than those with a college degree (59 percent). A person’s opinions about the legacy of slavery and how different races are treated in modern society also seems to correlate with their view of what should have to Confederate monuments. Ninety-two percent of those who believe Confederate symbols do not disturb African Americans today and 92 percent of those who believe the legacy of slavery does not have much of an effect on African Americans today say the monuments should remain on public, government-owned property. Similarly, 90 percent of those who believe whites and blacks are treated equally in today’s society and 90 percent of those who believe whites are treated less fairly than blacks believe the statues and monuments should remain. The survey also asked for opinions about a range of Confederate monuments and symbols. Residents were much more likely to say that Confederate monuments help people understand an important chapter in American history, and that they honor Confederate soldiers who passed away in the war. Opinions were less clear about whether the monuments glorify for what the Confederacy fought for, with 49 percent saying they agree with that, 29 percent saying they disagree, and 22 percent saying they neither agree nor disagree. Residents were nearly evenly split on the cause of the Civil War, with 49 percent saying the war was mainly about states’ rights, 44 percent saying the war was mainly about slavery, and 7 percent offering some other response. Sixty-four percent responded that they sometimes or often see the Confederate flag on display around the state, with 32 percent saying they rarely see the flag and 4.5 percent saying they never see it. Residents are split on their reaction to seeing the Confederate flag, with 44 percent saying they have neither a positive nor negative reaction, 36 percent saying they have a negative reaction, and 20 percent saying they have a positive reaction.There is a recognition that different races may respond to these symbols differently. Sixty-eight percent said they think Confederate symbols are disturbing to blacks today compared to 32 percent who said they don’t hold that view. Nearly two out of three residents said that the legacy of slavery affects the position of blacks in American society “a fair amount” or “a great deal,” while 22.5 percent said that legacy affects blacks “not much” and another 14 percent said “not at all.” Additionally, 51 percent said blacks are treated less fairly than whites, while 32 percent said blacks and whites are treated equally and 17 percent said whites are treated less fairly than blacks. Elon University Poll Contact Information About the Poll Commitment to Transparency Methodology Poll Archive2016-Current2011-20152006-20102001-2005 2016-Current 2011-2015 2006-2010 2001-2005 2016-Current 2011-2015 2006-2010 2001-2005 In the News **Follow Elon Poll** X Facebook Elon University Facebook Elon University X (formerly Twitter) Elon University Instagram Elon University LinkedIn Elon University Flickr Elon University YouTube Elon University Full Social Media List Contact Elon Emergency Info Campus Directories Visit Campus Online Services EthicsPoint Human Resources Health Status & Alerts Space Reservations Library Bookstore Box Office Privacy Policy Title IX GDPR Information Accessibility © 2025 Elon University | All Rights Reserved 1830s – 1860s: Telegraph History and Geography SURF Abstracts Credited Responses: Democracy and Social Media 2035"}