{"id": 1584, "name": "World Health Organization", "domain": "who.int", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.who.int/news/item/09-06-2025-fourth-meeting-of-the-international-health-regulations-(2005)-emergency-committee-regarding-the-upsurge-of-mpox-2024-temporary-recommendations", "title": "09 06 2025 Fourth Meeting Of The International Health Regulations (2005) Emergency Committee Regarding The Upsurge Of Mpox 2024 Temporary Recommendations", "content": "Global RegionsWHO Regional websitesAfricaAmericasSouth-East AsiaEuropeEastern MediterraneanWestern Pacific Africa Americas South-East Asia Europe Eastern Mediterranean Western Pacific Africa Americas South-East Asia Europe Eastern Mediterranean Western Pacific Home Health Topics All topics A B C D E F G H I J K L M N O P Q R S T U V W X Y Z ResourcesFact sheetsFacts in picturesMultimediaPodcastsPublicationsQuestions and answersTools and toolkits Fact sheets Facts in pictures Multimedia Podcasts Publications Questions and answers Tools and toolkits Fact sheets Facts in pictures Multimedia Podcasts Publications Questions and answers Tools and toolkits PopularDengueEndometriosisExcessive heatHerpesMental disordersMpox Dengue Endometriosis Excessive heat Herpes Mental disorders Mpox Dengue Endometriosis Excessive heat Herpes Mental disorders Mpox Countries All countries A B C D E F G H I J K L M N O P Q R S T U V W X Y Z RegionsAfricaAmericasEuropeEastern MediterraneanSouth-East AsiaWestern Pacific Africa Americas Europe Eastern Mediterranean South-East Asia Western Pacific Africa Americas Europe Eastern Mediterranean South-East Asia Western Pacific WHO in countriesData by countryCountry presenceCountry strengtheningCountry cooperation strategies Data by country Country presence Country strengthening Country cooperation strategies Data by country Country presence Country strengthening Country cooperation strategies Newsroom All newsNews releasesStatementsCampaignsEventsFeature storiesPress conferencesSpeechesCommentariesPhoto library News releases Statements Campaigns Events Feature stories Press conferences Speeches Commentaries Photo library News releases Statements Campaigns Events Feature stories Press conferences Speeches Commentaries Photo library Headlines Emergencies Focus onCholeraCoronavirus disease (COVID-19)Greater Horn of AfricaIsrael and occupied Palestinian territoryMpoxSudanUkraine Cholera Coronavirus disease (COVID-19) Greater Horn of Africa Israel and occupied Palestinian territory Mpox Sudan Ukraine Cholera Coronavirus disease (COVID-19) Greater Horn of Africa Israel and occupied Palestinian territory Mpox Sudan Ukraine LatestDisease Outbreak NewsSituation reportsWeekly Epidemiological Record Disease Outbreak News Situation reports Weekly Epidemiological Record Disease Outbreak News Situation reports Weekly Epidemiological Record WHO in emergenciesSurveillanceAlert and responseOperationsResearchFundingPartnersHealth emergency appealsInternational Health RegulationsIndependent Oversight and Advisory Committee Surveillance Alert and response Operations Research Funding Partners Health emergency appeals International Health Regulations Independent Oversight and Advisory Committee Surveillance Alert and response Operations Research Funding Partners Health emergency appeals International Health Regulations Independent Oversight and Advisory Committee Data Data at WHOData hubGlobal Health EstimatesMortalityHealth inequality Data hub Global Health Estimates Mortality Health inequality Data hub Global Health Estimates Mortality Health inequality DashboardsTriple Billion ProgressHealth Inequality MonitorDelivery for impactCOVID-19 dashboard Triple Billion Progress Health Inequality Monitor Delivery for impact COVID-19 dashboard Triple Billion Progress Health Inequality Monitor Delivery for impact COVID-19 dashboard Data collectionClassificationsSCORESurveysCivil registration and vital statisticsRoutine health information systemsHarmonized health facility assessmentGIS centre for health Classifications SCORE Surveys Civil registration and vital statistics Routine health information systems Harmonized health facility assessment GIS centre for health Classifications SCORE Surveys Civil registration and vital statistics Routine health information systems Harmonized health facility assessment GIS centre for health ReportsWorld Health StatisticsUHC global monitoring report World Health Statistics UHC global monitoring report World Health Statistics UHC global monitoring report About WHO About WHOPartnershipsCommittees and advisory groupsCollaborating centresTechnical teamsOrganizational structureWho we are Partnerships Committees and advisory groups Collaborating centres Technical teams Organizational structure Who we are Partnerships Committees and advisory groups Collaborating centres Technical teams Organizational structure Who we are Our workActivitiesInitiativesGeneral Programme of WorkWHO Academy Activities Initiatives General Programme of Work WHO Academy Activities Initiatives General Programme of Work WHO Academy FundingInvestment in WHOWHO Foundation Investment in WHO WHO Foundation Investment in WHO WHO Foundation AccountabilityExternal auditFinancial statementsInternal audit and investigationsProgramme BudgetResults reports External audit Financial statements Internal audit and investigations Programme Budget Results reports External audit Financial statements Internal audit and investigations Programme Budget Results reports GovernanceGoverning bodiesWorld Health AssemblyExecutive BoardMember States Portal Governing bodies World Health Assembly Executive Board Member States Portal Governing bodies World Health Assembly Executive Board Member States Portal Home/ News/ item/ Fourth meeting of the International Health Regulations (2005) Emergency Committee regarding the upsurge of mpox 2024 – Temporary recommendations **Fourth meeting of the International Health Regulations (2005) Emergency Committee regarding the upsurge of mpox 2024 – Temporary recommendations** The Director-General of the World Health Organization (WHO), following the fourth meeting of the International Health Regulations (2005) (IHR)Emergency Committee regarding the upsurge of mpox 2024, held on 5 June 2025, from 12:00 to 17:00 CEST, concurs with its advice that the event continues to meet the criteria of a public health emergency of international concern and, considering the advice of the Committee, he is hereby issuing a revised set of temporary recommendations. The WHO Director-General expresses his most sincere gratitude to the Chair, Members, and Advisors of the Committee. The proceeding of the fourth meeting of the Committee will be shared with States Parties to the IHR and published in the coming days. --------- **Temporary recommendations** These temporary recommendationsare issued toStates Partiesexperiencing the transmission of monkeypox virus (MPXV),including, but not limited to, those where there issustained community transmission, and where there are clusters of cases or sporadic travel-related cases of MPXV clade Ib. They are intended to be implemented by those States Parties in addition to the currentstanding recommendations for mpox, valid until 20 August 2025. In the context of the global efforts to prevent and control the spread of mpox disease outlined in theWHO Strategic framework for enhancing prevention and control of mpox: 2024–2027, the aforementioned standing recommendations apply to allStates Parties. All current WHO interim technical guidance can be accessed onthis pageof the WHO website. WHO evidence-based guidance has been and will continue to be updated in line with the evolving situation, updated scientific evidence, and WHO risk assessment to support States Parties in the implementation of the WHO Strategic Framework for enhancing mpox prevention and control. Pursuant to Article 3 Principle of the International Health Regulations (2005) (IHR), the implementation of these temporary recommendations, as well as of the standing recommendations for mpox, by States Parties shall be with full respect for the dignity, human rights and fundamental freedoms of persons, in line with the principles set out in Article 3 of the IHR. --------- Note:The text in backets next to each temporary recommendation indicates the status with respect to the set of temporary recommendations issued on27 November 2024. Emergency coordination Secure political commitment and engagement to intensify mpox prevention and response efforts, including resource allocation, for the lowest administrative and operational level reporting mpox cases (hotspots) in the prior 4 weeks. (EXTENDED) Establish or enhance national and local emergency prevention and response coordination arrangements as recommended in theWHO Mpox global strategic preparedness and response plan(2025), and its upcoming iteration, and in line with theWHO Strategic framework for enhancing prevention and control of mpox: 2024–2027. (EXTENDED, with updated reference) Establish or enhance coordination among all partners and stakeholders engaged in or supporting mpox prevention and response activities through cooperation, including by introducing accountability mechanisms. (EXTENDED) Establish a mechanism to monitor the effectiveness of mpox prevention and response measures implemented at lower administrative levels, so that such measures can be adjusted as needed. (EXTENDED) Engage with and strengthen partner organizations for collaboration and support for mpox response, including humanitarian actors in contexts with insecurity, humanitarian corridors, or areas with internal or refugee population displacements and in hosting communities in insecure areas. (EXTENDED, with re-phrasing) Collaborative surveillance Enhance mpox surveillance, by increasing the sensitivity of the approaches adopted and ensuring comprehensive geographic coverage. (EXTENDED) Expand access to accurate, affordable and available diagnostics to test for mpox, including through strengthening arrangements for the transport of samples, the decentralization of testing and arrangements to differentiate MPXV clades and conduct genomic sequencing. (EXTENDED) Identify, monitor and support the contacts of persons with suspected, clinically-diagnosed or laboratory-confirmed mpox to prevent onward transmission. (EXTENDED) Scale up efforts to thoroughly investigate cases and outbreaks of mpox to better understand the modes of transmission and transmission risk, and prevent its onward transmission to contacts and communities. (EXTENDED) Report to WHO suspected, probable and confirmed cases of mpox in a timely manner and on a weekly basis. (EXTENDED) Safe and scalable clinical care Provide clinical, nutritional and psychosocial support for patients with mpox, including, where appropriate and possible, isolation in care centres and/or access to materials and guidance for home-based care. (EXTENDED) Develop and implement a plan to expand access to optimized supportive clinical care for all patients with mpox, including children, pregnant women, and persons living with HIV, recognising the association of mpox-related morbidity and mortality in persons living with HIV with untreated or advanced HIV. This includes prompt identification and effective management of endemic co-infections, such as malaria, chickenpox or measles. This also includes offering HIV tests to adult patients who do not know their HIV status and to children as appropriate, testing and treatment for other sexually transmitted infections (STIs) among cases linked to sexual contact and referral to HIV/STIs treatment and care services when indicated. (EXTENDED, with re-phrasing) Strengthen health and care workers’ capacity, knowledge and skills in clinical and infection and prevention and control pathways – screening, diagnosis, isolation, environmental cleaning, discharge of patients, including post discharge follow up for suspected and confirmed mpox –, and provide health and care workers with personal protective equipment (PPE). (EXTENDED) Strengthen adherence to infection prevention and control (IPC) measures and availability of water, sanitation, hygiene (WASH) and waste management services and infrastructure in healthcare facilities and treatment and care centers to ensure quality healthcare service delivery and protection of health and care workers, caregivers and patients. (EXTENDED, with re-phrasing) International traffic Establish or strengthen cross-border collaboration arrangements for surveillance, management and support of suspected cases and contacts of mpox, and for the provision of information to travellers and conveyance operators, without resorting to travel and trade restrictions that unnecessarily impact local, regional or national economies. (EXTENDED) Vaccination Continue to prepare for and implement targeted use of vaccine for “Phase 1-Stop the outbreak” (as defined in theWHO Mpox global strategic preparedness and response plan(2025)) through the identification of the lowest administrative level reporting cases (hotspots) and targeting those groups at high risk of mpox exposure to interrupt sustained community transmission. (EXTENDED, with rephrasing and updated reference) Develop and implement plans for vaccination in the context of an integrated response at the lowest administrative level reporting cases for people at high risk of exposure (e.g., contacts of cases of all ages, health and frontline workers, and other groups at risk such as those with multiple sexual partners and sex workers in endemic and non-endemic areas). This entails a targeted integrated response, including active surveillance and contact tracing; agile adaptation of immunization strategies and plans to the local context including dose-sparing options (single dose/fractional dosing) in the context of limited availability of vaccines; proactive community engagement to generate and sustain demand for and trust in vaccination; close monitoring of mpox vaccination activities, coverage and adverse events following immunization (AEFI); assessment of vaccine effectiveness; and documenting lessons learned and their implementation. (MODIFIED) Community protection Strengthen risk communication and community engagement in affected communities and local workforces for outbreak prevention, response and vaccination strategies, particularly at the lowest administrative levels reporting cases. Key actions include training, mapping high risk and vulnerable populations for tailored interventions, data driven approaches for social listening, community feedback and dialogue, and managing misinformation. This entails, inter alia, communicating effectively the uncertainties and new information regarding the natural history of mpox and modes of transmission, the effectiveness of mpox vaccines and duration of protection following vaccination, and about any clinical trials to which the local population may have access, as appropriate. (EXTENDED, with re-phrasing) Address stigma and discrimination of any kind via meaningful community engagement, particularly in health services and during risk communication activities, and through engagement with civil society groups, such as HIV networks. (EXTENDED, with re-phrasing) Promote and implement IPC measures and basic WASH and waste management services in household settings, congregate settings (e.g. prisons, internally displaced persons and refugee camps, etc.), schools, points of entry and cross border transit areas. (EXTENDED) Governance and financing Galvanize and scale up national funding and explore external opportunities for targeted funding of mpox prevention, readiness and response activities, advocate for release of available funds and take steps to identify potential new funding partners for emergency response. (EXTENDED) Optimize the use of resources, in the context of global and local external funding shortfalls, by allocating available resources to the implementation of core mpox response interventions needed in the medium term; maximizing their cost-efficiency through cross-programmatic synergetic approaches; and by engaging partners in resource-sharing arrangements to maintain the delivery of essential health services. (NEW) Integrate mpox prevention and response measures, including enhanced surveillance, in existing programmes for prevention, control and treatment of other endemic diseases – especially HIV, as well as STIs, malaria, tuberculosis and other vaccine-preventable diseases, and/or non-communicable diseases – striving to identify activities which will benefit the programmes involved and lead to better health outcomes overall. (EXTENDED) Addressing research gaps Invest in addressing outstanding knowledge gaps and in generating evidence, during and after outbreaks, as defined inA coordinated research roadmap – Mpox virus - Immediate research next steps to contribute to control the outbreak(2024), including for vaccine effectiveness in different contexts. (EXTENDED, with re-phrasing) Invest in field studies to better understand animal hosts and zoonotic spillover in the areas where MPXV is circulating, in coordination with the animal health sector and One Health partners. (EXTENDED) Strengthen and expand use of genomic sequencing to characterize the epidemiology and chains of transmission of MPXV to better inform control measures, particularly regarding the emergence and circulation of new virus strains. (EXTENDED, with re-phrasing) Reporting on the implementation of temporary recommendations Report quarterly to WHO on the status of, and challenges related to, the implementation of these temporary recommendations, using a revised standardized tool and channels that will be made available by WHO, also allowing for the monitoring of progress and the identification of gaps of the national response. (EXTENDED, with re-phrasing) Media Contacts WHO Media Team World Health Organization Related RegionsAfricaAmericasEastern MediterraneanEuropeSouth-East AsiaWestern Pacific Africa Americas Eastern Mediterranean Europe South-East Asia Western Pacific Africa Americas Eastern Mediterranean Europe South-East Asia Western Pacific PoliciesCybersecurityEthicsInformation disclosurePermissions and licensingPreventing sexual exploitationTerms of use Cybersecurity Ethics Information disclosure Permissions and licensing Preventing sexual exploitation Terms of use Cybersecurity Ethics Information disclosure Permissions and licensing Preventing sexual exploitation Terms of use About usCareersFrequently asked questionsLibraryProcurementPublications Careers Frequently asked questions Library Procurement Publications Careers Frequently asked questions Library Procurement Publications Contact us"}