{"id": 505, "name": "Frontiers in Batteries and Electrochemicals", "domain": "frontiersin.org/journals/batteries-and-electrochemistry", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/batteries-and-electrochemistry/articles/10.3389/fbael.2024.1397122/full", "title": "Batteries And Electrochemistry", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Battery Materials Research Battery Performance Battery Systems and Applications Next Generation Batteries and Technologies Supercapacitors Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Battery Materials Research Battery Performance Battery Systems and Applications Next Generation Batteries and Technologies Supercapacitors Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Battery Materials Research Battery Performance Battery Systems and Applications Next Generation Batteries and Technologies Supercapacitors Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office MINI REVIEW article Front. Batter. Electrochem., 03 January 2025 Sec. Battery Materials Research Volume 3 - 2024 |https://doi.org/10.3389/fbael.2024.1397122 **Recycling cathode materials for lithium-ion batteries via Hydro-to-Cathode®method** Ascend Elements, Westborough, MA, United States Due to the rising price and limited resource supply chain of Li [NixMnyCoz]O2(x + y + z = 1) (NMC) cathode material, lithium-ion battery (LIB) recycling technologies have been emerging as the best solution to address the price issue. Mainly, conventional hydrometallurgy processes have been applied to the LIB recycling field in recognition of its value. One remarkable advantage of the hydrometallurgy method is that it serves as a bridge to enable the Hydro-to-Cathode®method. However, using recycled raw materials in the production of precursor cathode materials needs to be studied in parallel with the impurity (dopant) effect. The insufficient selective impurity removal technology leads to unexpected electrochemical properties in the final NMC cathode active material, which can be doped by several different impurities. Consequently, scrutinizing dopant elements (inorganic and organic) is critical if we want to consider the Hydro-to-Cathode®method as a major recycling process of NMC cathode material. **1 Introduction** Since the concept of the lithium-ion battery (LIB) was formalized by John Goodenough, Stanely Wittingham and Akira Yoshino, the LIB was broadly applied to a variety of industries such as electronic devices, military applications, and electric vehicles (EVs) (Bai et al., 2020b;Kim, 2022;Sim et al., 2023). More specifically, the market for EVs has dramatically increased; forecasting 140 million EVs to be operated worldwide by 2030Chemical and Engineering News (2019). When compared to conventional combustion engine vehicles, EVs have relatively simple mechanical systems. They also generate low outgas emissions, resulting in greater attention relative to lower environmental impact. Despite those advantages, the initial version of EVs has been challenging because of limited driving distance per single charge of the LIB. Following the first designed cathode material produced for commercial use, the ternary system of Li [NixMnyCoz]O2(x + y + z = 1) (NMC) LIB cathode material has been in the spotlight. High Ni NMC based LIB cathode material [Li(NixMnyCo1-x-y)O2, x ≥ 0.8] demonstrated particularly high energy density (200–250 mA h/g) and high operating voltage (≥4.3 V vs. Li+/Li) compared to LiFePO4(LFP), LiMn2O4(LMO), and LiCoO2(LCO) based cathode materials, making it sufficient to meet the growing demand of the EV market (Li W. et al., 2020). That said, the high Ni NMC system demonstrates relatively insufficient cycling performance due to poor structural stability (Duan et al., 2019). To compensate for this limitation, researchers have been studying techniques for doping, coating, and tailoring crystalline structure by introducing different elements and solid-state reaction skills (Ko et al., 2023;Susai et al., 2023;Tang et al., 2023;Hong et al., 2024). Nevertheless, the LIB must be replaced every 5–10 years, at which it reaches end of life (EOL) due to the degradation of internal parts and materials (Mishra et al., 2022). Consequently, permanent use of the LIB is mostly impossible. The serious degradation of the cathode active material over time is a major cause of the reduced life of LIB. Cathode materials are an essential part of LIB, as they not only can determine performance of EVs, but also constitute more than half of the entire manufacturing cost of the LIB (Houache et al., 2022). Consequently, due to the high demand of the LIB cathode materials, over time the prices of the LIB raw materials have lacked both control and consistency globally. Li is an essential raw material for cathode material as a source of electrochemical potential compared to others and has been designated as a strategic material for all countries (Bae and Kim, 2021). Ni and Co are also important elements, in terms of energy density and structural stability respectively (Ye et al., 2021). Therefore, many countries have focused on securing these materials. As a result, the price of Li, Ni, and Co have been rising recently. To overcome high price concerns, recycling technologies for LIB cathode materials are considered more commonly in both academic and industrial applications (Jung et al., 2021). In this review, we will cover several recycling methods and subsequent obstacles during the recycling process. **2 Recycling methods** **2.1 Direct recycling** In terms of LIB recycling, there are two substantive approaches to accomplish the demanding task. The first, direct recycling, is an affordable method to meet goals such as cost reduction and suppressing environmental crisis. Compared to indirect recycling methods (pyrometallurgy and hydrometallurgy), direct recycling is more advantageous in terms of simplicity, efficiency, and conservation of energy. It can be broken down into three steps including grinding/delamination, separation, and regeneration (Figure 1). After collecting EOL LIB, they go directly through the grinding process or manual disassembly. From there, cathode material must be separated from grinded powder or delaminated film, which may contain anode, current collectors, and separator. Finally, the refined cathode material would be regenerated through proper treatments (Bai et al., 2020a;Xu et al., 2020;Kim et al., 2021). Figure 1. Direct and indirect recycling methods for NMC cathode material. When it comes to the regeneration process, it requires re-lithiation treatment via heat treatment because the most common failure of cathode material is attributed to Li loss during processing. Typically, the heat treatment process can be proceeded by using Li2CO3as a Li source and has been widely studied due to its high accessibility (Zhang et al., 2013;Ji et al., 2023). Mainly, the regeneration of LMO and LFP based cathode materials has been studied due to low material cost and simple chemical composition. As the cost of those materials is very inexpensive, the conventional recycling method is not needed in this case (Lv et al., 2018). Besides, LCO and NMC cathode materials have been considered for direct recycling by using Li2CO3as a Li source (Nie et al., 2015;Shi et al., 2018). For heat treatment, duration time and temperature should be the most critical factors in addition to the Li source as the primary influencing factor. Though Li2CO3is commonly utilized for re-lithiation studies, LiOH and LiNO3sources were verified from little research. The LiOH source was selected for the hydrothermal re-lithiation process which follows heat treatment (Figure 1) (Sloop et al., 2020). The hydrothermal treated recycled cathode materials showed relatively high cell cycling performance (Xu et al., 2021). Interestingly, there is a way to dramatically reduce lithiation temperature. Huang et al. reported that degraded Li [Ni0.6Mn0.2Co0.2]O2(NMC622) material was sintered with LiOH-LiNO3molten salt for not only re-lithiation but also conversion to single crystal particle to allow for a single body type of cathode material that demonstrated high cycling properties (Huang et al., 2022). Nonetheless, the direct recycling method lacks the flexibility to obtain different cathode chemistries. For instance, the used Li [Ni1/3Mn1/3Co1/3]O2(NMC111), Li [Ni0.5Mn0.3Co0.2]O2(NMC532), and NMC622 chemistries could only be recycled to the exact same NMC chemistry. Therefore, direct recycling cannot satisfy the demand for high Ni NMC cathode materials (Neumann et al., 2022). Even if there is no disruption in the supply of used high Ni NMC, due to the lack of structural stability it is realistically difficult to adopt the direct recycling method for high Ni NMC (Gao et al., 2022). In addition, due to the nature of this recycling concept, electrode, or LIBs cell current collectors such as Cu and Al must be perfectly separated after crushing. It is also worth noting that achieving perfect separation between cathode material and polyvinylidene fluoride (PVDF)/carbon is very challenging considering current technologies (Zhan et al., 2020). In summary, the direct recycling method is not fully applicable to support scaling up to industrial levels as it lacks required technologies. **2.2 Indirect recycling** The second predominant recycling method, indirect recycling, is based on deconstruction through smelting and leaching, and is widely preferred in the industry. Therefore, the pyrometallurgy and hydrometallurgy methods are prevailing routes for the execution of recycling LIB cathode material (Figure 1) (Bae and Kim, 2021;Kader et al., 2021;Latini et al., 2022;Mishra et al., 2022). In terms of recycling process simplicity, pyrometallurgy offers greater simplicity compared to hydrometallurgy. Considering both powder containing pretreated precious metals (black mass) from pretreatments (grinding and separation) or disassembled LIB can directly go through the smelting process, pyrometallurgy offers a simple operation and shortened process time (Latini et al., 2022). However, the smelting process is not viable in terms of energy saving and environmental impact because of high energy consumption and carbon emissions, respectively (Kader et al., 2021). Furthermore, extraction of Li is challenging because it can be incorporated into slag (Makuza et al., 2021;Miao et al., 2022). To overcome the impediments of the pyrometallurgy method, pyrolysis, roasting, and calcination processes have been introduced, allowing relatively low temperature conditions and higher recovery rates of Li (∼93%) and Co (∼99%) (Makuza et al., 2021). Nevertheless, the pyrometallurgy method always requires a leaching process to retrieve precious metals as a post treatment. Accordingly, the hydrometallurgy method has been selected for many years in the LIB cathode material recycling industry. The hydrometallurgy approach is based upon dissolution of spent LIBs via high acidic treatment and extract processes (Lv et al., 2018;Kader et al., 2021;Latini et al., 2022). The entire process involves multiple steps. During acidic treatment, unpleasant gas emissions and a significant volume of wastewater generation are unavoidable (Latini et al., 2022). However, the hydrometallurgy method can achieve high recovery yield as well as high purity of recycled metals. Particularly, the hydrometallurgy method encompasses several different processes such as pretreatment of the battery cell, leaching by acidic solution, selective precipitation of metal, impurity removal, and solvent extraction for drawing Li, Co, Ni, and Mn, separately. Among these processes, the leaching process has been actively studied - not only is the rate of recovery efficiency directly related to the high final yield of precious metals, but it is also directly linked to environmental pollution due to the generation of tons of wasted water after the process (Jung et al., 2021). Naturally, many researchers have been searching for highly efficient and minimally toxic leaching agents. Organic acids are a remarkable leaching agent in terms of environmental benefit. However, the high hurdle for adopting them at industrial scale has deterred widespread use. Therefore, inorganic acids have been broadly utilized for industrial purposes (Or et al., 2020). More specifically, the H2SO4leaching system is widely studied for various methodologies of process through diversification. The H2SO4system has relatively high adaptability to industrial scale compared to other inorganic acids such as HCl, HNO3and H3PO4. Therefore, different concentrations of H2SO4, leaching temperature, additives, etc. can be controlled in terms of different leaching efficiencies for targeted precious LIB materials (Li, Ni, and Co) (Or et al., 2020;Chan et al., 2021;Jung et al., 2021). **2.3 Hydro-to-Cathode®method** The H2SO4leaching system can also allow direct resynthesizing via a co-precipitation process using the purified leached metal solution (Figure 1). This concept was originally patented by Yan Wang et al. in United States, and they named it the Hydro-to-Cathode®method for the very first time (Wang et al., 2013). The Hydro-to-Cathode®method is advantageous for both cost reduction and precursor cathode materials design. The concept itself is designed for creating a closed-loop system, which provides a better solution than conventional recycling methods to improve process time and cost in the LIB material industry. Therefore, research on the Hydro-to-Cathode®concept is actively being conducted in both commercial and academic fields. Ascend Elements plans to open a new large scale LIB precursor cathode and cathode materials plant in the United States using the Hydro-to-Cathode®method (Recycling Today, 2022). Compared to the direct recycling approach, the Hydro-to-Cathode®method not only allows increased accessibility to various cathode chemistries, but also tailoring crystalline structure and surface morphology of precursor cathode material for certain models of battery cells. The Yan Wang group conducted a preliminary study to verify the potential of the Hydro-to-Cathode®method. They showed a direct comparison between recycled and virgin raw NMC metal solutions by a co-precipitation process to evaluate final cathode materials. The Yan Wang group then went through a leaching process with mixed cathode materials [LCO, LMO, NMC111, and LFP]. During this process, Fe was properly removed by pH adjustment and Li2CO3was recovered. After that, Ni1/3Mn1/3Co1/3(OH)2was synthesized by a recycled metal solution. Furthermore, final cathode material was prepared by using the recovered Li2CO3. The recycled cathode material showed a similar range to commercial grade of electrochemical performance. They have also reported recycled cathode material is more economical compared to the normal process. (Zou et al., 2013). Beyond academic field study, they recycled actual LIBs for getting final NMC111 product. Before the leaching process, pretreatments (shredding, magnetic removal, aluminum dissolution, and sieving) were systematically proceeded. For characterization, the final product was analyzed by X-ray diffraction (XRD) measurement, and the peaks matched well with layered structure without any abnormal impurity peaks (Gratz et al., 2014). They also reported that four different feedstocks of EOL LIBs from various manufacturers were utilized for the Hydro-to-Cathode®method. Four precursor cathode materials were co-precipitated to obtain Ni1/3Mn1/3Co1/3(OH)2. The final cathode materials were evaluated with coin cell testing to characterize their electrochemical properties. All four samples showed similar rate capability to commercial cathode material at low C-rates, while they exhibited superior capability in high C-rates. Therefore, they could conclude that the Hydro-to-Cathode®method has minimal impact on the final recycled cathode material (Zheng et al., 2018). Lastly, they executed one batch experiment with up to 30 kg of spent LIBs from different EV manufacturers. The recycled cathode material was compared with commercial cathode material by both coin cell and single layer pouch cell tests. Recycled and commercial cathode materials showed similar properties through discharge ΔSOC (state of charge) tests and direct current resistance tests. This was the first trial for the scaling-up process, so they could confirm Hydro-to-Cathode®is a suitable method in terms of scalability (Chen et al., 2019). Other groups further investigated the effects of impurities in final cathode material. Beak et al. verified that actual recycled NMC metal solution can affect morphology control of precursor cathode material [Ni1/3Mn1/3Co1/3(OH)2]. They reported after converting to cathode material, high levels of metallic impurities could have an unfavorable impact on initial charge/discharge capacity and capacity retention at 55 cycles at coin half-cell test (3.0–4.3 V). They also argued that metallic and nonmetallic impurities are advantageous as dopants in cathode material to get better rate capability than non-doped cathode material (Beak et al., 2022). Kauppinen et al. introduced recycled and purified Mn for Li [Ni0.8Mn0.1Co0.1]O2(NMC811) cathode material. They synthesized precursor cathode materials with three different metal sulfate solutions which contain different levels of metallic impurities (Zn, Ca, K, Mg, and Fe). Following proper sintering processes, they assessed the electrochemical property through pouch cell testing (2.8–4.2 V). After 1,100 cycles, capacity retention showed over 80% and initial discharge capacity reached 184 mA h/g. Therefore, they concluded the recycled raw material is feasible for high Ni NMC cathode material (Kauppinen et al., 2023). **2.4 Impurity (dopant) control for the Hydro-to-Cathode®method** The mentioned experiments with NMC based cathode materials can be considered important because they have studied the real possibilities of the Hydro-to-Cathode®method. The types and levels of impurities would not be easily controllable by impurity removal during the recycling process. Even a small ppm level of impurities could have severe influence on electrochemical properties as a dopant. Furthermore, the combination of impurities with two or three elements can provide different aspects of cell performance rather than what we expected (Tian et al., 2023). Therefore, scrutinizing the doping effect on cathode materials is indispensable if we rely on precursor NMC cathode material synthesized via co-precipitation with recycled metal raw materials. In the last decade, doping effects of specific elements have been investigated through NMC cathode material. In accordance with the operation mechanism of doping in the NMC system, we can divide into two main doping strategies (Figure 2). The first scheme involves introducing similar size of element to either Li or transition metal atoms. These specific elements make it possible to substitute either transition metal atoms or Li. Among all possible elements, Al, Ti, Zr, and Nb are especially considered as structural stabilizers due to their high bonding with the neighbor transition metal atoms (Schipper et al., 2016;Liu et al., 2018;Song et al., 2018;Xin et al., 2019;2022;Yang et al., 2019;Zhang et al., 2019;Park et al., 2020;Zhou et al., 2021;Bizzotto et al., 2023). Therefore, they can lead to high cycling performance and capable performance under high voltage conditions. Other feasible dopants are Na, Mg, and Zn, which can play a pivotal role in improving rate capability by replacing the Li site as a pillar (Du et al., 2015;Huang et al., 2016;Li et al., 2019;Li L. et al., 2020;Liu et al., 2019;Sattar et al., 2020;Gomez-Martin et al., 2022). Figure 2. Two strategies of impurity (dopant) effect on NMC cathode material. The second strategy involves tailoring a preferentially aligned NMC cathode crystalline structure, rather than chemically bonding with a heterogeneous element and the main NMC structure to mitigate collapse of cathode material crystalline structure. For instance, a radial columnar structure, which is designed to extend outward from the center, could be advantageous for getting enhanced electrochemical performance. This uniquely oriented crystalline structure can diminish internal stress and strain caused by charge and discharge, allowing dramatically improved cycling performance to be achievable. B, Ta, W, Sn, and Mo have been studied for forming controlled radial columnar structure by many researchers (Park et al., 2018;Lee et al., 2019;Ryu et al., 2019;Kim et al., 2020;Sun et al., 2021;Thien Nguyen et al., 2021). In particular, B has been acknowledged as a key dopant in terms of structural controlling of NMC cathode material. Because the B doped cathode materials exhibited enhanced cycling performance and discharge capacity, it can be attributed to alleviated internal compressed stress and increased delivery of lithium ions during the charging and discharging processes. Ryu et al. conducted a direct comparison between NMC and Li [NixCoyB1-x-y]O2(NCB) systems to observe B doping effect undoubtedly. They also demonstrated that different doping amounts and sintering temperature could be an adjustable factor to find optimum crystalline structure (Ryu et al., 2020). **3 Discussion and future works** In this mini review, we have discussed several recycling methods for obtaining precious materials from the EOL LIB. It can be divided into two broad categories including direct and indirect recycling methods. The direct recycling method is an attractive approach in terms of saving cost, time, and energy due to the simple nature of the process. However, its technical challenges and limited freedom of NMC composition will limit its utilization in the commercial LIB industry. In contrast, the indirect recycling method provided relatively clear direction toward industrial application. The indirect recycling method is approachable through pyrometallurgy or hydrometallurgy processes. Technically, these processes require completely different paths to break down into precious major raw materials such as Li, Ni, and Co. However, both methods mandatorily go through leaching and extraction processes to draw the raw materials. Therefore, the hydrometallurgy method is advantageous for industrial application. Moreover, the Hydro-to-Cathode®method, which is an advanced variation of the hydrometallurgy method, showed positive signs to attain a closed-loop system. The remaining ppm level of impurities can be doped into the precursor cathode materials, so that the final cathode material will exhibit significantly improved electrochemical properties compared to the virgin cathode material. The improved performance of the cathode material can be attributed to two doping strategies including strengthened structure and oriented crystallite structure. Consequently, the Hydro-to-Cathode®method would be successfully adopted into the industrial field with a genuine understanding of dopant (impurity) impact and precise adjustment skill for impurity control. **Author contributions** JS: Funding acquisition, Writing–original draft, Writing–review and editing. **Funding** The author(s) declare that financial support was received for the research, authorship, and/or publication of this article. This study received funding from Ascend Elements, Inc. **Acknowledgments** The author would like to express appreciation to Sarah Jose for helpful discussion and support. **Conflict of interest** Author JS was employed by Ascend Elements, Inc. **Publisher’s note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **References** Bae, H., and Kim, Y. (2021). Technologies of lithium recycling from waste lithium ion batteries: a review.Mater Adv.2, 3234–3250. doi:10.1039/d1ma00216c CrossRef Full Text|Google Scholar Bai, Y., Muralidharan, N., Li, J., Essehli, R., and Belharouak, I. (2020a). Sustainable direct recycling of lithium-ion batteries via solvent recovery of electrode materials.ChemSusChem13, 5664–5670. doi:10.1002/cssc.202001479 CrossRef Full Text|Google Scholar Bai, Y., Muralidharan, N., Sun, Y. K., Passerini, S., Stanley Whittingham, M., and Belharouak, I. (2020b). Energy and environmental aspects in recycling lithium-ion batteries: concept of battery identity global passport.Mater. Today41, 304–315. doi:10.1016/j.mattod.2020.09.001 CrossRef Full Text|Google Scholar Beak, M., Park, J., Park, S., Jeong, S., Kang, J., Choi, W., et al. (2022). Understanding the effect of nonmetallic impurities in regenerated cathode materials for lithium-ion battery recycling by tracking down impurity elements.J. Hazard. Mater.425, 127907. doi:10.1016/j.jhazmat.2021.127907 PubMed Abstract|CrossRef Full Text|Google Scholar Bizzotto, F., Dachraoui, W., Grissa, R., Zhao, W., Pagani, F., Querel, E., et al. (2023). Modification of NMC811 with titanium for enhanced cycling and high-voltage stability.Electrochimica Acta462, 142758. doi:10.1016/j.electacta.2023.142758 CrossRef Full Text|Google Scholar Chan, K. H., Anawati, J., Malik, M., and Azimi, G. (2021). Closed-loop recycling of lithium, cobalt, nickel, and manganese from waste lithium-ion batteries of electric vehicles.ACS Sustain. Chem. and Eng.9, 4398–4410. doi:10.1021/acssuschemeng.0c06869 CrossRef Full Text|Google Scholar Chemical and Engineering News (2019). It’s time to get serious about recycling lithium-ion batteries. Available at:https://cen.acs.org/materials/energy-storage/time-serious-recycling-lithium/97/i28(Accessed February 26, 2024). Google Scholar Chen, M., Zheng, Z., Wang, Q., Zhang, Y., Ma, X., Shen, C., et al. (2019). Closed loop recycling of electric vehicle batteries to enable ultra-high quality cathode powder.Sci. Rep.9, 1654. doi:10.1038/s41598-018-38238-3 PubMed Abstract|CrossRef Full Text|Google Scholar Du, H., Zheng, Y., Dou, Z., and Zhan, H. (2015). Zn-doped LiNi1/3Co1/3Mn1/3O2 composite as cathode material for lithium ion battery: preparation, characterization, and electrochemical properties.J. Nanomater.2015. doi:10.1155/2015/867618 PubMed Abstract|CrossRef Full Text|Google Scholar Duan, Y., Yang, L., Zhang, M. J., Chen, Z., Bai, J., Amine, K., et al. (2019). Insights into Li/Ni ordering and surface reconstruction during synthesis of Ni-rich layered oxides.J. Mater. Chem. A7, 513–519. doi:10.1039/c8ta10553g CrossRef Full Text|Google Scholar Gao, H., Tran, D., and Chen, Z. (2022). Seeking direct cathode regeneration for more efficient lithium-ion battery recycling.Curr. Opin. Electrochem.31, 100875. doi:10.1016/j.coelec.2021.100875 CrossRef Full Text|Google Scholar Gomez-Martin, A., Reissig, F., Frankenstein, L., Heidbüchel, M., Winter, M., Placke, T., et al. (2022). Magnesium substitution in Ni-rich NMC layered cathodes for high-energy lithium ion batteries.Adv. Energy Mater.12. doi:10.1002/aenm.202103045 CrossRef Full Text|Google Scholar Gratz, E., Sa, Q., Apelian, D., and Wang, Y. (2014). A closed loop process for recycling spent lithium ion batteries.J. Power Sources262, 255–262. doi:10.1016/j.jpowsour.2014.03.126 CrossRef Full Text|Google Scholar Hong, M., Ho, V.-C., and Mun, J. (2024). Comprehensive review of single-crystal Ni-rich cathodes: single-crystal synthesis and performance enhancement strategies.Front. Batter. Electrochem.3. doi:10.3389/fbael.2024.1338069 CrossRef Full Text|Google Scholar Houache, M. S. E., Yim, C. H., Karkar, Z., and Abu-Lebdeh, Y. (2022). On the current and future outlook of battery chemistries for electric vehicles—mini review.Batteries8, 70. doi:10.3390/batteries8070070 CrossRef Full Text|Google Scholar Huang, C., Xia, X., Chi, Z., Yang, Z., Huang, H., Chen, Z., et al. (2022). Preparation of single-crystal ternary cathode materials via recycling spent cathodes for high performance lithium-ion batteries.Nanoscale14, 9724–9735. doi:10.1039/d2nr00993e PubMed Abstract|CrossRef Full Text|Google Scholar Huang, Z., Wang, Z., Jing, Q., Guo, H., Li, X., and Yang, Z. (2016). Investigation on the effect of Na doping on structure and Li-ion kinetics of layered LiNi0.6Co0.2Mn0.2O2 cathode material.Electrochimica Acta192, 120–126. doi:10.1016/j.electacta.2016.01.139 CrossRef Full Text|Google Scholar Ji, G., Wang, J., Liang, Z., Jia, K., Ma, J., Zhuang, Z., et al. (2023). Direct regeneration of degraded lithium-ion battery cathodes with a multifunctional organic lithium salt.Nat. Commun.14, 584. doi:10.1038/s41467-023-36197-6 PubMed Abstract|CrossRef Full Text|Google Scholar Jung, J. C. Y., Sui, P. C., and Zhang, J. (2021). A review of recycling spent lithium-ion battery cathode materials using hydrometallurgical treatments.J. Energy Storage35, 102217. doi:10.1016/j.est.2020.102217 CrossRef Full Text|Google Scholar Kader, Z. A., Marshall, A., and Kennedy, J. (2021). A review on sustainable recycling technologies for lithium-ion batteries.Emergent Mater4, 725–735. doi:10.1007/s42247-021-00201-w CrossRef Full Text|Google Scholar Kauppinen, T., Laine, P., Välikangas, J., Tynjälä, P., Hu, T., Salminen, J., et al. (2023). Co-Precipitation of NCM 811 using recycled and purified manganese: effect of impurities on the battery cell performance.ChemElectroChem10. doi:10.1002/celc.202300265 CrossRef Full Text|Google Scholar Kim, J. H. (2022). Grand challenges and opportunities in batteries and electrochemistry.Front. Batter. Electrochem.1. doi:10.3389/fbael.2022.1066276 CrossRef Full Text|Google Scholar Kim, S., Bang, J., Yoo, J., Shin, Y., Bae, J., Jeong, J., et al. (2021). A comprehensive review on the pretreatment process in lithium-ion battery recycling.J. Clean. Prod.294, 126329. doi:10.1016/j.jclepro.2021.126329 CrossRef Full Text|Google Scholar Kim, U. H., Park, G. T., Son, B. K., Nam, G. W., Liu, J., Kuo, L. Y., et al. (2020). Heuristic solution for achieving long-term cycle stability for Ni-rich layered cathodes at full depth of discharge.Nat. Energy5, 860–869. doi:10.1038/s41560-020-00693-6 CrossRef Full Text|Google Scholar Ko, G., Jeong, S., Park, S., Lee, J., Kim, S., Shin, Y., et al. (2023). Doping strategies for enhancing the performance of lithium nickel manganese cobalt oxide cathode materials in lithium-ion batteries.Energy Storage Mater.60, 102840. doi:10.1016/j.ensm.2023.102840 CrossRef Full Text|Google Scholar Latini, D., Vaccari, M., Lagnoni, M., Orefice, M., Mathieux, F., Huisman, J., et al. (2022). A comprehensive review and classification of unit operations with assessment of outputs quality in lithium-ion battery recycling.J. Power Sources546, 231979. doi:10.1016/j.jpowsour.2022.231979 CrossRef Full Text|Google Scholar Lee, S. H., Jin, B. S., and Kim, H. S. (2019). Superior Performances of B-doped LiNi0.84Co0.10Mn0.06O2 cathode for advanced LIBs.Sci. Rep.9, 17541. doi:10.1038/s41598-019-54115-z PubMed Abstract|CrossRef Full Text|Google Scholar Li, H., Zhou, P., Liu, F., Li, H., Cheng, F., and Chen, J. (2019). Stabilizing nickel-rich layered oxide cathodes by magnesium doping for rechargeable lithium-ion batteries.Chem. Sci.10, 1374–1379. doi:10.1039/c8sc03385d PubMed Abstract|CrossRef Full Text|Google Scholar Li, L., Liu, Q., Huang, J., Luo, S., Sun, H., Zheng, H., et al. (2020). Synthesis and electrochemical properties of Zn-doping LiNi1/3Co1/3Mn1/3O2 cathode material for lithium-ion battery application.J. Mater. Sci. Mater. Electron.31, 12409–12416. doi:10.1007/s10854-020-03787-9 CrossRef Full Text|Google Scholar Li, W., Erickson, E. M., and Manthiram, A. (2020). High-nickel layered oxide cathodes for lithium-based automotive batteries.Nat. Energy5, 26–34. doi:10.1038/s41560-019-0513-0 CrossRef Full Text|Google Scholar Liu, A., Zhang, N., Li, H., Inglis, J., Wang, Y., Yin, S., et al. (2019). Investigating the effects of magnesium doping in various Ni-rich positive electrode materials for lithium ion batteries.J. Electrochem Soc.166, A4025–A4033. doi:10.1149/2.1101915jes CrossRef Full Text|Google Scholar Liu, S., Dang, Z., Liu, D., Zhang, C., Huang, T., and Yu, A. (2018). Comparative studies of zirconium doping and coating on LiNi0.6Co0.2Mn0.2O2 cathode material at elevated temperatures.J. Power Sources396, 288–296. doi:10.1016/j.jpowsour.2018.06.052 CrossRef Full Text|Google Scholar Lv, W., Wang, Z., Cao, H., Sun, Y., Zhang, Y., and Sun, Z. (2018). A critical review and analysis on the recycling of spent lithium-ion batteries.ACS Sustain. Chem. and Eng.6, 1504–1521. doi:10.1021/acssuschemeng.7b03811 CrossRef Full Text|Google Scholar Makuza, B., Tian, Q., Guo, X., Chattopadhyay, K., and Yu, D. (2021). Pyrometallurgical options for recycling spent lithium-ion batteries: a comprehensive review.J. Power Sources491, 229622. doi:10.1016/j.jpowsour.2021.229622 CrossRef Full Text|Google Scholar Miao, Y., Liu, L., Zhang, Y., Tan, Q., and Li, J. (2022). An overview of global power lithium-ion batteries and associated critical metal recycling.J. Hazard. Mater.425, 127900. doi:10.1016/j.jhazmat.2021.127900 PubMed Abstract|CrossRef Full Text|Google Scholar Mishra, G., Jha, R., Meshram, A., and Singh, K. K. (2022). A review on recycling of lithium-ion batteries to recover critical metals.J. Environ. Chem. Eng.10, 108534. doi:10.1016/j.jece.2022.108534 CrossRef Full Text|Google Scholar Neumann, J., Petranikova, M., Meeus, M., Gamarra, J. D., Younesi, R., Winter, M., et al. (2022). Recycling of lithium-ion batteries—current state of the art, circular economy, and next generation recycling.Adv. Energy Mater.12. doi:10.1002/aenm.202102917 CrossRef Full Text|Google Scholar Nie, H., Xu, L., Song, D., Song, J., Shi, X., Wang, X., et al. (2015). LiCoO2: recycling from spent batteries and regeneration with solid state synthesis.Green Chem.17, 1276–1280. doi:10.1039/c4gc01951b CrossRef Full Text|Google Scholar Or, T., Gourley, S. W. D., Kaliyappan, K., Yu, A., and Chen, Z. (2020). Recycling of mixed cathode lithium-ion batteries for electric vehicles: current status and future outlook.Carbon Energy2, 6–43. doi:10.1002/cey2.29 CrossRef Full Text|Google Scholar Park, K., Ham, D. J., Park, S. Y., Jang, J., Yeon, D. H., Moon, S., et al. (2020). High-Ni cathode material improved with Zr for stable cycling of Li-ion rechargeable batteries.RSC Adv.10, 26756–26764. doi:10.1039/d0ra01543a PubMed Abstract|CrossRef Full Text|Google Scholar Park, K. J., Jung, H. G., Kuo, L. Y., Kaghazchi, P., Yoon, C. S., and Sun, Y. K. (2018). Improved cycling stability of Li[Ni0.90Co0.05Mn0.05]O2 through microstructure modification by boron doping for Li-ion batteries.Adv. Energy Mater.8. doi:10.1002/aenm.201801202 CrossRef Full Text|Google Scholar Recycling Today (2022). Ascend Elements breaks ground on Kentucky facility. Available at:https://www.recyclingtoday.com/news/ascend-elements-kentucky-facility-battery-recycling-groundbreaking/(Accessed February 25, 2024). Google Scholar Ryu, H. H., Park, K. J., Yoon, D. R., Aishova, A., Yoon, C. S., and Sun, Y. K. (2019). Li[Ni0.9Co0.09W0.01]O2: a new type of layered oxide cathode with high cycling stability.Adv. Energy Mater.9. doi:10.1002/aenm.201902698 PubMed Abstract|CrossRef Full Text|Google Scholar Ryu, H. H., Park, N. Y., Yoon, D. R., Kim, U. H., Yoon, C. S., and Sun, Y. K. (2020). New class of Ni-rich cathode materials Li[NixCoyB1−x−y]O2for next lithium batteries.Adv. Energy Mater.10. doi:10.1002/aenm.202000495 CrossRef Full Text|Google Scholar Sattar, T., Lee, S. H., Sim, S. J., Jin, B. S., and Kim, H. S. (2020). Effect of Mg-doping on the electrochemical performance of LiNi0.84Co0.11Mn0.05O2 cathode for lithium ion batteries.Int. J. Hydrogen Energy45, 19567–19576. doi:10.1016/j.ijhydene.2020.04.292 CrossRef Full Text|Google Scholar Schipper, F., Dixit, M., Kovacheva, D., Talianker, M., Haik, O., Grinblat, J., et al. (2016). Stabilizing nickel-rich layered cathode materials by a high-charge cation doping strategy: zirconium-doped LiNi0.6Co0.2Mn0.2O2.J. Mater. Chem. A4, 16073–16084. doi:10.1039/c6ta06740a CrossRef Full Text|Google Scholar Shi, Y., Chen, G., Liu, F., Yue, X., and Chen, Z. (2018). Resolving the compositional and structural defects of degraded LiNixCoyMnzO2particles to directly regenerate high-performance lithium-ion battery cathodes.ACS Energy Lett.3, 1683–1692. doi:10.1021/acsenergylett.8b00833 CrossRef Full Text|Google Scholar Sim, Y. B., Park, B. K., and Kim, K. J. (2023). Reasonable design of thick electrodes in lithium-ion batteries.Front. Batter. Electrochem.2. doi:10.3389/fbael.2023.1272439 CrossRef Full Text|Google Scholar Sloop, S., Crandon, L., Allen, M., Koetje, K., Reed, L., Gaines, L., et al. (2020). A direct recycling case study from a lithium-ion battery recall.Sustain. Mater. Technol.25, e00152. doi:10.1016/j.susmat.2020.e00152 CrossRef Full Text|Google Scholar Song, J. H., Bae, J., Lee, K. W., Lee, I., Hwang, K., Cho, W., et al. (2018). Enhancement of high temperature cycling stability in high-nickel cathode materials with titanium doping.J. Industrial Eng. Chem.68, 124–128. doi:10.1016/j.jiec.2018.07.036 CrossRef Full Text|Google Scholar Sun, H. H., Kim, U. H., Park, J. H., Park, S. W., Seo, D. H., Heller, A., et al. (2021). Transition metal-doped Ni-rich layered cathode materials for durable Li-ion batteries.Nat. Commun.12, 6552. doi:10.1038/s41467-021-26815-6 PubMed Abstract|CrossRef Full Text|Google Scholar Susai, F. A., Bano, A., Maiti, S., Grinblat, J., Chakraborty, A., Sclar, H., et al. (2023). Stabilizing Ni-rich high energy cathodes for advanced lithium-ion batteries: the case of LiNi0.9Co0.1O2.J. Mater. Chem. A11, 12958–12972. doi:10.1039/d3ta00444a CrossRef Full Text|Google Scholar Tang, Z., Feng, D., Xu, Y., Chen, L., Zhang, X., and Ma, Q. (2023). Safety issues of layered nickel-based cathode materials for lithium-ion batteries: origin, strategies and prospects.Batteries9, 156. doi:10.3390/batteries9030156 CrossRef Full Text|Google Scholar Thien Nguyen, T., Kim, U. H., Yoon, C. S., and Sun, Y. K. (2021). Enhanced cycling stability of Sn-doped Li[Ni0.90Co0.05Mn0.05]O2 via optimization of particle shape and orientation.Chem. Eng. J.405, 126887. doi:10.1016/j.cej.2020.126887 CrossRef Full Text|Google Scholar Tian, X., Guo, R., Bai, Y., Li, N., Wang, X., Wang, J., et al. (2023). High-performance high-nickel multi-element cathode materials for lithium-ion batteries.Batteries9, 319. doi:10.3390/batteries9060319 CrossRef Full Text|Google Scholar Wang, Y., Apelian, D., and Zou, H. (2013). Method and apparatus for recycling lithium-ion batteries. Washington, DC:U.S. Patent and Trademark Office, 827–B2. Google Scholar Xin, F., Goel, A., Chen, X., Zhou, H., Bai, J., Liu, S., et al. (2022). Electrochemical characterization and microstructure evolution of Ni-rich layered cathode materials by niobium coating/substitution.Chem. Mater.34, 7858–7866. doi:10.1021/acs.chemmater.2c01461 CrossRef Full Text|Google Scholar Xin, F., Zhou, H., Chen, X., Zuba, M., Chernova, N., Zhou, G., et al. (2019). Li-Nb-O coating/substitution enhances the electrochemical performance of the LiNi0.8Mn0.1Co0.1O2 (NMC 811) cathode.ACS Appl. Mater Interfaces11, 34889–34894. doi:10.1021/acsami.9b09696 PubMed Abstract|CrossRef Full Text|Google Scholar Xu, P., Dai, Q., Gao, H., Liu, H., Zhang, M., Li, M., et al. (2020). Efficient direct recycling of lithium-ion battery cathodes by targeted healing.Joule4, 2609–2626. doi:10.1016/j.joule.2020.10.008 CrossRef Full Text|Google Scholar Xu, P., Yang, Z., Yu, X., Holoubek, J., Gao, H., Li, M., et al. (2021). Design and optimization of the direct recycling of spent Li-ion battery cathode materials.ACS Sustain. Chem. and Eng.9, 4543–4553. doi:10.1021/acssuschemeng.0c09017 CrossRef Full Text|Google Scholar Yang, X., Tang, Y., Shang, G., Wu, J., Lai, Y., Li, J., et al. (2019). Enhanced cyclability and high-rate capability of LiNi0.88Co0.095Mn0.025O2 cathodes by homogeneous Al3+ doping.ACS Appl. Mater Interfaces11, 32015–32024. doi:10.1021/acsami.9b10558 PubMed Abstract|CrossRef Full Text|Google Scholar Ye, Z., Qiu, L., Yang, W., Wu, Z., Liu, Y., Wang, G., et al. (2021). Nickel-Rich layered cathode materials for lithium-ion batteries.Chem. - A Eur. J.27, 4249–4269. doi:10.1002/chem.202003987 PubMed Abstract|CrossRef Full Text|Google Scholar Zhan, R., Payne, T., Leftwich, T., Perrine, K., and Pan, L. (2020). De-agglomeration of cathode composites for direct recycling of Li-ion batteries.Waste Manag.105, 39–48. doi:10.1016/j.wasman.2020.01.035 PubMed Abstract|CrossRef Full Text|Google Scholar Zhang, D., Liu, Y., Wu, L., Feng, L., Jin, S., Zhang, R., et al. (2019). Effect of Ti ion doping on electrochemical performance of Ni-rich LiNi0.8Co0.1Mn0.1O2 cathode material.Electrochimica Acta328, 135086. doi:10.1016/j.electacta.2019.135086 CrossRef Full Text|Google Scholar Zhang, X., Xie, Y., Lin, X., Li, H., and Cao, H. (2013). An overview on the processes and technologies for recycling cathodic active materials from spent lithium-ion batteries.J. Mater Cycles Waste Manag.15, 420–430. doi:10.1007/s10163-013-0140-y CrossRef Full Text|Google Scholar Zheng, Z., Chen, M., Wang, Q., Zhang, Y., Ma, X., Shen, C., et al. (2018). High performance cathode recovery from different electric vehicle recycling streams.ACS Sustain. Chem. and Eng.6, 13977–13982. doi:10.1021/acssuschemeng.8b02405 CrossRef Full Text|Google Scholar Zhou, K., Xie, Q., Li, B., and Manthiram, A. (2021). An in-depth understanding of the effect of aluminum doping in high-nickel cathodes for lithium-ion batteries.Energy Storage Mater.34, 229–240. doi:10.1016/j.ensm.2020.09.015 CrossRef Full Text|Google Scholar Zou, H., Gratz, E., Apelian, D., and Wang, Y. (2013). A novel method to recycle mixed cathode materials for lithium ion batteries.Green Chem.15, 1183–1191. doi:10.1039/c3gc40182k CrossRef Full Text|Google Scholar Keywords:recycling, lithium-ion battery, Hydro-to-Cathode®, cathode material, closed-loop system Citation:Shim JH (2025) Recycling cathode materials for lithium-ion batteries via Hydro-to-Cathode®method.Front. Batteries Electrochem.3:1397122. doi: 10.3389/fbael.2024.1397122 Received:06 March 2024;Accepted:11 December 2024;Published:03 January 2025. Edited by: Reviewed by: Copyright© 2025 Shim. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY).The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Jong Hyun Shim,anNoaW1AYXNjZW5kZWxlbWVudHMuY29t Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract 1 Introduction 2 Recycling methods 3 Discussion and future works Author contributions Funding Acknowledgments Conflict of interest Publisher’s note References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}