{"id": 578, "name": "Financial Times", "domain": "ft.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://enterprise.ft.com/en-gb/services/group-subscriptions/secondary-education/", "title": "Group Subscriptions", "content": "**For high/secondary schools** Free access to FT.com for high/secondary teachers,schools and students anywhere in the world. Supported by: Sign up Background Student Advocate Programme Testimonials Meet the team Sign up Background Student Advocate Programme Testimonials Meet the team **Get your sign-up link** **1Check if your school is already registered** Good news! It looks like your school has free access toft.com.Select your school from the list below to request your sign-up link. If your school is not displayed below and you are a teacher or administrator pleaseregister your interestOr if you are a student, parent or friend of a school that is not registered, please sharethis linkwith a school administrator. **2Select your school** Unfortunately, that school is not signed up to the FT schools programme.Register your interest. **3Enter your school email address** To sign up for free access to FT.com you must be a student between the ages of 16-19 and agree to ourT&Cs.For more information about how we use your data, please refer to ourprivacyandcookiepolicies. **Register now** Please fill in the form to register your interest. A member of the team willbe in touch to discuss setting up your institution with free FT access. Only a school staff member should fill in this form.If you are a student, please share this page with a staff member so they can sign-up.For any inquiries after registering, please clickhere.For other inquiries, please emailFTschools.support@ft.com. **Your details** **Your school** **Stay up to date** Choose how you want us to contact you. Account holders can update these any time in their preferences. Get the most from the Financial Times with personalised special reports, recommended reads and latest feature announcements. Receive exclusive personalised event invitations, carefully-curated offers and promotions from The Financial Times We'll still send you service messages about your account, security or legal notifications. For more information about how we use your data, please refer to ourprivacyandcookie policies. **Thank you for your enquiry** A member of the team will be in touch shortly to start the process of enabling free FT.com access for your staff and students. **Preparing for life after school** Free access to FT.com can help students with relevant and fresh ideas for study, extra-curricular activities, advice on the world of work and interviews. Universities and employers confirm that broader general knowledge helps the best candidates stand out. For a full description, clickhere. Participants receive access to all FT.com content available to regular subscribers. In addition, with the help of teachers, we highlight and guide readers to FT journalism that can enrich education and help prepare students for successful careers. What does FT do for students Improve learning through examples of concepts learned in the classroom Prepare for the world beyond school through tips and insights Broaden general knowledge to prepare for active life and citizenship Develop news literacy to tackle disinformation If you are a teacher, librarian or school officerRegister your interestfor free access to FT.com. This offer is for any school worldwide teaching 16-19 year old students. If you are a student, parent, governor or someone else with an interest Please share details with teachers, schools and colleges you know and tell them to register atft.com/schoolsarefree. For more information you can read ourguide to the Financial Times for schools programme, or if your school already has access, ourguide to creating or reactivating your FT.com account. **Our journey** John Ridding, CEO of the FT, gave a talk at my school on journalism when I was 15. I found it fascinating and wanted to learn more about reporting the news and the role it plays in our lives. After an opportunistic chat following the lecture, John agreed to let me spend some time at the FT to better understand journalism in action. During my time absorbing how the FT works, it occurred to me that there was a role for its journalism to keep informed young people emerging into the adult world.My generation will inherit so many different challenges so we need to be more informed and engaged in these big global issues from a younger age. We must get access to high-quality journalism. I told John that the FT had a responsibility to help people like me to better understand the world. So the idea of FT Schools was born. From here, lots of conversations with some truly inspiring people across the FT brought the idea to life. I am grateful to John and the rest of the FT Board for their open-mindedness and willingness to listen to me when at the time, I was a teenage outsider.Once hired, I was fortunate enough to work with brilliant people to bring the FT to students around the world. I am very proud of what we achieved and how FT Schools continues to grow, helping students with everything from essays and everyday school work, to helping them make the next decision about their future after school.KRISHAN PUVVADAFT Schools Founder **Our Student Advocate Programme** The Financial Times is offering ambitious students in high/secondary schools around the world the chance to become FT advocates. Student Advocates will develop leadership skills and confidence by representing the views of students to the FT and promoting the advantages of reading the FT to their friends and teachers. Advocates will become the voice of students so we can better understand their views, vision and ambitions. Schools can also benefit from a more engaged and informed students. The role can be completed from their school, maintaining a regular communication with the FT Schools team digitally. The role is unpaid and the placement runs for four months, typically from October to February. We recommend that students spend roughly four hours per month on their role. If your secondary school does not have access to FT.com, you cansign up for free. For more information, please refer to theFAQsandguidelinesbelow. We also welcome teachers as FT advocates and advisers, to help suggest content and formats to make the FT useful in teaching. Email us for details atFTschools.support@ft.com. As a Student Advocate I learned many things including proactivity, teamwork, public speaking and networking. I have also improved my time management skills, learning to balance my FT work with my school work, which will be helpful for university. I would recommend being a Student Advocate to anyone looking to develop transferable skills, regardless of what they are studying and it has been a confidence booster, and something I never would have done before. **Read the case study** Findout more about the Student Advocate Programmeand discover what the benefits could mean for you. **Student Advocate Programme 2025-26** Nominations for the Student Advocate Programme will open in September 2025. Get notified as soon as nominations open. **Guidelines** Student Advocates must prioritise their school work over this role. If you (or your teachers) feel that your workload is too much, you must pause your participation activities until you have more time. If this happens, please email your mentor who will be able to offer the support you need. Participation in the FT Student Advocate Forum is encouraged but isn’t compulsory. When posting on the forum, you must not post any content that:a) belongs to someone else (such as copyright material);b) consists of advertising, sponsored or promotional links or content;c) is offensive, defamatory, threatening or indecent;d) discriminates on the grounds of race, religion, sex, gender, sexual orientation, disability or age; ore) personally attacks other members of the forum. You must not act in any way that is harmful to the FT or your school. You must only promote the FT within your school, not externally. You must not use the FT brand to promote or endorse any of your other activities. We encourage Student Advocates to be creative, but ideas which involve using the FT brand must be cleared with the FT first via Slack. The FT can cancel your participation at any time if we believe that you have broken any of these rules. If we cancel your participation then you must stop all activity relating to it. **Frequently Asked Questions** Schools can offer two curious and ambitious students a work experience opportunity at a prestigious news organisation. Improving engagement with current affairs makes for a more informed sixth form: 92% of FT reading students say the FT improves their intellectual curiosity and 85% feel they understand their subjects better from reading the FT. This Programme is great for schools looking to demonstrate they are meeting the Gatsby careers benchmarks. Teachers must nominate no more than two Student Advocates in Year 12-13/Grades 10-12 per school. Schools can decide how they choose their Student Advocate. Often teachers ask students to write an application as to why they think they would excel in the role. Nominations must be submitted by 10am BST on Monday 13 October 2025. Please note that, due to high demand, a nomination does not guarantee a place on the programme. 100% of students in previous years felt they had some or significant development in their time management, leadership, communication and creativity and public speaking in their exit survey. Students will be able to showcase these new skills gained through working for the FT in their personal statement/CV, helping to make applications more impressive. The Programme is also an excellent networking opportunity. Students will work with like-minded, bright young people and the FT Schools team. References will also be made available upon request to those students who are actively engaged with the programme. Student Advocates will show their friends and teachers the benefits of reading the FT in school such as: understanding topics taught in lessons better, adding real world context to essays, preparing for university applications and feeling more confident with careers and personal finance decisions. Student Advocates will also develop ideas to help transform the FT into a more compelling resource for young people. This will entail: Researching how the FT is used and perceived in your their community Creating and sharing content inspired by FT journalism Organising events or initiatives that spark discussion around current affairs Advocates take part in monthly calls with FT staff and fellow Advocates at schools around the world. The internship is entirely remote - all work is done either online or in school. There are no current visits to the FT offices. The programme runs for four months each academic year, typically from October to February. It is entirely flexible, but we recommend roughly 4 hours per month. Academic work should come first, and students should pause participation if their workload becomes too much. You can speak with your mentor if you have any concerns. Students are grouped together in clusters of Advocates from schools around the world. Each cluster is mentored by aStudent University Mentor. Their mentor will answer questions on Slack, post feedback/new resources as well as lead monthly calls. Mentors will be the point of contact for Advocates, but there will be involvement from others in the FT Schools Team including the Project Lead for FT Schools. The FT will provide the advocates with all the resources needed to complete the prescribed tasks, help Advocates develop their own ideas for how to increase awareness of the FT in schools and support students in their personal development throughout the Programme. **What teachers say about FT Schools** The FT is a fantastic resource for students to practice applying theory in context, as they will have to do in the external exams. The FT provides a reliable news source for our students who are exploring African, Asian and Latin American countries. Many of the sources that we have used in the past offered only cursory or second hand assessments of breaking news events. We appreciate the fact that this authoritative resource is not hidden behind a paywall. Our students deserve access to the best global journalism available. The FT is a very valuable tool for both staff and students. It allows students to develop their independent thinking skills by linking real life scenarios and news events to what they are currently studying. It also allows students to enhance their reading and academic literacy skills which are vital for further study and education. Financial Times articles are extremely valuable as they can be incorporated into lessons as a way for students to understand the wider economic environment. This helps them to foster an interest and develop enthusiasm for Business and Economics. Reading FT articles in class also helps our school to promote high literacy standards as the topics link well to exam style questions. **What students say about FT Schools** I thought all FT articles would be about the economy and businesses but I have now found a new passion: travel articles. As a Student Advocate at FT, I have been able to harness my unconventional approach to theory and knowledge through the use of the FT Schools Hub Subject Picks. I have found these picks to be curated in an atypical yet illuminating research angle. This approach encourages my passion to work across traditional boundaries of biological organisation. When it comes to staying informed with news and global events, the Financial Times has been an invaluable tool for me. Its engaging content, complete with graphics and visuals, ensures that I receive the latest updates, and the email reminders provide concise snapshots of important news developments. In terms of complimenting my education, the Financial Times has played an important role in exceeding the standards of my studies, especially in my A-Level subjects. The FT has provided me with a reliable and unbiased news source providing information on news and events both globally and locally. The FT complements my education through providing current and detailed examples of events occurring in the world of business and economics and further afield that I can apply to my studies. The Subject Picks have been particularly useful in enabling me to succeed in my A-levels as they have provided examples for my specific subjects which I apply into my answers. James Lamont Director, Strategic Partnerships Andrew Jack Global Education Editor Kimberley Lim Operations Manager Olivia Hylton Project Lead Terms & Conditions Privacy Cookies Copyright Slavery Statement & Policies Markets data delayed by at least 15 minutes. © THE FINANCIAL TIMES LTD 2025. FT and ‘Financial Times’ are trademarks of The Financial Times Ltd.The Financial Times and its journalism are subject to a self-regulation regime under theFT Editorial Code of Practice."}