{"id": 472, "name": "WTTG - Fox 5 - DC", "domain": "fox5dc.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.fox5dc.com/connect-with-fox-5-on-mobile-social-smart-tv-and-our-newsletter", "title": "Connect With Fox 5 On Mobile Social Smart Tv And Our Newsletter", "content": "Live News Weather Things To Do Contests More Washington, D.C. Virginia Maryland 24/7 DC LIVE: News & Weather National News Crime Sports Business Consumer Health Personal Finance FOX News Sunday Top Stories Forecast FOX 5 Skycams Traffic School Closings & Delays FOX 5 Weather App FOX Weather LION Lunch Hour Cooking With Como Lights! Camera! McCarthy! DMV Destinations Pay It Forward Zip Trip 2025 LION Lunch Hour DMV Zone Like It Or Not! The Final 5 On The Hill In The Courts FOX 5 Live Zone Three Weeks of Hell: The DC Snipers Motivation with Marissa The Good Word Missing Pieces New York News - FOX 5 NY Philadelphia News - FOX 29 Philadelphia New Jersey News - My9NJ Election Election Results Donald J. Trump D.C. Politics Maryland Politics Virginia Politics TV Listings LiveNOW from FOX FOX Shows How to watch FOX 5 DC on FOX Local FOX 5 Live InstaPoll Closed Captioning Contact Us FOX LOCAL App for Smart TV FOX 5 Newsletter FOX 5 Mobile Apps Social Media Contests FCC Public File FCC Applications Internships Jobs at FOX 5 Personalities **Connect with FOX 5 on Mobile, Social, Smart TV, and our Newsletter** FOX 5 DCis here, there, and everywhere you are on the web. We'll run down how to connect with us on all of our social media channels, mobile apps, email newsletter, and much more. Think of this as FOX 5's \"Free and Easy Pack\" to keep up with local news - anytime, anywhere. **FOX 5 Mobile Apps (iOS and Android)** Whether you have an iPhone, iPad or an Android device, we have you covered with two apps. Install the News app today on your device Apple Android Install our Weather app today on your device Apple Android **FOX 5 on Social Media (Twitter, Facebook and Instagram)** We're on Twitter, Facebook and Instagram. We share breaking news in-the-moment on Twitter, share stories as they develop on Facebook and offer additional content on our Instagram channel! FOX 5 on Twitter FOX 5 on Facebook FOX 5 on Instagram FOX 5 on TikTok Connect withFOX 5's Personalities by visiting their bio and clicking the social media channelsat the top! **FOX 5 Video Content for Mobile and Smart TV (FOX LOCAL, Tubi, Amazon News, FOXNOW, YouTube, and more)** Our site (the one you're on right now!) is the best place to watch our live streams of news and special programming, clips from all of our shows and much more. FOX 5 news programming, videos on demand, and live news from other FOX Television Stations and LiveNOW from FOX is available on the FOX LOCAL app for Smart TVs. FOX 5 on YouTube: You can also watch a ton of content on FOX 5's YouTube channel!Subscribe and watch on your desktop, mobile device or Smart TV (such as Roku, Apple TV, and Google/Android TV) FOX 5 news programming, in addition tocontent from FOXis available on theFOXNOW app for iOS, Android, Amazon Fire TV and Roku FOX 5 news programming and other programs are available onTubi apps for mobile and a number of Smart TV platforms. **FOX 5 DC Newsletter** On weekdays we send out 5 stories we think you'd like to read to start your day. Sign up below! **Latest News** **Commanders receiver Noah Brown carted off the field at minicamp: Day 2 Highlights** **FBI looking to move training from Virginia to Alabama: reports** **Here's how much it costs to live comfortably in Virginia, Maryland** **Nola Dinkins: Body found amid search for girl, 3, after mom accused of lying about abduction** **Nola Dinkins: Body found amid search for girl, 3, after mom accused of lying about abduction** Washington, D.C. Virginia Maryland 24/7 DC LIVE: News & Weather National News Crime Sports Business Consumer Health Personal Finance FOX News Sunday Top Stories Forecast FOX 5 Skycams Traffic School Closings & Delays FOX 5 Weather App FOX Weather LION Lunch Hour Cooking With Como Lights! Camera! McCarthy! DMV Destinations Pay It Forward Zip Trip 2025 LION Lunch Hour DMV Zone Like It Or Not! The Final 5 On The Hill In The Courts FOX 5 Live Zone Three Weeks of Hell: The DC Snipers Motivation with Marissa The Good Word Missing Pieces New York News - FOX 5 NY Philadelphia News - FOX 29 Philadelphia New Jersey News - My9NJ Election Election Results Donald J. Trump D.C. Politics Maryland Politics Virginia Politics TV Listings LiveNOW from FOX FOX Shows How to watch FOX 5 DC on FOX Local FOX 5 Live InstaPoll Closed Captioning Contact Us FOX LOCAL App for Smart TV FOX 5 Newsletter FOX 5 Mobile Apps Social Media Contests FCC Public File FCC Applications Internships Jobs at FOX 5 Personalities youtube facebook twitter instagram tiktok email New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File About Us Jobs at FOX 5 Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"}