{"id": 1569, "name": "West Hawii Today", "domain": "westhawaiitoday.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.westhawaiitoday.com/2025/06/10/hawaii-news/broadband-bill-becomes-law-measure-intends-to-improve-access-to-affordable-reliable-high-speed-internet/", "title": "Broadband Bill Becomes Law Measure Intends To Improve Access To Affordable Reliable High Speed Internet", "content": "Editors’ Picks Local Entertainment FeaturesCalendar Calendar Calendar Hawaii News Obituaries Sports Classifieds Legal Ads JobsWHT JobsHawaii Jobs WHT Jobs Hawaii Jobs WHT Jobs Hawaii Jobs Homes Autos Search Business CommunityCalendarSubmit an Event Calendar Submit an Event Calendar Submit an Event Editors' Picks Entertainment FeaturesSpecial SectionsReal EstateComicsPolitical CartoonsHoroscopesPuzzlesSudokuCrosswordsWord Games Special Sections Real Estate Comics Political Cartoons Horoscopes Puzzles Sudoku Crosswords Word Games Special Sections Real Estate Comics Political Cartoons Horoscopes Puzzles Sudoku Crosswords Word Games Hawaii News LocalSubmit News Submit News Submit News Nation and World News Obituaries OpinionNational ViewsOur ViewYour VoiceSubmit Letter National Views Our View Your Voice Submit Letter National Views Our View Your Voice Submit Letter Politics Sports Weather Partner ContentPartner Videos Partner Videos Partner Videos Email Preferences Legal Ads WHT Jobs Hawaii Jobs Homes Autos ArchivesSpecial Sections Archives Special Sections Archives Special Sections Archives Our CompanyAbout UsContact UsPrivacy PolicyAdvertise About Us Contact Us Privacy Policy Advertise About Us Contact Us Privacy Policy Advertise Search **Broadband bill becomes law: Measure intends to improve access to affordable, reliable high-speed internet** NAKAMURA ALDRICH ILAGAN LUKE Lt. Gov. Sylvia Luke signed into law Monday a bill that moves the office responsible for improving broadband internet access statewide from the Department of Business, Economic Development and Tourism to the Department of Accounting and General Services. Lt. Gov. Sylvia Luke signed into law Monday a bill that moves the office responsible for improving broadband internet access statewide from the Department of Business, Economic Development and Tourism to the Department of Accounting and General Services. Luke said the new law takes “a necessary step toward a future where every resident, regardless of geography, regardless of age or income, can connect to and use affordable, reliable broadband internet to access education, health care and economic opportunity.” During an event held at the Hawaii Public Library in Honolulu, Luke — who is acting governor while Gov. Josh Green is in Washington, D.C., on business — signed into law House Bill 934. The measure — introduced by Rep. Greggor Ilagan, a Puna Democrat, with co-signers including the entire contingent of Big Island House members — changes the name of the Hawaii Broadband and Digital Equity Office to, simply, the Broadband Office. It also appropriates funds. “This law not only lays the groundwork for much needed services, it also helps ensure keiki through kupuna acquire the skills and support they need to use the internet to improve their daily lives,” Luke said. It’s about giving more internet options to that tutu in Paauilo who cannot rely on her spotty internet connection for her health care and telehealth appointment. It’s about a job seeker in Hanapepe trying to fill out an online application but gets stuck when the website only accepts a specific file format. And it’s about an uncle in Waimanalo who got a brand new tablet and wants to go online to do online banking, but doesn’t know where to start.” Luke called $6 million in federal digital equity funding recently cut by the Trump administration “just part of the funding.” “The entire broadband funding is close to $400 million,” she said, referring to Connect Kakou, the statewide broadband initiative spearheaded by Green’s office to ensure that communities across Hawaii have access to reliable and affordable high-speed internet. “This bill supports strategic broadband coordination and digital skills to improve the lives of people from all walks of life. With the Broadband Office under the Department of Accounting and General Services, we can now align the office with broader strategic technology management and governance. Furthermore, the allocations aligned in this bill will have a greater impact on the Digital Navigators program, which completed a successful pilot in 2023, thanks to the successful efforts of the State Librarian Stacy Aldrich.” Aldrich called the Digital Navigators pilot — which provided one-one-one counselors by appointment to program participants seeking to either establish or improve computer literacy — “a very successful program.” “We’re now working on a project to expand that program across the state,” Aldrich said. “And we look forward to working with our sister agencies on making sure that people have more access to people (who) can help them get the skills they need to be successful.” She said a target date for the introduction of the statewide program would likely be this fall. Beth Rasmussen, a senior citizen from Kaneohe, Oahu, and Digital Navigator pilot participant, said she’s “so delighted to hear that the program is going to be resumed.” “There were so many gaps that … these instructors filled for me,” she said. “… Being able to create a file — now I know that sounds terribly simple, but how do you do it when you have no idea? The computer says ‘create a file’ … and then what? Then what? You know, you stand there and you think OK, where does the next direction come? “Well, I got to scan all my pictures into the computer. They taught me how to do that, how to create a file, how to label a file, how to change the label of a file, how to delete pictures … and to be able to respond to somebody in an email.” House Speaker Nadine Nakamura of Kauai noted “a lot of thought and effort that went behind this bill.” “I’m excited because I learned during the pandemic that there are many people without internet access and access to high-speed broadband connection on my island — and, I’m sure, throughout the state,” Nakamura said. These are residents of Hawaii who were laid off from jobs and who could not access unemployment insurance benefits, people who could not access other state and county benefits, and also … students who did not have access to the internet or whose families could not afford the cost of that internet connection. “And that’s why this bill is so important, because it helps to level the playing field. It helps to lift families up and have access to resources over the internet that many of us take for granted. I’m most excited about the Digital Navigator positions that will be expanded throughout our state through our public libraries. By placing the navigators through our libraries, we can do so much to … touch many more lives.” The Tribune-Herald reached out to Ilagan, who didn’t respond in time for this story. Email John Burnett at jburnett@hawaiitribune-herald.com. The Hawaii Supreme Court will consider whether contracts between the state’s... The Hawaii Supreme Court will consider whether contracts between the state’s... The Hawaii Supreme Court will consider whether contracts between the state’s... The Hawaii Supreme Court will consider whether contracts between the state’s... The Hawaii Supreme Court will consider whether contracts between the state’s... Lindsay MacDonald Barclay Lindsay MacDonald Barclay Lindsay MacDonald Barclay Lindsay MacDonald Barclay Lindsay MacDonald Barclay Dredging work began Tuesday to restore access to the lava-barricaded Pohoiki Boat... Dredging work began Tuesday to restore access to the lava-barricaded Pohoiki Boat... Dredging work began Tuesday to restore access to the lava-barricaded Pohoiki Boat... Dredging work began Tuesday to restore access to the lava-barricaded Pohoiki Boat... Dredging work began Tuesday to restore access to the lava-barricaded Pohoiki Boat... **Most Popular** **High court mulls Nitta case** **High court mulls Nitta case** **Pohoiki Boat Ramp dredging begins** **Pohoiki Boat Ramp dredging begins** **Free meals for keiki offered at 15 Big Island schools** **Free meals for keiki offered at 15 Big Island schools** **Let’s Talk Food: David Chang’s Majordomo** **Let’s Talk Food: David Chang’s Majordomo** **Pahoa man accused of daylight carjacking in Kailua-Kona** **Pahoa man accused of daylight carjacking in Kailua-Kona**"}