{"id": 1613, "name": "WSFL - Miami News", "domain": "wsfltv.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wsfltv.com/inside-south-florida/franchises/take-a-bite-out-of-this/chef-jodhann-mourra-elevates-haitian-cuisine-in-coral-gables-with-luxe-flavors-and-a-modern-twist", "title": "Chef Jodhann Mourra Elevates Haitian Cuisine In Coral Gables With Luxe Flavors And A Modern Twist", "content": "Menu Inside South Florida About UsContact UsClosed Caption Information Contact Us Closed Caption Information Contact Us Closed Caption Information Advertise with Us FranchisesCats Catch UpDIY with ISFEduc8 with RadmilaFashion ForwardField Trip FridayFoodie FriendsFront Row LookGet FitISF Book ClubLaMyiah LearnsLife on PurposePet of the WeekTake a Bite Out of This Cats Catch Up DIY with ISF Educ8 with Radmila Fashion Forward Field Trip Friday Foodie Friends Front Row Look Get Fit ISF Book Club LaMyiah Learns Life on Purpose Pet of the Week Take a Bite Out of This Cats Catch Up DIY with ISF Educ8 with Radmila Fashion Forward Field Trip Friday Foodie Friends Front Row Look Get Fit ISF Book Club LaMyiah Learns Life on Purpose Pet of the Week Take a Bite Out of This Trusted AdvisorsAgape Behavioral HealthcareCity of Fort LauderdaleCity RoofingDemesmin and DoverU.S. Immigration Law Counsel Agape Behavioral Healthcare City of Fort Lauderdale City Roofing Demesmin and Dover U.S. Immigration Law Counsel Agape Behavioral Healthcare City of Fort Lauderdale City Roofing Demesmin and Dover U.S. Immigration Law Counsel Home ExpertsGood Greek Moving & Storage Good Greek Moving & Storage Good Greek Moving & Storage Doing Good TV Listings Sign In Newsletters Sign Out Manage Emails Apps Careers Search Inside South Florida Advertise with Us FranchisesCats Catch UpDIY with ISFEduc8 with RadmilaFashion ForwardField Trip FridayFoodie FriendsFront Row LookGet FitISF Book ClubLaMyiah LearnsLife on PurposePet of the WeekTake a Bite Out of This Cats Catch Up DIY with ISF Educ8 with Radmila Fashion Forward Field Trip Friday Foodie Friends Front Row Look Get Fit ISF Book Club LaMyiah Learns Life on Purpose Pet of the Week Take a Bite Out of This Cats Catch Up DIY with ISF Educ8 with Radmila Fashion Forward Field Trip Friday Foodie Friends Front Row Look Get Fit ISF Book Club LaMyiah Learns Life on Purpose Pet of the Week Take a Bite Out of This Trusted AdvisorsAgape Behavioral HealthcareDemesmin and DoverCity of Fort LauderdaleCity RoofingU.S. Immigration Law Counsel Agape Behavioral Healthcare Demesmin and Dover City of Fort Lauderdale City Roofing U.S. Immigration Law Counsel Agape Behavioral Healthcare Demesmin and Dover City of Fort Lauderdale City Roofing U.S. Immigration Law Counsel Home ExpertsGood Greek Moving & Storage Good Greek Moving & Storage Good Greek Moving & Storage Doing Good TV Listings **Actions** Facebook Tweet Email **Chef Jodhann Mourra Elevates Haitian Cuisine in Coral Gables with Luxe Flavors and a Modern Twist** While Haitian Heritage Month may be behind us, Inside South Florida believes the celebration of Haitian culture should be year-round, and one local chef is leading the charge through bold, elevated flavors that honor tradition while embracing innovation. Chef Jodhann Mourra, owner of Le Romarin Catering, joined the show to showcase a staple of Haitian cuisine: pikliz—a spicy pickled slaw that adds heat and zest to any dish. “We’re an international catering company based in Coral Gables, but our heart is in transforming traditional Haitian dishes into something luxurious,” said Mourra, who is originally from Haiti and has been cooking in South Florida since 2019. A former restaurateur at FIU and now the culinary force behind Le Romarin, Chef Jodhann focuses on keeping Haitian food approachable and upscale. During the segment, he walked viewers through a quick-and-easy version of pikliz, using shredded cabbage, carrots, onions, shallots, and his personal favorite: green bell peppers for flavor control. He also offered tips on adjusting the heat by leaving scotch bonnet peppers whole or slicing them for more intensity. “If you like more carrots, add more carrots. If you prefer more peppers, add more peppers. It’s totally customizable,” he explained. Though pikliz is commonly served with griot (fried pork), tostones, or fried plantains, Mourra insists it's good on everything—from ribs to rice. Le Romarinis located at 6801 SW 8th Street, Coral Gables, FL. Follow Chef Jodhann on Instagram@jesuislechefsauvageor learn more atleromarincatering.com. **Sign up for theBreaking News Newsletterand receive up to date information.** **now signed up to receive theBreaking News Newsletter.** **Inside South Florida** **Inside South Florida** Inside South Florida is an original, local lifestyle show focused on providing our audience with informative, useful and entertaining content. It features a variety of community organizations, businesses and happenings in South Florida. It is a marketing-friendly program dedicated to offering businesses the opportunity to showcase their company/products, reach potential customers and gain results. Grow Your Business With Us!For Sponsor Information:Isfadvertising@wsfltv.com News Inside South Florida Weather Contests Support Coronavirus Sitemap Do Not Sell My Info Privacy Policy Privacy Center Terms of Use EEO FCC Public File FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact WSFLTV wsfltv WSFLTV"}