{"id": 2063, "name": "KARN - 102.9 - Little Rock", "domain": "newsradio1029.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.newsradio1029.com/news/appeals-panel-hears-arguments-to-move-trump-appeal-to-federal-court/", "title": "Appeals Panel Hears Arguments To Move Trump Appeal To Federal Court", "content": "ShowsFirst News with Toby Howell & Rebecca DavisThe Steve Finnegan ShowChris PlanteThe Vince ShowThe Sean Hannity ShowMark Levin‘Call of the Wild’ with Steve “Wildman” Wilson First News with Toby Howell & Rebecca Davis The Steve Finnegan Show Chris Plante The Vince Show The Sean Hannity Show Mark Levin ‘Call of the Wild’ with Steve “Wildman” Wilson First News with Toby Howell & Rebecca Davis The Steve Finnegan Show Chris Plante The Vince Show The Sean Hannity Show Mark Levin ‘Call of the Wild’ with Steve “Wildman” Wilson On-Demand Newsmax – Newsfront Weather Sweet Deals Advertising ContestsNational ContestsKARN Contest Rules National Contests KARN Contest Rules National Contests KARN Contest Rules **Appeals Panel Hears Arguments to Move Trump Appeal to Federal Court** An attorney for President Donald Trump argued to the U.S. Court of Appeals for the 2nd Circuit Wednesday that the appeal for his felony business records conviction in New York should be moved to the federal court system, pointing to the Supreme Court’s ruling on presidential immunity reached shortly after the jury’s ruling in the case. “The federal officer is entitled to a federal forum, not to have those arguments heard in state court,” attorney Jeffrey Wall told the three-judge panel, two of whom are appointees of former President Barack Obama and the other an appointee of former President Joe Biden, reports ABC News. “And if that’s true for a normal federal officer in a normal criminal prosecution, it certainly ought to be true for the president of the United States and for what we can all recognize is an anomalous one of its kind prosecution.” Read more at Newsmax© 2025 Newsmax. All rights reserved. **Blogs** **Headlines** **Free Apps** Privacy Policy Terms of Service General Contest Rules Advertise With Us Station Information Employment Opportunities FCC Public File EEO Reports Cumulus Media Corporate Copyright 2020 Cumulus Media / Cumulus Media is an equal opportunity employer / AA View Full Site"}