{"id": 483, "name": "Freedom News and Journal", "domain": "freedomnews.org.uk", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://freedomnews.org.uk/2025/06/05/news-review-budgets-palestine-organising-and-reform-dogeing-repsonsibility/", "title": "News Review Budgets Palestine Organising And Reform Dogeing Repsonsibility", "content": "News World AnalysisAnalysisCommentEditorialSatire Analysis Comment Editorial Satire Analysis Comment Editorial Satire FeaturesFeaturesInterviewsHistorySport Features Interviews History Sport Features Interviews History Sport ReviewsReviewsArts and Culture Reviews Arts and Culture Reviews Arts and Culture AboutAboutFreedom’s HistoryContributing About Freedom’s History Contributing About Freedom’s History Contributing **Anarchist News Review: Budgets, Palestine organising and Reform Doge’ing repsonsibility** **Andy Meinke joins us for the weekly waffle, looking this week at Labour’s thrashing about as it tries to simultaneously backtrack on wildly unpopular cuts, puff up its capital and defence spending credentials, and maintain an air of parsimonious penny pinching.** As billions are set to be put aside for yet more BAE subsidies, the question arises as to whether the anti-war campaigning on Palestine will energise broader peace activism, while at a lower level the newly-installed Reform councils are bracing for inspections of their coffers. Is that going anywhere? Probably not. **SHARE:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Pinterest (Opens in new window)Pinterest Click to share on Reddit (Opens in new window)Reddit Click to share on Tumblr (Opens in new window)Tumblr More Click to email a link to a friend (Opens in new window)Email Click to share on Pocket (Opens in new window)Pocket Click to share on Telegram (Opens in new window)Telegram Click to share on WhatsApp (Opens in new window)WhatsApp Click to print (Opens in new window)Print **Related** Find thousands of titles, including our latest book Fight For a New Normal - Anarchism and mutual aid in the Covid-19 pandemic crisis **Recent Articles** French and Italian dockworkers unite in practical resistance to the Israeli genocide in Gaza ~ David TNnzk ~ On Thursday, 5 June, workers at the port of Marseille unionised with CGT and backed by a solidarity presidium, successfully refused three containers full of military equipment which were scheduled to be loaded onto the Contship Era, “It is the duty of ordinary citizens to take direct action against the institutions perpetrating the genocide in Gaza”, says group ~ Scott Harris ~ Palestine Action says its activists early this morning targeted the Newcastle offices of the BBC and the London headquarters of weapons manufacturer Leonardo. As Reform UK splits over a stale debate, Muslim women’s voices remain conspicuously absent ~ James Horton ~ Many had thought very little about Sarah Pochin upon her tight win in the Runcorn and Helsby by-election on May 1st. The trial and sentencing of Ruslan Sidiki has exposed both the terror of an authoritarian state and the power of clandestine direct action ~ Josie Ó Súileabháin ~ At the Ryazan garrison military court, Judge Oleg Shishov on 23 May sentenced Ruslan Sidiki to 29 years of imprisonment for bombing railway tracks leading to the With the Second World War coming to its conclusion it naturally left an undignified political scramble in its wake Find thousands of titles, including our latest book Fight For a New Normal - Anarchism and mutual aid in the Covid-19 pandemic crisis **Recent Articles** French and Italian dockworkers unite in practical resistance to the Israeli genocide in Gaza ~ David TNnzk ~ On Thursday, 5 June, workers at the port of Marseille unionised with CGT and backed by a solidarity presidium, successfully refused three containers full of military equipment which were scheduled to be loaded onto the Contship Era, “It is the duty of ordinary citizens to take direct action against the institutions perpetrating the genocide in Gaza”, says group ~ Scott Harris ~ Palestine Action says its activists early this morning targeted the Newcastle offices of the BBC and the London headquarters of weapons manufacturer Leonardo. As Reform UK splits over a stale debate, Muslim women’s voices remain conspicuously absent ~ James Horton ~ Many had thought very little about Sarah Pochin upon her tight win in the Runcorn and Helsby by-election on May 1st. The trial and sentencing of Ruslan Sidiki has exposed both the terror of an authoritarian state and the power of clandestine direct action ~ Josie Ó Súileabháin ~ At the Ryazan garrison military court, Judge Oleg Shishov on 23 May sentenced Ruslan Sidiki to 29 years of imprisonment for bombing railway tracks leading to the With the Second World War coming to its conclusion it naturally left an undignified political scramble in its wake **Other Stuff** **the freeDoM ANArChIst NeWsPAPer ArChIVes** Having gone mostly online in 2014, Freedom continues to publish an irregular paper today. Those and many other issues stretching back to our founding in 1886 are online above, at libcom.org, and via the Sparrow’s Nest. **freeDoM As A PuBLIshING house** The book publishing arm of Freedom Press has a history stretching back to the 19th century and continues to publish today.Check out our catalogueto order stock or you can order from Central Books. **Get our NeWsLetter** Keep up with the news, features and interviews Freedom produces over the year with ourirregular newsletters. **CoNtACts** Emaileditor {at} freedompress.org.ukPhone07952 157-742Address84b Whitechapel High St, London E1 7QX (12-6pm)Map **Housekeeping** Design & hostingSquashed Fly CopyrightFreedom uses theAttribution- NonCommercial-ShareAlike 4.0 International license. All other content providers reproduced retain copyright unless stated otherwise. We are socialists, disbelievers in property, advocates of the equal claims of all to work for the community as seems good — calling no-one master, and of the equal claim to each to satisfy as seems good to them, their natural needs from the stock of social wealth they have laboured to produce ...We are anarchists, disbelievers in the government of the many by the few in any shape and under any pretext.Freedom, a Journal of Anarchist Socialism, Vol 1, No. 1, October 1886 Freedom, a Journal of Anarchist Socialism, Vol 1, No. 1, October 1886 Freedom, a Journal of Anarchist Socialism, Vol 1, No. 1, October 1886 **Discover more from Freedom News** Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading"}