{"id": 1205, "name": "RTE (Radio Television of Ireland)", "domain": "rte.ie", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.rte.ie/learn/senior-cycle/2025/0410/1506885-leaving-cert-2025-rte-study-hub-revision-exam-tips/", "title": "Senior Cycle", "content": "News Sport Entertainment Business Lifestyle Culture Player TV Radio Gaeilge Weather Archives Brainstorm History Weather RTÉ Games RTÉ Archives RTÉ Brainstorm History Gaeilge RTÉ Learn RTÉ Food RTÉ Recipes RTÉ Player TV RTÉ One RTÉ2 RTÉ News RTÉjr Radio Podcasts RTÉ Radio 1 RTÉ 2FM RTÉ lyric fm RTÉ Raidió na Gaeltachta Orchestra RTÉ Weather Century Ireland RTÉ Shop RTÉ Kids RTÉ Learn Contact Feedback Policies and Reports Complaints Terms & Conditions Individual Rights Guide Privacy Policy Cookie Policy Freedom of Information About RTÉ TV Licence Vacancies Latest Annual Report Advertise with RTÉ 2rn Saorview Newsletters RTÉ Supporting the Arts News Sport Entertainment Business Lifestyle Culture Player TV Radio Gaeilge Weather Archives Brainstorm History Weather RTÉ Games RTÉ Archives RTÉ Brainstorm History Gaeilge RTÉ Learn RTÉ Food RTÉ Recipes RTÉ Player TV RTÉ One RTÉ2 RTÉ News RTÉjr Radio Podcasts RTÉ Radio 1 RTÉ 2FM RTÉ lyric fm RTÉ Raidió na Gaeltachta Orchestra RTÉ Weather Century Ireland RTÉ Shop RTÉ Kids RTÉ Learn Contact Feedback Policies and Reports Complaints Terms & Conditions Individual Rights Guide Privacy Policy Cookie Policy Freedom of Information About RTÉ TV Licence Vacancies Latest Annual Report Advertise with RTÉ 2rn Saorview Newsletters RTÉ Supporting the Arts Weather RTÉ Games RTÉ Archives RTÉ Brainstorm History Gaeilge RTÉ Learn RTÉ Food RTÉ Recipes RTÉ Player TV RTÉ One RTÉ2 RTÉ News RTÉjr Radio Podcasts RTÉ Radio 1 RTÉ 2FM RTÉ lyric fm RTÉ Raidió na Gaeltachta Orchestra RTÉ Weather Century Ireland RTÉ Shop RTÉ Kids RTÉ Learn Contact Feedback Policies and Reports Complaints Terms & Conditions Individual Rights Guide Privacy Policy Cookie Policy Freedom of Information About RTÉ TV Licence Vacancies Latest Annual Report Advertise with RTÉ 2rn Saorview Newsletters RTÉ Supporting the Arts Learn Senior Cycle School Hub Junior Cycle Senior Cycle About RTÉ Learn **Leaving Cert 2025: Let's revise with help from RTÉ Study Hub** RTÉ's Study Hub returned this year, with new host Maura Fay, offering more great exam tips and advice for a range of key subjects. Having started out as a RTÉ Radio 1Podcast, Study Hub has expanded across platforms and is available onYouTube,and there's highlights onTikToktoo. Here, we have all six shows in one place for your revision. But, it's not all about study - get out and get some fresh air as often as possible! Click on each episode below English (H) Paper 1, Music and managing exam stress Ordinary Level Maths, Biology and French Maths (H) Paper 1, Spanish and Business (H) Geography, Irish Paper 1 and Maths (H) Paper 2 English Paper 2, Chemistry and Home Economics Irish Paper 2, History and Physics Within each individual article there are links to extra resources: Get the Study Hub Leaving Cert Music resource pack here! Leaving Cert Business tips from Gavin Duffy Leaving Cert Higher Maths Tutorials with Louise Boylan Click here for Sandra Cleary's Home Ec notes - revision plan included As we get closer to exam time, check outRTÉ Learnfor more resources and useful content. Learn Lifestyle Senior Cycle Exam Tips Leaving Cert Leaving Cert 2025 Study Hub 2025 Weather RTÉ Games RTÉ Archives RTÉ Brainstorm History Gaeilge RTÉ Learn RTÉ Food RTÉ Recipes RTÉ Player TV RTÉ One RTÉ2 RTÉ News RTÉjr Radio Podcasts RTÉ Radio 1 RTÉ 2FM RTÉ lyric fm RTÉ Raidió na Gaeltachta Orchestra RTÉ Weather Century Ireland RTÉ Shop RTÉ Kids RTÉ Learn Contact Feedback Policies and Reports Complaints Terms & Conditions Individual Rights Guide Privacy Policy Cookie Policy Freedom of Information About RTÉ TV Licence Vacancies Latest Annual Report Advertise with RTÉ 2rn Saorview Newsletters RTÉ Supporting the Arts © RTÉ 2025. RTÉ.ie is the website of Raidió Teilifís Éireann, Ireland's National Public Service Media. RTÉ is not responsible for the content of external internet sites. Images Courtesy of Getty Images."}