{"id": 2232, "name": "The Mideast Bast", "domain": "themideastbeast.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://www.themideastbeast.com/a-year-of-shadowbans-jail-time-the-mideast-beasts-top-12-articles-of-2021-that-you-probably-missed/", "title": "A Year Of Shadowbans Jail Time The Mideast Beasts Top 12 Articles Of 2021 That You Probably Missed", "content": "Political Schmuckery Weaponized Bickering Sheaux Biz Tech-Tok Trendzies Physical Correctness The Divided Colonies International Nitwittery About Contact Political Schmuckery Weaponized Bickering Sheaux Biz Tech-Tok Trendzies Physical Correctness The Divided Colonies International Nitwittery Political Schmuckery Weaponized Bickering The Divided Colonies About Contact **A Year of Shadowbans & Jail Time: The Mideast Beast’s Top 12 Articles of 2021 That You Probably Missed** Facebook Twitter Hello fans! We had a clever write-up prepared but, in all honesty, we didn’t want to waste any more of your time that you could be spending enjoying what’s left of this spectacular year. So, let’s just get on with it. For your reading pleasure…that you were robbed of…all year long 👇 ‘Why Do Only Loser Congresspeople Like Us?’ Hamas Asks Trump Concedes Defeat, Delivers Giant Wooden Horse to Congressional Democrats Linda Sarsour to Convert to Judaism After Learning Women and Arabs Serve in Parliament, Supreme Court, and Just About Everywhere Else in Israel ‘At Least Nazis Didn’t Make Jews Wear Masks,’ Taylor Greene Says “That Wasn’t Me in the Israel Rant Video!” Claims John Oliver Female Suicide Bomber Shocked to Only Receive 63 Virgins in Paradise Norm Macdonald Asks God for Ten Minutes in Hell to Roast bin Laden White Girl Totally “Gets” Middle Eastern Culture After Trip to Dubai Americans Reminded About Afghanistan After Taliban Heard Defending Dave Chappelle Disappointed ISIS Members Withdraw Request to Join ‘The Squad’ Biden Launches OnlyFans Account to Pay Off National Debt Assad Convinced U.S. High Schools Produce Better Terrorists Than Syria Here’s to you, Warden Zuck! Cheers, ya little ben-zona. 🥂 Now that’s some Meta shit right there! Share this article Facebook Twitter Get your satire fix with The Mideast Beast Daily, emailed straight to your inbox. Sort that FOMO. Subscribe Please leave this field empty. Calling it a momentous step towards recognition of the LGBTQ+ community, Saudi Arabia announced that all homosexuals executed during pride month would be hung from a rainbow noose or beheaded with a rainbow-colored ax. Though human rights activists said much further process remains necessary, the announcement marks a major step forward for gay equality in the kingdom. “We have a... **Related posts:** Mel Gibson Appointed to United Nations Post UN Commission Finds Jews to Be “Only Ethnic Group That Doesn’t Really Belong Anywhere” The Mideast Beast to Begin Covering Real News Home About The Mideast Beast Contact The Mideast Beast T&Cs Privacy Policy Because all news is satirical Write for TMB © 2025 The Mideast Beast Facebook Twitter More Networks"}