{"id": 478, "name": "Foreign Policy in Focus", "domain": "fpif.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://fpif.org/waters-of-geopolitics-why-is-the-indus-river-system-so-violently-contested/", "title": "Waters Of Geopolitics Why Is The Indus River System So Violently Contested", "content": "Home About Our WorkIssuesDrugsEnergyEnvironmentFood & FarmDemocracy & GovernanceHealthHuman RightsWar & PeaceTrade & FinanceWomenRegionsAfricaAsia & PacificEurope & Central AsiaMiddle East & North AfricaNorth AmericaLatin America & CaribbeanWorld BeatGlobal Just Transition IssuesDrugsEnergyEnvironmentFood & FarmDemocracy & GovernanceHealthHuman RightsWar & PeaceTrade & FinanceWomen Drugs Energy Environment Food & Farm Democracy & Governance Health Human Rights War & Peace Trade & Finance Women RegionsAfricaAsia & PacificEurope & Central AsiaMiddle East & North AfricaNorth AmericaLatin America & Caribbean Africa Asia & Pacific Europe & Central Asia Middle East & North Africa North America Latin America & Caribbean World Beat Global Just Transition IssuesDrugsEnergyEnvironmentFood & FarmDemocracy & GovernanceHealthHuman RightsWar & PeaceTrade & FinanceWomen Drugs Energy Environment Food & Farm Democracy & Governance Health Human Rights War & Peace Trade & Finance Women Drugs Energy Environment Food & Farm Democracy & Governance Health Human Rights War & Peace Trade & Finance Women RegionsAfricaAsia & PacificEurope & Central AsiaMiddle East & North AfricaNorth AmericaLatin America & Caribbean Africa Asia & Pacific Europe & Central Asia Middle East & North Africa North America Latin America & Caribbean Africa Asia & Pacific Europe & Central Asia Middle East & North Africa North America Latin America & Caribbean World Beat Global Just Transition Submit Donate Indus River (Shutterstock) **Waters of Geopolitics: Why Is the Indus River System So Violently Contested?** Scientists predict that war between India and Pakistan could incinerate2 billion peopleand triggera catastrophic global nuclear winter. As if this prediction weren’t sufficiently dire,a world publicationannounced that competition over the water from the Indus river could lead toWorld War III. But theIndus Waters Treaty, signed between India and Pakistan in 1960 within 13 years of the two countries’ independence—suggests that the two sides can resolve conflict without resort to violence. Some south Asian leaders, however, have militarized the water of the Indus, their virulent rhetoric amounting to hydro-nationalism. Indian Prime Minister Narendra Modi replaced blood-and-soil nationalism with just this type of blood-and-water patriotism. Mourning the April 22 massacre in Indian-administered Kashmir, which prompted New Delhi to suspend the Indus Waters Treaty, he thundered: “Blood and water cannot flow together.” For its part, Pakistan warned that any attempt at diverting the Indus would bean act of war. Rhetorical flourishes aside, growing demands on the Indus—especially rising demographic pressure, extensive and intensive agriculture, wave of industrialization, and accelerated urbanization—are reshaping geopolitical conflicts in the region. Today, thecombined population of Bangladesh, India, and Pakistan stands at 20 percentof the world population. By 2050, India alone will encompass one-fifth of humanity. Of all industries, agriculture is the largest guzzler of south Asia’s freshwater resources,consuming 91 percent, which is far above the world average of 72 percent. Relentless urbanization can be gauged from the fact that India is building100 brand new cities of a million people each. In the face of infinite consumption, production, reproduction, and urbanization, there is never enough water in the finite Indus basin to go around. And the Indus is not a stingy river system either. Its annual flow ofmore than 200billion cubic meters is twice as large as that of the Nile, the world’s longest river, which drains 11 riparian countries,including Egypt, 92 percent of which is desert. Nature keeps the Indus River system fed with abundant supplies of glacial and snow melt along with monsoon showers.Up to 70 percent of the systemis fed by frozen water from glaciers and the snow-covered mountain tops of the Himalayas, Hindu Kush and Karakoram. Around 40 percent of it comes from monsoon showers. If temperatures drop dramatically, glaciers and snow on the mountain peaks will stop melting, draining the Indus. If temperatures soar drastically, the overabundant glacial run-off and snowmelt will burst the river’s banks,as it did in 2022, causing massive devastation in Pakistan. Rising temperatures, driven by climate change, pose an existential threat to glaciers,two-thirds of which will melt away by the end of the twenty-first century. Warming weather is also messing up monsoon season, which has compressed into ever fewer months of highly concentrated showers, with every rainy spell leaving behind a trail of tears.Monsoons now feed 80 percent of the Indus flowfrom July through September. Ingenious means are needed to harvest the monsoonal atmospheric rivers for the remaining nine months of the year.The Indus Water Treatycalculates the annual mean flow of the Indus to be 209.6 billion cubic meters, which irrigates three bordering states of Punjab, Haryana, and Rajasthan in India, and mostly Pakistan’s two provinces of Punjab and Sindh. On April 24, India “held in abeyance” the Indus Water Treaty because of the violence committed in the state of Jammu and Kashmir where26 Indians were killed, and which India blamed on Pakistan butPakistan vehemently denied. In fact,India has long been wanting to renegotiate the treatyon terms that would increase its share of water. Being upstream , India has the upper hand in securing favorable terms in a renegotiated treaty. With an increased share, India plans to expand water storage capacity to keep water available for off-season use. In hydrology, this is called the water production approach, which seeks to increase water supplies bybuilding water infrastructuresuch as dams, diversions, impoundments, and reservoirs. The water production approach has its limitations, mostly imposed by the rapidly changing global climate. Evaporation, for instance, offsets any gain in water share. Theglobal lake evaporation volume studiesshow the annual rate of evaporation rising up to 58 percent. Globally,496 trillion cubic meters of water evaporates each year, which is getting worse with climatic variations, especially rising temperatures. A renegotiated treaty achieved at the expense of bilateral relations and good neighborliness can still fall short of reaching its goal: self-sufficiency in water resources. A parallel approach,water governance, places emphasis on cooperative relations to increase efficiency of water resources through conservation and climate-smart practices. A case in point is the91 percent of freshwater that goes to irrigating increasingly thirsty crops in south Asia. This wasteful water consumption can be dramatically reduced by introducing such irrigation practices asdrip irrigation, which is 40 percent more efficientthan the flood irrigation that’s widespread in south Asia. Similarly, high-cost water infrastructure with ever diminishing returns can be swapped for investment in water treatment technology to reuse every drop of water in agriculture, industry, and service economies. More importantly,concentrated monsoon showers in an ever-compressed monsoon seasoncould be harvested for year-round use. The region is endowed with abundant water resources, but their wasteful use is undermining their sustainability. With itsannual hydraulic reserves of 1,446 billion cubic meters, India ranks among the world’s top water-rich nations. In dollar terms, its water reserves are valued at $3 trillion a year, which isthree-fourths of India’s GDP. Global climate change is, however, overtaxing the region’s capacity. Although south Asia has done the least to contribute to climate change, it is already suffering the most from its consequences, one of which is growing water stress. India has the wherewithal to craft regional and global initiatives to mitigate climatic impacts on the region, especially on its precious freshwater resources. Although south Asian leaders are gifted at offending each other, they are also supremely advantaged in bridging their differences at the snap of a finger. India’s founding fatherJawaharlal Nehru signed a friendship pact with Pakistani Prime Minister Liaquat Ali Khan when the wounds of partition were still bleeding. It was againNehru who signed the Indus Water Treatywith Pakistani President Muhammad Ayub Khan. Most recently, Pakistani Prime Minister NawazSharif trekked to India to attend Prime Minister Narendra Modi’s inaugurationin 2014. A year after, Modi made history with hisunscheduled call on Sharifin his hometown Lahore, Pakistan. India and Pakistan are just as capable of binding each other’s wounds as wounding each other, which means that the healing water of the Indus, which can join the two nations, will always be thicker than the “blood” of divisive nationalism. **Share this:** Click to print (Opens in new window)Print Tweet Pocket Tarique Niazi, Ph.D. is a professor of environmental sociology at the University of Wisconsin at Eau Claire. Get the latest from FPIF in your inbox. ABOUT ARCHIVE SUBMIT DONATE"}