{"id": 1147, "name": "Center for Public Integrity", "domain": "publicintegrity.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://publicintegrity.org/inequality-poverty-opportunity/addressing-anti-asian-hate/asian-students-face-racism-harassment-at-school-what-would-make-it-stop/", "title": "Asian Students Face Racism Harassment At School What Would Make It Stop", "content": "DEMOCRACYOpen dropdown menuHigh Courts, High StakesImmigrationWho Counts? High Courts, High Stakes Immigration Who Counts? High Courts, High Stakes Immigration Who Counts? ECONOMIC WELL-BEINGOpen dropdown menuCheated at workUnequal Burden Cheated at work Unequal Burden Cheated at work Unequal Burden EDUCATIONOpen dropdown menuAcademic FreedomUnhoused and UndercountedCriminalizing kids Academic Freedom Unhoused and Undercounted Criminalizing kids Academic Freedom Unhoused and Undercounted Criminalizing kids ENVIRONMENTOpen dropdown menuToxic LaborGhosts of Polluters PastHarm’s Way Toxic Labor Ghosts of Polluters Past Harm’s Way Toxic Labor Ghosts of Polluters Past Harm’s Way HEALTHOpen dropdown menuMental Health Parity Mental Health Parity Mental Health Parity About UsOpen dropdown menuOur staffOur donorsContact us Our staff Our donors Contact us Our staff Our donors Contact us PodcastsOpen dropdown menuIntegrity Out LoudThe HeistOpen dropdown menuSeason 1Season 2Season 3 Integrity Out Loud The HeistOpen dropdown menuSeason 1Season 2Season 3 Season 1 Season 2 Season 3 Integrity Out Loud The HeistOpen dropdown menuSeason 1Season 2Season 3 Season 1 Season 2 Season 3 Season 1 Season 2 Season 3 Data ToolsOpen dropdown menuThe Accountability Project (TAP)Copy, Paste, LegislateAccess our resources The Accountability Project (TAP) Copy, Paste, Legislate Access our resources The Accountability Project (TAP) Copy, Paste, Legislate Access our resources Archive Facebook Page Twitter Linkedin Instagram TikTok DEMOCRACYHigh Courts, High StakesImmigrationWho Counts? High Courts, High Stakes Immigration Who Counts? High Courts, High Stakes Immigration Who Counts? ECONOMIC WELL-BEINGCheated at workUnequal Burden Cheated at work Unequal Burden Cheated at work Unequal Burden EDUCATIONAcademic FreedomUnhoused and UndercountedCriminalizing kids Academic Freedom Unhoused and Undercounted Criminalizing kids Academic Freedom Unhoused and Undercounted Criminalizing kids ENVIRONMENTToxic LaborGhosts of Polluters PastHarm’s Way Toxic Labor Ghosts of Polluters Past Harm’s Way Toxic Labor Ghosts of Polluters Past Harm’s Way HEALTHMental Health Parity Mental Health Parity Mental Health Parity About UsOpen dropdown menuOur staffOur donorsContact us Our staff Our donors Contact us Our staff Our donors Contact us PodcastsOpen dropdown menuIntegrity Out LoudThe HeistOpen dropdown menuSeason 1Season 2Season 3 Integrity Out Loud The HeistOpen dropdown menuSeason 1Season 2Season 3 Season 1 Season 2 Season 3 Integrity Out Loud The HeistOpen dropdown menuSeason 1Season 2Season 3 Season 1 Season 2 Season 3 Season 1 Season 2 Season 3 Data ToolsOpen dropdown menuThe Accountability Project (TAP)Copy, Paste, LegislateAccess our resources The Accountability Project (TAP) Copy, Paste, Legislate Access our resources The Accountability Project (TAP) Copy, Paste, Legislate Access our resources Archive Facebook Page Twitter Linkedin Instagram TikTok Center for Public Integrity Investigating inequality DEMOCRACYOpen dropdown menuHigh Courts, High StakesImmigrationWho Counts? High Courts, High Stakes Immigration Who Counts? High Courts, High Stakes Immigration Who Counts? ECONOMIC WELL-BEINGOpen dropdown menuCheated at workUnequal Burden Cheated at work Unequal Burden Cheated at work Unequal Burden EDUCATIONOpen dropdown menuAcademic FreedomUnhoused and UndercountedCriminalizing kids Academic Freedom Unhoused and Undercounted Criminalizing kids Academic Freedom Unhoused and Undercounted Criminalizing kids ENVIRONMENTOpen dropdown menuToxic LaborGhosts of Polluters PastHarm’s Way Toxic Labor Ghosts of Polluters Past Harm’s Way Toxic Labor Ghosts of Polluters Past Harm’s Way HEALTHOpen dropdown menuMental Health Parity Mental Health Parity Mental Health Parity **Asian students face racism, harassment at school. What would make it stop?** **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Click to share on Reddit (Opens in new window)Reddit Editor’s note:This story has graphic language and descriptions of racial slurs, harmful rhetoric and violence against Asians and other students of color attending public schools. If you need support or have experienced violence, discrimination, harassment or racism,find an organization that can help in this database. Hai Au Huynh was fed up. The 45-year-old Texas mother had been trying to reach a resolution with teachers and administrators for months after both her boys experienced anti-Asian racial harassment at their elementary school. Despite multiple emails, meetings and officially filed grievances, school officials would neither condemn the racist acts nor guarantee her boys any protection, she said. On Nov. 13,she took the podiumin front of the Cypress-Fairbanks Independent School District board meeting in the Houston suburb, ready to share her story. “My Asian-American children have been the target of several racist attacks in CFISD this past year. My 8- and 11-year-old should not have to repeatedly tell other children why it is wrong to use racist slurs,” she said. Huynh told the board her boys had been called “ching-chong-wing-wong” on their entire bus ride home, an incident caught on video. After her older son and classmates commemorated their last day of school by signing each other’s shirts, he looked at the back of his own and discovered to his horror someone had drawn a swastika on it. “The lack of accountability by CFISD is appalling. The district’s job is to protect all children, and it has failed miserably in that regard,” she said as she asked the board to grant a “stay away” order against the student who drew the swastika, a request school officials denied. “My children do not feel CFISD will keep them safe.” The school district did not respond to multiple requests for comment for this story. The experiences of generations of Asian American and Pacific Islander children educated in U.S. public schools point to a pattern of racial harassment and bullying that is not fully reflected in data due to lack of reporting. Families who do report hate incidents are often not taken seriously enough for school officials to put a stop to it. While past generations typically endured abuse without saying anything about it, the hostility fueled by the COVID-19 pandemic has pushed parents and students to break the pattern of silence. Sarah Syed, a community organizer with Woori Juntos, a local Asian advocacy organization,spoke to the Cypress-Fairbanks board on Huynh’s behalflast school year about the school bus incident. “This is not an isolated incident of racism, but one of institutional systemic racism that must also be addressed at the instructional and administrative levels,” Syed told the board. “What we want is public acknowledgement that this happened and to condemn this publicly, and action steps to prevent it from happening again.” Huynh knew this hate. As a child growing up in South Philadelphia, she’d seen and experienced it many times over. Now it was happening to her kids. COVID-19 reinvigorated a dormant strain of anti-Asian thought, the kind of logic that regarded Asian Americans as strangers in their own country. As then-President Donald Trump popularized terms like “Chinese virus” and “Kung flu,” vitriol spread. Rhetoric was having real-life consequences. A report by researchers at California State University, San Bernardino, found that anti-Asian hate crimes in the 16 largest U.S. citiesrose 145% in 2020– a year when overall hate crimes declined in those same places. Following the surge in anti-Asian violence and the Atlanta spa shootings that left eight people dead, Huynh and her family attended a rally in Texas in April 2021. Ever since the boys were toddlers, Huynh had discussed social justice issues, including anti-Asian racism. “We’re going to be called all these names because it’s not the first time that it will happen, and it most likely won’t be the last,” she said. She told her boys about Tommy Le, a 20-year-old Vietnamese man who was shot to death by police in 2017. He washolding a pen that was mistaken to be a knifeandshot twice in the back, according to news reports. She told them about Vincent Chin, a Chinese American man who was beaten to death with a baseball bat in Detroit in 1982. The two men responsible, angry about Japan’s auto industry and misidentifying him as Japanese, got three years of probation and $3,000 in fines after charges were reduced to manslaughter,according to the Vincent Chin Institute. Why wasn’t anyone doing anything to stop this, her boys asked. She reassured them that by speaking up, they would inspire others to do the same until those in power do their job and protect them. So when her sons told her about the racial harassment they were beginning to face, she did what she told her boys to do. Speak up. **Data clues and glaring problems** The federal government requires schools to report racially motivated harassment and bullying, like what Huynh says her children experienced at Cypress-Fairbanks. The Department of Education also investigates complaints of civil rights violations in educational settings. And if an incident is deemed criminal, it may appear in nationwide databases tracking hate crimes. But gaps separate the data from the reality students experience. The Education Department, which tracks reports of bullying and harassment in a survey called theCivil Rights Data Collection, cautioned users to “consider the impact of the coronavirus pandemic on students and on educational conditions” when comparing its 2020-21 survey to previous years. This concern appears justified: the number of students that reported being bullied or harassed on the basis of race dropped by more than half between 2020-21 and the last pre-pandemic survey in 2017-18 — a steep decrease that hints at a difficult time for data collection. Gaps lurk in criminal justice data, too. The Federal Bureau of Investigation’sUniform Crime Reporting Programincludes data on hate crimes, but some law enforcement agencies don’t participate in the program. Most of those that do simplyreport zero hate crimes. The FBI says many hate crimes go unreported. And that may be more prevalent in Asian American and Pacific Islander — or AAPI — communities than in other racial or ethnic groups, the U.S. Commission on Civil Rights says. A2023 report by the commissionnoted that few police officers are fluent in Asian languages, a barrier that may discourage victims from reporting. When the nonprofit Act To Changesurveyed students in 2021, meanwhile, it found that the majority of bullied Asian students didn’t tell an adult about their experience. The reverse was true of bullied students from other racial groups. Bethany Li, legal director of the Asian American Legal Defense Education Fund, said immigrants who feared government agencies in their country of origin may also avoid reporting to the FBI. And incidents like verbal harassment are so normalized in the U.S., she said, that people don’t always think to report them. “There is going to be underreporting no matter what,” she said. The federal data, with all those serious caveats, suggests AAPI students experienced racially motivated harassment at rates roughly proportional to their enrollment. Surveys taken in the 2015-16, 2017-18 and 2020-21 school years all show such students were victims in about one in 20 such cases, the same as their share of the student population. The education data also shows what’s happening within specific schools and school districts. Four Asian students were reported harassed or bullied due to racial bias in Cypress-Fairbanks schools over a 10-year period – two in 2011-12 and one each in 2017-18 and 2020-21, before Huynh’s sons faced harassment. It’s unclear if those figures are exact. Data from the national survey issubject to small adjustmentsto prevent users from identifying specific students. And an Education Department spokesperson would not answer questions about how to accurately aggregate school data to the district level, saying the agency’s Office for Civil Rights “is unable to comment on third-party analyses.” Cypress-Fairbanks didn’t respond to several requests by the Center for Public Integrity to confirm the numbers. Reported hate crimes in schools and colleges show an across-the-board decrease in 2020, followed by a rebound the following two years. In 2022, anti-Asian or Pacific Islander bias accounted for roughly 4% of racially motivated hate crime offenses reported at schools; students from these communities comprised about 6% of the K-12 population. Concern about the gaps in official government reports of bullying, harassment and hate crimes prompted a nonprofit, Stop AAPI Hate, to start compiling voluntarily submitted data. “Stop AAPI Hate’s data sheds light on more systemic and complex forms of hate facing our communities — from interpersonal acts of hate to infringements on our everyday civil rights,” Cynthia Choi and Manjusha Kulkarni, co-founders of the Stop AAPI Hate coalition, said in a prepared statement. “It also reflects the voice of our community in a way that surveys cannot. Each report we receive represents something that happened to an AAPI individual, that left them feeling harmed and motivated them to speak out and share their experience.” They added: “This kind of data is much needed — by community-based organizations, government agencies, and researchers alike — and can help drive policy solutions that keep AAPI communities safe.” Youth in K-12 schools told Stop AAPI Hate about 167 instances of verbal harassment they’d experienced, 16 instances in which they were “coughed at or spat on” and nine instances in which they were physically injured between 2020 and 2022, among other harms. When ​theGovernment Accountability Office looked into students’ experiences with bullying, victimization, hate speech and crimes on K-12 campusesin 2021, it found that bullying occurred in nearly every school, racial and ethnic tensions increased, and hate crimes had nearly doubled. That was its conclusion analyzing theSchool Survey on Crime and Safetyfor the 2015-16 and 2017-18 school years. Some 1.3 million students ages 12 to 18 were bullied on the basis of race, national origin, religion, disability, gender or sexual orientation, the GAO found. The analysis also found that an estimated 1.6 million students were subjected to hate speech related to these identities. The persistent harassment of students of color attending public schools is revealed in some of the Department of Education’s recent Office of Civil Rights investigations. AnOCR investigation into Peoria Unified School Districtin Arizona revealed reports of a dozen students from 5th through 8th grade experiencing harassment based on race, color and national origin. Peer-to-peer harassment was widespread, and OCR found three teachers harassed a student between 2020 and 2022. The district knew about incidents and failed to respond adequately, further fueling a hostile environment for the children, OCR found. Black, Hispanic and Asian students were called racial slurs, according to the findings. Asian children reported that students would pull their eyes back to imitate Asians. One white student told an Asian student to go back to her country and to eat dog because that is “what they do.” Because the district didn’t look into the “known hostile environment” at the school, OCR said officials failed to identify other students who may not have reported their own experiences because of the “repeated failures to respond promptly and effectively to reported harassment.” Danielle Airey, the district’s chief communications officer, said Peoria has complied with OCR’s “suggested recommendations to ensure that our students feel known, valued, cared for and challenged.” InPark City School District in Utah, OCR’s investigation into seven cases revealedthat the district “had repeated actual notice of race-based, antisemitic, national origin-based, and sex-based harassment” at three schools between 2021 and 2023. Students used multiple derogatory racial slurs aimed at Black and Asian children. Harassment of one Asian student became so pervasive, her parents withdrew her from the district after four complaints to the staff did not resolve matters. The Park City School Districtposted its resolution agreement onlineand added that staff takes the resolution “very seriously.” While federal investigations are “very comprehensive,” said Sherri Doughty, assistant director at the GAO, they can take a long time. As of April 30,OCR’s pending casesinclude one on racial harassment dating back to July 2012. According to the Department of Education’s2023 Budget Summary, OCR complaints have doubled since 2009, while investigative staff increased only slightly. Many incidents, meanwhile, aren’t on their radar at all. “A lot of what is reported out there in the media never makes it to the federal government,” Doughty said. **A history of exclusion** BeforePlessy v. Fergusonin 1896 allowed “equal but separate accommodations for the white and colored races” andBrown v. Board of Educationin 1954 deemed school race-based segregation unconstitutional, there was theTape v. Hurley case of 1885. A San Francisco family of Chinese heritage fought for their 8-year-old daughter’s right to attend a local school in 1884. Just two years prior, theChinese Exclusion Act of 1882banned Chinese laborers from immigrating to the United States and denied a path to citizenship for those already in the country. Joseph and Mary Tape sought to enroll their daughter Mamie in the nearby Spring Valley Primary School, only for the principal to tell them school board policy didn't allow admission for Chinese students, according to a write-up by the Library of Congress. Claiming that excluding Mamie from the school violated California state law, the Tapes sued the San Francisco Board of Education — and won. The court decision prompted Andrew J. Moulder, the superintendent of San Francisco schools, to telegram Sacramento. He urged the California State Legislature to pass a bill establishing separate schools for Chinese students. “Without such action I have every reason to believe that some of our classes will be inundated by Mongolians. Trouble will follow. Please answer,”Moulder wrote in his telegram March 4, 1885. The bill authorizing the establishment of “separate schools for children of Mongolian or Chinese descent” wasapprovedseveral days later. It also barred Asian children from attending public schools if separate schools were established. In Bolivar County, Mississippi, Gong Lum didn’t have a Chinese school nearby to send his 9-year-old daughter Martha. In 1927, he tried to send her to Rosedale Consolidated High School District, only for the superintendent to tell her she couldn’t attend because she was “not a member of the white or Caucasian race,”court records show. In court, Lum argued that his daughter was “pure Chinese” and “not a member of the colored race,” nor did she have “mixed blood.” But the courts ruled that Martha Lum was “of the Mongolian or yellow race” and instead of attending the whites-only school, she had “the right to attend and enjoy the privileges of a common school education in a colored school.” It was a time when Asians had to navigate the “rigid binary color of this country,” in which they were not white, but also not Black, says Ellen Wu, history professor at Indiana University Bloomington and author of “The Color of Success: Asian Americans and the Origins of the Model Minority.” She points to the U.S. Supreme Court cases of two Asians,Takao Ozawa, a Japanese American, andBhagat Singh Thind, an Indian American, who used different arguments for being classified as white in order to obtain American citizenship, but were denied. “These were strategies to kind of improve people's life chances at a time when they had very constricted life chances,” Wu said. After Japan bombed Pearl Harbor in December 1941, the U.S. government enforced another exclusionary policy that displacedapproximately 120,000 Japanese Americans from their homesinto internment camps between 1942 and 1945. For some Japanese American children, their first educational experience was in a windowless barrack that would become unbearable as temperatures rose outside, according to an online exhibition by theDigital Public Library of America. In a 1992report, the U.S. Commission on Civil Rights flagged numerous anti-Asian incidents in public schools, where students were pushed, spat on, called names, laughed at and teased because of their accents. School officials often failed to take adequate steps to deal with the “racially charged environment,” the report concluded, and both teachers and administrators “frequently minimize or overlook the seriousness of anti-Asian sentiments in public schools.” The commission heard complaints that school officials imposed harsher disciplinary actions on Asian students when they were involved in a fight, and often brushed aside racial tensions in a “glib manner.” Seventeen years later, Wei Chen was seeing all of that and more, he says. At South Philadelphia High School, he said he’d witnessed Asians get ridiculed, belittled, beaten in bathrooms and have food and milk thrown at them. He’d seen some of them fight back, then get suspended. Sometimes school staff were the bullies, he said. When he and other Asian students lined up in the cafeteria for lunch and pointed to food they wanted, the cafeteria worker would force them to pronounce the name of the item to get it, Chen said. It came to a head on Dec. 3, 2009, when 30 Asian students were physically attacked by other students throughout the day andapproximately 13 went to the hospital for injuries, according to the settlement agreement the school district reached with the U.S. Department of Justice. Students and parents met with district officials following the incident, hoping for a solution that would keep the students safe. Instead, Chen said, they told everyone to move on. Reporting at the time showed the district publicly saidthe violence was retaliationfor a group attack the day before on a Black student with disabilities. Later, a judge tapped to investigate said that attack wasa rumor he could not substantiate. “We are not going to move forward and not address the issue,” Chen remembers thinking. “Historically, people in power in the system, when they don’t want to change, when they don’t want to take responsibility of the violent incident or any kind of anti-Asian incident that happened in the system, they just want to push the responsibility to others.” Using a mix of English, Mandarin and Cantonese, Chen, who was not hurt in the Dec. 3 incident, began calling other Asian students, coaxing them to meet. He was planning a press conference for the students to share their stories. Backed by Asian Americans United, where Chen works today as a civic engagement director, the event was followed by an eight-day boycott of the school. Fifty students participated in the boycott,CNN reported, sending a message that school officials needed to be held accountable. As a result of students organizing, the Asian American Legal Defense and Education Fundfiled a civil rights violation complaintwith the U.S. Department of Justice about the situation. “Defendants had actual knowledge of this severe and pervasive harassment, and were deliberately indifferent,”the complaint read. That got results. The Justice Departmentreached a settlement agreementwith the school district, requiring the district to hire an expert to review its policies on harassment and discrimination, develop a plan to address student-on-student harassment, and train faculty, staff and students on discrimination and harassment based on race, color and national origin. “Schools have an obligation to ensure a safe learning environment for everyone. We will continue to use all of the tools in our law enforcement arsenal to ensure that all students can go to school without fearing harassment,” Thomas E. Perez, then assistant attorney general for the DOJ's Civil Rights Division, said at the time. Asked to comment about that period and what actions officials have taken since then, the School District of Philadelphia said it has prioritized student safety. District policy is to investigate all complaints that allege bullying, harassment and discrimination, andschool climate programsaim to improve students’ relationships with each other. “The School District of Philadelphia strives to provide a safe and positive educational environment for all school community members,” the district said in its statement. **When bullied Asian children ask for help, is anyone listening?** Huynh, the mother who spoke before the school board in Texas, was in sixth grade when she first experienced a hate incident. As she walked home from school, a boy kicked her in the knee, causing her to fall. Then he pulled her hair. “Chink,” she remembered him calling her, as she nursed her scraped knee. At school, she’d been called “immigrant” and had pretzels thrown at her. To protect themselves from assaults, her friends carried brass knuckles. She felt like she couldn’t tell her parents about the violence and bullying she saw in school. As with many immigrant families, she and her sister were often their parents’ translators. Without language access offered by the school, Huynh said she didn’t think there were resources to support her. “We didn't know what to do, and we just kept quiet,” she said about her experience. As AAPI students break that cycle of silence by reporting incidents to their schools, many of the responses have not inspired confidence. One respondent to the2021 Act to Change Asian American Bullying survey, conducted in partnership with Admerasia and NextShark, said their school didn’t take meaningful action when they reported bullying, and they felt the administration and teachers were victim blaming and gaslighting them. Another said their bullying was discussed once in class, then swept “under the rug.” The majority of the time, students said, reporting their experience to an adult did not make the situation better. That expected outcome drives a lot of the underreporting, the survey suggests. Believing the experiences of AAPI youth is the “baseline” requirement for improving the situation, said Soukprida Phetmisy, executive director of Act to Change. “And then as adults, making sure that we can follow through on making them feel protected and heard,” she said. “We need to be able to say as AAPI folks that something is happening to us and we need people to see it and take it seriously.” Victoria Zhang, 19, educated her whole life in the same Texas district that Huynh’s sons attend, said she was six years old when she first experienced racism there. As more anti-Asian hate incidents were reported across the country during the height of the pandemic, Zhang felt compelled to do something at her Cypress Woods High School campus that showed there was an Asian community that was present and active. As leader of the Asian Pacific American Culture Club, she had the idea to put up “Stop Asian Hate” posters around the school. Zhang said school officials were initially reluctant to approve the posters but eventually relented. “It was clearly something the administration was not comfortable engaging in,” she said. Flabbergasted, she managed to persuade officials that standing up against Asian hate was neither “political” nor controversial. “It's simply a statement that we should be protecting and supporting a large community,” she told them. Zhang also felt school officials didn't do enough to address racially targeted bullying on campus. Students mocked her eyes and the food she ate, told her to go back to where she came from, and took pictures of her and her friends and compared them to characters on the Korean show “Squid Game.” When she would inform staff of incidents, they asked if she was threatened or harmed physically, and when she said she wasn’t, they did nothing to respond to the harassment, Zhang said. She later found out that one of the boys who took pictures was placed in detention. She wonders if teachers didn't view the incidents as racist. “I guess there was no roadmap of how to address this, how to handle it, when there was a need to take action,” she said. But there was. Over the years, the federal government has issued multiple letters reminding schools of their responsibility to protect children from such harassment. Ina joint letter, the Department of Justice, the Department of Education and the White House Initiative on Asian Americans and Pacific Islanders urged schools in 2016 to protect Asian American, Pacific Islander, Native Hawaiian, Sikh, Muslim and Arab students from discrimination. Amid the pandemic surge in anti-Asian hate incidents, the Department of Education issued aMarch 2020letter asking for “careful attention” to address the problem anda May 2021letter “to remind you of schools’ obligations to investigate and address all forms of harassment based on race, color, and national origin.” In February 2023, Zhang participated in a school sit-in about addressing on-campus racism. Those same students asked the CFISD board to update the code of conduct so people would be held accountable for racist and discriminatory acts.In her testimony, Zhang said administrative inaction was “a trend.” “I have addressed the issue of racism at multiple student council and president council meetings, yet there's been no change,” she told the board. “We will not expect a continued lack of consequences. Racism must be expelled from our schools.” CFISD and Cypress Woods High School did not respond to questions about Zhang’s experience and whether the district’s code of conduct has been updated. Zhang said she did convince administrators to let her put up the posters. But Black peers who wanted a “Black Lives Matter” poster on campus were not permitted to do the same, she said. ​​Huynh, meanwhile, continues to push for accountability. The problems haven’t stopped, she said. In February, her younger son told school officials he heard two students using derogatory slurs against Asians and told them to stop. Huynh said she found out later that one of the students retaliated by punching him in the back. Her older son, now 12 and in middle school, told Huynh that a student who verbally and physically bullied him wore a white paper bag over his head in physical education class and said it signified the KKK. The student performed Nazi salutes in class over multiple days, Huynh said. After she complained in March, the assistant principal took steps to separate the students, and have had no interactions since. **Project team** Reporter: Amritpal Kaur Sandhu-LongoriaData reporter: Amy DiPierro Editors: Mc Nelly Torres and Jamie Smith Hopkins Design: Janeen Jones Data check: Amy DiPierro and Joe Yerardi CFISD did not respond to multiple requests by Public Integrity seeking comment about the incidents or its efforts to address anti-Asian harassment generally. Huynh said she asked the school to publicly condemn racism following the school bus incident. But she said officials told her they would only counsel the students about bullying, not address the racial component of what happened. Administrators told her she was “making a big deal out of the situation” and it was an “isolated” incident, she said. But she knows these incidents can become a big deal. They’re already taking an emotional toll on both her boys. Her older son is hyper-aware of his surroundings, constantly looking around to make sure he is safe, and her younger boy is afraid to be alone in case someone might attack him. After she spoke before the school board in November, Huynh said other parents told her they were glad she spoke up. Their children were encountering racial harassment too. “I don't want this to happen to other children or my children,” Huynh said. “It already happened to my children. I know it's happening to other children.” Amy DiPierro, a data reporter with the Center for Public Integrity, contributed to this report. Amritpal Kaur Sandhu-Longoria is an award-winning investigative reporter whose work focuses on keeping people at the center of the story. She has worked withUSA TODAY and Record Searchlight in Redding, California, andhas held fellowships with the American Political Science Association in Washington, D.C., and Global Health Corps in Uganda. She is a formernurseand is fluent in Hindi and Punjabi. **Related** **Amritpal Kaur Sandhu-Longoria** Amritpal Kaur Sandhu-Longoria is an award-winning investigative reporter whose work focuses on keeping...More by Amritpal Kaur Sandhu-Longoria TheCenter for Public Integrityis a nonprofit investigative news organization focused on inequality in the U.S. We do not accept advertising or charge people to read our work. **latest Stories** **Public Integrity’s “40 Acres and a Lie” project is honored by the Philip Meyer Journalism Awards** **Inside the scramble to stop the displacement of thousands of California foster children** **Pennsylvania bill could prevent schools from barring homeless students** **Despite efforts to close gap, parity in mental health care remains elusive** **‘The restrictions are unbelievable’: States target voter registration drives** **In Idaho, don’t say ‘abortion’?** Republish This Story Republish our articles for free, online or in print, under a Creative Commons license. **Republish this article** This work is licensed under aCreative Commons Attribution-NoDerivatives 4.0 International License. **Asian students face racism, harassment at school. What would make it stop?** by Amritpal Kaur Sandhu-Longoria, Center for Public IntegrityMay 16, 2024 Facebook Page Twitter Linkedin Instagram TikTok About Us Board of Directors Archive Contact Us Public Integrity documents Facebook Twitter LinkedIn Instagram Investigating the systems and circumstances that contribute to inequality."}