{"id": 986, "name": "WEWS - News 5 - Cleveland", "domain": "news5cleveland.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.news5cleveland.com/news/local-news/we-follow-through/civilian-police-review-board-makes-discipline-recommendations-for-police-officer-a-year-after-mayors-crash", "title": "Civilian Police Review Board Makes Discipline Recommendations For Police Officer A Year After Mayors Crash", "content": "Menu Stream News 5Where You Can Watch StreamingNews 5 at 6News 5 Livestream Where You Can Watch Streaming News 5 at 6 News 5 Livestream Where You Can Watch Streaming News 5 at 6 News 5 Livestream VideosNews 5 at 6News 5 livestream event News 5 at 6 News 5 livestream event News 5 at 6 News 5 livestream event WeatherHourly ForecastDaily ForecastLive RadarWinter Weather AwarenessSchool ClosingsSevere Weather AlertsWeather NewsLive CamerasPower OutagesTornado Safety Hourly Forecast Daily Forecast Live Radar Winter Weather Awareness School Closings Severe Weather Alerts Weather News Live Cameras Power Outages Tornado Safety Hourly Forecast Daily Forecast Live Radar Winter Weather Awareness School Closings Severe Weather Alerts Weather News Live Cameras Power Outages Tornado Safety Academic Challenge Pet Of The Week NewsLocalCleveland MetroAkron CantonOhioNationalWorld NewsSchoolsTwo AmericasMissing PersonsMade Us SmileYour ServiceNASA Glenn Local Cleveland Metro Akron Canton Ohio National World News Schools Two Americas Missing Persons Made Us Smile Your Service NASA Glenn Local Cleveland Metro Akron Canton Ohio National World News Schools Two Americas Missing Persons Made Us Smile Your Service NASA Glenn News by CountyCuyahoga CountyStark County NewsSummit CountyLake CountyLorain CountyMedina County NewsGeauga County NewsPortage County NewsAshtabula County NewsWayne County NewsAshland County NewsErie County NewsRichland County NewsHolmes County NewsHuron County NewsTuscarawas County NewsCarroll County News Cuyahoga County Stark County News Summit County Lake County Lorain County Medina County News Geauga County News Portage County News Ashtabula County News Wayne County News Ashland County News Erie County News Richland County News Holmes County News Huron County News Tuscarawas County News Carroll County News Cuyahoga County Stark County News Summit County Lake County Lorain County Medina County News Geauga County News Portage County News Ashtabula County News Wayne County News Ashland County News Erie County News Richland County News Holmes County News Huron County News Tuscarawas County News Carroll County News SportsBrownsCavaliersGuardiansOhio StateNext Man UpBrowns Player of the GameStudent Athlete of the Week Browns Cavaliers Guardians Ohio State Next Man Up Browns Player of the Game Student Athlete of the Week Browns Cavaliers Guardians Ohio State Next Man Up Browns Player of the Game Student Athlete of the Week InvestigationsAll InvestigationsBreaking Their SilenceDangerously UnderstaffedCounty JailFertility Clinic FailureCleveland WaterDiagnosis: DebtSocial InsecurityDomestic Violence All Investigations Breaking Their Silence Dangerously Understaffed County Jail Fertility Clinic Failure Cleveland Water Diagnosis: Debt Social Insecurity Domestic Violence All Investigations Breaking Their Silence Dangerously Understaffed County Jail Fertility Clinic Failure Cleveland Water Diagnosis: Debt Social Insecurity Domestic Violence Don't Waste Your Money Team We Follow Through Let's Go NEO Politics2025 Primary Election ResultsAbortion in OhioMarijuana in OhioLocal PoliticsElections LocalOhio PoliticsNational PoliticsElections National 2025 Primary Election Results Abortion in Ohio Marijuana in Ohio Local Politics Elections Local Ohio Politics National Politics Elections National 2025 Primary Election Results Abortion in Ohio Marijuana in Ohio Local Politics Elections Local Ohio Politics National Politics Elections National EntertainmentTV ListingsConcertsRock HallCedar Point100 Hidden Gems50 Best Patios TV Listings Concerts Rock Hall Cedar Point 100 Hidden Gems 50 Best Patios TV Listings Concerts Rock Hall Cedar Point 100 Hidden Gems 50 Best Patios TrafficTraffic MapTraffic NewsGas Prices Cleveland and Akron Traffic Map Traffic News Gas Prices Cleveland and Akron Traffic Map Traffic News Gas Prices Cleveland and Akron Best of Class 2025 Spotlight 5 Cleveland Home Experts Watch Cash Explosion Ohio Lottery Results News 5 User Guide About UsStaffSales StaffContact UsNews 5 AppsNews LiteracyContestsMoving ForwardLicensing archived video from News 5AdvertiseWEWS: The first 70 yearsSupportTV Listings Staff Sales Staff Contact Us News 5 Apps News Literacy Contests Moving Forward Licensing archived video from News 5 Advertise WEWS: The first 70 years Support TV Listings Staff Sales Staff Contact Us News 5 Apps News Literacy Contests Moving Forward Licensing archived video from News 5 Advertise WEWS: The first 70 years Support TV Listings Advertise with News 5 Sign In Newsletters Sign Out Manage Emails Apps Careers Search Weather Don't Waste Your Money Team What Happened Now? Moving Forward Tablo Contests Contact Us Best of Class 2025 **Actions** Facebook Tweet Email **Civilian Police Review Board makes discipline recommendations for police officer a year after mayor's crash** CLEVELAND — Cleveland's Civilian Police Review Board has made its recommendations nearly a year after a police officer crashed while rushing Mayor Justin Bibb to a meeting. The board sustained four of five counts made against the officer. On June 13, 2024, veteran police officer Demetrius Woods, who is part of Bibb's security detail, was driving the mayor to City Hall in an unmarked police SUV. Watch our coverage of that crash: RELATED:Mayor Justin Bibb's vehicle turned on emergency lights before running intersection that led to crash Woods turned on his lights but failed to activate his sirens and then proceeded to run a red light at the intersection of East 12th Street and Superior Avenue. The police car hit a work van, totaling it. Nobody in either car was seriously injured. The police officer was taking Bibb to an important meeting on the cyberattack that crippled city hall: RELATED:Driver in Mayor Bibb's crash told police he drove through red light heading to 'emergency meeting' The case has been reviewed by multiple groups, including internal affairs and a special prosecutor, but nearly a year later, not even a traffic ticket has been issued. Tyler Sinclair, spokesperson for the City, blames the delays on the Office of Professional Standards saying the case was tentatively scheduled for a disciplinary hearing last Septemeber, but was \"dragged on due to delays initiated by OPS.\" Tuesday, the Civilian Police Review Board, which has standing in the case after receiving an anonymous citizen complaint, heard from investigator Art Bowker with the Office of Professional Standards. \"That was his position, I'm a police officer, I'm allowed to go through emergency lights,\" said Bowker. But the General Police Order is clear, said Bowker, \"You are only to do that under certain circumstances, the big one there is an emergency, and even then, you are supposed to do two things: activate your lights and turn on your siren.\" According to the investigator, Woods and his union representative said, \"police officers do this all the time.\" Bowker also said the mayor attending a big meeting didn't constitute a police emergency. The Civilian Police Review Board made its recommendations for Officer Woods for the crash, not wearing a body cam, not wearing a protective vest and not filing a report in due time. He could face anything from verbal counseling to a five-day suspension. Those recommendations now go to police brass to finalize. An accusation that Woods made false statements was ruled, \"Unfounded.\" **Sign up forWhat Happened Now?- a daily email newsletter spotlighting the top news in the Cleveland area each day.** **now signed up to receive theWhat Happened Now?** **Click here for stories we’ve followed through on and to submit your ideas.** **Click here for stories we’ve followed through on and to submit your ideas.** Northeast Ohio Traffic News Don't Waste Your Money Team Sports Entertainment Life Video Marketplace Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public Files FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact News5Cleveland WEWS"}