{"id": 1623, "name": "WTVA - Tupelo News", "domain": "wtva.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wtva.com/tickets-for-2025-st-jude-dream-home-giveaway-go-on-sale-june-12/article_dc5352f6-9305-4264-b7e6-dd933f0b7fd0.html", "title": "Tickets For 2025 St Jude Dream Home Giveaway Go On Sale June 12", "content": "Facebook Twitter YouTube Instagram Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Local Mississippi Alabama National June 3 Municipal Elections Interactive Radar Maps & Forecasts Alerts Weather Cameras Closings & Delays Storm Shelters Submit Weather Photos WeatherCall High School Mississippi State Ole Miss College National On Demand Recipes YouTube Local Now TV Apps Livestream TV Listings Contests Deals Shop Local Community Calendar Studio 9 With Tanya Carter Skilled To Work Outdoor Adventures with Chelsea Johnny D. Talks To The Stars 2025 St. Jude Dream Home Giveaway United Way $50K Giveaway Monday's Miracle Home, Garden & Outdoor Expo Ask The Home Experts Build Local Medical Minute Legally Speaking Ask The Experts Senior Health Fair Meet The WTVA Team Download Our Apps Sign Up For Email Alerts Advertise With WTVA Digital Marketing Job Openings WTVA Internships Our History Schedule Noon Show or Studio 9 Interview Schedule Station Tour Site searchSearch Site searchSearch Site searchSearch 87° Search Search Search Open user controlsLog In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Facebook Twitter YouTube Instagram News Weather Sports Video Watch Live Obituaries Community Contests Contact Email Alerts Sign Up For WTVA Email Alerts Apps Download News, Weather & TV Apps Rendering of the 2025 St. Jude Dream Home in Belden, MS. Source: St. Jude. Facebook Twitter WhatsApp SMS Email Print Copy article link Save Honey diamond ring, courtesy ofVan Atkins Jewelers. Facebook Twitter WhatsApp SMS Email Print Copy article link Save **Tickets for 2025 Tupelo St. Jude Dream Home Giveaway go on sale June 12** By: Zac CarlisleZac CarlisleDigital Content ManagerZac is from the Athens community in Monroe County. He's a graduate of Hatley High School, Itawamba Community College and Mississippi University for Women.Author email Digital Content Manager Zac is from the Athens community in Monroe County. He's a graduate of Hatley High School, Itawamba Community College and Mississippi University for Women. Zac is from the Athens community in Monroe County. He's a graduate of Hatley High School, Itawamba Community College and Mississippi University for Women. Author email Digital Content Manager Zac is from the Athens community in Monroe County. He's a graduate of Hatley High School, Itawamba Community College and Mississippi University for Women. Zac is from the Athens community in Monroe County. He's a graduate of Hatley High School, Itawamba Community College and Mississippi University for Women. Zac is from the Athens community in Monroe County. He's a graduate of Hatley High School, Itawamba Community College and Mississippi University for Women. Author email May 5, 2025 May 5, 2025Updated3 hrs ago Facebook Twitter WhatsApp SMS Email Rendering of the 2025 St. Jude Dream Home in Belden, MS. Source: St. Jude. Facebook Twitter WhatsApp SMS Email Print Copy article link Save Purchase a $100 ticket for a chance to win the 2025 Tupelo St. Jude Dream Home and other awesome prizes. Every $100 ticket helps ensure families never receive a bill from St. Jude for treatment, travel, housing or food — so they can focus on helping their child live. Call1-800-456-8351or visitDreamHome.orgto purchase a ticket. About the Dream Home Address -3292 Summerlin Drive, Belden, MS 4 bedrooms, 3.5 bathrooms 2,618 estimated square feet Equipped with smart home technology Upgraded kitchen with walk-in pantry Large bonus room for entertaining Primary bath featuring a steam shower Estimated value - $466,000 Construction company -Tucker Construction Important Dates Tickets go on sale - June 12 Open house dates - Aug. 23 to Sept. 21; Saturdays: 9 a.m. to 5 p.m.; Sundays: noon to 5 p.m. Giveaway date - Sept. 25 (live giveaway on WTVA 9 News at 4 p.m.) Other Prizes Tickets on Sale Prize - Purchase a ticket on June 12 for a chance to win a Honey diamond ring, courtesy ofVan Atkins Jewelers. Honey diamond ring, courtesy ofVan Atkins Jewelers. Early Bird Prize - Purchase a ticket by July 11 for a chance to win a $10,000 gift card to Brooks Grocery, courtesy ofBrooks Grocery. Bonus Prize - Purchase a ticket by Aug. 8 for a chance to win a $10,000 Visa gift card, courtesy ofDream Day Foundation. Open House Prize - Register for free at the house (from Aug. 23 to Sept. 21; Saturdays: 9 a.m. to 5 p.m.; Sundays: noon to 5 p.m.) for a chance to win a $10,000 shopping spree to Staggs Interiors, courtesy ofStaggs Interiors. Open this link to view FAQs. WTVA interviewed several individuals at St. Jude about how public donations go a long way in helping families. Watch their stories in the videos below. **St. Jude Stories: Doctor explains importance and mission of St. Jude Children's Research Hospital** **St. Jude Stories: Mother found home at St. Jude after hospital gave hope to her family** **St. Jude Stories: Puerto Rican has a new life thanks to St. Jude and public donations** Download WTVA's news, weather and TV appsto receive alerts, watch LIVE newscasts and more. Sign up to receive email alertsfor breaking news, weather and more. Subscribe to theWTVA 9 News YouTube channelfor on-demand videos. Facebook Twitter WhatsApp SMS Email Print Copy article link Save Digital Content Manager Zac is from the Athens community in Monroe County. He's a graduate of Hatley High School, Itawamba Community College and Mississippi University for Women. Zac is from the Athens community in Monroe County. He's a graduate of Hatley High School, Itawamba Community College and Mississippi University for Women. Zac is from the Athens community in Monroe County. He's a graduate of Hatley High School, Itawamba Community College and Mississippi University for Women. Author email {{description}} Email notifications are only sent once a day, and only if there are new matching items. **Recommended for you** Facebook Twitter YouTube Instagram News Weather Sports Video Watch Community Contact Search Careers Advertise with WTVA WTVA FCC Public Inspection File WTVA EEO Report WTVA Children Programming Report FCC Applications - WTVA Advertiser Payments AI Usage Policy Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}