{"id": 896, "name": "Mercatus", "domain": "mercatus.org", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.mercatus.org/hayekprogram/hayek-program-podcast/applied-mainline-economics-matthew-mitchell-and-peter-boettke", "title": "Applied Mainline Economics Matthew Mitchell And Peter Boettke", "content": "Fellowships Research Policy Insights Initiatives Donate FellowshipsFellowships ResearchResearch Policy InsightsPolicy Insights InitiativesInitiatives DonateDonate **More from Mercatus** Academic & Student ProgramsAcademic & Student Programs PodcastsPodcasts SubstacksSubstacks NewslettersNewsletters About MercatusAbout Mercatus ScholarsScholars LeadershipLeadership Job OpeningsJob Openings AnnouncementsAnnouncements EventsEvents Contact UsContact Us |F. A. Hayek ProgramF. A. Hayek Program |Mercatus Original PodcastsMercatus Original Podcasts |Hayek Program PodcastHayek Program Podcast |May 30, 2017 **'Applied Mainline Economics' with Matthew Mitchell and Peter Boettke** Matthew D. Mitchell Peter J. Boettke On April 25, 2017, Mercatus Senior Research Fellow Matthew Mitchell gave a brief presentation on his new bookApplied Mainline Economics(coauthored with Hayek Program Director Peter Boettke). This presentation was followed by a moderated discussion between Mitchell and Boettke on the core tenets of mainline economics and how these guiding principles help to create a freer, more peaceful, and more prosperous society. **About Hayek Program Podcast** **Sign up for the latest from the F.A. Hayek Program** What We DoResearchApplied Economic InsightsFellowships Research Applied Economic Insights Fellowships Research Applied Economic Insights Fellowships Who We AreScholarsLeadershipAbout MercatusJob OpeningsEvents Scholars Leadership About Mercatus Job Openings Events Scholars Leadership About Mercatus Job Openings Events InitiativesDiscourse MagazineEmergent VenturesMarginal Revolution UniversityThe 1991 ProjectProgram on Pluralism and Civil ExchangeQuantGov Discourse Magazine Emergent Ventures Marginal Revolution University The 1991 Project Program on Pluralism and Civil Exchange QuantGov Discourse Magazine Emergent Ventures Marginal Revolution University The 1991 Project Program on Pluralism and Civil Exchange QuantGov PodcastsVirtual SentimentsConversations with TylerMacro MusingsIdeas of IndiaHayek Program PodcastPluralist PointsThe Marginal Revolution Podcast Virtual Sentiments Conversations with Tyler Macro Musings Ideas of India Hayek Program Podcast Pluralist Points The Marginal Revolution Podcast Virtual Sentiments Conversations with Tyler Macro Musings Ideas of India Hayek Program Podcast Pluralist Points The Marginal Revolution Podcast © Copyright 2025 Mercatus Center"}