{"id": 949, "name": "National Monitor", "domain": "natmonitor.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://natmonitor.com/2017/12/31/despite-media-opposition-president-trumps-track-record-of-success-is-undeniable/#respond", "title": "Despite Media Opposition President Trumps Track Record Of Success Is Undeniable", "content": "Home About the team Contact Us Privacy Policy **National Monitor** **Opinion and Analysis from all Angles** Politics / Elections Civil Rights The Economy Environment Justice Terrorism Foreign Policy Health **Despite a Year-Long Media Onslaught, Trump is Suddenly On a Roll** December 31, 2017byStewart LawrenceLeave a Comment Donald Trumpwasn’t supposed to survivehis first year in office — so it’s hardly surprising that the mainstream media is having a difficult time admitting that the president is beginning to enjoy some real governing “success.” On the heels of hisbest jobs reportsince taking office, Trump scored a major victory last week with passage of anhistoric tax reform bill. Other legislative breakthroughs, includingimmigration reform,are likely to emerge in January. And sometime in the spring, Trump, in all likelihood, will shepherd a$1 trillion infrastructure spending billthrough Congress. But it’s not just Trump’s success on the domestic front that has confounded his opposition. The president’s foreign policy is also showing impressive – if largely unheralded — results. None is more significant, perhaps, than the administration’s military campaign against ISIS and Islamic terrorism in Syria and Iraq. During the 2016 presidential campaign, Trump promised totake the war to ISISin a manner that Barack Obama had not. And since taking office, he’s done just that, stepping up the air war, devastating the group’s self-declared Caliphate, and decimating the insurgents’ fighting capacity. The evidence that ISIS is in retreat is overwhelming. Last July theWashington Postreportedthat the Islamic State had lost about 60 percent of the territory it controlled at the peak of its expansion, which would have left a sizable area, mostly in Syria but also Iraq, still to be recaptured. But more recent reports reveal that American-based forces in Iraq and Syria have forced ISIS into a strategic retreat. In early November, for example, ISIS militants withdrew from their last stronghold in Syria, a strategic town near the border with Iraq, following a government offensive that “effectively left the extremist group’s fighters dispersed in villages and small towns in the desert,” according tooverseaspress reports. Last week, the Pentagonreportedthat ISIS has lost 98% of the territory that once comprised its Caliphate, leaving the group to return to insurgent operations and acts of terror in Western capitals. The latest American intelligence assessment says fewer than 1,000 ISIS fighters now remain in Iraq and Syria, down from a peak of nearly 45,000 just two years ago. In recent press briefings, U.S. officials credit nearly 30,000 U.S.-led coalition airstrikes and regional partners on the ground for killing more than 70,000 jihadists. Why didn’t the Obama administration do more to defeat ISIS? Criticssayit was due to the president’s decision to “micro-manage” the air war, much as the Democratic president Lyndon Johnson once did in Vietnam. Obama imposed onerous “rules of engagement” on coalition forces, ostensibly to more carefully discriminate between military and civilian targets. “The limitations that were [imposed] actually resulted in greater civilian casualties,” says retired Air Force Lt. Gen. David Deptula, who formerly headed up U.S. Air Force intelligence. Deptula also notes that ISIS-controlled oil supplies weren’t targeted for 15 months beginning in 2014, giving the terror group $800 million in much needed revenue to plot attacks and capture millions of innocents to build up the Caliphate. Military expertscautionthat the war against ISIS is far from over — but Trump’s escalation has clearly worked. More than half of the latest losses suffered by ISIS have occurred during the past year alone. You might think that would be front-page news in theNew York Timesor the lead story on CNN or MSNBC. Filed Under:Foreign Policy,Politics,The Economy,USTagged With:donal trump,immigration,infrastructure,iraq,ISIS,mainstream media,media,syria,tax reform,terrorism,Trump presidency,White House **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. **Why Kamala?** August 13, 2020ByJerry NewberryLeave a Comment What does Biden’s pick of Kamala Harris add to his campaign?AP Photo/Carolyn Kaster **Panic Comes from Playing the Numbers Game** April 1, 2020ByJerry NewberryLeave a Comment The corona virus numbers are much to fluid to draw any realistic predictions, but that won’t stop them from coming. **The days of Coronavirus panic should be numbered** March 14, 2020ByPaul KilmartinLeave a Comment Reasons to believe the rate is slowing and has upper bounds. **Why No Witnesses Were Called in the Impeachment Process** February 5, 2020ByJerry NewberryLeave a Comment Neither party really wanted additional testimony in the impeachment trial. Copyright © 2025 ·News Pro ThemeonGenesis Framework·WordPress·Log in"}