{"id": 2199, "name": "Confederacy of Drones", "domain": "confederacyofdrones.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://confederacyofdrones.com/2020/05/20/for-everyones-safety-please-step-away-from-the-light/", "title": "For Everyones Safety Please Step Away From The Light", "content": "**Confederacy of Drones** **Confederacy of Drones** About Blog Roll Cartoon Archives Contact Us **For everyone’s safety, please step away from the light** ImagePosted onMay 20, 2020Updated onMay 19, 2020 **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Click to email a link to a friend (Opens in new window)Email **Related** This entry was posted inCartoon,Health,Mediaand taggedcovid cartoon,Covid-19,firefly cartoon,Hydroxychloroquine cartoon,journalism cartoon,media cartoon,reporter cartoon,Trump cartoon. And just how big are the pages?! The lockdown’s unintended consequences **Leave a commentCancel reply** Δ **More cartoons on Facebook** **Follow this blog** Follow this blog to receive notifications of new posts Email Address: Follow **Archives** **Cartoon Archive** **Categories** **Recent Posts** Goodwyn up at GoComics How do you top the satire on newspapers’ front pages? The generosity of celebrities knows no bounds Dare to dream The lockdown’s unintended consequences **Meta** Create account Log in Entries feed Comments feed WordPress.com **Social** View confederacyofdrones’s profile on Facebook View confederacyofdr’s profile on Twitter View goodwynal’s profile on Instagram **Cartoon of the Day feed** Create a free website or blog at WordPress.com. We teamed up with Eventbrite Comment Reblog SubscribeSubscribedConfederacy of DronesJoin 160 other subscribersSign me upAlready have a WordPress.com account?Log in now. Confederacy of Drones Already have a WordPress.com account?Log in now. Confederacy of Drones Already have a WordPress.com account?Log in now. Confederacy of DronesSubscribeSubscribedSign upLog inCopy shortlinkReport this contentView post in ReaderManage subscriptionsCollapse this bar Confederacy of Drones SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Confederacy of Drones SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar **** **** ****"}