{"id": 1404, "name": "The London Economic", "domain": "thelondoneconomic.com", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.thelondoneconomic.com/must-reads/grandma-with-deadly-brain-cancer-desperate-to-raise-250000-to-triple-life-expectancy-and-see-granddaughter-go-to-prom-350871/", "title": "Grandma With Deadly Brain Cancer Desperate To Raise 250000 To Triple Life Expectancy And See Granddaughter Go To Prom 350871", "content": "Privacy policy T&C’s About UsFAQ FAQ FAQ Contact us Guest Content TLE News Politics OpinionElevenses Elevenses Elevenses Business Food Travel Property JOBS AllAll EntertainmentFilmSportTech/AutoLifestyleLottery ResultsLottoSet For LifeThunderballEuroMillions All Entertainment Film Sport Tech/Auto Lifestyle Lottery ResultsLottoSet For LifeThunderballEuroMillions Lotto Set For Life Thunderball EuroMillions All Entertainment Film Sport Tech/Auto Lifestyle Lottery ResultsLottoSet For LifeThunderballEuroMillions Lotto Set For Life Thunderball EuroMillions Lotto Set For Life Thunderball EuroMillions **Grandma with deadly brain cancer desperate to raise £250,000 to triple life expectancy and see granddaughter go to prom** **Alison Horspool was diagnosed with deadly brain cancer after paying for a private MRI scan and is hoping to raise a quarter of a million pounds.** A grandmother who was diagnosed with “deadliest brain cancer” after paying for a private MRI scan is hoping to raise a quarter of a million pounds and triple her life expectancy, so she can share special moments with her grandchildren, including seeing her granddaughter go to prom. Alison Horspool, 61, was diagnosed with glioblastoma IDH – wildtype grade 4, after being taken to hospital on Christmas day last year with “burning pins and needles” down the left side of her body and slurred speech. Doctors first thought Alison had suffered a stroke, but she was not 100% convinced and decided to pay for the private MRI scan a few months later to “put her mind at ease” – the scan revealed three masses on her brain. Despite being told she only has a maximum of 16 months to live, Alison is determined to survive for another “four or five years” so that she can see her six grandchildren and three step-grandchildren grow up. She has found a number of treatments which are currently being tested and could boost her chances of survival in the next few years, but they come with a £250,000 price tag. Alison said: “I’ve got seven children, nine grandchildren and I’m just not prepared to go yet. “I just need to see the young ones go to school and my eldest, who I call Sparkle, go to prom. “If I could get four years, I wouldn’t be happy, but I’d have achieved things that I really need to do. “Unfortunately the tumour that I’ve got, you couldn’t get a worse one, because it’s a ‘wild one’, which means it always grows back.” **RelatedPosts** **Anti-aging drug for dogs set to be available by 2026** **Keir Starmer vows to ‘close door on Putin’ with GB Energy** **Discount retailer is selling Maltesers Christmas treats for just 1p** **Donald Trump lashes out at judge while giving evidence in civil fraud trial** Alison paid for an MRI scan at the Duchy Hospital in Truro, Cornwall, after returning from holiday in Turkey in January 2023. “I said to my partner, I have to go for an MRI scan just to put my mind at rest whether I’ve had a stroke or not,” she said. “I was at Center Parcs when they called me and said ‘How are you?’ “I said ‘I’m tired, I’m trying to push a baby up a hill’. “They couldn’t believe that I was well.” After receiving the results, Alison went for a biopsy in April 2023 and was given the devastating news that the lumps were in fact a deadly brain cancer and that without treatment, she only had months to live. “When we went back to see the specialist my children were with me, and I walked in and said ‘I’m feeling really good, I hope you’ve got some good news for me’,” said Alison. “He told me what it was and said one in a million get this. “I’ve got my daughter crying, my stepdaughter gasping, my partner wanting to collapse and I’m like, right, we’ve just got to get on with this.” Even with “chemo pills” and radiation five days a week, her chances of survival remain low, with only 25% of patients hitting the one year mark and 5% surviving for more than five years, according to The Brain Tumour Charity. “I was given three to six months without treatment and 12 to 16 months with treatment,” she said. “So playing devil’s advocate, I won’t make it to my next birthday.” The diagnosis has scuppered Alison’s plans to retire in the sunshine with her partner, James Elvins, 58. “I’ve been going backwards and forwards to Spain for the past four years because that’s where me and my partner wanted to end our days,” she said. “But this has all happened, so I’m never going back.” Despite being told that her days are numbered, Alison remains fiercely optimistic and says she is not ready to die. “I’m 61 and I feel like I’ve been rolled a bit of a bad dice here,” she said. “So I actually look at it like a challenge, it’s just another chapter and I’ll somehow fight this little challenge.” Her grandchildren, Joseph, one, Koby, three, Seve, six, Louie, seven, Arria, eight, and Francesca, 12, are what is keeping Alison’s desire to survive four more years burning, as well as her step-grandchildren Conor, three, Mia, six, and James, eight. “I need to see the young ones playing their first football game and going to school,” she said. “My eldest granddaughter Francesca is 12 and I want to buy her prom dress with her, so that’s four or five years.” She also praised her children, Abigail, Felicity, Harry, Harvey, George, Mairead and Niall, saying they have gone “above and beyond” what any parent could possibly expect. Alison has found several treatments which are being trialled in Germany and the United States and could get her to Francesca’s prom. She said: “We have no choice – if I want to stay alive, I have to go down the private route, there’s no alternative. “The trials show that 13% of patients survived over five years. “If it triples my life, I’m going to get the four years I’ve asked for.” The treatments are expensive, so Alison’s daughters have set up a GoFundMe page in a bid to raise £250,000 – they have so far received £2,820. She said: “We didn’t realise that there had been no research on glioblastoma in like 20 years, and that brain cancer was essentially a death sentence. “It’s just sad that I’ve got one of the hardest and most expensive cancers. “But what can you do, you’ve got to just try and raise the money one way or another. “It’s just unbelievable how kind people have been.” Alison, who has been told the next three weeks of radiotherapy are going to be gruelling, is determined to make the most of the time she has left. “I’ve got to really take advantage of the last however long it will be,” she said. “Whether it’s 16 months, two years or five years, every day is going to count. “But getting this new treatment is really paramount because without it, I haven’t got a chance.” To support Alison, visit herGoFundMe page. **Subscribeto our Newsletter** Email address: View ourPrivacy PolicyandTerms & Conditions **About Us** TheLondonEconomic.com – Open, accessible and accountable news, sport, culture and lifestyle.Read more **SUPPORT** We do not charge or put articles behind a paywall. If you can, please show your appreciation for our free content by donating whatever you think is fair to help keep TLE growing and support real, independent, investigative journalism. **Contact** Editorial enquiries, please contact:[email protected] Commercial enquiries, please contact:[email protected] **Address** © The London Economic Newspaper Limited t/a TLEthelondoneconomic.com- All Rights Reserved.Privacy Home News Politics Lottery ResultsLottoSet For LifeThunderballEuroMillions Lotto Set For Life Thunderball EuroMillions Lotto Set For Life Thunderball EuroMillions Business Sport Entertainment Lifestyle Food Travel JOBS More…ElevensesOpinionPropertyTech & Auto Elevenses Opinion Property Tech & Auto Elevenses Opinion Property Tech & Auto About UsPrivacy policy Privacy policy Privacy policy Contact us © The London Economic Newspaper Limited t/a TLEthelondoneconomic.com- All Rights Reserved.Privacy Home News Politics Lottery ResultsLottoSet For LifeThunderballEuroMillions Lotto Set For Life Thunderball EuroMillions Lotto Set For Life Thunderball EuroMillions Business Sport Entertainment Lifestyle Food Travel JOBS More…ElevensesOpinionPropertyTech & Auto Elevenses Opinion Property Tech & Auto Elevenses Opinion Property Tech & Auto About UsPrivacy policy Privacy policy Privacy policy Contact us © The London Economic Newspaper Limited t/a TLEthelondoneconomic.com- All Rights Reserved.Privacy"}