{"id": 20, "name": "9News - KUSA", "domain": "9news.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.9news.com/colorado-guide", "title": "Colorado Guide", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackColorado GuideNext with Kyle ClarkEn EspañolPoliticsCulture and DiversitySteve On Your SideHealthBusinessEducationNation WorldFeatures9NEWS INVESTIGATESLatest News StoriesDenver police arrest 18 amid protests against Trump immigration policyFired Jeffco Public Schools administrator had no direct criminal contact with juveniles, investigation finds Back Colorado Guide Next with Kyle Clark En Español Politics Culture and Diversity Steve On Your Side Health Business Education Nation World Features 9NEWS INVESTIGATES Denver police arrest 18 amid protests against Trump immigration policy Fired Jeffco Public Schools administrator had no direct criminal contact with juveniles, investigation finds Back Colorado Guide Next with Kyle Clark En Español Politics Culture and Diversity Steve On Your Side Health Business Education Nation World Features 9NEWS INVESTIGATES Denver police arrest 18 amid protests against Trump immigration policy Fired Jeffco Public Schools administrator had no direct criminal contact with juveniles, investigation finds WeatherBackForecastRadar10-DayClosing & DelaysMapsTrafficSki ConditionsNear MeColorado ClimateWeather & ScienceTravelGas PricesLatest Weather StoriesWarm again today with isolated gusty storms this afternoonWhere is the smoke in Colorado coming from? Back Forecast Radar 10-Day Closing & Delays Maps Traffic Ski Conditions Near Me Colorado Climate Weather & Science Travel Gas Prices Warm again today with isolated gusty storms this afternoon Where is the smoke in Colorado coming from? Back Forecast Radar 10-Day Closing & Delays Maps Traffic Ski Conditions Near Me Colorado Climate Weather & Science Travel Gas Prices Warm again today with isolated gusty storms this afternoon Where is the smoke in Colorado coming from? SportsBackHigh School SportsDenver BroncosFair GameCollege SportsColorado RockiesColorado AvalancheDenver NuggetsColorado RapidsOlympicsLocked On Podcast NetworkLatest StoriesVeteran Dobbins joins rookie Harvey to give Broncos a 1-2 rushing duoDeion Sanders absent from football camps in Boulder, Colorado. No reason specified by school Back High School Sports Denver Broncos Fair Game College Sports Colorado Rockies Colorado Avalanche Denver Nuggets Colorado Rapids Olympics Locked On Podcast Network Veteran Dobbins joins rookie Harvey to give Broncos a 1-2 rushing duo Deion Sanders absent from football camps in Boulder, Colorado. No reason specified by school Back High School Sports Denver Broncos Fair Game College Sports Colorado Rockies Colorado Avalanche Denver Nuggets Colorado Rapids Olympics Locked On Podcast Network Veteran Dobbins joins rookie Harvey to give Broncos a 1-2 rushing duo Deion Sanders absent from football camps in Boulder, Colorado. No reason specified by school SearchSearch:Search Advertise With Us Meet the Team Next with Kyle Clark 9NEWS INVESTIGATES 9Things to Do Culture and Diversity En Español Colorado and Company BeOn9 Find 9NEWS TV Listings **Colorado Guide** Zach Bryan announces an affordable concert at Red Rocks on August 10, with ticket registration open online until June 13. Zach Bryan announces an affordable concert at Red Rocks on August 10, with ticket registration open online until June 13. **Featured** Coldplay brings 'Music of the Spheres' tour to Denver debut Greeley Stampede honors Ron Wildeman, Kelly Quick as 2025 grand marshals Registration open for Zach Bryan's surprise Red Rocks concert 'Balloon Boy' saga to be subject of new documentary Dutch Bros opening new northern Colorado location Deion Sanders' Buffs ditch natural grass at home stadium How you can donate to 9Cares Colorado Shares this June Woman describes following wrong-way driver who traveled for 30 miles before fatal crash Runaway zebra Ed captured after week-long adventure 'Balloon Boy' saga to be subject of new documentary Greeley Stampede honors Ron Wildeman, Kelly Quick as 2025 grand marshals Coldplay brings 'Music of the Spheres' tour to Denver debut US figure skating stars reflect at Colorado museum takeover Dutch Bros opening new northern Colorado location Olympic champ Red Gerard inspires youth at Colorado camp Here's the country music lineup at KYGO's Birthday Bash concertDenver's 98.5 KYGO will celebrate its 45th birthday with a concert at Fiddler's Green, featuring Koe Wetzel and other country artists. Chipotle debuts new dip after 5 years, free for Rewards membersAdobo Ranch is Chipotle’s first new dip since the launch of Queso Blanco in 2020. Success stamps the Buffs: Season tickets sold out for 11th timeCU sells out season tickets for the third-straight year as excitement builds around Colorado Buffaloes football. **More Colorado Guide** Deion Sanders' Buffs ditch natural grass at home stadium Denver NWSL breaks ground on new Centennial performance center Last-minute tips for protesting property value assessments Colorado Springs set for pop punk fest with iconic Warped Tour bands El bar Giggling Grizzly cierra tras casi 30 años en el negocio Denver's 16th Street shuttle service renamed after 43 years Colorado Music Hall of Fame moves to new location Denver stadium prepares for 5 concerts this summer **Local News** Denver police arrest 18 amid protests against Trump immigration policyProtests over immigration enforcement raids that sprang up in Los Angeles over the weekend have spread across the country. Fired Jeffco Public Schools administrator had no direct criminal contact with juveniles, investigation findsAn investigation into David Weiss began late last year involving the possession of child sexual abuse material. **Sports** Veteran Dobbins joins rookie Harvey to give Broncos a 1-2 rushing duoDobbins get a one-year, $2.475 million contract after rushing for 905 yards with the rival Chargers last year. Deion Sanders absent from football camps in Boulder, Colorado. No reason specified by schoolDeion Sanders has missed football camps in Boulder, allegedly due to illness, according to ESPN. **Featured Videos** Betty Ford Alpine Gardens in full bloom Choosing flowers for June gardening Colfax Marathon awarding $150k to charities Little Theatre of the Rockies has 3 new productions this summer Timelapse of chalk art drawing CU removes grass at stadium: Artificial turf installed at Folsom Field The Rally Hotel hosts 'Concerts Under the Stars' series Colorado Music Hall of Fame moves to convention center Colorado Guide | Weekend roundup for June 6-8 Timlapse of a chalk art creation Previewing food offerings at the Denver Greek Festival Fun things this weekend at Colorado Rockies games **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}