{"id": 955, "name": "NBC Chicago - WMAQ", "domain": "nbcchicago.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.nbcchicago.com/news/local/7-new-jack-in-the-box-restaurants-to-open-in-chicago-and-the-suburbs-this-summer-heres-where-and-when/3764508/", "title": "7 New Jack In The Box Restaurants To Open In Chicago And The Suburbs This Summer Heres Where And When", "content": "**7 new Jack in the Box restaurants coming to Chicago, suburbs this summer: Where and when** **Jack in the Box lovers in the Chicago area will have the chance to get their favorite fast food as early as this July** Welcome back to Chicago, Jack in the Box. The iconic fast food chain will open as many as10 new locations in the city and suburbsover the next two years as part of a \"strategic expansion into Chicago,\" the restaurant previously announced. And according to the Jack in the Box website, two of its newest suburban locations are set to open as early as July. Stream NBC 5 for free, 24/7, wherever you are. Other locations in and around Chicago will open in August and September, the site said. The full list of confirmed new restaurants and dates can be found below, according to the Jack in the Box website: Carol Stream: 441 E. Geneva Rd., opening Aug. 2025 Chicago: 7807 S. Cicero Ave., opening Sept. 2025 Countryside: 5656 s. La Grange Rd., opening Aug. 2025 Lake in the Hills: 320 N. Randall Rd., opening Sept. 2025 Naperville: 1600 E. Ogden. Ave., opening July 2025 New Lenox: 672 E. Lincoln Hwy., opening Aug. 2025 Plainfield: 2101 Rte. 59, opening July 2025 The California-based fast food restaurant had also previously said a Tinley Park location would open, though that wasn't listed on the website. It wasn't immediately clear where or if other locations were planned, and Jack in the Box did not immediately respond to NBC Chicago's request for comment. The new restaurants mark the first time in over 40 years that the brand will have a presence in the Chicago area, the company said in a recent release, calling it a \"highly anticipated return to the Chicagoland market.\" “This strategic expansion into Chicago allows us to not only satisfy long-standing customer demand for our brand, but also to become a key member in the region’s thriving restaurant scene,” Jack in the Box CEO Darin Harris said in the release. “We’re excited to bring our unique menu where customers can order any item at any time – day or night and we’re confident Jack in the Box will quickly become a favorite local destination.” **Local** **Did you get an email from Uber? What to know about bill to bump driver pay** **ICE to activate Special Response Teams in 5 cities, including Chicago: Sources** According to the release, the chain will also expand into new markets including Utah, Kentucky, Arkansas, Montana, Wyoming, Michigan, Florida, Georgia and Mexico. The new Chicago area locations will offer dine-in, drive-thru and mobile ordering options and will be open 24-hours a day and feature the chain's iconic late-night \"24/7 craveable menu.\" Other popular Jack in the Box menu items include burgers, tacos, chicken sandwiches, milkshakes and breakfast. Feeling out of the loop? We'll catch you up on the news you need to know with the Chicago Catch-Up newsletter. In January, Jack in the Box announced it was addingnew Jack Wrap flavorsonto menus, including a Fajita Jack Wrap and a Caesar Jack Wrap. **Trending Stories** Food & DrinkChicago bar named among best in the country on recent list HospitalsChicago-area hospital system cuts 100 jobs across multiple hospitals, clinics ImmigrationWoman speaks after she was struck by vehicle during Chicago immigration protest ImmigrationICE to activate Special Response Teams in 5 cities, including Chicago: Sources Trump AdministrationGovernment can't hold Columbia activist Mahmoud Khalil, federal judge rules **Weather Forecast** Facebook Instagram TikTok About NBC Chicago Telemundo Chicago Our News Standards Submit Tips for Investigations Newsletters Connect With Us Xfinity: Internet, TV, streaming, more WMAQ Public Inspection File WMAQ Accessibility WMAQ Employment Information Send Feedback FCC Applications Terms of Service Your Privacy Choices Privacy Policy Advertise with us CA Notice Ad Choices Facebook Instagram TikTok"}