{"id": 1241, "name": "Sharon Herald", "domain": "sharonherald.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.sharonherald.com/rate-card/pdf_7f4e1318-41de-11ea-8941-4b71716169eb.html", "title": "Rate Card", "content": "Facebook YouTube Email Comics Puzzles Games Submit a Letter to the Editor Submit a News Tip Place an Obituary Renew My Subscription Start a Subscription Manage My Subscription E-Paper Jobs Homes Place an Ad Public Notice PA Weddings Faith Anniversary Births Engagements Celebrations Submit Anniversary Announcement Submit Engagement Announcement Submit Wedding Announcement Crime Local News Nation State Offbeat Editorials Letters to the Editor Weekly Ads Newspaper Ads Search Search Search Contact UsPurchase PhotosSubmit a Letter to the EditorSubmit a News TipPlace an ObituaryRate Card Purchase Photos Submit a Letter to the Editor Submit a News Tip Place an Obituary Rate Card Purchase Photos Submit a Letter to the Editor Submit a News Tip Place an Obituary Rate Card SUBSCRIBERenew My SubscriptionStart a SubscriptionManage My SubscriptionE-PaperNewsletterText Alerts Renew My Subscription Start a Subscription Manage My Subscription E-Paper Newsletter Text Alerts Renew My Subscription Start a Subscription Manage My Subscription E-Paper Newsletter Text Alerts Login Home E-Paper Podcast Videos SportsEND ZONE END ZONE END ZONE END ZONE News Obituaries Local EventsSee All EventsAdd Your Event See All Events Add Your Event See All Events Add Your Event Celebrations Public Notices Opinion 57°Sharon, PA(16146)TodayAbundant sunshine. High 83F. Winds SW at 10 to 15 mph..TonightSome clouds. Low 62F. Winds SW at 10 to 15 mph.Updated: June 11, 2025 @ 7:00 amFull Forecast Sharon, PA(16146)TodayAbundant sunshine. High 83F. Winds SW at 10 to 15 mph..TonightSome clouds. Low 62F. Winds SW at 10 to 15 mph.Updated: June 11, 2025 @ 7:00 am Abundant sunshine. High 83F. Winds SW at 10 to 15 mph.. Some clouds. Low 62F. Winds SW at 10 to 15 mph. Updated: June 11, 2025 @ 7:00 am Full Forecast Sharon, PA(16146)TodayAbundant sunshine. High 83F. Winds SW at 10 to 15 mph..TonightSome clouds. Low 62F. Winds SW at 10 to 15 mph.Updated: June 11, 2025 @ 7:00 am Abundant sunshine. High 83F. Winds SW at 10 to 15 mph.. Some clouds. Low 62F. Winds SW at 10 to 15 mph. Updated: June 11, 2025 @ 7:00 am Abundant sunshine. High 83F. Winds SW at 10 to 15 mph.. Some clouds. Low 62F. Winds SW at 10 to 15 mph. Updated: June 11, 2025 @ 7:00 am Full Forecast E-Paper Newsletter Facebook YouTube **Testimony in day two of the Lee murder trial** **Jury selected in Lee murder trial** **Holy Trinity Lutheran Church celebrates upcomin…** **Pedestrian killed in Sharon identified** **Rate Card 2020** Jan 1, 2020 Jan 1, 2020 2020 Rate Card **Trending Recipes** **Most Popular** Articles Images Videos Commented Crash leaves at least one person injured, state Route 318 bridge closed Pedestrian killed in vehicle versus pedestrian crash Hermitage woman accused in man's fatal drug overdose Pedestrian killed in Sharon identified Local garden must conform to city ordinances A Montessori preschool opening in Sharon Democrat seeking office as Mercer County Controller Community says farewell to John Hetra Elementary Building Quaker Steak & Lube's second annual carnival in downtown Sharon Firefighters fight fire on Opre Avenue Sorry, there are no recent results for popular videos. Sorry, there are no recent results for popular commented articles. **New Generation Sports Report Podcast** To play the media you will need to either update your browser to a recent version or update yourFlash plugin. Sign up now to get our FREE breaking news coverage delivered right to your inbox. First Amendment:Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances. About Us Contact Us Advertise with Us Subscriber Services Submission Forms Cookie Preferences Home News Comics Puzzles Sports Community Opinion Obituaries Video Gallery Weather Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}