{"id": 323, "name": "Daily Journal (Missouri)", "domain": "dailyjournalonline.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://dailyjournalonline.com/2025/06/11/iron-county-medical-center-welcomes-back-cindy-dulaney-np-as-full-time-hospitalist/", "title": "Iron County Medical Center Welcomes Back Cindy Dulaney Np As Full Time Hospitalist", "content": "Contact Us E-EditionDaily Journal OnlineDemocrat NewsFarmington PressSpecial Sections Daily Journal Online Democrat News Farmington Press Special Sections Daily Journal Online Democrat News Farmington Press Special Sections SubscribeDaily Journal OnlineDemocrat News Daily Journal Online Democrat News Daily Journal Online Democrat News ArchivesDaily Journal OnlineDemocrat NewsFarmington PressNews Story Archives Daily Journal Online Democrat News Farmington Press News Story Archives Daily Journal Online Democrat News Farmington Press News Story Archives HomeCrossword Crossword Crossword NewsDaily Journal NewsDemocrat News Area NewsFarmington Press NewsRegional NewsMissouri NewsSt Louis Cardinals NewsKansas City NewsMoreLocal NewsOutdoorsCommunityLocal BusinessState NewsWorld NewsNational News Daily Journal News Democrat News Area News Farmington Press News Regional NewsMissouri NewsSt Louis Cardinals NewsKansas City News Missouri News St Louis Cardinals News Kansas City News MoreLocal NewsOutdoorsCommunityLocal BusinessState NewsWorld NewsNational News Local News Outdoors Community Local Business State News World News National News Daily Journal News Democrat News Area News Farmington Press News Regional NewsMissouri NewsSt Louis Cardinals NewsKansas City News Missouri News St Louis Cardinals News Kansas City News Missouri News St Louis Cardinals News Kansas City News MoreLocal NewsOutdoorsCommunityLocal BusinessState NewsWorld NewsNational News Local News Outdoors Community Local Business State News World News National News Local News Outdoors Community Local Business State News World News National News SportsDaily Journal SportsDemocrat News SportsFarmington Press Sports Daily Journal Sports Democrat News Sports Farmington Press Sports Daily Journal Sports Democrat News Sports Farmington Press Sports ObituariesDaily Journal ObituariesDemocrat News ObituariesFarmington Press Obituaries Daily Journal Obituaries Democrat News Obituaries Farmington Press Obituaries Daily Journal Obituaries Democrat News Obituaries Farmington Press Obituaries E-EditionDaily Journal OnlineDemocrat NewsFarmington PressSpecial Sections Daily Journal Online Democrat News Farmington Press Special Sections Daily Journal Online Democrat News Farmington Press Special Sections SubscribeDaily Journal OnlineDemocrat News Daily Journal Online Democrat News Daily Journal Online Democrat News PhotosDaily Journal Online PhotosDemocrat News PhotosFarmington Press PhotosSports Photos Daily Journal Online Photos Democrat News Photos Farmington Press Photos Sports Photos Daily Journal Online Photos Democrat News Photos Farmington Press Photos Sports Photos Events Church Directory SubmissionsSubmit a Classified AdSubmit a LegalSubmit a Probate Submit a Classified Ad Submit a Legal Submit a Probate Submit a Classified Ad Submit a Legal Submit a Probate **Iron County Medical Center Welcomes Back Cindy DuLaney, NP, as Full-Time Hospitalist** **PROTECTED CONTENT** If you’re a current subscriber, log in below. If you would like to subscribe, please click the subscribe tab above. Username Password Login Lost your password? **Username and Password Help** Please enter your email and we will send you a password reset link. Email Submit ← Back Tori Kemper, Iron County Medical Center Marketing Director Iron County Medical Center is pleased to announce the return of Cindy DuLaney, NP, who will be joining the medical staff as a full-time hospitalist beginning June 9, 2025. A longtime healthcare provider in the region, DuLaney brings extensive experience in both inpatient and outpatient settings, and a deep commitment to rural healthcare and community-centered care. DuLaney is a licensed and board-certified family nurse practitioner, credentialed through the American Nursing Credentialing Center. She earned her graduate degree from Maryville University in St. Louis in 2021 and previously completed her Master of Science in Nursing at Central Methodist University in 2019. Her healthcare journey began with an Associate Degree in Nursing from Mineral Area College, and she has been a licensed registered nurse in Missouri since 2001. Having previously worked at Parkland Health Center, Iron County Medical Center, and Madison Medical Center, DuLaney is well-versed in the needs and challenges of Critical Access Hospitals and is no stranger to the Iron County community. “I hope to bring compassion, caring, and overall health to the patients I care for,” DuLaney said. “I view primary care as the cornerstone of a healthy community, and I aim to be a provider who not only treats disease but also promotes wellness and prevents illness.” Dulaney said as a previous employee of ICMC she chose to return because of the patient-centered care and commitment to addressing healthcare both medically and socially. “I want the citizens of Iron County to know that I’m here to listen and serve—to build long-term relationships, not just treat illness,” DuLaney said. “My goal is to support every patient in feeling heard, valued, and cared for, right here close to home.” Cindy and her family live in neighboring Madison County. She has been married to her husband for 25 years and is a proud mother to one son and soon-to-be daughter-in-law. In her free time, she enjoys gardening, canning, cooking, and spending time with family. For more information about Iron County Medical Center and its services, visit icmedcenter.org **Leave a Comment** **Related Posts** **View All Advertisers** Home Contact Us E-EditionDaily Journal OnlineDemocrat NewsFarmington PressSpecial Sections Daily Journal Online Democrat News Farmington Press Special Sections Daily Journal Online Democrat News Farmington Press Special Sections SubscribeDaily Journal OnlineDemocrat News Daily Journal Online Democrat News Daily Journal Online Democrat News ArchivesDaily Journal OnlineDemocrat NewsFarmington Press Daily Journal Online Democrat News Farmington Press Daily Journal Online Democrat News Farmington Press US Sports Entertainment Technology Politics World Business Health Crossword Puzzle Event Calendar Photo Galleries Online Poll News Story Archives"}