{"id": 1588, "name": "Winnipeg Free Press", "domain": "winnipegfreepress.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.winnipegfreepress.com/arts-and-life/life/faith/2025/06/11/more-than-55000-palestinians-have-been-killed-in-the-israel-hamas-war-gaza-health-officials-say", "title": "More Than 55000 Palestinians Have Been Killed In The Israel Hamas War Gaza Health Officials Say", "content": "**June 11, 2025** Winnipeg22° C, Sunny Full Forecast Contact UsAdvertising ContactSend a Letter to the EditorStaff biographiesSubmit a News TipSubscribe to NewslettersNotifications Contact Us Advertising Contact Send a Letter to the Editor Staff biographies Submit a News Tip Subscribe to Newsletters Notifications Contact Us Advertising Contact Send a Letter to the Editor Staff biographies Submit a News Tip Subscribe to Newsletters Notifications My AccountLog OutLog inCreate AccountGrid ViewList ViewCompact ViewText SizeTranslate My Account Log Out Log in Create Account Grid View List View Compact View Text Size Translate My Account Log Out Log in Create Account Grid View List View Compact View Text Size Translate Replica E-EditionAbout the E-EditionWinnipeg Free PressCommunity Review EastCommunity Review West About the E-Edition Winnipeg Free Press Community Review East Community Review West About the E-Edition Winnipeg Free Press Community Review East Community Review West hr Front page Arts & LifeAll Arts & LifeThe ArtsAutosBooksBook ClubCannabisCelebritiesDiversionsPuzzlesEnvironmentEventsFaithFood & DrinkHealthLife & StyleMoviesMusicScience & TechnologyTVTravel All Arts & Life The Arts Autos Books Book Club Cannabis Celebrities Diversions Puzzles Environment Events Faith Food & Drink Health Life & Style Movies Music Science & Technology TV Travel All Arts & Life The Arts Autos Books Book Club Cannabis Celebrities Diversions Puzzles Environment Events Faith Food & Drink Health Life & Style Movies Music Science & Technology TV Travel BusinessAll BusinessAgriculturePersonal FinanceManitoba’s Top Employers All Business Agriculture Personal Finance Manitoba’s Top Employers All Business Agriculture Personal Finance Manitoba’s Top Employers Canada Local OpinionAll OpinionAnalysisColumnistsEditorial CartoonEditorialsLetters to the Editor All Opinion Analysis Columnists Editorial Cartoon Editorials Letters to the Editor All Opinion Analysis Columnists Editorial Cartoon Editorials Letters to the Editor SportsAll SportsAmateurAuto RacingBlue BombersCurlingFootballGoldeyesGolfHigh SchoolHockeyHorse RacingWinnipeg JetsMooseManitoba OpenMLBNBAOlympicsSoccer All Sports Amateur Auto Racing Blue Bombers Curling Football Goldeyes Golf High School Hockey Horse Racing Winnipeg Jets Moose Manitoba Open MLB NBA Olympics Soccer All Sports Amateur Auto Racing Blue Bombers Curling Football Goldeyes Golf High School Hockey Horse Racing Winnipeg Jets Moose Manitoba Open MLB NBA Olympics Soccer World Reader Bridge WFP Events Free Press 101: How we practise journalism hr FP FeaturesAll FP FeaturesManitoba’s Top EmployersPublicationsSponsored Articles All FP Features Manitoba’s Top Employers Publications Sponsored Articles All FP Features Manitoba’s Top Employers Publications Sponsored Articles Media Kit About UsAbout UsContact UsCarrier Positions & Retailer RequestsFP Newspapers Inc.HistoryInternshipsJob OpportunitiesLocal Journalism InitiativeRetail LocationsStaff BiographiesTerms and Conditions About Us Contact Us Carrier Positions & Retailer Requests FP Newspapers Inc. History Internships Job Opportunities Local Journalism Initiative Retail Locations Staff Biographies Terms and Conditions About Us Contact Us Carrier Positions & Retailer Requests FP Newspapers Inc. History Internships Job Opportunities Local Journalism Initiative Retail Locations Staff Biographies Terms and Conditions Archives Free Press Community ReviewAll Free Press Community Review NewsEast EditionWest EditionSportsEventsContact UsE-Editions All Free Press Community Review News East Edition West Edition Sports Events Contact Us E-Editions All Free Press Community Review News East Edition West Edition Sports Events Contact Us E-Editions Classifieds Contests HomesProperty ListingsFeatured NewsRenovation and designNew homesResale homes Property Listings Featured News Renovation and design New homes Resale homes Property Listings Featured News Renovation and design New homes Resale homes Newsletters Obituaries PodcastsNiigaan and the Lone Ranger Niigaan and the Lone Ranger Niigaan and the Lone Ranger Puzzles Photos and Books Merch Become a Patron Privacy Policy Contact Us More © 2025 Winnipeg Free Press Quick LinksFree Press 101: How we practise journalismReader BridgeHomeLocalCanadaWorldClassifiedsNewslettersObituariesPhoto and Book storeArchivesContestsPublicationsSponsored ContentPrivacy PolicyEmployee Code of Conduct PolicySupplier Code of Conduct PolicyReport on Forced Labour and Child Labour in Supply ChainsWays to support usBecome a PatronPay it Forward programSubscribeSupport Faith coverageSupport Arts coverage Quick Links Free Press 101: How we practise journalism Reader Bridge Home Local Canada World Classifieds Newsletters Obituaries Photo and Book store Archives Contests Publications Sponsored Content Privacy Policy Employee Code of Conduct Policy Supplier Code of Conduct Policy Report on Forced Labour and Child Labour in Supply Chains Ways to support us Become a Patron Pay it Forward program Subscribe Support Faith coverage Support Arts coverage Quick Links Free Press 101: How we practise journalism Reader Bridge Home Local Canada World Classifieds Newsletters Obituaries Photo and Book store Archives Contests Publications Sponsored Content Privacy Policy Employee Code of Conduct Policy Supplier Code of Conduct Policy Report on Forced Labour and Child Labour in Supply Chains Ways to support us Become a Patron Pay it Forward program Subscribe Support Faith coverage Support Arts coverage Replica E-EditionAbout the E-EditionWinnipeg Free PressCommunity Review EastCommunity Review WestBusinessAll BusinessAgriculturePersonal Finance Replica E-Edition About the E-Edition Winnipeg Free Press Community Review East Community Review West Business All Business Agriculture Personal Finance Replica E-Edition About the E-Edition Winnipeg Free Press Community Review East Community Review West Business All Business Agriculture Personal Finance Arts & LifeAll Arts & LifeThe ArtsAutosBooksCannabisCelebritiesDiversionsPuzzlesEnvironmentEventsFaithFood & DrinkHealthLife & StyleMoviesMusicScience & TechnologyTVTravel Arts & Life All Arts & Life The Arts Autos Books Cannabis Celebrities Diversions Puzzles Environment Events Faith Food & Drink Health Life & Style Movies Music Science & Technology TV Travel Arts & Life All Arts & Life The Arts Autos Books Cannabis Celebrities Diversions Puzzles Environment Events Faith Food & Drink Health Life & Style Movies Music Science & Technology TV Travel SportsAll SportsAmateurAuto RacingBlue BombersCurlingFootballGoldeyesGolfHigh SchoolHockeyHorse RacingWinnipeg JetsManitoba MooseManitoba OpenMLBNBAOlympicsSoccer Sports All Sports Amateur Auto Racing Blue Bombers Curling Football Goldeyes Golf High School Hockey Horse Racing Winnipeg Jets Manitoba Moose Manitoba Open MLB NBA Olympics Soccer Sports All Sports Amateur Auto Racing Blue Bombers Curling Football Goldeyes Golf High School Hockey Horse Racing Winnipeg Jets Manitoba Moose Manitoba Open MLB NBA Olympics Soccer OpinionAll OpinionAnalysisColumnistsEditorialsEditorial CartoonLetters to the EditorSend a Letter to the EditorMediaAll MediaPhoto GalleriesVideoHomesProperty ListingsFeatured NewsRenovation and designNew homesResale homes Opinion All Opinion Analysis Columnists Editorials Editorial Cartoon Letters to the Editor Send a Letter to the Editor Media All Media Photo Galleries Video Homes Property Listings Featured News Renovation and design New homes Resale homes Opinion All Opinion Analysis Columnists Editorials Editorial Cartoon Letters to the Editor Send a Letter to the Editor Media All Media Photo Galleries Video Homes Property Listings Featured News Renovation and design New homes Resale homes Canstar Community newsAll Free Press Community Review NewsEast EditionWest EditionSportsEventsContact UsE-Editions Canstar Community news All Free Press Community Review News East Edition West Edition Sports Events Contact Us E-Editions Canstar Community news All Free Press Community Review News East Edition West Edition Sports Events Contact Us E-Editions About UsAbout UsMedia KitContact UsCarrier Positions & Retailer RequestsFP Newspapers Inc.HistoryInternshipsJob OpportunitiesPrivacy PolicyRetail LocationsStaff BiographiesTerms and Conditions About Us About Us Media Kit Contact Us Carrier Positions & Retailer Requests FP Newspapers Inc. History Internships Job Opportunities Privacy Policy Retail Locations Staff Biographies Terms and Conditions About Us About Us Media Kit Contact Us Carrier Positions & Retailer Requests FP Newspapers Inc. History Internships Job Opportunities Privacy Policy Retail Locations Staff Biographies Terms and Conditions Contact UsAdvertising ContactSend a Letter to the EditorStaff biographiesSubmit a News TipSubscribe to NewslettersNotifications Contact Us Advertising Contact Send a Letter to the Editor Staff biographies Submit a News Tip Subscribe to Newsletters Notifications Contact Us Advertising Contact Send a Letter to the Editor Staff biographies Submit a News Tip Subscribe to Newsletters Notifications My AccountLog OutLog inCreate AccountGrid ViewList ViewCompact ViewText SizeTranslate My Account Log Out Log in Create Account Grid View List View Compact View Text Size Translate My Account Log Out Log in Create Account Grid View List View Compact View Text Size Translate Sections Local Arts & LifeThe ArtsAutosBooksDiversionsEnvironmentEventsFaithFood & DrinkHealthMoviesMusicTVTravel The Arts Autos Books Diversions Environment Events Faith Food & Drink Health Movies Music TV Travel The Arts Autos Books Diversions Environment Events Faith Food & Drink Health Movies Music TV Travel BusinessAll BusinessAgriculturePersonal FinanceManitoba’s Top Employers All Business Agriculture Personal Finance Manitoba’s Top Employers All Business Agriculture Personal Finance Manitoba’s Top Employers SportsAll SportsAmateurBasketballBlue BombersCurlingFootballGoldeyesHigh SchoolHockeyJetsManitoba OpenMooseMLBOlympicsSoccer All Sports Amateur Basketball Blue Bombers Curling Football Goldeyes High School Hockey Jets Manitoba Open Moose MLB Olympics Soccer All Sports Amateur Basketball Blue Bombers Curling Football Goldeyes High School Hockey Jets Manitoba Open Moose MLB Olympics Soccer OpinionAll OpinionAnalysisColumnistsEditorialsEditorial CartoonLetters to the Editor All Opinion Analysis Columnists Editorials Editorial Cartoon Letters to the Editor All Opinion Analysis Columnists Editorials Editorial Cartoon Letters to the Editor E-Edition Homes ClassifiedsAll ClassifiedsAnnouncementsBusiness Household DirectoryCelebrationsEmploymentLegals & TendersMerchandisePersonal ServicesReal Estate Picture Listings All Classifieds Announcements Business Household Directory Celebrations Employment Legals & Tenders Merchandise Personal Services Real Estate Picture Listings All Classifieds Announcements Business Household Directory Celebrations Employment Legals & Tenders Merchandise Personal Services Real Estate Picture Listings FP FeaturesManitoba’s Top EmployersPublicationsSponsored Content Manitoba’s Top Employers Publications Sponsored Content Manitoba’s Top Employers Publications Sponsored Content Obituaries Media Kit Subscribeand getmerch **Notification Settings** This browser doesn't support push notifications at the moment. Check browsers features, update your browser or try to use one from the list of recommended to manage your notifications settings: Firefox (27+) Google Chrome (30+) Safari ( MacOS 13+ with browser 16.1+ and iOS 16.4+ ) /Notemake sure Push API support enabled under Settings > Safari > Advanced > Experimental Features Microsoft Edge If you wish to manage your notification settings from this browser you will need to update your browser's settings for this site. Just click button below and allow notifications for this site NoteSafari 16.4+ working on iOS devices also need this site app to be installed at device's Home Screen for Push Notifications to work Notifications are blocked for this site. If you wish to manage your notification settings from this browser you will need to update your browser's settings. Usually you'd need to click on site options icon to the left of address bar and change notifications preferences/permissions from there Urgent and important stories Noteworthy news and features Advertisement Learn more about Free Press Advertising solutions **More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say** **** Advertisement Advertise with us Tweet Share Print Email Read Later DEIR AL-BALAH, Gaza Strip (AP) — The Palestinian death toll from the 20-month Israel-Hamas war climbed past 55,000, the Gaza Health Ministry said Wednesday, and local hospitals said at least 21 people were killed while on their way to aid distribution sites. Read this article for free: Already have an account?Log in here » To continue reading, please subscribe: $19 + tax for 4 weeksand receive a Canada Proud Manitoba Strong mug and sticker FREE! Enjoy unlimited reading on winnipegfreepress.com Read the E-Edition, our digital replica newspaper Access News Break, our award-winning app Play interactive puzzles *Special offer only available to new subscribers or returning subscribers without a subscription for more than eight weeks. New subscription must remain active for at least 12 weeks. If cancelled prior to 12 weeks, you will be charged regular price for the merchandise. Merchandise is provided “as is” and cannot be exchanged. Expect merchandise delivery within two weeks for addresses within Manitoba and up to four weeks if outside of Manitoba. To continue reading, please subscribe: $1 for the first 4 weeks* Enjoy unlimited reading on winnipegfreepress.com Read the E-Edition, our digital replica newspaper Access News Break, our award-winning app Play interactive puzzles No thanks *$1 will be added to your next bill. After your 4 weeks access is complete your rate will increase by $0.00 a X percent off the regular rate. DEIR AL-BALAH, Gaza Strip (AP) — The Palestinian death toll from the 20-month Israel-Hamas war climbed past 55,000, the Gaza Health Ministry said Wednesday, and local hospitals said at least 21 people were killed while on their way to aid distribution sites. Read unlimited articles for free today: Already have an account?Log in here » DEIR AL-BALAH, Gaza Strip (AP) — The Palestinian death toll from the 20-month Israel-Hamas war climbed past 55,000, the Gaza Health Ministry said Wednesday, and local hospitals said at least 21 people were killed while on their way to aid distribution sites. The circumstances of the deaths reported near the sites were not immediately clear. The Israeli army said Wednesday it fired warning shots in central Gaza toward “suspects” that posed a threat to troops. The Gaza Health Ministry doesn’t distinguish between civilians and combatants, but has said that women and children make up more than half the 55,000 dead. Israel says it only targets militants and blames civilian deaths on Hamas, accusing the militants of hiding among civilians, because they operate in populated areas. The ministry says 55,104 people have been killed since the start of the war and 127,394 wounded. Many more are believed to be buried under the rubble or in areas that are inaccessible to local medics. The figure did not include Wednesday’s deaths. The Health Ministry is part of Gaza’s Hamas-run government, but staffed by medical professionals who maintain and publish detailed records. Its tolls from previous conflicts have largely aligned with those of independent experts, though Israel has questioned the ministry’s figures. Also Wednesday, Israel said forces recovered the remains of two additional hostages held in Gaza. Militants still hold 53 captives, less than half of them believed to be alive. Casualties at separate aid hubs, health officials say Health officials in Gaza said 14 people were killed while on their way to collect aid near the southern city of Rafah. Their bodies were taken to Nasser Hospital in Khan Younis. In central Gaza, Al-Awda Hospital said that seven additional people were killed while on their way to an aid distribution site. The Israeli military said troops fired warning shots before daylight toward people it identified as suspects “who were advancing while posing a threat” in central Gaza. The military had no immediate comment on the reports of casualties in southern Gaza. Safaa Farmawi said her daughter, Ghazal Eyad, 16, was killed while on her way to collect food in Rafah. “My daughter and I went to get aid, she came before me, I looked for my daughter but couldn’t find her. People told me your daughter was martyred,” Farmawi told the AP. Near-daily shootings have erupted as crowds make their way to aid sites run by a newly created aid group rejected by the United Nations. Palestinian witnesses to previous shootings have said Israeli forces fired toward the crowds. The military has acknowledged firing warning shots toward people it says approached its forces in a suspicious manner. The Gaza Humanitarian Foundation, which operates the aid distribution sites, says there has been no violence in or around the distribution points. It has warned people to stay on the designated routes and recently paused delivery to discuss safety measures with the military. New aid system marred by chaos The aid system rolled out last month has been marred by chaos and violence, while a longstanding U.N.-run system has struggled to deliver food because of Israeli restrictions and a breakdown of law and order, despite Israel loosening a total blockade it imposed from early March to mid-May. Experts and human rights workers say hunger is widespread and that the territory of some 2 million Palestinians is at risk of famine if Israel does not fully lift its blockade and halt its military campaign, which it renewed in March after ending a ceasefire with Hamas. Israel says the new aid distribution system is designed to prevent Hamas from siphoning off aid, but U.N. agencies and major aid groups say there is no evidence of systematic diversion. They say the new system violates humanitarian principles by allowing Israel to control who receives aid and by encouraging more mass displacement as Palestinians seek access to just three operational sites, two of them in the territory’s southernmost city of Rafah, now a mostly uninhabited military zone. Israel recovers remains of 2 more hostages Israeli authorities identified one of the hostages recovered as Yair Yaakov who was killed during the Oct. 7, 2023, attack and whose body was taken into Gaza. His partner and two children were also taken captive and released in a ceasefire deal early in the war. The second hostage’s identity was not disclosed. Israeli Defense Minister Israel Katz said the bodies were retrieved in a “complex” operation without disclosing details. The Israeli military said they were recovered from Khan Younis. The war began when Hamas-led militants killed around 1,200 people, mostly civilians, in the Oct. 7 attack and abducted 251 hostages. More than half the captives have been released in ceasefires or other deals. Israeli forces have rescued eight and recovered the remains of dozens more. Hamas has said it will only release the remaining hostages in return for more Palestinian prisoners, a lasting ceasefire and a complete Israeli withdrawal. It has offered to hand over power to a politically independent Palestinian committee. but has not agreed to disarm. Israeli Prime Minister Benjamin Netanyahu has rejected those terms, saying that Israel will only agree to temporary ceasefires to facilitate the return of hostages. He has vowed to continue the war until all the hostages are returned and Hamas is defeated or disarmed and sent into exile. Winnipeg Jets Game Days On Winnipeg Jets game days, hockey writers Mike McIntyre and Ken Wiebe send news, notes and quotes from the morning skate, as well as injury updates and lineup decisions. Arrives a few hours prior to puck drop. Netanyahu says Israel will control Gaza indefinitely and facilitate what he refers to as the voluntary emigration of much of its population to other countries. The Palestinians and most of the international community reject such plans, viewing them as forcible expulsion that could violate international law. ___ Khaled reported from Cairo. ___ Follow AP’s war coverage at https://apnews.com/hub/israel-hamas-war AdvertisementAdvertise With Us AdvertisementAdvertise With Us Tweet Share Print Email Read Later The Free Press acknowledges the financial support it receives frommembers of the city’s faith community, which makes our coverage of religion possible. Advertisement Learn more about Free Press Advertising solutions **Featured Local Savings** Contact UsAdvertising ContactSend a Letter to the EditorStaff biographiesSubmit a News TipSubscribe to NewslettersNotifications Contact Us Advertising Contact Send a Letter to the Editor Staff biographies Submit a News Tip Subscribe to Newsletters Notifications Contact Us Advertising Contact Send a Letter to the Editor Staff biographies Submit a News Tip Subscribe to Newsletters Notifications My AccountLog OutLog inCreate AccountGrid ViewList ViewCompact ViewText SizeTranslate My Account Log Out Log in Create Account Grid View List View Compact View Text Size Translate My Account Log Out Log in Create Account Grid View List View Compact View Text Size Translate"}