{"id": 1870, "name": "American Action Network", "domain": "americanactionnetwork.org", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.americanactionnetwork.org/press/american-action-network-launches-4-2-million-affordability-focused-advocacy-campaign/", "title": "American Action Network Launches 4 2 Million Affordability Focused Advocacy Campaign", "content": "**American Action Network launches $4.2 million affordability-focused advocacy campaign** American Action Network today launched a $4.2 million issue advocacy campaign highlighting the policies in House Republicans’ budget that will make America affordable again. The budget cements the largest tax cut in American history, cuts taxes for social security recipients and eliminates taxes on tips and overtime. Washington liberals voted against House Republicans’ budget. The campaign includes broadcast, cable and digital advertising across 28 congressional districts. The campaign will run through the first week of July. “Americans work hard to make a good living for their families,”said American Action Network President Chris Winkelman.“Washington liberals just voted against the largest tax cut in American history for working families. The American Action Network will continue to advocate for good policy that puts more money into the pockets of hardworking Americans.” Districts included in AAN’s new issue advocacy campaign: AZ-06: Juan CiscomaniCA-09: Josh HarderCA-13: Adam GrayCA-45: Derek TranCO-08: Gabe EvansIA-01: Mariannette Miller-MeeksME-02: Jared GoldenMI-07: Tom BarrettMI-08: Kristen McDonald-RivetNC-01: Don DavisNE-02: Don BaconNJ-07: Tom Kean, Jr.NJ-09: Nellie PouNM-02: Gabe VasquezNV-03: Susie LeeNY-03: Tom SuozziNY-17: Mike LawlerOH-09: Marcy KapturOH-13: Emilia SykesPA-01: Brian FitzpatrickPA-07: Ryan MackenziePA-08: Rob BresnahanPA-10: Scott PerryTX-28: Henry CuellarTX-34: Vicente GonzalezVA-02: Jen KiggansWA-03: Marie Gluesenkamp-PerezWI-03: Derrick Van Orden **Latest** Issues About Press Blog Contact Donate Email*"}