{"id": 1881, "name": "Angry White Men", "domain": "angrywhitemen.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://angrywhitemen.org/2025/06/04/blaze-media-digital-strategist-logan-hall-i-think-mass-immigration-is-a-hate-crime-against-america/#more-65580", "title": "Blaze Media Digital Strategist Logan Hall I Think Mass Immigration Is A Hate Crime Against America", "content": "**Angry White Men** Tracking White Supremacy About Cucktionary Recommended Reading **Blaze Media Digital Strategist Logan Hall: ‘I Think Mass Immigration Is A Hate Crime Against America’** On Monday, BlazeTV host Sara Gonzales and her panelists reacted to anantisemitic attackin Boulder, CO by an Egyptian-born man against a Jewish group. One panelist, Logan Hall, denounced “mass immigration” as a “hate crime,” and claimed that “some people just are not compatible with our civilization.” On X, Hall, who is employed as a Digital Strategist for Blaze Media, has a history of criticizing multiculturalism, making disparaging remarks about immigrants, and interacting with overt white supremacists: In a Dec. 23, 2024 post, Hallwrotethat his “local mall” was “completely overrun with illiterate foreigners and their families.” In another from the same day, hecomplainedabout “hearing five different foreign languages and seeing people from all over the world wearing their weird ethnic garb.” Hall hascomparedimmigrants to Orcs, a mythical race of monsters from J.R.R. Tolkien’sLord of the Ringstrilogy. Of Rep. Shri Thanedar, an Indian-American Congressman, Hallwrote, “something tells me this guy’s ancestors didn’t come over on the mayflower [sic].” He also accused Thanedar of “parasite behavior.” Hall: “i can trace my lineage here back before the revolution. some third world foreigner who just happens to sneak over the border and give birth does not make that child an american [sic] like me and it’s insane to pretend otherwise.” Hallwrote“i would gladly pay $100 for eggs if it means i never have to see another third world immigrant in my country ever again.” Hallposted an imageadvocating “remigration,” awhite supremacisttermwhichrefers tothe mass expulsion of non-white people from majority-white countries. Hereferred tobirthright citizenship, which is guaranteed by the 14th Amendment, as “national suicide” and a “war on americans [sic] whose ancestors built this country and the future they sacrificed for.” In response to the Trump administration freezing foreign aid, Hallwrote, “i don’t care about fighting AIDS in sudan [sic].” On multiple occasions Hall has interacted with known white supremacists on X, includingPatrick Casey(former head ofIdentity Evropa),Kevin DeAnna(whoblogs under the pen name “James Kirkpatrick”),Geoffrey Martin(a Neo-Nazibetter known by the pseudonym “Captive Dreamer”), andMichael Gramer(whooperates under the pseudonym “9mm_SMG”). On the June 2, 2025 episode ofSara Gonzales Unfiltered, Hall echoed many of these same sentiments. Responding to news that the Boulder attacker, who was armed with incendiary devices and wanted to target “Zionists,” had beencharged with a federal hate crime, Gonzales called the concept of hate crimes “ridiculous.” But, she added that “if we’re gonna apply that standard, we should apply it equally.” “However, if we’re gonna apply that standard, we should apply it equally,” Gonzales said. “Right? And so often, they are so willing to say, oh, if a white male commits a crime, let’s try to find the hate crime there. So it’s, like, alright. If we’ve got hate crimes, then we need to apply that standard equally.” Likewise, Logan Hall stated that he is “not a big fan” of “designating things as hate crimes either,” but that “if we’re gonna be classifying them in that way, I think mass immigration is a hate crime against America.” And he claimed that “illegals” were brought into the country by the Biden administration to “wreak havoc” on it. He also asserted that “the Left” hates Jews because they “see Jews as white,” and that the conflict between Israelis and Palestinians “should not really concern us.” Hall added that he doesn’t “know why we’re importing all these people with ethnic blood feuds halfway across the world,” and called for mass deportations. “At a certain point, we’re gonna have to say some people just are not compatible with our civilization, okay?” Hall said. “And this is why mass deportations are so necessary. It’s the most important thing in my opinion. All these people have to go back. Alright?” Sara Gonzales:I also would say, for the record, I think the fact that we have to categorize hate crimes is ridiculous. However, if we’re gonna apply that standard, we should apply it equally. Jaco Booyens:Yeah. Sara Gonzales:Right? And so often, they are so willing to say, oh, if a white male commits a crime, let’s try to find the hate crime there. So it’s, like, alright. If we’ve got hate crimes, then we need to apply that standard equally. Jaco Booyens:Correct. Sara Gonzales:Certainly, this guy admitting to investigators that he wanted to rid the world of Zionists, like, he’s tellin’ on himself there — Jaco Booyens:[There’s another] short guy with a little mustache that said similar things about the same people. Sara Gonzales:Right. Right. Right. Exactly. Logan Hall:If we’re gonna — I’m not a big fan of, like, designating things as hate crimes either, but if we’re gonna be classifying them in that way, I think mass immigration is a hate crime against America. Sara Gonzales:Mhmm. Logan Hall:I mean, what? Honestly. Sara Gonzales:Can you think of — I mean, there are few things more treasonous. Logan Hall:Yeah, after a certain point, when you see how many of these illegals have committed crimes against our people, our civilization, you have to say that — you’re left with no other conclusion that — other than the Biden administration and the Democrats brought them in here for this explicit purpose — Sara Gonzales:Mhmm. Jaco Booyens:Exactly. Logan Hall:— to wreak havoc on our country, to hurt our people, to damage innocent people, to damage the rule of law, to damage the safety of our country and our communities. There’s just no other explanation other than that. And, you know, obviously, this kind of just seems pretty self-evident because if you’re going to import a bunch of people who hate you and hate your civilization, millions of them, and then give them free money and also tell them that our country is evil and we’re a terrible people, then what — like, what could go wrong? I mean, it seems self-evident that they would just do this. Okay? And I think your point was important that they hate us and they hate the Jews. When leftists look at Israel, they don’t really see them as Jewish. They see them as white, which is what — Jaco Booyens:Correct. Logan Hall:— which is what — Jaco Booyens:Correct. Logan Hall:— all of the Left — which is what the Left is determined to destroy the most. They really, really hate Western civilization. They say it. It’s their basic stated goal. I think this should not really concern us. I don’t know why we’re importing all these people with ethnic blood feuds halfway across the world. Doesn’t make sense. My sole concern — and you say, like, oh, well, they brought them in here unvetted. Well even our vetting processes — Sara Gonzales:You’re — no, you’re right. Logan Hall:— are terrible. Sara Gonzales:No you’re right. You’re right. Yes. Logan Hall:Like, so, why even bring them here in the first place? Sara Gonzales:Yeah. Logan Hall:It doesn’t make sense. It doesn’t seem like a — Sara Gonzales:Well, so Trump’s Muslim ban I supported the entire time. Logan Hall:Oh yeah. Sara Gonzales:I mean, you’ve got these people from these countries that overwhelmingly hate Western civilization. Logan Hall:Yeah. Sara Gonzales:We don’t need to be bringing them here at all. Logan Hall:Yes, and you have to — at a certain point, you know, our modern ideology, which is like, oh, America is just an idea, and we bring these people and hand them pieces of paper, and they can magically be as American as you or me whose ancestors have been here for 300 years. No. At a certain point, we’re gonna have to say some people just are not compatible with our civilization, okay? And this is why mass deportations are so necessary. It’s the most important thing in my opinion. All these people have to go back. Alright? You’re not gonna have people firebombing — and, you know, I’m not — I don’t think any — I don’t think really any of the foreign — you know, I think it was a terrible thing, those people were peaceful, but none of this really concerns us at the end of the day. They’re not out there rallying for America or whatever. Like, this should not be our problem, alright? Sara Gonzales:Yeah. I mean, it is — at the end of the day, like, you can say — and I’ve said this, and I would love to know, Jaco, from your opinion, ’cause you’re a little bit closer to what’s happening in Israel. At the end of the day, I can say I obviously support their right to exist. Jaco Booyens:Yeah. Of course. Sara Gonzales:I think that what is happening to them is terrible, but America has enough problems right now that I don’t necessarily think that that needs to be a priority for this country. However, people can gather and demonstrate for whatever the hell they want to, and they shouldn’t be — have to do that and be threatened with death because some freaking terrorist came into this country under the Biden regime. **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Click to share on Tumblr (Opens in new window)Tumblr Click to share on Reddit (Opens in new window)Reddit **Related** **Post navigation** **Top Posts & Pages** Mark Fitzpatrick Promotes Anti-LGBTQ Event On White Supremacist Podcast Joel Webbon: 'The Average Gay Man Has 500 Plus Partners' Traditionalist Catholic Priest Calls The Holocaust 'The Biggest Lie In History' Recommended Reading Cucktionary Wesley Todd: In A 'Christian Nation' There Will Be 'No More Mosques, No More Synagogues' About New York Young Republican Leader Has Ties To Far-Right Extremists Jake Shields: Adolf Hitler 'Wasn't Pushing Hatred Towards Other Races' Longtime White Nationalist Podcaster 'Borzoi Boskovic' Unmasked **Categories** **Blogroll** Africa is a Country Anonymous Comrades Collective Gizmodo Hatewatch | Southern Poverty Law Center HuffPost Politics Jezebel Media Matters ProPublica Rewire.News Right Wing Watch Salon Talking Points Memo The Baffler The Barbed Wire The Handbasket The Nation The New Republic The Present Age The Turtle Diaries them. Unicorn Riot We Hunted the Mammoth Wired Wonkette **Archives** Reblog SubscribeSubscribedAngry White MenJoin 622 other subscribersSign me upAlready have a WordPress.com account?Log in now. Angry White Men Already have a WordPress.com account?Log in now. Angry White Men Already have a WordPress.com account?Log in now. Angry White MenSubscribeSubscribedSign upLog inCopy shortlinkReport this contentView post in ReaderManage subscriptionsCollapse this bar Angry White Men SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Angry White Men SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar"}