{"id": 1914, "name": "Christian News Alerts", "domain": "christiannewsalerts.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://christiannewsalerts.com/christian-influencers-spark-debate-over-modesty-in-faith-based-fashion-campaign/", "title": "Christian Influencers Spark Debate Over Modesty In Faith Based Fashion Campaign", "content": "Home About Us Contact Us Unsubscribe **Christian influencers spark debate over modesty in faith-based fashion campaign.** Two popular Christian podcasters are facing fierce division among their evangelical audience after promoting a faith-branded athleisure collection that some followers claim conflicts with biblical values of modesty. Angela Halili, 29, and Arielle Reitsma, 35—hosts of the rising Christian podcast Girl Gone Bible—are under criticism for appearing in a commercial for the activewear brand Three Nails, with critics calling the clothing too revealing while supporters defend their message and intent, theDaily Mailreported. Halili and Reitsma launched their podcast in 2023 after both left previous careers in Hollywood modeling and acting. Since then, Girl Gone Bible has become one of the world’s most-streamed Christian programs, garnering millions of downloads and views through captivating content on spirituality and lifestyle topics. **Outcry Follows Promotion of Christian Apparel Brand** The controversy erupted when the pair shared a new promotional video for Three Nails, a Christian athleisure brand. Many commenters on social media expressed concern over the form-fitting designs, particularly leggings, stating such outfits could be distracting or immodest from a conservative Christian standpoint. “There’s nothing modest about this clothing,” one commenter wrote. “They’re very tight and reveal the curvature of the human body.” Another user warned, “These men don’t need to see every crack and crevice.” Other followers echoed similar sentiments, questioning the compatibility of tight activewear with biblical modesty. Critics cited that even if labeled Christian, clothing should not automatically be considered spiritually appropriate. **Supporters Praise Messaging and Personal Growth** Despite the backlash, Halili and Reitsma received a wave of encouragement from other fans. Supporters called the clothing “respectful” and “cute,” emphasizing its practicality for gym use and personal journeys toward modesty. “LOVE, so cute,” one fan commented, applauding the absence of low-cut designs. Another wrote, “I’ve struggled with modesty, and this is very tasteful.” Listeners also shared how the podcast had inspired spiritual growth, even among non-Christians. One social media user explained, “I’m not a Christian, but I like hearing your stories and reading scripture, which is weird because I’m far from God.” **Influencers Respond to Comments and Controversy** Halili and Reitsma did not ignore the backlash. Instead, they offered candid reflections on the complexities of modesty in modern Christian life and how physical appearance can distort perception. “I can wear the same outfit as a girl who’s extremely thin with no curves, and just because of my body type, I’ll look promiscuous in it and she won’t,” Halili said, addressing the role of body image in modesty judgment. Reitsma added, “I know some girls who take photos in their crop tops and their bikinis, but they have more compassion in their hearts... they would never write the things that some of these Christians are writing.” **Past Careers Add to Online Scrutiny** The pair’s previous work in entertainment continues to spark debate. Halili once played a provocatively dressed nun in a Marilyn Manson music video, while Reitsma had modeled for men’s magazines like Maxim and appeared in films such as Rock of Ages. In 2023, Halili stated that she was actively reshaping her online content to reflect a more conservative image. Meanwhile, Reitsma has spoken about her evolving perspective on attire, saying, “As I became more of a woman, I felt more beautiful being more covered up.” Still, some online critics claim their past and current social media presence undermines their Christian witness. Comments include calls to remove certain posts and label them as not honoring God. **Differing Views on Modesty Divide Christian Audience** The debate illustrates a broader divergence within the Christian community over what constitutes modesty. Some argue that faith must align with cultural expectations of conservative dress, while others believe discipleship transcends appearance. “Christianity doesn’t have a ‘look,’” one fan posted in support. Another wrote, “Thank you for using your platform for good and pushing through the tough comments.” Despite the criticism, Halili and Reitsma continue to engage with their audience online, appearing determined to blend spiritual outreach with real-world topics like clothing, fitness, and faith. **NATIONAL NEWS** **SEE ALL** **SEE ALL** **Johnson warns of Democrat-led impeachment push if House flips in 2026** **Johnson warns of Democrat-led impeachment push if House flips in 2026** **Trump’s DOT chief clears Biden’s grant backlog, cuts DEI** **Trump’s DOT chief clears Biden’s grant backlog, cuts DEI** **Jack Ciattarelli secures GOP nod for New Jersey governor race** **Jack Ciattarelli secures GOP nod for New Jersey governor race** **California seeks urgent halt to military in immigration raids** **California seeks urgent halt to military in immigration raids** **Justice Department removes attorney over deportation mishap** **Justice Department removes attorney over deportation mishap** **DON'T WAIT.** **LATEST NEWS** **Don Lemon, Kathy Griffin question 2024 election integrity, hint at tampering** **Don Lemon, Kathy Griffin question 2024 election integrity, hint at tampering** **Prosecutors slam Kohberger's trial delay tactics in Idaho murders case** **Prosecutors slam Kohberger's trial delay tactics in Idaho murders case** **Minnesota lawmaker admits to illegal U.S. entry** **Minnesota lawmaker admits to illegal U.S. entry** **Trump warns Musk of consequences for Democratic support** **Trump warns Musk of consequences for Democratic support** **Johnson warns of Democrat-led impeachment push if House flips in 2026** **Johnson warns of Democrat-led impeachment push if House flips in 2026** **Newsletter** **NEWS** **WEBSITE** Home About Us Contact Us Unsubscribe"}