{"id": 1217, "name": "Save Jersey", "domain": "savejersey.com", "bias": "right", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://savejersey.com/2024/10/congressman-upbraids-dod-boem-for-ignoring-national-security-threats-posed-by-offshore-wind/#mh-comments", "title": "Congressman Upbraids Dod Boem For Ignoring National Security Threats Posed By Offshore Wind", "content": "**New Jersey's #1 Source of Conservative News, Commentary, Humor & Analysis** **New Jersey's #1 Source of Conservative News, Commentary, Humor & Analysis** Latest Stories About Meet Matt Rooney Election 2024 Election 2025 The Matt Rooney Show Podcast Phil Murphy Archives Chris Christie Archives Debates Advertising Contact Terms of Use **Congressman upbraids DOD, BOEM for ignoring national security threats posed by offshore wind** October 30, 2024Matt RooneyEnvironmentalism,National Security0 Offshore wind isn’t just an expensive, whale-killing eyesore. It’d also potentially a serious threat to the security of America’s homeland. On Wednesday, Chris Smith (R, NJ-04) criticized the Bureau of Ocean Energy Management (BOEM) and the U.S. Department of Defense (DOD) for forging ahead with an offshore wind development collaboration notwithstanding the acknowledged risks to national security. “It is extremely disconcerting that BOEM is only now deciding to define roles and duties with the Defense Department for offshore wind leasing and project review after 10 projects have already been fully approved by the Biden-Harris Administration with more lined up,” said Smith whose district includes portions of Monmouth and Ocean counties. “BOEM’s ownanalysisfor the Atlantic Shores South project acknowledges that the offshore wind turbines would specifically interfere with federal and military radar systems, even mentioning Joint Base McGuire-Dix-Lakehurst by name,” Smith continued. “And yet shockingly, BOEM has already issued full federal approval for construction to move forward—even before reaching this new agreement to work with the Defense Department.” Smith is the sponsor oflegislationwhich would effectively bar any offshore wind development projects that would “weaken, degrade, interfere with, or nullify the capability of radar relied upon by the Federal Aviation Administration or the Armed Forces.” “Anyone who has been paying close attention to the shoddy and reckless approval process for these offshore wind projects will not be fooled by this after-the-fact proposal—which is far too little and far too late. For years, we have been pointing out the lack of serious scrutiny and proper vetting for these projects—especially and including the likely dire impacts on national security and military readiness—but the Biden-Harris Administration has ignored our concerns,” Smith added. “In fact, the implementation of this agreement so late in the process begs the question of what national security threats have been downplayed or neglected by BOEM over the past few years during its reckless, fast-track approval process.” In addition to BOEM acknowledging the threat, it’s been long acceptedthat turbines have the potential to impact radar for military, commercial, and personal pleasure craft. “Although the base of the tower is stationary, the nominal area of the turbine to the radar is dynamic since the machine is constantly tracking the wind,”explainedWind Systems Magazineall the way back in 2010. “Wind turbines are made of highly reflective materials—steel, fiberglass, and carbon fiber composite—and can scatter and return a significant amount of the energy. The turbine tower is the most reflective component, but since it is constantly stationary the rotor is the largest problem to the radar. In most cases the signature can be quite large and can affect the radars/operator’s ability to differentiate the wind farm from flying aircraft and weather storms. The Doppler effect is due to the moving rotor and can affect the moving target indicator of a radar.” VIDEO: Rep. Sherrill defends Biden’s “garbage” slander of Trump supporters on CNN VIDEO: Rep. Sherrill defends Biden’s “garbage” slander of Trump supporters on CNN REPORT: Tom Moran, Paul Mulshine likely out at The Star-Ledger REPORT: Tom Moran, Paul Mulshine likely out at The Star-Ledger **Matt Rooney** Follow @SaveJerseyFollow @MattRooneyNJ Follow @SaveJerseyFollow @MattRooneyNJ Follow @MattRooneyNJ Follow @SaveJerseyFollow @MattRooneyNJ Follow @MattRooneyNJ Follow @MattRooneyNJ Affordable Energy for New Jersey GunForHire.com Job Creators Network Jersey 1st Monmouth GOP Copyright © 2025 | WordPress Theme byMH Themes"}