{"id": 2023, "name": "Knock-LA", "domain": "knock-la.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://knock-la.com/california-lifers-are-kept-behind-bars-despite-being-found-suitable-for-parole/", "title": "California Lifers Are Kept Behind Bars Despite Being Found Suitable For Parole", "content": "News Analysis Opinion Culture Incarceration Reporting Photo Essays Support Search Button instagram_logo youtube-icon twitch-icon twitter_logo facebook_logo **Knock LAKNOCKLA** News Analysis Opinion Culture Incarceration Reporting Photo Essays Trending Incarceration Reporting Initiative Santa Ana Culture instagram_logo youtube-icon twitch-icon twitter_logo facebook_logo **California ‘Lifers’ Are Kept Behind Bars Despite Being Found Suitable For Parole** [Editor’s Note: Amidst the recent wildfires, coverage of the miniscule wages paid to incarcerated firefighters (who receive less than 10 dollars a day for backbreaking, lifesaving work) underscores the injustices that pervade the financial aspects of California’s prison system. Some prisoners receive as little aseight cents an hourfor working in the prisons, then faceinflated prices at the prison canteenfor the bare necessities of personal hygiene and nutrition. If the prisoners owe restitution, the state seizes at least half of anything they make or are sent by family, making arrangements like the ones described in this article necessary for survival.While the state characterizes this policy as “circumventing restitution,” it is clear that the goal of this system is not restitution for the victims of crime but rather the extraction of cheap prison labor from a population stripped of its rights.] In theory, parole suitability hearings for California prison inmates are supposed to determine whether or not a person is safe to rejoin society. But recently, the Board of Prison Hearings has cracked down on otherwise parole-ready individuals and cost them years of freedom for engaging in a commonplace workaround to purchase everyday items such as shampoo or ramen from the commissary. Recently, a wave of California prison inmates serving life sentences, with no disciplinary infractions on their records, have been denied parole by the Board of Prison Hearings (BPH). The reason given is that they have been found to be “circumventing restitution.” Restitution is the money paid by incarcerated individuals to victims of the crimes of which they’ve been convicted. When an inmate owes restitution, 50% (plus fees) can be taken out of wages they earn working on the inside, or out of any money sent to them by people on the outside. To avoid having this percentage taken out, some arrange to receive money indirectly by having it placed on the books of other inmates. The legislative intent of Penal Code Sections 1202.4, 12022.45, 2085.5, and 2021 Ch. 257 & 37 (AB 177) does not give Governor Gavin Newsom or California Department of Corrections and Rehabilitation (CDCR) Secretary Jeff Macomber jurisdiction to enforce what is considered a civil judgment with aggravated sentencing punishment in order to extend imprisonment. For those affected by this recent trend, there was no court order upon their sentencing stating in order to be released from a life sentence they must not circumvent restitution. The public as well as the incarcerated must be placed on notice that they are violating the law. Our governmental authorities are simply choosing to ignore the law. For those serving a determinate sentence (a fixed number of years rather than life), extended incarceration isnothanded out by the governor and his administrators. Only those serving an indeterminate sentence have received this treatment. Residents’ practice of putting funds on others’ accounts so their family can aid in purchasing the bare necessities is nothing new. It has been done for decades without reprimand from CDCR officials. Governor Newsom refuses to answer this resident’s question as to how it is reasonable to cost Californians over$132,000per additional year to house a felon by extending sentences over something that doesn’t even qualify as a misdemeanor offense. Randy Fleming, age 58, had his parole suitability date rescinded after serving 12 years. Bennie Gibbs, age 51, was denied suitability of parole for 5 years after serving 33. And Carl Burnside, age 54, had his parole suitability rescinded for 3 years after serving over 34. [See their statements below.] The residents have spent yearsdeveloping the skillsto overcome the forms of mental illness that affect every incarcerated person at some point. They have hopes of reuniting with their families. The governor and his administrators are condemning residents to suffer a mental roller coaster ride and appear to have no clue as to how this type of injustice affects the incarcerated and their families. [The following interviews have been edited for clarity and length.] **Bennie Gibbs** My name is Bennie Gibbs. I’m from Long Beach, CA. I was sent to jail in 1991 and have been in prison since 1992. I was a youth offender — I came in at 18 years old. I’m 52 now. I went to the board in February of 2023. I was denied parole suitability due to me having sent money to someone else’s books. I had been clean, no disciplinary infractions, for over ten years. I was going to the parole board to possibly receive a parole date. But 45 days before my parole hearing, on February 10, I was notified that I may have been involved in circumventing restitution. So I went in and the commissioner talked about that for almost two hours — about me sending money to someone else’s books. They said that was the reason: circumventing restitution. I’d had my wife send money to another inmate’s books. It was a large amount of money over a couple of years. Every month I sent an inmate money to go to the canteen for me. It’s a regular thing that’s been going on forever. I was just trying to survive. I let them know that I’d been sending money to other people’s books since 1992. They said they were notified because of theEDD fraud. But my situation has nothing to do with EDD fraud. I was upfront. I was honest — I let them know, “yeah I directed my wife to send money to another guy’s books to go to the store for me.” At the same time I had jobs and they were taking money out of my paycheck. I was a kitchen worker. I was getting paid and they were taking money out of my checks. But they got mad at me for sending money to other people’s books. I thought they were just supposed to get it from my pay numbers, but they wanted it from every angle. Now my restitution is fulfilled. I just fulfilled it within the last month or two. I had $10,000 restitution and it’s finally paid off now. At the time I went to the board, I was down to $4,500. This was last year, in February 2023. Since then, I’ve fulfilled the restitution. It’s done now, but I’ve still got a five-year denial from the board. I got four months added to my sentence for circumventing. The district attorney picked it up as a court case. So I had to go to court for this also. They gave me 32 months. They said it’s a felony once it is over a certain amount of money. It added up to like $3,000. I sent this guy like $100–$150 every month for like three years. I think they said anything over $400 can be a felony. They called it “hiding assets.” I said “I’ve never had any assets — I’ve been in prison since I was 18 years old. I’ve never owned anything.” Anything I have came from my family members sending money to my books. They gave me 32 months, added to my time. But they said that since I was a youth offender, once I’m found suitable I can still go home. My family had been anticipating me getting out, and this popped up at the last minute — 45 days before my board hearing. They traumatized me. I’m still not over it. I hate the board system, to be honest. I don’t want to ever go back to the board, but I know I have to. I was going in there, I was prepared, I had an attorney. I was going in there and trying to get a date. I had been sending books to people since 1992. Why now? Why did they wait all this time? Thirty years later, now it’s a big issue. My lawyer, Joseph Magazenni, couldn’t believe it. He said “I can’t believe the DA picked this up.” He didn’t think that was gonna go anywhere. It was the DA in San Luis Obispo. At California Men’s Colony, there were about seven people before me who got brought up on this stuff too. I was part of that, and then it just continued after that with more people. They were gettin’ everybody for this stuff. Some was EDD fraud, but a lot wasn’t. Mine was not. I’d been to the board two times before and they had never said anything about me sending money to anyone’s books. They’ve been taking people down with this crap. It seems like they’re just getting lifers. It’s all about lifers. People who have life sentences. Anything they can find to keep a lifer in, that’s what they’ve been using. I don’t understand it. **Randy Fleming** My name is Randy Fleming. I was just denied parole. I went back in front of the parole board recently and they gave me a three-year denial. I had been found suitable last year, on the 26th of September. And in December I received notice that there was an investigation. So I went to the room and I talked to a dude named Darcy. He introduced himself, he was investigating for the board. It turned out he was a parole agent, a parole officer. So, I was found suitable, they did some investigation, and two months later they said I was circumventing restitution. I didn’t owe restitution. My restitution was paid up. So individuals were sending me money to go to canteen for them. I went to canteen and got the items that they wanted. Once I got the report, they called it “business dealings” and they considered it to be “criminal thinking.” The person sending me money still owed restitution. And by putting the money on my books, it was me assisting them to avoid paying restitution to the victim. They only were taking action against people who had gone before the board and been found suitable. They’re not doing it to people with regular dates or whatever. They’re picking and choosing who they want to do it to. They gave me a three-year denial and told me to come back in 18 months. My family had been anticipating me getting out. It was disappointing for them. I know I worked hard to do what I’ve got to do. What I was doing — morally it was wrong. But it was something being carried out throughout the CDC institutions and nobody was getting punished for it. So for them to come out and start doing this to people who were being found suitable… My people, they were disappointed. At my hearing, my cousin was trying to speak for me, and they kept muting her out. She could hear the board members and the victims talking about me and she was on the other end listening, but they wouldn’t let her speak. My mother, she took it pretty hard. She’s been waiting for a while. I’m dealing with it OK. I know it’s just another step. There ain’t too much that I can do about it even though I feel the way I feel. I’m taking it in stride. Restitution is a court-ordered thing. Some people pay more, some people pay less, depending on your crime. Mine was only $200. Some individuals get $10,000, $20,000, $30,000. Mine was paid up. But basically, they say it’s “criminal thinking.” When they first hit me with it, I did not deny it. I admitted to it and all that. What gets me is that this is just being done to people who get found suitable for parole, and nobody else. **Carl Burnside** My name is Carl Burnside. I’m from Sacramento. I’ve been incarcerated 34 years. I’ve been at San Quentin since November 2022. Prior to that, I was at Susanville Level 1, the lowest of the four security levels, for three years. I started off at Vacaville in 1991. Then I transferred to Tracy in the latter part of 1991. I stayed at Tracy from 1991 to 1996. Tracy is shut down now. I went from Tracy in 1996 to High Desert. I was there till 1998. In 1998 I transferred to Susanville. From 1998 to 2011 I was at Solano. From 2011 to 2019 I was at San Quentin. From 2019 to 2022 I was at Susanville. I was originally sentenced tolife plus eight years.When I got sentenced, I was 20. When they said “life in prison,” I thought I was going to die in prison. I became eligible for parole in 2003. That’s when I started going to the parole board. When I came to prison, lifers were not being granted parole. All the OGs in the prison told me “youngster, you might as well get comfortable, because you’re never getting out of prison.” However, the law states that a person sentenced to life will become eligible for parole after seven years. I had to do the seven years for the life sentence and four years for the eight-year enhancement. After my eleventh year I technically became eligible. In 2002 I was notified by prison officials that I would have a parole suitability hearing. From 2003 to now, I’ve been to the parole board ten times. Every eighteen months. June 6, 2023, I was found suitable. My family and I were excited beyond words. I have a domestic partner and I have two adult sons. My oldest is 36 and my second son is 34. I’m 54. After I got found suitable for parole, about two months later I was notified by an investigator for the parole division. They were inquiring about two different things. They asked me why I was circumventing restitution — putting money on another inmate’s books. And the second thing they asked me was if I knew anything about EDD fraud. I had been putting money on another inmate’s books, from 2020 till 2023. I was never informed that it would affect my parole eligibility. But I knew that it was breaking the rules. I made a choice to put the money on another inmate’s books because they were taking 55% of every dollar that my family sent me. They also take 55% of wages. I originally owed $10,000. When they started the investigation, I still owed $2800. In 2020 I got sent to Susanville Level 1. Prior to that, when I was at San Quentin, I was working for hospital facilities maintenance, where I was making $1 an hour. I was making upwards of $200 a month working for the hospital. So I was able to keep $100 a month and that was more than enough to take care of myself here in prison. I worked at the hospital for four years. When they moved me to Susanville I was working as a clerk for the administration building and I was getting paid 7 to 11 cents per hour. And then when COVID hit I wasn’t making anything because we were locked down. When I was found suitable, I was expecting to be inside for no longer than 120 more days. My family was expecting me to come home to Sacramento. I had gone 16 years without a disciplinary infraction. I hadn’t had any kind of disciplinary infraction since August of 2008. My understanding had been that that was the only thing that could put my parole in jeopardy. They notified me two months after I was granted parole that I had violated. They told me that I had broken a rule and that the board was going to be notified and I would be sent to a full-panel review. Once they sent me to that, they scheduled another parole suitability hearing. At this point I already knew that my grant had been compromised and they were going to rescind my parole suitability. Because I had willingly broken the rules by circumventing restitution. I saw the parole board again in February. I asked for a continuance because I wanted to address my “criminal thinking” that was influencing me to willingly break the rule by willingly placing money on another inmate’s books. When I asked for the postponement, they said I would have to stipulate a three-year denial and then submit to come back before the parole board when I felt like I had addressed my criminal thinking. I would have to submit a 1045 and if the board felt I had addressed my criminal thinking, they would grant me a new hearing within eighteen months. Only God knows whether I will be let out in the near future. I am hopeful that I can show them that I have addressed my criminal thinking. My family has paid off the $2800, so I don’t owe them anymore. …God willing, relief will someday be my reality. At the time when I was circumventing restitution, I did not really think I was harming anybody. My selfishness and my greed was driving me. We don’t have a lot of money, and the money my family was willing to send me — I did not want to have it subjected to the penalties of restitution. I can’t sit here and justify breaking the rules. I was being driven and influenced by my selfishness and greed. I didn’t think about — the victim or the community or anyone other than myself. I was only thinking about the sardines, the soups, and the potato chips and candy that I could get from the canteen. I know other people this has happened to. I know Bennie. I know about five guys that this has happened to. None of them have gotten out. They’re going through the same thing I am. When it happened to me it started happening to people quite frequently after me here at this institution. I want to be clear that I am responsible for circumventing my restitution. It was a selfish choice I made. Had I thought it would compromise my eventual parole eligibility, absolutely, I would not have done it. My issue is, I had normalized a rule violation and I accept that fact. I want to ask: Why does circumventing restitution only compromise a lifer’s parole, and not non-lifers? It is undetermined how many more years a lifer must serve, but it is certain to cost him an additional 3 years or more. A non-lifer parole date would not be affected at all. Non-lifers would still go home on their release date. Even if they received a disciplinary infraction. **Related** Knock LA is a journalism and commentary project by Ground Game LA. We are dedicated to giving a voice to the left and uplifting marginalized communities. Knock LA is a journalism and commentary project by Ground Game LA. We are dedicated to giving a voice to the left and uplifting marginalized communities. Knock LA is a journalism and commentary project by Ground Game LA. We are dedicated to giving a voice to the left and uplifting marginalized communities. About UsSupportOur TeamPitch Stories To Knock LAContact UsTipsGround Game LA About Us Support Our Team Pitch Stories To Knock LA Contact Us Tips Ground Game LA About Us Support Our Team Pitch Stories To Knock LA Contact Us Tips Ground Game LA **** **** ****"}