{"id": 929, "name": "Lorain Morning Journal", "domain": "morningjournal.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.morningjournal.com/2025/06/11/carlos-santana-hits-grand-slam-as-guardians-beat-reds-11-2-to-avoid-season-sweep-by-franconas-club/", "title": "Carlos Santana Hits Grand Slam As Guardians Beat Reds 11 2 To Avoid Season Sweep By Franconas Club", "content": "E-Edition E-Edition NewsNewsLocal NewsCrime and Public SafetyBusinessBest ReviewsHealthLorain CountyCuyahoga CountyOhio NewsNational NewsLake ErieOpioid EpidemicElectionTrafficWorld News News Local News Crime and Public Safety Business Best Reviews Health Lorain County Cuyahoga County Ohio News National News Lake Erie Opioid Epidemic Election Traffic World News News Local News Crime and Public Safety Business Best Reviews Health Lorain County Cuyahoga County Ohio News National News Lake Erie Opioid Epidemic Election Traffic World News SportsSportsHigh School SportsCleveland BrownsCleveland CavaliersCleveland GuardiansOhio StateLake Erie CrushersLorain County IronmenMonsters Sports High School Sports Cleveland Browns Cleveland Cavaliers Cleveland Guardians Ohio State Lake Erie Crushers Lorain County Ironmen Monsters Sports High School Sports Cleveland Browns Cleveland Cavaliers Cleveland Guardians Ohio State Lake Erie Crushers Lorain County Ironmen Monsters Things to DoThings to DoEntertainmentMoviesMusic and ConcertsTheaterRestaurants Food and DrinkRecipesTravelTV ListingsComicsMore PuzzlesJumble and MoreEvents Things to Do Entertainment Movies Music and Concerts Theater Restaurants Food and Drink Recipes Travel TV Listings Comics More Puzzles Jumble and More Events Things to Do Entertainment Movies Music and Concerts Theater Restaurants Food and Drink Recipes Travel TV Listings Comics More Puzzles Jumble and More Events Opinion ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary MarketplaceJobsClassifieds Jobs Classifieds Jobs Classifieds ToolsContact UsAdvertiseContestsSubmit AnnouncementsNewsstand LocationsMobile AppsGasBuddyLottery Contact Us Advertise Contests Submit Announcements Newsstand Locations Mobile Apps GasBuddy Lottery Contact Us Advertise Contests Submit Announcements Newsstand Locations Mobile Apps GasBuddy Lottery Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Subscribe Log in Logout Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Subscribe Log in Sign up for email newsletters Subscribe Log in E-Edition E-Edition News Sports Things to Do Opinion Obituaries Classifieds Contests **Carlos Santana hits grand slam as Guardians beat Reds, 11-2, to avoid season sweep by Francona’s club** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Carlos Santana slugged his sixth career grand slam and the Guardians beat Cincinnati,11-2, on June 11, snapping the Reds’ five-game win streak and denying manager Terry Francona a season sweep of his former team. Santana’s third-inning slam came on the 15th anniversary of his major league debut. It was his eighth homer this season and made it 5-0, helping Cleveland salvage the finale of this three-game series. Francona’s Reds swept the Guardians in three games at Cincinnati last month. The Guardians had five straight hits to open a four-run sixth for a nine-run lead, including a three-run homer by Lane Thomas. Cleveland’s 11 runs were a season high. Thomas’ homer was his first this season after returning from the injured list this week. He had three hits, drove in three runs and scored twice. José Ramírez hit an RBI double to extend his career-long on-base streak to 37 games, the longest active streak in the majors. He has a hit in 11 straight games. Logan Allen (4-4) went six innings and gave up solo homers to Elly De La Cruz and TJ Friedl. He struck out six. Nick Lodolo (4-5) lasted only 3 1/3 innings, giving up six runs. Cincinnati’s Christian Encarnacion-Strand was hit on the bill of his helmet by a 97 mph pitch from Emmanuel Clase in the ninth but stayed in the game. Angel Martínez and Thomas singled and Ramírez was hit by a pitch to set up Santana’s slam. Ramírez hit his 380th career double, passing Earl Averill for third-most in franchise history. He trails Hall of Famers Tris Speaker (486) and Nap Lajoie (424). Cincinnati’s Nick Martinez (4-6, 3.70 ERA) will pitch against Keider Montero (2-1, 4.30) at Detroit on Friday. Cleveland’s Gavin Williams (5-3, 3.86) will face Luis Castillo (4-4, 3.31) at Seattle on June 13. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X **RevContent Feed** **Most Popular** Trent’s Joint on the River opens in LorainTrent's Joint on the River opens in Lorain **Trent’s Joint on the River opens in Lorain** **Trent’s Joint on the River opens in Lorain** Man facing drug charges after Elyria traffic stopMan facing drug charges after Elyria traffic stop **Man facing drug charges after Elyria traffic stop** **Man facing drug charges after Elyria traffic stop** On the job with Andy Docerty, owner of Doc’s Open Box in VermilionOn the job with Andy Docerty, owner of Doc's Open Box in Vermilion **On the job with Andy Docerty, owner of Doc’s Open Box in Vermilion** **On the job with Andy Docerty, owner of Doc’s Open Box in Vermilion** Richard Ramsey resigns as Amherst treasurer, successor to be appointedRichard Ramsey resigns as Amherst treasurer, successor to be appointed **Richard Ramsey resigns as Amherst treasurer, successor to be appointed** **Richard Ramsey resigns as Amherst treasurer, successor to be appointed** Mihaljevic’s mother diesMihaljevic's mother dies **Mihaljevic’s mother dies** **Mihaljevic’s mother dies** Burns Road in Elyria to receive safety improvements following boy’s deathBurns Road in Elyria to receive safety improvements following boy's death **Burns Road in Elyria to receive safety improvements following boy’s death** **Burns Road in Elyria to receive safety improvements following boy’s death** High school girls softball: Area players earn 2025 All-Ohio honorsHigh school girls softball: Area players earn 2025 All-Ohio honors **High school girls softball: Area players earn 2025 All-Ohio honors** **High school girls softball: Area players earn 2025 All-Ohio honors** Breakthrough Kitchen serves up homemade Lorain favoritesBreakthrough Kitchen serves up homemade Lorain favorites **Breakthrough Kitchen serves up homemade Lorain favorites** **Breakthrough Kitchen serves up homemade Lorain favorites** Amherst trio, Keystone’s Webb receive All-Ohio first-team baseball honorsAmherst trio, Keystone's Webb receive All-Ohio first-team baseball honors **Amherst trio, Keystone’s Webb receive All-Ohio first-team baseball honors** **Amherst trio, Keystone’s Webb receive All-Ohio first-team baseball honors** All-Ohioan ace Karina Shuster sets tone for Amherst softball’s next chapterAll-Ohioan ace Karina Shuster sets tone for Amherst softball's next chapter **All-Ohioan ace Karina Shuster sets tone for Amherst softball’s next chapter** **All-Ohioan ace Karina Shuster sets tone for Amherst softball’s next chapter** **More in Sports** Amherst baseball: Postseason adversity serves Comets well heading into big weekend **Amherst baseball: Postseason adversity serves Comets well heading into big weekend** **Amherst baseball: Postseason adversity serves Comets well heading into big weekend** Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law **Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law** **Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law** Crushers drop 7-2 decision to visiting Otters **Crushers drop 7-2 decision to visiting Otters** **Crushers drop 7-2 decision to visiting Otters** PHOTOS: Crushers-Otters, June 10, 2025 **PHOTOS: Crushers-Otters, June 10, 2025** **PHOTOS: Crushers-Otters, June 10, 2025** 2025 June 11 Subscriber ServicesSubscribeSign Up For Newsletterse-EditionSitemap Subscribe Sign Up For Newsletters e-Edition Sitemap Subscribe Sign Up For Newsletters e-Edition Sitemap Contact UsWork With UsSubmit AnnouncementsiOS AppAndroid AppNews-HeraldPrivacy PolicyAccessibility Work With Us Submit Announcements iOS App Android App News-Herald Privacy Policy Accessibility Work With Us Submit Announcements iOS App Android App News-Herald Privacy Policy Accessibility JobsClassifiedsNetwork AdvertisingPlace Classified AdAdvertising Inquiry Classifieds Network Advertising Place Classified Ad Advertising Inquiry Classifieds Network Advertising Place Classified Ad Advertising Inquiry Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration MediaNews Group Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}