{"id": 1716, "name": "The Daily Expose", "domain": "expose-news.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "very-low", "questionable": null, "url": "https://expose-news.com/2025/06/09/global-greening-the-truth-they-dont-want-you-to-know/#comments", "title": "Global Greening The Truth They Dont Want You To Know", "content": "**The Expose** **Home** **Menu** Home We Need Your Support My Subscription About us Contact us **Please follow & like us :)** **Translate** The Exposé relies solely on your support to allow us to report the facts the mainstream refuse to. If you like what we do then please help us to keep doing it with a one-time or monthly donation today... **Recent Posts** Covid protocols included euthanasia of covid patients to free up beds in American hospitals Good news: The biotechnology industry is collapsing Who controls the Muslim Brotherhood? Why you should give up meals completely White fibrous clots found in 3-year-old child born to mother who was covid vaccinated while pregnant **Categories** Breaking News Did You Know? Latest News Opinion Pages The Expose Blog Uncategorized World News **Archives** Cookie Policy Privacy Policy **Global Greening: The truth they don’t want you to know** Researchers in Spain have found “robust quantitative evidence” of widespread global greening, with a significant portion of the Earth’s land surface showing measurable increases in vegetation cover over the last 40 years. The rate of greening has been increasing since the turn of the century, with estimates of growth ranging around 14-20% over 40 years, but this information is not being reported by left-wing corporate media, which is preoccupied with promoting the Net Zero fantasy. Let’s not lose touch…Your Government and Big Tech are actively trying to censor the information reported by TheExposéto serve their own needs. Subscribe now to make sure you receive the latest uncensored newsin your inbox… Type your email… Subscribe The recent rise in carbon dioxide in the atmosphere has led to significant increases in plant vegetation across the Earth, with a geographer and an agrobiologist in Spain finding “robust quantitative evidence” of widespread global greening, describing it as “striking” with a significant portion of the Earth’s terrestrial land surface showing measurable increases in vegetation cover over the last four decades. The corporate media have failed to report on this greening phenomenon, despite being easily tracked by satellite. “Global greening heads a long list of taboo subjects for captured journalists promoting the political Net Zero fantasy,” Chris Morrison,The Daily Sceptic’s Environment Editor, wrote last week. Adding, “Global greening helps reduce world famine and reclaim desert areas but it is not of the slightest interest in the mainstream since it disrupts the fake claims of a climate in crisis due to humans burning hydrocarbons.” Despite the best efforts of left-wing corporate media’s activist journalism, nature will do what nature will do. Estimates of global vegetation growth range around 14-20% over just 40 years and recent scientific work has found that the rate of greening has actually been increasing since the turn of the century. The Spanish researcherspublished their paper in January 2025. They said that 38% of the world’s land surface shows significant vegetation change, with 76% of the change total showing more greening and those areas with more plant life showing higher rates of additional growth, helping to confirm global greening. The results of the Spanish researchers are replicated in recent scientific work, and should not be a surprise since plants on Earth have evolved to thrive in levels of atmospheric carbon dioxide (CO2) much higher than the current historically sparse totals around 400 parts per million (ppm). Far from being a pollutant, as climate change alarmists want the public to believe, CO2is rightly known as the gas of life. Agroup of Chinese scientistsnoted there has been an “accelerated rate” of recent vegetation growth. Agroup of American scientistsrecently highlighted 2020 as a “historic landmark” since it registered as the greenest year in the satellite record from 2001 to 2020. Debate over the percentage of total global land greening and ‘browning’ is ongoing, with some work finding a greening change over at least 50% of the surface. The benefits of global greening include reducing world famine and reclaiming desert areas. Some deserts across the world are reducing in size, particularly around areas prone to subsistence living, and considerable greening across Eurasia has also been found by many scientific teams. In their paper ‘Environmental Drivers of Agricultural Productivity Growth’ for theNational Bureau of Economic Research, authors Charles Taylor and Wolfram Schlenker have consistently found a large fertilisation effect of a 1 ppm increase in CO2equates to higher crop yields, but this has been ignored by outlets such as theBBCandThe Guardian. The above is paraphrased from the article ‘Global Greening From Higher CO2 Hits “Striking” New Heights – but the Mainstream Media Won’t Tell You About It’ published by The Daily Sceptic. You can read the full articleHERE. Related:While scientific evidence shows CO2is life-sustaining, the “official narrative” continues to gaslight its crucial role in our world Featured image taken from ‘Carbon Dioxide Fertilisation Greening Earth, Study Finds’, NASA, 26 April 2016 The Expose Urgently Needs Your Help… Can you please help to keep the lights on with The Expose’s honest, reliable, powerful and truthful journalism? Your Government & Big Tech organisationstry to silence & shut down The Expose. So we need your help to ensurewe can continue to bring you thefacts the mainstream refuses to. The government does not fund usto publish lies and propaganda on theirbehalf like the Mainstream Media. Instead, we rely solely on your support. Soplease support us in our efforts to bringyou honest, reliable, investigative journalismtoday. It’s secure, quick and easy. Please choose your preferred method below to show your support. **Related** Categories:Breaking News,World News Tagged as:Climate Agenda,Latest News **Post navigation** Δ Δ […] Go to Source Follow altnews.org on Telegram […] **Top Posts** White fibrous clots found in 3-year-old child born to mother who was covid vaccinated while pregnant Why you should give up meals completely Global Greening: The truth they don’t want you to know Muslim Brotherhood has plans to subvert European countries from the bottom up Who controls the Muslim Brotherhood? **Get New Posts By Email** Enter your email address to subscribe to The Exposé for regular updates... Email Address Subscribe to The Exposé **How Bad is My Covid Batch?** Covid Batch Information **Get in touch** **Search** The Exposé relies solely on your support to allow us to report the facts the mainstream refuse to. If you like what we do then please help us to keep doing it with a one-time or monthly donation today... **Recent Posts** Covid protocols included euthanasia of covid patients to free up beds in American hospitals Good news: The biotechnology industry is collapsing Who controls the Muslim Brotherhood? **Follow Us** Top categories:Breaking NewsCovid Lies **We are being Censored. Please share the Facts the Mainstream Media refuse to...** **Discover more from The Expose** Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading **** **** ****"}