{"id": 2049, "name": "Monthly Review", "domain": "monthlyreview.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://monthlyreview.org/product/openings-and-closures-socialist-strategy-at-a-crossroads-socialist-register-2025/", "title": "Openings And Closures Socialist Strategy At A Crossroads Socialist Register 2025", "content": "**Top Menu** Archives MR Press MR Online Monthly Review Essays Climate & Capitalism Money on the Left Donate Login **Navigation** **Main Menu** Subscribe Solidarity Offer! StoreBooksBack IssuesView My CartCheckout Books Back Issues View My Cart Checkout Books Back Issues View My Cart Checkout PressSubmit a Book Proposal or ManuscriptNew & Recently ReleasedMR Press CatalogsBooks (list of all titles)Discounts, Shipping, and eBooksRequest a Review or Desk CopySales and DistributionBaran—Sweezy Memorial Award Submit a Book Proposal or Manuscript New & Recently Released MR Press Catalogs Books (list of all titles) Discounts, Shipping, and eBooks Request a Review or Desk Copy Sales and Distribution Baran—Sweezy Memorial Award Submit a Book Proposal or Manuscript New & Recently Released MR Press Catalogs Books (list of all titles) Discounts, Shipping, and eBooks Request a Review or Desk Copy Sales and Distribution Baran—Sweezy Memorial Award BrowseSearchby Year and Issueby Subjectby Geographic Locationby Magazine SectionComplete archive, 1949–present Search by Year and Issue by Subject by Geographic Location by Magazine Section Complete archive, 1949–present Search by Year and Issue by Subject by Geographic Location by Magazine Section Complete archive, 1949–present ContactSubmit an Article or Book ProposalContactMonthly ReviewReprint PermissionsAdvertise inMonthly ReviewAboutThe EditorsPrivacy PolicyDonate toMR Submit an Article or Book Proposal ContactMonthly Review Reprint Permissions Advertise inMonthly Review AboutThe EditorsPrivacy PolicyDonate toMR The Editors Privacy Policy Donate toMR Submit an Article or Book Proposal ContactMonthly Review Reprint Permissions Advertise inMonthly Review AboutThe EditorsPrivacy PolicyDonate toMR The Editors Privacy Policy Donate toMR The Editors Privacy Policy Donate toMR HelpFAQNew Subscription System!How to Download and Convert eBooks FAQ New Subscription System! How to Download and Convert eBooks FAQ New Subscription System! How to Download and Convert eBooks My AccountView/Renew SubscriptionChange Email/PasswordRecover My PasswordChange Address View/Renew Subscription Change Email/Password Recover My Password Change Address View/Renew Subscription Change Email/Password Recover My Password Change Address 0 items-$0.00 **Openings and Closures: Socialist Strategy at a Crossroads: Socialist Register 2025** $25.00–$35.00 Since the 2016 upsurge in enthusiasm for electoral organizing and party-building, the terrain has shifted. It was not so long ago that a new wave of democratic socialist organizing exploded onto the scene – but the defeat of candidates such as Bernie Sanders and Jeremy Corbyn, following on the crumbling of the “new parties” in Europe, had a deflating effect. As Greece’s Syriza, Spain’s Podemos, and Portugal’s Bloco let down the leftist movements that brought them to power, those inspired by Hugo Chavez in Latin America also saw the Bolivarian revolutions hit an impasse. We find socialist strategy again at a crossroads, pressed by the urgent need to find new directions forward amidst mounting crises. At this new conjuncture, what is left of the strategy, tactics, and organizations that had seemed so promising? Is the ‘new socialist’ left starting over, or moving on? Socialist Register 2025 engages with the openings and closures of at the crossroads of Socialist strategy, with case studies from Britain, US, Pakistan, Argentina, Germany, Bolivia, Barcelona, and Turkey, engaging with topics such as social struggles over climate change, Palestine solidarity, public banks, re-municipalization of utilities, and unions. **Subjects include:** – Legacies of the New Left: ‘Transforming the state’ today– Socialist strategy: Trade unions, elections, and social movements– Analysis of the “new left” European parties, Momentum, and DSA– The current state of the “pink tide” and left forces in Latin America– Left political organizing in Turkey and the role of international law in Palestine-Israel– The German Left at a crossroads– North American unions and the ‘rank and file strategy’– Limits of liberal internationalism and the law—the Gaza case– Confronting radical libertarianism and the Millei government in Argentina– The failings of identity politics and Afro-American politics– Radical ecology, civil disobedience and the left– In search of new socialist movements and strategies Publication Date:March 2025 Number of Pages:344 Paperback ISBN:978-1-68590-115-8 eBook ISBN:978-1-68590-117-2 Description Additional information **Related products** Monthly Review Volume 2, Number 6 (October 1950) [PDF]$10.00Add to cart **Monthly Review Volume 2, Number 6 (October 1950) [PDF]** **Monthly Review Volume 2, Number 6 (October 1950) [PDF]** **Monthly Review Volume 2, Number 6 (October 1950) [PDF]** Monthly Review Volume 2, Number 5 (September 1950) [PDF]$10.00Add to cart **Monthly Review Volume 2, Number 5 (September 1950) [PDF]** **Monthly Review Volume 2, Number 5 (September 1950) [PDF]** **Monthly Review Volume 2, Number 5 (September 1950) [PDF]** Monthly Review Volume 2, Number 2 (June 1950) [PDF]$10.00Add to cart **Monthly Review Volume 2, Number 2 (June 1950) [PDF]** **Monthly Review Volume 2, Number 2 (June 1950) [PDF]** **Monthly Review Volume 2, Number 2 (June 1950) [PDF]** Monthly Review Volume 1, Number 10 (February 1950) [PDF]$10.00Add to cart **Monthly Review Volume 1, Number 10 (February 1950) [PDF]** **Monthly Review Volume 1, Number 10 (February 1950) [PDF]** **Monthly Review Volume 1, Number 10 (February 1950) [PDF]** Monthly Review Volume 1, Number 7 (November 1949) [PDF]$10.00Add to cart **Monthly Review Volume 1, Number 7 (November 1949) [PDF]** **Monthly Review Volume 1, Number 7 (November 1949) [PDF]** **Monthly Review Volume 1, Number 7 (November 1949) [PDF]** Monthly Review Volume 1, Number 5 (September 1949) [PDF]$10.00Add to cart **Monthly Review Volume 1, Number 5 (September 1949) [PDF]** **Monthly Review Volume 1, Number 5 (September 1949) [PDF]** **Monthly Review Volume 1, Number 5 (September 1949) [PDF]** 2025 Monthly Review Foundation. All Rights Reserved Monthly Review | Tel: 212-691-2555134 W 29th St Rm 706, New York, NY 10001"}