{"id": 1379, "name": "The Globe and Mail (Toronto)", "domain": "theglobeandmail.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.theglobeandmail.com/life/horoscopes/article-your-daily-horoscope-june-11-2025/", "title": null, "content": "Home Watchlist For You Canada World Business Investing Personal Finance Opinion Politics Sports Life Arts Drive Real Estate **Latest in** **Your daily horoscope: June 11, 2025** Gemini.iStockPhoto / Getty Images A birthday full moon means you have to become more of a multitasker. With practice you will find that focusing on two things at once is not only possible but can even be beneficial. When you get bored with one you can switch to the other. **Aries (March 21 - April 20):** Do only what you want to do today and let those who are trying to push you in a new direction know you won’t be playing ball. It’s okay to be a bit selfish, especially when the moon is full, so only do what brings you personal advantage. **Taurus (April 21 - May 21):** The more you try to understand a situation that has little to do with you the more complicated it seems to get, so be smart and put it out of your mind completely. You did not cause it, you cannot change it and it is not your responsibility. **Gemini (May 22 - June 21):** As today’s full moon takes place in your opposite sign you cannot expect others to agree with your plans and ideas. That could become a big deal if they actively try to modify them for you. Be smart, and tough, and refuse to change a single thing. **Cancer (June 22 - July 23):** Don’t worry if you find it hard to get through to friends and loved ones today, because everyone will be having communication issues under the influence of the full moon. Give it a day or two and you will be on the same wavelength again. **Leo (July 24 - Aug. 23):** Sometimes you can be a bit too rigid in your thinking and that can cause problems when events don’t work out the way you expected them to. If what you expected to happen today does not take place just give it a few more days. **Virgo (Aug. 24 - Sept. 23):** Full moons can be dangerous because they pull us in opposing directions and make it difficult to make sensible decisions. For the next 48 hours or so the best decision is probably no decision, so take a raincheck and come back to it later. **Libra (Sept. 24 - Oct. 23):** Your confidence could take a bit of a dent today, especially if the full moon wrecks your travel plans. Take the hint and sit tight for a while but be ready to move again when the cosmic outlook changes toward the end of the week. **Scorpio (Oct. 24 - Nov. 22):** There is so much confusion at the moment that you may be having a hard time working out which way is up and which way is down. Don’t worry. Gravity will sort things out over the next 24 hours. Hopefully it won’t be too hard a landing. **Sagittarius (Nov. 23 - Dec. 21):** It’s not like you to believe you need to prove yourself but the full moon in your sign has brought a few doubts to the surface and now you are looking for ways to make an impression. But why? The people who matter know what you can do. **Capricorn (Dec. 22 - Jan. 20):** Stop looking back at how things used to be and start looking forward at how you want them to be in the future. You have a lot more control over your destiny than you imagine, so focus your mind on your number one desire and make it happen. **Aquarius (Jan. 21 - Feb. 19):** A minor setback could easily develop in your mind into a major catastrophe, so you need to remind yourself that in the greater scheme of things all events have their essential place. Whatever your current problem may be, it’s really no big deal. **Pisces (Feb. 20 - Mar. 20):** Today’s full moon will encourage you to put the worst possible interpretation on what is taking place in your life. Stand back from both your family life and your career and take a look at the bigger picture. It’s actually rather pretty. Discover more about yourself at sallybrompton.com Report an editorial error Report a technical issue Editorial code of conduct **Take a Break** **Check your horoscope to learn how the stars align for you today.** **Check your horoscope to learn how the stars align for you today.** **Sharpen your mind with today’s Cryptic Crossword.** **Sharpen your mind with today’s Cryptic Crossword.** **Refine your strategy and solve the Daily Sudoku.** **Refine your strategy and solve the Daily Sudoku.** **Relax and engage with the Daily Concise Crossword.** **Relax and engage with the Daily Concise Crossword.** **Follow related authors and topics** Sally BromptonFollowYou must be logged in to follow.Log InCreate free account COP | Climate change conference Horoscopes Authors and topics you follow will be added to your personal news feed inFollowing. **Interact with The Globe** Terms & Conditions Community Guidelines Privacy Policy Disclaimer SubscribeDigital + Home DeliveryDigital AccessGlobe2GoThe New York TimesGlobe Email NewslettersGift Subscription Digital + Home Delivery Digital Access Globe2Go The New York Times Globe Email Newsletters Gift Subscription Digital + Home Delivery Digital Access Globe2Go The New York Times Globe Email Newsletters Gift Subscription Business servicesAdvertise with UsGroup SubscriptionsGlobe CampusDataStoreGlobe Event CentreLeadership Institute Advertise with Us Group Subscriptions Globe Campus DataStore Globe Event Centre Leadership Institute Advertise with Us Group Subscriptions Globe Campus DataStore Globe Event Centre Leadership Institute Contact usAddress and Phone NumberStandards EditorStaffSecureDropSubmit an article Address and Phone Number Standards Editor Staff SecureDrop Submit an article Address and Phone Number Standards Editor Staff SecureDrop Submit an article Reader servicesAccount SettingsTechnical Support & FAQsSubscriptionsMember BenefitsPrivacy Settings Account Settings Technical Support & FAQs Subscriptions Member Benefits Privacy Settings Account Settings Technical Support & FAQs Subscriptions Member Benefits Privacy Settings About usCompany InformationWork at The GlobeAccessibilityEditorial Code of ConductSustainabilityLicensing & PermissionsElection Advertising RegistryModern Slavery Report Company Information Work at The Globe Accessibility Editorial Code of Conduct Sustainability Licensing & Permissions Election Advertising Registry Modern Slavery Report Company Information Work at The Globe Accessibility Editorial Code of Conduct Sustainability Licensing & Permissions Election Advertising Registry Modern Slavery Report **Subscribe** Digital + Home Delivery Digital Access Globe2Go The New York Times Globe Email Newsletters Gift Subscription **Business services** Advertise with Us Group Subscriptions Globe Campus DataStore Globe Event Centre Leadership Institute **Contact us** Address and Phone Number Standards Editor Staff SecureDrop Submit an article **Reader services** Account Settings Technical Support & FAQs Subscriptions Member Benefits Privacy Settings **About us** Company Information Work at The Globe Accessibility Editorial Code of Conduct Sustainability Licensing & Permissions Election Advertising Registry Modern Slavery Report © Copyright2025The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO"}