{"id": 1363, "name": "The Citizen (Australia)", "domain": "thecitizen.org.au", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thecitizen.org.au/articles/deal-or-no-deal-student-protesters-claim-partial-victory-vote-to-pack-up-it-all-swings-on-an-email-from-uni-hq", "title": "Deal Or No Deal Student Protesters Claim Partial Victory Vote To Pack Up It All Swings On An Email From Uni Hq", "content": "**** **A publication of the Centre for Advancing Journalism, University of Melbourne** CultureFilmArtsTheatreBooksInvestigation Film Arts Theatre Books Investigation Film Arts Theatre Books Investigation HealthMedicineHealthResearchFamilyWellness Medicine Health Research Family Wellness Medicine Health Research Family Wellness MoneyInvestment Investment Investment PoliticsFederalStateLocalInternational Federal State Local International Federal State Local International ScienceClimateEnvironmentTechnology Climate Environment Technology Climate Environment Technology SocietyEducationIndigenousHistoryHealthTransportUrban PlanningAging Education Indigenous History Health Transport Urban Planning Aging Education Indigenous History Health Transport Urban Planning Aging SportFootballCricketOlympicsGender Football Cricket Olympics Gender Football Cricket Olympics Gender ProjectsElection 2025: Inside marginal MenziesBuilding BallaratGone FeralGaza Campus ProtestsFuture BendigoNeighbourhood Watch: Local spotlight on burning issuesFirst PersonElection 22: Chisholm’s ChoiceCrook in the bush: The rural health crisisLife After JobKeeperUnsung heroes of COVID-19Generation CoronavirusMentalClayton 3168: Lockdown on the stripFuture Forecast: Spotlight on the south-westCovering Climate NowA Day In The Life Of YinnarGoing UnderTRANSFORMATIONDISPOSABLESpotlight on Deakin: Election 2019Creeks of MelbourneTabooGraveyard ShiftPerfectionPostcode 3010Table Manners: From Farm to PlateSWARMFirst Person PandemicEvery Body Has A Story Election 2025: Inside marginal Menzies Building Ballarat Gone Feral Gaza Campus Protests Future Bendigo Neighbourhood Watch: Local spotlight on burning issues First Person Election 22: Chisholm’s Choice Crook in the bush: The rural health crisis Life After JobKeeper Unsung heroes of COVID-19 Generation Coronavirus Mental Clayton 3168: Lockdown on the strip Future Forecast: Spotlight on the south-west Covering Climate Now A Day In The Life Of Yinnar Going Under TRANSFORMATION DISPOSABLE Spotlight on Deakin: Election 2019 Creeks of Melbourne Taboo Graveyard Shift Perfection Postcode 3010 Table Manners: From Farm to Plate SWARM First Person Pandemic Every Body Has A Story Election 2025: Inside marginal Menzies Building Ballarat Gone Feral Gaza Campus Protests Future Bendigo Neighbourhood Watch: Local spotlight on burning issues First Person Election 22: Chisholm’s Choice Crook in the bush: The rural health crisis Life After JobKeeper Unsung heroes of COVID-19 Generation Coronavirus Mental Clayton 3168: Lockdown on the strip Future Forecast: Spotlight on the south-west Covering Climate Now A Day In The Life Of Yinnar Going Under TRANSFORMATION DISPOSABLE Spotlight on Deakin: Election 2019 Creeks of Melbourne Taboo Graveyard Shift Perfection Postcode 3010 Table Manners: From Farm to Plate SWARM First Person Pandemic Every Body Has A Story PodcastsUncuratedThe YarnThe Little Red PodcastThe Media FilesThe MasterclassChange AgentsThe People’s Game Uncurated The Yarn The Little Red Podcast The Media Files The Masterclass Change Agents The People’s Game Uncurated The Yarn The Little Red Podcast The Media Files The Masterclass Change Agents The People’s Game Reporters The Global Citizen **Deal or no deal? Student protesters claim partial victory, vote to pack up. It all swings on an email from uni HQ** After weeks of tensions and a stalemate around the student occupation of the Arts West building, pro-Palestine protest organisers announced a partial victory tonight and signalled they would pack up and go home. But not until university administrators confirm the claimed deal.James CostaandThe Citizenteam report. “The university will be sending an email out tomorrow (Thursday), to all students and staff, making a public commitment that the university will disclose all of its relationships, not only with defence … but when it comes to all research”: Unimelb for Palestine organiser Hiba addresses protesters this evening. Photo by James Costa Pro-Palestine student protesters at the University of Melbourne have tonight (Wednesday) claimed a partial victory in their months-long campaign demanding that the university disclose and divest links to weapons manufacturers involved in the Israel-Hamas war. After a week of tense negotiations, threats and a stalemate around the student occupation of the Arts West building, “Unimelb for Palestine” organisers told a crowd of about 40 assembled activists that the university had undertaken to disclose relationships and review its ethical research policies. Protesters gathered at the South Lawn “Gaza Solidarity Encampment” – now in its 28th day – voted to pack up and leave if the deal was confirmed. At 8.30pm Wednesday, responding to questions fromThe Citizenabout the claims, a university media spokesperson would neither confirm or deny them, releasing a one-line statement: “We welcome the willingness of the occupiers to leave the Arts West building and remove the encampment from our Parkville campus.” Addressing activists at 5pm, protest organiser Hiba, who did not want to give her last name, announced: “The university will be sending an email out tomorrow (Thursday), to all students and staff, making a public commitment that the university will disclose all of its relationships, not only with defence … but when it comes to all research”. Hiba said that the university was “not budging on divestment, at all”. But the deal would mean that researchers’ profiles on their “find an expert” public pages would include details of collaborator companies, including financial contributions. She said the talks had not secured an undertaking by the university not to take disciplinary action against students, but they had managed to negotiate that action down from“immediate orders” issued by the vice chancellor, which can impose serious and wide-ranging restrictions on a student, to lower order “general misconduct” via a “student disciplinary committee”. The university hasnumerous publicly recognised ties with weapons manufacturers, including a$3.5 million “collaboration” with Lockheed Martin, an“industrial project” with BAE Systems and a partnership with Boeing. “Unimelb for Palestine” organisers– a “non-affiliated, grassroots” group of students, alumni and staff – claim that the Arts West sit-in was a spontaneous action not organised by them, and that protesters still inside the building are an “unaffiliated autonomous group”. Nonetheless, Hiba said that they would also pack up if the deal was confirmed. Both groups are demanding that the university divests and discloses ties with weapons manufacturers and, in their words, condems “the genocide in Gaza”. Israel has repeatedly denied claims of genocide. Protesters also claimed that the university would review its ethics and due diligence policy, as well as host an open lecture series starting next semester to hear from both sides on the Israel-Palestine conflict. Dana Al-shaer, a leading organiser with Unimelb for Palestine, toldThe Citizenthat it was “one of the wins, and one of the demands for protesters but it is not the end of the journey. “It definitely shows the power of students and staff and the broader community to make the university shift its language and policies, as they moved from transparency to full disclosure in the matter of a week,” Al-shaer said. “This does not mean that we will stop, there is a long way to go … divestment remains as the one priority that we are going to work towards, so we are not going to stop protesting, we’re just going to conclude the encampment”. The fallout for activists is now front of mind for many. “It is a gross injustice if the university were to punish students who are carrying out the values of political expression and academic freedom that the university extols”, said Al-shaer. **More stories inPolitics** **Police and protestors clash as mining conference enters second day** Photos byLiam Petterson **Police and protestors clash as mining conference enters second day** Photos byLiam Petterson **For second year running, student podcasts win honours in New York** Story byGwen Liu **For second year running, student podcasts win honours in New York** Story byGwen Liu **‘It’s during moments of political crises that these questions of motivation and obligation are put under the microscope.’** Interview byDerrick Krusche **‘It’s during moments of political crises that these questions of motivation and obligation are put under the microscope.’** Interview byDerrick Krusche **Victoria’s Question Time revamp is a case of back to the future** Words byScott Tibballs **Victoria’s Question Time revamp is a case of back to the future** Words byScott Tibballs **About The Citizen** THE CITIZEN is a publication of the Centre for Advancing Journalism. It has several aims. Foremost, it is a teaching tool that showcases the work of the students in the University of Melbourne’s Master of Journalism and Master of International Journalism programs, giving them real-world experience in working for publication and to deadline.Find out more → Editor:Jo Chandler Reporter:Ashleigh Audio editor:Louisa Lim Video & Photo editor:Liam Cochrane Data editor: Craig Butt Editor-In-Chief: Andrew Dodd Business editor:Lucy Smy The Global Citizen editor:Tim Stoney **Subscribe to The Citizen** Stay up to speed on the latest news and events at The Citizen. Culture Health Money Politics Projects Science Society Sport The Global Citizen About Policy Contact us Contact:[email protected]Editor: Jo ChandlerDirector (Centre for Advancing Journalism): Dr Andrew Dodd"}