{"id": 1140, "name": "Propublica", "domain": "propublica.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.propublica.org/atpropublica/propublica-opens-application-for-five-new-local-partners-to-join-its-50-state-initiative", "title": "Propublica Opens Application For Five New Local Partners To Join Its 50 State Initiative", "content": "ProPublica Local Initiatives Data Store Donate Follow us on Twitter Like us on Facebook Search Newsletters **ProPublica logo** Graphics & Data Newsletters About Racial Justice Trump Administration Criminal Justice Environment More… Series Video Impact Search More **ProPublica Opens Application for Five New Local Partners to Join Its 50 State Initiative** byProPublica Facebook Twitter Email ProPublica announced on Wednesday anew call for proposalsto select the next five partners in itsLocal Reporting Network. These newsrooms will be chosen to be part of the organization’s50 State Initiative, a commitment to partnering with one newsroom from each state by 2029. The deadline for applications is July 21 at 5 p.m. Eastern. Reporters selected for the one-year program will begin work on Oct. 1, 2025. Through this partnership, ProPublica will reimburse news organizations for the salary of the selected reporter (up to $75,000 plus a benefits stipend) so they can spend a year working full time on an accountability journalism project of importance to their communities. Additionally, ProPublica provides editing support, along with our data, research, visual storytelling, graphics, design, audience and engagement expertise. More information abouthow to applyandthe applicationfor prospective newsrooms have just been posted. Newsrooms from 35 states are eligible to apply for this round. Please seeour eligibility mapfor details. As part of the 50 State Initiative, ProPublica is currently working with newsrooms from the first 10 states; another five newsrooms will start in July. Reporting with The Connecticut Mirror oncar towing in the statesparked legislative reforms to overhaul century-old towing laws thatfavored tow companiesat the expense of drivers. In Georgia, we have documented how the state’s Medicaid work requirement, which is being heralded as a model for the rest of the country, hasfallen short and cost millions. And in Tennessee, we’ve shown how one company has vastly expanded the use of a unique high-interest loan — and then gone on tosue more than 100,000 borrowers. “It’s thrilling to see ProPublica’s Local Reporting Network reach newsrooms in all regions of the country,” said Sarah Blustain, an assistant managing editor at ProPublica. “With each additional state, we are able to bring urgent local issues to readers nationwide.” The 50 State Initiative expands the scope of ProPublica’s work at the local and regional level, which includes a growing team of journalists reporting from communities across the country and groundbreaking partnerships with local news organizations through the LRN program. The initiative broadens our support forlocal journalism, which now includes the LRN alongside dedicated reporting hubs in the Midwest, South, Southwest and Northwest, as well as an investigative unit in Texas in partnership with The Texas Tribune. ProPublica has more than 25 staff reporters and more than 20 reporting partnerships around the country contributing to regional and local accountability reporting, ensuring people can benefit from world-class journalism that can drive measurable change in their communities. The LRN began in January 2018 in an effort to help remedy the lack of investigative reporting at the local level. It has since led to partnerships with some 80 news organizations across the country. **Get the latest news from ProPublica every afternoon.** ProPublica ProPublica is an independent, nonprofit newsroom that produces investigative journalism with moral force.Learn more. ProPublica @propublica **Follow ProPublica** Twitter Facebook YouTube RSS **Stay Informed** Get our investigations delivered to your inbox with the Big Story newsletter. **Most Read** The DOGE 100: Musk Is Out, but More Than 100 of His Followers Remain to Implement Trump’s Blueprint **The DOGE 100: Musk Is Out, but More Than 100 of His Followers Remain to Implement Trump’s Blueprint** **The DOGE 100: Musk Is Out, but More Than 100 of His Followers Remain to Implement Trump’s Blueprint** “The Intern in Charge”: Meet the 22-Year-Old Trump’s Team Picked to Lead Terrorism Prevention **“The Intern in Charge”: Meet the 22-Year-Old Trump’s Team Picked to Lead Terrorism Prevention** **“The Intern in Charge”: Meet the 22-Year-Old Trump’s Team Picked to Lead Terrorism Prevention** Tennessee’s Law on School Threats Ensnared Students Who Posed No Risks. Two States Passed Similar Laws. **Tennessee’s Law on School Threats Ensnared Students Who Posed No Risks. Two States Passed Similar Laws.** **Tennessee’s Law on School Threats Ensnared Students Who Posed No Risks. Two States Passed Similar Laws.** EPA Drops Legal Case Against the GEO Group, a Major Trump Donor, Over Its Misuse of Harmful Disinfectant in an ICE Facility **EPA Drops Legal Case Against the GEO Group, a Major Trump Donor, Over Its Misuse of Harmful Disinfectant in an ICE Facility** **EPA Drops Legal Case Against the GEO Group, a Major Trump Donor, Over Its Misuse of Harmful Disinfectant in an ICE Facility** Local Police Join ICE Deportation Force in Record Numbers Despite Warnings Program Lacks Oversight **Local Police Join ICE Deportation Force in Record Numbers Despite Warnings Program Lacks Oversight** **Local Police Join ICE Deportation Force in Record Numbers Despite Warnings Program Lacks Oversight** **Latest Stories from ProPublica** **ProPublica Opens Application for Five New Local Partners to Join Its 50 State Initiative** **Senators Demand Transparency on Canceled Veterans Affairs Contracts** **Portland Spent $1.3 Billion to Improve the Lives and Safety of Its Homeless People. Then Deaths Quadrupled.** **Former Chicago Cop Pleads Guilty to Aggravated Battery of Two Female Colleagues** **Republish This Story for Free** Creative Commons License (CC BY-NC-ND 3.0) **** Thank you for your interest in republishing this story. You are are free to republish it so long as you do the following: You have to creditProPublica and any co-reporting partners. In the byline, we prefer “Author Name, Publication(s).” At the top of the text of your story, include a line that reads: “This story was originally published by ProPublica.” You must link the word “ProPublica” to the original URL of the story. If you’re republishing online, you must link to the URL of this story on propublica.org, include all of the links from our story, including our newsletter sign up language and link, and use ourPixelPing tag. If you use canonical metadata, please use the ProPublica URL. For more information about canonical metadata,refer to this Google SEO link. You can’t edit our material, except to reflect relative changes in time, location and editorial style. (For example, “yesterday” can be changed to “last week,” and “Portland, Ore.” to “Portland” or “here.”) You cannot republish our photographs or illustrations without specific permission. Please contact[email protected]. It’s okay to put our stories on pages with ads, but not ads specifically sold against our stories. You can’t state or imply that donations to your organization support ProPublica’s work. You can’t sell our material separately or syndicate it. This includes publishing or syndicating our work on platforms or apps such as Apple News, Google News, etc. You can’t republish our material wholesale, or automatically; you need to select stories to be republished individually. (To inquire about syndication or licensing opportunities, contact[email protected].) You can’t use our work to populate a website designed to improve rankings on search engines or solely to gain revenue from network-based advertisements. We do not generally permit translation of our stories into another language. Any website our stories appear on must include a prominent and effective way to contact you. Copy and paste the following into your page to republish: Graphics & Data Topics Series Videos Impact ProPublica Local Initiatives Data Store Follow Us: Like us on Facebook Follow us on Twitter **Stay informed with the Daily Digest.** **Site Navigation** **Sections** ProPublica Local Reporting Network Texas Tribune Partnership The Data Store Electionland **Browse by Type** Topics Series Videos News Apps Get Involved The Nerd Blog @ProPublica Events **Info** About Us Board and Advisors Officers and Staff Diversity JobsandFellowships Local Initiatives Media Center Reports Impact Awards Corrections **Policies** Code of Ethics Advertising Policy Privacy Policy **Follow** Newsletters Podcast iOSandAndroid RSS Feed **More** Send Us Tips Steal Our Stories Browse via Tor Contact Us Donate More Ways to Give Journalism in the Public Interest"}