{"id": 1136, "name": "Prism", "domain": "prismreports.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://prismreports.org/2025/06/09/new-york-city-faces-loss-of-over-40-million-for-hiv-prevention/", "title": "New York City Faces Loss Of Over 40 Million For Hiv Prevention", "content": "**Collective liberation requires collective action.** Sign up for Prism’s newsletter to get first access to news and analysis that makes you think—and act. Developed alongside people on the frontlines of injustice, Prism will help deepen your understanding on the most pressing issues of our time. By clicking submit, you agree to share your email address with Prism to receive our newsletter, updates, and other emails. Use the unsubscribe link in those emails to opt out at any time. Subscribe Donate Race Economy & Workers’ Rights Gender & LGBTQIA+ Immigration Crime, Reform & Abolition Politics & Democracy Climate & Environment Education Health Opinion Disability Justice Movement Media Alliance Right to Write Project Bluesky Facebook Instagram **About** Mission & Vision Who We Are Ways to GiveMembershipOur Supporters Membership Our Supporters Membership Our Supporters Jobs Pitch Prism Code of Ethics Distribution Guidelines Community Guidelines Events Right to Write Project Reflective Journalism Project **Focus** Politics & Democracy Crime, Reform & Abolition Immigration Race Gender & LGBTQIA+ Economy & Workers’ Rights Climate & Environment Education Health Highlights **Sections** News Features Opinion Explainers Opinion Disability Justice Movement Media Alliance Right to Write Project Bluesky Facebook Instagram Prism Justice Requires the Full Story Subscribe Donate Race Economy & Workers’ Rights Gender & LGBTQIA+ Immigration Crime, Reform & Abolition Politics & Democracy Climate & Environment Education Health **New York City faces loss of over $40 million for HIV prevention services as federal budget proposes deep cuts** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Across New York City, $40 million in funding previously earmarked for HIV services is up in the air amid President Donald Trump’s proposed federal funding cuts to health services. The proposed cuts come as the city has seen arising numberof HIV diagnoses in recent years, particularly among Black and Latinx New Yorkers. Threats to funding would devastate a carefully calibrated ecosystem of care established by the city, community organizations, and local clinics, advocates say. Trump’s full federal funding proposal, which was released on May 30, would eliminate allRyan WhitePart F funding, which aims to expand access to HIV services in minority communities and supports oral care for people with HIV, among other initiatives. The federal proposal would also eliminate the Housing Opportunities for Persons With AIDS (HOPWA) program. New York City has consistently received annual grants of over $40 million from the HOPWA program. Trump’sproposed budgetwould allow state and local governments seeking housing assistance funding to apply for an emergency solutions grant program, which has a proposed$3.2 billion budget—more than 10 times higher than previous years. But the end of HOPWA stands to imperil a steady source of funding for New York City’s HIV/AIDS Services Administration (HASA), which provides housing, intensive case management, financial and transportation assistance, and more to low-income residents with HIV diagnoses. “If you think about social determinants of health, having a home is a pretty major social determinant,” said Marya Gilborn, co-chair of the New York City HIV Planning Council’s Priority Setting and Resource Allocation (PSRA) Committee. “Not having a house is a pretty good indicator that your HIV is not going to be well managed, and so having housing is an important health intervention for people living with HIV.” New York City has also received funding through its cooperative agreement with the Centers for Disease Control and Prevention (CDC) for HIV prevention and surveillance and through a CDC initiative called “Ending the HIV Epidemic in the US” (EHE). In 2024, the city received $35 million from the CDC through its agreement and EHE funding. Though Trumpinitially proposedto end the EHE initiative entirely in a version of the proposed federal budget leaked in early May, it is now being transferred to his proposed Administration for a Healthy America. It remains unclear how funding would be distributed. Though EHE has never been a sole funding source for HIV prevention and testing in New York City, the future of this funding is now also uncertain. In 2023, 1,686 city residentswere newly diagnosedwith HIV, a 7.6% uptick from 2022, according to the city’s Department of Health and Mental Hygiene. Of the new cases, 83% were Black and Latinx New Yorkers, whoexperience inequitiesin accessing medical care for HIV. HASA and other community organizations serve low-income New York City residents who would otherwise struggle with access to HIV care and prevention services. These organizations have played a critical role in facilitating access to care for Black and Latinx residents. New York City also stands to lose at least $9 million if Ryan White Part F funding is eliminated. This section of the federal health care grant program for people with HIV includes the Minority Aids Initiative (MAI), a program providing funds for communities with large minority populations who have AIDS. New York City received close to $8 million through MAI funding last year, and New York organizations received over $1 million through Ryan White Part F dental grants. According to Gilborn, these funding cuts will likely impact HIV prevention services the most. The PSRA manages the administration of Ryan White Part A funding, provided to eligible cities with high numbers of reported AIDS cases, in New York City. In previous years, the committee developed contingency plans to prepare for a potential 5% loss in Ryan White Part A funding. This year, it’s developing contingencies for an 11% funding reduction—up to $10 million of New York City’s allocation of $92 million—with a recognition that the loss may be much worse, Gilborn said. If these cuts are implemented, early intervention services and HIV testing are likely to be among the first programs to be cut, since most people are offered HIV testing through their primary care, Gilborn said. The Lesbian, Gay, Bisexual, and Transgender Community Center, based in the West Village neighborhood, is also facing uncertainty surrounding the continuation of its grants and services. The Center’s small HIV services team spearheads both HIV testing and sexual health education outreach, serving people of all ages and connecting them with local clinics. But according to Natasha Jones, senior director of community programs, the Center has a federal grant that is set to end in August “with no hope of renewal.” The organization is facing layoffs and a loss of funding that supports the Center’s HIV and AIDS testing services. However, a Center spokesperson told Prism that the organization was “committed to continuing this work as it is core to our mission.” Lyndel Urbano, the senior director of public policy and government relations at Amida Care, which provides health coverage to people with HIV and other conditions, told Prism that the loss of funding for HIV prevention services would be costly. “We know that preventing HIV is both cost-effective but also results in better health,” he said. “So if we’re able to reach people before they get HIV positive and give them access to tools that they can use [for] prevention in the long run, we end up really averting … long-term costs.” These cuts to funding have coincided with an expansive proposed cut to Medicare, which was the largest insurer of HIV-positive patients in the U.S., according to Jeremiah Johnson, executive director of Prep4All, a campaign to increase access to HIV medication. Ananalysissubmitted by New York City while applying for Ending the Epidemic funding in 2020 found that Medicaid covered $2.2 billion in health care costs related to HIV for New Yorkers that year. Medicaid funding cuts arepoised to devastatehealth care access in New York, particularly for low-income people of color. “We cannot afford to retreat in our fight to end the HIV epidemic,” Kimberleigh Smith, executive vice president of Callen-Lorde Community Health Center, which serves the Manhattan neighborhood of Chelsea, Brooklyn, and the Bronx, wrote in an email statement to Prism. “We must maintain access to Medicaid, and New York City and New York State leadership must fight for HIV prevention and treatment funding and services at local, state, and federal levels.” Editorial Team:Sahar Fatima, Lead EditorCarolyn Copeland, Top EditorStephanie Harris, Copy Editor **Related** **Surina Venkat** Surina Venkat is a city news staff writer at the Columbia Daily Spectator. Follow her on X at @surinavenkat.More by Surina Venkat Race (923) Politics & Democracy (681) Crime, Reform & Abolition (516) Gender & LGBTQIA+ (506) Economy & Workers' Rights (378) News (1,194) Feature (357) racial justice (261) COVID-19 (227) criminal legal system (187) 2025 (210) 2024 (440) 2023 (371) 2022 (423) 2021 (386) **Our Latest Stories** Mental health calls to police can be deadly, but alternatives remain underfundedJune 11th, 2025 EXCLUSIVE: Is the ‘tech bro-ification’ of abortion here?June 11th, 2025 Supreme Court could decide if disabled people must meet a higher standard in discrimination casesJune 11th, 2025 Immigration, LGBTQIA+ rights in schools, and government power: Five Supreme Court cases to watch this monthJune 10th, 2025 ‘They feel that this could happen at any time’: Deportation fears worsen a growing migrant mental health crisisJune 10th, 2025 Trump’s new travel ban goes into effectJune 9th, 2025 Sign up for our newsletter to get updates that make you think and act—directly to your inbox. By clicking submit, you agree to share your email address with the site owner and Mailchimp to receive marketing, updates, and other emails from the site owner. Use the unsubscribe link in those emails to opt out at any time. Race (923) Politics & Democracy (681) Crime, Reform & Abolition (516) Gender & LGBTQIA+ (506) Economy & Workers' Rights (378) News (1,194) Feature (357) racial justice (261) COVID-19 (227) criminal legal system (187) 2025 (210) 2024 (440) 2023 (371) 2022 (423) 2021 (386) Bluesky Facebook Instagram **Sections** News Features Opinion Explainers **Focus** Politics & Democracy Crime, Reform & Abolition Immigration Race Gender & LGBTQIA+ Economy & Workers’ Rights Climate & Environment Education Health Highlights **About** Mission & Vision Who We Are Ways to GiveMembershipOur Supporters Membership Our Supporters Membership Our Supporters Jobs Pitch Prism Code of Ethics Distribution Guidelines Community Guidelines Events Right to Write Project Reflective Journalism Project"}