{"id": 750, "name": "KGW - Portland News", "domain": "kgw.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kgw.com/article/syndication/smart-deals/stackcommerce/excel-at-work-by-supercharging-your-pc-with-microsoft-office-and-windows-11-pro-for-less-than-50/608-b76cb1ea-0466-4725-96a8-68d1a63082eb", "title": "Excel At Work By Supercharging Your Pc With Microsoft Office And Windows 11 Pro For Less Than 50", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalPDXtodayHello, Rose City!KGW InvestigatesNear MeHealthThe StoryNation WorldPoliticsLifeCommunityEntertainmentLatest News StoriesOne more chance to see record full strawberry moon. Here's what to know and how it will lookMan arrested in connection with drive-by shooting near Vancouver elementary school Back Local PDXtoday Hello, Rose City! KGW Investigates Near Me Health The Story Nation World Politics Life Community Entertainment One more chance to see record full strawberry moon. Here's what to know and how it will look Man arrested in connection with drive-by shooting near Vancouver elementary school Back Local PDXtoday Hello, Rose City! KGW Investigates Near Me Health The Story Nation World Politics Life Community Entertainment One more chance to see record full strawberry moon. Here's what to know and how it will look Man arrested in connection with drive-by shooting near Vancouver elementary school WeatherBackForecastRadar10-DayHourlyMapsClosings & DelaysTrafficWeather camsLatest Weather StoriesCooling trend takes us into the weekendPortland Public Schools, other schools in metro area release students early Monday amid 'extreme heat' Back Forecast Radar 10-Day Hourly Maps Closings & Delays Traffic Weather cams Cooling trend takes us into the weekend Portland Public Schools, other schools in metro area release students early Monday amid 'extreme heat' Back Forecast Radar 10-Day Hourly Maps Closings & Delays Traffic Weather cams Cooling trend takes us into the weekend Portland Public Schools, other schools in metro area release students early Monday amid 'extreme heat' SportsBackHigh School SportsSeattle KrakenBlazersBeaversTimbersThornsDucksMarinersSeahawksWinterhawksLocked On Podcast NetworkLatest StoriesFemale athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination lawFemale athletes appeal NCAA settlement, cite Title IX disparityLandmark NCAA settlement challenged by 8 female athletesFemale athletes appeal NCAA settlement, citing $1.1 billion Title IX shortfallBlazers add 3 assistants with championship experience to Chauncey Billups' coaching staff Back High School Sports Seattle Kraken Blazers Beavers Timbers Thorns Ducks Mariners Seahawks Winterhawks Locked On Podcast Network Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination lawFemale athletes appeal NCAA settlement, cite Title IX disparityLandmark NCAA settlement challenged by 8 female athletesFemale athletes appeal NCAA settlement, citing $1.1 billion Title IX shortfall Blazers add 3 assistants with championship experience to Chauncey Billups' coaching staff Back High School Sports Seattle Kraken Blazers Beavers Timbers Thorns Ducks Mariners Seahawks Winterhawks Locked On Podcast Network Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination lawFemale athletes appeal NCAA settlement, cite Title IX disparityLandmark NCAA settlement challenged by 8 female athletesFemale athletes appeal NCAA settlement, citing $1.1 billion Title IX shortfall Blazers add 3 assistants with championship experience to Chauncey Billups' coaching staff SearchSearch:Search ADVERTISE WITH US YOUR PHOTOS KGW INVESTIGATES THE STORY HELLO, ROSE CITY! GOOD ENERGY FRESH FROM OREGON HEALTHIER TOGETHER LET'S GET OUT THERE PACIFIC STORYLAND WHAT'S IN A NAME? SOLUTIONS PROJECT CLIMATE CRISIS SUNRISE MEET THE TEAM TV LISTINGS **'Excel' at work by supercharging your PC with Microsoft Office and Windows 11 Pro for less than $50** Credit: Microsoft This station earns commissions on purchases made through the link(s) on this page. TL;DR:Supercharge your PC with this 2-for-1 dealfor Microsoft Office 2019 and Windows 11 Pro, now over 80% off. Be honest with us. When was the last time you gave your PC an upgrade? If you can’t remember, your device is definitely due for a performance and productivity upgrade. You’ve waited long enough, and luckily, the best PC upgrade has just arrived—you can getWindows 11 Pro and Microsoft Office 2019for only $45.97 (reg. $428) for life. With the latest OS, you might just make your PC feel like new again, thanks to the sleek and redesigned UI for easy navigation, improved voice typing feature, and innovative security measures like BitLocker device encryption and Smart App Control. The best part? You’ll even score Copilot, Windows 11 Pro’s newintelligent AI assistant that’s powered by GPT-4 Turbo(which could also streamline your day. And don’t forget—you’re also getting Microsoft Office 2019, meaning you’ll have lifelong access to classic Microsoft apps like Word, Excel, PowerPoint, Outlook, OneNote, Publisher, and Access. You might just check off your work (or personal) to-do list even faster with these productivity tools at your side. Ready to upgrade your PC with the best 2-for-1 Microsoft deal? Grablifetime licenses to Windows 11 Pro and Microsoft Office 2019for just $45.97 while downloads are still available. This offer only lasts a little while longer. The All-in-One Microsoft Office Pro 2019 for Windows: Lifetime License + Windows 11 Pro Bundle See Deal StackSocialprices subject to change. StackSocialworks with a variety of merchants and brands to bring you deals worth talking about. We partner with affiliates to bring exclusive and lifetime offers to readers worldwide, helping consumers discover over five million products and counting. **** To stream KGW on your phone, you need the KGW app. **** **Download the KGW app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video In Other News **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}