{"id": 1586, "name": "Winchester Sun", "domain": "winchestersun.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://winchestersun.com/2025/06/03/jobs-for-americas-graduates-class-gets-a-first-hand-look-at-police-helicopter/", "title": "Jobs For Americas Graduates Class Gets A First Hand Look At Police Helicopter", "content": "Home E-Edition News Obituaries Sports Opinion Records Contests Services Classifieds Public Notices Calendar Home NewsFeaturesOpinion Features Opinion Features Opinion Sports Obituaries Records Contests ServicesAbout UsPoliciesSubmit a News TipSubmit a PhotoSubmit a Sports StoryLetters to EditorPay Subscription About Us Policies Submit a News Tip Submit a Photo Submit a Sports Story Letters to Editor Pay Subscription About Us Policies Submit a News Tip Submit a Photo Submit a Sports Story Letters to Editor Pay Subscription Classifieds Calendar Public Records E-Edition **Jobs for America’s Graduates class gets a first-hand look at police helicopter** Published 12:30 pm Tuesday, June 3, 2025 ByMatt Cizek If one thinks back to their middle school days, they might recall certain days when professionals spoke with them about potential careers. Before the 2024-25 school year ended, the Jobs for America’s Graduate (JAG) class at Robert D. Campbell Junior High School was treated to such an opportunity in a big way. A Kentucky State Police (KSP) helicopter was flown onto the outdoor lawn for all to experience, with its pilot speaking to students. **Email newsletter signup** “We are all about connecting with partners, and this is just another example with us and Kentucky State Police….really [educating] kids on possibilities including being a state policeman that flies helicopters and rescues and goes on missions,” said Clark County Public Schools Superintendent Dustin Howard. “We’re about engaging our kids in the learning process.” Standing outside the school early in the afternoon, one could hear the hovering sound of an aircraft as it descended from the sky. With plenty of distance maintained between themselves and the helicopter operated by KSP, it landed on the track just outside the school, to the excitement of many of the youths. Brad Austin, the pilot of the aircraft with the Kentucky State Police, stepped out and, while also taking questions from interested students, delivered various information. Among the facts he provided to students were information about how helicopters are used to assist in search and rescue operations, different types of aircraft, and the costs involved – with the newest piece of machinery estimated at approximately $8 million. “All our trooper pilots start as patrol officers…we all have to do three years there, and then we’re able to move around in this certain specialized position,” Austin said. “We provide law enforcement [responses] to all 12 counties [and] we have working relationships in Tennessee and Indiana, Virginia, [and] West Virginia.” Taylor Howard, a teacher of the JAG program at Robert D. Campbell Junior High School (RDC), mentioned that many career pathways have been mentioned to students throughout the year. “I thought this was a really good opportunity for something to close out the year on a positive note,” he said. “[It’s] another good guest speaker and another good career opportunity pathway for kids to learn about that would…be in the realm of possibilities for them and something they can show a lot of interest in.” **Featured Local Savings** **You Might Like** **Howard honored by community** **Howard honored by community** **Dotson kicks off campaign with event** **Dotson kicks off campaign with event** **Suspect sought in Clark County death investigation** **Suspect sought in Clark County death investigation** **GRC girls basketball to host Cardinal Classic** **GRC girls basketball to host Cardinal Classic** Home News Sports Obituaries Opinion Public Records Contests Classifieds Small Business E-Edition Subscriptions Submit a News Tip Submit a Photo Submit a Sports Story Letters to Editor About Us"}