{"id": 1324, "name": "Talking Points Memo", "domain": "talkingpointsmemo.com", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://talkingpointsmemo.com/news/passing-big-beautiful-bill-would-mean-effectively-dismantling-obamacare-gutting-inflation-reduction-act", "title": "Passing Big Beautiful Bill Would Mean Effectively Dismantling Obamacare Gutting Inflation Reduction Act", "content": "Editors' Blog/Analysis & Opinion News Live Blog Morning Memo Cafe/outside voices & analysis Muckraker/scandal & investigations Prime/Member Exclusives Podcast Features about contact careers FAQ terms of use site status **Passing Big Beautiful Bill Would Mean ‘Effectively Dismantling’ Obamacare, Gutting Inflation Reduction Act** The massive budget bill that Republicans are currently negotiating in the Senate would do considerable damage to two of the most significant Democratic legislative victories of the last two decades: Obamacare and the Inflation Reduction Act. Neither party is eager to talk about the impact of the “One Big Beautiful Bill Act” in this way — Democrats prefer to focus on the effect the bill will have on Americans, while Republicans have downplayed the ways in which the legislation will upend the status quo. Yet it remains the case that the legislation would gut defining policies of the Biden and Obama administrations. House Republicans included massive cuts to federal safety net programs, like Medicaid, in the reconciliation package they passed in May. Many of the cuts they shoved into the bill directly target the Medicaid expansion population — the group that received eligibility for health care coverage under the Affordable Care Act’s Medicaid expansion. While Republicans are covering their sweeping, drastic cuts to the social safety net program with misleading rhetoric about targeting supposed “waste, fraud and abuse,” the cuts ultimately add up to a back handed GOP effort to repeal Obamacare as we know it. It’s a goal congressional Republicans have tried and failed at many times before, including during the first Trump administration when the House passed an Obamacare repeal bill in 2017, but Senate Republicans “skinny repeal” efforts were tanked by the late Sen. John McCain (R-AZ). Since that largely unpopular Obamacare dismantling scheme failed, the repeal efforts have grown much quieter with Republicans targeting the program without saying they areactuallyrepealing the ACA. This time around, even though congressional Republicans are not defining their efforts and proposed cuts to Medicaid in the reconciliation bill as repealing Obamacare, experts and Senate Democrats warn the cuts will do just that — dealing a substantial blow to the program and the millions who rely on it. “Republicans are effectively dismantling the Affordable Care Act,” Sen. Ron Wyden (D-OR), ranking member of the Senate Finance Committee, the panel in charge of changes to the healthcare program, said in astatementlast week. “Americans do not want to go back to the days where health care was reserved for the healthy and the wealthy, where insurance companies had free rein to discriminate against sicker or older Americans.” When asked about the issue on Tuesday, Wyden told TPM: “There is no question that the House and the Senate are very hostile to the Affordable Care Act provisions that were added over the years.” But Obamacare is not the only major Democratic legislative victory Republicans are trying to target in their so-called “One Big Beautiful Bill Act.” The House-passed reconciliation package also targets the Biden-era clean energy tax credits that were a major part of the Inflation Reduction Act, the largest piece of legislation directly addressing climate change in the history of the country, experts tell TPM. Sen. Elizabeth Warren (D-MA), another member of the Senate Finance Committee, told TPM Republicans plans add up to rolling back parts of both programs. “It clearly is,” Warren told TPM when asked if she thinks the cuts to Medicaid and clean energy tax credits are effectively repealing parts of Obamacare and the IRA. But Warren emphasized: “It’s less important what part of the legislation is getting rolled back, and more important who will get hurt. These Republican cuts are about taking away health care from a total of 16 million Americans and making life harder for everyone who hopes to breathe clean air or drink clean water.” Sen. Mark Warner (D-VA) also emphasized the impacts of effectively repealing Obamacare and rescinding the clean energy tax credits in the IRA would have on his state. “I can tell you in my state, this awful bill will add to 300,000 Virginians losing health care,” Warner told TPM on his way up to a floor vote Tuesday. “And we have a large number of projects, disproportionately in areas that voted for President Trump, that rolling back the IRA will completely destroy.” Fair Share America, an organization that is working across dozens of states to educate and organize the American public against the GOP’s reconciliation bill, told TPM that they are focusing on helping people see how the cuts will affect them and their communities. They are trying to help voters see that Republicans’ cuts will increase the cost of living as medical bills and energy bills, among other things, will go up if the bill becomes law. “We’ve been door knocking in eight different states, and the American public understands that this is what’s at stake — that 15 million Americans have their health care in jeopardy,” Kristen Crowell, executive director of Fair Share America, told TPM. “And they are angry and they are scared and they do not want this bill to move forward.” Though it varies “location by location” the cuts to the clean energy tax credit is also receiving major pushback on the ground, especially from Trump voters who are in districts that benefited from the incentives in the IRA Crowell said. “There are small towns across the country, where you can point to the investments that were made by the IRA components of this and point to new jobs that were created in small towns that were really desperate for economic investment and new jobs, they very much understand it,” Crowell told TPM. Passing Big Beautiful Bill Would Mean ‘Effectively Dismantling’ Obamacare, Gutting Inflation Reduction ActByEmine Yücel|June 11, 2025 3:23 p.m.The massive budget bill that Republicans are currently negotiating in the Senate would do considerable damage to two of the… The massive budget bill that Republicans are currently negotiating in the Senate would do considerable damage to two of the… The massive budget bill that Republicans are currently negotiating in the Senate would do considerable damage to two of the… Trump Admin Returns Abrego Garcia—To Face New Criminal ChargesByDavid Kurtz|June 6, 2025 3:23 p.m.The Trump administration is finally abiding by a court order and returning the wrongfully deported Kilmar Abrego Garcia to the… The Trump administration is finally abiding by a court order and returning the wrongfully deported Kilmar Abrego Garcia to the… The Trump administration is finally abiding by a court order and returning the wrongfully deported Kilmar Abrego Garcia to the… Senate GOP Sorts Out Which Poison Pills It Can Swallow To Pass House’s ‘Big Beautiful’ BillByEmine Yücel|June 6, 2025 10:16 a.m.Senate Republicans began the work this week of deciphering what exactly House Republicans’ have stuffed into President Trump’s massive spending… Senate Republicans began the work this week of deciphering what exactly House Republicans’ have stuffed into President Trump’s massive spending… Senate Republicans began the work this week of deciphering what exactly House Republicans’ have stuffed into President Trump’s massive spending… DOGE Developed Error-Prone AI Tool To ‘Munch’ Veterans Affairs ContractsByBrandon Roberts,Vernal ColemanandEric Umansky|June 6, 2025 9:36 a.m.This story first appeared at ProPublica. ProPublica is a Pulitzer Prize-winning investigative newsroom. Sign up for The Big Story newsletter… This story first appeared at ProPublica. ProPublica is a Pulitzer Prize-winning investigative newsroom. Sign up for The Big Story newsletter… This story first appeared at ProPublica. ProPublica is a Pulitzer Prize-winning investigative newsroom. Sign up for The Big Story newsletter… Make a Comment See Full Discussion Top Discussions **Notable Replies** jmacazsays:June 11, 2025Will the Senate do the right thing?DSCN69151920×1440 160 KBUkko doesn’t think so. Given that the senate now tilts Republican 54 Democrats 46. (I count Fetterman as Republican now.)Our best hope is that the Senate makes enough changes so that the bill has to go back to the house, and those fools never pass anything.The BBB is really the Boost Billionaires Bill; because the don’t currently have enough. Will the Senate do the right thing? Ukko doesn’t think so. Given that the senate now tilts Republican 54 Democrats 46. (I count Fetterman as Republican now.) Our best hope is that the Senate makes enough changes so that the bill has to go back to the house, and those fools never pass anything. The BBB is really the Boost Billionaires Bill; because the don’t currently have enough. Will the Senate do the right thing? Ukko doesn’t think so. Given that the senate now tilts Republican 54 Democrats 46. (I count Fetterman as Republican now.) Our best hope is that the Senate makes enough changes so that the bill has to go back to the house, and those fools never pass anything. The BBB is really the Boost Billionaires Bill; because the don’t currently have enough. jrwsays:June 11, 2025Poorer, sicker, dumber; that’s the Trump agenda for the country. Poorer, sicker, dumber; that’s the Trump agenda for the country. Poorer, sicker, dumber; that’s the Trump agenda for the country. sonsofaressays:June 11, 2025I’m starting to suspect that elections have consequences. I’m starting to suspect that elections have consequences. I’m starting to suspect that elections have consequences. fiftygigssays:June 11, 2025[jobs] created in small towns that were really desperateTrump, Miller, Bondi and Noem are taking on the United Statescitythat has more people than most of ourstates. Do Republican votersreallybelieve Republicans care about rural matters? That’s for the locality to handle.Republican politicians will step in if there’s any infants in the area to deport, or if laws are needed to help donors hoover up every loose dime before the town turns to dust. [jobs] created in small towns that were really desperate Trump, Miller, Bondi and Noem are taking on the United Statescitythat has more people than most of ourstates. Do Republican votersreallybelieve Republicans care about rural matters? That’s for the locality to handle. Republican politicians will step in if there’s any infants in the area to deport, or if laws are needed to help donors hoover up every loose dime before the town turns to dust. [jobs] created in small towns that were really desperate Trump, Miller, Bondi and Noem are taking on the United Statescitythat has more people than most of ourstates. Do Republican votersreallybelieve Republicans care about rural matters? That’s for the locality to handle. Republican politicians will step in if there’s any infants in the area to deport, or if laws are needed to help donors hoover up every loose dime before the town turns to dust. thebishopsays:June 11, 2025It takes real courage to kill the poor, and some getting used to as well. Elon showed you how it’s done. Get doped to the gills like the Hashshashin and don’t give it another thought. Just do it, and it gets easier the more you do it. It takes real courage to kill the poor, and some getting used to as well. Elon showed you how it’s done. Get doped to the gills like the Hashshashin and don’t give it another thought. Just do it, and it gets easier the more you do it. It takes real courage to kill the poor, and some getting used to as well. Elon showed you how it’s done. Get doped to the gills like the Hashshashin and don’t give it another thought. Just do it, and it gets easier the more you do it. **Continue the discussion atforums.talkingpointsmemo.com** 10 more replies Josh Marshall John Light Nicole Lafond David Kurtz Josh Kovensky Hunter Walker Kate Riga Emine Yücel Khaya Himmelman John B. Judis Joe Ragazzo Derick Dirmaier Matt Wozniak Jackie Wilhelm Jacob Harris Christine Frapech About Memberships Careers Advertise Site Status Privacy Policy FAQ Newsletters Pitch Us Contact Terms of Use CCPA Notice"}