{"id": 254, "name": "Center for a New American Security", "domain": "cnas.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.cnas.org/press/in-the-news/how-the-u-s-could-be-vulnerable-to-the-same-kind-of-drone-swarm-attack-ukraine-unleashed-on-russias-bomber-fleet", "title": "How The U S Could Be Vulnerable To The Same Kind Of Drone Swarm Attack Ukraine Unleashed On Russias Bomber Fleet", "content": "**CNN values your feedback** Settings Newsletters Topics you follow Sign out Settings Newsletters Topics you follow Sign out US International Arabic Español USCrime + Justice Crime + Justice Crime + Justice WorldAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited Kingdom Africa Americas Asia Australia China Europe India Middle East United Kingdom Africa Americas Asia Australia China Europe India Middle East United Kingdom PoliticsTrumpFacts FirstCNN Polls2025 Elections Trump Facts First CNN Polls 2025 Elections Trump Facts First CNN Polls 2025 Elections BusinessTechMediaCalculatorsVideos Tech Media Calculators Videos Tech Media Calculators Videos MarketsPre-marketsAfter-HoursFear & GreedInvestingMarkets NowNightcap Pre-markets After-Hours Fear & Greed Investing Markets Now Nightcap Pre-markets After-Hours Fear & Greed Investing Markets Now Nightcap HealthLife, But BetterFitnessFoodSleepMindfulnessRelationships Life, But Better Fitness Food Sleep Mindfulness Relationships Life, But Better Fitness Food Sleep Mindfulness Relationships EntertainmentMoviesTelevisionCelebrity Movies Television Celebrity Movies Television Celebrity TechInnovateForeseeable FutureMission: AheadWork TransformedInnovative Cities Innovate Foreseeable Future Mission: Ahead Work Transformed Innovative Cities Innovate Foreseeable Future Mission: Ahead Work Transformed Innovative Cities StyleArtsDesignFashionArchitectureLuxuryBeautyVideo Arts Design Fashion Architecture Luxury Beauty Video Arts Design Fashion Architecture Luxury Beauty Video TravelDestinationsFood & DrinkStayVideos Destinations Food & Drink Stay Videos Destinations Food & Drink Stay Videos SportsPro FootballCollege FootballBasketballBaseballSoccerOlympicsHockey Pro Football College Football Basketball Baseball Soccer Olympics Hockey Pro Football College Football Basketball Baseball Soccer Olympics Hockey ScienceSpaceLifeUnearthed Space Life Unearthed Space Life Unearthed ClimateSolutionsWeather Solutions Weather Solutions Weather WeatherVideoClimate Video Climate Video Climate Ukraine-Russia War Israel-Hamas War WatchLive TVCNN HeadlinesCNN ShortsShows A-ZCNN10CNN MaxCNN TV SchedulesFlashDocs Live TV CNN Headlines CNN Shorts Shows A-Z CNN10 CNN Max CNN TV Schedules FlashDocs Live TV CNN Headlines CNN Shorts Shows A-Z CNN10 CNN Max CNN TV Schedules FlashDocs ListenCNN 5 ThingsChasing Life with Dr. Sanjay GuptaThe Assignment with Audie CornishOne ThingTug of WarCNN Political BriefingThe Axe FilesAll There Is with Anderson CooperAll CNN Audio podcasts CNN 5 Things Chasing Life with Dr. Sanjay Gupta The Assignment with Audie Cornish One Thing Tug of War CNN Political Briefing The Axe Files All There Is with Anderson Cooper All CNN Audio podcasts CNN 5 Things Chasing Life with Dr. Sanjay Gupta The Assignment with Audie Cornish One Thing Tug of War CNN Political Briefing The Axe Files All There Is with Anderson Cooper All CNN Audio podcasts CNN UnderscoredElectronicsFashionBeautyHealth & FitnessHomeReviewsDealsGiftsTravelOutdoorsPets Electronics Fashion Beauty Health & Fitness Home Reviews Deals Gifts Travel Outdoors Pets Electronics Fashion Beauty Health & Fitness Home Reviews Deals Gifts Travel Outdoors Pets GamesDaily CrosswordJumble CrosswordSudoblockSudoku5 Things Quiz Daily Crossword Jumble Crossword Sudoblock Sudoku 5 Things Quiz Daily Crossword Jumble Crossword Sudoblock Sudoku 5 Things Quiz About CNNSubscribePhotosInvestigationsCNN ProfilesCNN LeadershipCNN NewslettersWork for CNN Subscribe Photos Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN Subscribe Photos Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN **How the US could be vulnerable to the same kind of drone swarm attack Ukraine unleashed on Russia’s bomber fleet** Follow: Ukraine’sshock drone strikeon Russia’s strategic bomber fleet this week has generals and analysts taking a new look at threats to high-value United States aircraft at bases in the homeland and abroad – and the situation is worrisome. “It’s an eyebrow-raising moment,” Gen. David Allvin, the US Air Force chief of staff, said at a defense conference in Washington on Tuesday, adding that the US is vulnerable to similar attacks. “There is no sanctuary even in the US homeland – particularly given that our bases back home are essentially completely unhardened,” Thomas Shugart, an adjunct senior fellow at the Center for a New American Security (CNAS), told CNN. By “unhardened,” Shugart means there aren’t enough shelters in which US warplanes can be parked that are tough enough to protect them from airstrikes, be it from drones or missiles. Related articleUkraine’s drone attack the latest in a series of daring David versus Goliath hits against Russian targets Related articleUkraine’s drone attack the latest in a series of daring David versus Goliath hits against Russian targets Ukrainian military officials said 41 Russian aircraft were hit in last Sunday’s attacks, including strategic bombers and surveillance planes, with some destroyed and others damaged. Later analysis shows at least 12 planes destroyed or damaged, and reviews of satellite imagery were continuing. The Ukrainian operation used drones smuggled into Russian territory, hidden in wooden mobile houses atop trucks and driven close to four Russian air bases, according to Ukrainian sources. Once near the bases, the roofs of the mobile houses were remotely opened, and the drones deployed to launch their strikes. The Russian planes were sitting uncovered on the tarmac at the bases, much as US warplanes are at facilities at home and abroad. “We are pretty vulnerable,” retired US Army Gen. Stanley McChrystal told CNN’s Anderson Cooper on Tuesday. “We’ve got a lot of high-value assets that are extraordinarily expensive,” McChrystal said. The Ukrainians said their attacks destroyed $7 billion worth of Russian aircraft. By comparison, a single US Air Force B-2 bomber costs $2 billion. And the US has only 20 of them. Shugart co-authoreda report for the Hudson Institutein January highlighting the threat to US military installations from China in the event of any conflict between the superpowers. “People’s Liberation Army (PLA) strike forces of aircraft, ground-based missile launchers, surface and subsurface vessels, and special forces can attack US aircraft and their supporting systems at airfields globally, including in the continental United States,” Shugart and fellow author Timothy Walton wrote. War game simulations and analyses show “the overwhelming majority of US aircraft losses would likely occur on the ground at airfields (and that the losses could be ruinous),” Shugart and Walton wrote. A report from Air and Space Forces magazine last year pointed out that Anderson Air Force Base on the Pacific island of Guam – perhaps the US’ most important air facility in the Pacific – which has hosted rotations of those $2 billion B-2 bombers, as well as B-1 and B-52 bombers, has no hardened shelters. Allvin, the USAF chief of staff, admitted the problem on Tuesday. “Right now, I don’t think it’s where we need to be,” Allvin told a conference of the CNAS. McChrystal said the US must look at how to protect its bases and the aircraft on them but also how it monitors the areas around those facilities. “It widens the spectrum of the threats you’ve got to deal with,” McChrystal said. **The cost of ‘playing defense’** But all that costs money, and Allvin said that presents the US with a budget dilemma. Does it spend defense dollars on hardened shelters and ways to stop drones and missiles from attacking US bases, or does it use more resources on offensive weapons that take the fight to the enemy? Related articleTrump wants an ‘Iron Dome’ over the US. But even a mini version in the Pacific is taking a while Related articleTrump wants an ‘Iron Dome’ over the US. But even a mini version in the Pacific is taking a while “If all we are doing is playing defense and can’t shoot back, then that’s not a good use of our money,” Allvin told the CNAS conference. “We’ve always known that hardening our bases is something we needed to do,” Allvin said, but other items have been given budget priority. Hardened aircraft shelters aren’t flashy and are unlikely to generate the headlines of other defense projects, including planes like the new B-21 bombers, each of which is expected to cost around $700 million. And US President Donald Trump said recently the Air Force will build a new stealth fighter,the F-47,with an initial cost of $300 million per aircraft. “The F-47 is an amazing aircraft, but it’s going to die on the ground if we don’t protect it,” Allvin said. Meanwhile, a hardened shelter costs around $30 million, according to Shugart and Walton. Last month Trump revealed another form of air defense for the US mainland, the Golden Dome missile shield, expected to cost at least $175 billion. Despite the huge price tag, it’s designed to counter long-range threats, like intercontinental ballistic missiles fired from a different hemisphere. **Vastness as a weakness** In Russia’s case, the vastness of its territory was seen as a strength in its war with Ukraine. One of the air bases hit in Ukraine’s Operation “Spiderweb” was closer to Tokyo than Kyiv. But now Russia’s size is a weakness, writes David Kirichenko onthe Ukraine Watch blogof the Atlantic Council. Every border crossing may be an infiltration point; every cargo container on every highway or rail line must be treated with suspicion. “This is a logistical nightmare,” Kirichenko said. And there is a direct analogy to the United States. US Air Force bomber bases are usually well inland, but accessible to vehicles large and small. For instance, all 20 B-2 bombers are stationed at Whiteman Air Force Base in Missouri. It’s about 600 miles from the nearest coastline, the Gulf of Mexico, but only about 25 miles south of Interstate 70, one of the main east-west traffic arteries in the US, with thousands of commercial vehicles passing by daily. Dyess Air Force Base in Texas, one of the homes of US B-1 bombers, sits just south of another major east-west commercial artery, Interstate 20. Related articleNew video of China’s tailless, triple-engine fighter jet has military aviation community buzzing Related articleNew video of China’s tailless, triple-engine fighter jet has military aviation community buzzing “Think of all the containers and illegal entrants inside our borders,” said Carl Schuster, a former director of operations at the US Pacific Command’s Joint Intelligence Center. “That connection will trigger alarm in some US circles,” he said. Meanwhile, in the Pacific, even better US offensive firepower, like Gen. Allvin would like to have, might not be enough in the event of a conflict with China. That’s because the PLA has made a concerted effort to protect its aircraft during its massive military buildup under leader Xi Jinping, according to the Hudson Institute report. China has more than 650 hardened aircraft shelters at airfields within 1,150 miles of the Taiwan Strait, the report says. But Shugart and Walton argue the best move Washington could make would be to make Beijing build more – by improving US strike capabilities in Asia. “In response the… PLA would likely continue to spend funds on additional costly passive and active defense measures and in turn would have less to devote to alternative investments, including strike and other power projection capabilities,” they said. Settings Newsletters Topics you follow Sign out USCrime + Justice Crime + Justice Crime + Justice WorldAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited Kingdom Africa Americas Asia Australia China Europe India Middle East United Kingdom Africa Americas Asia Australia China Europe India Middle East United Kingdom PoliticsTrumpFacts FirstCNN Polls2025 Elections Trump Facts First CNN Polls 2025 Elections Trump Facts First CNN Polls 2025 Elections BusinessTechMediaCalculatorsVideos Tech Media Calculators Videos Tech Media Calculators Videos MarketsPre-marketsAfter-HoursFear & GreedInvestingMarkets NowNightcap Pre-markets After-Hours Fear & Greed Investing Markets Now Nightcap Pre-markets After-Hours Fear & Greed Investing Markets Now Nightcap HealthLife, But BetterFitnessFoodSleepMindfulnessRelationships Life, But Better Fitness Food Sleep Mindfulness Relationships Life, But Better Fitness Food Sleep Mindfulness Relationships EntertainmentMoviesTelevisionCelebrity Movies Television Celebrity Movies Television Celebrity TechInnovateForeseeable FutureMission: AheadWork TransformedInnovative Cities Innovate Foreseeable Future Mission: Ahead Work Transformed Innovative Cities Innovate Foreseeable Future Mission: Ahead Work Transformed Innovative Cities StyleArtsDesignFashionArchitectureLuxuryBeautyVideo Arts Design Fashion Architecture Luxury Beauty Video Arts Design Fashion Architecture Luxury Beauty Video TravelDestinationsFood & DrinkStayNewsVideos Destinations Food & Drink Stay News Videos Destinations Food & Drink Stay News Videos SportsPro FootballCollege FootballBasketballBaseballSoccerOlympicsHockey Pro Football College Football Basketball Baseball Soccer Olympics Hockey Pro Football College Football Basketball Baseball Soccer Olympics Hockey ScienceSpaceLifeUnearthed Space Life Unearthed Space Life Unearthed ClimateSolutionsWeather Solutions Weather Solutions Weather WeatherVideoClimate Video Climate Video Climate Ukraine-Russia War Israel-Hamas War WatchLive TVCNN HeadlinesCNN ShortsShows A-ZCNN10CNN MaxCNN TV SchedulesFlashDocs Live TV CNN Headlines CNN Shorts Shows A-Z CNN10 CNN Max CNN TV Schedules FlashDocs Live TV CNN Headlines CNN Shorts Shows A-Z CNN10 CNN Max CNN TV Schedules FlashDocs ListenCNN 5 ThingsChasing Life with Dr. Sanjay GuptaThe Assignment with Audie CornishOne ThingTug of WarCNN Political BriefingThe Axe FilesAll There Is with Anderson CooperAll CNN Audio podcasts CNN 5 Things Chasing Life with Dr. Sanjay Gupta The Assignment with Audie Cornish One Thing Tug of War CNN Political Briefing The Axe Files All There Is with Anderson Cooper All CNN Audio podcasts CNN 5 Things Chasing Life with Dr. Sanjay Gupta The Assignment with Audie Cornish One Thing Tug of War CNN Political Briefing The Axe Files All There Is with Anderson Cooper All CNN Audio podcasts CNN UnderscoredElectronicsFashionBeautyHealth & FitnessHomeReviewsDealsGiftsTravelOutdoorsPets Electronics Fashion Beauty Health & Fitness Home Reviews Deals Gifts Travel Outdoors Pets Electronics Fashion Beauty Health & Fitness Home Reviews Deals Gifts Travel Outdoors Pets GamesDaily CrosswordJumble CrosswordSudoblockSudoku5 Things Quiz Daily Crossword Jumble Crossword Sudoblock Sudoku 5 Things Quiz Daily Crossword Jumble Crossword Sudoblock Sudoku 5 Things Quiz About CNNSubscribePhotosInvestigationsCNN ProfilesCNN LeadershipCNN NewslettersWork for CNN Subscribe Photos Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN Subscribe Photos Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN Settings Newsletters Topics you follow Sign out © 2025 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.CNN Sans ™ & © 2016 Cable News Network."}