{"id": 1946, "name": "Distractify", "domain": "distractify.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.distractify.com/p/ms-rachel-calls-out-outlets-for-not-reporting-on-gaza-support", "title": "Ms Rachel Calls Out Outlets For Not Reporting On Gaza Support", "content": "Entertainment Television Trending Influencers Human Interest ExclusivesDistracted WithAll Exclusives Distracted With All Exclusives Distracted With All Exclusives Link to Facebook Link to Instagram Link to X Link to Email Subscribe Entertainment Television Trending Influencers Human Interest ExclusivesDistracted WithAll Exclusives Distracted With All Exclusives Distracted With All Exclusives Link to Facebook Link to Instagram Link to X Link to Email Subscribe **Ms. Rachel Calls out 'People' and 'Parents' Magazine for Not Reporting on Gaza Support** \"Disappointed in the outlets.\" Updated June 11 2025, 9:14 a.m. ET We all knowMs. Rachelfor her upbeat children's educational shows and clips, and of course, her jean overalls, pink T-shirt, and that signature pink headband. She’s become a staple in so many homes since the COVID-19 pandemic and has seen major success helping kids learn basic skills and concepts. But despite her soft, friendly voice, Ms. Rachel isn’t afraid to speak up for meaningful causes. She’s been vocal about the ongoing war between Israel and Gaza, and she’s found it particularly bothersome that some media outlets would rather report on things likeOlivia Munnnot letting her kids watch Ms. Rachel’s videos instead of shedding light on the awareness the online personality is trying to raise about how the war is impacting innocent families. In fact, she’s been calling out those outlets directly on social media. Here’s what she had to say. **Ms. Rachel calls out outlets for not reporting on Gaza support.** At the beginning of June 2025,Parentsmagazine andPeoplemagazine both released issues featuring stories onOlivia Munn, wife ofJohn Mulaney, mom of two, and a breast cancer patient. Among the things revealed about Olivia is that she isn’t exactly a fan of Ms. Rachel. Normally, that wouldn’t be a big deal because every parent has the right to choose what shows their kids watch. But what rubbed Ms. Rachel the wrong way was how the magazines chose to highlight that detail, focusing on Olivia’s dislike of her content rather than covering something more meaningful, perhaps her advocating for the kids in Gaza. A post shared by Parents (@parents) Parentsmagazine shared apost on Instagramwith the caption: \"Olivia Munn is revealing her true thoughts about kids’ shows. Her take: Ms. Rachel is for littles, and not her kind of show.\" The promo photo even included a quote from Olivia of her essentially saying Ms. Rachel’s shows “drive me crazy.”Peoplemagazine took a similar approach, captioningtheir post: \"Ms. Rachel is for littles — but not Olivia Munn’s,\" though it appears they have since updated it. It didn’t take long for Ms. Rachel to jump into the comments on both posts, calling the outlets out directly and writing: \"I’d rather you cover my advocacy for kids in Gaza.\" She latershared a screenshot of both postsand elaborated on what she hoped the coverage would focus on instead: \"I’d rather you cover me advocating for kids in Gaza who are literally starving, largest cohort of child amputees in modern history, thousands and thousands killed — no medical care, no education, no homes … do better!!!\" A post shared by Ms Rachel (@msrachelforlittles) She also clarified that she isn’t upset with Olivia for not playing her shows in her household, saying: \"[I] don’t care that she doesn’t want to watch the show — all my love to her and her family — disappointed in the outlets.\" **Why doesn’t Olivia Munn let her kids watch Ms. Rachel?** It appears Olivia doesn’t let her kids watch Ms. Rachel’s shows simply because she’s not a fan. During a recent interview withParentsmagazine, she explained, \"I know kids love [Ms. Rachel], but the thing is, if I can’t watch it, I’m not going to spend the rest of my life going crazy. These kids’ shows drive me crazy.\" Since she doesn’t find Ms. Rachel’s content appealing, that alone is enough for her to keep it off the screen in her household. YouTube Star Ms. Rachel's Net Worth Is Nothing to Kid About Grandma Jealous of Ms. Rachel Makes Her Own Nursery Rhyme for Granddaughter Ms. Rachel Has Two Kids of Her Own — Details on the Lucky Kiddos LatestInfluencersNews and Updates About Distractify About Us Privacy Policy Terms of Use DMCA Sitemap Connect with Distractify Link to Facebook Link to X Link to Instagram Contact us by Email Opt-out of personalized ads © Copyright 2025 Engrost, Inc. Distractify is a registered trademark. All Rights Reserved. People may receive compensation for some links to products and services on this website. Offers may be subject to change without notice."}