{"id": 1896, "name": "Black Community NEws", "domain": "blackcommunitynews.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://blackcommunitynews.com/nebraskas-governor-just-signed-a-bill-that-boys-and-men-from-joining-girls-and-womens-sports-teams/", "title": "Nebraskas Governor Just Signed A Bill That Boys And Men From Joining Girls And Womens Sports Teams", "content": "Home About Us Clergy Corner Contact Disclaimer Defending the Second Amendment Subscribe to Our Daily Newsletter **Black Community News News and Commentary for Christians** Home About Us Clergy Corner Contact Disclaimer Defending the Second Amendment Subscribe to Our Daily Newsletter **Nebraska’s Governor Just Signed a Bill That Bars Boys and Men from Joining Girls’ and Women’s Sports Teams** BCN Senior EditorJune 10, 2025U.S. NewsLeave a comment Facebook Twitter A majority of states have enacted some sort of ban on boys and men playing on girls’ and women’s sports teams, although courts are currently blocking enforcement of several. Nebraska has joined states that have enacted a ban. Governor Jim Pillen this monthsigned a billinto law called the Stand With Women Act. The measure bars men and boys from joining girls’ and women’s sports teams. The U.S. Congress sought to ensure equal opportunity for girls and women in schools and education programs that receive federal funds. Title IX of the Education Amendments became law in 1972. “We cannot ignore that girls and women have the right to a level playing field when it comes to sports,”saidGov. Pillen. “Otherwise, we are denying them opportunities to compete and win, earn scholarships and develop their own athletic abilities.” Riley Gaines, former University of Kentucky graduate and swim team member, was present when the governor signed the bill. Gaines, an outspoken women’s sports advocate, competed against a man calling himself Lia Thomas during the 2022 NCAA swimming championships. Laws that ban males in female sports also protect their privacy and safety. Men allowed on women’s teams also have access to their changing rooms. Gaines testified before Congress about team members changing in a janitor’s closet to avoid changing in front of Thomas. Gaines spoke to the governor about the bill two years ago. Afterward, he signed an executive order protecting women’s sports. Payton McNabb, who was injured in a volleyball game after a man on the opposing team spiked the ball in her face, also attended the bill signing. Tagsleftist mobmodesty privacy safetySave Women's Sports **Related Articles** **A White Middle School Student Was Harassed and Bullied for Being White — The Fifth Circuit Ruled Against Him** June 10, 2025 **Archive: Every Democratic Senator Just Voted Against Protecting Female Athletes From This — Watch and Weep** June 10, 2025 **This School District Socially ‘Transitioned’ Girl Behind Her Mother’s Back** June 9, 2025 **Check Also** **11th Circuit Upholds City’s Restrictions on Drag Show Near Children’s Playground** The city of Naples, Florida, has won the argument in a case involving a homosexual … **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website A White Middle School Student Was Harassed and Bullied for Being White — The Fifth Circuit Ruled Against Him Archive: Every Democratic Senator Just Voted Against Protecting Female Athletes From This — Watch and Weep Nebraska’s Governor Just Signed a Bill That Bars Boys and Men from Joining Girls’ and Women’s Sports Teams Stephen Broden: The Real Story Behind Black Fatigue — Engineered White Manipulation Star Parker: Pass the Big Beautiful Bill, and Then Do Major Reforms Ken Wade: Floyd was Detained by Police and Died, Tyree Nichols was Murdered by Cops!... Ken Wade: But Sicko, pete Buttigieg and his queer mate were allowed to adopt 2 infant Boys... Ken Wade: And Patients should have the Right to Request, Straight Persons, for Medical Pro... BCN Senior Editor: Thanks again, Ken!... Ken Wade: Originally from 2022, Star's concept is as True today as it will be forever!... Anne B.: I recently read a letter to the editor in the NY Post, arguing that transgenderi... Ken Wade: And without being Forced to participate in Satanic Rainbow events!... Center for Urban Renewal and Education529 14th St NWNational Press BuildingWashington, DC 20045"}