{"id": 1195, "name": "Rocky Mountain Outlook", "domain": "rmoutlook.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.rmoutlook.com/canmore/town-of-canmore-surveying-to-determine-if-fruit-trees-are-on-public-or-private-land-10756515", "title": "Town Of Canmore Surveying To Determine If Fruit Trees Are On Public Or Private Land 10756515", "content": "WINNERS: 2024 Best of the Bow Join Our Newsletters Messages Post a Listing Your Listings Your Profile Your Subscriptions Your Likes Your Business Payment History Sign Out Sign In Register Sign up for Daily Headlines Sign up for Notifications Contact Us Home NewsLocal NewsBanff NewsCanmore NewsLake Louise NewsMD of Bighorn NewsKananaskis Country NewsStoney Nakoda News#JasperStrongLocal SportsBusiness NewsMountain GuideAlberta SportsOpinionVox PopuliIndigenous AlbertaBeyond LocalReal Estate Local News Banff News Canmore News Lake Louise News MD of Bighorn News Kananaskis Country News Stoney Nakoda News #JasperStrong Local Sports Business News Mountain Guide Alberta Sports Opinion Vox Populi Indigenous Alberta Beyond Local Real Estate Local News Banff News Canmore News Lake Louise News MD of Bighorn News Kananaskis Country News Stoney Nakoda News #JasperStrong Local Sports Business News Mountain Guide Alberta Sports Opinion Vox Populi Indigenous Alberta Beyond Local Real Estate Election2025 Municipal Election 2025 Municipal Election 2025 Municipal Election FeaturesSpotlightContestsLowest Gas PricesBites & BeviesChoose Your Own AdventureRocky Mountain Outlook Digital EditionDear AbbyCrosswordsWinners: 2024 Best of the BowWildfire PreparednessHot Summer Guide Spotlight Contests Lowest Gas Prices Bites & Bevies Choose Your Own Adventure Rocky Mountain Outlook Digital Edition Dear Abby Crosswords Winners: 2024 Best of the Bow Wildfire Preparedness Hot Summer Guide Spotlight Contests Lowest Gas Prices Bites & Bevies Choose Your Own Adventure Rocky Mountain Outlook Digital Edition Dear Abby Crosswords Winners: 2024 Best of the Bow Wildfire Preparedness Hot Summer Guide ObitsObituariesIn Memoriam Obituaries In Memoriam Obituaries In Memoriam EventsView Events- Submit an Event- Advertise in Calendar View Events - Submit an Event - Advertise in Calendar View Events - Submit an Event - Advertise in Calendar DiscoverShop Local: Business DirectoryRestaurantsClassifieds: All Listings- Post an Ad- My Ads- My AccountCareersGarage Sales Shop Local: Business Directory Restaurants Classifieds: All Listings - Post an Ad - My Ads - My Account Careers Garage Sales Shop Local: Business Directory Restaurants Classifieds: All Listings - Post an Ad - My Ads - My Account Careers Garage Sales Careers Public NoticesMunicipal NoticesGeneral NoticesLegal NoticesProvincial Notices Municipal Notices General Notices Legal Notices Provincial Notices Municipal Notices General Notices Legal Notices Provincial Notices ConnectAbout UsContact UsSign Up for our FREE NewslettersMake Us Your Home PageSign up for notificationsFind Us on Social MediaOur AudienceAdvertising & MarketingGreat West Digital Agency About Us Contact Us Sign Up for our FREE Newsletters Make Us Your Home Page Sign up for notifications Find Us on Social Media Our Audience Advertising & Marketing Great West Digital Agency About Us Contact Us Sign Up for our FREE Newsletters Make Us Your Home Page Sign up for notifications Find Us on Social Media Our Audience Advertising & Marketing Great West Digital Agency Home Canmore **Town of Canmore surveying to determine if fruit trees are on public or private land** Share by Email Share on Facebook Share on X Share on LinkedIn Print Share via Text Message CANMORE – The Town of Canmore is surveying property lines in a bid to determine if fruit trees are on public or private property as part of an ongoing fruit-tree removal program to keep opportunistic bears out of town. In late May, contracted surveyors began staking property lines so the Town of Canmore can determine whether some of the fruit trees fall on private or public property. At times, fruit trees that appear to be on private property may actually be on public road rights-of-way. Town of Canmore officials say they are taking an extra step to make sure fruit trees that were previously identified as a public tree during a 2018 fruit tree inventory are indeed on municipally owned land before chopping any down. “The staking that folks are seeing in what appears to be the front lawn is just the land survey, which was done to identify the property line so that we could determine if the tree was a public or private tree,” said Caitlin Van Gaal, supervisor of sustainability for the Town of Canmore. “In some cases, the tree was too close to the property to be able to be sure and so we wanted to confirm that it was, in fact, a public tree before we take any additional steps … we dropped a letter off to those homes indicating that a land survey would be taking place over the next week.” This work in Cougar Creek neighbourhoods is the second year of a multi-year plan to remove fruit-bearing trees from municipal lands in order to reduce attractants that may draw bears into town in search of an easy, calorie-rich snack. Van Gaal said not all of the land surveys have come back yet. “Once that is all sent back to the Town, which we’re hoping will be later this week, we will then be able to determine which trees are public trees,” she said. At that point, those trees on public land would be tagged for removal and a letter would be sent to residents that an arborist would remove the tree. “Before he removes any tree, he will verify that it is, in fact, a fruit-bearing tree as there are some trees that are sterile and are just a flowering tree that do not produce fruit,” said Van Gaal. “We want to confirm that we are just taking down the fruit-bearing trees.” Town of Canmore officials say they appreciate trees are important to the community, noting trees often have sentimental or emotional value, contribute to placemaking and memories, and can be legacy trees from family members who are no longer here. “We know folks are attached to their trees. They’re beautiful, they provide shade, they may have a sentimental attachment, or they were planted by a loved one – and we don't take that lightly,” said Van Gaal. That said, removing fruit trees from the community is one of the key recommendations that came out of the human-wildlife coexistence implementation and action plan. Van Gaal said the program is about removing wildlife attractants, which residents have also told the municipality is a top priority, so as not to draw wildlife into town. “The point of removing the fruit-bearing trees is to ensure that we do not give wildlife an attractant or a reason to stop as they move through,” she said. “If a bear is attracted to a fruit tree, they’re more likely to hang around that area for a while. They’re more likely to return to that area. We’re more likely to have a human-wildlife coexistence encounter.” With a keen sense of smell, opportunistic bears sniff out human food, garbage, bird seed, pet food, greasy barbecues and calorie-rich fruit trees. Bears eating fruit from trees is one of the main causes of bear relocation, or death as a result of a management action, in the Bow Valley. “We have seen over the years that a bear that gets into a fruit tree and returns to a fruit tree time after time, or then gets into other attractants such as garbage, is more likely to be taken out of town on the back of a trailer and relocated to another area,” said Van Gaal. “The relocation success rate, as I understand it, can be quite low and so it can be quite detrimental to the bear to be relocated from Canmore.”The Town of Canmore also has a fruit tree removal incentive program, which covers 100 per cent of the cost of removing fruit trees or bushes up to $500 per private property. In addition, condos or commercial properties with five or more trees are also eligible for additional support of up to $1,000 per property this year. With a rollover from last year’s budget, the pot of money for the 2025 program is about $40,000 for the fruit-tree removal program. “Because we do have a larger pot of money this year, and there's still plenty of funds remaining, there shouldn’t be any issue with folks getting the incentive,” said Van Gaal. See a typo/mistake? Have a story/tip? **This has been shared0times** 0Shares Share by Email Share on Facebook Share on X Share on LinkedIn Print Share via Text Message About the Author:Cathy Ellis SortOldestNewest OldestNewest OldestNewest Add **Sign up for our FREE Daily Headlines** **More Canmore** **SPOTLIGHT** More SPOTLIGHT > **Latest Poll** VoteResults >Archives > NewsLocal NewsBanff NewsCanmore NewsLake Louise NewsMD of Bighorn NewsKananaskis Country NewsStoney Nakoda News#JasperStrongLocal SportsBusiness NewsMountain GuideAlberta SportsOpinionVox PopuliIndigenous AlbertaBeyond LocalReal Estate Local News Banff News Canmore News Lake Louise News MD of Bighorn News Kananaskis Country News Stoney Nakoda News #JasperStrong Local Sports Business News Mountain Guide Alberta Sports Opinion Vox Populi Indigenous Alberta Beyond Local Real Estate Local News Banff News Canmore News Lake Louise News MD of Bighorn News Kananaskis Country News Stoney Nakoda News #JasperStrong Local Sports Business News Mountain Guide Alberta Sports Opinion Vox Populi Indigenous Alberta Beyond Local Real Estate Election2025 Municipal Election 2025 Municipal Election 2025 Municipal Election FeaturesSpotlightContestsLowest Gas PricesBites & BeviesChoose Your Own AdventureRocky Mountain Outlook Digital EditionDear AbbyCrosswordsWinners: 2024 Best of the BowWildfire PreparednessHot Summer Guide Spotlight Contests Lowest Gas Prices Bites & Bevies Choose Your Own Adventure Rocky Mountain Outlook Digital Edition Dear Abby Crosswords Winners: 2024 Best of the Bow Wildfire Preparedness Hot Summer Guide Spotlight Contests Lowest Gas Prices Bites & Bevies Choose Your Own Adventure Rocky Mountain Outlook Digital Edition Dear Abby Crosswords Winners: 2024 Best of the Bow Wildfire Preparedness Hot Summer Guide ObitsObituariesIn Memoriam Obituaries In Memoriam Obituaries In Memoriam EventsView Events- Submit an Event- Advertise in Calendar View Events - Submit an Event - Advertise in Calendar View Events - Submit an Event - Advertise in Calendar DiscoverShop Local: Business DirectoryRestaurantsClassifieds: All Listings- Post an Ad- My Ads- My AccountCareersGarage Sales Shop Local: Business Directory Restaurants Classifieds: All Listings - Post an Ad - My Ads - My Account Careers Garage Sales Shop Local: Business Directory Restaurants Classifieds: All Listings - Post an Ad - My Ads - My Account Careers Garage Sales Careers Public NoticesMunicipal NoticesGeneral NoticesLegal NoticesProvincial Notices Municipal Notices General Notices Legal Notices Provincial Notices Municipal Notices General Notices Legal Notices Provincial Notices ConnectAbout UsContact UsSign Up for our FREE NewslettersMake Us Your Home PageSign up for notificationsFind Us on Social MediaOur AudienceAdvertising & MarketingGreat West Digital Agency About Us Contact Us Sign Up for our FREE Newsletters Make Us Your Home Page Sign up for notifications Find Us on Social Media Our Audience Advertising & Marketing Great West Digital Agency About Us Contact Us Sign Up for our FREE Newsletters Make Us Your Home Page Sign up for notifications Find Us on Social Media Our Audience Advertising & Marketing Great West Digital Agency About RMOutlook.com Advertising Privacy Terms of Service Community Guidelines Airdrie City View/Rocky View Weekly Cochrane Eagle Jasper Fitzhugh Lakeland Today Mountain View Today Rocky Mountain Outlook St. Albert Gazette Town and Country Today Western Wheel © 2025 Rocky Mountain Outlook"}