{"id": 1803, "name": "SHTFplan.com", "domain": "shtfplan.com", "bias": "fake-news", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://www.shtfplan.com/headline-news/war-risk-level-just-went-way-up-and-trump-warns-well-be-very-very-tough-if-russia-doesnt-end-the-war", "title": "War Risk Level Just Went Way Up And Trump Warns Well Be Very Very Tough If Russia Doesnt End The War", "content": "**The Beginning of the End** A Masterstroke of Economic and Geopolitical Brilliance **DOWNLOAD THE URGENT UPDATE NOW!** X Login Register #1 Crypto Stock! Crisis Reports Expert Manuals Central Banks Digital Currency Massive Recession **War Risk Level Just Went “Way Up” And Trump Warns “We’ll Be Very, Very Tough” If Russia Doesn’t End The War** byMichael Snyder|Jun 9, 2025|Headline News,War|0 comments **Do you LOVE America?** **Share** This article was originally published byMichael Snyder at The End of the American Dream. The Russians and the Chinese have both been developing new intercontinental ballistic missiles that can cause such immense destruction that they make the nuclear bomb that destroyed Hiroshima look like a child’s toy. The U.S. has been working on a new intercontinental ballistic missile, too, but it won’t be ready for quite a few years. Unfortunately, we are closer to nuclear war right now than we have been at any other point in human history. In fact, we are extremely fortunate that the Russians didn’t decide to just start launching their nukes after Ukraine’svery foolish surprise attack on Russia’s nuclear bombers. If there had been a surprise attack on our nuclear bombers, we may not have shown the same level of restraint. We are literally teetering on the brink of the unthinkable, and it is so important for the general population to understand what we are facing. According to a brand new report that was just released, in our world today, there aremore than 9,600 nuclear warheadsthat are ready to be used… The number of nuclear warheads ready for use by nine countries has slightly increased from last year, reaching over 9,600 warheads, according to a Japanese think tank’s report. Russia, the United States and China remain the world’s three largest countries in terms of the size of their nuclear arsenals. As I haveextensively documented, a full-blown nuclear war would be cataclysmic. A large portion of the U.S. population would be immediately wiped out, and even more would die from famine during the subsequent nuclear winter. Sadly, most of the population doesn’t even realize we just had a really close call. President Trump’s envoy to Ukraine, Keith Kellogg, just explained to Fox News that Ukraine’s assault on Russia’s nuclear bombers resulted in risk levels“going way up”… “I’m telling you, the risk levels are going way up – I mean, what happened this weekend,” Trump’s envoy, Keith Kellogg, told Fox News. “People have to understand in the national security space: when you attack an opponent’s part of their national survival system, which is their triad, the nuclear triad, that means your risk level goes up because you don’t know what the other side is going to do. You’re not sure.” Our continued existence literally depended on Russian President Vladimir Putin showing some restraint. Fortunately, Putin didn’t press the button this time. But do we really want to keep living on the edge like this? We need to find a way to make peace while we still can. Unfortunately, it appears that peace is slipping away. President Trump was just asked about imposing more sanctions on Russia, and he responded by saying that“we’ll be very, very tough”if Russia doesn’t end the war… President Donald Trump was asked again on Thursday when he will make a decision regarding sanctions on Russia, which he’s threatened repeatedly over the past several weeks. “It’s in my brain, the deadline,” Trump said. “When I see the moment where it’s not gonna stop … we’ll be very, very tough. And it could be on both countries, to be honest. It takes two to tango.” Of course, the Russians are in no mood to compromise after what the Ukrainians just did. In fact, there are some voices in Russia that are calling for nuclear weapons to be used. Here isjust one example… The Kremlin’s recently updated nuclear doctrine – which sets out conditions for a launch – states that any attack on “critically important” military infrastructure which “disrupts response actions by nuclear forces” could trigger a nuclear retaliation. The Ukrainian operation was “grounds for a nuclear attack,” declared Vladmir Solovyov, a firebrand host on Russian state TV, calling for strikes on the Ukrainian presidential office in Kyiv, and beyond. Most people living in the western world don’t realize this, but the Russian “Satan-2” missiles are the most advanced nuclear missilesin the entire world… Russia’s “Satan-2” missile, also known as the RS-28 Sarmat, has earned its infamous name from the West for its sheer destructive potential. This intercontinental ballistic missile (ICBM) is capable of carrying multiple nuclear warheads — up to 15-16 — and is capable of wiping out entire cities. The updated RS-28 Sarmat missile, considered an advanced version of Satan-2, has an increased range of 13,000 to 16,000 kilometers, making it one of the most powerful missiles in Russia’s arsenal. This missile’s capacity to cause mass destruction is unparalleled, capable of obliterating several cities with a single strike. One “Satan-2” missile can carry enough firepower to destroy an area roughly the size of the state of Texas. Meanwhile, the Chinese have developed a new intercontinental ballistic missile that has a range of7,500 miles… China has revealed details of its new nuclear weapon which is said to be 200 times more powerful than the bombs that devastated Hiroshima and Nagasaki. The DF-5B missile is said to have a range of 7,500 miles, meaning it is capable of reaching Europe and the United States from launch sites in China. Like Russia’s “Satan-2” missile, this new Chinese ICBM is capable of deployingmultiple reentry vehicles… Its Multiple Independently Targetable Reentry Vehicle (MIRV) technology enables a single missile to carry and release a number of nuclear warheads capable of striking different targets across a wide area. The original DF-5 was equipped with only one warhead, but the DF-5B can reportedly carry up to 10, significantly boosting its strike capability. We have no defense against such missiles. If the Russians or the Chinese press the button, we will be toast. Accordingto Zero Hedge, the commander of Edwards Air Force Base recently warned that the local community needs to be prepared for the possibility of a catastrophic surprise attack… Last month, the commander of Edwards Air Force Base, California, talked openly about the need for local leaders to prepare for a Pearl Harbor-like strike on his base and others inside the United States. Brig. Gen. Doug Wickert delivered “a sobering assessment of China’s growing military capabilities” in a briefing to community leaders, according to an Air Force press release. Wickert, the 412th Test Wing commander, spoke at Antelope Valley College on May 7. Edwards Air Force Base is located in the Mojave desert about 100 miles northeast of Los Angeles. Wickert referenced the 1941 Pearl Harbor attack in his briefing, the press release said, drawing parallels to warnings about Pearl Harbor’s vulnerability prior to the attack. As I have warned many times, U.S. military bases will be primary targets if a nuclear war erupts. We are counting on our strategic nuclear arsenal to deter the Russians and the Chinese, but right now, Minuteman missiles that originally went into service in the 1970s still form the backbone of that arsenal. The new Sentinel intercontinental ballistic missile is in development, and preparations for its deploymentare underway… According to information published by the 5th Bomb Wing Public Affairs on May 30, 2025, the US Air Force officially launched preparations at its nuclear installations to accommodate the upcoming LGM-35A Sentinel intercontinental ballistic missile (ICBM). The activation of a new specialized unit, the Sentinel Site Activation Task Force (SATAF) Detachment 12, at Minot Air Force Base in North Dakota marks a pivotal moment in the effort to replace the aging Minuteman III, which has served as the land-based pillar of the US nuclear triad since 1970. This initiative is part of a broader strategic modernization plan focusing on strengthening the ground-based leg of the nuclear deterrent force. That is the good news. The bad news is thatit will be yearsbefore the new Sentinel intercontinental ballistic missile is ready… The Sentinel program, originally designated as the Ground Based Strategic Deterrent (GBSD), is designed to deliver a next-generation ICBM featuring advanced security technologies, cyber resilience, and modular architecture. Sentinel will be deployed in a single-warhead configuration, with initial fielding scheduled to begin in 2029. Until the new W87-1 warhead under development by the National Nuclear Security Administration (NNSA) becomes available, the Sentinel will be armed with legacy W87-0 warheads. The NNSA is also scaling up its capability to produce 80 plutonium pits per year by 2030 to meet program requirements, having already qualified the first war reserve pit for the W87-1 in October 2024. Until the Sentinel is in service, we will be at a serious disadvantage. When I asked Google AI if Russia’s S-500 air defense system can shoot down a Minuteman missile, this is the response that I got… Yes, the S-500 air defense system is designed to intercept and destroy a wide range of aerial threats, including ballistic missiles like the Minuteman ICBM. But we don’t have anything that can shoot down the new missiles that the Russians and the Chinese have developed. So perhaps we shouldn’t be picking fights with the Russians and the Chinese while they are holding the upper hand. Of course, the vast majority of the population does not understand any of this, and that is extremely unfortunate. Michael’s new book, entitled“10 Prophetic Events That Are Coming Next,”is availablein paperbackandfor the Kindleon Amazon.com, and you can subscribe to his Substack newsletter atmichaeltsnyder.substack.com. About the Author:Michael Snyder’s new book, entitled“10 Prophetic Events That Are Coming Next,”is availablein paperbackandfor the Kindleon Amazon.com. He has also written nine other books that are available on Amazon.com, including“Chaos”,“End Times”,“7 Year Apocalypse”,“Lost Prophecies Of The Future Of America”,“The Beginning Of The End”, and“Living A Life That Really Matters”. When you purchase any of Michael’sbooks, you help to support the work that he is doing. You can also get his articles by email as soon as he publishes them by subscribing to hisSubstack newsletter. Michael has published thousands of articles onThe Economic Collapse Blog,End Of The American Dream, andThe Most Important News, and he always freely and happily allows others to republish those articles on their own websites. These are such troubled times, and people need hope. John 3:16 tells us about the hope that God has given us through Jesus Christ: “For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.” If you have not already done so, we strongly urge you to invite Jesus Christto be your Lord and Saviortoday. **URGENT ON GOLD… as inURGENT** It Took 22 Years to Get to This Point **Related Articles** **Elon Musk Suggests New Political Party Amid Break-up With Trump** byMac Slavo|Jun 9, 2025| 2 Comments Elon Musk, the billionaire CEO of Tesla and SpaceX, has proposed creating a new political party... **US Issues A Security Alert For Kiev And The “Bad Guy”** byMac Slavo|Jun 5, 2025| 0 Comments Donald Trump has declared Volodymyr Zelensky the \"bad guy\" as the United States issues a security... **Who Has Been Spending The Money To Equip The Protesters In Los Angeles With Brand New Riot Gear?** byMichael Snyder|Jun 11, 2025| 0 Comments This article was originally published by Michael Snyder at The End of the American Dream under the... **U.S. Will Deeply Cut Military Aid For Ukraine** byMac Slavo|Jun 11, 2025| 0 Comments The United States claims that it will be slashing military aid for Ukraine as it seeks an end to... **Comments** **Join the conversation!** **0 Comments** **Submit a CommentCancel reply** You must be logged in to post a comment. Commenting Policy: Some comments on this web site are automatically moderated through our Spam protection systems. Please be patient if your comment isn’t immediately available. We’re not trying to censor you, the system just wants to make sure you’re not a robot posting random spam. This website thrives because of its community. While we support lively debates and understand that people get excited, frustrated or angry at times, we ask that the conversation remain civil. Racism, to include any religious affiliation, will not be tolerated on this site, including the disparagement of people in the comments section. The content on this site is provided as general information only. The ideas expressed on this site are solely the opinions of the author(s) and do not necessarily represent the opinions of sponsors or firms affiliated with the author(s). The author may or may not have a financial interest in any company or advertiser referenced. Any action taken as a result of information, analysis, or advertisement on this site is ultimately the responsibility of the reader. SHTFplan is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to Amazon.com. Home Submit News & Articles Contact Us RSS Feed © 2009 - 2025 Copyright SHTF Plan • Site by620 Studio•Report a website problem|Disclaimer"}