{"id": 22, "name": "Australian Associated Press (AAP)", "domain": "aap.com.au", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://aapnews.aap.com.au/news/consumer-group-tests-burn-sunscreens-over-spf-50-claims", "title": "Consumer Group Tests Burn Sunscreens Over Spf 50 Claims", "content": "**Consumer group tests burn sunscreens over SPF 50 claims** Winter has come and chilly conditions have set in, but those looking forward to summer are being warned that not all sunscreens are equal when they slip, slop, slap. Consumer advocacy group Choice tested 20 sunscreens with SPF 50 or 50+ labels and found only four met the criteria. \"Consumers expect sunscreen to protect them in line with the SPF rating on the product, but as our testing has shown, the SPF label doesn’t always match what's in the bottle,\" the group's CEO Ashley de Silva said. Some of the Cancer Council's own sunscreen products were egregiously falling behind. The Kids Clear Zinc 50+ tested at 33, the Everyday Value Sunscreen 50 scored just a touch above the halfway mark at 27 and the Ultra Sunscreen 50+ came at a shockingly low 24. Only one product from the council matched the label - the Kid Sunscreen 50+ scoring a strong 52. AAP has contacted the Cancer Council about the results. Three other products from well-known brands - La Roche-Posay, Neutrogena and Mecca Cosmetica - delivered on their dermatological declarations. La Roche-Posay Anthelios Wet Skin Sunscreen SPF 50+ tested at 72, Neutrogena Ultra Sheer Body Lotion SPF 50 came in at 56 and Mecca Cosmetica To Save Body SPF 50+ Hydrating Sunscreen scraped through at 51. The sunscreen which scored the lowest was Ultra Violette's Lean Screen SPF 50+ Mattifying Zinc Skinscreen, which returned an SPF of 4, the consumer group said. Ultra Violette disputed CHOICE's testing methodology and results, saying it did not arbitrarily slap on a SPF 50+ label but was following Therapeutic Goods Authority guidelines. \"We do not accept these results as even remotely accurate,\" the company told AAP. \"Lean Screen contains 22.75 per cent zinc oxide, a level at which, when applied sufficiently, would render a testing result of SPF 4 scientifically impossible.\" Industry body Consumer Healthcare Products Australia assured people they can step out into the sun \"with full confidence in the quality, safety and effectiveness of Australian sunscreens\". The body said in a statement that it worked closely with the TGA and Standards Australia to ensure consumers were protected by some of \"the most stringent requirements in the world\". Choice said it had informed the TGA, the Australian Competition and Consumer Commission as well as the brands concerned of the results. It has requested the authority conduct its own compliance testing. Mr de Silva tempered any concerns for people heading to beaches or enjoying scorching sunny days, noting that \"any sunscreen is better than none at all\". License this article"}