{"id": 1610, "name": "WRAL", "domain": "wral.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wral.com/news/education/faq-why-nc-schools-are-restricting-cellphones-how-will-that-affect-your-school-june-2025/", "title": "Faq Why Nc Schools Are Restricting Cellphones How Will That Affect Your School June 2025", "content": "**Why NC schools are restricting cellphones, and how that will affect your school** Schools and the people who run them face a vexing challenge: how to keep students off of their cellphones when they should be learning. The attempted solutions run the gamut — including automatic confiscation, expensive cellphone storage devices, and classroom charts indicating whether phones can be used. Sometimes it depends on the school. Sometimes it’s the entire school system. Meanwhile, state lawmakers are examining whether restrictions should be mandated. WRAL News dug into how the crackdowns are playing out and what could happen next. Here’s what you need to know. **Why are policymakers cracking down on cellphones?** Teachers have long complained that cellphones are distractions for students. While most schools nationwidehave already had cellphone restrictionsin place for years,surveys showteachers still find cellphones to be a distraction, some of them even citing them as among the reasons they burned out from teaching. The correlation between the presence of the restrictions and the survey results suggest the current policies aren't working. Teachers and students complained to WRAL News that rules aren't consistent classroom-to-classroom, frustrating students and leading to more work for teachers who try to be more strict about cellphone use. **What limits on cellphones are currently in place?** Existing limits on cellphones depend on the school system or the individual school. How or whether they are enforced can even vary classroom-to-classroom. Most schools have for years had policies requiring cellphones to be put away during class, unless being used for instruction, but that doesn't mean they have been regularly followed or enforced. **What is being proposed?** Twobills in the General Assemblycall for school boards to adopt their own policies with baseline restrictions and consequences. But enforcement of the policies, such as how teachers would ensure cellphones are put away, could vary school-to-school, if the school board doesn't set enforcement rules. The Wake County school board approved a policy that requires phones to be silenced and stowed away in a bag or locker but gives teachers options in how they want to enforce the policy. They can, but are not required to, confiscate phones. **Would proposed restrictions vary by school or grade level? How?** Thetwo billsin the General Assembly call for school boards to adopt their own policies with baseline restrictions and consequences. But enforcement of the policies, such as how teachers would ensure cellphones are put away, could vary school-to-school, if the school board doesn't set enforcement rules. Students and teachers said inconsistent enforcement is frustrating and confusing and renders the policies ineffective. **How are cellphone policies enforced?** This varies school system to school system, or school-to-school or even classroom-to-classroom. That variance is something some school boards, but not all, are trying to clear up by making their policies more uniform across the school district. In Wake County, home to the state’s biggest public school district, the school board this week passeda districtwide policythat permits — but doesn’t require — school staff to confiscate cellphones. The policy doesn't stipulate methods of ensuring the phones are put away, but board members have suggested the possibility of purchasing shoe organizers or a similar product for students to put their phones in during class. Some high schools in Wake County, Harnett County, Chatham County and many others have been using lockingpouchesfor storing cellphones. Those can cost more than $20 per student but allow the students to keep their cellphones with them. They require special unlocking devices that are placed in different spots throughout the school building. Some schools, such as those in Granville County, don't use bags or pouches at all and simply require immediate confiscation if a student pulls out their phone when it's not allowed. **Which area school districts have cellphone policies?** A handful have policies, some are drafting policies andothers leave decisions up to their schoolsso far. Here are a few district approaches: The Granville County Board of Education passed a stricter cellphone policy last year, not allowing elementary or middle school students to use phones and only allowing high school students to use them during passing periods or lunch.The policyallows for some exceptions. Wake County Board of Education’s new policyallows for more exemptions than those allowed by Granville. Wake allows students to use mobile devices for health or disability plans or translations or assistive communication. The Durham County Board of Education’scode of conduct policiesstipulate that cellphones and other personal electronic devices cannot be on during instructional time or during mandatory school assemblies or activities. School staff can, but are no required to, confiscate devices in violation, for parents or guardians to then pick up from the school. The Johnston County Board of Educationis considering a new cellphone policythat would require phones to be turned off and put away. It would allow high school students to use phones only during lunchtime, and staff would be the only ones allowed to use phones during emergencies. Students could be suspended for repeated violations. TheFranklin County Board of Educationonly allows phones for personal reasons “when there is a reasonable need” or during supervised instruction. Many school districts in and near the Triangle are piloting approaches to cellphones. In Chatham andHarnett counties, some high schools are experimenting with locking pouches that prevent the use of phones but still allow students to keep their phones with them. Unlocking devices must also be purchased and placed throughout the school so that the pouches can be unlocked. **What are the arguments against cellphone restrictions?** Some parents and students believe students should have access to cellphones in the event of an emergency, such as an injury, a lockdown or even just a change in schedule. Many proposed or existing policies allow exemptions for emergencies. Senate Bill 55, introduced during the current legislative session, would also allow mobile devices to be used in the case of an emergency. A similar proposal, House Bill 87, wouldn’t.Some law enforcement officialshave suggested cellphone use during lockdowns could be distracting for students who need to be taking precautions. **How will the school guarantee I can reach my student during the day?** Many schools encourage families to call the school office when they need to relay information to their children, and vice versa. That's similar to how things worked before cellphones were widely possessed by young people. Wake County’spolicyencourages that and promises a staff member will reach the child. In many cases, including in Wake County, students will be able to access their phones in case of an emergency and in some other staff-authorized instances, such as needing to make a last-minute scheduling change with their parent or guardian, or even employer. At Wake high schools, students would be able to check their phones during lunch or during passing periods. That's the case at many other high schools across the state, as well, including Granville County high schools. **What percentage of elementary, middle or high school students have a cellphone?** About one-quarter of children aged 8 or younger have cellphones, according toa new survey by Common Sense Media, a nonprofit focused on young people's media use. The groupsurveyed families of older children in 2021and found that 43% of 8- to 12-year-olds owned a smartphone and 88% of 13- to 18-year-olds owned a smartphone. **How do teachers and students use a cellphone to support learning?** Teachers have long called on students to use their cellphones to do certain academic work, particularly before students generally had school-issued laptops. Before then, students often used their mobile phones to research topics, calculate something, time something, shoot video for a project or other purposes. Art classes might allow students to draw from photos on their phones. Related education cellphone Wake County Public School System"}