{"id": 2186, "name": "World Magazine", "domain": "wng.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://wng.org/roundups/pca-top-officers-resignation-effective-immediately-per-denomination-officials-1749247174", "title": "Pca Top Officers Resignation Effective Immediately Per Denomination Officials 1749247174", "content": "My AccountUpdate PreferencesLogout Update Preferences Logout Update Preferences Logout Sign In Subscribe GiveGive OnlineGive by Mail or PhoneGive StockGive through Donor Advised FundDonate your VehicleEstate Planning Give Online Give by Mail or Phone Give Stock Give through Donor Advised Fund Donate your Vehicle Estate Planning Give Online Give by Mail or Phone Give Stock Give through Donor Advised Fund Donate your Vehicle Estate Planning The Sift Roundups Opinions Podcasts Magazine Books Movies TopicsTrump TrialsIsrael-Hamas WarBusinessCompassionCultureEducationFaithFamilyInternationalPoliticsScienceColumnsVoicesOpinionsSearch ArchivesReturn to Main Menu Trump Trials Israel-Hamas War Business Compassion Culture Education Faith Family International Politics Science Columns Voices Opinions Trump Trials Israel-Hamas War Business Compassion Culture Education Faith Family International Politics Science Columns Voices Opinions Search Roundups Beginnings The Stew Schooled Compassion Muse Vitals Liberties World Tour Relations **PCA top officer’s resignation “effective immediately,” per denomination officials** **Committee unanimously picks interim replacement after stated clerk’s controversial “scandalizers” list** igzz / iStock / Getty Images Plus via Getty Images The Presbyterian Church in America’s Administrative Committee on Friday accepted the immediate resignation of stated clerk Bryan Chapell—following aThursday meetingprompted by Chapell’spublic apologyover his “scandalizers” list on The Gospel Coalition’sGospelboundpodcast. The committee “gratefully received his repentance and apology” and recognized “the seriousness of the situation.” It also expressed regret for the fallout and thanked Chapell for decades of service. The committee unanimously appointed John Bise as Chapell’s temporary replacement, pending the Theological Examination Committee’s review of his qualifications. The committee said it did not have time to nominate a full replacement for Chapell in time for the denomination’s General Assembly meeting, which is scheduled to begin June 23 in Chattanooga, Tenn., but plans to nominate someone before the 2026 meeting. On theGospelboundpodcast last month, Chapellheld up a Post-it notelisting names of individuals he said were “scandalizers” who had all left their families, left the faith, or taken their own lives. Viewers then took screenshots of the list and shared the image across social media, prompting rebuttals that multiple people on the list are still living with their families and involved in the church. Pastor Andy Webb’s name was on the list. While he is no longer with the PCA, he serves in North Carolina with the Associate Reformed Presbyterian Church. Webbsaidin a public statement that Chapell called him after the interview to apologize and that he forgave him. Carl Trueman, who writes for WORLD Opinions and whose name was also on the list, likewise received an apology from Chapell. Doug Hart was close friends with an individual on the list, David Winecoff, who died in a mountain climbing accident in 1993. Hart filed a formal request for an investigation into Chapell, saying that he violated the Ninth Commandment’s prohibition on testifying falsely about one’s neighbor. He told WORLD on Friday that he thought both Chapell and the Administrative Committee made the right decision. Before the Administrative Committee released its statement on Friday, a few pastors expressed support for Chapell. PCA teaching elder David F. Coffin Jr. said earlier this week that Chapell did not lie and that the individuals who took screenshots of the list and spread them around the internet committed greater wrong than Chapell. “The fact is, on the evidence, I do not believe you lied,” Coffin wrote intheAquila Report, an independent religious publication, earlier this week, relaying remarks he’d sent to Chapell. “Your departure, in these circumstances, will profoundly debilitate the office of the stated clerk, an office that you have adorned by your labors.” Bise, who will serve temporarily as Chapell’s replacement, has decades of experience in church courts at all levels of the PCA, the Administrative Committee said. He served as the moderator of the PCA’s General Assembly in Birmingham, Ala., in 2022, and, according to the statement, he is currently a ruling elder at Cornerstone Presbyterian Church in Huntsville, Ala. If you enjoyed this article and would like to support WORLD's brand of Biblically sound journalism,click here. Josh is a breaking news reporter for WORLD. He’s a graduate of World Journalism Institute and Patrick Henry College. Thank you for your careful research and interesting presentations.—Clarke Please wait while we load the latest comments... **Comments** P.O. Box 20002Asheville, NC 28802 (828) 253-8063 About WORLD Statement of Faith Contact Advertise Masthead Podcast Team Careers Donate to WORLD Donate Your Vehicle Tribute to Joel Belz Pro-life Issue Books Issue Newsletters Writer Archives Merch Store Alexa News Briefing iHeartRadio Podcast RSS WORLD News Group App Login Subscribe Email Preferences Website Help Account Help Commenting Policy Privacy Policy WORLDkids WORLDteen God’s Big WORLD WORLD Watch World Journalism Institute © 1986-2025 WORLD NEWS GROUP. ALL RIGHTS RESERVED."}