{"id": 167, "name": "Brookings Institute", "domain": "brookings.edu", "bias": "left-center", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://www.brookings.edu/articles/will-the-reconciliation-bills-child-tax-credit-changes-leave-out-children-in-low-income-working-families/", "title": "Will The Reconciliation Bills Child Tax Credit Changes Leave Out Children In Low Income Working Families", "content": "Experts Events Research Programs Research & Commentary Newsletters For Media About UsLeadershipCareersOur CommitmentsOur FinancesDiversity, Equity, and InclusionBI PressWashU at Brookings Leadership Careers Our Commitments Our Finances Diversity, Equity, and Inclusion BI Press WashU at Brookings Leadership Careers Our Commitments Our Finances Diversity, Equity, and Inclusion BI Press WashU at Brookings Donate U.S. Trade PolicyU.S. Trade PolicyU.S. EconomyBanking & FinanceEconomic IndicatorsFederal Fiscal & Tax PolicyFederal ReserveLabor & UnemploymentRegulatory PolicyRetirementSocial Safety NetState & Local FinanceU.S. Trade PolicyExplore topicCan Trump bring manufacturing back to the US?Can Trump bring manufacturing back to the US?Increase pressure or silently acquiesceIncrease pressure or silently acquiesceUS tariffs and global inflationUS tariffs and global inflation U.S. Economy Banking & Finance Economic Indicators Federal Fiscal & Tax Policy Federal Reserve Labor & Unemployment Regulatory Policy Retirement Social Safety Net State & Local Finance U.S. Trade Policy U.S. Economy Banking & Finance Economic Indicators Federal Fiscal & Tax Policy Federal Reserve Labor & Unemployment Regulatory Policy Retirement Social Safety Net State & Local Finance U.S. Trade Policy International AffairsInternational AffairsInternational AffairsDemocracy, Conflict, & GovernanceDiplomacy & MultilateralismForeign Politics & ElectionsFragile StatesGeopoliticsHumanitarian & Disaster AssistanceMigrants, Refugees & Internally Displaced PersonsTrafficking & Illicit TradeU.S. Foreign PolicyExplore topicIntroducing vibe teaming: How AI can enhance collaborative problem-solvingIntroducing vibe teaming: How AI can enhance collaborative problem-solvingVibe teaming: How human-human-AI collaboration could disrupt knowledge work for the world’s toughest challengesVibe teaming: How human-human-AI collaboration could disrupt knowledge work for the world’s toughest challengesTaking advantage of disruption to update aidTaking advantage of disruption to update aid International Affairs Democracy, Conflict, & Governance Diplomacy & Multilateralism Foreign Politics & Elections Fragile States Geopolitics Humanitarian & Disaster Assistance Migrants, Refugees & Internally Displaced Persons Trafficking & Illicit Trade U.S. Foreign Policy International Affairs Democracy, Conflict, & Governance Diplomacy & Multilateralism Foreign Politics & Elections Fragile States Geopolitics Humanitarian & Disaster Assistance Migrants, Refugees & Internally Displaced Persons Trafficking & Illicit Trade U.S. Foreign Policy U.S. Government & PoliticsU.S. Government & PoliticsU.S. Government & PoliticsCampaigns & ElectionsCongressCourts & LawGovernment ReformPolitical PartiesPolitical PolarizationPresidencyPublic OpinionU.S. DemocracyExplore topicMusk’s Mars idea is not crazyMusk’s Mars idea is not crazyThe EITC at 50: Key takeaways from a recent Brookings panelThe EITC at 50: Key takeaways from a recent Brookings panelA new state role for experienced teacher improvementA new state role for experienced teacher improvement U.S. Government & Politics Campaigns & Elections Congress Courts & Law Government Reform Political Parties Political Polarization Presidency Public Opinion U.S. Democracy U.S. Government & Politics Campaigns & Elections Congress Courts & Law Government Reform Political Parties Political Polarization Presidency Public Opinion U.S. Democracy Technology & InformationTechnology & InformationTechnology & InformationArtificial IntelligenceCryptocurrencyCybersecurityInternet & TelecommunicationsMedia & JournalismPrivacySocial MediaSpace ExplorationTechnology Policy & RegulationExplore topicSix key steps for improving equality and efficiency in digital public infrastructureSix key steps for improving equality and efficiency in digital public infrastructureIntroducing vibe teaming: How AI can enhance collaborative problem-solvingIntroducing vibe teaming: How AI can enhance collaborative problem-solvingMusk’s Mars idea is not crazyMusk’s Mars idea is not crazy Technology & Information Artificial Intelligence Cryptocurrency Cybersecurity Internet & Telecommunications Media & Journalism Privacy Social Media Space Exploration Technology Policy & Regulation Technology & Information Artificial Intelligence Cryptocurrency Cybersecurity Internet & Telecommunications Media & Journalism Privacy Social Media Space Exploration Technology Policy & Regulation Race in Public PolicyRace in Public PolicySociety & CultureChildren & FamiliesCrime, Justice & SafetyDemographics & PopulationEconomic Security & MobilityHuman Rights & Civil LibertiesImmigrants & ImmigrationRace in Public PolicyReligion & SocietySocial Equity & InclusionExplore topicIntroducing the Black Business Parity Dashboard from the Center for Community Uplift at Brookings MetroIntroducing the Black Business Parity Dashboard from the Center for Community Uplift at Brookings MetroWhat if Black businesses were equitably represented in every metro area in America?What if Black businesses were equitably represented in every metro area in America?Five years since George Floyd, the new Civil Rights Movement needs to play offenseFive years since George Floyd, the new Civil Rights Movement needs to play offense Society & Culture Children & Families Crime, Justice & Safety Demographics & Population Economic Security & Mobility Human Rights & Civil Liberties Immigrants & Immigration Race in Public Policy Religion & Society Social Equity & Inclusion Society & Culture Children & Families Crime, Justice & Safety Demographics & Population Economic Security & Mobility Human Rights & Civil Liberties Immigrants & Immigration Race in Public Policy Religion & Society Social Equity & Inclusion TopicsBusiness & WorkforceCities & CommunitiesClimate & EnergyDefense & SecurityEducationGlobal Economy & DevelopmentHealth CareInternational AffairsSociety & CultureTechnology & InformationU.S. EconomyU.S. Government & Politics Business & Workforce Cities & Communities Climate & Energy Defense & Security Education Global Economy & Development Health Care International Affairs Society & Culture Technology & Information U.S. Economy U.S. Government & Politics Business & Workforce Cities & Communities Climate & Energy Defense & Security Education Global Economy & Development Health Care International Affairs Society & Culture Technology & Information U.S. Economy U.S. Government & Politics RegionsAfricaAsia & the PacificEurope & EurasiaLatin America & the CaribbeanMiddle East & North AfricaNorth America Africa Asia & the Pacific Europe & Eurasia Latin America & the Caribbean Middle East & North Africa North America Africa Asia & the Pacific Europe & Eurasia Latin America & the Caribbean Middle East & North Africa North America U.S. Trade Policy International Affairs U.S. Government & Politics Technology & Information Race in Public Policy All Topics All Regions Experts Events Research Programs About Us Research & Commentary Newsletters Careers For Media ContactMedia inquiriesMarie Wilken[email protected]202-540-7738 ShareShareBluesky Streamline Icon: https://streamlinehq.comBluesky Share Bluesky Streamline Icon: https://streamlinehq.comBluesky Share Bluesky Streamline Icon: https://streamlinehq.comBluesky ContactMedia inquiriesMarie Wilken[email protected]202-540-7738 ShareShareBluesky Streamline Icon: https://streamlinehq.comBluesky Share Bluesky Streamline Icon: https://streamlinehq.comBluesky Share Bluesky Streamline Icon: https://streamlinehq.comBluesky **Subscribe to the Economic Studies Bulletin** Commentary **Will the reconciliation bill’s Child Tax Credit changes leave out children in low-income working families?** May 29, 2025 As part of the reconciliation bill, Congress is considering increasing the Child Tax Credit. Increasing the credit amount would be costly and would fail to address the structural issues that prevent low-income families from receiving the full benefit. Lower-cost CTC revisions could benefit millions of children in lower-income working families and newborn infants. 9 min read Bluesky Streamline Icon: https://streamlinehq.comBluesky Robert GreensteinBluesky Streamline Icon: https://streamlinehq.comBluesky See More Economic Security & Mobility Federal Fiscal & Tax PolicySocial Safety Net Economic Studies The Hamilton Project This piece was updated on May 29, 2025, to reflect recent legislative developments. Congress isconsideringincreasing the value of the Child Tax Credit (CTC) as part of the budget reconciliation bill. The 2017 tax lawraisedthe CTC from $1,000 per child to $2,000 through 2025. Thereconciliation measurethat the House of Representatives passed on May 22 increases the credit further. Depending on how changes in the CTC are crafted, they could either help children in lower-income working families or bypass those children while favoring children in families higher on the income scale, with incomes of up to half a million dollars a year or more. The CTC changes that the House has now approved very much do the latter. Depending on how changes in the CTC are crafted, they could either help children in lower-income working families or bypass those children while favoring children in families higher on the income scale, with incomes of up to half a million dollars a year or more. Today,17 millionchildren in low-income families—the vast majority of whom are in low-incomeworkingfamilies—receive no CTC or only a partial CTCbecauseof the CTC’s structure. A family with two children must earn a little more than $29,000—the equivalent of working 40 hours a week for 52 weeks of the year at $14 an hour, nearly twice the federal minimum wage—before it can receive the full CTC of $2,000 per child.Meanwhile, married families making as much as $400,000 a year receive the full credit for all their children. The CTC fails to reach low-income children or provides them only a partial credit for several reasons. Children in families with annual earnings of $2,500 or less are ineligible. The credit then phases in slowly as a family’s earnings rise above $2,500, at a rate of $15 in the CTC for each $100 in a family’s earnings above the $2,500 threshold until a family qualifies for the full $2,000 for each of its children. In addition, thephase-inis done on a per-family basis rather than a per-child basis. As a result, a mother with two young children who works 20 hours a week throughout the year at the federal minimum wage currently receives a CTC of a little more than $7501—about $375 per child—even as a family with two children that makes $400,000 a year gets a CTC of $4,000 ($2,000 for each of its children). Without addressing these CTC parameters, an increase in the value of the CTC will exclude millions of lower-income families with children, many of whose living conditions would be made significantly harsher by cuts in SNAP, Medicaid, and other programs that the House reconciliation bill also includes. A recent Tax Policy Centeranalysisby Margot Crandall-Hollick, Elaine Maag, and Muskan Jha illuminates these issues, by examining nine options for expanding the CTC. It finds that increasing the value of the CTC above its current $2,000 per childwithoutmaking changes to other CTC parameters would largely leave low-income children out. Increasing the full credit amount to $2,500 per child, for example—as the House reconciliation bill does—would result in no increase in the credit whatsoever for millions of children in low-income working families, and the poorest 20 percent of families with children overall would receive just 2 percent of the new CTC benefits. The top 20 percent of families with children, by contrast, would get nearly 10 times as much in new CTC benefits, with a family with two children not losing eligibility for the CTC until its income reached $500,000.2And the top two-fifths of families with children would get twice as much in new CTC benefits as the bottom two-fifths. Despiteevidenceof the effectiveness of a more inclusive CTC in reducing child poverty and improving child well-being, there is no chance that the final reconciliation bill will make the credit available to children in families with no earnings, as was done for one year in 2021. But if policymakers wished to do so, they could strengthen the CTC substantially for millions of children in lower-income working families and do so at modest cost. The TPC analysis shows that starting the phase-in of the CTC with a family’s first dollar of earnings (rather than its $2,501st dollar) and phasing in the credit at a 15 percent rateper child(rather than per family) would cost $48.5 billion over 10 years.3Changessuch as theseand similar proposals would raise substantial numbers of children in working-poor families out of poverty or make them less poor. Tax writers also could consider providing the full credit to newborn children without regard to whether their families have earnings. No program outside the tax code in which the federal government sets the rules imposes work requirements on mothers of infants,4andresearchindicatesthat providing such benefits toinfantsprovides impressive long-term gains for them. TPC estimates such a provision for newborns would cost a modest $7.5 billion over 10 years. By contrast, raising the credit from $2,000 to $2,500 per child without making changes to the parameters that heavily restrict the CTC for low-income children costs $229.5 billion over 10 years, TPC estimates—more than four times as much as the above two options combined—while doing little for the children who need the support most.5This is the course the House reconciliation bill takes. It raises the credit amount per child to $2,500 for the four years from 2025 through 2028 without making improvements in the CTC’s treatment of low-income children. (To help keep the cost of its tax cuts within the cost limit it must meet, the House bill sunsets the increase to $2,500 after 2028, at which point the credit would return to its $2,000-per-child level, with the $2,000 amount being indexed for inflation. The House bill also makes permanent several other CTC provisions enacted in 2017, including a doubling from $200,000 to $400,000 in the income level up to which married filers receive the full CTC, a small reduction from $3,000 to $2,500 in the earnings level at which the CTC begins phasing in for working-poor families, and a modest increase in the cap on the amount of the credit a family can receive on a refundable basis.6) In addition, the House bill denies the CTC to children who are U.S. citizens or legal permanent residents if either of the parents claiming them on their tax return lacks a Social Security number. The Joint Committee on Taxationestimatesthis provision will cause 2 million children to lose the CTC. A separateanalysisby the Center for Migration Studies estimates the number of children who will lose the credit to be much higher, at 4.5 million. To be sure, policymakers could both increase the CTC amount per child and make the credit’s parameters for children in low-income working families less restrictive. One option TPC examined would combine an increase in the credit to $2,500 per child with a phase-in of the credit on a per-child basis, starting with a family’s first dollar of earnings, and a measure to provide the full credit to newborn infants without regard to a family’s earnings. That option would cost $342 billion over 10 years, however, making its adoption in the reconciliation bill very unlikely.7 Senators now face a choice. Do they change course from the House bill and seek lower-cost CTC revisions that would benefit millions of children in lower-income working families and newborn infants? Or do they adopt the House CTC changes that largely exclude these children—and also disqualify 4.5 million citizen and permanent-legal-resident children—while adding substantially more in cost? Author Related Content Robert Greenstein May 1, 2025 Wendy Edelberg, Melissa S. Kearney March 1, 2023 Sophie Collyer, Bradley Hardy, Christopher Wimer March 1, 2023 Acknowledgements and disclosuresAcknowledgmentsI would like to thank Margot Crandall-Hollick and Elaine Maag both for their Tax Policy Center paper on which much of this piece is based and for reviewing and commenting on this piece. I would also like to thank Lauren Bauer and Aviva Aron-Dine for very helpful comments and Noadia Steinmetz-Silber for both research assistance and insightful comments. Acknowledgments I would like to thank Margot Crandall-Hollick and Elaine Maag both for their Tax Policy Center paper on which much of this piece is based and for reviewing and commenting on this piece. I would also like to thank Lauren Bauer and Aviva Aron-Dine for very helpful comments and Noadia Steinmetz-Silber for both research assistance and insightful comments. Acknowledgments I would like to thank Margot Crandall-Hollick and Elaine Maag both for their Tax Policy Center paper on which much of this piece is based and for reviewing and commenting on this piece. I would also like to thank Lauren Bauer and Aviva Aron-Dine for very helpful comments and Noadia Steinmetz-Silber for both research assistance and insightful comments. FootnotesThis mother would receive the same $750 if she had more than two children or if she had only one child.Today, the CTC goes in full to married families with children with incomes up to $400,000 a year and phases out at a 5 percent rate for earnings above that level, with the result that a family with two children receives some CTC until its income reaches $480,000. If the full credit amount is raised from $2,000 per child to $2,500, the point at which the credit phased out entirely for a family with two children will rise to $500,000.This option also eliminates the CTC’s “refundability cap,” which limits the amount of the CTC that a low-income working family can receive on a refundable basis.Some states may have requirements of this nature in their Temporary Assistance for Needy Families (TANF) programs.Raising the credit even more, to $5,000 per child, without making other CTC changes would be still more regressive. It would provide the top quintile of families with children with more than twice as much in new CTC benefits as the bottom two quintiles combined, while costing $1.1 trillion.TheHouse billalsorequiresmarried individuals to file a joint return to receive the CTC.The various TPC cost and distribution estimates cited here reflect the costs and distributional impacts of expanding the CTC beyond its current parameters, including its current full-credit amount of $2,000 per child. This mother would receive the same $750 if she had more than two children or if she had only one child. Today, the CTC goes in full to married families with children with incomes up to $400,000 a year and phases out at a 5 percent rate for earnings above that level, with the result that a family with two children receives some CTC until its income reaches $480,000. If the full credit amount is raised from $2,000 per child to $2,500, the point at which the credit phased out entirely for a family with two children will rise to $500,000. This option also eliminates the CTC’s “refundability cap,” which limits the amount of the CTC that a low-income working family can receive on a refundable basis. Some states may have requirements of this nature in their Temporary Assistance for Needy Families (TANF) programs. Raising the credit even more, to $5,000 per child, without making other CTC changes would be still more regressive. It would provide the top quintile of families with children with more than twice as much in new CTC benefits as the bottom two quintiles combined, while costing $1.1 trillion. TheHouse billalsorequiresmarried individuals to file a joint return to receive the CTC. The various TPC cost and distribution estimates cited here reflect the costs and distributional impacts of expanding the CTC beyond its current parameters, including its current full-credit amount of $2,000 per child. This mother would receive the same $750 if she had more than two children or if she had only one child. Today, the CTC goes in full to married families with children with incomes up to $400,000 a year and phases out at a 5 percent rate for earnings above that level, with the result that a family with two children receives some CTC until its income reaches $480,000. If the full credit amount is raised from $2,000 per child to $2,500, the point at which the credit phased out entirely for a family with two children will rise to $500,000. This option also eliminates the CTC’s “refundability cap,” which limits the amount of the CTC that a low-income working family can receive on a refundable basis. Some states may have requirements of this nature in their Temporary Assistance for Needy Families (TANF) programs. Raising the credit even more, to $5,000 per child, without making other CTC changes would be still more regressive. It would provide the top quintile of families with children with more than twice as much in new CTC benefits as the bottom two quintiles combined, while costing $1.1 trillion. TheHouse billalsorequiresmarried individuals to file a joint return to receive the CTC. The various TPC cost and distribution estimates cited here reflect the costs and distributional impacts of expanding the CTC beyond its current parameters, including its current full-credit amount of $2,000 per child. The Brookings Institution is committed to quality, independence, and impact.We are supported by adiverse array of funders. In line with ourvalues and policies, each Brookings publication represents the sole views of its author(s). Society & CultureSub-TopicsEconomic Security & Mobility Economic Security & Mobility Economic Security & Mobility U.S. EconomySub-TopicsFederal Fiscal & Tax PolicySocial Safety Net Federal Fiscal & Tax PolicySocial Safety Net Federal Fiscal & Tax PolicySocial Safety Net Economic Studies The Hamilton Project Sarah Calame June 10, 2025 Lauren Bauer, Asha Patt June 4, 2025 Lauren Bauer, Diane Whitmore Schanzenbach June 4, 2025 Get the latest from Brookings twitter facebook linkedin youtube instagram The Brookings Institution is a nonprofit organization based in Washington, D.C. Our mission is to conduct in-depth, nonpartisan research to improve policy and governance at local, national, and global levels. Research Programs Governance Studies Economic Studies Foreign Policy Global Economy and Development Brookings Metro About Us Leadership Careers Brookings Institution Press WashU at Brookings Contact Brookings Research & Commentary Experts Events Books Podcasts Newsletters Privacy Policy, Updated August 2024 Terms of Use, Updated August 2024 Copyright 2025 The Brookings Institution"}