{"id": 1775, "name": "OffGuardian", "domain": "off-guardian.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://off-guardian.org/2025/05/21/indian-farmers-protest-resurges-against-corporate-control-where-is-the-global-support-this-time/#comments", "title": "Indian Farmers Protest Resurges Against Corporate Control Where Is The Global Support This Time", "content": "**Indian Farmers’ Protest Resurges Against Corporate Control: Where Is the Global Support This Time?** **** The 2020–2021 Indian farmers’ protests garnered significant international support due to the unprecedented scale and resilience of the movement against three controversial farm laws. The government’s harsh crackdown on peaceful protesters and activists drew widespread condemnation across the world. Social media amplification and endorsements by prominent celebrities further transformed the protests into a global cause. Although the farm laws were repealed, corporate interests and the Indian government have continued to pursue the aims of those laws through alternative means, prompting ongoing protests by farmers. While the stakes and core issues of the Indian farmers’ renewed protests remain unchanged, this movement has attracted nowhere near the same level of global support as before, despite ongoing concerns about farmers’ rights and livelihoods, food sovereignty, government crackdowns and democratic freedoms. The Indian government’s handling of agricultural reforms and farmer welfare since the massive farmers’ protests of 2020-21 reveals a stark contrast in priorities. While committees and policies facilitating corporate interests and digital agriculture initiatives have been established and funded swiftly, crucial promises related to Minimum Support Price (MSP) guarantees and farmer welfare remain pending or inadequately addressed. This discrepancy is fuelling continuing farmer discontent and indicates where the government’s priorities lie. Since the repeal of the three contentious farm laws in late 2021, the government and its premier agricultural research body, the Indian Council of Agricultural Research (ICAR), have moved quickly to forge partnerships with multinational agribusiness corporations. The ICAR has signed multiple Memorandums of Understanding (MoUs) with global giants such as Bayer, Amazon and Syngenta within a short span from 2023 to 2024. For instance, the ICAR-Bayer MoU signed in September 2023 focuses on developing resource-efficient, climate-resilient crop solutions, crop protection, mechanisation and carbon credit markets. Bayer, which has a history stretching back to involvement in Nazi death camps and is known for rolling out highly profitable, highly toxic agrochemicals, is now positioned to provide agronomic advisory services and mechanisation ‘solutions’ to farmers through ICAR’s extensive network. Similarly, the ICAR’s collaboration with Amazon Kisan aims to leverage Amazon’s supply chain and digital infrastructure to promote ‘scientific’ cultivation and ensure ‘high-quality’ produce reaches consumers via Amazon Fresh. The Syngenta Foundation India partnership, signed in July 2024, emphasises ‘capacity building’ and training on ‘climate-resilient’ agriculture and ‘precision farming’ technologies like drones and AI. These partnerships are not simply about ‘modernising’ agriculture; they are about embedding corporate control at every node of the food system. What is being rolled out under the banners of ‘digital agriculture’ and ‘public-private partnership’ is, in reality, the systematic transfer of control over seeds, inputs, data and markets from farmers and public institutions to transnational corporations. The resulting food system will be tailored for profit extraction, not food security or farmer well-being. Such MoUs, often signed without public scrutiny or democratic debate, represent a corporate power play that undermines both national sovereignty and the autonomy of smallholder farmers in particular. As the Mumbai-based Janata Weekly points out, the government’s willingness to fast-track these deals, while dragging its feet on MSP and procurement reforms, is a clear signal of where its allegiances lie. The digitalisation of agriculture, under the guise of innovation, opens the door for data harvesting by global tech and agri-corporations, making farmers dependent on proprietary platforms and algorithms. This is, in effect, digital colonialism, where control over agricultural knowledge and decision-making shifts from the field to the corporate boardroom. These rapid tie-ups with corporate interests are not incidental but deeply intertwined with the genesis of the farm laws themselves. Investigations and analyses reported by Newsclick reveal that the farm laws were largely crafted under the influence of corporate agribusiness interests, with significant involvement from the apex government think tank NITI Aayog. According to Newsclick, the farm laws originated from a proposal by Sharad Marathe, a US-based businessman with close ties to the ruling BJP party but no background in agriculture. Marathe’s vision, which advocated leasing farmland to corporate agribusinesses and reducing farmers to cogs in a corporate-controlled system, was quickly embraced by NITI Aayog. The think tank set up a task force dominated by big corporate players like Adani Group, Patanjali, BigBasket, Mahindra and ITC while excluding farmer representatives and independent experts. This task force operated with secrecy and speed, recommending sweeping deregulation measures such as the dilution of the Essential Commodities Act to lift stocking limits, facilitating corporate control over agricultural markets. The Adani Group, in particular, was a vocal proponent of these changes, which aligned closely with its business interests. NITI Aayog’s philosophy, according to Janata Weekly, equated what is good for agribusiness profits with what is good for Indian agriculture, sidelining the concerns of small and marginal farmers. This corporate-centric approach shaped the farm laws and subsequent policies, including the rapid MoUs with Bayer, Amazon and Syngenta, which further embed corporate influence in agriculture. The narrative that ‘what’s good for corporate agribusiness is good for agriculture’ is a dangerous fallacy. It reduces the farmer to a contract labourer, strips communities of control over their food systems and prioritises export-oriented, input-intensive farming over agroecology and food sovereignty. By excluding independent scientists, farmer organisations and public-interest voices, NITI Aayog has enabled policy capture by corporate interests. The farm laws were the legislative embodiment of this capture, and their spirit lives on in ongoing policy and institutional reforms. In stark contrast to the swift corporate collaborations, the government’s promise to set up a committee to address MSP and related farmer demands has seen significant delays and limited action. Although a committee on MSP was announced following the farm laws’ repeal, no substantive interim report or legal guarantee has emerged even years later. Budgetary support for direct procurement schemes that ensure remunerative prices for farmers has been drastically cut or merged into broader schemes, diluting their effectiveness. There is a preference for relief payments over systemic reforms that would benefit farmers, as noted by Janata Weekly. Even here, while public money is poured into corporate-led ‘innovation’ and digital infrastructure, the actual safety nets that protect farmers from market volatility are being systematically eroded. It is basically austerity for farmers and abundance for corporates, a hallmark of the neoliberal food regime, where public resources are redirected from social protection to subsidising private profit. Although the government formally repealed the three farm laws in November 2021 following sustained protests, the core objectives of these laws are being pursued through alternative means, effectively implementing the same reforms by stealth. New policies such as the National Policy Framework on Agricultural Marketing (NPFAM) and ongoing efforts to promote contract farming, digital platforms for agricultural marketing and deregulation of state mandi (market) systems closely mirror the deregulatory and corporatisation goals of the repealed laws (Agricultural Produce Market Committees (APMCs) are primarily state backed. These APMCs operate under state governments, as agricultural marketing is a state subject in India. Mandis, which are regulated markets within the APMC system, play a crucial role in the agricultural economy.) We are seeing backdoor strategies to open up agriculture to corporate control without legislative scrutiny or public debate: advancing the farm laws’ agenda under a different name. The rollback of the farm laws was a tactical retreat, not a change of direction. The state continues to implement the core tenets of those laws. The result is policy by subterfuge, where the substance of corporate capture advances even as the symbols are withdrawn. Janata Weekly’s analysis of the 2023-24 budget and agricultural policies points to a clear political economy rationale: the government prioritises reforms that open agriculture to corporate investment and market forces over those that protect small and marginal farmers’ incomes and livelihoods. The rapid initiation and funding of corporate-oriented committees and MoUs contrast sharply with the slow or symbolic handling of farmer demands. This approach reflects a broader neoliberal agenda that views agriculture as a sector for market manipulation rather than social protection. It is part of a global trend. India’s food system is being restructured to fit the template of a neoliberal food regime, one that privileges corporate consolidation, global supply chains and the commodification of everything from seeds to data. The losers are small farmers, rural communities and ultimately, the country’s food security. Despite the government’s repeal of the farm laws, the farmers’ agitation in India remains very much alive and active. Since February 2024, a renewed wave of protests has emerged, surpassing the previous 2020-21 agitation in duration and intensity, particularly in key agricultural states like Punjab, Haryana and western Uttar Pradesh. Farmers continue to demand a legal guarantee for MSP for all crops, comprehensive loan waivers and the rollback of new pro-corporate policies, such as the National Policy Framework on Agricultural Marketing (NPFAM). The Samyukta Kisan Morcha (SKM) and other farmer unions have organised widespread protests, including road blockades, sit-ins and marches to district headquarters across India. The government’s response has included detentions of hundreds of farmers, bulldozing of protest sites and arrests of key leaders, including those undertaking indefinite hunger strikes. Despite this crackdown, farmers remain resolute, continuing to organise nationwide protests and drawing support from civil society groups and opposition political parties. Farmers have also prepared detailed data to counter government claims about the cost and feasibility of implementing MSP guarantees. They continue to seek dialogue with the government, but meaningful engagement has been limited. The Indian government has employed internet crackdowns as a key tactic to suppress the farmers’ protests, both in the 2020-21 agitation and the renewed protests starting in 2024. According to Newsclick, authorities imposed temporary internet blackouts in protest-affected areas, such as seven districts in Haryana during 2024, aiming to disrupt communication among farmers and prevent the spread of information about the protests. Similar shutdowns were used during the 2020-21 protests, including suspending mobile internet services in key protest zones around Delhi. There has also been a targeted removal of social media accounts: the government issued executive orders to platforms like X to take down accounts of journalists, farmers’ union leaders and supporters reporting on or backing the protests, limiting the movement’s online visibility and outreach. Overall, internet shutdowns and social media censorship have been significant tools in the state’s efforts to curb the farmers’ agitation and limit both domestic and international awareness and support. This, in part, explains why the renewed farmers’ agitation in India has not garnered the same level of global support as the 2020-21 protest. Moreover, as The Wire notes, the 2020-21 protests centred around the three farm laws, providing a clear rallying point that attracted global attention and solidarity. The current protests focus on broader and more complex demands such as legal guarantees for MSP, repeal of new policies perceived as similar to the withdrawn laws, pensions, debt waivers and opposition to WTO agreements. This diffusion of focus may dilute international engagement. Meanwhile, the government accelerates digital and corporate-friendly reforms with enthusiasm. The promised MSP committee and related guarantees remain pending, exposing a gap between political rhetoric and action. And that gap persists because the aim is to make agriculture financially non-viable for smallholders, who make up the bulk of India’s farmers, drive them to the cities and amalgamate their lands for the benefit of global agribusiness, industrialised agriculture and institutional land investors. The repeal of the farm laws has not ended the push for corporatisation; rather, the government continues to advance these aims through new policies and partnerships. Until core farmer demands, especially legal MSP guarantees and income security, are addressed, the agitation and mistrust are likely to persist, reflecting the crisis at the heart of Indian agriculture. This crisis, for farmers, stems from the ongoing corporate takeover of the sector that ultimately hinges on removing them from the land. Unless India reclaims its food system for the public good, anchored in food sovereignty, agroecology and farmer rights, corporate capture will only deepen. The struggle of India’s farmers is not just for their own survival, but for the very future of food, democracy and sovereignty in the country. Sources Janata Weekly,Budget 2023–24: What Is in it for the People: Part 7 – The Budget and Agriculture(2024). DownToEarth, ICAR-Bayer MoU:DICAR-Bayer MoU: What It means for Indian Farmers(2024). Newsclick,Farmers Protest(2024). Global Research,Farm Laws Reborn: Dismantling Food Security, Toxic Platter for India’s Farmers and Consumers(2025) See also the booksPower Play: The Future of Food(2024) andFood, Dispossession and Dependency: Resisting the New World Order(2022), which include extensive analyses and commentaries pertaining to many of the issues discussed above. **SUPPORT OFFGUARDIAN** **If you enjoy OffG's content, please help us make our monthly fund-raising goal and keep the site alive.** For other ways to donate, including direct-transfer bank details clickHERE. Δ Δ By every indication, the caste system remains prevalent in India. Simply put, India is the single largest apartheid state on the planet.When considering news concerning the exploitative injustice committed against India’s farmers, or who attacked who first in the latest of India’s border skirmishes with Pakistan or China, remember that India continues a culture of inescapable oppression predicated on generationally-inherited circumstance of birth. Typical colonial divide and conquer mindset trying to perpetuate a myth. Why Are Tomatoes Selling So Cheap? A Much Bigger Problem Is At Play Yes, but… what about agriculture in (Islamic Republic) Pakistan, (the most populous Muslim-majority country) Indonesia, China’s State of Totalitarianism (CST)? Depopulation is just a crazy conspiracy theory….https://substack.com/@aetherczar/note/c-117927772 Unlike geo-engineering, can’t see them admitting this one – at least for some time yet. We have the Guidestones as proof. We didnt made the Guidestones who promise to kill 7,5 billion people and with 500 million only left. The Secret Society TPTB made them. Perhaps that’s why they were blown up a few years ago and removed. at around nine oh seven…. Because thats how normal witnesses describe time. They’re lying…….. BTW, jews make up 0.2% of the global population.Hard to believe, isn’t it? Israel had 12 tribes who were forced to spread all over the globe after they did the Babel Tower thing. Wir sind alles ein juden! The mass-media miasma is part of the strategy. It’s getting harder to determine where to direct one’s attention as there is so much competition for this valuable resource.Industrialisation has been a disaster for agriculture globally. How did it become acceptable to spray chemical poisons on food crops? As can be heard in the 13-year-old video, the “actors” insult each other with the words “Du Opfer!” (“You victim!”), which has been considered an insult for some time. How did this actually come about? Anyone who is a victim is weak, i.e. “uncool”, and therefore does not deserve any leniency or sympathy.https://de.zxc.wiki/wiki/Opfer_(Schimpfwort) What if the created fear of eating GMO’s created more issues for your digestion. We was told RFKjr was suppose to make everyone healthy again. We apologize it unfortunately cant be done over 1 night. If you can wait a few days more Im sure RFKjr is a capable man. Off topic but an example of typical PTB lawfare attack is buried in the T/Congressional bill running unscrutinized by big beautiful media. A non-liability/protection clause for AI, just as for nuclear, vaccines, and cell phones/RF. Only the worst, most destructive corporate technologies gets this kind of government enforcer protection. From violent invasion to capture colonial assets for exploitation, the Western PTB have morphed their physical violence methods to evermore virtualized violent assault to extract profit. NSA CIA spook international subterfuge, economic warfare (like sanctions, tariffs and WTO) to lawfare entrapment and coersion, as mentioned here, to information propaganda behavioral manipulation. The 21st C assault on humanity has become a collective effort of corporate, government, 1% PTB that will use any or all of the above warfare mechanisms. Voters in the US, and West, have been yearly enablers for this PTB’s empire of haters, that also thrashes the lives of the enablers. Until the public takes away the PTB’s access to vast, now infinite, disposable income and authority, this assault on humanity, multiplied by techno-fascism will continue. Understand this:There are no governments. There are only bankers’ puppets. The government gives the people the illusion that we have a say and that there is a democracy. All political parties, everywhere, are controlled by the same force.It’s time to forget statute law and get on with our lives without fake authority and their propaganda. If we do not consent, they have no power. They are fraudsters. Hundred percent correct theory. However, they have the army, the police, the bureaucrats, the tech guys, the weapons, etc., and they can lay siege on us (a popular weapon of war against people they wish to subdue), or throw into concentration camps or straight out kill us with guns, toxic chemicals (aerial spraying, “medicines”, “foods”, etc). I’m all for building our own infrastructures and communities… but how? Shovel in hand and a few friends? There are billions of us, its a pity there are only a few switched on and have courage. We are living in a corporate world (corpse) where everything and everyone is a dead entity requiring representation. I have tried on this forum to point this out, but its over the heads of many.To understand we do not need to accept our dead fiction is the key. Unfortunately, there aren’t billions of us.. The majority of people aren’t even aware of what’s happening, never mind organising to do something about it. Colin Todhunter published 101 articles on agriculture here since 2018: 37 were purely on agriculture in India , 0 for Pakistan, Indonesia or China. One day ago I gave him a documented tip to research the May 17th 2025IMFreport on Pakistan in which that government dropped MSPrices and thefarmers are now left to market prices.Zilch from C. Modihunter, nothing for poor Pakistani farmers here, mum about the agricultural landlordism there by the elite & the military. Pakistani ISI is weaponizing Indian Sikh farmers against New Delhi since Indira Gandhi, and now again through Western NGOs. Pakistan has chased out 99% of Sikhs from their side of undivided Punjab. Hypocrite green, whether fake ecologists, Pak army or Isl*mists. I have been thinking same for a while. I have been reading Off-G for few years and Off-G / Colin Todhunter has been writing with “focus” only on India’s farming, and no other nation. They don’t even pick any other country in South Asia or China, forget abt US, UK, Canada or from Europe. Also, it almost gave impression that all farmers in India are Sikhs, pictures are always of Sikhs protesting. I agree that GMO farming is an issue, but writing abt same issue in some other country would be good for a change !! As far Pakistan goes, to me it is not a Country, it is a Colony managed by Western military/secret services thro their offshoot branch ISI. Thumbs up to both of you.But nevertheless, I found the issue “The Digital Society (Big Tech) is invading also our farming and our farmers”, to be more important than which country it happens in.Here it is India, ok so what. You must have missed his recent article on agriculture in Africa. And his writings on the UK and food, on the US and food, on the Netherlands and its farmers, on seed sovereignty in Latin America (and so on) over the years. Yea, i may have missed that, though do recalls quick/partial read of Sainsbury, UK, though no mention of any Political leader what they do or did not do !! Thank you.Though, the point is, Mr Todhunter’s focus remain on India, and when articles are written you can sense heavy political undertone and dislike of Modi-BJP government, is not the case when written for And same is projected by your – CST’s – comment below with phrases like“Here is what your precious Modi-BJP is doing..”“than look at your hero, Modi.” Also, I don’t understand your response“why don’t YOU write that piece on that IMF report on Pak instead of griping about others not doing it?” We are here as reader and commenter, not writer with subject matter knowledge. To be a leader of almost true democracy, as India is – is different than fake democracies run by Military/Intelligence deep states and Oligarchs/Elites like most “Developed” and other countries around world. India is always under Geopolitical pressure every time it tries to do something independently starting from 1947 Partition of India into India and a Colony of UK/Mi5-6/CIA/Five-Eye called Pakistan. BTW the “father” of this Colony/Pakistan – Jinnah – whose family was a Hindu convert, never cared abt Muslim, lived Aristocrat life style, i doubt he read a line from Quran and whose father worked for Nawab of Junagadh – now part of India in bordering state of Gujarat. British used Jinnah against India, throw some pocket change and perks, and still using this Colony against India. I hope India’s political class know and understand this. Antonym has been on here for years complaining every time an article appears on Indian agriculture. And it just so happens that Indian agriculture is in crisis, so there will be some hard truths to face, which the antonym’s of this world will find unpalatable. So, he tries to pull apart the author (Colin T) with ridiculous and unsubstantiated claims about him being in this or that agency’s pocket (intel, NGO – take your pick). When challenged, he cannot support these claims. What’s more, he NEVER engages with the issues raised re the corporate hijack of agriculture in that country. His go-to response is ‘what about agriculture in China’, ‘what about Pakistan’. Aside from this whataboutism deflection tactic, he seems to take every criticism on policy as an attack on Modi. But that is a misguided, as I will explain. If antonym is so constantly disappointed, he should attempt to redress the balance by writing a piece himself. Sure, he is a commenter, but there should be no divide between being ‘only’ a commenter/reader and a writer. He claims to have good knowledge of the subject matter (always talking about the CIA/MI6/Pak pulling the farmers’ strings – and even the author’s strings – one of his many fanciful claims), so I challenge him to do it. It is tedious reading his same old comments for two years or more, never offering anything constructive in response to India’s agrarian crisis. I disagree with you about the claim of a heavy undertone/dislike of BJP. If you read in-depth the author’s (Colin T) books, they contain a lot of info on Indian agriculture, and it is clear that he specifies that the agenda for its corporatisation goes back to 1990. It just so happens that Modi has been in power for the last 11 years – and as the evidence shows, his policies are accelerating an agenda that was set out for India by the World Bank and foreign agribusiness in 1990. If you read Colin T’s writing pre-2014, he was calling out what was happening in Indian ag back then – prior to Modi. It is the agenda that is being called out and Modi just happens to be in the driving seat at this point with his foot on the accelerator. Folks,the biggest agricultural crisis on planet Earthis in India, that food surplus giant – according to self proclaimed expert Todhunter.Nothing is going on in food deficient PR China, palm oil flooded Indonesia, GMO full Argentina, military agricultural Pakistan etc. It has a name: obsession. Unbalanced,unhinged. What about… what about… what about. Your comment should read: Folks, I’m happy with the foreign takeover of agriculture and India’s ultimate loss of any remaining sovereignty as it eradicates its buffer stocks and then must bid with its foreign exchange reserves on global markets to gain food supplies and food security. That’s the plan. It’s there – laid out – if you care to look. You know why there is an agrarian crisis? Because the system is being dismantled and corporatised. See how long it remains a food surplus giant then! To know any of this requires research and reading. Much easier to sloganeer and smear. But, of course, you are such an expert, so how’s that article on the issues you mentioned previously coming along? posted a response is/was in pending … my response which was pending and didn’t show up in comment, not sure what rule i violated !but any how.. here is the comment as image<a href=’https://postimg.cc/QK89kRPR’ target=’_blank’><img src=’https://i.postimg.cc/cCYRZWc4/my-comnt-off-G-Indian-Farmer-Colin-Todhunter-pending-then-rejected-twice-20250523.png’ border=’0′ alt=’my-comnt-off-G-Indian-Farmer-Colin-Todhunter-pending-then-rejected-twice-20250523’/></a><br /><a href=’https://postimages.org/’>my response to CST</a><br /> CT’s writing did not begin or end with OffGuardian. While you counted 101 articles by him on this site, the reality is closer to 500+ articles going back to well before OffGuardian even existed. Within those writings, you will find many positive reflections on India. You don’t even need to go that far back because what you might perceive as negative is actually positive. His work has supported campaigns that have successfully prevented harmful outcomes—for example, backing the remarkable efforts of Aruna Rodrigues, a stalwart campaigner in India who, in any rational society, would be recognised and awarded for her dedication. Much of his extensive body of work—whether focused on India, supporting another great campaigner in the UK Rosemary Mason or highlighting Andrew Flachs’ work on the plight of Indian cotton farmers—centres on raising awareness about critical issues. CT frequently emphasises India’s deep cultural heritage, especially in relation to agriculture and food. He understands that Indian agricultural practices are not merely economic activities but are deeply intertwined with centuries-old traditions, rituals and knowledge systems passed down through generations. He values this cultural richness as a foundation for sustainable and equitable food systems, contrasting it with the mechanistic and profit-driven nature of industrial agriculture. He also draws attention to the strength and resilience of India’s rural communities, particularly small-scale farmers and indigenous groups who face immense challenges such as land dispossession, debt and corporate exploitation. He highlights their crucial role as custodians of biodiversity and stewards of the environment. A core theme in his work is the urgent need to protect India’s indigenous agricultural practices from erosion by industrial farming, genetically modified seeds and corporate agribusiness. He argues that traditional methods—such as organic farming, mixed cropping and seed saving—are essential for preserving biodiversity, ensuring food sovereignty and maintaining ecological balance. CT warns that losing these practices not only threatens farmers’ livelihoods but also undermines food security and environmental health on a broader scale. He advocates for policy changes to defend these practices against privatisation and commodification. His latest open-access ebook will be printed in both Hindi and English in India and distributed free to colleges, campaign groups, and others. The goal is to raise awareness and inspire action—and no profit will be made from it. Lastly, you seem to adopt a whataboutism stance, similar to someone else on here. If you seek writing that fawns over this or that politician or this or that party, you will need to look elsewhere. CT’s work is the product of years of research and critical analysis aimed at exposing systemic problems while promoting viable alternatives. You must have missed his recent article on agriculture in Africa. And his writings on the UK and food, on the US and food, on the Netherlands and its farmers, on seed sovereignty in Latin America (and so on) over the years. But then you would, wouldn’t you. It suits your agenda, Here is what your precious Modi-BJP is doing –Budget 2023–24: What Is in it for the People: Part 7 – The Budget and Agriculture – Janata WeeklyMuch easier to ignore the plight and foreign takeover of Indian ag and blame Pak, the US, China or whoever than look at your hero, Modi. And here’s a thought – why don’t YOU write that piece on that IMF report on Pak instead of griping about others not doing it? A genuine Q? Too much effort? Forgot to mention – Ukraine and Mexico as well. If those pieces cannot be found on OffG, they can easily be found elsewhere with a search. Just a week after the latest Indian democracy vs Paki military terrorists dictatorship battle Colin comes with his x dozenth piece for propping up some Sikh farmers against New Delhi – Modi now. Never anything about let alone against Rawalpindi – the Generals. Pakistan attempted to target the Golden Temple on the intervening night of May 7-8; India’s air defence system, including indigenous Akash missiles and L-70 air defence guns, intercepted the Pakistani drones and missilesPublished – May 19, 2025 08:41 pm IST – CHANDIGARH The Hindu Bureau While in Pakistan the official (+ Pannu) narrative was that India itself had fired ballistic missiles from IAF base Adampur, 100 km to the East onthe holiest Sikh temple– technically impossible plus rationally + ethically nonsense. It was the Pak cover for if the Golden temple went up in their smokeas they fired on it, which didn’t happen only due to excellent Indian air defense. The Sikhs are being played by the ISI / Mi6/ CIA since years, in Canada, the UK and the US. Gotta keep India on tenterhooks, might get too mighty. If Colin is oblivious to this he should stop writing about India. Pakistani nuclear blackmail to breed terrorists with impunity is much more deadly to poor Indians (and Pakistanis) than GMOs: even OmG should see that. And who are you being played by? Foreign agribusiness and its World Bank cronies and the folk at APCO Worldwide who leveraged your hero into power? If you are oblivious to this (or merely choose to ignore it) you should stop commenting on India ag (I forget – you don’t – you just engage in whataboutism and attack anyone who does). Anyway, what the heck has anything you have just said got to do with the issues facing Indian ag and the foreign takeover of the country’s agrifood system? You would rather divert attention from that. I look forward to your piece on the IMF-Pak article. Too hard for you? Easier to gripe and moan? The IMF in NYC just gave Pakistan = army 2 billion dollar after they send drones and rockets to the Golden temple, Delhi etc. The also support the Islamic student regime in Bangladesh.The WB and IMF have zero credit today in India. Again, WTF has that got to do with the issues affecting Indian agriculture. Deflect and divert all you like. Is a death farmer good because he doesn’t buy GmOs? You sound just like woke Justin Trudeau, another WEF puppet playing with Sikh sentiments. You never make much sense at the best of times, but now you can’t even write correct grammar. Regardless, you sound like a duplicitous shill for Bayer, Syngenta, Amazon, Cargill etc. Are you part of the ‘let nothing go’ crowd from Monsanto but now in the pay of Bayer? Hold your head in shame – if you have any! Not all of us are ex-colonial Anglos bro. How are you in other languages? You sure write like an Mi6 asset, better chance your tune if you want to get out of that. The same Mi6 is teasing Russia to nuke Ukraine (and beyond) is busy in Pakistan too. Divide and concur.GMOs are the lesser evil here, heavy users like Canada, the US, UK etc. still exist with them. You crack me up at times. I was waiting for the crass stupidity to begin. ‘Let nothing go’ and smear, smear, smear. You learnt the Monsanto playbook well! Well, what or who are you? As for Ukraine, CT has written a lot on that, including its agri sector and BlackRock’s takeover (you know, that person who ONLY EVER writes on India). Try reading up. It helps. It’s better than sloganeering/baseless attacks on other people. Not here…. You will find otherwise if you bothered to look! So you are blaming OmG for posting only your articles on Indian agriculture and not on other nations? Not blaming anyone aside from your myopic idiocy! Tell me, what is your contribution? What are you doing, aside from whining in comment threads? @This is, in effect, digital colonialism, where control over agricultural knowledge and decision-making shifts from the field to the corporate boardroom. What does the author think can occur if a board member publically exposes this so called private information for all to use, rather than just said corporation(s)? Might even cause a revolution. For the average aspirational Indian, that being 99% of Indians, whether rich, middle-class or currently poor, they probably see the corporate capture of farming as progress, unless it affects them directly. A ‘Big is best’ mentality. Unaware of what it really entails. Since this issue affects the small farmers and labourers from rural areas and the poorest communites, the burgeoning middle-class city dwellers for the most part have little interest. They are too busy chasing the next rupee, and looking to spend it on designer clothes, consumer durables and cars or to invest the money in the stock market. Anyone observant who has spent time in India or travelled around the country would at some point have seen the caste system in action. It is still a part of life there and there is a hierachy which can be seen by how senior employess will treat those who are below them. When a problem occurs each blame the one below until there is no-one below left to blame. Therefore, since rural farmers are of the lower castes their plight is of lesser concern, so long as those who are socioeconomically better off have a good choice of food available to buy. How can YOU have a good choice, while the farmer is still on the bottom and supposedly to be blamed for something? Soon all that is left of the food is cancer sticks and cancer powder, then the discomfort becomes unbearable at an ever growing younger age. For the average aspirational Indian, that being 99% of Indians, whether rich, middle-class or currently poor, they probably see the corporate capture of farming as progress, unless it affects them directly. A ‘Big is best’ mentality. Unaware of what it really entails. Since this issue affects the small farmers and labourers from rural areas and the poorest communites, the burgeoning middle-class city dwellers for the most part have little interest. They are too busy chasing the next rupee, and looking to spend it on designer clothes, consumer durables and cars or to invest the money in the stock market. Anyone observant who has spent time in India or travelled around the country would at some point have seen the caste system in action. It is still a part of life there and there is a hierachy which can be seen by how senior employess will treat those who are below them. When a problem occurs each blame the one below until there is no-one below left to blame. Therefore, since rural farmers are of the lower castes their plight is of lesser concern, so long as those who are socioeconomically better off have a good choice of food available to buy. I’m approaching 12 years in India and agree with you insofar as – like people elsewhere – most think it is ‘progress’, are wilfully ignorant of what’s really happening and don’t think it affects them. The better off are too caught up in consumerism, drinking expensive coffee and climbing the career ladder. You can do that if you want – but it’s no excuse for remaining ignorant of the situation in the fields and on the plate. Yes, I agree, ignorance should be no excuse. My experience is that consumerism and materialism are so rife in India among those who have disposable income, similar in China too, that the desire to play catch up with a western lifestyle means that people in general will overlook the negatives of ‘a fast growing economy in order to achieve their desires. I have heard conversations many times over in Mumbai coffee shops and bars where young Indians openly discuss in loud voices while speaking English how much money they have made on the stock market, in order to impress their friends and anyone else within earshot. On occasion even how much they had lost – strangely losing money seems to also be a status symbol since they had it to lose in the first place! Seems some Western governments are so concerned aboutthe only Democracy in the ME’s “escalation” against the peoplein the biggest open air prison in the world they’re threatening to ‘dosomething’ if the only Democracy in the ME doesnt tone it down…Translation: ‘get it off the Front Page’ for our sakes !! I think – the plan is to take complete control of what is grown on farming lands – such as GM crops of all kinds, and to virtually do away with conventional farming as we know it – not only does it return a huge profit for the GM companies – but GM crops can be tweaked (chemicals added etc) to have an effect on on those who consume them – these modified crops are passed-off as a way to feed the masses, but we really don’t know how detrimental to us these crops are going to be. I would suggest trying it on the sponcers first, if it works good for them, then we can try it. If it bombs on them, we skip it and still do alright. The problem with that strategy is it neglects their slow-burn plan of long term detrimental effects that is sewn into everything these criminal corporations promote as “for our well being”. The Netherlands and Sri Lanka also had agricultural “reforms” that attracted some attention a while back – but nothing since. What’s going on in this countries? And what about this pandemic treaty?…. Seek and you will find. Yes, what about our treacherous and treasonous governments who have already signed on to the WHO pandemic treaty? These governments need to be ousted for treason against the people!! Apparently the treaty is somewhat watered-down from the scary initial offering thank God. Plus the US is not involved so it’s a pretty lame agreement. Colin’s NGO is ob$$esed with Indian agriculture only, so don’t expect him to consider other countries. The shrinks call it ‘projective identification’. Blaming your neighbour for something you are yourself? Copyright © 2025OffGuardian Privacy Policy powered byWordPress Theme: OffGuardian byWild Reality.net HOME latest the COVID deception the ANTI-HUMAN agenda the MULTIPOLAR WORLD OPINION MEDIA ARTS & CULTUREpoetry & fictiongraphic artReviews poetry & fiction graphic art Reviews poetry & fiction graphic art Reviews support OffG ABOUT OFFGComment PolicyPrivacy PolicySubmission guidelines Comment Policy Privacy Policy Submission guidelines Comment Policy Privacy Policy Submission guidelines contact shop"}