{"id": 649, "name": "HITC", "domain": "hitc.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.hitc.com/carmelo-anthony-reveals-what-tyrese-haliburton-must-do-for-the-indiana-pacers-to-beat-the-oklahoma-city-thunder/", "title": "Carmelo Anthony Reveals What Tyrese Haliburton Must Do For The Indiana Pacers To Beat The Oklahoma City Thunder", "content": "FootballTransfersExclusivesFootball OpinionPremier League TableFixturesResults Transfers Exclusives Football Opinion Premier League Table Fixtures Results Transfers Exclusives Football Opinion Premier League Table Fixtures Results Golf NBA Tennis F1 **Follow us on** **NBA** **Carmelo Anthony reveals what Tyrese Haliburton must do for the Indiana Pacers to beat the Oklahoma City Thunder** As the NBA Finals approach, Carmelo Anthony has weighed in on the key Tyrese Haliburton move that could help the Pacers defeat the Thunder. Not everyone is thrilled with theNBAFinals matchup, but a closer look at the stats suggests these two teams were always on a collision course. The Indiana Pacers are led by Tyrese Haliburton, who is hoping to further prove himself as one of the NBA’s elite. On the other side, the Oklahoma City Thunder, led by Shai Gilgeous-Alexander, have been dominant all season.Gilgeous-Alexander is also chasing a chance to make historyalongside Michael Jordan and two other legends. Both squads have unique strengths and will look to capitalise on the other’s weaknesses, but Carmelo Anthony has a clear view of what Haliburton needs to do. **Carmelo Anthony says Tyrese Haliburton needs to touch the paint on every possession** Haliburton is known as one of the best passers in the league. The Pacers’ offence thrives on quick decisions and off-ball movement, with Haliburton pulling the strings. But what’s the one thing he needs to do to give Indiana the best shot at a title? Carmelo Anthony kept it simple. “Touch the paint every single time,” Anthony said on the7pm in Brooklyn Podcast. “Feet in the paint every single time. Because when he comes off the screen, a lot of the time the screens are high. “He’s got to just turn the corner and keep turning, get downhill, get his feet in the paint. Because everybody staying home now… But if you touch that paint, you’re messing up their rotations. “And he’s a great passer. He’s a hell of a passer. He sees the court, his IQ is immaculate. You have to go be aggressive too.” **Carmelo Anthony claims Tyrese Haliburton is underrated** Tyrese Haliburton has faced criticism in the past, even being labelled the league’s most overrated player. But after a standout playoff run, some — including teammate Myles Turner — believe he’s put those doubts to rest. Carmelo Anthony went further, saying Haliburton is actually undervalued. “He is underrated. He had people s——- on him,” Anthony said. “They said he’s overrated. He’s been underrated. He’s a very f—— great point guard. They don’t like his style of play.” Whether he’s underrated or not, Haliburton has a chance to reshape his reputation completely with one series. Leading the Pacers past the Thunder would silence any remaining doubters and elevate him to a new level in the eyes of fans and peers alike. About Us Meet The Team Contact Us Editorial Policy Corrections Fact Checking Advertising Policy Terms & Conditions Privacy Policy Complaints Privacy Settings a proud member of © 2025 GRV Media Ltd. All Rights Reserved GRV Media Ltd, 18 Mulberry Avenue, Widnes, Cheshire, WA8 0WN Company No. 04155089"}