{"id": 1814, "name": "The Liberty Beacon", "domain": "thelibertybeacon.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://www.thelibertybeacon.com/many-have-heard-about-the-recent-power-outages-in-spain-and-portugal-but-they-havent-heard-about-the-failed-backup-plan/#mh-comments", "title": "Many Have Heard About The Recent Power Outages In Spain And Portugal But They Havent Heard About The Failed Backup Plan", "content": "ABOUT ADVERTISE WITH US CONTACT MEDIA GUIDE OUR PARTNERS REALITY BITES Facebook Twitter Home HEALTH GOVERNMENT FREEDOM WORLD COMMENTARY ENVIRONMENT MEDIA FINANCIAL MILITARY Humor/Satire GLOBALISM [ 11/06/2025 ]Civil War 2.0?Analysis [ 11/06/2025 ]Press Freedom at Stake (Again): Germany Weighs Ban on Right-Wing MagMEDIA [ 11/06/2025 ]Anti-Migrant Riots Erupt in Northern Ireland After “Romanian Teenagers” Charged With Sexual AssaultGOVERNMENT [ 11/06/2025 ]LA Mayor Declares Local Emergency, Issues A Curfew For Downtown Los AngelesGOVERNMENT [ 10/06/2025 ]Trump and Musk: Fix it! Please!Analysis **Solar Panels And The Chinese Threat** 03/06/2025This article was posted by TLB StaffAnalysis,ENVIRONMENT,GOVERNMENT,TECHNOLOGY,WORLD0 Many have heard about the recent power outages in Spain and Portugal, but they haven’t heard about the failed backup plan, which was supposed to see the two countries get emergency power from France’s nuclear grid. People died, lives were interrupted, and the perception of wonderful clean energy took a major hit. It can happen here, through a combination of the inherent limitations of renewable energy and the fact that China is deeply entangled in America’s renewables. Spain and Portugal rely onwind and solar energyfor about 56% and 42% respectively for their electrical needs, which is one of the highest reliances of any country. Their grids failed primarily due to what experts call “grid instability.” To understand this, you first must know that nuclear, coal, and gas power plants have massive steel turbines that provide large rotating mass—inertiathat can maintain stability if there are fluctuations in the grid. Wind and solar don’t have this regulating mechanism, which, in America, gives us our all-important 60 Hz power. There are ways around the problem, but the alternatives are expensive and unproven. Wind and solar power are unstable because they don’t providebaseload power; that is, the minimum electrical demand level that must be consistently met. It represents the steady energy production required to keep essential services, industries, and infrastructure running, regardless of fluctuations in usage. Baseload power is provided by energy sources that run uninterrupted, such as: Coal-fired power plants Nuclear power plants Large-scale hydroelectric plants Geothermal power By definition, wind and solar are inherently unreliable; the sun sets and winds abate, at which point power production ceases. Demand, however, is always there. Even using batteries is a stopgap measure, so much so that the Biden administration realized that wind and solar could not meet all demand scenarios and, therefore, were planning totap the batteries in EVsto supplement the grid. The bottom line is that wind and solar power will never be able to replace traditional baseload power sources. Attempting to do so will require huge capital investments in newpeaking(backup power) sources and storage mechanisms, and the cost of electricity will continue to soar, leading to a lowered quality of life. And then there’s the China problem of renewable energy, given that China is the world’s primary manufacturer of solar panels. Solar panels that make electricity suitable for the power grid are usually connected to the weband can be“easily hacked, remotely disabled or compromised for DDoS [Distributed Denial of Service] attacks.” DDoS attacks try to overwhelm a system. Solar panels have intrinsic vulnerabilities to hacking due to the dominance of a single country, China, in thesupply chain.” If there were such an attack,Daniel Croft explains how bad it would be: “Cyber Security CRC chief executive Rachael Falk said that the threat presented by foreign-manufactured solar inverters is a recent one, as only recent models are internet-connected due to increased interest in smart home technology. “Traditionally, cyber risk with solar inverters was low because they were not connected to the internet,” said Falk. “However, as the popularity of smart home energy systems has boomed, this has changed, with most solar inverters now web connected.” Falk continued to say that an attack on the solar grid could spark a “black start” event, which could result in the entire power grid going down. “While an attack on one home solar system would not impact the grid, scaled, targeted simultaneous attacks could be catastrophic, resulting in a ‘black start’ event. “In a black start event, power plants are incapable of turning back on without reliance on an auxiliary power source, like a generator or battery. “This could bring down an entire power grid, and it could take a week to recover,” she said. As the tweet above indicates, China has “kill switch” plans for those solar panels it controls. Experts worry that these devices could be exploited to remotely disable or alter the operation of solar farms, disrupting power grids. China, of course, has dismissed these claims as politically motivated, leaving us asking how much we are willing to trust China. It shouldn’t be much because China has demonstrated its intentions already: Cityworks Zero-Day Exploit(2025)—A Chinese-speaking hacker group exploited a vulnerability in Trimble Cityworks, a system used by local governments and utilities for infrastructure management. The attackers accessed utility management systems, deploying malware to maintain long-term persistence. Volt Typhoon Campaign—The Volt Typhoon group, linked to China, has been identified as a major cyber threat to U.S. utilities. They use “living-off-the-land“ techniques, exploiting existing infrastructure rather than deploying obvious malware, making detection difficult. Massachusetts Public Utility Breach(2025)—The VOLTZITE hacker group successfully breached a public power utility in Massachusetts, collecting operational technology data and geographic information system (GIS) files. Their tactics allowed them to remain undetected for months. These attacks highlight China’s long-term cyber strategy, which focuses on infiltrating critical infrastructure to maintain access for potential future disruptions. Combined with what we already know aboutHuawei’snetworking equipment containing hidden capabilities designed for cyber-attacks and China’s infrastructure attacks, there can be no doubt of China’s malevolent intent. The threat is so well known that the U.S. government has issuedmultiple warningsand restrictions regarding Huawei, particularly its AI chips and telecommunications equipment.Recently, the Department of Commerce stated that using Huawei’s Ascend AI chips anywhere in the world violates U.S. export controls. We now have no excuse to ignore this threat! **••••** Articles Author, Businessman, Thinker, and Strategist. Read more about Allan, his background, and his ideas to create a better tomorrow atwww.1plus1equals2.com. Featured Image graphic created using AI anda photo by AleSpa(CC BY-SA 3.0). **••••** **••••** The Liberty Beacon Projectis now expanding at a near exponential rate, and for this we are grateful and excited! But we must also be practical. For 10 years we have not asked for any donations, and have built this project with our own funds as we grew. We are now experiencing ever increasing growing pains due to the large number of websites and projects we represent. So we have just installed donation buttons on our websites and ask that you consider this when you visit them. Nothing is too small. We thank you for all your support and your considerations … (TLB) **••••** Comment Policy:As a privately owned web site, we reserve the right to remove comments that contain spam, advertising, vulgarity, threats of violence, racism, or personal/abusive attacks on other users. This also applies to trolling, the use of more than one alias, or just intentional mischief. Enforcement of this policy is at the discretion of this websites administrators. Repeat offenders may be blocked or permanently banned without prior warning. **••••** Disclaimer:TLB websites contain copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available to our readers under the provisions of“fair use”in an effort to advance a better understanding of political, health, economic and social issues. The material on this site is distributed without profit to those who have expressed a prior interest in receiving it for research and educational purposes. If you wish to use copyrighted material for purposes other than“fair use”you must request permission from the copyright owner. **••••** Disclaimer:The information and opinions shared are for informational purposes only including, but not limited to, text, graphics, images and other material are not intended as medical advice or instruction. Nothing mentioned is intended to be a substitute for professional medical advice, diagnosis or treatment. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X **Like this:** baseload power batteries China’s malevolent intent Chinese threat cyber security renewable energy Solar panels U.S. export controls wind power **Related Articles** **Micro vs Macro…** **Dems Double Down On selling Our (SPR) Oil To China** **The Real ‘Green’ In Green Energy Is All The Money Involved In It** **Leave a Reply** Your email address will not be published. Comment Name* Email* Website Civil War 2.0?11/06/20250 Civil War 2.0? Civil War 2.0? Press Freedom at Stake (Again): Germany Weighs Ban on Right-Wing Mag11/06/20250 Press Freedom at Stake (Again): Germany Weighs Ban on Right-Wing Mag Press Freedom at Stake (Again): Germany Weighs Ban on Right-Wing Mag Anti-Migrant Riots Erupt in Northern Ireland After “Romanian Teenagers” Charged With Sexual Assault11/06/20250 Anti-Migrant Riots Erupt in Northern Ireland After “Romanian Teenagers” Charged With Sexual Assault Anti-Migrant Riots Erupt in Northern Ireland After “Romanian Teenagers” Charged With Sexual Assault LA Mayor Declares Local Emergency, Issues A Curfew For Downtown Los Angeles11/06/20250 LA Mayor Declares Local Emergency, Issues A Curfew For Downtown Los Angeles LA Mayor Declares Local Emergency, Issues A Curfew For Downtown Los Angeles Trump and Musk: Fix it! Please!10/06/20251 Trump and Musk: Fix it! Please! Trump and Musk: Fix it! Please! The Great Replacement Is No longer Theory – It’s Reality10/06/20250 The Great Replacement Is No longer Theory – It’s Reality The Great Replacement Is No longer Theory – It’s Reality Fed Up with Migrant Chaos, Dutch Citizens Set Up DIY Border Checks10/06/20250 Fed Up with Migrant Chaos, Dutch Citizens Set Up DIY Border Checks Fed Up with Migrant Chaos, Dutch Citizens Set Up DIY Border Checks Orbán calls on French patriots to help ‘save Europe from the Brussels guillotine’ in fiery rally speech10/06/20250 Orbán calls on French patriots to help ‘save Europe from the Brussels guillotine’ in fiery rally speech Orbán calls on French patriots to help ‘save Europe from the Brussels guillotine’ in fiery rally speech RFK Jr. Orders Clean Sweep of Entire CDC Vaccine Advisory Panel to End Decades of Corruption10/06/20251 RFK Jr. Orders Clean Sweep of Entire CDC Vaccine Advisory Panel to End Decades of Corruption RFK Jr. Orders Clean Sweep of Entire CDC Vaccine Advisory Panel to End Decades of Corruption COVID cover-up probes focus on early military intel that ‘virus was man-made’09/06/20251 COVID cover-up probes focus on early military intel that ‘virus was man-made’ COVID cover-up probes focus on early military intel that ‘virus was man-made’ Trump ‘Would Arrest’ CA Gov As Bessent Warns Over ‘Criminal Tax Evasion’09/06/20250 Trump ‘Would Arrest’ CA Gov As Bessent Warns Over ‘Criminal Tax Evasion’ Trump ‘Would Arrest’ CA Gov As Bessent Warns Over ‘Criminal Tax Evasion’ Verging On Tears, DNC Chair: ‘I Don’t Know If I Wanna Do This Anymore’09/06/20250 Verging On Tears, DNC Chair: ‘I Don’t Know If I Wanna Do This Anymore’ Verging On Tears, DNC Chair: ‘I Don’t Know If I Wanna Do This Anymore’ Landmark Case: Belgium’s Arms Shipments to Israel09/06/20250 Landmark Case: Belgium’s Arms Shipments to Israel Landmark Case: Belgium’s Arms Shipments to Israel TLBTalk Radio: America In Decline09/06/20251 TLBTalk Radio: America In Decline TLBTalk Radio: America In Decline Politicians and Bankers Are Crooks09/06/20251 Politicians and Bankers Are Crooks Politicians and Bankers Are Crooks Enter your email address to subscribe to this blog and receive notifications of new posts by email. Email Address Subscribe Privacy Policy CONTACT sitemap Copyright © 2012 - 2025 | TLB Project™ LLC"}