{"id": 84, "name": "APM Reports", "domain": "apmreports.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.apmreports.org/story/2024/03/20/judges-use-arbitrary-horrendous-reasons-to-keep-teens-in-adult-court", "title": "Judges Use Arbitrary Horrendous Reasons To Keep Teens In Adult Court", "content": "Our Reporting Podcasts About Us Our ReportingEducationEnvironmentGovernmentHealthHistoryPolicing and Criminal JusticeReadingTeen Treatment Industry Education Environment Government Health History Policing and Criminal Justice Reading Teen Treatment Industry Education Environment Government Health History Policing and Criminal Justice Reading Teen Treatment Industry PodcastsAPM Reports DocumentariesEducateHistorically BlackIn DeepOrder 9066Sent AwaySold a StorySold a Story en español APM Reports Documentaries Educate Historically Black In Deep Order 9066 Sent Away Sold a Story Sold a Story en español APM Reports Documentaries Educate Historically Black In Deep Order 9066 Sent Away Sold a Story Sold a Story en español About UsContact UsEmail NotificationsEthics GuidelinesImpactOur JournalistsPublic Media Accountability Initiative Contact Us Email Notifications Ethics Guidelines Impact Our Journalists Public Media Accountability Initiative Contact Us Email Notifications Ethics Guidelines Impact Our Journalists Public Media Accountability Initiative Search Facebook Instagram **Judges use ‘arbitrary,’ ‘horrendous’ reasons to keep teens in adult court** STORY:Rachel Baye|Jennifer Lu|Claire Keenan-Kurgan Maryland automatically charges more teens as adults than almost any other state. An analysis of recent decisions found that some judges rely on what juvenile justice advocates say is unfair reasoning to keep those young people in adult court. Facebook Twitter Email March 20, 2024 Each year, hundreds of Maryland teens find themselves face to face with a judge and two possible outcomes: a judgment in adult court and possible prison time, or a transfer to the juvenile court and the opportunity to get therapy. It’s up to the judge to decide. An investigation by WYPR and APM Reports found that some judges are using what juvenile justice advocates say are arbitrary and inconsistent reasons to keep teenagers charged with serious crimes in adult court. A review of more than three dozen court hearings over the past three years found a process that subjects teenagers to adult jails, courts and sentences despite decades of research showing these tactics push teens to commit more crimes. When deciding whether to treat these children as adults, judges sometimes relied on questionable reasoning. The findings include: A Baltimore City judge said a teenager’s large size was an argument to keep him in the adult system. A Baltimore City judge said a teenager’s large size was an argument to keep him in the adult system. A Baltimore City judge said a teenager’s large size was an argument to keep him in the adult system. A Baltimore County judge said a defendant found to pose a “low to moderate risk of reoffending” should stay in the adult court largely because he missed a lot of school. A Baltimore County judge said a defendant found to pose a “low to moderate risk of reoffending” should stay in the adult court largely because he missed a lot of school. A Baltimore County judge said a defendant found to pose a “low to moderate risk of reoffending” should stay in the adult court largely because he missed a lot of school. A Montgomery County judge said a teen evaluated as “low risk” seemed inclined to participate in treatment, but ruled that the teen did not have severe enough mental illness to warrant moving him to juvenile court. A Montgomery County judge said a teen evaluated as “low risk” seemed inclined to participate in treatment, but ruled that the teen did not have severe enough mental illness to warrant moving him to juvenile court. A Montgomery County judge said a teen evaluated as “low risk” seemed inclined to participate in treatment, but ruled that the teen did not have severe enough mental illness to warrant moving him to juvenile court. A Wicomico County judge decided there was “insufficient evidence” that a 14-year-old boy with severe intellectual disabilities would change his behavior after the juvenile system’s treatment programs. A Wicomico County judge decided there was “insufficient evidence” that a 14-year-old boy with severe intellectual disabilities would change his behavior after the juvenile system’s treatment programs. A Wicomico County judge decided there was “insufficient evidence” that a 14-year-old boy with severe intellectual disabilities would change his behavior after the juvenile system’s treatment programs. A Baltimore City judge questioned whether a juvenile sentence would “be of sufficient duration” to treat the extensive mental health needs of a teen with an intellectual disability, despite medical experts’ testimonies that the programs would help him. A Baltimore City judge questioned whether a juvenile sentence would “be of sufficient duration” to treat the extensive mental health needs of a teen with an intellectual disability, despite medical experts’ testimonies that the programs would help him. A Baltimore City judge questioned whether a juvenile sentence would “be of sufficient duration” to treat the extensive mental health needs of a teen with an intellectual disability, despite medical experts’ testimonies that the programs would help him. Advocates who reviewed the findings called the judges’ statements “appalling” and “unfair.” “The first word that comes to mind is ‘horrendous,’” said Natasha Dartigue, head of the Maryland Office of the Public Defender. “A second word that comes to mind is ‘heartbreaking.’” When asked about the rulings, a spokesman for the Maryland Judiciary said in an email that the judiciary cannot comment on individual cases but noted that judges face a difficult task and must evaluate “a myriad of factors for each case’s unique circumstances.” Maryland law has long required teens charged with any one of more than 30 different crimes to be placed in adult court. As a result, the state automatically charges more youth as adults than almost any other state, according to data from The Sentencing Project. The vast majority are Black. These findings come in the wake of a 2021 Supreme Court of Maryland ruling that says teens charged as adults should be placed in the juvenile system if they're likely to benefit from its therapeutic programs. The analysis also comes as communities across the region grapple with fears of elevated juvenile crime, although data shows juvenile arrests are on the decline. Nearly half of the teens whose cases remain in adult court end up having their charges dropped or are otherwise not convicted. Youth also spend an average of 7 1/2 months waiting — sometimes in adult jail — for their cases to be resolved, according to an analysis of data from the Maryland judiciary and jail records. Advocates have been trying to repeal the state’s automatic charging law for years. But those efforts have met fierce resistance from elected prosecutors who say reform will undermine public safety. While testifying in opposition to one such bill last year, Baltimore County State’s Attorney Scott Shellenberger hearkened back to a notorious 1995 rape of a school nurse by a student. “These are not children. These are not children!” he shouted, enunciating each word as he invoked some of the most egregious crimes caused by teens. Prosecutors and judges are tasked with keeping the public safe, and few would envy the decisions each must make. Many of the cases reviewed by WYPR and APM Reports detail teens behaving in troubling and dangerous ways. But only a small minority of teens affected by this law were charged with such horrific crimes as rape or murder. Each year, Maryland prosecutors automatically charge an average of roughly 700 cases involving juvenile defendants in the adult court system for a range of crimes including misdemeanor gun possession and first-degree assault. The juvenile system provides youth and their families with treatment designed to prevent future offenses. The adult system is more punitive. It offers fewer treatment options, and none specifically for minors. For at least two decades, studies have repeatedly shown that charging juveniles as adults increases rates of reoffending. Youth who spend time in adult jails or prisons are more likely to reoffend and to reoffend faster, were arrested more times on average, and had longer criminal careers than those who did not spend time in adult detention facilities, according to a 2022 study that followed roughly 13,000 16- and 17-year-olds arrested in New York in 1987 and charged as adults. Yet prosecutors say too many youth commit crimes after spending time in Maryland’s juvenile system. They argue the adult system does a better job of keeping the public safe, in part because courts can keep tabs on defendants for lengthy probation and parole periods. And to keep young people in the adult system, some prosecutors made arguments that discounted scientific research. In southern Maryland, Charles County prosecutor John Stackhouse suggested in at least two cases that judges disregard well-established research showing adolescent brains continue developing until age 25. “You can find a study that says anything,” he told the judge. Tony Covington, the state’s attorney in Charles County and Stackhouse’s boss, has “no reason to doubt the research,” but said the judge in each case should consider “what is the extent of [the defendant’s] lack of development?” **Traumatized teen or ‘robot’ made for crime?** In Maryland, a child charged as an adult can ask a judge to transfer his or her case to the juvenile system, which offers extensive treatment services. A 2021 decision from the Supreme Court of Maryland,Davis vs. State, says during these transfer hearings, judges must prioritize the child’s likelihood of benefitting from therapeutic programming in the juvenile system. Other factors, including public safety and the severity of the alleged crime, must “converge on amenability to treatment,” according to the ruling. Since that decision, judges have transferred about two-thirds of cases to juvenile court. Last spring, a 16-year-old was facing carjacking charges in the courtroom of Prince George’s County Judge Michael Whalen. According to police, the teenager walked up to a man in a parked car at a 7-Eleven convenience store, showed him a gun, then took his car. Kevin, who we’re identifying by his middle name because he’s a minor, had already experienced more traumatic events than many people face in their lives. He was sexually abused at age 6, according to expert testimony. Three friends died, one in his arms. Kevin was shot, too, and while he was recovering became addicted to opioids. His stepfather was murdered about a month after Kevin was shot. Kevin was charged with carjacking just three months after that. “I felt like the world wasn’t giving me no chances, so why give anybody else a chance?” he said in an interview. “I felt like it wasn’t getting no better.” In a report, a social worker told the court that Kevin’s traumatic experiences “were likely significant contributing factors” to his actions. Kevin had not had “appropriate mental health care,” she wrote, and his risk factors “are able to be best mitigated and treated through the services available within the Department of Juvenile Services.” A psychologist recommended Kevin receive several mental health services, including individual cognitive behavioral therapy and intensive family counseling. Based in part on her report, the Department of Juvenile Services recommended placing Kevin in a residential program. Kevin’s family and friends came to the transfer hearing. Some told Whalen about Kevin’s supportive home environment and his kind, respectful nature. But Kevin’s family support and good behavior worked against him. Whalen pointed out that Kevin was respectful and courteous to his family during the same time period he was committing crimes, “so I think he can be as manipulative as anyone.” Whalen also noted that Kevin continued to get passing grades at school despite “all this apparent emotional instability,” and said he didn’t believe Kevin’s behavior changed significantly from the time he was shot until he was arrested. “Having the support that he did,” Whalen ruled from the bench, “I do not believe that he is amenable for treatment.” On a Zoom call from a special prison in Baltimore for people under age 18, Kevin recalled hearing Whalen’s decision. “It didn’t add up to me,” he said. “It was almost like he was just making it seem like I was a robot made specifically for crime.” After Kevin lost his transfer hearing, he pleaded guilty to robbery. Had he initially been charged with robbery instead of carjacking, his case would have started in juvenile court and would havebeen resolved within 60 days, as required by law. Instead, Kevin spent 347 days in detention, including a few months in adult jail. Eventually, another judge sentenced Kevin to time already served, plus a year and a half in prison: much more than the three months to a year teens typically receive in juvenile facilities. Kevin, now 17, said he did commit a crime and deserved to be held accountable. But he said he wishes people would understand that he’s still a child, and when he has nightmares, he still crawls into his mom’s bed. Kevin’s case was one of more than three dozen transfer hearings reviewed by WYPR and APM Reports. Throughout the hearings, judges struggled to find objective ways to measure amenability, and prosecutors made forceful, and at times, dubious claims in their efforts to keep cases in adult court. Whalen, the judge in Kevin’s case, repeated a refrain at multiple hearings as he announced his decisions to keep youth in adult court. He said he acknowledged the requirement to consider a youth’s amenability to treatment. “However,” he said, “I believe that the appellate courts expect trial judges to execute some common sense when they make their decisions.” **‘Completely, utterly absurd’** There are so many children charged as adults in Maryland that some adult courts have their own juvenile divisions. Circuit Court Judge Emanuel Brown was the “judge-in-charge” of one such division in Baltimore City between 2018 and his retirement last fall. In a 2021 case, Brown denied a transfer to the juvenile court in part because of the teen’s size. The teen, he said, “is listed physically as being 6 feet, 1 inches tall and 164.4 pounds. That factor weighs against transfer.” Marsha Levick, chief legal officer and co-founder of the Juvenile Law Center, said raising a child’s physical size in the context of whether they are amenable to treatment is “completely, utterly absurd.” “By any measure, it has zero to do with their capacity for rehabilitation,” she said. State law requires judges consider “the mental and physical condition of the child” when deciding whether to transfer a youth to the juvenile court. But Aisha Braveboy, the state’s attorney in Prince George’s County, said using size as a reason to deny transfer is “unfair” and “could lead to outcomes that are problematic.” In another case, Brown declined to transfer a 17-year-old with no prior record, although he acknowledged the teen had asked for treatment and “has some mental health challenges that would better be treated in the juvenile justice system.” As a child, the boy had repeatedly broken his father’s rules forbidding him from leaving the house except to attend school. Because of this, his father kicked him out at age 12, making him homeless. In his decision, Brown said the teen’s decision not to return home was evidence he didn’t respect authority and therefore would not be amenable to treatment. At other hearings in Baltimore City, prosecutors argued that teens who decided to get tattoos or have sex had made adult decisions and therefore should be tried as adults. Baltimore City State’s Attorney Ivan Bates defended the practices of his staff. In a written statement, he claimed Baltimore prosecutors based their arguments on legal precedence. “It is unfair to take snippets of an argument that, taken out of context, does a disservice to the youth and the law,” Bates wrote. **‘Arbitrary’ decisions stem from an ‘arbitrary’ standard** Judges including Brown at times seemed to disagree on whether teens’ mental health diagnoses should weigh for or against transfer to juvenile court. In one case, Brown chose to keep a 16-year-old charged with a misdemeanor gun offense in the adult system — which offers little mental health or substance-use treatment — in part because the teen struggled with mental illness. “The juvenile system regularly addresses these kinds of offenses,” Brown said. “However, public safety concerns increase exponentially when the juvenile possessing a loaded handgun has mental health challenges, and reportedly use marijuana.” But in Montgomery County, Judge Kevin Hessler opted not to send a teen charged with misdemeanor gun possession to juvenile court because his mental illness wasn’t severe enough. The defendant, evaluated as low risk, was on track to graduate high school and wanted to go to college. He was diagnosed with generalized anxiety and a trauma- and stressor-related disorder. Hessler acknowledged that the defendant seemed likely to participate in treatment but said the defendant’s mental health conditions were not severe enough “to militate significantly against trying him as an adult.” He denied the transfer to juvenile court. Kids’ school records were one of the most frequently cited reasons judges gave for denying transfer — second only to the severity of the alleged offense, according to the analysis of transfer hearings. Last June, Baltimore County Judge Colleen Cavanaugh said a defendant found to pose a “low to moderate risk of reoffending” should stay in the adult court largely because he had missed a lot of school. “What gets me,” she said, is “just the lack of participating in that structure.” Ronald Means, a forensic psychiatrist working with Baltimore youth, said kids charged in adult court often have low IQs or intellectual disabilities. If a defendant’s school doesn’t provide appropriate resources, he said “they’re gonna start skipping school because they have no chance of success.” Juvenile justice advocates who reviewed the rulings say they’re disturbed by the reasoning offered by Cavanaugh and others for keeping youth in the adult system. But they also cast blame on the law and theDavisdecision that judges must rely on. “Linking the future of a young person to this word ‘amenability’” is arbitrary, because “it can be defined in any way,” said Mary Ann Scali with the Gault Center, a juvenile justice advocacy group. Judges rarely discuss their cases with the media, and none of those named in this report responded to an email asking them about their rulings. Spokesman Bradley Tanner emailed a statement on behalf of the Maryland Judiciary. While he wouldn’t discuss specific rulings, Tanner noted “a judge must consider many factors rather than just” amenability. Maryland law specifically requires judges address a child’s age, mental and physical condition, the nature of the alleged crime, and public safety in their decisions. Additionally, Tanner said, judges must “determine whether a defendant has met their burden of proving by a preponderance of the evidence that they are amenable to treatment and service available through the Department of Juvenile Services.” An analysis of juveniles who remain in adult court found that most of those who stay in adult court faced felony charges — some for very violent crimes. In one case, a teenager fired a weapon at a car, missed his target and permanently injured a 73-year-old woman inside a nearby home. In another, a 17-year-old was charged with participating in three carjackings and robberies in a matter of weeks, at one point hitting an Uber driver repeatedly with a gun. In a third, a 17-year-old robbed a woman at gunpoint and led police on a high-speed chase that ended in a crash. During hearings and in interviews, judges and prosecutors questioned the juvenile system’s ability to protect the public. The Department of Juvenile Services estimates 50% of kids who receive their services are rearrested within two years, and 20% are convicted of a crime. Braveboy, the Prince George’s County prosecutor, says the system is broken. “If I could wave my magic wand, what I would do is have a more robust juvenile system that we could all agree will hold kids accountable, will make public safety the priority, while giving treatment to young people in a way that is holistic,” Braveboy said. “But that’s not happening in many cases.” Strengthening the juvenile justice system is a top priority for legislative leaders and Maryland Gov. Wes Moore. But the reform bill they’re backing during this year’s General Assembly session does not change the law that lands several hundred teens in adult court each year. Instead, legislative leaders say they want to focus on improving the Department of Juvenile Services. The person Moore appointed to run that system, Secretary Vincent Schiraldi, has said he wants all juvenile cases to start in juvenile court. “Maryland has one of the nation’s highest rates of incarcerating young people in our adult prisons,” Schiraldi told South Baltimore residents at a town hall in December. “So if simply locking kids up in adult prisons was a solution, we’d already be feeling much safer now.” Although research shows longer sentences do not improve juvenile recidivism rates, judges and prosecutors frequently cite the juvenile system’s shorter periods of probation and detention as reasons to deny transfer. In a transfer hearing early last year, an attorney noted his client’s documented intellectual disability and mental health disorders. He listed the many treatments offered by DJS that medical experts had said would help. But Baltimore City Judge Paul Cucuzzella questioned whether, “given the defendant’s extensive needs,” a sentence in juvenile court would “be of sufficient duration” to prevent the teen from committing another crime. He then ruled that the case should remain in the adult system, which offers little to no treatment. **Policy fails to see ‘Black and brown children as children’** Initially, only youth charged with crimes like first-degree murder and rape were automatically charged in Maryland’s adult courts. Then, during the “tough on crime” era of the 1990s, state lawmakers added crimes such as carjacking, assault and misdemeanor firearms charges to those excluded from the juvenile system. In 2001, a legislative commission found the changes disproportionately punished Black boys with histories of trauma, mental health needs, and educational difficulties. Since then, little has changed. In 2017, a 16-year-old named Howard Jimmy Davis was charged as an adult after a home invasion. Experts said he was at low risk for future violence and was open and amenable to treatment, but a judge denied his transfer request to the juvenile system. Davis appealed and won his case, and in July 2021, the Supreme Court of Maryland ruled that judges must weigh a teen’s “amenability to treatment” above other factors. Since the ruling, judges have transferred more cases to juvenile court. In the six years before theDavisruling, roughly half of the cases involving teens charged automatically as adults were transferred to juvenile court, according to state data. In the two years followingDavis, about two-thirds of cases were transferred. Roughly 8 in 10 juveniles automatically charged as adults over the past five years were Black. Nearly all — 92% — were male, according to an analysis of state data. Charging children as adults “feeds into the historic racist practices that we saw — that started decades and decades ago,” said Natasha Dartigue, head of the Maryland Office of the Public Defender. “It further feeds into the narrative that fails to recognize our children, especially our Black and brown children, as children.” **Being in prison ‘makes me want to just give up’** Twenty-one-year-old Dazier Wilson has been locked up since she was charged as an adult with armed carjacking at age 16 in Baltimore City. Wilson had a tough early life. Her father “basically disowned her” for being gay, and both her father and her stepfather physically abused her, a psychologist told the court. As one of the youngest inmates at an adult prison, Wilson said she became the target of bullying, and experienced depression and thoughts of harming herself throughout her time behind bars. “I'm tired of going through the same thing,” she said. “I can't do nothing about it, and it just makes me want to just give up.” Wilson said she has not had access to therapy but was given antidepressant medication, which she claims is not working. Like Wilson, nearly all of the teens whose cases WYPR and APM Reports reviewed experienced significant trauma before being charged in adult court. Their cases detailed stories of homelessness, physical or sexual abuse, the loss of relatives to gun violence or prison, and acute poverty. The Department of Juvenile Services offers programs specifically designed to treat trauma in adolescents. Each year Maryland taxpayers spend more than $25 million on a long list of programs including mentoring, dialectical behavioral therapy and family systems therapy, both in the community and at its residential facilities. Research shows that therapy reduces individuals’ likelihood of reoffending. Almost every transfer hearing WYPR and APM Reports reviewed included a discussion of the services available in the juvenile and adult systems. At times, judges seemed to believe youth could access programs in the adult system that are rarely — if ever — offered. In Maryland’s adult prisons, mental health treatment is generally “self-directed,” social worker Melinda Merlo testified at a transfer hearing last year. “Here’s your workbook, work through this, and then here’s your certificate we give you,” she told a judge. “It’s not like an actual therapist or an actual person.” One maximum security adult prison has a special program for which teens charged as adults can apply after they turn 18. If accepted, facility officials have said they receive once-a-week group therapy. Prosecutors and judges often held up the existence of the Patuxent Youth Program as an argument to deny teens transfer to the juvenile system. But Means, the psychiatrist, said Patuxent doesn’t have the capacity to treat youth as successfully as the juvenile system, and its staff members are not trained to work with teens. “Having a youth receive services at the Department of Juvenile Services is always more beneficial than anything they would receive in the adult system,” Means said. Wilson expects to be released from the Maryland Correctional Institution for Women at the end of next month. Because she was locked up so young, Wilson said she doesn’t know how to make a doctor’s appointment, apply for a job or pay a bill. She said she wishes she had access to programs that would help her “move in the right direction.” “We all make mistakes and we go through things,” she said, “but I don't feel as though they should just throw us behind bars.” Emily Haavik, Ellie Roth and Allison Herrera contributed to this report. Subscribe Our Reporting Podcasts About Us FacebookInstagram Facebook Instagram Facebook Instagram © 2025 Minnesota Public Radio. All Rights Reserved. Terms and Conditions Privacy Policy"}