{"id": 219, "name": "Chicago Reporter", "domain": "chicagoreporter.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.chicagoreporter.com/tip-and-wage-theft-still-prevalent-in-chicago-restaurant-industry-despite-new-ordinance/", "title": "Tip And Wage Theft Still Prevalent In Chicago Restaurant Industry Despite New Ordinance", "content": "DONATE SUBSCRIBE TopicsOpen dropdown menuChild and FamilyCriminal JusticeEducationEmployment and LaborGovernment and PoliticsHealthHousingImmigrationRace and CultureTransportation Child and Family Criminal Justice Education Employment and Labor Government and Politics Health Housing Immigration Race and Culture Transportation Child and Family Criminal Justice Education Employment and Labor Government and Politics Health Housing Immigration Race and Culture Transportation PerspectivesOpen dropdown menuAll PerspectivesOur VoicesCurtis Black: The Powers That Be All Perspectives Our Voices Curtis Black: The Powers That Be All Perspectives Our Voices Curtis Black: The Powers That Be AboutOpen dropdown menuOur HistoryOur StaffOur SupportersAwards Our History Our Staff Our Supporters Awards Our History Our Staff Our Supporters Awards ArchiveOpen dropdown menuSearch the Archive, 1972-presentArchives 1990-1995 Search the Archive, 1972-present Archives 1990-1995 Search the Archive, 1972-present Archives 1990-1995 Facebook Instagram YouTube RSS Feed **Support NonProfit News** **Support NonProfit News** Facebook Instagram YouTube RSS Feed The Chicago Reporter Investigating race and poverty since 1972 DONATE SUBSCRIBE TopicsOpen dropdown menuChild and FamilyCriminal JusticeEducationEmployment and LaborGovernment and PoliticsHealthHousingImmigrationRace and CultureTransportation Child and Family Criminal Justice Education Employment and Labor Government and Politics Health Housing Immigration Race and Culture Transportation Child and Family Criminal Justice Education Employment and Labor Government and Politics Health Housing Immigration Race and Culture Transportation PerspectivesOpen dropdown menuAll PerspectivesOur VoicesCurtis Black: The Powers That Be All Perspectives Our Voices Curtis Black: The Powers That Be All Perspectives Our Voices Curtis Black: The Powers That Be AboutOpen dropdown menuOur HistoryOur StaffOur SupportersAwards Our History Our Staff Our Supporters Awards Our History Our Staff Our Supporters Awards ArchiveOpen dropdown menuSearch the Archive, 1972-presentArchives 1990-1995 Search the Archive, 1972-present Archives 1990-1995 Search the Archive, 1972-present Archives 1990-1995 **Tip and Wage Theft Still Prevalent in Chicago Restaurant Industry Despite New Ordinance** **Share this:** Click to share on Facebook (Opens in new window) Click to share on X (Opens in new window) Chicago’s City Council passed a new ordinance intended to guarantee living wages for service industry workers, but experts believe that more strict legislation is needed to safeguard against employer fraud. The Chicago One Fair Wage ordinance, passed in October, will phase out Chicago’s subminimum wages for tipped workers over a five-year period, impacting restaurants in all 77 neighborhoods. But activists and lawyers say the new legislation will not fix the city’s inefficient and ineffective system for reporting tip and wage theft. “Employers will just find a different way to cheat …I can walk into probably any restaurant in the United States and find at least one wage-an-hour violation.” Existing bad actors will continue to take advantage of workers who do not fully understand the language of Chicago’s minimum wage laws, said Douglas M. Werman, a lawyer at Werman Salas P.C., who has won his clients more than $400 million in work-related lawsuits. “Employers will just find a different way to cheat,” he said. “I can walk into probably any restaurant in the United States and find at least one wage-an-hour violation.” Addressing the city’s wage theft problem may require even more sweeping changes in government practices, said Jorge Mújica, an organizer with Arise Chicago, an advocacy group for labor rights. The Cook County Minimum Wage Ordinance, passed in 2014, fined businesses if they were found in violation of wage laws, but more than three-quarters of the county’s municipalities had opted out of the ordinance by 2017, according to a report by Illinois Policy, an independent advocacy group. By June 2023, 19 municipalities were following the ordinance and 117 had opted out according to Cook County’s Department of Human Rights and Ethics. The county government currently has two investigators who are responsible for handling all human rights-related complaints and violations, said Cook County Department of Human Rights and Ethics Office Manager Kisha Johns. Cook County’s Commission on Human Rights fielded 659 inquiries and filed 137 cases in 2022, according to the commission’s annual report. The Cook County government, the Illinois Department of Labor and the Chicago Office of Labor Standards are understaffed and have limited resources to pursue wage-related complaints, said Wendy Pollack, the director of the Women’s Law and Policy Initiative at the advocacy-focused Shriver Center on Poverty Law. The Department of Labor’s form for tip theft reports requires workers to denote how much money has been stolen from them, but they often have no way of knowing because they never saw their tips in the first place, said Mújica. Mújica is working with primarily undocumented employees at local chains like Portillo’s and tortilla manufacturer El Milagro who said that they have had their tips stolen. Mújica is in favor of the new ordinance but said that many of his clients simply do not know how the local laws work. “Workers don’t know their rights, they don’t know the ordinances, and so they just obey what the employer says,” he said. “One of our most important tasks here is to educate workers on their rights.” Documented and Undocumented The Chicago Department of Business Affairs and Consumer Protection’s Office of Labor Standards (OLS) received 104 reports of tip and wage theft in restaurants between when it began tracking complaints in 2020 and October 2023. The city reached 19 settlements with businesses in the food service industry between 2021 and 2022, totaling nearly $2 million in fines and restitution, according to an OLS report. Tri City Foods, which franchises several Chicago-area Burger King locations according to the Office of Labor Standards’ report, was charged $100,000 in fines and $458,931 in recoupment in July 2021 for failing to grant 2,473 Chicago employees their paid sick leave. The fine was the largest in the history of the city’s labor laws, according to a press release from the Office of Mayor Lori Lightfoot. Mondelez International, a Chicago-based food company that includes brands such as Oreo, Ritz and Toblerone, was ordered to pay $95,217 in fines and $479,083 in recoupment in May 2021 for sick leave violations. Legal and Labor experts believe that incidents of wage and tip theft reports are underreported. In a survey of tipped workers by the University of Illinois published in September, nearly 57% of respondents reported having been a victim of tip theft in the past week. The survey may not have reached undocumented workers or employees who are not native English speakers, said Alison Dickson, the lead author of the report and a labor market specialist. “We missed capturing the stories in the lowest-paid tip jobs in the city,” she said. “My sense is that things are much worse.” Tim Nolan, a Chicago-based lawyer at Nolan Law Office, said he has personally represented several hundred victims of tip and wage theft, many of them in the restaurant industry. Around 90% of Nolan’s clients are undocumented immigrants who are afraid to file reports for fear of retaliation from employers, Nolan said. Instead, they reached confidential settlements with their former employers, Nolan said. “[They’re] typically terrified, because they think if they show up at a federal court, they’re gonna get deported,” he said. “A lot of employers will threaten them. If someone’s gonna leave work because they don’t think they’re getting paid right, the employer has told many of my clients, ‘I’ll make sure to call the police, we’ll get you deported.’” One ongoing wage theft complaint is a class action lawsuit against Jacqueline “Jackie” Jackson, who owns three locations of Kilwin’s Ice Cream in downtown Chicago, including one at Navy Pier. Over a dozen employees have accused her of violating the Federal Labor Standards Act, the Illinois Minimum Wage Law and the Chicago Minimum Wage Ordinance by withholding their pay based on arbitrary rules like not following the company dress code or using their cell phones during work hours. Jackson did not respond to a request for comment. In another active case, Zawlocki v. Partners’ Tap, Inc., five employees of Morrison Roadhouse have accused owner Robert Castle of deducting money from their paychecks by offering regular customers free drinks. In a written statement provided by Billhorn Law Firm attorney Samuel Engelson the plaintiffs said that wage theft is underreported, and that the new ordinance is not a solution. A manager at Morrison Roadhouse declined a request for comment. A Controversial Vote The Chicago City Council voted in October to end subminimum wages by 2028. The current minimum wage for most workers in the city stands at $15.80 per hour, although tipped adult workers bring home between $9 and $9.48 per hour before tips are factored in, according to the City of Chicago’s Business Affairs and Consumer Protection Office of Labor Standards. Wages will rise by 8% every year under the new ordinance until they reach parity with the minimum wage in 2028. The new ordinance will overhaul the existing system, which requires employers to make up the difference if workers’ tips do not bring them over the minimum wage threshold. Although the ordinance passed by a margin of 36-10, it was a controversial vote. The Illinois Restaurant Association, an industry group headquartered in Chicago, lobbied heavily against the legislation before it was approved. Owners would have reduced profit margins and small restaurants could struggle to retain employees if they had to pay higher base salaries in place of tips, said Association Chairman Kevin Vaughan. Chicago Mayor Brandon Johnson said in a press release that the new ordinance was “addressing systemic inequalities in the restaurant and hospitality industries.” Johnson did not respond to a request for comment. One of the ordinance’s co-sponsors, 26th Ward Alderwoman Jessie Fuentes, said that subminimum wages should be abolished because many workers never receive the tips that they earned. Tristan Bove provided additional reporting for this story. **More Reads by TCR** **Join the Conversation** 1 Comment Pingback:Tip and Wage Theft Still Prevalent in Chicago Restaurant Industry Despite New Ordinance – Dine Chicago Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Notify me of follow-up comments by email. Notify me of new posts by email. Δ This site uses Akismet to reduce spam.Learn how your comment data is processed. **Leave a comment** **Contact us** Got a news tip or a story you want us to cover? Email us atinfo@chicagoreporter.com. Facebook Instagram YouTube RSS Feed Founded on the heels of the civil rights movement of the 1960s, The Chicago Reporter confronts racial and economic inequality, using the power of investigative journalism. Our mission is national but grounded in Chicago, one of the most segregated cities in the nation and a bellwether for urban policies. The Chicago Reporter 111 W. Jackson Blvd., Suite 820 | Chicago, IL 60604 | (312) 427-4830 |tcrwebmaster2@gmail.com The Chicago Reporter is a publication of theCommunity Renewal Society, a faith-based organization founded in 1882. **Want more from the Chicago Reporter?** Get the latest from the Reporter delivered straight to your inbox.Subscribe to our free email newsletter. About Our Staff Archive Multimedia Settling for Misconduct Subscribe Donate Terms of Use"}