{"id": 945, "name": "National Geographic", "domain": "nationalgeographic.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.nationalgeographic.com/animals/article/national-gallery-of-art-smithsonian-exhibit-little-beasts-art-wonder-and-the-natural-world", "title": "National Gallery Of Art Smithsonian Exhibit Little Beasts Art Wonder And The Natural World", "content": "ANIMALS **How the Old Masters painted animals: dragonfly wings and butterfly dust** A first-ever collaboration between the National Gallery of Art and the Smithsonian examines the birth of natural history. TheNational Gallery of Artand the Smithsonian’sNatural History Museumhave been next-door neighbors in Washington, DC for nearly 90 years—but until now, they’ve never shared so much as a cup of coffee across the fence. That all changes this summer, as the two institutions collaborate to create a cross-pollinated art and natural science exhibition featuring selections from the art gallery’s centuries-old paintings of birds, bugs, and exotic critters … along with actual examples of those creatures drawn from the Smithsonian’s enormous collection of animal artifacts. The exhibit, called “Little Beasts: Art, Wonder, and the Natural World,” focuses on a period beginning in the 1500s when artists in Northern Europe—inspired largely by strange specimens that had found their way to Antwerp, Belgium, aboard merchant sailing ships—were creating exquisitely detailed, and unprecedentedly accurate, images of creatures from the smallest insects to the largest mammals. One display case features the Smithsonian’s own specimen of a Central American elephant beetle, the size of a baby’s fist but armored and horned in a most terrifying (if harmless) manner. Next to it is mounted Flemish painter Jacob Hoefnagel’s 1592 painting of the same species, meticulously rendered with brushes that at times consisted of a single hair bristle. Nearby is 17th-century Czech artist Wencenslaus Hollar’s etching of a Tasmanianvasum ceramicumshell, impossibly spindly and surreally suspended in midair, joined by a spectacular real-life specimen from the Smithsonian’s vast shell collection. And there is Hoefnagel’s life-sized painting of a Southern Hawker dragonfly, highlighted with gold paint, seemingly ready to fly off its parchment page—accompanied by a real dragonfly, temporarily freed from its drawer in the Smithsonian’s climate-controlled archives. (Recent studies have revealed that Hoefnagel, obsessed with accuracy, sometimes fastened actual dragonfly wings to his paintings.) **Get smart, have fun** These and the rest of the exhibition’s works embrace a historic moment when artists—many wielding magnifying glasses—became obsessed with capturing nature in all its detail. Throughout three exhibition halls, the juxtaposition of art and artifacts reveals the astonishing amount of research and detail represented in each work. (A rare look inside the Smithsonian's secret storerooms) **'Nature in its most minute detail'** While it holds a prestigious spot on the National Mall, the National Gallery is not part of theSmithsonian—and the collaboration is novel for both institutions. “We came up with the idea for this during the pandemic,” says Alexandra Libby, a curator of Northern Paintings for the museum.“We started trading e-mails, hoping to get the Smithsonian people excited about it, explaining that these are not just pretty pictures of butterflies, but evidence that there was a real scientific level of engagement during this period. “They were engaged from the start. They said, ‘This is amazing!’” Moving from gallery to gallery, a visitor to this joint venture exhibition walks through a period when artists took the lead in creating the concept of natural history, says Brooks Rich, a curator of Old Master art at the National Gallery. “The flourishing of interest in nature in its most minute detail that we see here really provided the foundation for the entire discipline,” he says. **You May Also Like** **Does this ‘secret room’ contain Michelangelo’s lost artwork? See for yourself.** **Does this ‘secret room’ contain Michelangelo’s lost artwork? See for yourself.** **These mosaics survived a millennia. Here's what they revealed about ancient Rome.** **These mosaics survived a millennia. Here's what they revealed about ancient Rome.** **Take this Salvador Dalí-inspired road trip through Spain** **Take this Salvador Dalí-inspired road trip through Spain** That breakthrough is crystalized in a display case positioned at the center of the exhibition’s first room: Four diary-sized books, bound in leather, illustrated by the artist Hoefnagel. EntitledAier, Aqua, IgnisandTerra(Air, Water, Fire, and Earth), the books contain, on fine parchment paper, 270 hand-painted images of creatures ranging fromhouse fliestoelephantswith a level of detail that rivals anything a 4K TV screen will reproduce today. “Prior to Hoefnagel, most people dismissed insects as vermin,” says Stacy Sell, the museum’s curator of Northern Book Painting. “But he undertook a sustained study of them, looking at every minute detail, and saw how beautiful they were. “Finally, he said, ‘You know, watercolor just isn’t going to cut it.’ So, he developed all kinds of innovative techniques to create a level of detail no one had attempted before. “I mean, he actually painted with butterfly dust. That’s pretty amazing.” (How to plan a walking tour of the best museums in D.C.) So delicate are the images in the four books, the museum almost never has them on display. In the course of the exhibition—May through November 2—the pages will be turned just three times. Perhaps the most glorious art work in the exhibition is the epic “Noah’s Family Assembling the Animals Before the Ark,” painted around 1660 by the Flemish artist Jan van Kessell the Elder. The Noahs—dressed in theirFlemish finest—herd a zoofull of animals across a distinctively Northern European landscape toward a distant, barely-visible boat. Camels, turtles, monkeys, ostriches—evenNorth American turkeys—ramble across the frame. But it’s the sky that commands our attention: A riot of birds, two-by-two, winging their way to safety. “It was such a joy to work with the Natural History Museum managers as they identified all the birds in this painting,” says Libby. “They studied it to see what the artist got right, and why they might have gotten some things wrong.” For example, at the painting’s extreme upper right, a pair ofParadisaea apoda—Greater Birds of Paradise, from New Guinea—streak into the image like plumed missiles. Besides their glorious color, their most distinctive feature is the fact that they have no legs. “These birds were prized for their feathers, for women’s hats,” says Libby. “By the time those dead birds arrived in Europe, their legs were gone.” For a painter obsessed with getting everything just right, only one solution could satisfy both art and science: Rather than get the legs wrong, van Kessell simply left them out. (How do you find a 'lost' masterpiece?) **Related Topics** ARTS VISUAL ARTS ART HISTORY **You May Also Like** **See the future through the eyes of 6 Indigenous artists** **See the future through the eyes of 6 Indigenous artists** **See the story of Jonah and the whale like never before** **See the story of Jonah and the whale like never before** **The famous bonsai forest that lives in Washington, D.C.** **The famous bonsai forest that lives in Washington, D.C.** **Visit these cultural hot spots in 2024** **Visit these cultural hot spots in 2024** **Rock art in Venezuela may be the sign of a lost ancient culture** **Rock art in Venezuela may be the sign of a lost ancient culture** Terms of Use Privacy Policy Your US State Privacy Rights Children's Online Privacy Policy Interest-Based Ads About Nielsen Measurement Do Not Sell or Share My Personal Information Nat Geo Home Attend a Live Event Book a Trip Buy Maps Inspire Your Kids Shop Nat Geo Visit the D.C. Museum Watch TV Learn About Our Impact Support Our Mission Masthead Press Room Advertise With Us Subscribe Customer Service Renew Subscription Manage Your Subscription Work at Nat Geo Sign Up for Our Newsletters Contribute to Protect the Planet Copyright © 1996-2015 National Geographic SocietyCopyright © 2015-2025 National Geographic Partners, LLC. All rights reserved"}