{"id": 11, "name": "The 19th News", "domain": "19thnews.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://19thnews.org/2025/06/los-angeles-ice-raids-immigrant-students-families-graduation/", "title": "Los Angeles Ice Raids Immigrant Students Families Graduation", "content": "**Republish This Story** * Please read before republishing * We’re happy to make this story available to republish for free under anAttribution-NonCommercial-NoDerivatives Creative Commons licenseas long as you follow our republishing guidelines, which require that you credit The 19th and retain our pixel.See our full guidelines for more information. To republish, simply copy the HTML at right, which includes our tracking pixel, all paragraph styles and hyperlinks, the author byline and credit to The 19th. Have questions? Please email[email protected]. — The Editors **** Loading... **Modal Gallery** **Menu** **Topics** Abortion Politics Education LGBTQ+ Caregiving Environment & Climate Business & Economy **The 19th News(letter)** You have been subscribed! Please complete the following CAPTCHA to be confirmed. If you have any difficulty, contact[email protected]for help. Submitting... Uh-oh! Something went wrong. Please email[email protected]to subscribe. This email address might not be capable of receiving emails (according toBouncer). You should try again with a different email address. If you have any questions, contact us at[email protected]. Latest Stories Our Mission Our Team Ways to Give Search Contact We’re an independent, nonprofit newsroom reporting on gender, politics and policy.Read our story. We’re an independent, nonprofit newsroom reporting on gender, politics and policy.Read our story. We’re an independent, nonprofit newsroom reporting on gender, politics and policy.Read our story. **Topics** Abortion Politics Education LGBTQ+ Caregiving Environment & Climate Business & Economy **The 19th News(letter)** You have been subscribed! Please complete the following CAPTCHA to be confirmed. If you have any difficulty, contact[email protected]for help. Submitting... Uh-oh! Something went wrong. Please email[email protected]to subscribe. This email address might not be capable of receiving emails (according toBouncer). You should try again with a different email address. If you have any questions, contact us at[email protected]. Latest Stories Our Mission Our Team Ways to Give Search Contact We’re an independent, nonprofit newsroom reporting on gender, politics and policy.Read our story. **The 19th News(letter)** You have been subscribed! Please complete the following CAPTCHA to be confirmed. If you have any difficulty, contact[email protected]for help. Submitting... Uh-oh! Something went wrong. Please email[email protected]to subscribe. This email address might not be capable of receiving emails (according toBouncer). You should try again with a different email address. If you have any questions, contact us at[email protected]. Become a member The 19th thanks our sponsors.Become one. Education **Amid ICE raids, L.A. schools say they’ll protect students at graduation. But will their families come?** Some parents in the district — which includes an estimated 30,000 immigrant students — plan to sit out commencements over immigration enforcement concerns. Nadra Nittle Education reporter Published Republish this story Share Bluesky Facebook Email Republish this story What was supposed to be a day of celebration for students at Gratts Learning Academy for Young Scholars turned into one of chaos as immigration enforcement in and around Los Angeles — along with subsequent protests and attempts to quash them — reportedly left some of their relatives too fearful to attend the elementary school’s graduation. Gratts is in the city’s Westlake District, where immigration raids Friday led to a showdown between demonstrators and law enforcement agencies that persisted throughout the weekend. Altogether,at least 56 peoplewere arrested in the L.A. area. In Downtown Los Angeles, near Westlake, the sight of blazes on several blocks — after riot police lobbed flashbang rounds at crowds, and protesters set off fireworks and torched cars — called to mind the wildfires that ravaged the region at the start of the year. President Donald Trump on Sunday deployed the National Guard in this deeply blue city that opposes his mass deportations policy, a move that critics — including former Vice President Kamala Harris — argued intensified confrontations between protesters and the authorities. Commuters driving to work on Monday morning saw what remained of the clashes — self-driving Waymo cars burnt to crisps and graffiti tagged all over downtown businesses and buildings. The 19th thanks our sponsors.Become one. Schools are still reeling from the raids and the unrest, with commencement ceremonies set to continue this week. Officials acknowledge that many families in the district — which includes an estimated30,000immigrant students — plan to sit out commencement because of concerns about immigration enforcement. LAUSD Superintendent Alberto Carvalho described that decision as “a heartbreak” during a news conference Monday. More from The 19th Fourteen years in America. A one-way ticket to El Salvador. She’s devoted her life to teaching your kids — in a country that now wants to deport her “I’ve spoken with parents who’ve told me that their daughter will be the first in their family to graduate high school, and they’re not going to be there to witness it because they have a fear of the place of graduation being targeted,” Carvalho said. “What nation are we? Who in their right mind would accept that reality?” Fears have been stoked by unfounded rumors such as the one that emerged on Friday that an immigration raid took place at Gratts’ graduation. “The claims that immigration enforcement activity arrived at the school and during the event are false,” an LAUSD spokesperson told The 19th. The superintendent, an immigrant from Portugal who was formerly undocumented, said the district is taking steps to protect each graduation site, whether on or off campus. The school police will “establish perimeters of safety” around graduation locations and intervene if any federal agency tries to disrupt the ceremonies, Carvalho said. “We’ve instructed our principals to not create lines, to not restrict access,” he said. “As soon as [families] come, they will enter the venues where the graduations are taking place, reducing the risk for them while on the street waiting to get in. We also have authorized the principals to allow parents to remain at the venue for as long as it takes should there be any immigration enforcement action around the area where the graduations are taking place.” School police will also remain on site well after the ceremonies end to allow parents to exit safely. And, in limited capacities, the district will create opportunities for families to watch their children graduate via Zoom. Carvalho said that the recent raids and unrest happened at the worst possible time, given that over 100 graduation ceremonies will be taking place throughout LAUSD Monday and Tuesday, the last day of school. Still, he said the district is prepared to protect students, staff and families. “Every child has a constitutional right to a public education,” he said. “Therefore, every child and their parent has a right to celebrate the culmination of their educational success.” United Teachers Los Angeles (UTLA), the woman-led labor union representing Los Angeles Unified educators, has also spoken out against the immigration enforcement that took place in Los Angeles last week. “The ruthless targeting of hard-working people by ICE and law enforcement agencies is not only unjust but cruel,” the union saidin a statement pinned to its Instagram page. “They are using violence and scare tactics to detain people who are simply trying to live and support their families. We will not stand for this.” On Monday, United Teachers Los Angeles organized a rally to stand up for immigrant communities and to protest the arrest of union leader David Huerta, president of Service Employees International Union (SEIU) – United Service Workers West and SEIU California. Huerta was arrested Friday while observing an immigration raid at a Los Angeles garment factory. He has been charged with felony conspiracy to impede officers and could face up to six years in federal prison if convicted. “We need more people to continue to be loud about these attacks by ICE,” the Los Angeles teachers’ union said. “History has taught us that we cannot afford to stand idly by while our community members are being ripped away from their schools, homes, neighborhoods and workplaces.” Randi Weingarten, president of the American Federation of Teachers, the nation’s second-largest teachers union, also expressed her outrage over Huerta’s arrest, the detainment of immigrant workers and Trump’s decision to mobilize the National Guard against protesters. “It is no coincidence that U.S. Immigration and Customs Enforcement detained David Huerta and raided the site of a known worker center — and we, alongside the entire labor movement, are demanding his and others’ immediate release,” Weingarten said in a statement. “The assault on Los Angeles contradicts all this country stands for. We are a nation made stronger by immigrant workers, stronger by the unions that represent them, and stronger by the rule of law.” Huerta was released from custody Monday afternoon. Kamala Harris criticized the violent repression of mostly peaceful protesters in Los Angeles, singling out Trump for his role in the unrest that ensued. Harris has lived in L.A.’s Brentwood neighborhood since marrying Doug Emhoff in 2014, though she was largely based in Washington, D.C., as vice president. “Los Angeles is my home, and like so many Americans, I am appalled at what we are witnessing on the streets of our city,”she said in a statement. “Deploying the National Guard is a dangerous escalation meant to provoke chaos. In addition to recent ICE raids in Southern California and across our nation, it is part of the Trump administration’s cruel, calculated agenda to spread panic and division.” The White House, meanwhile, took aim at the protesters, as well as California Gov. Gavin Newsom and Los Angeles Mayor Karen Bass, both Democrats. More from The 19th These Ukrainian women banded together after fleeing war. The U.S. may send them back. Their small farms helped stock food pantries. That program is going away. Is Trump’s executive order ending birthright citizenship in effect? “Radical left lunatics are taking to the streets of Los Angeles —attackinglaw enforcement,hurling projectilesat police cruisers,burningvehicles, andshutting downfreeways — because the Trump administration is removing violent criminal illegal immigrants from their communities,” the White House said in a statement Monday. “Democrats like Gavin Newsom and Karen Bass should be thanking President Trump for stepping up and leading where they refused — and for ridding their streets of criminal illegal immigrant killers, rapists, and gangbangers.” Rob Bonta, California’s attorney general, sued the Trump administration Monday over its deployment of the National Guard, arguing that doing so infringed on the state’s sovereignty. Los Angeles school leaders say they’re prepared for the Trump administration to escalate immigration enforcement, including on campuses. In January, Trump lifted restrictions on immigration enforcement in “sensitive locations,” including schools, churches and hospitals. The policy change has led parents across the country to pull children out of class. During Carvalho’s address on Monday, he said that two federal vans were parked near schools. “No action has been taken, but we interpret those actions as actions of intimidation, instilling fear that may lead to self-deportation,” he said. “That is not the community we want to be, that is not the state or the nation that we ought to be.” LAUSD is urging parents or guardians who see immigration activity to contact their school or call the district’s Family Hotline: (213) 443-1300. Republish this story Share Bluesky Facebook Email **Recommended for you** **The 19th News(letter)** You have been subscribed! Please complete the following CAPTCHA to be confirmed. If you have any difficulty, contact[email protected]for help. Submitting... Uh-oh! Something went wrong. Please email[email protected]to subscribe. This email address might not be capable of receiving emails (according toBouncer). You should try again with a different email address. If you have any questions, contact us at[email protected]. Become a member **Support representative journalism today.** Learn more about membership. Give $19 Give $50 Give $100 Any amount TransparencyAboutTeamContactPrivacy PolicyCommunity Guidelines About Team Contact Privacy Policy Community Guidelines About Team Contact Privacy Policy Community Guidelines NewsroomLatest Stories19th News NetworkPodcastEventsCareersFellowships Latest Stories 19th News Network Podcast Events Careers Fellowships Latest Stories 19th News Network Podcast Events Careers Fellowships NewslettersDailyWeeklyThe AmendmentEvent Invites Daily Weekly The Amendment Event Invites Daily Weekly The Amendment Event Invites SupportWays to GiveSponsorshipRepublishingVolunteer Ways to Give Sponsorship Republishing Volunteer Ways to Give Sponsorship Republishing Volunteer The 19th is areader-supportednonprofit news organization. Our stories are free to republish withthese guidelines."}