{"id": 97, "name": "Ars Technica", "domain": "arstechnica.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://arstechnica.com/space/2025/06/she-was-a-disney-star-with-platinum-records-but-bridgit-mendler-gave-it-up-to-change-the-world/#comments", "title": "She Was A Disney Star With Platinum Records But Bridgit Mendler Gave It Up To Change The World", "content": "AI Biz & IT Cars Culture Gaming Health Policy Science Security Space Tech Feature Reviews Store AI Biz & IT Cars Culture Gaming Health Policy Science Security Space Tech HyperLight Day & Night Dark System **She was a Disney star with platinum records, but Bridgit Mendler gave it up to change the world** \"The space industry has a ground bottleneck, and the problem is going to get worse.\" Bridgit Mendler was not in Hollywood anymore. Instead, she found herself in rural North Dakota, where the stars sparkled overhead rather than on the silver screen. And she was freezing. When her team tumbled out of their rental cars after midnight, temperatures had already plummeted into the 40s. Howling winds carried their breath away before it could fog the air. So it was with no small sense of urgency that the group scrambled to assemble a jury-rigged antenna to talk to a spacecraft that would soon come whizzing over the horizon. A few hours later, the rosy light of dawn shone on the faces of a typically scrappy space startup: mostly male, mostly disheveled. Then there was Mendler, the former Disney star and pop music sensation—and she was running the whole show. Mendler followed an improbable path from the Disney Channel to North Dakota. She was among the brightest adolescent stars born in the early 1990s, along with Ariana Grande, Demi Lovato, and Selena Gomez, who gained fame as teenagers on the Disney Channel and Nickelodeon by enthralling Gen Z. During the first decade of the new millennium, before the rise of Musical.ly and then TikTok, television still dominated the attention of young children. And they were watching the Disney Channel in droves. Like many of her fellow teenage stars, Mendler parlayed television fame into pop stardom, scoring a handful of platinum records. But in her mid-20s, Mendler left that world behind and threw herself into academia. She attended some of the country's top universities and married an aerospace engineer. A couple of years ago, the two of them founded a company to address what they believed was a limiting factor in the space economy: transferring data from orbit. Their company, Northwood Space, employed just six people when it deployed to North Dakota last October. But the team already had real hardware. On the windswept plain, they unpacked and assembled \"Frankie,\" their cobbled-together, phased-array satellite dish affectionately named after Mary Shelley's masterpieceFrankenstein. \"We had the truck arrive at two o'clock in the morning,\" Mendler said. \"Six hours later, we were operational. We started running passes. We were able to transmit to a satellite on our first try.\" The team had been up all night by then. \"I guess that's when my Celsius addiction kind of kicked in,\" she said. Guzzling energy drinks isn't the healthiest activity, but it fits with the high-energy, frenetic rush of building a space startup. To survive without a billionaire's backing, startups must stay lean and move quickly. And it's not at all clear that Northwoodwillsurvive, as most space startups fail due to a lack of funding, long technology horizons, or regulatory hurdles. So within a year of seriously beginning operations, it's notable that Northwood was already in the field, testing hardware and finding modest success. From a technological standpoint, a space mission must usually complete three functions. A spacecraft must launch into orbit. It must deploy its solar panels, begin operations, and collect data. Finally, it must send its data back. If satellite data does not return to Earth in a timely manner, it’s worthless. This process is far more difficult than one might think—and not that many people think about it. \"Ground stations,\" Mendler acknowledges, are some of the most \"unsexy and boring problems\" in the space industry. The 32-year-old Mendler now finds herself exactly where she wants to be. The life she has chosen—leading a startup in gritty El Segundo, California, delving into regulatory minutiae, and freezing in rural North Dakota to tackle \"boring\" problems—lies a world away from a seemingly glamorous life in the entertainment industry. That’s just fine with her. “When I was growing up, I always said I wanted to be everything,\" she said. \"So in a certain sense, maybe I wouldn’t be surprised about where I ended up. But I would certainly be happy.” **Good Luck Charlie** Mendler may have wanted to be everything, but in her early years, what she most wanted to be was an actor. In 2001, when Mendler was eight, her parents moved across the country from Washington, DC, to the Bay Area. Her father designed fuel-efficient automobile engines, and her mother was an architect doing green design. Her mom, working from home, enrolled Mendler in an acting camp to help fill the days. Mendler caught the bug. Although her parents were supportive of these dreams, they told her she would have to work to make it happen. \"We still had the Yellow Pages at the time, and so my little kid self was just flipping through the Yellow Pages trying to figure out how to get an agent,\" she said. \"And it was a long journey. Something that people outside of acting maybe don’t realize is that you encounter a shit ton of rejection. And so my introduction to acting was a ton of rejection in the entertainment industry. But I was like, ‘I’m gonna freaking figure this out.’” After three years, Mendler began to get voice-acting roles in small films and video games. In November, 2006, she appeared on television for the first time in an episode of the soap operaGeneral Hospital. Another three years would pass before she had a real breakthrough, appearing as a recurring character onWizards of Waverly Place, a Disney Channel show starring Selena Gomez. She played a vampire girlfriend. Mendler impressed enough in this role to be offered the lead in a new sitcom on Disney Channel,Good Luck Charlie, playing the older sister to a toddler named Charlie. In this role, Mendler made a video diary for Charlie, offering advice on how to be a successful teenager. The warm-hearted series ran for four years. Episodes regularly averaged more than 5 million viewers. My two daughters were among them. They were a decade younger than Mendler, who was 18 when the first episodes aired in 2010. I would sometimes watch the show with my girls. Mendler's character was endearing, and her advice to Charlie, I believe, helped my own younger daughters anticipate their teenage years. A decade and a half later, my kids still look up to her not just for being on television but for everything else she has accomplished. As her star soared on the Disney Channel, Mendler moved into music. She recorded gold and platinum records, including her biggest hit, “Ready or Not,” in 2012. Prominent childhood actors have always struggled with the transition to adulthood. Disney stars like Lindsay Lohan and Demi Lovato developed serious substance abuse problems, while others, such as Miley Cyrus and Selena Gomez, abruptly adopted new, much more mature images that contrasted sharply with their characters on children's TV shows. Mendler chose a different path. **Making an impact** As a pre-teen, Mendler would lie in bed at night listening to her mom working upstairs in the kitchen. They lived in a small house amid the redwoods north of Sausalito, California. When Mendler awoke some mornings, her mom would still be tapping away at her architectural designs. \"That's kind of how I viewed work,\" Mendler said. One of her favorite books as a kid wasMiss Rumphius, about a woman who spread lupine seeds (also known as bluebonnets) along the coast of Maine to make the countryside more beautiful. The picture book offered an empowering message: Every person has a choice about how to make an impact on the world. This environment shaped Mendler. She saw her mom work all night, saw experimental engines built by her dad scattered around the house, and had conversations around the dinner table about the future and how she could find her place in it. As she aged into adulthood, performing before thousands of people on stage and making TV shows and movies, Mendler felt like she was missing something. In her words, life in Los Angeles felt \"anemic.\" She had always liked to create things herself, and she wasn't doing that. \"The niche that I had wedged myself into was not allowing me to have my own voice and perspective,\" she said. \"I wound up going down a path where I was more the vessel for other people’s creations, and I wondered what it would be like to be a little bit more in charge of my voice than I was in Hollywood.\" So Mendler channeled her inner nerd. She began to bring textbooks on game theory to the set of movies and TV shows. She took a few college courses. When a topic intrigued her, she would email an author or professor or reach out to them on Twitter. Her interest was turbocharged when she neared her 25th birthday. Throughout the mid-2010s, Mendler continued to act and release music. One day, while filming a movie calledFather of the Yearin Massachusetts for Netflix, she had a day off. Her uncle took Mendler to visit the famed Media Lab at the Massachusetts Institute of Technology. This research lab brings together grad students, researchers, and entrepreneurs from various disciplines to develop technology—things like socially engaging robots and biologically inspired engineering. It was a vibrant meeting space for brilliant minds who wanted to build a better future. \"I knew right then I needed to go there,\" she said. \"I needed to find a way.\" But there was a problem. The Media Lab only offered graduate student programs. Mender didn't have an undergraduate degree. She'd only taken a handful of college courses. Officials at MIT told her that if she could build her own things, they would consider admitting her to the program. So she threw herself into learning how to code, working on starter projects in HTML, JavaScript, CSS, and Python. It worked. In 2018, Mendler posted on Twitter that she was starting a graduate program at MIT to focus on better understanding social media. \"As an entertainer, for years I struggled with social media because I felt like there was a more loving and human way to connect with fans. That is what I'm going to study,\"she wrote. \"Overall, I just hope that this time can be an adventure, and I have a thousand ideas I want to share with you so please stay tuned!\" That fall she did, in fact, start working on social media. Mendler was fascinated with it—Twitter in particular—and its role as the new public square. But at the Media Lab, there are all manner of interdisciplinary groups. The one right next to Mendler, for example, was focused on space. **Pop startup** In the months before she left Los Angeles for MIT, Mendler's life changed in an important way. Through friends, she met an aerospace engineer named Griffin Cleverly. Southern California is swarming with aerospace engineers, but it's perhaps indicative of the different circles between Hollywood and Hawthorne that Cleverly was the first rocket scientist Mendler had ever met. \"The conversations we had were totally different,\" she said. \"He has so many thoughts about so many things, both in aerospace and other topics.\" They hit it off. Not long after Mendler left for the MIT Lab, Cleverly followed her to Massachusetts, first applying himself to different projects at the lab before taking a job working on satellites for Lockheed Martin. The two married a year later, in 2019. By the next spring, Mendler was finishing hermaster's thesisat MIT on using technology to help resolve conflicts. Then the world shut down due to the COVID-19 pandemic. She and Cleverly suddenly had a lot of time on their hands. They retreated to a lake house owned by Mendler's family in rural New Hampshire. The house had been in the family since just after World War II, and the couple decided to experiment with antennas to see what they could do. They would periodically mask up and drive to a Home Depot in nearby Concord for supplies. They built different kinds of antennas, including parabolic and helical designs, to see what they could communicate with far away. As they experimented, Mendler and Cleverly began to think about the changing nature of the space industry. At the time, SpaceX's Starlink constellation was just coming online to deliver broadband around the world. The company's Falcon 9 launches were ramping up. Satellites were becoming smaller and cheaper, constellations were proliferating, and companies like K2 were seeking to mass produce. Mendler and Cleverly believed that the volume of data coming down from space was about to explode—and that existing commercial networks weren't capable of handling it all. \"The space industry has been on even-keeled growth for a long time,\" Cleverly said. \"But what happens when you hit that hockey stick across the industry? Launch seemed like it was getting taken care of. Mass manufacturing of satellites appeared to be coming. We saw these trends and were trying to understand how the industry was going to react to them. When we looked at the ground side, it wasn’t clear that anyone really was thinking about the ramifications there.\" As the pandemic waned, the couple resumed more normal lives. Mendler continued her studies at MIT, but she was now thoroughly hooked on space. Her husband excelled at working with technology to communicate with satellites, so Mendler focused on the non-engineering side of the space industry. \"With space, so many folks focus on how complicated it is from an engineering perspective, and for good reason, because there are massive engineering problems to solve,\" she said. \"But these are also really operationally complex problems.\" For example, ground systems that communicate with satellites as they travel around the world operate in different jurisdictions, necessitating contracts and transactions in many countries. Issues with liability, intellectual property, insurance, and regulations abound. So Mendler decided that the next logical step after MIT was to attend law school. Because she lacked an undergraduate degree, most schools wouldn't admit her. But Harvard University has an exception for exceptional students. \"Harvard was one of the few schools that admitted me,\" she said. \"I ended up going to law school because I was curious about understanding the operational aspects of working in space.\" These were insanely busy years. In 2022, when she began law school, Mendler was still conducting research at MIT. She soon got an internship at the Federal Communications Commission that gave her a broader view of the space industry from a regulatory standpoint. And in August 2022, she and Cleverly, alongside a software expert from Capella Space named Shaurya Luthra, founded Northwood Space. So Bridgit Mendler, while studying at MIT and Harvard simultaneously, added a new title to her CV: chief executive officer. **Wizards of Waverly Space** Initially, the founders of Northwood Space did little more than study the market and write a few research papers, assessing the demand for sending data down to Earth, whether there would be customers for a new commercial network to download this data, and if affordable technology solutions could be built for this purpose. After about a year, they were convinced. \"Here's the vision we ended up with,\" Mendler said. \"The space industry has a ground bottleneck, and the problem is going to get worse. So let’s build a network that can address that bottleneck and accelerate space capabilities. The best way to go about that was building capacity.\" If you’re like most people, you don't spend much time pondering how data gets to and from space. To the extent one thinks about Starlink, it's probably the satellite trains and personal dishes that spring to mind. But SpaceX has also had to build large ground stations around the world, known as gateways, to pipe data into space from the terrestrial Internet. Most companies lack the resources to build global gateways, so they use a shared commercial network. This has drawbacks, though. Getting data down in a timely manner is not a trivial problem. From the earliest days of NASA through commercial operations today, operators on Earth generally do not maintain continual contact with satellites in space. For spacecraft in a polar orbit, contact might be made several times a day, with a lag in data of perhaps 30 minutes or as high as 90 minutes in some cases. This is not great. Let's say you want to use satellite imagery to fight wildfires. Data on the spread of a wildfire can help operators on the ground deploy resources to fight it. But for this information to be useful in real time, it must be downlinked within minutes of its collection. The existing infrastructure incurs delays that make most currently collected data non-actionable for firefighters. So the first problem Northwood wants to solve is persistence, with a network of ground stations around the world that would allow operators to continually connect with their satellites. After persistence, the next problem faced by satellite operators is constraints on bandwidth. Satellites collect reams of data in orbit and must either process it on board or throw a lot of it away. Mendler said that within three years, Northwood aims to build a shared network capable of linking to 500 spacecraft at a time. This may not sound like a big deal, but it's larger than every commercially available shared ground network and the US government's Satellite Control Network combined. And these tracking centers took decades to build. Each of Northwood's sites, spread across six continents, is intended to download far more data than can be brought down on commercial networks today, the equivalent of streaming tens of thousands of Blu-ray discs from space concurrently. \"Our job is to figure out how to most efficiently deliver those capabilities,\" Mendler said. \"We're asking, how can we reliably deliver a new standard of connectivity to the industry, at a viable price point?\" With these aims in mind, Mendler and Cleverly got serious about their startup in the fall of 2023. **Frankie goes from Hollywood** Over the previous decade, SpaceX had revolutionized the rocket industry, and a second generation of private launch companies was maturing. Some, like Rocket Lab, were succeeding. Others, such as Virgin Orbit, had gone bankrupt. There were important lessons in these ashes for a space startup CEO. Among the most critical for Mendler was keeping costs low. Virgin Orbit's payroll had approached 700 people to support a rocket capable of limited revenue. That kind of payroll growth was a ticket to insolvency. She also recognized SpaceX's relentless push to build things in-house and rapidly prototype hardware through iterative design as key to the company's success. By the end of 2023, Mendler was raising the company's initial funding, a seed round worth $6.3 million. Northwood emerged from \"stealth mode\" in February 2024 and set about hiring a small team. Early that summer, it began pulling together components to build Frankie, a prototype for the team’s first product—modular phased-array antennas. Northwood put Frankie together in four months. \"Our goal was to build things quickly,\" Mendler said. \"That's why the first thing we did after raising our seed round was to build something and put it in the field. We wanted to show people it was real.\" Unlike a parabolic dish antenna—think a DirecTV satellite dish or the large ground-based antennas that Ellie Arroway uses inContact—phased-array antennas are electrically steerable. Instead of needing to point directly at their target to collect a signal, phased-array antennas produce a beam of radio waves that can “point” in different directions without moving the antenna. The technology is decades old, but its use in commercial applications has been limited because it's more difficult to work with than parabolic dishes. In theory, however, phased array antennas should let Northwood build more capable ground stations, pulling down vastly more data within a smaller footprint. In business terms, the technology is \"scalable.\" But before a technology can scale, it must work. In late September 2024, the company's six engineers, a business development director, and Mendler packed Frankie into a truck and sent it rolling off to the Dakotas. They soon followed, flying commercial to Denver and then into Devils Lake Regional Airport. On the first day of October, the party checked into Spirit Lake Casino. That night, they drove out to a rural site owned by Planet Labs, nearly an hour away, that has a small network station to communicate with its Earth-imaging satellites. This site consisted of two large antennas, a small operations shed for the networking equipment, and a temporary trailer. The truck hauling Frankie arrived at 2 am local time. Before sunrise, as the team completed setup, Mendler went into the nearest town, Maddock. The village has one main establishment, Harriman's Restaurant & Bobcat Bar. The protean facility also serves as an opera house, community library, and meeting place. When Mendler went to the restaurant's counter and ordered eight breakfast burritos, she attracted notice. But the locals were polite. Returning to her team, they gathered in the small Planet Labs trailer on the windswept site. There were no lights, so they carried their portable floodlights inside. The space lacked room for chairs, so they huddled around one another in what they affectionately began referring to as the \"food closet.\" At least it kept them out of the wind. The team had some success on the first morning, as Frankie communicated with a SkySat flying overhead, a Planet satellite a little larger than a mini refrigerator. First contact came at 7:34 am, and they had some additional successes throughout the day. But communication remained one-way, from the ground to space. For satellite telemetry, tracking, and command—TT&C in industry parlance—they needed to close the loop. But Frankie could not receive a clear X Band signal from space; it was coming in too weak. \"While we could command the satellite, we could not receive the acknowledgments of the command,\" Mendler said. The best satellite passes were clumped during the overnight hours. So over the next few days, the team napped in their rental cars, waiting to see if Frankie could hear satellites calling home. But as the days ticked by, they had no luck. Time was running out. **Solving their RF problems** As the Northwood engineers troubleshot the problem with low signal power, they realized that with some minor changes, they could probably boost the signal. But this would require reconfiguring and calibrating Frankie. The team scrambled to make these changes on the afternoon of October 4, before four passes in a row that night starting at 3 am. This was one of their last, best chances to make things work. After implementing the fix, the bedraggled Northwood team ate a muted dinner at their casino hotel before heading back out to the ground station. There, they waited in nervous silence for the first pass of the night. When the initial satellite passed overhead, the space-to-ground power finally reached the requisite level. But Northwood could not decode the message due to a coaxial cable being plugged into the wrong port. Then they missed the second pass because an inline amplifier was mistakenly switched off. The third satellite pass failed due to a misrouted switch in Planet's radio-frequency equipment. So they were down to the final pass. But this time, there were no technical snafus. The peak of the signal came in clean and, to the team’s delight, with an even higher signal-to-noise ratio than anticipated. Frankie had done it. High fives and hugs all around. The small team crashed that morning before successfully repeating the process the next day. After that, it was time to celebrate, Dakota style. The team decamped to Harriman's, where Mendler's new friend Jim Walter, the proprietor, served them shots. After a while, he disappeared into the basement and returned with Bobcat Bar T-shirts he wanted them to have as mementos. Later that night, the Northwood team played blackjack at the casino and lost their money at the slot machines. Yet in the bigger picture, they had gambled and won. Mendler wanted to build fast, to show the world that her company had technical chops. They had thrown Frankie together and rushed headlong into the rough-and-tumble countryside, plugged in the antenna, and waited to see what happened. A lot of bad things could have happened, but instead, the team hit the jackpot. \"We were able to go from the design to actually build and deploy in that four-month time period,\" Mendler said. \"That resulted in a lot of different customers knocking down our door and helping to shape requirements for this next version of the system that we're going to be able to start demoing soon. So in half a year, we radically revised our product, and we will begin actually putting them out in the field and operating this year. Time is very much at the forefront of our mind.\" **Can ground stations fly high?** The fundamental premise behind Northwood is that a bottleneck constrains the ability to bring down data from space and that a lean, new-space approach can disrupt the existing industry. But is this the case? \"The demand for ground-based connectivity is rising,\" said Caleb Henry, director of research at Quilty Space. \"And your satellites are only as effective as your gateways.\" This trend is being driven not only by the rise of satellites in general but also by higher-resolution imaging satellites like Planet's Pelican satellites or BlackSky's Gen-3 satellites. There has also been a corresponding increase in the volume of data from synthetic aperture radar satellites, Henry said. Recent regulatory filings,such as this onein the United Kingdom, underscore the notion that ongoing data bottlenecks persist. However, Henry said it's not clear whether this growth in data will be linear or exponential. The idea of switching from large, single-dish antennas to phased arrays is not new. This is partly because there are questions about how expensive it would be to build large, capable phased-array antennas to talk to satellites hundreds of miles away—and how energy intensive this would be. Commercial satellite operators currently have a limited number of options for communicating with the ground. A Norwegian company, Kongsberg Satellite Services (or KSAT), has the largest network of ground stations. Other players include Swedish Space Systems, Leaf Space in Italy, Atlas Space Operations in Michigan, and more. Some of these companies have experimented with phased-array antennas, Henry said, but no one has made the technology the backbone of its network. By far the largest data operator in low-Earth orbit, SpaceX, chose dish-based gateways for its ground stations around the world that talk to Starlink satellites. (The individual user terminals are phased-array antennas, however.) Like reuse in the launch industry, a switch to phased-array antennas is potentially disruptive. Large dishes can only communicate with a single satellite at a time, whereas phased-array antennas can make multiple connections. This allows an operator to pack much more power into a smaller footprint on the ground. But as with SpaceX and reuse, the existing ground station operators seem to be waiting to see if anyone else can pull it off. \"The industry just has not trusted that the level of disruption phased-array antennas can bring is worth the cost,\" Henry said. \"Reusability wasn't trusted, either, because no one could do it affordably and effectively.\" So can Northwood Space do it? One of the very first investors in SpaceX, the Founders Fund, believes so. It participated in the seed round for Northwood and again in a Series A round,valued at $30 million, which closed in April. When Mendler first approached the fund about 18 months ago, it was an easy decision, said Delian Asparouhov, a partner at the fund. \"We probably only discussed it for about 15 minutes,\" Asparouhov said. \"Bridgit was perfect for this. I think we met on a Tuesday and had a term sheet signed on a Thursday night. It happened that fast.\" The Founders Fund had been studying the idea for a while. Rocket, satellites, and reentry vehicles get all of the attention, but Asparouhov said there is a huge need for ground systems and that phased-array technology has the ability to unlock a future of abundant data from space. His own company,Varda Space, is only able to communicate with its spacecraft for about 35 minutes every two hours. Varda vehicles conduct autonomous manufacturing in space, and the ability to have continuous data from its vehicles about their health and the work on board would be incredibly helpful. \"Infrastructure is not sexy,\" Asparouhov said. \"We needed someone who could turn that into a compelling story.\" Mendler, with her novel background, was the person. But she's not just an eloquent spokesperson for the industry, he said. Building a company is hard, from finding facilities to navigating legal work to staffing up. Mendler appears to be acing these tasks. \"Run through the LinkedIn of the team she’s recruited,\" he said. \"You'll see that she’s knocked it out of the park.\" **Ready or not** At Northwood, Mendler has entered a vastly different world from the entertainment industry or academia. She consults with fast-talking venture capitalists, foreign regulators, lawyers, rocket scientists, and occasionally the odd space journalist. It's a challenging environment usually occupied by hotshot engineers—often arrogant, hard-charging men. Mendler stands out in this setting. But her life has always been about thriving in tough environments. Whatever happens, she has already achieved success in one important way. As an actor and singer, Mendler often felt as though she was dancing to someone else's tune. No longer. At Northwood, she holds the microphone, but she is also a director and producer. If she fails—and let's be honest, most new space companies do fail—it will be on her own terms. Several weeks ago, Mendler was sitting at home, watching the movieMeet the Robinsonswith her 6-year-old son. One of the main themes of the animated Disney film is that one should \"keep moving forward\" in life and that it's possible to build a future that is optimistic for humanity—say,Star Trekrather thanThe TerminatororThe Matrix. \"It shows you what the future could look like,\" Mendler said of the movie. \"And it gave me a little sad feeling, because it is so optimistic and beautiful. I think people can get discouraged by a dystopian outlook about what the future can look like. We need to remember we can build something positive.\" She will try to do just that. 1.Two certificate authorities booted from the good graces of Chrome 2.Apple drops support for just three iPhone and iPad models from iOS and iPadOS 26 3.She was a Disney star with platinum records, but Bridgit Mendler gave it up to change the world 4.False claims that ivermectin treats cancer, COVID lead states to pass OTC laws 5.FCC threat to revoke EchoStar spectrum licenses draws widespread backlash Ars Technica has been separating the signal from the noise for over 25 years. With our unique combination of technical savvy and wide-ranging interest in the technological arts and sciences, Ars is the trusted source in a sea of information. After all, you don’t need to know everything, only what’s important. About Us Staff Directory Newsletters Ars Videos General FAQ RSS Feeds Contact us Advertise with us Reprints"}