{"id": 9, "name": "1819 News", "domain": "1819news.com", "bias": "right", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://1819news.com/news/item/more-lies-from-democrats-to-protect-illegal-aliens-tuberville-brings-receipts-to-california-dem-congresswoman-for-claiming-no-violence-in-la-riots", "title": "More Lies From Democrats To Protect Illegal Aliens Tuberville Brings Receipts To California Dem Congresswoman For Claiming No Violence In La Riots", "content": "Subscribe Features Opinion Politics Store Homepage PodcastThe Daily Detail1819 News: The PodcastAlabama UnfilteredThis Alabama Life The Daily Detail 1819 News: The Podcast Alabama Unfiltered This Alabama Life The Daily Detail 1819 News: The Podcast Alabama Unfiltered This Alabama Life Radio News Become a member Home Subscribe Become a Member Menu Left columnTop sectionAboutSearch 1819 NewsCategoriesNewsOpinionPoliticsFeaturesStoreAlabama Unfiltered Radio Top sectionAboutSearch 1819 News About Search 1819 News CategoriesNewsOpinionPoliticsFeaturesStoreAlabama Unfiltered Radio News Opinion Politics Features Store Alabama Unfiltered Radio Top sectionAboutSearch 1819 News About Search 1819 News About Search 1819 News CategoriesNewsOpinionPoliticsFeaturesStoreAlabama Unfiltered Radio News Opinion Politics Features Store Alabama Unfiltered Radio News Opinion Politics Features Store Alabama Unfiltered Radio Right columnTop sectionLoading...PodcastsThe Daily Detail1819 News: The PodcastThis Alabama LifeAlabama Unfiltered Top sectionLoading... Loading... PodcastsThe Daily Detail1819 News: The PodcastThis Alabama LifeAlabama Unfiltered The Daily Detail 1819 News: The Podcast This Alabama Life Alabama Unfiltered Top sectionLoading... Loading... Loading... PodcastsThe Daily Detail1819 News: The PodcastThis Alabama LifeAlabama Unfiltered The Daily Detail 1819 News: The Podcast This Alabama Life Alabama Unfiltered The Daily Detail 1819 News: The Podcast This Alabama Life Alabama Unfiltered **'More lies from Democrats to protect illegal aliens': Tuberville brings receipts to California Dem congresswoman for claiming 'no violence' in LA riots** Share **Share** **Share** Facebook Twitter / X Email On Tuesday, U.S. Sen. Tommy Tuberville (R-Auburn) corrected U.S. Rep. Maxine Waters (D-Calif.) after she claimed there was \"no violence\" in Los Angeles amid the rioting to protest Immigration and Customs Enforcement deporting criminal aliens. “Nobody was shot, nobody was killed, get it into your head,” Waters claimed during a press conference, adding, \"Don’t think that somehow because they called out the National Guard there was violence. There was no violence. I was on the street, I know.\" In response to Waters' claim, Tuberville posted a clip of a man allegedly throwing rocks at Border Patrol agents during the Paramount protest. He wrote on X, \"Apparently,@RepMaxineWatersdoesn’t count rocks and fireworks being thrown at law enforcement officers as violence. More lies from Democrats to protect illegal aliens.\" RELATED:'Terrorism and anarchy will not be tolerated': Tuberville says LA rioters have 'no place' in America According to theNew York Post, \"Rioters in Paramount hurled rocks and Molotov cocktails as riot cops fired back with less-lethal countermeasures including rubber bullets, smoke bombs and pepper spray to beat back the crowd. In Compton, dozens of masked, hooded thugs ransacked a convenience store, smashing windows and loading up with ill-gotten merchandise in acaught-on-video crime spree.\" To connect with the author of this story or to comment, email[email protected]. ﻿Don't miss out!Subscribe to our newsletterand get our top stories every weekday morning. Tags: TOMMY TUBERVILLE Alabama News Los Angeles riots MAXINE WATERS **Featured Local Savings** **Featured Local Savings** **Trending News** **Enter your email below to get our top stories delivered straight to your inbox every weekday morning.** LatestNewsOpinionPolitics Latest News Opinion Politics Latest News Opinion Politics FeaturesPodcastRadioEvents Features Podcast Radio Events Features Podcast Radio Events PrivacyCareers Privacy Careers Privacy Careers 1819 NewsPO Box 1812Birmingham, AL 35201"}