{"id": 1530, "name": "Verdict", "domain": "verdict.justia.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://verdict.justia.com/2025/05/27/justice-kagans-provocative-but-problematic-assertions-in-trump-v-wilcox-that-effectively-treat-presidents-like-lower-federal-judges-with-regard-to-a-duty-to-follow-past-supreme-court-precede", "title": "Justice Kagans Provocative But Problematic Assertions In Trump V Wilcox That Effectively Treat Presidents Like Lower Federal Judges With Regard To A Duty To Follow Past Supreme Court Precede", "content": "Home Columnists Topics Archives Resources Subscribe Header Social Media - FacebookHeader Social Media - BlueskyHeader Social Media - RSS Header Social Media - Facebook Header Social Media - bluesky Header Social Media - RSS **Justice Kagan’s Provocative but Problematic Assertions inTrump v. Wilcoxthat Effectively Treat Presidents Like Lower Federal Judges with Regard to a Duty to Follow Past Supreme Court Precedent** Many Court watchers have been interested in the Justices’ decision on Thursday inTrump v. Wilcoxto lift the temporary blocks that had been imposed by the U.S. District Court for the District of Columbia (and that were affirmeden bancby the U.S. Court of Appeals for the D.C. Circuit), preventing President Donald Trump from firing (as the President had attempted to do) a member of the National Labor Relations Board (NLRB) and a member of the Merit Systems Protection Board (MSPB). Most analysts have focused on how the ruling sent strong signals that a majority of the Court believes the President has the constitutional authority to remove at least some high-level officials who exercise executive power whom Congress had sought to insulate from presidential control by requiring legal “cause” for any termination. Thursday’s action by the Justices does not suggest thatallhigh-ranking members of the federal bureaucracy will necessarily be vulnerable to presidential termination and replacement at will. Indeed the Court strongly intimated (rightly from our perspective) that whatever the Court ultimately does to enlarge the reach of the so-called “unitary executive theory” (espousing broad presidential control pursuant to the Constitution’s grant of “[t]he executive power” to him in particular), the Court will, for historical and structural reasons, exempt leaders of the Federal Reserve (and we hope perhaps other market-regulatory agencies like the Securities and Exchange Commission) from presidential oversight. But Thursday’s action undoubtedly indicates that some earlier Supreme Court rulings, most particularlyHumphrey’s Executor v. United States(1935)(which upheld statutory “for cause” protections for members of the Federal Trade Commission (FTC)), are likely to be overruled in the near future. As important as Thursday’s decision was with respect to the contours of presidential control over the executive branch, we were also quite interested in passages in Justice Elena Kagan’s dissent (joined by Justices Sonia Sotomayor and Ketanji Brown Jackson) that go well beyond the boundaries of the debate over the NLRB or MSPB and unitary-executive theory. Instead, the observations in Justice Kagan’s dissent that we analyze below have broader implications for judicial review and separation of powers more generally. Here is the Kagan language that caught our eye: The current President believes thatHumphrey’sshould be either overruled or confined. . . . And he has chosen to act on that belief—really, to take the law into his own hands. Not since the 1950s (or even before) has a President, without a legitimate reason, tried to remove an officer from a classic independent agency. . . . [L]ower courts recently faced with challenges to independent agencies’ removal provisions have uniformly rejected them based onHumphrey’s. It should go without saying that the President must likewise follow existing precedent, however strong he thinks the arguments against it—unless and until he convinces us to reject what we previously held. At first blush, this reasoning seems sane and civilized; everybody should comply with legal rules, including judicial precedents, until those rules are changed. After all, isn’t the current national discussion over the “rule of law” centered on the obligation of all members of society, including Presidents, to not “take the law into [their] own hands,” but instead to follow rules that are made via orderly and democratically legitimate processes? Indeed, the Supreme Court itself inRodriguez de Quijas v. Shearson/American Express, Inc. has explicitly admonished lower federal courts to follow Supreme Court precedent—even precedent the lower federal courts reasonably believe a majority of the Court is ready to abandon—until and unless the Court itself overrules that precedent. Except that an approach in whicheveryonewould have to act as lower federal courts must would tee up the question: how is it that rules that are wrong can ever change? A legislature can repeal or amend a statute even if no one is violating the enactment. But the Supreme Court is different. It can’t fix its own prior mistakes anytime it wants; the Court can act only when a “case or controversy” has been brought to it. Oftentimes, a case arises precisely because some citizens are, to use Justice Kagan’s words, taking the law into their own hands by flouting a statute they think is unconstitutional. It is a basic and well-accepted proposition in our constitutional democracy that people can violate a legislatively enacted measure and then, when the government tries to punish them for doing so, can defend on the ground that the enactment is unconstitutional. If the scofflaw’s constitutional argument prevails, we forgive her having violated the statute. Rules for violating judicial injunctions are different, as Judge James E. Boasberg in D.C. is now exploring in the context of contempt proceedings arising out of the deportation of alleged Venezuelan gang members to El Salvador. As to measures enacted by legislatures (including Congress), however, disobedience on the ground that the enactment is unconstitutional is always permitted and protected. This is not to say that the only means a private individual has to challenge a law is first to violate it. Sometimes, an individual can seek declaratory or injunctive relief that a law is unconstitutional without violating it. Yet standing, ripeness, and other preliminary hurdles can make this route very difficult, which is one powerful reason why we forgive disobedience of laws that turn out to be unconstitutional. Should the same rule that permits citizens to disobey and then defend on grounds of unconstitutionality apply to executive officials such as the President? We think the answer in many circumstances is “yes.” One reason is that the President–who takes an oath to obey neither Congress nor theU.S. Reportsbut rather the Constitution–is entitled (perhaps even obligated) to follow, and act on, his vision of the law (and of course the Constitution is the Supreme Law), particularly on issues (as inWilcox) involving the nature and scope of executive power, unless and until it is clear that the Supreme Court, as currently constituted, would disagree with him and disallow his exercise of power. In this regard, we think it inappropriate to treat the President, as Justice Kagan’s words (e.g., “likewise) explicitly do, like a lower federal court subject to the Supreme Court’s supervisory power, instead of a coordinate branch of government. (In this regard, we note that it is not even clear that state courts, who are not subject to Supreme Court supervisory authority quite the same way lower federal courts are, must heed the directives inRodriguez de Quijas.) On this view, if there is reasonable doubt about the validity (or applicability) of congressional statutes or past Supreme Court rulings, the President can act in contravention of them. And even if one does not embrace this strong understanding of federal executive power, there would still be a clear need to permit and embrace presidential disobedience of statutes in at least some circumstances for reasons similar to those that explain respect for private disobedience: if no one is disobedient, then unconstitutional statutes or erroneous past precedents are much less likely to be corrected in a timely manner. To be sure, some wrongly decided past Court precedents can be overturned without executive officials–or anybody else–disobeying statutory directives. Where Supreme Court precedent wrongly deprives people of constitutional rights, executive officials need simply to keep enforcing the unconstitutional laws and individuals or groups who are affected by those laws will be able to take a case to the Supreme Court so that the Justices can remedy their past mistake.Brown v. Board of Education’s overruling ofPlessy v. Fergusonis a good example. School officials were not flouting segregation statutes at the time ofBrown: the officials were enforcing them. That permitted the Court, when the challenges to the statutes reached it, to jettisonPlessy. Indeed, sometimes executive officials who themselves believe a statute is unconstitutional and that a prior precedent should be overturned or modified might continue to enforce the statute precisely in order to facilitate an opportunity for the Court to hear a challenge. Under President Barack Obama, for example, the Department of Justice took the position that section 3 of the Defense of Marriage Act (which defined marriage for federal purposes as between a man and a woman) was unconstitutional but continued to enforce the provision–a step on the path that led to the Court’s decision invalidating DOMA inUnited States v. Windsor. In some instances, however, and perhaps especially where separation of powers arguments are raised by the President—where he contends Congress has impermissibly limited his prerogatives—it may be hard for the President to obtain favorable judicial review, including the overruling of a past precedent he thinks is erroneous, without violating the statute. That is, in some instances, unless the President acts contrary to the statute and then is sued, neither he nor anyone else may have a prompt and effective opportunity to get to the Court so as (in Kagan’s words) “to convince[] [them] to reject what [they] previously held.” In at least some previous circumstances, Justice Kagan has not seemed to have any problem with the President taking the law into his own hands in this way. For example, inZivotofsky v. Kerry, Congress passed a law that required (upon request) the executive branch to list “Israel” as the place of birth on American passports of U.S. citizens born in Jerusalem. When the administration refused to do so, Zivotofsky’s parents sued to enjoin Secretary of State John Kerry to add the designation. The administration took the position that whether to put “Israel” on the passport as the place of birth for persons born in Jerusalem was a matter for the executive branch, not Congress (just as President Trump argues today that decisions about who should serve on the NLRB or MSPB are matters for the executive branch, not Congress.) And inZivotofskythe executive branch won, with Justice Kagan joining Justice Anthony Kennedy’s majority opinion. Where was Kagan’s concern over unilateral executive authority in defiance of a congressional statute there? Perhaps Justice Kagan would distinguishZivotofskyfromWilcoxon the ground that the question about passports (inZivotofksy) had to her mind not been answered by the Court in any prior case, whereas the removal-at-will question (inWilcox) involves a Supreme Court precedent (Humphrey’s) that she considers on point. Of course, whether the reasoning ofHumphrey’s—about the FTC—actually does apply to the NLRB and the MSPB is debatable, and a majority of the Court seems to thinkHumphrey’sis distinguishable. But even if Kagan were to be right aboutHumphrey’sbeing on all fours with the present setting, her larger jurisprudential critique would still be misplaced. Granted, Justice Kagan has voiced sharp criticism of the current Court’s willingness to overturn past rulings But even ifstare decisisshould be given more respect than the current Court pays to it (and here we wonder whether Justice Kagan would feel constrained by stare decisis if there were suddenly five votes to overruleDobbs,Janus,HellerandCitizens United), every Supreme Court case,Humphrey’sincluded, should be amenable to Supreme Court reconsideration. That is why we are quite perplexed by the explanation Justice Kagan offered for her criticism of President Trump in this particular setting. And for this reason we think Kagan’s characterization of the President as having taken the law in his own hands is itself not entirely fair. After losing below, the President did not defy the lower court rulings but instead sought relief at the Supreme Court–putting the issue in the hands of Justice Kagan and her colleagues. In a case likeZivotofsky,there would not seem to be a way to allow the Supreme Court to weigh in on the matter unless the President flouts the statute. InWilcox, it is possible that a private actor (say, an employer) who is subject to an NLRB order he doesn’t like could challenge the NLRB’s authority on the ground that the Board’s statutory structure violates separation-of-powers principles by depriving the President of control, and that such a challenge could make its way to the Supreme Court. As Adam Liptak ofThe New York Timesastutely reminded us in a recent conversation on these matters, that is the route by which another statute, involving for-cause limitations on the removal of the Director of the Consumer Finance Protection Bureau, was struck down by the Court five years ago inSeila Law LLC v. Consumer Finance Protection Bureau. But it seems to us self-evidently suboptimal for a President improperly constrained by a statute to have to wait around for something that may never even happen—an aggrieved private actor, who meets standing and other procedural requirements and who has the resources to litigate to judgment, choosing to raise a challenge based on unconstitutional limitations on presidential powers. And it is noteworthy that the Court inSeila Lawitself, a precedent that we assume Justice Kagan feels a strong obligation to follow, had something to say about this topic. While the Court rejected an argument by an invited amicus in that case “that that the [only] proper context for assessing the constitutionality of an officer’s removal restriction is a contested removal” itself, the Court made clear that such an actual contested removal “is certainly one [appropriate] way to review a removal restriction.” Of course, you don’t have a contested removal unless the President actually tries to remove someone in contravention of a statute. Perhaps Justice Kagan believes the President who wants to remove officials in violation of congressional limitations should be relegated to bringing a declaratory judgment action in federal court asking the judiciary to declare that he has the constitutional authority to fire such persons. But until the President has actually tried to fire someone, such a claim could seem speculative and could therefore fall outside the Article III “case or controversy” limitations that apply to all federal courts. We are not aware of any historical precedent for Presidents bringing such declaratory claims (and Justice Kagan does not inWilcoxflag a declaratory action as the alternative President Trump could and should have pursued). The lack of historical practice suggests more than justiciability hurdles: it also seems to reflect an historical understanding, in flat tension with Justice Kagan’s reasoning, that Presidents are indeed permitted to act when they believe they are in the constitutional right and there is a reasonable chance that the Supreme Court would agree. We should add that even though we think Justice Kagan’s reasoning (and that of commentators who have echoed her) on these issues is off base, that doesn’t mean that theWilcoxCourt necessarily did the right thing (assuming one accepts the debatable proposition that the reasoning ofHumphrey’sabout the FTC fully applies to the NLRB and MSPB) in lifting the lower court stays. Even though a majority of Justices apparently expect to vote to overrule or modifyHumphrey’s, there may be good arguments in favor of the Supreme Court, in the context of emergency applications where the briefing on the merits has been incomplete and expedited and there has been no oral argument, heeding the same admonitions that it directs to lower federal courts: preserve the doctrinalstatus quountil the Court has made a final decision to overrule its past cases on point. While some of the considerations that undergird theRodriguez de Quijasrule (e.g., avoiding problematic disuniformity among the lower federal courts) may not apply to the Court itself, others (such as facilitating fully deliberate and careful decisionmaking by the Justices before changing course) very well might. Posted in:Constitutional Law Tags:SCOTUS,Separation of Powers Vikram David Amar is a Distinguished Professor of Law at UC Davis School of Law and a Professor of Law and Former Dean at the University of Illinois College of Law on the Urbana-Champaign campus. Immediately prior to taking the position at Illinois in 2015, Amar served as the Senior Associate Dean for Academic Affairs and a Professor of Law at the UC Davis School of Law. He has also had teaching stints at three other law schools affiliated with the University of California: the UC Berkeley School of Law; the UCLA School of Law; and UC Hastings College of the Law. Follow @prof_amar on Twitter Jason Mazzone is the Albert E. Jenner, Jr. Professor of Law at the University of Illinois at Urbana-Champaign and Director of the Illinois Program in Constitutional Theory, History, and Law. His primary field of research and teaching is constitutional law and history and works principally on issues of constitutional structure and institutional design. Comments are closed. by Jonathan D. Varat, William Cohen and Vikram David Amar by Jonathan D. Varat, William Cohen and Vikram David Amar by Jonathan D. Varat, William Cohen and Vikram David Amar by Jonathan D. Varat, William Cohen and Vikram David Amar Edited by Vikram David Amar Edited by Vikram David Amar Justia Company Terms of Service Privacy Policy"}