{"id": 1633, "name": "WXYZ - Detroit News", "domain": "wxyz.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wxyz.com/news/region/washtenaw-county/ann-arbor-residents-upset-over-citys-decision-to-kill-beavers-at-leslie-park-golf-course", "title": "Ann Arbor Residents Upset Over Citys Decision To Kill Beavers At Leslie Park Golf Course", "content": "Menu NewsInvestigatorsLocal2024 NFL Draft in DetroitNational/WorldPoliticsAutoCoronavirusYour Health MattersSeen on 7EditorialsSpotlight on the NewsChuck Stokes BlogConquering AddictionGetting Around Metro Detroit Investigators Local 2024 NFL Draft in Detroit National/World Politics Auto Coronavirus Your Health Matters Seen on 7 Editorials Spotlight on the News Chuck Stokes Blog Conquering Addiction Getting Around Metro Detroit Investigators Local 2024 NFL Draft in Detroit National/World Politics Auto Coronavirus Your Health Matters Seen on 7 Editorials Spotlight on the News Chuck Stokes Blog Conquering Addiction Getting Around Metro Detroit VideosWatch News Casts LiveLatest Videos Watch News Casts Live Latest Videos Watch News Casts Live Latest Videos WeatherForecast7 Day ForecastHourly ForecastSchool Closings and DelaysWeather AlertsRadar & Maps Forecast 7 Day Forecast Hourly Forecast School Closings and Delays Weather Alerts Radar & Maps Forecast 7 Day Forecast Hourly Forecast School Closings and Delays Weather Alerts Radar & Maps Detroit Traffic SportsSports HomepageSenior SalutesLionsNFL DraftTigersPistonsRed WingsGolfCollege SportsHS SportsCollege Hoops Sports Homepage Senior Salutes Lions NFL Draft Tigers Pistons Red Wings Golf College Sports HS Sports College Hoops Sports Homepage Senior Salutes Lions NFL Draft Tigers Pistons Red Wings Golf College Sports HS Sports College Hoops WXYZ Social MediaYouTubeFacebookInstagramTwitterLinkedIn YouTube Facebook Instagram Twitter LinkedIn YouTube Facebook Instagram Twitter LinkedIn Positively Detroit 7 In Depth Meet The Team Brightest and Best About UsAdvertise with usMeet The TeamContact UsFrequently Asked QuestionsStation JobsBrightest and BestBounce TVLaff - Channel 7.3 Advertise with us Meet The Team Contact Us Frequently Asked Questions Station Jobs Brightest and Best Bounce TV Laff - Channel 7.3 Advertise with us Meet The Team Contact Us Frequently Asked Questions Station Jobs Brightest and Best Bounce TV Laff - Channel 7.3 Contact Us WXYZ-TV Removal Requests CoronavirusCOVID-19 Vaccine COVID-19 Vaccine COVID-19 Vaccine Photo Gallery MoneyShopSmartBusinessDon't Waste Your MoneyConsumerRecallFinancial Fitness Zone ShopSmart Business Don't Waste Your Money Consumer Recall Financial Fitness Zone ShopSmart Business Don't Waste Your Money Consumer Recall Financial Fitness Zone Entertainment and FoodTV ListingsIn the DContestsAround TownRight This Minute TV Listings In the D Contests Around Town Right This Minute TV Listings In the D Contests Around Town Right This Minute LifestyleDr. NandiBack to School Dr. Nandi Back to School Dr. Nandi Back to School Advertise with us Spotlight on Civility MarketplaceDTE Smart Home SolutionsExceptional EducatorsMetro Detroit Home TourYour Health Matters VideosUltimate Wedding ShowExcellence In EducationHome Pros DTE Smart Home Solutions Exceptional Educators Metro Detroit Home Tour Your Health Matters Videos Ultimate Wedding Show Excellence In Education Home Pros DTE Smart Home Solutions Exceptional Educators Metro Detroit Home Tour Your Health Matters Videos Ultimate Wedding Show Excellence In Education Home Pros Legally Speaking Workers Wanted CommunitySalvation Army Red Kettle Campaign Salvation Army Red Kettle Campaign Salvation Army Red Kettle Campaign Two Americas Sign In Newsletters Sign Out Manage Emails Apps Careers Search Detroit Wayne Oakland Macomb Washtenaw Monroe St Clair Livingston Sanilac Lapeer Lenawee **Actions** Facebook Tweet Email **Ann Arbor residents upset over city's decision to kill beavers at Leslie Park Golf Course** ANN ARBOR, Mich. (WXYZ) — The City of Ann Arbor is facing backlash after confirming that beavers living in a creek at the city-owned Leslie Park Golf Course were euthanized, sparking disappointment from animal lovers and wildlife advocates. Watch Sarah Michals' video report: City officials say the beavers had been building a dam in a section of the creek that is part of the Washtenaw County Drain system, and that their activity posed a risk of flooding and property damage. But some residents say more humane alternatives should have been explored. “My initial response is they should have tried other things first,”said nearby resident Kelley Fawcett. “They could have just relocated them. They didn’t have to kill them,”said Alex Craig. “It’s really disappointing that that’s the direction the city went with it,”added Carrie Henderson. Even at the golf course itself, evidence of past beaver activity remains, though no beavers are currently in sight. “I feel like there could have been a more humane way of handling that,”said Lydia Tice.“Getting people in, and removing them (the beavers) and putting them somewhere better where they can actually thrive. Not just outright killing them.” 7 News Detroit reached out to Ann Arbor's Parks department for a better understanding of why the decision was made to kill the animals. The Community Services Administrator for the city emailed back saying: Under Michigan DNR regulations, property owners are allowed to kill certain nuisance wildlife, including beavers, rabbits, and squirrels, if the animals are actively causing or threatening to cause damage. While the DNR does not issue permits to trap and relocate beavers, the agency does provide prevention and control strategieshereto help manage beaver populations and dam-related water flow. Despite that, many residents feel the city’s actions were unnecessary. “It just sounds like a more convenient option to kill them than to try and relocate them or preserve the wildlife here,” Craig said. “I just think it’s kind of lazy of them to do that,” added Tice. The Humane Society of Huron Valley also weighed in, posting on social media: “This has made a lot of folks sad, and certainly us, too. We are dedicated to nonviolent solutions whenever there are problems with wildlife.” Some advocates are now calling for more public education and better policies around how wild animals are handled in urban spaces. “I think more education, and more, potentially, rehabilitation for these animals, would be perfect,”said resident Hannah Wiles. —————————— This story was reported by a journalist and has been converted to this platform with the assistance of AI. Our editorial team verifies all reporting on all platforms for fairness and accuracy. **Sign up for theMorning Newsletterand receive up to date information.** **now signed up to receive theMorning Newsletter.** **Watch 7 News Detroit This Morning!** **Watch 7 News Detroit This Morning!** News Weather Detroit Traffic Sports Entertainment Marketplace Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact wxyzdetroit wxyzdetroit wxyzdetroit"}