{"id": 260, "name": "Colorado Times Recorder", "domain": "coloradotimesrecorder.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://coloradotimesrecorder.com/2025/06/all-hat-no-cattle-congressman-raises-a-few-cows-as-a-hobby-and-says-its-legitimate-to-promote-himself-in-politics-as-a-rancher/69826/", "title": "All Hat No Cattle Congressman Raises A Few Cows As A Hobby And Says Its Legitimate To Promote Himself In Politics As A Rancher", "content": "Home About News Opinions Newsletter Signup Send Us Tips Contact Us Donate **Gun Control Advocate Gabrielle Giffords Endorses Omar Montgomery for Aurora Mayor** **2024 Review: LGBTQ Rights Coverage by the Colorado Times Recorder** **State lawmakers pledge to strike down religious exemption bill for third time** **How Will Colorado’s Gabe Evans Balance GOP and His Swing District’s Priorities As a New Member of Congress?** News **‘All Hat No Cattle’? Congressman Raises a ‘Few Cows’ As a Hobby, And Says It’s Legitimate To Promote Himself in Politics As a ‘Rancher’** In May, Patrick Henry College founder Michael Farris introduced the school’s 2025 commencement speaker, U.S. Rep. Gabe Evans (R-CO) and his wife, as the “owners and operators of a family farm in the southern part of Weld County, Colorado, where they’re raising their two boys, who are delightful young men.” Evans refers to himself as a rancher on hiscongressional website, with some of the same language Farris used. “As a beef producer myself, I have the backs of our farmers and ranchers who are feeding the world,” says Evans on the website, which pictures the congressman in a black cowboy hat face-to-face with a longhorn cow. It’s an appealing image in American politics — especially in a mostly rural district like the one Evans represents. Hobby Ranch The issue is, Evans raises just a few cattle and thinks of his longhorn operation as a hobby. Yet, with an apparent eye on voters in his agricultural district, Evans issues a steady stream of political communications — beyond what’s on his website — about his agricultural activities, leading one Colorado rancher who served in Congress to describe Evans as “all hat, no cattle.” Evans dismisses the concerns out of hand. “While the Left wastes time and taxpayer dollars questioning the validity of the Evans’ family farm, Congressman Gabe Evans is fighting serious battles to make Colorado a better place to live, work, and raise a family,” Evans spokeswoman Delanie Bomar said via email, adding that Evans made $1,100 on agricultural products last year and thus meets a federal definition of a rancher. Does he think he should call himself a rancher or beef producer in promotional/political communications, given that his farm is, as he’s said, a hobby? “Yes, he does,” replied Bomar, “because by the [U.S. Department of Agriculture’s (USDA)] definition, he is a rancher. Don’t just take it from him – the USDA agrees.” Hobby Cattle Asked last year byEl Commercioto talk about his “hobbies,” Evans brought up his longhorns. “I really like longhorn cattle,” Evans toldEl Commercio Nov. 24. “My grandma raised Longhorns, and when she got too old to ranch anymore, she gave me the last couple of cattle that she had. So I raise a few cows now. I don’t have a lot of land. I can raise like two or three cows a year, but I really like Longhorn cattle. I really like raising them and, you know, I enjoy that lifestyle.” Citing his cows and sometimes an orchard, Evans has promoted himself as a rancher and farmer throughout his political career. “Rancher Running for the Statehouse” was theheadlinein Evans’ hometown newspaper, theFt. Lupton Press,when Evans first announced he was running for the state Legislature in 2022. The article quoted Evans as saying, “I live on a small farm between Brighton and Fort Lupton, I’m a small business owner, raise beef cattle, poultry, and grow a variety of fruit and berries from an orchard I planted.” On the homepage of his state House campaign website, Evans presented himself in a cowboy hat with a longhorn, using the same photo that’s on his congressional website today. In his 2022 legislative race, Evans faced Terry DeGroot, whomanagesColorado Cow, a serious dairy farm that distributes milk to Natural Grocers, Whole Foods, and other locations,according to its website. During DeGroot’s race against Evans, DeGroot’s supportersreportedlymocked Evans as owning “pet cows” rather than running a serious ranch or farm like the one run by DeGroot, who’s now a Weld County commissioner. Asked how he felt about Evans’ portrayal of himself as a rancher, DeGroot told theColorado Times Recorder, “I don’t know anything about his farming history.” Evans won his state House race in 2022, and during his subsequent two years at the Legislature, he continued reinforcing his image as a rancher-politician, repeatedly posting photos of himself and his longhorns on social media. “Cows got some extra feed to keep their body temp up,” Evanswrote on Facebookduring a cold snap, flashing a photo of his cattle, after he was elected in 2022. A2023 Facebook post, which pictured Evans’ family with a calf, stated, “One of my cows finally timed the weather correctly and had her calf on a nice day.” In a2024 Facebook post, Evans gave a “shoutout to Colorado Custom Meat Company,” which, he wrote, “always take care of me and my small ag operation.” “Ranchers Like Me” Evanscontinueddroppingreferencesto his cattle in his congressional race last year against incumbent Democrat Yadira Caraveo — with his campaign offering rancher shots of the candidate. During a debate against Caraveo, for example, CBS4’s Shaun Boyd asked if enough is being done to keep food safe in the U.S., and Evans replied, “I’m a beef producer. I actually contribute to the food supply by producing pasture-raised, grass-fed beef. I take it to a USDA-inspected facility.” “My family and I raise cattle. But to the Democrats, ranchers like me are ‘lazy’ and ‘nasty,'” hewroteduring the campaign. “Ground beef is around $5/lb (if you can find it), but the Left can’t seem to figure out it’s their war on rural Colorado that’s causing food prices to skyrocket.” The Koch-funded group, Americans for Prosperity, a major supporter of Evans,placed adspicturing Evans with his Longhorns, using images from his campaign website. Voters’ perception of Evans as a rancher in his northern Colorado congressional district could easily have contributed to his 2,449-vote win over Caraveo — which turned out to be among the closest U.S. House races in the country. Agriculture is a key industry in Evans’ district. It’s the 21st highest cattle-producing congressional district in the country, and ranks 101stamong congressional districtsin the market value of all agricultural products sold. Colorado’s 8th Congressional District, which is mostly north and east of Denver, contains 325,000 cattle and calves; the average farm there sells $721,000 worth of agricultural products. “I would not be so arrogant to say that I’m a rancher.” After Evans was elected to Congress, he put his cattle under the care of Chuck Hughes,who runs Cwm Ceffyl Ranch. “Gabe, keep up the good work and don’t let the constant mud the lefties throw at you be discouraging,” Hughes wrote to Evans on Facebook. “Here’s a peaceful scene of your cattle. I am enjoying them. They’re doing well.” Reached by phone, Hughes said he’s “boarding” three animals for Evans — a cow, heifer, and a young bull calf. “I’m happy to help him out,” he said. He’ll give the longhorns back to Evans when he returns to Colorado or “whenever he might want them,” but Hughes hopes Evans shakes up Washington while he’s there. “I hope he spends about the next 50 years in Washington, D.C., helping the country come back to sanity,” said Hughes. “So I hope I have them for a good long time. … I think he’s great for the country.” Hughes described his own agricultural operation as a “small ranch.” According to the ranch’s Facebook page, its cows produced at least 43 calves in 2024. In aninterviewlast year with Consumer News TV, Hughes said he slaughters about a dozen steers annually. “I’m a wannabe rancher,” Hughes said. “I would not be so arrogant to say that I’m a rancher.” “Rancher and Veteran” Despite giving up the cattle to Hughes, Evans still promotes himself as a rancher on his websites and social media. In a January X post,he wrote, “As a rancher and veteran, I’m fighting for our families and American prosperity!” ‘All Hat No Cattle’ One farmer-turned-congressman from Colorado takes a dim view of Evans promoting himself as a rancher. Former U.S. Rep. John Salazar had about 500 head of cattle when he was elected to Congress in 2004, he told theColorado Times Recorderlast week. “He’s probably a hobby rancher,” said Salazar of Evans. “He doesn’t use that to make a living. All hat and no cattle.” “I’m sure there’s lots of people who try to do that,” he continued. “He represents an ag district, so, you know.” Salazar’s ranch near Costilla County in southern Colorado continued operating after Salazar went to Washington. “I farm and rent almost 5,000 acres here, and my boys and my wife kept it going while I was gone to Washington,” said Salazar. “I mean, that’s how we made a living, and I went to Washington to fight for the water. My district, the 3rd Congressional District, is basically ag. They did send a farmer to Congress. “Yesterday, I was almost finished planting another field of alfalfa,” said Salazar, who’s 71 years old. “The rain stopped me about 4 in the afternoon. I won’t be able to get back into the field for another couple days. That’s what farming and ranching is all about. … Farming and ranching is a hard, hard occupation, but it’s a good one. I love it.” “By Definition, He Is a Rancher” There’s no evidence that Evans’ agricultural activities provided significant income for his family. In hiscommencement speech last month, Evans talked in detail about his precarious financial position when he left his police job in 2022 to run for the state Legislature. He described how he worked “literally as a delivery boy” to make money as he ran for office. His job in law enforcement had paid “six figures,” and he worried that there was “no way” he’d be able to “pay a mortgage and feed a family” on the salary he’d get as a state representative. But, he said in his speech, his wife quickly got a job when he quit to run for office, “making enough money to survive but not much more.” He did not mention farming or ranching as income generators. In public filings, he’s disclosed income from selling agricultural products over the years, and heavily redacted Livestock Inspection certificates confirm that he sold or gave away an unknown number of cattle in Colorado. In 2023, when he was in the Colorado Legislature, he disclosed that he earned “less than $5,000 annually” from his “farm business.” In 2021 and 2022, his reports to the Legislature state that he made an unspecified income from the “sale of home-grown beef/ag products.” (He’s also beenquoted as sayinghe planted an orchard and grows fruit.) Evans’ first twofederal financial disclosure forms, filed as a congressional candidate in 2023 and 2024, list no income whatsoever from ranching or farming. His most recent form, filed last week and not yet available to the public, discloses $1,100, according to his office. It’s the latest disclosure form that Evans’s office points to when asked if Evans is exaggerating his agricultural activities when he says stuff like, “as a rancher,” or “beef-producer.” “To meet the USDA requirement, it’s very black and white: ranchers have to make at least $1,000 in profit,” writes Bomar. “Since Congressman Evans meets that requirement, by definition, he is a rancher. There’s no wiggle room for disagreement on such a black and white issue. Additionally, he is a beef producer because he produces and sells the beef. Again, there’s no wiggle room for disagreement on something so black and white.” The USDA uses its definition of a ranch or a farm in its “Census of Agriculture,” which is a “complete count of U.S. farms and ranches and the people who operate them.” Under the USDA’s definition, a small plot of land, in an urban or agricultural area, is defined as a ranch or a farm if it “normally” generates $1,000 in sales of agricultural products — which is $100 below what Evans earned last year, according to his office. “Even small plots of land – whether rural or urban – count if $1,000 or more of such products were raised and sold, or normally would have been sold, during the census year,”states the USDA websiteabout the Census of Agriculture, which is taken every five years. Agricultural Tax Breaks Evans’ property in Weld County is designated as “agricultural,” which entitles the congressman ongoing tax breaks. Experts say the key to the agricultural designation — as a farm or ranch — is to show monetary profit, and there are a variety of ways,under Colorado’s rules,that an assessor can conclude that a parcel of land should be considered agricultural and receive the resultant tax breaks. Weld County requires that property owners seeking an agricultural designation submit aformto the county, which defines “Ranch” as a “parcel of land which is used for grazing livestock for the primary purpose of obtaining a monetary profit.” The form states that land shall not lose its agricultural designation solely based on income criteria. Weld County could provide no record of Evans having filed the form. It appears that the designation of Evans’ land as agricultural was made by the previous owner and carried over to Evans and his wife, as allowed by Weld County. In any case, now that he has no cattle on his land, and he’s claiming on two of his three federal financial disclosures not to make any money from ranching or farming, will Evans continue to take the agricultural land tax break? “The agricultural land tax break is appropriately used by the Evans family because the land is used for agricultural purposes,” stated Bomar. Erik Maulbetsch and Michelle Dally contributed to this story. CORRECTION: A quote initially misattributed to Bomar was removed. **Jason Salzman** Jason Salzman is the editor of the Colorado Times Recorder. Email address: ‘All Hat No Cattle’? Congressman Raises a ‘Few Cows’ As a Hobby, And Says It’s Legitimate To Promote Himself…20 hours ago **‘All Hat No Cattle’? Congressman Raises a ‘Few Cows’ As a Hobby, And Says It’s Legitimate To Promote Himself…** **‘All Hat No Cattle’? Congressman Raises a ‘Few Cows’ As a Hobby, And Says It’s Legitimate To Promote Himself…** DAVIS: In Memory of a Good Woman1 day ago **DAVIS: In Memory of a Good Woman** **DAVIS: In Memory of a Good Woman** CO Senate GOP Leader Lundeen Resigns To Take Job Leading Conservative Nonprofit2 days ago **CO Senate GOP Leader Lundeen Resigns To Take Job Leading Conservative Nonprofit** **CO Senate GOP Leader Lundeen Resigns To Take Job Leading Conservative Nonprofit** About Contact Big Media Blog Privacy Policy Home About News Opinions Newsletter Signup Send Us Tips Contact Us Donate Username or Email Address Password Remember Me Email address:"}