{"id": 327, "name": "Daily Post Nigeria", "domain": "dailypost.ng", "bias": "center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://dailypost.ng/2025/06/11/air-peace-many-people-denied-boarding-while-tickets-were-being-sold-at-inflated-prices-oshiomhole/", "title": "Air Peace Many People Denied Boarding While Tickets Were Being Sold At Inflated Prices Oshiomhole", "content": "Home News Politics Metro Sport Entertainment Opinion Education Health Interview Daily Post Ghana **Daily Post Nigeria** Home News Politics Metro Entertainment Sport **News** **Air Peace: Many people denied boarding while tickets were being sold at inflated prices – Oshiomhole** Published on By The senator representing Edo North Senatorial District and former governor of the state, Adams Oshiomhole, has narrated his own side of what transpired with Air Peace on Wednesday morning at Murtala Muhammed Airport Terminal 1, Zulu Hall. He said Air Peace prevented him and other passengers from boarding from Lagos to Abuja despite doing online check-in. Oshiomhole accused an Air Peace official of selling air tickets on the spot at inflated prices to willing buyers. He made this clarification known in an interview with Vanguard. This comes as Air Peace, in a statement on Wednesday, alleged thatOshiomhole clashed with its staff and disrupted flight operationbecause the senator missed his flight. However, Senator Oshiomhole, who was the former Nigeria Labour Congress president, gave a contrary view, noting that it was a case of Air Peace frustrating passengers, including him. “I booked Air Peace… They delayed the flight for over five hours. In the end, they announced a cancellation. I had to get another ticket. “Yesterday, I booked a flight for 6:30 a.m., which is their first flight today. I booked and asked them to check me in online, which I did, along with two other Ghanaians who met me in Lagos. “We checked in online just to avoid the last-minute issues I’ve had with them a couple of times. “I got there at about five minutes past six. They told me the counter was closed. I told them, ‘No, I’ve already checked in.’ I showed them the evidence of my online check-in. Even before then, they had asked if I had checked in, and I told them yes and that I had no luggage. “They looked at it but still said the gate had been closed. Meanwhile, I noticed they were still taking other people in. “So I asked, ‘How can you close boarding for a 6:30 flight at 6:05? What is the purpose of online check-in, then?’ If I had to go through another check-in process, then what’s the point of checking in online? “While speaking to them, I saw many men and women who had been there even before me, with similar experiences. Basically, they were selling tickets on the spot at higher prices. I’ll give you an example. A lady bought her ticket for N146,000 online. She arrived at the airport at 5:55 a.m. for the 6:30 a.m. flight, after the gatemen had delayed her. “They told her she was late and that the counter had closed for check-in. She said that was impossible, as it wasn’t even 6:00 a.m. They told her she would be put on the next flight. She protested, saying, ‘Why? Put me on this flight.’ But they told her the flight was full and she would have to wait. “Meanwhile, the airline was selling tickets on the spot for between N200,000 and N300,000. To take advantage of the situation, they discouraged those who had bought tickets online at lower rates and sold to people willing to pay more. “I asked the manager, ‘What is this woman’s crime? She has a baby that’s no more than six months old. How can you refuse to board her when the aircraft is still on the ground and more people are buying tickets?’ You cannot continue like this. Tomorrow, everyone will blame the government. You have regulatory agencies, and they are all compromising. You cannot board people buying tickets on the spot and deny those who booked days ago or checked in online. “By the time the DSS and Air Force personnel came to find out what happened, they intervened and offered to put the woman on the next flight—the same offer they had made to me earlier. But to board that next flight, they told her she would have to pay N109,100. This was in addition to the original N146,000 ticket, meaning she would spend about N256,000 for a one-hour flight to Abuja. There were many others in the same situation, and everyone was shouting at the airport. “I said to the manager, ‘You must follow the rules.’ Many people were stranded, except those who could afford another ticket. I followed the woman to the counter and told her to do whatever they asked. Those of us who were also prevented from flying gathered there. Even when an officer offered me access to a lounge, people around said, ‘Comrade, please don’t leave—this is how they’ve been treating us.’ “I had to send that woman N500,000. That’s basically what happened. I told them this cannot be allowed. I checked in online and arrived on time. The aircraft hadn’t taken off. I’m not supposed to check in twice. The rowdiness arose because many people were denied boarding while ickets were being sold on the spot to others”, he stated. June 12: Democracy is about delivering tangible dividends to masses – Gov Bala Mohammed June 12: Democracy is about delivering tangible dividends to masses – Gov Bala Mohammed Oshiomhole, Airpeace clash over missed flight disrupt schedules in Lagos airport Oshiomhole, Airpeace clash over missed flight disrupt schedules in Lagos airport Oshiomhole, Airpeace clash over missed flight disrupt schedules in Lagos airport Oshiomhole, Airpeace clash over missed flight disrupt schedules in Lagos airport Oshiomhole, Airpeace clash over missed flight disrupt schedules in Lagos airport Amaechi: Join Akpabio, Uzodimma, Umahi, Oshiomhole in APC if you think you’re popular – Eze to Wike Amaechi: Join Akpabio, Uzodimma, Umahi, Oshiomhole in APC if you think you’re popular – Eze to Wike Amaechi: Join Akpabio, Uzodimma, Umahi, Oshiomhole in APC if you think you’re popular – Eze to Wike Amaechi: Join Akpabio, Uzodimma, Umahi, Oshiomhole in APC if you think you’re popular – Eze to Wike Amaechi: Join Akpabio, Uzodimma, Umahi, Oshiomhole in APC if you think you’re popular – Eze to Wike Senator Oshiomhole calls for strict punishment of NAFDAC over chemical ripening of fruits Senator Oshiomhole calls for strict punishment of NAFDAC over chemical ripening of fruits Senator Oshiomhole calls for strict punishment of NAFDAC over chemical ripening of fruits Senator Oshiomhole calls for strict punishment of NAFDAC over chemical ripening of fruits Senator Oshiomhole calls for strict punishment of NAFDAC over chemical ripening of fruits Oshiomhole introduced me to politics, took me to Tinubu- Desmond Elliot Oshiomhole introduced me to politics, took me to Tinubu- Desmond Elliot Oshiomhole introduced me to politics, took me to Tinubu- Desmond Elliot Oshiomhole introduced me to politics, took me to Tinubu- Desmond Elliot Oshiomhole introduced me to politics, took me to Tinubu- Desmond Elliot ‘Don’t hide behind TV, let’s settle in on street’ – Oshiomhole dares Abati ‘Don’t hide behind TV, let’s settle in on street’ – Oshiomhole dares Abati ‘Don’t hide behind TV, let’s settle in on street’ – Oshiomhole dares Abati ‘Don’t hide behind TV, let’s settle in on street’ – Oshiomhole dares Abati ‘Don’t hide behind TV, let’s settle in on street’ – Oshiomhole dares Abati Defections: APC majority in Senate not threat to democracy — Oshiomhole Defections: APC majority in Senate not threat to democracy — Oshiomhole Defections: APC majority in Senate not threat to democracy — Oshiomhole Defections: APC majority in Senate not threat to democracy — Oshiomhole Defections: APC majority in Senate not threat to democracy — Oshiomhole Advertise About Us Contact Us Privacy-Policy Terms Copyright ©Daily Post Media Ltd"}