{"id": 64, "name": "Alabama Political Reporter", "domain": "alreporter.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.alreporter.com/2025/04/24/opinion-opioid-plan-positions-alabama-to-curb-addiction-support-recovery-and-protect-veterans/", "title": "Opinion Opioid Plan Positions Alabama To Curb Addiction Support Recovery And Protect Veterans", "content": "Home News State National Opinion Podcast Newsletter Contact About Privacy Policy Hi, what are you looking for? About Contact Newsletter Podcast **Alabama Political Reporter** ElectionsHeath Allbright wins Alabama House District 11 Republican primaryCindy Myrex qualifies for Alabama State House District 12 raceClint Hollingsworth qualifies for House District 12 special electionAlabama Dems hope to use Trump, ALGOP failures to build momentum in 2026Secretary of state celebrates foreign voter ID legislation’s passage Heath Allbright wins Alabama House District 11 Republican primary Heath Allbright wins Alabama House District 11 Republican primary Cindy Myrex qualifies for Alabama State House District 12 race Cindy Myrex qualifies for Alabama State House District 12 race Clint Hollingsworth qualifies for House District 12 special election Clint Hollingsworth qualifies for House District 12 special election Alabama Dems hope to use Trump, ALGOP failures to build momentum in 2026 Alabama Dems hope to use Trump, ALGOP failures to build momentum in 2026 Secretary of state celebrates foreign voter ID legislation’s passage Secretary of state celebrates foreign voter ID legislation’s passage Heath Allbright wins Alabama House District 11 Republican primary Heath Allbright wins Alabama House District 11 Republican primary Heath Allbright wins Alabama House District 11 Republican primary Heath Allbright wins Alabama House District 11 Republican primary Cindy Myrex qualifies for Alabama State House District 12 race Cindy Myrex qualifies for Alabama State House District 12 race Cindy Myrex qualifies for Alabama State House District 12 race Cindy Myrex qualifies for Alabama State House District 12 race Clint Hollingsworth qualifies for House District 12 special election Clint Hollingsworth qualifies for House District 12 special election Clint Hollingsworth qualifies for House District 12 special election Clint Hollingsworth qualifies for House District 12 special election Alabama Dems hope to use Trump, ALGOP failures to build momentum in 2026 Alabama Dems hope to use Trump, ALGOP failures to build momentum in 2026 Alabama Dems hope to use Trump, ALGOP failures to build momentum in 2026 Alabama Dems hope to use Trump, ALGOP failures to build momentum in 2026 Secretary of state celebrates foreign voter ID legislation’s passage Secretary of state celebrates foreign voter ID legislation’s passage Secretary of state celebrates foreign voter ID legislation’s passage Secretary of state celebrates foreign voter ID legislation’s passage GovernorGov. Ivey signs “Powering Growth” plan into lawGov. Ivey signs FOCUS Act banning cell phones in Alabama schoolsGov. Ivey signs the Speedy Trial ActAlabamians urge veto of HB445, warning of job losses and hemp industry collapseGov. Ivey signs law expanding entertainment incentives to include music albums Gov. Ivey signs “Powering Growth” plan into law Gov. Ivey signs “Powering Growth” plan into law Gov. Ivey signs FOCUS Act banning cell phones in Alabama schools Gov. Ivey signs FOCUS Act banning cell phones in Alabama schools Gov. Ivey signs the Speedy Trial Act Gov. Ivey signs the Speedy Trial Act Alabamians urge veto of HB445, warning of job losses and hemp industry collapse Alabamians urge veto of HB445, warning of job losses and hemp industry collapse Gov. Ivey signs law expanding entertainment incentives to include music albums Gov. Ivey signs law expanding entertainment incentives to include music albums Gov. Ivey signs “Powering Growth” plan into law Gov. Ivey signs “Powering Growth” plan into law Gov. Ivey signs “Powering Growth” plan into law Gov. Ivey signs “Powering Growth” plan into law Gov. Ivey signs FOCUS Act banning cell phones in Alabama schools Gov. Ivey signs FOCUS Act banning cell phones in Alabama schools Gov. Ivey signs FOCUS Act banning cell phones in Alabama schools Gov. Ivey signs FOCUS Act banning cell phones in Alabama schools Gov. Ivey signs the Speedy Trial Act Gov. Ivey signs the Speedy Trial Act Gov. Ivey signs the Speedy Trial Act Gov. Ivey signs the Speedy Trial Act Alabamians urge veto of HB445, warning of job losses and hemp industry collapse Alabamians urge veto of HB445, warning of job losses and hemp industry collapse Alabamians urge veto of HB445, warning of job losses and hemp industry collapse Alabamians urge veto of HB445, warning of job losses and hemp industry collapse Gov. Ivey signs law expanding entertainment incentives to include music albums Gov. Ivey signs law expanding entertainment incentives to include music albums Gov. Ivey signs law expanding entertainment incentives to include music albums Gov. Ivey signs law expanding entertainment incentives to include music albums LegislatureLawmakers pass bill to expand police immunity in waning minutes of sessionBill to politicize Archives board fails on final day of sessionGov. Ivey signs major hemp, CBD restrictions into law despite calls for vetoRep. Bolton receives 2025 Shroud Award for “deadest bill” of the sessionGov. Ivey signs FOCUS Act banning cell phones in Alabama schools Lawmakers pass bill to expand police immunity in waning minutes of session Lawmakers pass bill to expand police immunity in waning minutes of session Bill to politicize Archives board fails on final day of session Bill to politicize Archives board fails on final day of session Gov. Ivey signs major hemp, CBD restrictions into law despite calls for veto Gov. Ivey signs major hemp, CBD restrictions into law despite calls for veto Rep. Bolton receives 2025 Shroud Award for “deadest bill” of the session Rep. Bolton receives 2025 Shroud Award for “deadest bill” of the session Gov. Ivey signs FOCUS Act banning cell phones in Alabama schools Gov. Ivey signs FOCUS Act banning cell phones in Alabama schools Lawmakers pass bill to expand police immunity in waning minutes of session Lawmakers pass bill to expand police immunity in waning minutes of session Lawmakers pass bill to expand police immunity in waning minutes of session Lawmakers pass bill to expand police immunity in waning minutes of session Bill to politicize Archives board fails on final day of session Bill to politicize Archives board fails on final day of session Bill to politicize Archives board fails on final day of session Bill to politicize Archives board fails on final day of session Gov. Ivey signs major hemp, CBD restrictions into law despite calls for veto Gov. Ivey signs major hemp, CBD restrictions into law despite calls for veto Gov. Ivey signs major hemp, CBD restrictions into law despite calls for veto Gov. Ivey signs major hemp, CBD restrictions into law despite calls for veto Rep. Bolton receives 2025 Shroud Award for “deadest bill” of the session Rep. Bolton receives 2025 Shroud Award for “deadest bill” of the session Rep. Bolton receives 2025 Shroud Award for “deadest bill” of the session Rep. Bolton receives 2025 Shroud Award for “deadest bill” of the session Gov. Ivey signs FOCUS Act banning cell phones in Alabama schools Gov. Ivey signs FOCUS Act banning cell phones in Alabama schools Gov. Ivey signs FOCUS Act banning cell phones in Alabama schools Gov. Ivey signs FOCUS Act banning cell phones in Alabama schools EconomyOpinion | A cakewalk for lawmakers, a crackdown on workers, businessesPoll: Trump voters back vape access, reject Biden rules, as Alabama ban sparks backlashThird Alabama Starbucks votes to unionize in HuntsvilleGov. Ivey salutes Alabama exporters with Trade Excellence AwardsAlabama launches Development Fund to drive long-term economic growth Opinion | A cakewalk for lawmakers, a crackdown on workers, businesses Opinion | A cakewalk for lawmakers, a crackdown on workers, businesses Poll: Trump voters back vape access, reject Biden rules, as Alabama ban sparks backlash Poll: Trump voters back vape access, reject Biden rules, as Alabama ban sparks backlash Third Alabama Starbucks votes to unionize in Huntsville Third Alabama Starbucks votes to unionize in Huntsville Gov. Ivey salutes Alabama exporters with Trade Excellence Awards Gov. Ivey salutes Alabama exporters with Trade Excellence Awards Alabama launches Development Fund to drive long-term economic growth Alabama launches Development Fund to drive long-term economic growth Opinion | A cakewalk for lawmakers, a crackdown on workers, businesses Opinion | A cakewalk for lawmakers, a crackdown on workers, businesses Opinion | A cakewalk for lawmakers, a crackdown on workers, businesses Opinion | A cakewalk for lawmakers, a crackdown on workers, businesses Poll: Trump voters back vape access, reject Biden rules, as Alabama ban sparks backlash Poll: Trump voters back vape access, reject Biden rules, as Alabama ban sparks backlash Poll: Trump voters back vape access, reject Biden rules, as Alabama ban sparks backlash Poll: Trump voters back vape access, reject Biden rules, as Alabama ban sparks backlash Third Alabama Starbucks votes to unionize in Huntsville Third Alabama Starbucks votes to unionize in Huntsville Third Alabama Starbucks votes to unionize in Huntsville Third Alabama Starbucks votes to unionize in Huntsville Gov. Ivey salutes Alabama exporters with Trade Excellence Awards Gov. Ivey salutes Alabama exporters with Trade Excellence Awards Gov. Ivey salutes Alabama exporters with Trade Excellence Awards Gov. Ivey salutes Alabama exporters with Trade Excellence Awards Alabama launches Development Fund to drive long-term economic growth Alabama launches Development Fund to drive long-term economic growth Alabama launches Development Fund to drive long-term economic growth Alabama launches Development Fund to drive long-term economic growth NationalTuberville introduces bill to expand VA coverage of vehicle disability modificationsSen. Britt challenges current pharmacy benefit structureMedical cannabis company files federal lawsuit against AMCCTuberville champions Medicaid cuts, ending benefits for noncitizensTuberville, Britt sign Growing America’s Small Businesses and Manufacturing Act Tuberville introduces bill to expand VA coverage of vehicle disability modifications Tuberville introduces bill to expand VA coverage of vehicle disability modifications Sen. Britt challenges current pharmacy benefit structure Sen. Britt challenges current pharmacy benefit structure Medical cannabis company files federal lawsuit against AMCC Medical cannabis company files federal lawsuit against AMCC Tuberville champions Medicaid cuts, ending benefits for noncitizens Tuberville champions Medicaid cuts, ending benefits for noncitizens Tuberville, Britt sign Growing America’s Small Businesses and Manufacturing Act Tuberville, Britt sign Growing America’s Small Businesses and Manufacturing Act Tuberville introduces bill to expand VA coverage of vehicle disability modifications Tuberville introduces bill to expand VA coverage of vehicle disability modifications Tuberville introduces bill to expand VA coverage of vehicle disability modifications Tuberville introduces bill to expand VA coverage of vehicle disability modifications Sen. Britt challenges current pharmacy benefit structure Sen. Britt challenges current pharmacy benefit structure Sen. Britt challenges current pharmacy benefit structure Sen. Britt challenges current pharmacy benefit structure Medical cannabis company files federal lawsuit against AMCC Medical cannabis company files federal lawsuit against AMCC Medical cannabis company files federal lawsuit against AMCC Medical cannabis company files federal lawsuit against AMCC Tuberville champions Medicaid cuts, ending benefits for noncitizens Tuberville champions Medicaid cuts, ending benefits for noncitizens Tuberville champions Medicaid cuts, ending benefits for noncitizens Tuberville champions Medicaid cuts, ending benefits for noncitizens Tuberville, Britt sign Growing America’s Small Businesses and Manufacturing Act Tuberville, Britt sign Growing America’s Small Businesses and Manufacturing Act Tuberville, Britt sign Growing America’s Small Businesses and Manufacturing Act Tuberville, Britt sign Growing America’s Small Businesses and Manufacturing Act EducationCharter commission talks HBCU collaborations, hears school proposalsIn Spanish Fort, LGBTQ picture books housed in adult sectionTuberville introduces “Understanding the True Cost of College Act”Students protest Trump’s commencement address at University of AlabamaUA College Democrats to hold “Tide Against Trump” protest Charter commission talks HBCU collaborations, hears school proposals Charter commission talks HBCU collaborations, hears school proposals In Spanish Fort, LGBTQ picture books housed in adult section In Spanish Fort, LGBTQ picture books housed in adult section Tuberville introduces “Understanding the True Cost of College Act” Tuberville introduces “Understanding the True Cost of College Act” Students protest Trump’s commencement address at University of Alabama Students protest Trump’s commencement address at University of Alabama UA College Democrats to hold “Tide Against Trump” protest UA College Democrats to hold “Tide Against Trump” protest Charter commission talks HBCU collaborations, hears school proposals Charter commission talks HBCU collaborations, hears school proposals Charter commission talks HBCU collaborations, hears school proposals Charter commission talks HBCU collaborations, hears school proposals In Spanish Fort, LGBTQ picture books housed in adult section In Spanish Fort, LGBTQ picture books housed in adult section In Spanish Fort, LGBTQ picture books housed in adult section In Spanish Fort, LGBTQ picture books housed in adult section Tuberville introduces “Understanding the True Cost of College Act” Tuberville introduces “Understanding the True Cost of College Act” Tuberville introduces “Understanding the True Cost of College Act” Tuberville introduces “Understanding the True Cost of College Act” Students protest Trump’s commencement address at University of Alabama Students protest Trump’s commencement address at University of Alabama Students protest Trump’s commencement address at University of Alabama Students protest Trump’s commencement address at University of Alabama UA College Democrats to hold “Tide Against Trump” protest UA College Democrats to hold “Tide Against Trump” protest UA College Democrats to hold “Tide Against Trump” protest UA College Democrats to hold “Tide Against Trump” protest HealthBritt reintroduces the MOMS ActOpinion | Opioid plan positions Alabama to curb addiction, support recovery for veteransOpinion | Alabama’s rural hospital crisis is a threat to health — and our economyKey federal workplace safety offices in Alabama marked for lease terminationAlabama Senate passes bill loosening regulations for religious vaccine exemptions Britt reintroduces the MOMS Act Britt reintroduces the MOMS Act Opinion | Opioid plan positions Alabama to curb addiction, support recovery for veterans Opinion | Opioid plan positions Alabama to curb addiction, support recovery for veterans Opinion | Alabama’s rural hospital crisis is a threat to health — and our economy Opinion | Alabama’s rural hospital crisis is a threat to health — and our economy Key federal workplace safety offices in Alabama marked for lease termination Key federal workplace safety offices in Alabama marked for lease termination Alabama Senate passes bill loosening regulations for religious vaccine exemptions Alabama Senate passes bill loosening regulations for religious vaccine exemptions Britt reintroduces the MOMS Act Britt reintroduces the MOMS Act Britt reintroduces the MOMS Act Britt reintroduces the MOMS Act Opinion | Opioid plan positions Alabama to curb addiction, support recovery for veterans Opinion | Opioid plan positions Alabama to curb addiction, support recovery for veterans Opinion | Opioid plan positions Alabama to curb addiction, support recovery for veterans Opinion | Opioid plan positions Alabama to curb addiction, support recovery for veterans Opinion | Alabama’s rural hospital crisis is a threat to health — and our economy Opinion | Alabama’s rural hospital crisis is a threat to health — and our economy Opinion | Alabama’s rural hospital crisis is a threat to health — and our economy Opinion | Alabama’s rural hospital crisis is a threat to health — and our economy Key federal workplace safety offices in Alabama marked for lease termination Key federal workplace safety offices in Alabama marked for lease termination Key federal workplace safety offices in Alabama marked for lease termination Key federal workplace safety offices in Alabama marked for lease termination Alabama Senate passes bill loosening regulations for religious vaccine exemptions Alabama Senate passes bill loosening regulations for religious vaccine exemptions Alabama Senate passes bill loosening regulations for religious vaccine exemptions Alabama Senate passes bill loosening regulations for religious vaccine exemptions OpinionOpinion | It was a terrible session for the masses, if you care about that sort of thingOpinion | Failure to extend overtime tax takes money out of taxpayer pocketsOpinion | HB445 and the nose-growing narrativesOpinion | A cakewalk for lawmakers, a crackdown on workers, businessesOpinion | The very strange John Wahl situation Opinion | It was a terrible session for the masses, if you care about that sort of thing Opinion | It was a terrible session for the masses, if you care about that sort of thing Opinion | Failure to extend overtime tax takes money out of taxpayer pockets Opinion | Failure to extend overtime tax takes money out of taxpayer pockets Opinion | HB445 and the nose-growing narratives Opinion | HB445 and the nose-growing narratives Opinion | A cakewalk for lawmakers, a crackdown on workers, businesses Opinion | A cakewalk for lawmakers, a crackdown on workers, businesses Opinion | The very strange John Wahl situation Opinion | The very strange John Wahl situation Opinion | It was a terrible session for the masses, if you care about that sort of thing Opinion | It was a terrible session for the masses, if you care about that sort of thing Opinion | It was a terrible session for the masses, if you care about that sort of thing Opinion | It was a terrible session for the masses, if you care about that sort of thing Opinion | Failure to extend overtime tax takes money out of taxpayer pockets Opinion | Failure to extend overtime tax takes money out of taxpayer pockets Opinion | Failure to extend overtime tax takes money out of taxpayer pockets Opinion | Failure to extend overtime tax takes money out of taxpayer pockets Opinion | HB445 and the nose-growing narratives Opinion | HB445 and the nose-growing narratives Opinion | HB445 and the nose-growing narratives Opinion | HB445 and the nose-growing narratives Opinion | A cakewalk for lawmakers, a crackdown on workers, businesses Opinion | A cakewalk for lawmakers, a crackdown on workers, businesses Opinion | A cakewalk for lawmakers, a crackdown on workers, businesses Opinion | A cakewalk for lawmakers, a crackdown on workers, businesses Opinion | The very strange John Wahl situation Opinion | The very strange John Wahl situation Opinion | The very strange John Wahl situation Opinion | The very strange John Wahl situation **Health** **Opinion | Opioid plan positions Alabama to curb addiction, support recovery for veterans** Our combined efforts and partnerships are positioning Alabama to overcome an epidemic that has claimed the lives of thousands. By Published on April 24, 2025 at 7:33 am CDT Over the past three years, states have been receiving settlement funds from federal lawsuits against major pharmaceutical companies. To date, Alabama has secured over $300 million, and I expect that figure to continue growing. These funds are directed to the state’s Opioid Settlement Fund, which the Legislature appropriates. In 2022, the Legislature created the Oversight Commission on Alabama Opioid Settlement Funds to guide these efforts. Chaired by Senator Greg Albritton and myself, the commission held four public hearings after the 2023 Regular Session and during the 2024 Regular Session, gathering input from 44 agencies and associations providing services related to prevention, treatment, and recovery for individuals suffering from opioid addiction in Alabama. The outcome was a comprehensive, statewide plan that outlines the approved uses of settlement funds by organizations that receive them through direct supplemental appropriations from the Alabama Legislature and the Opioid Settlement Grant Program. Through the Opioid Settlement Fund prevention, treatment, and recovery grants, providers collectively reported the following outcomes: 6,898 individuals served 4,094 individual treatment services provided 1,252 Narcan Kits distributed 1,000 Fentanyl Test Strips Distributed 13 pounds of medication collected 83 coaching events Last year, the second appropriation from the settlement funds was made, having a significant impact across the state. These funds supported Alabama’s 988 Crisis Line, a veterans’ pilot program, mental health courts, and numerous prevention and recovery programs. In this year’s Opioid Supplemental Appropriations Bill, $41 million from the Opioid Settlement Fund will be appropriated for similar purposes. However, this year, we will broaden the scope of funded programs and services to continue addressing coverage gaps. We are leveraging one of Alabama’s most robust and effective resources—higher education. $3 million will be allocated among the University of Alabama at Birmingham (UAB), Auburn University, and the University of South Alabama Health (USA Health). UAB will receive $1 million for psychiatry residencies in Montgomery and Huntsville related to the study and treatment of substance abuse. Auburn University will receive $1 million for the expansion of the School of Pharmacy and its K-12 education program focused on substance abuse training. USA Health will receive $1 million to provide rapid response to overdose outbreaks related to opioid use. Another key component in this year’s appropriation is marketing. Alabama has numerous opioid prevention and recovery resources available at no cost to its citizens—but what good are these programs if those struggling with substance abuse don’t know they exist? Through a partnership between the Alabama Legislature and the Department of Mental Health, the state recently launched theOpioids Take Campaign, which includes a website highlighting treatment and prevention resources, billboards, and educational materials. You might have noticed the black and orange billboards along the side of I-65 and other high traffic areas in the state. Additionally, we are making a significant investment in law enforcement, which is critical given the unfortunate reality that officers frequently encounter individuals suffering from substance abuse. In 2020, the FBI Uniform Crime Reporting (UCR) program reported that drug abuse violations were among the most common categories of arrests. These violations include both possession and trafficking offenses, with many individuals arrested for drug-related crimes facing underlying addiction issues. Given this trend, providing Alabama’s law enforcement community with additional resources to identify and address substance abuse is essential—and, frankly, long overdue. The final component of this year’s appropriation I’d like to highlight is our support for veterans. Last year, we established the Veterans Mental Health Steering Committee, consisting of elected officials, state agency heads, and representatives from veteran service organizations, to assess how the state is supporting veterans with mental health and substance abuse challenges and determine what additional resources are needed. This committee was charged with the important task of reviewing the current state of veterans’ mental health and substance use in Alabama and developing a comprehensive plan in response to these findings. Further, this committee was authorized to establish pilot projects that align with this comprehensive plan with new dollars. We funded this initiative with an initial appropriation of $3 million from the Opioid Settlement Fund. Further, we are investing an additional $1.5 million to support existing programs and establish new resources for Alabama’s veterans. The bottom line is that the Legislature is working hard to maximize the impact of these dollars. One outcome that I’m so proud of isAlabama’s reduction in overdoses, which I largely attribute to the distribution of Narcan and access to services. Our combined efforts and partnerships are positioning Alabama to overcome an epidemic that has claimed the lives of thousands and helping ensure that more do not suffer the same fate. **Congress** **Tuberville champions Medicaid cuts, ending benefits for noncitizens** **Tuberville champions Medicaid cuts, ending benefits for noncitizens** **Economy** **Poll: Trump voters back vape access, reject Biden rules, as Alabama ban sparks backlash** **Poll: Trump voters back vape access, reject Biden rules, as Alabama ban sparks backlash** **Opinion** **Opinion | If you want a better Alabama, you’re going to have to fight for it** **Opinion | If you want a better Alabama, you’re going to have to fight for it** **Congress** **Rep. Sewell slams Trump’s tax bill in House Ways and Means Committee** **Rep. Sewell slams Trump’s tax bill in House Ways and Means Committee** **Governor** **Gov. Ivey signs law expanding entertainment incentives to include music albums** **Gov. Ivey signs law expanding entertainment incentives to include music albums** **Congress** **Rep. Sewell requests investigation from Library of Congress Inspector General** **Rep. Sewell requests investigation from Library of Congress Inspector General** **Economy** **Third Alabama Starbucks votes to unionize in Huntsville** **Third Alabama Starbucks votes to unionize in Huntsville** **Opinion** **Opinion | Pass SB161 to create a healthier, stronger Alabama** **Opinion | Pass SB161 to create a healthier, stronger Alabama** We cannot afford to ignore this crisis. Every life lost to overdose is a tragedy we cannot accept. **State** **Opiod settlement oversight commission reallocates funds for treatment programs** **Opiod settlement oversight commission reallocates funds for treatment programs** The commission reallocated opioid settlement funds for treatment programs, expanding services and improving access to care. **News** **Gov. Ivey deploys Transportation workers to Florida, Public Health support team to N.C.** **Gov. Ivey deploys Transportation workers to Florida, Public Health support team to N.C.** ALDOT sent an 18-person crew to help clear Florida roadways of hurricane debris. **News** **Opioid settlement oversight commission announces statewide investment plan** **Opioid settlement oversight commission announces statewide investment plan** The statewide investment plan outlines abatement strategies that are eligible to receive funds through direct supplemental appropriations from the Alabama Legislature. Home State National Elections Podcast Newsletter About Contact Us Privacy Policy Copyright © Alabama Political Reporter"}