{"id": 806, "name": "L'Actualite", "domain": "lactualite.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://lactualite.com/sante-et-science/definancement-de-la-recherche-ce-que-cela-implique-pour-les-patients-presents-et-futurs/", "title": "Definancement De La Recherche Ce Que Cela Implique Pour Les Patients Presents Et Futurs", "content": "Notre numéro de juillet-août 2025 Politique Comparateur : forfaits cellulaires Notre numéro de juillet-août 2025 Politique Comparateur : forfaits cellulaires Santé et science Politique Actualités Société Dollars et cents Culture Art de vivre Affaires et économie Monde Techno Environnement Sports Balados De nos partenaires Dossiers Auteurs Chroniques Magazine S’inscrire aux infolettres S’abonner àL’actualité Activer un cadeau Programme pédagogique Service à la clientèle À propos Nous joindre Politique de confidentialité Conditions d’utilisation Nétiquette Foire aux questions Gestion du consentement Se connecter Créer un compte S’inscrire aux infolettres S’abonner àL’actualité Activer un cadeau Profil Gestion des abonnements Activer un cadeau Préférences de communication Se déconnecter Favoris Appareils Apple Appareils Android Version web Nous joindre **Définancement de la recherche : ce que cela implique pour les patients, présents et futurs** Demander des fonds pour la recherche est un processus long et laborieux. Les coupes budgétaires inconsidérées de Trump auront des répercussions dans le monde entier. L’auteur est communicateur scientifique pour l’Organisation pour la science et la société de l’Université McGill. Il est titulaire d’un baccalauréat en biochimie et d’une maîtrise en biologie moléculaire. Avez-vous déjà vu des hélicoptères Black Hawk voler au-dessus du campus de l’Université McGill ? Moi non plus. Pourtant, une théorie du complot persistante pourrait supposer leur présence. Étant donné que l’Organisation pour la science et la société présente régulièrement les vaccins comme efficaces et sûrs — maispas sûrs à 100 %, car rien ne l’est —, ceux qui nient leur valeur doivent expliquer pourquoi nous avons « tort » à ce point. Il s’avère qu’un professeur du campus a déjà reçu une subvention de la Fondation Bill et Melinda Gates. Bill Gates finance la recherche et la distribution de vaccins : notre organisation est donc dans la poche de Bill Gates. Comment cela est-il mis en œuvre ? J’imagine que des hélicoptères Black Hawk ont dû tourner autour du campus le jour où la subvention a été approuvée, avec du personnel militaire descendant en rappel, frappant aux portes et remettant à des milliers de membres du personnel et professeurs nos nouveaux arguments provaccins. Quand on ne comprend pas comment la recherche est financée, cette théorie est en fait séduisante, et ceux qui y adhèrent pourraient se réjouirlorsqu’ils verront le régime Trump pirater et sabrer le financement de la science aux États-Unis. Mais recevoir du financement pour de la recherche est loin d’être le résultat d’une demande paresseuse d’aide gouvernementale ; cette sollicitation est une activité centrale dans la vie d’un scientifique, et les taux de réussite sont faibles. **À quoi ressemble une demande de subvention ?** La science coûte de l’argent, et ce n’est pas seulement parce que des êtres humains ont tout bêtement besoin d’un salaire. Chaque fois qu’une expérience de biologie moléculaire, par exemple, est réalisée, desréactifssont consommés, c’est-à-dire des enzymes, des tampons, des colorants, des blocs de construction moléculaires et bien d’autres choses encore. Et ces réactifs ne flottent pas dans l’air ; ils nécessitent desconsommablestels que des tubes en plastique et des embouts de pipette, et les scientifiques ont besoin de gants jetables pour éviter de contaminer leurs solutions ou de faire passer par inadvertance des enzymes de leur peau dans des tubes où elles détruiront l’ARN qu’ils essaient d’isoler. (Je me concentrerai sur les sciences biomédicales, car c’est ce que je connais le mieux.) Parfois, de nouveauxéquipementsdoivent également être achetés : centrifugeuses, mélangeurs vortex, machines qui amplifient l’ADN, micropipettes, et même des choses simples comme des supports en plastique pour maintenir les tubes en place. Dans tout budget de recherche, il y a également une ligne pour lesfrais généraux, sur laquelle nous reviendrons. Le processus de base d’un chef de laboratoire — communément appelé chercheur principal — pour solliciter de l’argent est de rédiger une demande de subvention. Les subventions durent généralement quelques années : un récent concours organisé par les Instituts de recherche en santé du Canada (IRSC), le principal organisme public de financement de la recherche dans le domaine de la santé au Canada, a débouché sur des subventions d’une durée moyenne dequatre ans et demi. La demande de subvention est un exercice long et ardu de planification, exécution et soumission) qui, pour les subsides importants, dure souventun an. La demande de subvention peut elle-même être précédée d’une lettre d’intention, dans laquelle le chercheur principal soumet un résumé de ce qu’il prévoit faire et les noms des collaborateurs qu’il a réunis pour le projet. Si la lettre est acceptée, l’énorme document qu’est la demande de subvention commence à être créé. Toutes les personnes ayant un rôle majeur à jouer dans la recherche proposée doivent dresser la liste de leurs publications antérieures, de leurs diplômes et de leurs récompenses — en bref, elles doivent convaincre les évaluateurs qu’elles sont les bonnes personnes pour ce travail. Le chercheur principal rédigera également une longue explication de ce que nous savons sur le sujet et de ce qui a mené à la question de recherche brûlante à laquelle l’équipe veut répondre. Pour une demande de subvention portant sur l’étude de l’interaction de deux protéines clés chez les personnes atteintes d’un type particulier de cancer de la peau, par exemple, cette introduction présentera des statistiques importantes sur le cancer de la peau en général et sur ce type de cancer en particulier ; le mécanisme biologique sous-jacent qui conduit à ce type de cancer de la peau ; ce que l’on sait de chacune de ces protéines clés et des systèmes ou cascades de signalisation dont elles font partie ; et la manière dont elles sont liées au cancer de la peau. Chaque affirmation doit être dûment référencée. L’hypothèse des chercheurs doit être formulée, accompagnée d’une description détaillée des expériences précises qu’ils souhaitent réaliser : les techniques à utiliser, les échantillons à tester, les contrôles à effectuer. Ces expériences doivent être justifiées comme faisant partie du programme de recherche global du chercheur principal, et un budget doit rendre compte de l’affectation des fonds en matière de salaires, de consommables, de réactifs, d’équipements et de frais généraux. Les différents organismes subventionnaires ont chacun leurs exigences et leurs formulaires, de sorte que des documents supplémentaires doivent souvent être remplis. Une demande de subvention est donc un énorme effort de recherche documentaire, de rédaction savante et de coordination, le tout articulé sur plusieurs mois. L’organisme subventionnaire convoque alors un groupe de scientifiques pour évaluer les demandes qu’il a reçues, car il n’a généralement pas les moyens de toutes les approuver. Les évaluateurs doivent donc étudier ces demandes — un travail non rémunéré, je tiens à le souligner — et se poser des questions importantes. Le raisonnement est-il solide ? Les objectifs sont-ils bien définis et les méthodes appropriées ? Les chercheurs sont-ils susceptibles de terminer le projet à temps ? Ont-ils identifié les défis probables et proposent-ils des solutions ? L’institution où se déroulera le projet est-elle bien équipée pour le mener à bien ? Ces évaluations sont faites par des personnes, et les personnes sont imparfaites. De plus, deux demandes de subvention peuvent se retrouver à égalité. Laquelle doit recevoir l’argent ? Depuis la fin des années 1990, l’idée d’unsystème de loteriea été avancée, soit pour remplacer complètement l’évaluation manuelle des demandes de subvention par des personnes, soit pour compléter le processus, en mettant les demandes retenues dans un panier afin de déterminer les gagnants, ou en recourant au hasard pour départager lesex æquo. Les systèmes de loterie partielle sont encore rares et il n’y a pas de consensus quant à savoir s’ils profitent ou non aux scientifiques (et au public, dont la confiance repose sur le fait que le système est perçu comme équitable). **Quelles sont donc les chances d’obtenir du financement ?** Les chiffres fournis par les principaux organismes subventionnaires nord-américains donnent à réfléchir : la recherche est très compétitive. De la fin des années 1990 au début des années 2000, le taux de réussite des demandes adressées aux National Institutes of Health (NIH, le plus important fonds fédéral de recherche en santé aux États-Unis) oscillaitautour de 30 %, ce qui signifie qu’un peu moins d’une demande sur trois était financée. Depuis, ce taux est descendu à 20 %, soit une demande sur cinq. Au Canada, les IRSC, l’équivalent des NIH, ont connu une baisse comparable de leur pourcentage de demandes financées : de 33 % en 2000 àmoins de 20 %ces dernières années. Il a toujours été difficile de faire financer ses recherches par des organismes publics. Sous le régime kakistocratique de Trump, les choses sont sur le point d’empirer. **La décimation du plus grand organisme de financement de la recherche en santé au monde** Une fuite au sujet du budget de l’année fiscale débutant en octobre révèle que la Maison-Blanche veut réduire le budget des NIH d’environ 47 milliards de dollars à 27. Les NIH ont déjà annulé des centaines de subventions de recherche actives — de l’argent qu’ils avaient accepté de verser aux chercheurs avant la réélection de M. Trump et qu’ils suppriment maintenant. Uneanalysepubliée par la revueNaturea montré qu’au 7 avril, 29 % des subventions des NIH liées au VIH/sida avaient vu leur financement fédéral révoqué. La moitié des subventions qui mentionnaient des questions LGBTQ+ avaient été annulées, ainsi que près de la moitié des subventions qui faisaient allusion à l’hésitation en matière de vaccins. Au nom de l’idéologie de droite, les subventions des NIH à plus de12 universités américainesdans le collimateur de Trump auraient été retenues dans une possible tentative de faire pression sur ces universités pour qu’elles abandonnent leurs initiatives en matière de diversité, d’équité et d’inclusion. L’annulation soudaine de subventions en cours a conduit un groupe de scientifiques àpoursuivre les NIHen justice, tandis que de nombreux chercheurs s’adressent aux médias pour rappeler au public que les NIH sont, et de loin, le plus grand bailleur de fonds de la recherche biomédicale au monde : en 2022, ils ont distribué33 milliards de dollarsde subventions, suivis en deuxième position par l’organisation caritative Wellcome, établie à Londres, avec 1,2 milliard de dollars. Les NIH ont versé 1,4 milliard de dollars américains en 2023 pour la recherche sur le VIH, la tuberculose et le paludisme — les principales maladies infectieuses mortelles dans le monde. En deuxième position ? La Fondation Gates, avec un demi-milliard de dollars. Le secteur privé n’est tout simplement pas à la hauteur. Cela ne veut pas dire que les organismes sans but lucratif et les fondations ne jouent aucun rôle dans le financement de la recherche. En fait, les universitaires sont de plus en plus encouragés à s’associer à des organismes privés pour financer leurs projets. Mais ces organismes, qui soutenaient la majeure partie de la recherche aux États-Unis avant la Seconde Guerre mondiale, ont tendance à être très sélectifs : si un projet n’a pas de perspective de commercialisation immédiate, son chercheur principal se fera probablement dire non. De plus, les bailleurs de fonds privés n’accordent généralement pas d’argent pour les frais généraux, et la couverture des frais généraux par les NIH a également été réduite de 40 % à15 %du budget total soumis. Aussi connus sous le nom de coûts indirects, les frais généraux reconnaissent que le laboratoire d’un scientifique n’existe pas en vase clos. Les centres de recherche disposent d’un personnel administratif et de bureau, ainsi que de gestionnaires fiscaux et de directeurs. Ils ont besoin d’ordinateurs et d’imprimantes et consomment de l’électricité et de l’eau courante. Comme tout bâtiment, ils doivent parfois être rénovés et leur terrain doit être entretenu. En outre, ils offrent des services de base que de nombreux chercheurs finissent par utiliser. En tant qu’étudiant diplômé, puis assistant de recherche, j’ai eu accès à des installations centralisées qui pouvaient trier des cellules pour moi, faire de la spectrométrie de masse ou du séquençage de génomes entiers. Ces instruments coûtent une fortune et seuls des scientifiques formés peuvent s’en servir et diagnostiquer les erreurs. Il n’est pas logique que chaque laboratoire en dispose, c’est pourquoi ils sont généralement partagés en tant qu’installations centrales. Ils font également partie des frais généraux. La recherche biomédicale n’est pas la seule discipline à être démembrée. Leministère de l’Énergiea lui aussi plafonné à 15 % ses frais généraux autorisés pour les projets de recherche ; laNational Oceanographic and Atmospheric Administrationvoit sa propositionde budget amputée de 1,6 milliard de dollars ; et laNational Science Foundationa mis fin à plus de 1 000 subventions en l’espace de deux semaines, y compris des subventions pour la recherche en matière de désinformation, tandis que son directeur a démissionné. **Des répercussions sur les patients** La recherche dans le monde de Trump est un chiffre rouge sur une feuille de calcul, mais en fait, la recherche enrichit un pays. Un rapport d’une coalition de grandes institutions de recherche, de défenseurs des patients et de la santé ainsi que de l’industrie privée montre que pour chaque dollar investi dans la recherche par les NIH, un peu plus dedeux dollars et demisont générés dans l’activité économique. La recherche crée des emplois et de l’innovation, et pas seulement aux États-Unis. Cette saignée incessante du plus grand moteur financier de la recherche en matière de santé touche également les patients.Presque tous les médicamentsapprouvés aux États-Unis (et probablement dans le monde entier) au cours de la dernière décennie ont reçu de l’argent des NIH pour l’étape de la recherche. Aujourd’hui, le quart des chercheurs en cancérologie interrogés par l’Association américaine pour la recherche sur le cancer affirment que les essais cliniques qu’ils mènent — où de nouvelles interventions prometteuses en laboratoire sont pratiquées sur des patients — sontretardés ou annulésen raison des coupes budgétaires des NIH. Même si la situation s’inversait soudainement, les essais ne pourraient pas être relancés facilement : les stocks se dégradent, les patients s’éloignent et les chercheurs changent d’objectif. Au Portugal, les investissements dans la recherche ont chuté en 2011. Conséquence : en 2014,près de la moitié des chercheursenvisageaient de quitter le pays pour des pâturages plus verts. Un sondage réalisé parNatureauprès de plus de 1 200 scientifiques américains a révélé queles trois quarts d’entre euxsongeaient désormais à s’installer ailleurs. Le Canada fait de son mieux pour accueillir les chercheurs, mais ses investissements dans la recherche font pâle figure par rapport à ceux des États-Unis il y a quelques années à peine. En 2021, les dépenses intérieures brutes consacrées à la recherche et au développement aux États-Unis s’élevaient à806 milliards de dollars; au Canada, ce chiffre était de47 milliards de dollars. C’est une différence d’ordre de grandeur. Nous voulons que les scientifiques américains en exil prospèrentici, mais compte tenu de la concurrence déjà féroce pour les bourses de recherche au Canada, je me demande qui les financera. Si vous avez aimé cet article, pourquoi ne pas vous inscrire à notre infolettre santé ? Vous y lirez en primeur, tous les mardis, les explications toujours claires, détaillées et rigoureuses de notre équipe de journalistes et de professionnels de la santé. Il suffit d’entrer votre adresse courriel ci-dessous. 👇 Les commentaires sont modérés par l’équipe deL’actualitéet approuvés seulement s’ils respectent les règles de lanétiquetteen vigueur. Veuillez nous allouer du temps pour vérifier la validité de votre commentaire. X(Twitter) LinkedIn Threads Bluesky YouTube RSS S’abonner àL’actualité Service à la clientèle Toutes les parutions À propos deL’actualité Nous joindre Politique de confidentialité Conditions d’utilisation Nétiquette Foire aux questions Gestion du consentement"}