{"id": 2153, "name": "TheWrap", "domain": "thewrap.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.thewrap.com/dear-ms-a-revolution-in-print-review-trailblazing-feminist-magazine-doc-still-hits-hard-today/", "title": "Dear Ms A Revolution In Print Review Trailblazing Feminist Magazine Doc Still Hits Hard Today", "content": "**Main Navigation** TVTVRatingsReviews TV Ratings Reviews TV Ratings Reviews MoviesMoviesSteve PondReviewsBox OfficeSundanceSundance VideosTIFFReport From TorontoCannesCannes MagazineCinemaCon Movies Steve Pond Reviews Box Office Sundance Sundance Videos TIFF Report From Toronto Cannes Cannes Magazine CinemaCon Movies Steve Pond Reviews Box Office Sundance Sundance Videos TIFF Report From Toronto Cannes Cannes Magazine CinemaCon AwardsVisionariesAwardsEmmysOscarsHow I Did It Visionaries Awards Emmys Oscars How I Did It Visionaries Awards Emmys Oscars How I Did It TheWrapBookTheWrapBook Volume 3: The Art of CinemaTheWrapBook Volume 2: The Art of TelevisionTheWrapBook Volume 1: The Art of CinemaWrapStyle TheWrapBook Volume 3: The Art of Cinema TheWrapBook Volume 2: The Art of Television TheWrapBook Volume 1: The Art of Cinema WrapStyle TheWrapBook Volume 3: The Art of Cinema TheWrapBook Volume 2: The Art of Television TheWrapBook Volume 1: The Art of Cinema WrapStyle PROMembers HubData InsightsStreaming ChartsThe GrillTheGrill 2024 VideosWrapPRO Members Hub Data Insights Streaming Charts The Grill TheGrill 2024 Videos WrapPRO Members Hub Data Insights Streaming Charts The Grill TheGrill 2024 Videos WrapPRO What to Watch MorePower Women SummitScreening Series RSVPScreenings ArchiveWebinars ArchiveShortlist Film FestivalBold StepsHow She Did ItHow I Did ItDigital CoversWaxwordNewslettersLatino Power ListTechCultureMedia Power Women Summit Screening Series RSVP Screenings Archive Webinars Archive Shortlist Film Festival Bold Steps How She Did It How I Did It Digital Covers Waxword Newsletters Latino Power List Tech Culture Media Power Women Summit Screening Series RSVP Screenings Archive Webinars Archive Shortlist Film Festival Bold Steps How She Did It How I Did It Digital Covers Waxword Newsletters Latino Power List Tech Culture Media **Search** **Follow Us** Visit The Wrap on facebook Visit The Wrap on twitter Visit The Wrap on instagram Visit The Wrap on youtube **‘Dear Ms.: A Revolution in Print’ Review: Trailblazing Feminist Magazine Doc Still Hits Hard Today** Tribeca 2025: Directors Salima Koroma, Alice Gu and Cecilia Aldarondo make a maddening, inspiring and still-so-significant documentary **Share on Social Media** Share on Facebook Share on X (formerly Twitter) Share on LinkedIn Share on Email Has there ever been a more essential moment for a documentary than one about the making of Ms. magazine? Though it was founded more than half a century ago, nearly all the subjects it raised and debated continue to feel urgently relevant. To wit, “Dear Ms: A Revolution in Print” opens with narration from founding editor Letty Cottin Pogrebin: “Try to imagine life where you are owned by, or controlled by, men.” There are, perhaps, some women who can still imagine what that might be like today. Directors Salima Koroma, Alice Gu and Cecilia Aldarondo are well aware of the timeliness of their subject and subtly allow us to draw parallels even as they take us back to the 1970s. They’ve chosen to split the film into three chapters, with each director telling a different part of the magazine’s story. This tripartite structure does make the film feel somewhat fragmented, but many of the participants and themes carry throughout. Koroma’s section, about the magazine’s founding in 1971, introduces us to the women we will get to know as things progress. Foremost among them is Gloria Steinem. At the time, Steinem was alternating between political and celebrity journalism. She was probably most famous for her exposé of Hugh Hefner’s Playboy Club, in which she went undercover as a Bunny. But she was also writing work like “Paul Newman: The Trouble With Being Too Good-Looking.” Then she went to cover a women’s liberation meeting for New York magazine. The experiences participants shared — about being overlooked, overworked, over it all — convinced Steinem that this movement deserved far more than a single article. And so the first issue of Ms. was actually an offshoot of New York, an experiment built on no small amount of uncertainty. Steinem was, in fact, one of the few public figures brave enough to call herself a feminist aloud, and we see her using her mainstream beauty — which is commented on by the media repeatedly — as a way to subvert expectations of “radical liberation.” (Which is to say, equality.) We do see a few other celebrities standing strong, including Lily Tomlin, Lucille Ball and Alan Alda. But Koroma also shows us the overwhelming backlash that met the magazine immediately. This general disdain is crystalized by unabashedly dismissive ABC news anchor Harry Reasoner: “The first edition of Ms., described as a new magazine for women, is at hand and it’s pretty sad,” Reasoner announces to his millions of viewers. “It’s so clearly just another in the great but irrelevant tradition of American shock magazines.” Reasoner then shares his certitude that it’ll fold imminently. He was wrong, of course: Ms. still exists, and has lasted longer than many of its contemporary publications. We learn about its early successes — and stumbles — in Alice Gu’s chapter, titled “A Portable Friend.” As Steinem notes, women’s magazines at the time “were mostly catalogues that served to praise the advertisers” — advertisers being cosmetics companies, weight-loss pills and household appliance makers. In contrast, Ms. was often alone in generating widely-viewed discussions of abortion, sexual harassment, domestic violence, power dynamics and — ultimately — revolution. Should it have been so revolutionary to suggest that women deserved to be treated with fairness? Regardless, it certainly was. And so the magazine started getting piles of mail, from countless women expressing gratitude at finding support for the first time, and from countless men expressing fury at the challenge to their households’ sexist status quo. Gu also delves deeper into intersectionality, a concept that required a great deal of education for the mostly-white, mostly-straight, middle-class editorship. Indeed, the film is often at its best when it expands beyond the magazine’s conference rooms to explore more about the history and history-makers of the era, including Alice Walker, Shirley Chisholm and Essence (and later Ms.) editor-in-chief Marcia Ann Gillespie. In Part Three, Aldarondo takes us further into sex and sexuality (sample Ms. cover line: “Erotica and Pornography: Do You Know the Difference?”). She too uses the opportunity to start with a relatively simple theme, and travel outwards. So a chapter on sex is a chapter on gender, work, politics and economics. It’s also a history of culture clashes, and we learn a lot about the feminist movement’s internecine battles, between women like erotic filmmaker Candida Royale and anti-porn activist Andrea Dworkin. Oddly, after going so deep into the magazine’s history, the film wraps up very abruptly; a single line tells us what’s happened to it over the last 25 years. This does also emphasize an overarching lack of cohesion between the three chapters, which never quite mesh in a fluid way. The general takeaway, though, is that this is a fascinating, complex story that needs to be told. And all three directors make great use of both archival footage and contemporary interviews. At one point, we hear someone ask a young Steinem just who it is she’s trying to reach. “Everybody,” she responds. And in 2025, that’s also who should see this maddening, inspiring and still-so-significant documentary. **Subscribe to Breaking News.** **Comments** **Latest Magazine Issue** **TheWrap** About Us Advertise Contact Careers Masthead Newsletters WrapBook **Wrap Pro** Subscribe Team Plan Learn More **Legal** Terms of Service Privacy Policy AdChoices **Wrap Magazine** Cannes College Emmys Oscars Advertise With Us **Follow Us** Visit The Wrap on facebook Visit The Wrap on twitter Visit The Wrap on instagram Visit The Wrap on youtube"}