{"id": 132, "name": "Boy Genius Report", "domain": "bgr.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://bgr.com/entertainment/shane-gillis-tires-has-a-near-perfect-audience-score-and-netflix-viewers-cant-get-enough/", "title": "Shane Gillis Tires Has A Near Perfect Audience Score And Netflix Viewers Cant Get Enough", "content": "NewscloseTechEntertainmentScienceBusinessLifestyle Tech Entertainment Science Business Lifestyle Tech Entertainment Science Business Lifestyle Reviews Best Guides Deals MorecloseAccessoriesApps & SoftwareAudioCamerasCarsComputersGamingHome & KitchenHome TheaterHow ToMobileSecurityShowsSmart HomeSpaceTabletsAbout Us Accessories Apps & Software Audio Cameras Cars Computers Gaming Home & Kitchen Home Theater How To Mobile Security Shows Smart Home Space Tablets About Us Accessories Apps & Software Audio Cameras Cars Computers Gaming Home & Kitchen Home Theater How To Mobile Security Shows Smart Home Space Tablets About Us Sign up for our daily newsletter About BGR Advertising Contact Us BGR's team sends an AM subscriber-only newsletter with the top tech & entertainment stories at 9AM ET. Sign up to read it. By signing up, I agree to theTerms of Useand have reviewed thePrivacy Notice. **Shane Gillis’ Tires has a near-perfect audience score, and Netflix viewers can’t get enough** If you buy through a BGR link, we may earn an affiliate commission, helping supportour expert product labs. It turns outTiresis more than just a show about an auto repair shop — it’s quickly becoming one ofNetflix’smost unlikely success stories. The blue-collarworkplace comedycreated by Shane Gillis, Steve Gerben, and John McKeever returned this week with a second season that’s now sitting near the top of Netflix’s US Top 10 list. As of this writing,TiresSeason 2 is ranked #2 onthe streamer, and it’s sporting a 92 percent audience score on Rotten Tomatoes. Not bad for a comedy that initially felt like Netflix trying a little too hard (at least in my opinion) to prove it also has shows for “guy’s guys,” complete with bro-y banter that sometimes lands and sometimes leaves you groaning. Still, whatever you think of its barstool banter sense of humor, audiences are clearly on board. And Gillis is having a major moment. If you’re new to the name: Shane Gillis is a stand-up comedian known for his 2023 Netflix specialBeautiful Dogs, as well as for his brief (and controversial) brush withSaturday Night Live. He’s since built a massive following, routinely selling out shows, including two sets at the Netflix Is A Joke Fest in 2024. His next Netflix stand-up special is also on the way. Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to theTerms of Useand have reviewed thePrivacy Notice. ButTiresrepresents something different. It’s not Gillis hamming it up on stage with a mic; this is him fully in character, playing a version of himself who works at a family-owned chain of auto shops. The show centers on Will (played by Gerben), a painfully anxious man who’s inherited the business from his dad and is doing his best not to run it into the ground. Unfortunately, his cousin Shane (Gillis) joins the team and seems determined to make things even worse. Season 2 picks up after Will and Shane’s chaotic marketing stunt somehow worked, and now they’re trying to keep the momentum going, personally and professionally. Alongside returning cast members like Chris O’Connor and Stavros Halkias, the new season brings in some big names: Thomas Haden Church as Shane’s father, plus appearances from Vince Vaughn, Jon Lovitz, and more. Gillis, Gerben, and McKeever, who also directs the series, continue to steer this testosterone-fueled ride into even more absurd territory. The jokes still lean rough around the edges, but there’s a weird charm in the chaos. Whether you’re a fan of Gillis’ stand-up or just in the mood for a low-stakes workplace comedy that doesn’t take itself too seriously,Tiresmight be worth a test drive. **This article talks about:** Andy Meek is a reporter based in Memphis who has covered media, entertainment, and culture for over 20 years. His work has appeared in outlets including The Guardian, Forbes, and The Financial Times, and he’s written for BGR since 2015. Andy's coverage includes technology and entertainment, and he has a particular interest in all things streaming. Over the years, he’s interviewed legendary figures in entertainment and tech that range from Stan Lee to John McAfee, Peter Thiel, and Reed Hastings. Here's our first look at the return of Apple TV+'s biggest sci-fi series Netflix Top 10: The most-watched series in the world right now Arnold Schwarzenegger's corny action series FUBAR returns to Netflix: 'Season 2 is bananas' **More Entertainment** **Tyler Perry’s dark new thriller is an instant smash hit on Netflix** **New on Prime Video: June 2025** **How to fix the battery charge indicator on your Nintendo Switch 2** **Apple TV+ summer 2025 lineup teased in new sizzle reel** **Latest News** **How macOS Tahoe’s Spotlight upgrade sets the stage for a smarter Siri** **5 ways Liquid Glass will change your Apple Watch in watchOS 26** **Lab-grown salmon is now being served in a US restaurant** **iOS 26 Apple Intelligence adds anime-style image creation via ChatGPT** Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to theTerms of Useand have reviewed thePrivacy Notice. BGR’s audience craves our industry-leading insights on the latest in tech and entertainment, as well as our authoritative and expansive reviews. We guide our loyal readers to some of the best products, latest trends, and most engaging stories with non-stop coverage, available across all major news platforms. Editorial Standards How We Test Products Founded in 2006 Over 2 billion visitors 100K+ articles published Millions of readers helped Honest news coverage, reviews, and opinions since 2006. - Jonathan S. Geller, Founder News Tech Entertainment Science Reviews Deals Guides About BGR Advertising Contact Us Privacy Policy AdChoices Terms Of Use California Privacy Rights Your Privacy Choices EU Privacy Preferences BGR is a part of Penske Media Corporation.© 2024 BGR Media, LLC. All Rights Reserved."}