{"id": 1975, "name": "Frontiers in Bioengineering and Biotechnology", "domain": "frontiersin.org/journals/bioengineering-and-biotechnology", "bias": "pro-science", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/bioengineering-and-biotechnology/articles/10.3389/fbioe.2025.1600077/full", "title": "Bioengineering And Biotechnology", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Biofabrication Biomaterials Biomechanics Bioprocess Engineering Biosafety and Biosecurity Biosensors and Biomolecular Electronics Cell and Gene Therapy Industrial Biotechnology Nanobiotechnology Organoids and Organ-On-A-Chip Synthetic Biology Tissue Engineering and Regenerative Medicine Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Biofabrication Biomaterials Biomechanics Bioprocess Engineering Biosafety and Biosecurity Biosensors and Biomolecular Electronics Cell and Gene Therapy Industrial Biotechnology Nanobiotechnology Organoids and Organ-On-A-Chip Synthetic Biology Tissue Engineering and Regenerative Medicine Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Biofabrication Biomaterials Biomechanics Bioprocess Engineering Biosafety and Biosecurity Biosensors and Biomolecular Electronics Cell and Gene Therapy Industrial Biotechnology Nanobiotechnology Organoids and Organ-On-A-Chip Synthetic Biology Tissue Engineering and Regenerative Medicine Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office PERSPECTIVE article Front. Bioeng. Biotechnol., 11 June 2025 Sec. Organoids and Organ-On-A-Chip Volume 13 - 2025 |https://doi.org/10.3389/fbioe.2025.1600077 This article is part of the Research TopicAdvancements in Image Processing and Analysis Techniques for Microphysiological SystemsView all 3 articles **More than just life and death: advances in imaging and analysis for 3D-bioprinted tissues** Bioprinting & Tissue Engineering Group, Center for Molecular Biology of Heidelberg University (ZMBH), Heidelberg, Germany 3D bioprinting is a fast-growing field with applications in both microphysiological systems and tissue engineering. However, the qualifications and definitions of success for 3D-bioprinted products are insufficient. We can further our characterization of 3D-bioprinting methods and finished products using new imaging techniques and analysis methods, including the use of AI tools. This multi-faceted approach can deepen our understanding of valuable technology by examining the effects of 3D bioprinting on cell identity, behavior and organelles. Defining a successful 3D-bioprinted product in addition to viability is crucial in the push toward using these models for drug screening or disease modeling, where robust and high-quality systems are required for meaningful data output. **Introduction** 3D bioprinting is becoming more common within the bioengineering field, bringing many benefits. However, as with many nascent fields, validation and characterization tools need to develop simultaneously to continue robust advancement. With the rise in 3D-bioprinted constructs, some tools can be carried over from traditional cell culture while others may need to be adapted for use with 3D biological platforms. Early studies used viability as a criteria for success, which has remained the gold standard (Calvert, 2007;Strauss et al., 2023), typically, performed using a live/dead imaging assay to determine the cell viability in 3D-bioprinted models. However, more robust information is needed, as the bioprinting process can cause cell-damaging stress, for example, via shear stress, cytotoxicity, or phototoxicity (Deo et al., 2020). These stressors affect more than just cell viability; although live/dead assays provide important information, consideration must also be given to proliferation status, cell morphology, metabolic state, and cell lineage. Several imaging and analysis methods for 3D-bioprinted systems can provide insight into these features. As these are multicellular systems, the analysis methods must be able to handle large data sets with the potential segmentation of large numbers of cells. Analysis can be performed using several commercially available or open-source software tools. AI segmentation can speed up and automate analysis of these large data sets. In traditional 2D cell culture, common assays used to characterize cells include vital dyes, metabolic assays, morphological analysis, and apoptosis/proliferation assays. Often, these characterizations are relatively straightforward for cells grown in a single layer. The addition of a third dimension adds some challenges to these characterizations–mainly lack of direct access to the cells and the bioinks’ opacity and permeability. Dyes and other reagents must penetrate the surrounding matrix to interact with the cells while the matrix’s transparency must be maintained for light-based microscopy. Inherent confounding factors also affect cell behavior such as oxygen and nutrient gradients from the surface of the structure to the center. We will discuss current light-based imaging and analysis practices within the bioprinting field as well as practices from other areas of cell culture that could be adapted for 3D cell culture. **3D-bioprinting methods** Printing methodologies can be categorized into pressure-based (Figure 1A) and light-based (Figure 1B) (Graham et al., 2017;Ozbolat and Hospodiuk, 2016;Murphy and Atala, 2014;Regehly et al., 2020). Each printing methodology uses cells encapsulated in compatible bioinks (natural or synthetic hydrogels) to create 3D structures and exerts various stresses on the cells that are not seen in traditional cell culture. It is vital to understand how the cell handling could affect the cells (i.e., shear stress in extrusion or droplet-based printing methods and phototoxicity in light-based methods). For example, shear stress can affect not only cell viability but also adhesion, proliferation, morphology and metabolic activity (Deo et al., 2020;Blaeser et al., 2016;Shi et al., 2018;Ng and Shkolnikov, 2024). In the cancer field, it has been shown that shear stress can cause epithelial-to-mesenchymal transition, a hallmark of cancer, and change gene expression (Choi et al., 2019;Alvarado-Estrada et al., 2021;Nauseef et al., 2012). Phototoxicity from UV or near-UV light can cause DNA damage, leading to carcinogenesis (de Gruijl et al., 2001;Wang et al., 2018). It therefore seems prudent for researchers to also qualify these factors compared to normal cell function, which can often be performed using a light-based microscopy method. Figure 1. Bioprinting methods stress cells, examples of imaging and analysis tools to characterize bioprinted models.(A)Pressure based 3D biopringting methods, drop on demand (left) exerts less shear stress than extrusion (right). If the printing process includes photocrosslinking then phototoxicity is also possible.(B)Light based 3D bioprinting methods. Laser assisted (left) and volumetric (right) both rely on light to crosslink structures, leading to phototoxicity.(C)Immunofluorescent confocal images. (Left) Z-stack image of HUVECs encapsulated in BME (basement membrane extract) stained with phalloidin for actin (green), Hoechst for nuclei (cyan), and ZO-1 (magenta). (Right) Co-culture of cHIMECs stained with CD31 (green) and colon fibroblast stained with vimentin (red). Nuclei (Hoechst) are in cyan(D)Confocal z-stack image of cell painting on colon organoids embedded in BME. Nuclei (blue), nucleoli (cyan), mitochondria (magenta), actin (orange), golgi and membrane (yellow). Left, also shows ER (green) with off target staining of the BME.(E)Analysis of cell movement over in a chemotaxis chip over 2 days in µm. Multiple fields of view were stitched together to enable complete tracing in the x,y direction. Movement of GFP-HUVECs was tracked at three timepoints Day 0 (not shown), Day 1 (top), and Day 2 (middle). Color coded trajectories (µm) of each cell is show on the bottom panel. HCT116 cells (gray) stained with live cell tubulin(F)Z-stack images of a cell painted organoid. (Left top) actin (orange) (Right top), nuclei (blue) and nucleoli (cyan). (Bottom right) 3D rendered masks generated by Imaris with total organoid mask in gray, and lumen in orange. (Bottom right) nuclei color coded by z-location, mask of nucleoli in cyan. Antibodies used: Phalloidin-Alexaflour 488 (Thermo Fisher, A12379), ZO-1 (Abcam ab221547), CD31 (abcam, ab124432), Vimentin (abcam, ab20346), Phenoview cell painting kit (Revvity, PING11), PhenoVue Fluor 674 – Live Cell Tubulin (Revvity, CP21R1). **Image-based evaluation methods** To evaluate viability, simple and readily available live/dead viability kits are often used (vital dyes such as Calcein AM/EthD-1). To understand the dynamics of both short- and long-term survival, viability is best evaluated at multiple points, as each will provide a single snapshot of both live and dead cell numbers (Zhang et al., 2019). Cell morphology dyes (e.g., phalloidin-rhodamine, CellTracker) pair nicely with viability stains (e.g., DRAQ7, thiazol-orange based DNA dyes) and can provide insight into cell type conformation or identification of morphological changes caused by the printing process (Zhai et al., 2018;Desroches et al., 2012;Chen et al., 2019;Akagi et al., 2013;Domahidy et al., 2024). Compared to monolayer, live cell dyes can present some challenges when used on 3D cultures. Monolayer or suspension cultures can accept dye into the media at any point, then perform a media change, removing residual background signal from unbound dye. Extracellular matrix (ECM) or bioink surrounding the cells can cause dye to stick in the bioink from binding or in pores within the matrix, which can create a high background signal during imaging or simply prevent the accumulation of dye in the cells resulting in a lack of signal. Mixing the dye before adding the bioink may produce a strong signal at the start of the experiment that decreases over time, causing challenges for long-term experiments. An alternative to tracking dyes is genetically engineered cells, which express a fluorescent protein. For example, H2B-GFP has a green fluorescent protein (GFP) fused to the histone-2b gene, resulting in GFP nuclei or cells that express a fluorescent protein in the cytoplasm (Kanda et al., 1998;Shagin et al., 2004;Shaner et al., 2004). Using fluorescent protein-expressing cells prevents interactions between the fluorophore and the ECM. When examining dead cells, it could be beneficial to differentiate between apoptotic and necrotic cells. Differentiating live, apoptotic, and necrotic cells to determine the effect of shear stress during the printing process was performed using annexin-V, a marker of early apoptosis (Nair et al., 2009). Combining annexin-V with propidium iodide (PI) enables the identification of early apoptotic cells, allowing them to be differentiated from late apoptotic cells. Necrotic cells were defined as positive for both annexin-V and PI while apoptotic cells are those only positive for annexin-V. Cells negative for both are considered live. Other assays enable imaging of apoptotic cells over time using DEVD peptides conjugated to a nuclear dye. DEVD is cleaved by caspase 3/7 activating the fluorophore, enabling imaging detection of apoptotic cells (Cen et al., 2008). This method has been used in 3D with spheroids to determine drug response (Mittler et al., 2017). Currently, it is difficult to determine the number of cells that may go down the apoptotic path directly post bioprinting; tracking this process could make it easier to determine the bioprinting methods with the least amount of cell loss. Immunofluorescent (IF) staining is a highly versatile method to examine many different aspects of a cell. Markers such as Ki67 can be used to determine proliferation while caspases can be used for cell death. This is important to differentiate since a viable cell may not be proliferating. Another use of IF antibodies is cell-specific markers, used to verify cell identity, and organelle markers that can be used to visualize cellular organelles. One group performed a differentiation assay to determine osteoblast phenotype over the course of 21 days (Zhai et al., 2018). Another group examined cellular differentiation status of cells grown on a 3D-printed scaffolding using lineage-specific markers (Chen et al., 2019). This same type of study could be transferred to bioprinted scaffolds. Specific antibody stains can be used to look at cell behaviors such as adhesion or cell junction formation to visualize a cell’s interaction with the surrounding matrix or cell-cell interactions (Figure 1C). Cell identity in a mixed culture can also be marked using cell-specific antibodies (Figure 1D). Cell painting combines multiple fluorophores that stain specific individual organelles within cells. Originally developed for use in high-content, high-throughput screening, cell painting enables visualization of cellular response to perturbations (Seal et al., 2025). While this technique works best on cells grown in monolayer, our lab has had some initial success adapting cell painting to 3D-bioprinted cells and organoids (Figure 1E). One limitation has arisen: Concanavalin A can bind to the extracellular matrix surrounding the cells, which creates an artifact that limits the ability to perform analysis of images that include this dye. Further optimization and testing of a compound library could highlight its utility in the 3D-bioprinting field. In situanalysis revealed increased proliferation on the periphery of printed GelMA constructs, which could be caused by multiple factors, including preparation, degree of functionalization, and cross-linking time. This exemplifies the importance of cell location when analyzing viability and proliferation (Allen et al., 2022). The location of cells within a matrix could affect the metabolic state due to oxygen and nutrient gradients. One way to understand this using imaging is to use fluorescent lifetime imaging (FLIM), measuring the decay time of endogenous fluorophores (e.g., NAD(P)H FAD) (Datta et al., 2020). Spatial metabolomics of 3D breast cancer spheroids and screening of cancer organoids for potential drug targets shows how this technique is already being used with 3D platforms (Karrobi et al., 2023;Tavakoli et al., 2025). Epigenetic control of cell states via chromatin wrapped around histones is a mechanism of gene regulation in eukaryotic cells. Histone modification (e.g., methylation, acetylation) is known to regulate gene expression by modulating transcription factor access to promoters, thereby changing the production of genes, switching them on or off. Highly differentiated cells have a different histone modification pattern than cells that retain their stemness (Volker-Albert et al., 2020). As sheer stress can cause cell differentiation changing cell identity, especially in vascular cells, histone modification status could be of interest to determine if epigenetic changes are present (Wang et al., 2005). Acetylated and methylated histones can be visualized using fluorescently labeled antibody fragments (Fabs) in single cells (Hayashi-Takanaka et al., 2011). A recent advancement resulted in the development of Fab-based imaging of live-endogenous modifications (FabLEM) (Saxton et al., 2023), which was used to determine histone modifications and transcription initiation. This live cell imaging technique could help to answer questions surrounding the time dynamic of epigenetic changes post bioprinting. **Analysis techniques** Image analysis can be performed for all techniques that use imaging as an output, turning qualitative data into quantitative data (Table 1). Many researchers achieve this using open-source ImageJ-based tools such as FIJI to quantitate their images (Schneider et al., 2012;Schindelin et al., 2012). Other open-source software includes CellProfiler for extracting quantitative date and CellProfiler Analyst to use machine learning (ML) algorithms to identify phenotypes (Stirling et al., 2021b;Stirling et al., 2021a). Advances in computer vision and ML now make it possible to quickly analyze large data sets. Cellpose is an open-source analysis tool with an algorithm that uses a neural network to segment both brightfield and fluorescent images (Stringer et al., 2021). Harmony software with Phenologic AI is a strong tool, but limited in its utility, as it is only compatible with Revvity (formerly PerkinElmer) imaging systems (Garvey et al., 2016). These programs can also provide morphological information in 3D systems such as spheroids and organoids (Spiller et al., 2021). Here, live/dead ML classification of organoids was compared to expert visual classification and DRAQ7. When all experts agreed on classification, concordance between ML and manual classification is 100%, yet only 62% between visual and DRAQ7, indicating morphological ML-based classification of organoids is more accurate than DRAQ7. Imaris (Bitplane) is another imaging analysis program focused on 3D images that enables the analysis of large data sets with a batch analysis feature. Using this software, dynamics of organoids and individual cells can be distinguished (Kim et al., 2020). Recently, Imaris software added machine learning algorithms for segmenting images based on images’ background and foreground classifications. However, the Imaris licensing cost can be prohibitive. Examples of analysis using Imaris, including cell tracking performed with time lapse imaging, are shown inFigure 1E. Imaging in 3D with multiple stains can provide multiple analysis of a single image (Figure 1F). Table 1. Selected image analysis tools. Convolutional neural networks (CNN) are a method of deep learning that consist of convolutional, pooling and fully connected layers (Li et al., 2022). U-Nets, named for their U-shaped architecture, are a type of CNN primarily used for image segmentation consisting of three main components: encoder, decoder, and a bridge to connect the two (Falk et al., 2019). The encoder extracts features, repeatedly applying convolutional layers and pooling them to reduce dimensionality while increasing the number of feature channels. The decoder up-samples the features previously mapped, gradually re-increasing the spatial resolution. The encoder concatenates the output, preserving fine details and improving segmentation. Training of both CNNs and U-Nets is performed by manually labeling ground truth data, feeding it through the network before measuring loss (Dice loss, intersection over union). The network is then backpropagated with the loss measurements updating its weights. This process is repeated until output is satisfactory, and the algorithm is challenged with a validation data set to prevent over training. Input data are 2D stack slices; however, 3D analysis is possible with 3D convolutional filters applied to 3D input data (i.e., width, height, depth). The image analysis field has recently seen many self-made algorithms based on machine learning applied directly to the creator’s area of interest. Cell Classification andIn-vitroLifecycle Evaluation (CeCILE), based on a CNN to detect radiation damage in cells (Rudigkeit et al., 2021), was trained on brightfield images of cells at different points in the cell cycle with and without radiation (mean f1score= 0.93). Celldeath is another tool trained on brightfield images to detect cell death earlier than a human would be able to visualize these changes, with 97.23% test set accuracy vs. 50% manual classification accuracy (La Greca et al., 2021). Though both of those tools are applied to 2D cell culture, similar methods can be applied to 3D. Tellu, an open-source object detector and classification tool, is trained on brightfield images of organoids and can be used on movie files, not just single static images, with a 0.79 mean average precision (Domenech-Moreno et al., 2023). Recently, Sheikh et al. used a CNN to determine spheroid viability, screening spheroids prior to use in 3D bioprinting and categorize them into four categories based on predicted viability (Sheikh et al., 2025). Their model has an accuracy of 92% with consistent loss below 0.2, demonstrating that these programs can be adapted to analyze 3D-bioprinted images. Algorithms that can both define regions of interest and sub-segment cells would be an optimal feature for analyzing 3D-bioprinted structures. Cell polarization is also important to many tissuesin vivo., as this ECM-driven process is vital to the functional structure of epithelial barriers (e.g., blood brain barrier, intestine), tissue development and repair (Lee and Streuli, 2014). This is simple to visualize with nuclear dyes, and the information can be obtained in parallel with other imaging assays by examining the directionality of nuclei in images. The Polarity-JaM tool suite could be used for this analysis (Giese et al., 2025) and demonstrates the advantage of answering multiple questions with a single imaging-based experiment. Images can be re-analyzed without having to perform additional wet lab experiments. **Discussion** As the 3D bioprinting field continues to evolve, keeping some additional considerations in mind will ensure the quality and proper function of models. Live/dead staining is an easily accessible and valuable tool but does not provide the in-depth data necessary for a robust characterization. Differentiating between apoptosis (caused by normal cell turnover) and necrosis (triggered by cell injury) is vital to the understanding of cell behavior post printing. Although normal cell turnover should be expected over time, a missing mechanism for clearing cellular debris may cause other effects. Insufficient clearance of dying cells within an organism can cause persistent inflammation and tissue injury and lead to many chronic conditions in humans, including lupus and chronic obstructive pulmonary disease (COPD) (Krysko et al., 2008). As many bioprinted tissue constructs do not contain phagocytes, some abnormalities related to continued presence of dead and dying cells could contribute to further damage of otherwise healthy cells within the sample. Some of the imaging assays discussed here could be used to determine if this scenario lowers long-term survival of 3D-bioprinted models. Of course, there are still many challenges to be solved when transitioning methods from 2D culture to 3D. One such challenge is analyzing intact samples, effected by both reagent and technical limitations (dye penetration, focal depth). Ifin situinformation is needed, such as location-dependent cell survival rates, the construct must be analyzed intact. This could be significant in determining whether cell death is caused by oxygen and nutrient deficiency due to cellular location rather than the printing process itself. Often, imaging larger samples is challenging because they become more opaque, resulting in light scattering. Z-resolution is another confounding factor, as resolution is lost in thicker samples. Compensating for this by switching to super-resolution microscopy (e.g., fluctuation-based) requires a costly and specialized set-up. Alternatively, deconvolution of images can help to sharpen images by assigning pixel intensity to a single slice in a z-stack. Progression in the 3D-bioprinting field needs innovative tools that help us to understand the systems being printed. To standardize MPS quality, there has recently been a call to develop much-needed standards similar to ISO criteria in other fields (Pamies et al., 2024). As we have shown here, a myriad of imaging-based assays and analysis tools could be used or adapted to further develop 3D bioprinting. Though the upfront investment for this pipeline is substantial (e.g., cost of equipment, commercial software), the return on investment could be high in industrial settings. On a smaller scale, academic settings often provide core facilities with specialized equipment and computing clusters for computational need. Expanding our understanding of 3D-bioprinted systems will benefit the field by facilitating production of high-quality model systems that consistently generate meaningful data. **Data availability statement** The original contributions presented in the study are included in the article/supplementary material, further inquiries can be directed to the corresponding author. **Ethics statement** Ethical approval was not required for the studies on humans in accordance with the local legislation and institutional requirements because only commercially available established cell lines were used. **Author contributions** ES: Writing – review and editing, Conceptualization, Writing – original draft. DD: Funding acquisition, Writing – review and editing. **Funding** The author(s) declare that financial support was received for the research and/or publication of this article. This research was funded by the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) under Germany’s Excellence Strategy via the Excellence Cluster 3D Matter Made to Order (EXC-2082/1-390761711). **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Generative AI statement** The author(s) declare that Generative AI was used in the creation of this manuscript. Generative AI promptsFigures 1A,Bwere partially created using Adobe Illustrator’s generate vector tool. “3D printer nozzle ejecting 3 round droplets containing cells” “Cell with nucleus” “Cross section of a vertical tube” “Extrusion 3D printer nozzle with filament” “Glass rectangle” “laser”. **Publisher’s note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **References** Akagi, J., Kordon, M., Zhao, H., Matuszek, A., Dobrucki, J., Errington, R., et al. (2013). Real-time cell viability assays using a new anthracycline derivative DRAQ7®.Cytom. Part A83, 227–234. doi:10.1002/cyto.a.22228 PubMed Abstract|CrossRef Full Text|Google Scholar Allen, N. B., Abar, B., Johnson, L., Burbano, J., Danilkowicz, R. M., and Adams, S. B. (2022). 3D-bioprinted GelMA-gelatin-hydroxyapatite osteoblast-laden composite hydrogels for bone tissue engineering.Bioprinting26, e00196. doi:10.1016/j.bprint.2022.e00196 CrossRef Full Text|Google Scholar Alvarado-Estrada, K., Marenco-Hillembrand, L., Maharjan, S., Mainardi, V. L., Zhang, Y. S., Zarco, N., et al. (2021). Circulatory shear stress induces molecular changes and side population enrichment in primary tumor-derived lung cancer cells with higher metastatic potential.Sci. Rep.11, 2800. doi:10.1038/s41598-021-82634-1 PubMed Abstract|CrossRef Full Text|Google Scholar Blaeser, A., Campos, D. F. D., Puster, U., Richtering, W., Stevens, M. M., and Fischer, H. (2016). Controlling shear stress in 3D bioprinting is a Key factor to balance printing resolution and stem cell integrity.Adv. Healthc. Mater.5, 326–333. doi:10.1002/adhm.201500677 PubMed Abstract|CrossRef Full Text|Google Scholar Calvert, P. (2007). Printing cells.Science318, 208–209. doi:10.1126/science.1144212 PubMed Abstract|CrossRef Full Text|Google Scholar Cen, H., Mao, F., Aronchik, I., Fuentes, R. J., and Firestone, G. L. (2008). DEVD-NucView488: a novel class of enzyme substrates for real-time detection of caspase-3 activity in live cells.Faseb J.22, 2243–2252. doi:10.1096/fj.07-099234 PubMed Abstract|CrossRef Full Text|Google Scholar Chen, H. X., Zhong, J. C., Wang, J., Huang, R. Y., Qiao, X. Y., Wang, H. H., et al. (2019). Enhanced growth and differentiation of myoblast cells grown on E-jet 3D printed platforms.Int. J. Nanomedicine14, 937–950. doi:10.2147/ijn.s193624 PubMed Abstract|CrossRef Full Text|Google Scholar Choi, H. Y., Yang, G. M., Dayem, A. A. E. T. A. L., Saha, S. K., Kim, K., Yoo, Y., et al. (2019). Hydrodynamic shear stress promotes epithelial-mesenchymal transition by downregulating ERK and GSK3β activities.Breast Cancer Res.21, 6. doi:10.1186/s13058-018-1071-2 PubMed Abstract|CrossRef Full Text|Google Scholar Datta, R., Heaster, T. M., Sharick, J. T., Gillette, A. A., and Skala, M. C. (2020). Fluorescence lifetime imaging microscopy: fundamentals and advances in instrumentation, analysis, and applications.J. Biomed. Opt.25, 1. doi:10.1117/1.jbo.25.7.071203 PubMed Abstract|CrossRef Full Text|Google Scholar De Gruijl, F. R., Van Kranen, H. J., and Mullenders, L. H. F. (2001). UV-induced DNA damage, repair, mutations and oncogenic pathways in skin cancer.J. Photochem. Photobiol. B-Biology63, 19–27. doi:10.1016/s1011-1344(01)00199-3 PubMed Abstract|CrossRef Full Text|Google Scholar Deo, K. A., Singh, K. A., Peak, C. W., Alge, D. L., and Gaharwar, A. K. (2020). Bioprinting 101: design, fabrication, and evaluation of cell-laden 3D bioprinted scaffolds.Tissue Eng. Part A26, 318–338. doi:10.1089/ten.tea.2019.0298 PubMed Abstract|CrossRef Full Text|Google Scholar Desroches, B. R., Zhang, P., Choi, B. R., King, M. E., Maldonado, A. E., Li, W., et al. (2012). Functional scaffold-free 3-D cardiac microtissues: a novel model for the investigation of heart cells.Am. J. Physiol. Heart Circ. Physiol.302, H2031–H2042. doi:10.1152/ajpheart.00743.2011 PubMed Abstract|CrossRef Full Text|Google Scholar Domahidy, F., Kovács, B., Cseri, L., Katona, G., Rózsa, B., Mucsi, Z., et al. (2024). Comprehensive study of thiazole-orange-based DNA dyes.Chemphotochem8. doi:10.1002/cptc.202400080 CrossRef Full Text|Google Scholar Domenech-Moreno, E., Brandt, A., Lemmetyinen, T. T., Wartiovaara, L., Makela, T. P., and Ollila, S. (2023). Tellu - an object-detector algorithm for automatic classification of intestinal organoids.Dis. Model Mech.16, dmm049756. doi:10.1242/dmm.049756 PubMed Abstract|CrossRef Full Text|Google Scholar Falk, T., Mai, D., Bensch, R., Cicek, O., Abdulkadir, A., Marrakchi, Y., et al. (2019). U-Net: deep learning for cell counting, detection, and morphometry.Nat. Methods16, 67–70. doi:10.1038/s41592-018-0261-2 PubMed Abstract|CrossRef Full Text|Google Scholar Garvey, C. M., Spiller, E., Lindsay, D., Chiang, C. T., Choi, N. C., Agus, D. B., et al. (2016). A high-content image-based method for quantitatively studying context-dependent cell population dynamics.Sci. Rep.6, 29752. doi:10.1038/srep29752 PubMed Abstract|CrossRef Full Text|Google Scholar Giese, W., Albrecht, J. P., Oppenheim, O., Akmeric, E. B., Kraxner, J., Schmidt, D., et al. (2025). Polarity-JaM: an image analysis toolbox for cell polarity, junction and morphology quantification.Nat. Commun.16, 1474. doi:10.1038/s41467-025-56643-x PubMed Abstract|CrossRef Full Text|Google Scholar Graham, A. D., Olof, S. N., Burke, M. J., Armstrong, J. P. K., Mikhailova, E. A., Nicholson, J. G., et al. (2017). High-resolution patterned cellular constructs by droplet-based 3D printing.Sci. Rep.7, 7004. doi:10.1038/s41598-017-06358-x PubMed Abstract|CrossRef Full Text|Google Scholar Hayashi-Takanaka, Y., Yamagata, K., Wakayama, T., Stasevich, T. J., Kainuma, T., Tsurimoto, T., et al. (2011). Tracking epigenetic histone modifications in single cells using Fab-based live endogenous modification labeling.Nucleic Acids Res.39, 6475–6488. doi:10.1093/nar/gkr343 PubMed Abstract|CrossRef Full Text|Google Scholar Kanda, T., Sullivan, K. F., and Wahl, G. M. (1998). Histone-GFP fusion protein enables sensitive analysis of chromosome dynamics in living mammalian cells.Curr. Biol.8, 377–385. doi:10.1016/s0960-9822(98)70156-3 PubMed Abstract|CrossRef Full Text|Google Scholar Karrobi, K., Tank, A., Fuzail, M. A., Kalidoss, M., Tilbury, K., Zaman, M., et al. (2023). Fluorescence Lifetime Imaging Microscopy (FLIM) reveals spatial-metabolic changes in 3D breast cancer spheroids.Sci. Rep.13, 3624. doi:10.1038/s41598-023-30403-7 PubMed Abstract|CrossRef Full Text|Google Scholar Kim, S., Choung, S., Sun, R. X., Ung, N., Hashemi, N., Fong, E. J., et al. (2020). Comparison of cell and organoid-level analysis of patient-derived 3D organoids to evaluate tumor cell growth dynamics and drug response.SLAS Discov.25, 744–754. doi:10.1177/2472555220915827 PubMed Abstract|CrossRef Full Text|Google Scholar Krysko, D. V., Vanden Berghe, T., Parthoens, E., D'Herde, K., and Vandenabeele, P. (2008). Methods for distinguishing apoptotic from necrotic cells and measuring their clearance.Program. Cell Death, General Princ. Stud. Cell Death, Pt A442, 307–341. doi:10.1016/S0076-6879(08)01416-X PubMed Abstract|CrossRef Full Text|Google Scholar La Greca, A. D., Perez, N., Castaneda, S., Milone, P. M., Scarafia, M. A., Mobbs, A. M., et al. (2021). celldeath: a tool for detection of cell death in transmitted light microscopy images by deep learning-based visual recognition.PLoS One16, e0253666. doi:10.1371/journal.pone.0253666 PubMed Abstract|CrossRef Full Text|Google Scholar Lee, J. L., and Streuli, C. H. (2014). Integrins and epithelial cell polarity.J. Cell Sci.127, 3217–3225. doi:10.1242/jcs.146142 PubMed Abstract|CrossRef Full Text|Google Scholar Li, Z., Liu, F., Yang, W., Peng, S., and Zhou, J. (2022). A survey of convolutional neural networks: analysis, applications, and prospects.IEEE Trans. Neural Netw. Learn Syst.33, 6999–7019. doi:10.1109/tnnls.2021.3084827 PubMed Abstract|CrossRef Full Text|Google Scholar Mittler, F., Obeïd, P., Rulina, A. V., Haguet, V., Gidrol, X., and Balakirev, M. Y. (2017). High-content monitoring of drug effects in a 3D spheroid model.Front. Oncol.7, 293. doi:10.3389/fonc.2017.00293 PubMed Abstract|CrossRef Full Text|Google Scholar Murphy, S. V., and Atala, A. (2014). 3D bioprinting of tissues and organs.Nat. Biotechnol.32, 773–785. doi:10.1038/nbt.2958 PubMed Abstract|CrossRef Full Text|Google Scholar Nair, K., Gandhi, M., Khalil, S., Yan, K. C., Marcolongo, M., Barbee, K., et al. (2009). Characterization of cell viability during bioprinting processes.Biotechnol. J.4, 1168–1177. doi:10.1002/biot.200900004 PubMed Abstract|CrossRef Full Text|Google Scholar Nauseef, J. T., Barnes, J. M., and Henry, M. D. (2012). Abstract 436: resistance to fluid shear stress is a conserved novel biophysical property of malignant cells.Cancer Res.72, 436. doi:10.1158/1538-7445.am2012-436 CrossRef Full Text|Google Scholar Ng, W. L., and Shkolnikov, V. (2024). Optimizing cell deposition for inkjet-based bioprinting.Int. J. Bioprinting10, 2135–2206. doi:10.36922/ijb.2135 CrossRef Full Text|Google Scholar Ozbolat, I. T., and Hospodiuk, M. (2016). Current advances and future perspectives in extrusion-based bioprinting.Biomaterials76, 321–343. doi:10.1016/j.biomaterials.2015.10.076 PubMed Abstract|CrossRef Full Text|Google Scholar Pamies, D., Ekert, J., Zurich, M. G., Frey, O., Werner, S., Piergiovanni, M., et al. (2024). Recommendations on fit-for-purpose criteria to establish quality management for microphysiological systems and for monitoring their reproducibility.Stem Cell Rep.19, 1041. doi:10.1016/j.stemcr.2024.06.007 PubMed Abstract|CrossRef Full Text|Google Scholar Regehly, M., Garmshausen, Y., Reuter, M., Konig, N. F., Israel, E., Kelly, D. P., et al. (2020). Xolography for linear volumetric 3D printing.Nature588, 620–624. doi:10.1038/s41586-020-3029-7 PubMed Abstract|CrossRef Full Text|Google Scholar Rudigkeit, S., Reindl, J. B., Matejka, N., Ramson, R., Sammer, M., Dollinger, G., et al. (2021). CeCILE - an artificial intelligence based cell-detection for the evaluation of radiation effects in eucaryotic cells.Front. Oncol.11, 688333. doi:10.3389/fonc.2021.688333 PubMed Abstract|CrossRef Full Text|Google Scholar Saxton, M. N., Morisaki, T., Krapf, D., Kimura, H., and Stasevich, T. J. (2023). Live-cell imaging uncovers the relationship between histone acetylation, transcription initiation, and nucleosome mobility.Sci. Adv.9, eadh4819. doi:10.1126/sciadv.adh4819 PubMed Abstract|CrossRef Full Text|Google Scholar Schindelin, J., Arganda-Carreras, I., Frise, E., Kaynig, V., Longair, M., Pietzsch, T., et al. (2012). Fiji: an open-source platform for biological-image analysis.Nat. Methods9, 676–682. doi:10.1038/nmeth.2019 PubMed Abstract|CrossRef Full Text|Google Scholar Schneider, C. A., Rasband, W. S., and Eliceiri, K. W. (2012). NIH Image to ImageJ: 25 years of image analysis.Nat. Methods9, 671–675. doi:10.1038/nmeth.2089 PubMed Abstract|CrossRef Full Text|Google Scholar Seal, S., Trapotsi, M. A., Spjuth, O., Singh, S., Carreras-Puigvert, J., Greene, N., et al. (2025). Cell Painting: a decade of discovery and innovation in cellular imaging.Nat. Methods22, 254–268. doi:10.1038/s41592-024-02528-8 PubMed Abstract|CrossRef Full Text|Google Scholar Shagin, D. A., Barsova, E. V., Yanushevich, Y. G., Fradkov, A. F., Lukyanov, K. A., Labas, Y. A., et al. (2004). GFP-like proteins as ubiquitous metazoan superfamily: evolution of functional features and structural complexity.Mol. Biol. Evol.21, 841–850. doi:10.1093/molbev/msh079 PubMed Abstract|CrossRef Full Text|Google Scholar Shaner, N. C., Campbell, R. E., Steinbach, P. A., Giepmans, B. N., Palmer, A. E., and Tsien, R. Y. (2004). Improved monomeric red, orange and yellow fluorescent proteins derived from Discosoma sp. red fluorescent protein.Nat. Biotechnol.22, 1567–1572. doi:10.1038/nbt1037 PubMed Abstract|CrossRef Full Text|Google Scholar Sheikh, Z. A., Clarke, O., Mir, A., and Hibino, N. (2025). Deep learning for predicting spheroid viability: novel convolutional neural network model for automating quality control for three-dimensional bioprinting.Bioeng. (Basel)12, 28. doi:10.3390/bioengineering12010028 PubMed Abstract|CrossRef Full Text|Google Scholar Shi, J., Wu, B., Li, S., Song, J., Song, B., and Lu, W. F. (2018). Shear stress analysis and its effects on cell viability and cell proliferation in drop-on-demand bioprinting.Biomed. Phys. and Eng. Express4, 045028. doi:10.1088/2057-1976/aac946 CrossRef Full Text|Google Scholar Spiller, E., Ung, N., Kim, S., Patsch, K., Lau, R., Strelez, C., et al. (2021). Imaging-based machine learning analysis of patient-derived tumor organoid drug response.Front. Oncol.5422, 771173. doi:10.3389/fonc.2021.771173 PubMed Abstract|CrossRef Full Text|Google Scholar Stirling, D. R., Carpenter, A. E., and Cimini, B. A. (2021a). CellProfiler Analyst 3.0: accessible data exploration and machine learning for image analysis.Bioinformatics37, 3992–3994. doi:10.1093/bioinformatics/btab634 PubMed Abstract|CrossRef Full Text|Google Scholar Stirling, D. R., Swain-Bowden, M. J., Lucas, A. M., Carpenter, A. E., Cimini, B. A., and Goodman, A. (2021b). CellProfiler 4: improvements in speed, utility and usability.Bmc Bioinforma.22, 433. doi:10.1186/s12859-021-04344-9 PubMed Abstract|CrossRef Full Text|Google Scholar Strauss, S., Garces, D. G., and Hubbuch, J. (2023). Analytics in extrusion-based bioprinting: standardized methods improving quantification and comparability of the performance of bioinks.Polymers15, 1829. doi:10.3390/polym15081829 PubMed Abstract|CrossRef Full Text|Google Scholar Stringer, C., Wang, T., Michaelos, M., and Pachitariu, M. (2021). Cellpose: a generalist algorithm for cellular segmentation.Nat. Methods18, 100–106. doi:10.1038/s41592-020-01018-x PubMed Abstract|CrossRef Full Text|Google Scholar Tavakoli, N., Fong, E. J., Coleman, A., Huang, Y. K., Bigger, M., Doche, M. E., et al. (2025). Merging metabolic modeling and imaging for screening therapeutic targets in colorectal cancer.NPJ Syst. Biol. Appl.11, 12. doi:10.1038/s41540-025-00494-1 PubMed Abstract|CrossRef Full Text|Google Scholar Volker-Albert, M., Bronkhorst, A., Holdenrieder, S., and Imhof, A. (2020). Histone modifications in stem cell development and their clinical implications.Stem Cell Rep.15, 1196–1205. doi:10.1016/j.stemcr.2020.11.002 PubMed Abstract|CrossRef Full Text|Google Scholar Wang, Z. J., Kumar, H., Tian, Z. L., Jin, X., Holzman, J. F., Menard, F., et al. (2018). Visible light photoinitiation of cell-adhesive gelatin methacryloyl hydrogels for stereolithography 3D bioprinting.Acs Appl. Mater. and Interfaces10, 26859–26869. doi:10.1021/acsami.8b06607 PubMed Abstract|CrossRef Full Text|Google Scholar Wang, H., Riha, G. M., Yan, S., Li, M., Chai, H., Yang, H., et al. (2005). Shear stress induces endothelial differentiation from a murine embryonic mesenchymal progenitor cell line.Arterioscler. Thromb. Vasc. Biol.25, 1817–1823. doi:10.1161/01.atv.0000175840.90510.a8 PubMed Abstract|CrossRef Full Text|Google Scholar Zhai, X. Y., Ruan, C. S., Ma, Y. F., Cheng, D. L., Wu, M. M., Liu, W. G., et al. (2018). 3D-Bioprinted osteoblast-laden nanocomposite hydrogel constructs with induced microenvironments promote cell viability, differentiation, and osteogenesis bothin vitroandin vivo.Adv. Sci.5, 1700550. doi:10.1002/advs.201700550 PubMed Abstract|CrossRef Full Text|Google Scholar Zhang, J. H., Wehrle, E., Vetsch, J. R., Paul, G. R., Rubert, M., and Muller, R. (2019). Alginate dependent changes of physical properties in 3D bioprinted cell-laden porous scaffolds affect cell viability and cell morphology.Biomed. Mater.14, 065009. doi:10.1088/1748-605x/ab3c74 PubMed Abstract|CrossRef Full Text|Google Scholar Keywords:machine learning, 3D bioprinting, CNN - convolutional neural network, 3D cell culture, image analysis, AI image analysis, light microscopy Citation:Spiller ER and Duarte Campos DF (2025) More than just life and death: advances in imaging and analysis for 3D-bioprinted tissues.Front. Bioeng. Biotechnol.13:1600077. doi: 10.3389/fbioe.2025.1600077 Received:25 March 2025;Accepted:27 May 2025;Published:11 June 2025. Edited by: Reviewed by: Copyright© 2025 Spiller and Duarte Campos. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY).The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Erin R. Spiller,ZS5zcGlsbGVyQHptYmgudW5pLWhlaWRlbGJlcmcuZGU= Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract Introduction 3D-bioprinting methods Image-based evaluation methods Analysis techniques Discussion Data availability statement Ethics statement Author contributions Funding Conflict of interest Generative AI statement Publisher’s note References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}