{"id": 1112, "name": "Popular Science", "domain": "popsci.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.popsci.com/science/if-people-stopped-having-babies-how-long-would-it-be-before-humans-were-all-gone/", "title": "If People Stopped Having Babies How Long Would It Be Before Humans Were All Gone", "content": "ScienceArchaeologyAsk Us AnythingBiologyDinosaursPhysicsPopular Science VideosSpaceThe Weirdest Thing I Learned This Week Archaeology Ask Us Anything Biology Dinosaurs Physics Popular Science Videos Space The Weirdest Thing I Learned This Week Archaeology Ask Us Anything Biology Dinosaurs Physics Popular Science Videos Space The Weirdest Thing I Learned This Week TechnologyAIAviationBest of What's NewEngineeringInternetMilitaryRobotsSecurityVehiclesPhotography AI Aviation Best of What's New Engineering Internet Military Robots Security Vehicles Photography AI Aviation Best of What's New Engineering Internet Military Robots Security Vehicles Photography EnvironmentAgricultureAnimalsClimate ChangeConservationEnergySustainabilityWeather Agriculture Animals Climate Change Conservation Energy Sustainability Weather Agriculture Animals Climate Change Conservation Energy Sustainability Weather DIYLife SkillsProjectsTech Hacks Life Skills Projects Tech Hacks Life Skills Projects Tech Hacks GearAudioCamerasComputersFitness GearGamingGift GuidesHomeHome TheaterOutdoor GearPhonesTabletsWearables Audio Cameras Computers Fitness Gear Gaming Gift Guides Home Home Theater Outdoor Gear Phones Tablets Wearables Audio Cameras Computers Fitness Gear Gaming Gift Guides Home Home Theater Outdoor Gear Phones Tablets Wearables MERCHCover ArtStore Cover Art Store Cover Art Store Newsletter **If people stopped having babies, how long would it be before humans were all gone?** ByMichael A. Little / The Conversation PublishedJun 11, 2025 8:00 AM EDT This article was originally featured onThe Conversation. If people stopped having babies, how long would it be before humans were all gone? – Jeffrey Veryfew people live beyond a century. So, if no one had babies anymore, there would probably be no humans left on Earth within 100 years. But first, the population would shrink as older folks died and no one was being born. Even if all births were to suddenly cease, this decline would start slowly. Eventually there would not be enough young people coming of age to do essential work, causing societies throughout the world to quickly fall apart. Some of these breakdowns would be in humanity’s ability to produce food, provide health care and do everything else we all rely on. Food would become scarce even though there would be fewer people to feed. As an anthropology professorwho has spent his career studying human behavior, biology and cultures, I readily admit that this would not be a pretty picture. Eventually, civilization would crumble. It’s likely that there would not be many people left within 70 or 80 years, rather than 100, due to shortages of food, clean water, prescription drugs and everything else that you can easily buy today and need to survive. **Sudden change could follow a catastrophe** To be sure, an abrupt halt in births is highly unlikely unless there’s a global catastrophe. Here’s one potential scenario, which writerKurt Vonnegut explored in his novel “Galapagos”: A highly contagious disease could render allpeople of reproductive age infertile– meaning that no one would be capable of having babies anymore. Another possibility might bea nuclear war that no one survives– a topic that’s beenexplored in many scary movies and books. A lot of these works are science fiction involving a lot of space travel. Others seek to predict a less fanciful Earth-bound future where people can no longer reproduce easily, causing collective despair and the loss of personal freedom for those who are capable of having babies. Two of my favorite books along these lines are “The Handmaid’s Tale,” by Canadian writer Margaret Atwood, and “The Children of Men,” by British writer P.D. James. They are dystopian stories, meaning that they take place in an unpleasant future with a great deal of human suffering and disorder. And both have become the basis of television series and movies. In the 1960s and 1970s, many people also worried that there would be too many people on Earth, which would causedifferent kinds of catastrophes. Those scenarios also became the focus of dystopian books and movies. **Heading toward 10 billion people** To be sure, the number of people in the world is still growing, even though the pace of that growth has slowed down. Experts who study population changes predict that the total willpeak at 10 billion in the 2080s, up from 8 billion today and4 billion in 1974. TheU.S. population currently stands at 342 million. That’s about 200 million more people than were here when I was born in the 1930s. This is a lot of people, but both worldwide and in the U.S. these numbers could gradually fall if more people die than are born. About 3.6 million babies were born in the U.S. in 2024,down from 4.1 million in 2004. Meanwhile, about3.3 million people died in 2022, up from 2.4 million 20 years earlier. One thing that will be important as these patterns change is whether there’s a manageable balance between young people and older people. That’s because the young often are the engine of society. They tend to be the ones to implement new ideas and produce everything we use. Also, many older people need help from younger people with basic activities, like cooking and getting dressed. And a wide range of jobs are more appropriate for people under 65 rather than those who have reached thetypical age for retirement. **Declining birth rates** In many countries, women are having fewer children throughout their reproductive lives than used to be the case. That reduction is the most stark in several countries, includingIndia and South Korea. The declines in birth rates occurring today are largely caused by people choosing not to have any children or as many as their parents did. That kind of population decline can be kept manageable through immigration from other countries, butcultural and political concerns often stop thatfrom happening. At the same time, many men are becoming less able to father children due tofertility problems. If that situation gets much worse, it could contribute to a steep decline in population. **Neanderthals went extinct** Our species,Homo sapiens, has been around for at least 200,000 years. That’s a long time, but like all animals on Earth we are at risk of becoming extinct. Considerwhat happened to the Neanderthals, a close relative ofHomo sapiens. They first appeared at least 400,000 years ago. Our modern human ancestors overlapped for a while with the Neanderthals, whogradually declinedto become extinct about 40,000 years ago. Some scientists have found evidence that modern humans were more successful at reproducing our numbers than the Neanderthal people. This occurred whenHomo sapiensbecame more successful at providing food for their families and also having more babies than the Neanderthals. If humans were to go extinct, it could open up opportunities for other animals to flourish on Earth. On the other hand, it would be sad for humans to go away because we would lose all of the great achievements people have made, including in the arts and science. In my view, we need to take certain steps to ensure that we have a long future on our own planet. These includecontrolling climate changeand avoiding wars. Also, we need to appreciate the fact that having awide array of animals and plantsmakes the planet healthy for all creatures, including our own species. Hello, curious kids! Do you have a question you’d like an expert to answer? Ask an adult to send your question toCuriousKidsUS@theconversation.com. Please tell us your name, age and the city where you live. And since curiosity has no age limit – adults, let us know what you’re wondering, too. We won’t be able to answer every question, but we will do our best. **More deals, reviews, and buying guides** More deals, reviews, and buying guides More deals, reviews, and buying guides **Michael A. Little / The Conversation** **Content Partner** Health **Trending** **What happens when our brain goes blankWhat happens when our brain goes blank** **What happens when our brain goes blankWhat happens when our brain goes blank** ByRJ Mackenzie **Osprey drops hammerhead shark onto disc golf fieldOsprey drops hammerhead shark onto disc golf field** **Osprey drops hammerhead shark onto disc golf fieldOsprey drops hammerhead shark onto disc golf field** ByAndrew Paul **More in Science** **Sunscreen may have kept ancient humans alive during a polar reversalSunscreen may have kept ancient humans alive during a polar reversal** **Sunscreen may have kept ancient humans alive during a polar reversalSunscreen may have kept ancient humans alive during a polar reversal** ByLaura Baisas **Scientists pinpoint age of suspected human-Neanderthal hybrid childScientists pinpoint age of suspected human-Neanderthal hybrid child** **Scientists pinpoint age of suspected human-Neanderthal hybrid childScientists pinpoint age of suspected human-Neanderthal hybrid child** ByAndrew Paul **Neanderthals’ social isolation may have sped up their extinctionNeanderthals’ social isolation may have sped up their extinction** **Neanderthals’ social isolation may have sped up their extinctionNeanderthals’ social isolation may have sped up their extinction** ByLaura Baisas **Why do babies’ eyes change color? Sunlight, genetics, and more.Why do babies’ eyes change color? Sunlight, genetics, and more.** **Why do babies’ eyes change color? Sunlight, genetics, and more.Why do babies’ eyes change color? Sunlight, genetics, and more.** BySarah Lindenfeld Hall **Without humans, what would happen to Earth?Without humans, what would happen to Earth?** **Without humans, what would happen to Earth?Without humans, what would happen to Earth?** ByLauren Leffer **Bed bugs have been bothering humans for 60,000 yearsBed bugs have been bothering humans for 60,000 years** **Bed bugs have been bothering humans for 60,000 yearsBed bugs have been bothering humans for 60,000 years** ByLaura Baisas **Humpback whales can give birth while migrating thousands of milesHumpback whales can give birth while migrating thousands of miles** **Humpback whales can give birth while migrating thousands of milesHumpback whales can give birth while migrating thousands of miles** ByLaura Baisas **Do people in blue zones actually live longer?Do people in blue zones actually live longer?** **Do people in blue zones actually live longer?Do people in blue zones actually live longer?** ByClarissa Brincat **Like science, tech, and DIY projects?** Breakthroughs, discoveries, and DIY tips sent every weekday. By signing up you agree to ourTerms of ServiceandPrivacy Policy. ScienceArchaeologyAsk Us AnythingBiologyDinosaursPhysicsPopular Science VideosSpaceThe Weirdest Thing I Learned This Week **Science** Archaeology **Archaeology** Ask Us Anything **Ask Us Anything** Biology **Biology** Dinosaurs **Dinosaurs** Physics **Physics** Popular Science Videos **Popular Science Videos** Space **Space** The Weirdest Thing I Learned This Week **The Weirdest Thing I Learned This Week** **Science** **Science** Archaeology **Archaeology** **Archaeology** **Archaeology** Ask Us Anything **Ask Us Anything** **Ask Us Anything** **Ask Us Anything** Biology **Biology** **Biology** **Biology** Dinosaurs **Dinosaurs** **Dinosaurs** **Dinosaurs** Physics **Physics** **Physics** **Physics** Popular Science Videos **Popular Science Videos** **Popular Science Videos** **Popular Science Videos** Space **Space** **Space** **Space** The Weirdest Thing I Learned This Week **The Weirdest Thing I Learned This Week** **The Weirdest Thing I Learned This Week** **The Weirdest Thing I Learned This Week** TechnologyAIAviationBest of What's NewEngineeringInternetMilitaryRobotsSecurityPhotography **Technology** AI **AI** Aviation **Aviation** Best of What's New **Best of What's New** Engineering **Engineering** Internet **Internet** Military **Military** Robots **Robots** Security **Security** Photography **Photography** **Technology** **Technology** AI **AI** **AI** **AI** Aviation **Aviation** **Aviation** **Aviation** Best of What's New **Best of What's New** **Best of What's New** **Best of What's New** Engineering **Engineering** **Engineering** **Engineering** Internet **Internet** **Internet** **Internet** Military **Military** **Military** **Military** Robots **Robots** **Robots** **Robots** Security **Security** **Security** **Security** Photography **Photography** **Photography** **Photography** EnvironmentAgricultureAnimalsClimate ChangeConservationEnergySustainabilityWeather **Environment** Agriculture **Agriculture** Animals **Animals** Climate Change **Climate Change** Conservation **Conservation** Energy **Energy** Sustainability **Sustainability** Weather **Weather** **Environment** **Environment** Agriculture **Agriculture** **Agriculture** **Agriculture** Animals **Animals** **Animals** **Animals** Climate Change **Climate Change** **Climate Change** **Climate Change** Conservation **Conservation** **Conservation** **Conservation** Energy **Energy** **Energy** **Energy** Sustainability **Sustainability** **Sustainability** **Sustainability** Weather **Weather** **Weather** **Weather** DIYLife SkillsProjectsTech Hacks **DIY** Life Skills **Life Skills** Projects **Projects** Tech Hacks **Tech Hacks** **DIY** **DIY** Life Skills **Life Skills** **Life Skills** **Life Skills** Projects **Projects** **Projects** **Projects** Tech Hacks **Tech Hacks** **Tech Hacks** **Tech Hacks** GearAudioCamerasComputersFitness GearGamingGift GuidesHomeHome TheaterOutdoor GearPhonesTabletsWearables **Gear** Audio **Audio** Cameras **Cameras** Computers **Computers** Fitness Gear **Fitness Gear** Gaming **Gaming** Gift Guides **Gift Guides** Home **Home** Home Theater **Home Theater** Outdoor Gear **Outdoor Gear** Phones **Phones** Tablets **Tablets** Wearables **Wearables** **Gear** **Gear** Audio **Audio** **Audio** **Audio** Cameras **Cameras** **Cameras** **Cameras** Computers **Computers** **Computers** **Computers** Fitness Gear **Fitness Gear** **Fitness Gear** **Fitness Gear** Gaming **Gaming** **Gaming** **Gaming** Gift Guides **Gift Guides** **Gift Guides** **Gift Guides** Home **Home** **Home** **Home** Home Theater **Home Theater** **Home Theater** **Home Theater** Outdoor Gear **Outdoor Gear** **Outdoor Gear** **Outdoor Gear** Phones **Phones** **Phones** **Phones** Tablets **Tablets** **Tablets** **Tablets** Wearables **Wearables** **Wearables** **Wearables** MoreEditorial StandardsHow We Test And Review ProductsTV ChannelAbout UsContact UsPopSci MerchPopSci ShopPopSci+Privacy PolicyTerms & ConditionsAffiliate DisclosureSitemapDepositPhotos **More** Editorial Standards **Editorial Standards** How We Test And Review Products **How We Test And Review Products** TV Channel **TV Channel** About Us **About Us** Contact Us **Contact Us** PopSci Merch **PopSci Merch** PopSci Shop **PopSci Shop** PopSci+ **PopSci+** Privacy Policy **Privacy Policy** Terms & Conditions **Terms & Conditions** Affiliate Disclosure **Affiliate Disclosure** Sitemap **Sitemap** DepositPhotos **DepositPhotos** **More** **More** Editorial Standards **Editorial Standards** **Editorial Standards** **Editorial Standards** How We Test And Review Products **How We Test And Review Products** **How We Test And Review Products** **How We Test And Review Products** TV Channel **TV Channel** **TV Channel** **TV Channel** About Us **About Us** **About Us** **About Us** Contact Us **Contact Us** **Contact Us** **Contact Us** PopSci Merch **PopSci Merch** **PopSci Merch** **PopSci Merch** PopSci Shop **PopSci Shop** **PopSci Shop** **PopSci Shop** PopSci+ **PopSci+** **PopSci+** **PopSci+** Privacy Policy **Privacy Policy** **Privacy Policy** **Privacy Policy** Terms & Conditions **Terms & Conditions** **Terms & Conditions** **Terms & Conditions** Affiliate Disclosure **Affiliate Disclosure** **Affiliate Disclosure** **Affiliate Disclosure** Sitemap **Sitemap** **Sitemap** **Sitemap** DepositPhotos **DepositPhotos** **DepositPhotos** **DepositPhotos** **FOLLOW US** **DISCLAIMER(S)** Articles may contain affiliate links which enable us to share in the revenue of any purchases made.Registration on or use of this site constitutes acceptance of our Terms of Service.© 2025Recurrent. All rights reserved."}