{"id": 1543, "name": "Vulture", "domain": "vulture.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.vulture.com/article/next-gen-nyc-series-premiere-recap-season-1-episode-1-welcome-to-new-york.html", "title": "Next Gen Nyc Series Premiere Recap Season 1 Episode 1 Welcome To New York.html", "content": "Intelligencer The Cut Vulture The Strategist Curbed Grub Street MagazineSubscribe to the MagazineGive a Gift SubscriptionBuy Back IssuesCurrent Issue ContentsNew YorkShop Subscribe Sign In AccountProfileSaved for laterSign Out TV Recaps TV Movies Comedy Music What to Stream Books Theater Art Awards Coverage Podcasts Criticism About Newsletters New York App Cinematrix Archive Vulture Festival NYMag.com New York Magazine Intelligencer Vulture The Cut The Strategist Grub Street Curbed **Search** TV Recaps TV Movies Comedy Music What to Stream Books Theater Art Awards Coverage Podcasts Criticism About Newsletters New York App Cinematrix Archive Vulture Festival NYMag.com New York Magazine Intelligencer Vulture The Cut The Strategist Grub Street Curbed **Search** Things you buy through our links may earnVox Mediaa commission. **Next Gen NYCSeries-Premiere Recap: The Kids Are Alright** **Next Gen NYC** **Next Gen NYC** Save this article to read it later. Find this story in your account’s‘Saved for Later’section. **Next Gen NYC** **Next Gen NYC** They grow up so fast. One minute, we’re watching the children of our belovedReal Housewivesdance in the background of their mom’s title card or have a mental breakdown because they lost a game of tug-of-war at field day, but before you know it, they’re leading their own reality show. That’s the loose premise ofNext Gen NYC— a show following a group of rich, well-connected twenty-somethings navigating Manhattan with their friends … after meeting each other at BravoCon. The vibe is the reboot ofGossip GirlmeetsThe City, and the whole time, it feels like Kelly Cutrone is going to show up at any minute to yell at these kids. The first of those kids that we meet, oddly, is Ariana Biermann — NOTTate McRae, as your eyeballs might lead you to believe (one sings about a sports car, and the othercrashesthem). Ariana is, of course, the daughter of Kim Zolciak, a former cast memberofThe Real Housewives of Atlanta, and appears to be a late addition to the show, as all of her scenes in the premiere are separate from the rest of the group. She’s off on her own the whole episode apartment hunting, which she does by wandering the streets, having old Italian women point out new vacancies to her, and looking up random addresses on Zillow. She’s arriving in the city for a fresh start with her boyfriend Hudson in tow, and it doesn’t take long for money to become an issue. And not just because of expensive rent. We find out that Kim not only took all the money Ariana had earned as a minor, but she still regularly relies on her for cash. Does that make Ariana the new Big Poppa? For the sake of her wigs, Kim better hope this new show is a hit. Despite meeting Ariana first, the real anchor of the series is world-renowned tracksuit designer Brooks Marks, who’s in the throes of a photoshoot with his mother,RHOSLC’s Meredith Marks. He and his iconically monotone voice are at the center of this show’s Venn diagram, bringing together his fellow Bravo offspring with his other city friends — like Charlie Zakkour and Ava Dash, who we meet at the photoshoot. Ava is the model daughter of Damon Dash and Rachel Roy (who infamously posted “good hair don’t care” afterrumors emergedthat she was the “Becky” referenced by Beyoncé onLemonade), while Charlie uses his dad’s money to be a crypto-trader. As if that job title wasn’t dark enough, you might have seen him in thenewsrecently for being present at the Soho townhouse for the arrest made in a cryptocurrency torture and kidnapping scheme. Described by Brooks as Scott Disick in Barry Manilow’s body, Charlie is clearly meant to be the show’s resident douchey fuck boy. Much like his womanizing Bravo predecessor, Jax Taylor, he even alleges a relationship with Lindsay Lohan. But unlike the make-believe stocks he wastes his dad’s money on, he never sells that persona. Sure, he sits in chairs like a tool, but he has the soft face of someone who cries a lot, so he’s not quite as threatening as the show wants him to be. Nonetheless, his asking out Brooks’s sister Chloe is the perfect sprinkling of drama to kick this show off. It’s through Charlie that we also meet the show’s true breakout star — Georgia McCann. She’s a brand/events strategist who always has a glass of red wine in her unwashed hands and who, without explanation, combs her hair with a fork like she’s Ariel inThe Little Mermaid. I’m obsessed with this girl. Unlike the majority of the cast, she says she grew up “between poor and middle class” and is fueled by anxiety. Time and time again, she brings upWhen Harry Met Sally, a reference that painfully goes over the heads of every single person she mentions it to. Fittingly, one of her calling cards is a nightclub party she threw at Katz’s that Diplo DJed, and she was also the person behind Anna Delvey’s “Club House Arrest” party. Could an Anna Delvey cameo be imminent? In the meanwhile, Brooks meets up with Riley Burruss (daughter ofRHOA’s Kandi Burruss and his fellow NYU classmate) to shop for their friend Emira’s fashion show, where he fills her in on his sister’s date with Charlie. As we saw, the date itself was fairly innocuous and kicked off (as I imagine all heterosexual dates do) with him showing her a photo of his skateboarding injury. But the thing bothering Brooks isn’t just the date; it was the text he got from Charlie saying that he should meet up with them afterward unless Chloe is already back at his apartment by then. To quote Brooks’s reply, “EWWW.” Given that this is a reality show, Brooks naturally has to confront Charlie about this. The problem is that Brooks hates confrontation — a trait that makes him an unconventional choice for reality television. That’s like finding out your doctor gets queasy around blood. Nonetheless, I’m fascinated to see him try to adjust to this as the season plays out. It helps that he’s also being guided through it by Riley and Gia Guidice (daughter ofRHONJ’s Teresa Guidice), who have been in this world much longer than Brooks has. Gia is commuting into the city from Jersey to do this show, representing the community of people who incorrectly think living in New Jersey is basically the same as living in the city. But Bravo should keep paying for her E-ZPass, because she wastes no time egging on Brooks to bring up his issue with Charlie at the bar they all convene at after Emira’s fashion show. But before that, something even crazier happens. When Ava arrives and shows off her Manolo Blahniks, our diva Georgia — who I have no choice but to believe Cecily Strong’sGirl You Wish You Hadn’t Started a Conversation With at a Partywas based on — reaches out and caresses the bottom of the shoe, distressing the entire room. But Georgia’s not fazed; she’s too busy immediately touching her eyes with the same hand. Brooks has no choice but to confront Charlie before they all succumb to pink eye. With Gia and Riley acting as his midwives, gently guiding his reality television birth, he points out that the text was completely out of pocket. Charlie tries to deny that he said that, but the texts don’t lie, so after bristling at Gia’s involvement, he offers a non-apology apology that, at best, acknowledges that the text was sent. It’s ultimately a pretty tame, perhaps architected, kernel of drama to give everybody their sea legs and get this ball rolling, but after it’s resolved, we get something truly incredible. Georgia tags along when Riley and Gia go to the bathroom, and the pair of them — already spooked by her touching the bottom of that shoe — are disgusted to learn that Georgia openly doesn’t wash her hands. Not only that, she comes out as being proudly pro-germ. “I was like the kid in New York City eating candy off the sidewalk,” she says, crediting this as to why she never gets sick. The entire gathering is horrified. Riley won’t even let her hug her goodbye with her dirty hands. “What happened to my body, my choice?” Georgia wonders. Let me make this totally clear — I think that’s completely disgusting … but hilarious. Georgia, one of the few cast members on this show without famous and/or reality TV star parents, is the one making the best television right out of the gate. If her unabashed absurdity is any indication of where this show will take us, I’m totally on board. And I think she should be mayor. **VULTURE NEWSLETTER** By submitting your email, you agree to ourTermsandPrivacy Noticeand to receive email correspondence from us. **Tags:** tv tv recaps overnights recaps next gen nyc bravo reality tv premiere More Things you buy through our links may earnVox Mediaa commission. **Most Viewed Stories** Cinematrix No. 442: The June Criterion Edition Why Does SmartLess Mobile Feel So Grim? Mark Duplass Has a Plan to Save Television HowDogmaFinally Escaped Harvey Weinstein In Diego Luna’s Orbit Why Does SmartLess Mobile Feel So Grim? HowDogmaFinally Escaped Harvey Weinstein The ValleyRecap: At Britt’s End Cinematrix No. 442: The June Criterion Edition Mark Duplass Has a Plan to Save Television **Most Popular** Cinematrix No. 442: The June Criterion Edition Why Does SmartLess Mobile Feel So Grim? Mark Duplass Has a Plan to Save Television HowDogmaFinally Escaped Harvey Weinstein In Diego Luna’s Orbit Why Does SmartLess Mobile Feel So Grim? HowDogmaFinally Escaped Harvey Weinstein The ValleyRecap: At Britt’s End Cinematrix No. 442: The June Criterion Edition Mark Duplass Has a Plan to Save Television **Latest News from Vulture** **** **** **** **What is your email?** This email will be used to sign into allNew Yorksites. By submitting your email, you agree to ourTermsandPrivacy Policyand to receive email correspondence from us. **Sign In To Continue Reading** **Create Your Free Account** Password must be at least 8 characters and contain: Lower case letters (a-z) Upper case letters (A-Z) Numbers (0-9) Special Characters (!@#$%^&*) **You’re in!** As part of your account, you’ll receive occasional updates and offers fromNew York, which you can opt out of anytime. **** **What is your email?** This email will be used to sign into allNew Yorksites. By submitting your email, you agree to ourTermsandPrivacy Policyand to receive email correspondence from us. **Sign In To Continue Reading** **Create Your Free Account** Password must be at least 8 characters and contain: Lower case letters (a-z) Upper case letters (A-Z) Numbers (0-9) Special Characters (!@#$%^&*) **You’re in!** As part of your account, you’ll receive occasional updates and offers fromNew York, which you can opt out of anytime. **** **** **** * please try a longer search **** Have an Account? TV Movies Comedy Music Books What To Stream About Vulture About New York Magazine Newsletters Help Contact Press Media Kit We’re Hiring Privacy Terms Ad Choices Accessibility Do not sell or share my personal data"}