{"id": 910, "name": "Militarist Monitor", "domain": "militarist-monitor.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://militarist-monitor.org/trump-faces-swift-backlash-for-killing-soleimani-as-iraqi-parliament-votes-to-expel-u-s-troops/", "title": "Trump Faces Swift Backlash For Killing Soleimani As Iraqi Parliament Votes To Expel U S Troops", "content": "Home ProfilesIndividualsGovernmentFundersOrganizationsMediaBusinessesGroupWatch Archive Individuals Government Funders Organizations Media Businesses GroupWatch Archive Individuals Government Funders Organizations Media Businesses GroupWatch Archive ArticlesFrom the WiresRight Web Features Archive From the Wires Right Web Features Archive From the Wires Right Web Features Archive About MMAbout The Militarist MonitorPrivacy Policy About The Militarist Monitor Privacy Policy About The Militarist Monitor Privacy Policy Home ProfilesIndividualsGovernmentFundersOrganizationsMediaBusinessesGroupWatch Archive Individuals Government Funders Organizations Media Businesses GroupWatch Archive Individuals Government Funders Organizations Media Businesses GroupWatch Archive ArticlesFrom the WiresRight Web Features Archive From the Wires Right Web Features Archive From the Wires Right Web Features Archive About MMAbout The Militarist MonitorPrivacy Policy About The Militarist Monitor Privacy Policy About The Militarist Monitor Privacy Policy **Featured Content** **Zalmay Khalilzad** Zalmay Khalilzad, the Trump administration's special representative to the Afghan peace process, brokered a so-called peace deal with... **Zalmay Khalilzad** Zalmay Khalilzad, the Trump administration's special representative to the Afghan peace process, brokered a so-called peace deal with... **Richard Grenell** Richard Grenell, a Republican operative known for his polarizing views and controversial work for foreign governments, is an outspoken Trump... **Richard Grenell** Richard Grenell, a Republican operative known for his polarizing views and controversial work for foreign governments, is an outspoken Trump... **William Barr** Donald Trump's second attorney general, William Barr has been an extreme Trump loyalist, going to extraordinary lengths to shield... **William Barr** Donald Trump's second attorney general, William Barr has been an extreme Trump loyalist, going to extraordinary lengths to shield... **From the Wires** **What ails Libya’s peace process?** **What ails Libya’s peace process?** **The Paradox of America’s Endless Wars** **The Paradox of America’s Endless Wars** **Neocons in the Age of Trump? The Case of the FDD and Iran’s “Fake Opposition”** **Neocons in the Age of Trump? The Case of the FDD and Iran’s “Fake Opposition”** **The American Chaos Machine: U.S. Foreign Policy Goes Off the Rails** **The American Chaos Machine: U.S. Foreign Policy Goes Off the Rails** **Trump Faces Swift Backlash for Killing Soleimani as Iraqi Parliament Votes to Expel U.S. Troops** By Trita ParsiJanuary 6, 2020 **Share:** Click to share on Twitter (Opens in new window) Click to share on Facebook (Opens in new window) Click to share on LinkedIn (Opens in new window) Click to share on Reddit (Opens in new window) Click to share on WhatsApp (Opens in new window) Click to print (Opens in new window) (Responsible Statecraft) Below are the five most important developments following the assassination of Qassem Soleimani. Iraqi prime minister says Soleimani was in Iraq for mediation effort Iraqi Prime Minister Adil Abdul-Mahdi has made some shocking revelations that put the assassination of Soleimani in a completely different light. Hetold the Iraqi parliamenton Sunday that he “was supposed to meet Soleimani on the morning of the day he was killed, he came to deliver me a message from Iran responding to the message we delivered from Saudi to Iran.” If this account is true, Trump — perhaps deliberately — acted to scuttle an effort to reduce tensions between Iran and Saudi Arabia. But it also shows that as the United States was signaling that it would not go to war with Iran — as Trump did earlier this summer — this compelled Saudi Arabia and the UAE to begin quiet negotiations with Iran to resolve their tension. As long as the Saudis and the Emiratis felt they could push the U.S. to go to war with Iran, they had no interest in diplomacy with Iran. The U.S.’s military protection of these countries essentially disincentivized them from pursuing peace. In the past few months, under the impression that Trump had opted against war, they began careful diplomacy with Tehran. The U.S. should have welcomed this development. But the killing of Soleimani may have at the same time killed that effort and once again given Saudi Crown Prince Mohammed bin Salman and the Emiratis a license to continue recklessness and destabilization. Soleimani’s death has unified Iran Rather than being a blow to Iran, the assassination of Soleimani has fueled nationalist sentiments in Iran and unified the political elite as well as the country. The crowds of mourners in the cities where his casket has been taken were in thehundreds of thousands, if not millions. Only a few months ago, there were widespread protests against the Iranian government, which were met with brutal force and repression. Now, Iranians are protesting alongside the government, not against it. Iraqi Parliament voted to expel U.S. forces The Iraqi parliament on Sundayvotedto expel all U.S. military forces from Iraq, as a direct consequence of the Soleimani assassination. Iraqis have tried to walk a fine balance between the U.S. and Iran, but the assassination made that balance untenable. Iraqis don’t want their country to become the arena for a U.S.-Iran war, and the U.S. military presence made that risk all too likely. While many will point out that this is a victory for Soleimani and Iran, it is also important to note that this is also what theAmerican publicwants. In fact, this is what Trumppromised them he’d do. The U.S. military presence in Iraq does not add to U.S. national security. Instead, it increases the threat of what would be a disastrous U.S.-Iran war. The U.S. does not need to have 5,000 troops in Iraq to assist in the fight against ISIS. Trump should welcome the vote and bring American military servicemen and women home to be with their families. Pompeo’s absurd claim that war with Iranstartedwith the nuclear deal “This war kicked off when the JCPOA was entered into,” Secretary of State Mike PompeotoldCNN’s Jake Tapper on Sunday, referring to the Joint Comprehensive Plan of Action. This is an astonishing statement. In Pompeo’s view, the U.S. and the entire international community (save Israel, Saudi Arabia, and the UAE) entering an agreement to block Iran’s path to a nuclear bomb was tantamount to starting a war. What threatens Pompeo is not war. It’s peace. He is doing everything he can to ensure that tensions with Iran don’t get resolved. For him, the “war” to start a war with Iran started when the U.S. embarked on a path ofresolvingits tensions with Iran. Iran announces further reductions in its commitments to the JCPOA Iran has announced the fifth reduction of its commitments to the JCPOA. This is not tantamount to Iran quitting the JCPOA, as it has left the door open to recommit itself to all of the restrictions of the nuclear agreement if the U.S. lifts sanctions on Iran. (Those sanctions, it should be mentioned, are a violation of the JCPOA as well as the United Nations Security Council Resolution that embodies the JCPOA). Nevertheless, this is a step that will further increase tensions. **Share:** Click to share on Twitter (Opens in new window) Click to share on Facebook (Opens in new window) Click to share on LinkedIn (Opens in new window) Click to share on Reddit (Opens in new window) Click to share on WhatsApp (Opens in new window) Click to print (Opens in new window) **Tracking militarists’ efforts to influence U.S. foreign policy.** Don't miss a thing, subscribe to stay updated... **Tracking militarists’ efforts to influence U.S. foreign policy.** Don't miss a thing, subscribe to stay updated... Δ We will NEVER share your details Individuals Government Funders Organizations Media Businesses GroupWatch Archive From the Wires Right Web News Archive About The Militarist Monitor Privacy Policy Except where otherwise noted, content on this site is licensed under aCreative Commons Attribution 3.0 License Right Web Newsis a bimonthly newsletter that highlights recent and timely feature stories, profiles, and news articles added to the Right Web website.Right Web Newsis published on the first and third Wednesdays of every month. At RightWeb your privacy is of our utmost concern. The data you share with us will be used only so that we may keep you informed of recently posted web resources. We will not sell or share this information with others.Read our privacy policy here. You can easily cancel any of your subscriptions at any time by following the instructions that are on the bottom of every message. **Share:** Click to share on Twitter (Opens in new window) Click to share on Facebook (Opens in new window) Click to share on LinkedIn (Opens in new window) Click to share on Reddit (Opens in new window) Click to share on WhatsApp (Opens in new window) Click to print (Opens in new window)"}