{"id": 231, "name": "The Chronicle of Higher Education", "domain": "chronicle.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.chronicle.com/article/what-is-the-share-of-minority-instructors-at-colleges-with-the-most-full-time-faculty-members", "title": "What Is The Share Of Minority Instructors At Colleges With The Most Full Time Faculty Members", "content": "SectionsNewsAdviceThe Review News Advice The Review News Advice The Review TopicsDataDiversity, Equity, & InclusionFinance & OperationsInternationalLeadership & GovernanceTeaching & LearningScholarship & ResearchStudent SuccessTechnologyTransitionsThe Workplace Data Diversity, Equity, & Inclusion Finance & Operations International Leadership & Governance Teaching & Learning Scholarship & Research Student Success Technology Transitions The Workplace Data Diversity, Equity, & Inclusion Finance & Operations International Leadership & Governance Teaching & Learning Scholarship & Research Student Success Technology Transitions The Workplace MagazineCurrent IssueSpecial IssuesPodcast: College Matters from The Chronicle Current Issue Special Issues Podcast: College Matters from The Chronicle Current Issue Special Issues Podcast: College Matters from The Chronicle Newsletters Virtual Events Ask Chron StoreFeatured ProductsReportsDataCollectionsBack Issues Featured Products Reports Data Collections Back Issues Featured Products Reports Data Collections Back Issues JobsFind a JobPost a JobProfessional DevelopmentCareer ResourcesVirtual Career Fair Find a Job Post a Job Professional Development Career Resources Virtual Career Fair Find a Job Post a Job Professional Development Career Resources Virtual Career Fair More SectionsNewsAdviceThe Review News Advice The Review News Advice The Review TopicsDataDiversity, Equity, & InclusionFinance & OperationsInternationalLeadership & GovernanceTeaching & LearningScholarship & ResearchStudent SuccessTechnologyTransitionsThe Workplace Data Diversity, Equity, & Inclusion Finance & Operations International Leadership & Governance Teaching & Learning Scholarship & Research Student Success Technology Transitions The Workplace Data Diversity, Equity, & Inclusion Finance & Operations International Leadership & Governance Teaching & Learning Scholarship & Research Student Success Technology Transitions The Workplace MagazineCurrent IssueSpecial IssuesPodcast: College Matters from The Chronicle Current Issue Special Issues Podcast: College Matters from The Chronicle Current Issue Special Issues Podcast: College Matters from The Chronicle Newsletters Virtual Events Ask Chron StoreFeatured ProductsReportsDataCollectionsBack Issues Featured Products Reports Data Collections Back Issues Featured Products Reports Data Collections Back Issues JobsFind a JobPost a JobProfessional DevelopmentCareer ResourcesVirtual Career Fair Find a Job Post a Job Professional Development Career Resources Virtual Career Fair Find a Job Post a Job Professional Development Career Resources Virtual Career Fair **How Diverse are the Faculty at the Largest Colleges?** **Explore the share of minority instructors — and how it’s changed over the years.** Here’s a look at changes in average annual percentages of full-time faculty members who were members of specific racial and ethnic groups in 2019, 2020, 2021, 2022, and 2023. The percentages of minority faculty members at the colleges in each degree-granting group (associate, bachelor’s, master’s, doctoral, and special focus) are ordered by the largest number of total full-time faculty members for the most recent year, which is noted in parentheses. The total of minority faculty members includes those who are American Indian/Alaska Native, Asian, Black, Hispanic, Native Hawaiian/Pacific Islander, and two or more races. Source:Chronicleanalysis of data from the U.S. Department of Education’s Integrated Postsecondary Education Data System About these data Data are for degree-granting institutions in the United States that are eligible to participate in Title IV federal financial-aid programs. This visualization’s companion table, on the race, ethnicity, and gender of full-time faculty members at more than 3,300 colleges and universities, can be foundhere. Inclusion is based on full-time faculty size for the fall of the most recent year. “Total minority” is the percentage of all faculty members who are nonwhite and whose race is known. It includes those who are two or more races; it does not include “nonresident aliens.” Note that persons of Middle Eastern or North African descent are considered white in federal data. The full titles of the racial and ethnic categories are: white non-Hispanic; Black or African American non-Hispanic; Hispanic or Latino; Asian non-Hispanic; American Indian or Alaska Native; Native Hawaiian/Other Pacific Islander; two or more races; and race/ethnicity unknown. Those eight categories include both U.S. citizens and permanent residents. “Nonresident” covers people described by the Education Department as “nonresident aliens”: those of all racial and ethnic groups who are in the United States on a visa or temporary basis and do not have the right to remain indefinitely. A person may be counted in only one of those groups. Type categories are from the 2021 Carnegie Classification of Institutions of Higher Education. “Special-focus” includes both two-year and four-year special-focus institutions. “Associate” also includes those institutions classified as “baccalaureate/associate.” Twitter LinkedIn Facebook Email **More News** **From The Review** **Upcoming Events** Explore ContentLatest NewsNewslettersLettersFree Reports and GuidesProfessional DevelopmentVirtual EventsChronicle StoreChronicle IntelligenceJobs in Higher EducationPost a Job Latest News Newsletters Letters Free Reports and Guides Professional Development Virtual Events Chronicle Store Chronicle Intelligence Jobs in Higher Education Post a Job Latest News Newsletters Letters Free Reports and Guides Professional Development Virtual Events Chronicle Store Chronicle Intelligence Jobs in Higher Education Post a Job Know The ChronicleAbout UsVision, Mission, ValuesDEI at The ChronicleWrite for UsWork at The ChronicleOur Reporting ProcessAdvertise With UsBrand StudioAccessibility Statement About Us Vision, Mission, Values DEI at The Chronicle Write for Us Work at The Chronicle Our Reporting Process Advertise With Us Brand Studio Accessibility Statement About Us Vision, Mission, Values DEI at The Chronicle Write for Us Work at The Chronicle Our Reporting Process Advertise With Us Brand Studio Accessibility Statement Account and AccessManage Your AccountManage NewslettersIndividual SubscriptionsGroup and Institutional AccessSubscription & Account FAQ Manage Your Account Manage Newsletters Individual Subscriptions Group and Institutional Access Subscription & Account FAQ Manage Your Account Manage Newsletters Individual Subscriptions Group and Institutional Access Subscription & Account FAQ Get SupportContact UsReprints & PermissionsUser AgreementTerms and ConditionsPrivacy PolicyCalifornia Privacy PolicyDo Not Sell My Personal Information Contact Us Reprints & Permissions User Agreement Terms and Conditions Privacy Policy California Privacy Policy Do Not Sell My Personal Information Contact Us Reprints & Permissions User Agreement Terms and Conditions Privacy Policy California Privacy Policy Do Not Sell My Personal Information twitter instagram youtube facebook linkedin"}