{"id": 2224, "name": "Stubhill News", "domain": "stubhillnews.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://stubhillnews.com/2022/04/27/netflix-russian-doll/", "title": "Netflix Russian Doll", "content": "**Stubhill News** **News you can read** **Stubhill News** **News you can read** **Menu** About Stubhill News Follow Ethics FAQ Contact The Daily Foil **Netflix halves production costs by eliminating Russian Doll cigarette budget** Netflix is seeking to stop its plunging stock value by reducing the cost of show production. Cigarettes for the show Russian Doll, which account for 50 percent of Netflix’s overall production budget, were the first and most significant item to hit the chopping block, according to sources. Other cost-reducing measures include switching alcohol from wine to PBR tallboys in future installments ofThe Ultimatum, a dating show set in the Jason Bourne universe. Additionally, the crew for Stranger Things will now be required to rely on practical effects rather than real telekinesis. Stubhill News will have more as this story develops. Follow Stubhill News onTwitterandFacebookfor all the latest news whenever we feel like it **Share this indispensable journalism:** Click to share on Reddit (Opens in new window)Reddit Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Tumblr (Opens in new window)Tumblr Click to share on Pinterest (Opens in new window)Pinterest Click to share on Pocket (Opens in new window)Pocket Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print **Related posts** **Netflix to release new season of the Cosby Show** **REVIEW: Netflix reboot takes Bourne franchise in a bold new direction** **Netflix reveals REAL reason Olsen twins absent from Full House reunion** **Post navigation** **Leave a commentCancel reply** Δ **Archives** February 2025 October 2024 September 2024 August 2024 April 2022 March 2022 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 January 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 January 2019 December 2018 October 2018 September 2018 August 2018 July 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 October 2017 September 2017 August 2017 July 2017 June 2017 May 2017 April 2017 March 2017 February 2017 January 2017 December 2016 November 2016 October 2016 September 2016 August 2016 July 2016 June 2016 May 2016 April 2016 March 2016 February 2016 January 2016 December 2015 November 2015 October 2015 September 2015 August 2015 July 2015 June 2015 February 2015 January 2015 November 2014 October 2014 September 2014 July 2014 June 2014 May 2014 March 2014 February 2014 January 2014 December 2013 November 2013 October 2013 September 2013 August 2013 **** 5,712,866 readers informed Comment Reblog SubscribeSubscribedStubhill NewsJoin 95 other subscribersSign me upAlready have a WordPress.com account?Log in now. Stubhill News Already have a WordPress.com account?Log in now. Stubhill News Already have a WordPress.com account?Log in now. Stubhill NewsSubscribeSubscribedSign upLog inCopy shortlinkReport this contentView post in ReaderManage subscriptionsCollapse this bar Stubhill News SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Stubhill News SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar **** **** ****"}