{"id": 85, "name": "Associated Press", "domain": "apnews.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://apnews.com/video/bts-members-jimin-and-jung-kook-are-discharged-from-south-koreas-military-after-completing-service-20f29486b1714a839c03b58d20dde824", "title": null, "content": "WorldSECTIONSIsrael-Hamas warRussia-Ukraine WarEspañolChinaAsia PacificLatin AmericaEuropeAfricaTOP STORIESMore than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials sayNetanyahu's government faces possible collapse as the opposition seeks to dissolve parliamentMandatory military service for Israel's ultra-Orthodox tests Netanyahu's ruleNewslettersThe Morning WireOur flagship newsletter breaks down the biggest headlines of the day.The Afternoon WireGet caught up on what you may have missed throughout the day.See All Newsletters More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Netanyahu's government faces possible collapse as the opposition seeks to dissolve parliament Mandatory military service for Israel's ultra-Orthodox tests Netanyahu's rule More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Netanyahu's government faces possible collapse as the opposition seeks to dissolve parliament Mandatory military service for Israel's ultra-Orthodox tests Netanyahu's rule U.S.SECTIONSImmigrationWeatherEducationTransportationAbortionLGBTQ+Notable DeathsTOP STORIESPolice detain more than 20 people on first night of curfew aimed at protests in downtown Los AngelesWhat to know about the protests over Trump's immigration crackdown in LA and other citiesBrian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82NewslettersThe Morning WireOur flagship newsletter breaks down the biggest headlines of the day.See All NewslettersAP QUIZZESTest Your News I.Q. — take today’s quiz Police detain more than 20 people on first night of curfew aimed at protests in downtown Los Angeles What to know about the protests over Trump's immigration crackdown in LA and other cities Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82 Police detain more than 20 people on first night of curfew aimed at protests in downtown Los Angeles What to know about the protests over Trump's immigration crackdown in LA and other cities Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82 PoliticsSECTIONSWhite HouseCongressU.S. Supreme Court2025 Election CalendarTOP STORIESNational Guard troops have temporarily detained civilians in LA protests, commander saysUS reduces the presence of staffers not deemed essential in the Middle East as tensions riseTrump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55%NewslettersGround GameExclusive insights and key stories from the world of politics.See All Newsletters National Guard troops have temporarily detained civilians in LA protests, commander says US reduces the presence of staffers not deemed essential in the Middle East as tensions rise Trump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55% National Guard troops have temporarily detained civilians in LA protests, commander says US reduces the presence of staffers not deemed essential in the Middle East as tensions rise Trump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55% SportsSECTIONSNBAMLBNHLTennisWNBANFLAuto RacingSoccerTOP STORIESUS Open gets a peaceful day of practice ahead of tough test that awaits at Oakmont25 years after Tiger's romp, a huge fan, Chase Johnson, is US Open's only player of Black heritageFemale athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination lawNewslettersAP Top 25 Poll AlertsGet email alerts for every college football Top 25 Poll release.The Sports WireYour home base for in-depth reporting from the world of sports.See All Newsletters US Open gets a peaceful day of practice ahead of tough test that awaits at Oakmont 25 years after Tiger's romp, a huge fan, Chase Johnson, is US Open's only player of Black heritage Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law US Open gets a peaceful day of practice ahead of tough test that awaits at Oakmont 25 years after Tiger's romp, a huge fan, Chase Johnson, is US Open's only player of Black heritage Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law EntertainmentSECTIONSMovie ReviewsWhat to StreamTelevisionBook ReviewsMusicCelebrity InterviewsTOP STORIESBrian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82How the ‘F1’ soundtrack came together, with a little help from Lewis Hamilton10 songs to celebrate the life and legacy of the Beach Boys' Brian WilsonNewslettersAP Entertainment WireGet AP's first personalized newsletter delivering you entertainment news twice a week.See All Newsletters Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82 How the ‘F1’ soundtrack came together, with a little help from Lewis Hamilton 10 songs to celebrate the life and legacy of the Beach Boys' Brian Wilson Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82 How the ‘F1’ soundtrack came together, with a little help from Lewis Hamilton 10 songs to celebrate the life and legacy of the Beach Boys' Brian Wilson BusinessSECTIONSTariffsInflationFinancial MarketsFinancial WellnessTechnologyTOP STORIESInflation barely rose last month as cheaper gas and cars offset some costlier importsTrump hails favorable federal appeals court ruling on his sweeping tariff policy as a 'great' winMusk backs off from Trump feud, saying he regrets some posts that 'went too far' Inflation barely rose last month as cheaper gas and cars offset some costlier imports Trump hails favorable federal appeals court ruling on his sweeping tariff policy as a 'great' win Musk backs off from Trump feud, saying he regrets some posts that 'went too far' Inflation barely rose last month as cheaper gas and cars offset some costlier imports Trump hails favorable federal appeals court ruling on his sweeping tariff policy as a 'great' win Musk backs off from Trump feud, saying he regrets some posts that 'went too far' ScienceSECTIONSSpaceAnimalsThe Ancient WorldClimateMedicineTOP STORIESEmperor penguins show dramatic decline in one region of Antarctica, satellite photos showPrivate lunar lander from Japan crashes into moon in failed missionWhat is Fusarium graminearum, the fungus US authorities say was smuggled in from China? Emperor penguins show dramatic decline in one region of Antarctica, satellite photos show Private lunar lander from Japan crashes into moon in failed mission What is Fusarium graminearum, the fungus US authorities say was smuggled in from China? Emperor penguins show dramatic decline in one region of Antarctica, satellite photos show Private lunar lander from Japan crashes into moon in failed mission What is Fusarium graminearum, the fungus US authorities say was smuggled in from China? Fact CheckTOP STORIESFACT FOCUS: A Craigslist ad is not proof of paid protesters in LA. It was posted as a prankUnsubstantiated 'chemtrail' conspiracy theories lead to legislation proposed in US statehousesFACT FOCUS: Trump’s claims about remedial math at Harvard don’t add up FACT FOCUS: A Craigslist ad is not proof of paid protesters in LA. It was posted as a prank Unsubstantiated 'chemtrail' conspiracy theories lead to legislation proposed in US statehouses FACT FOCUS: Trump’s claims about remedial math at Harvard don’t add up FACT FOCUS: A Craigslist ad is not proof of paid protesters in LA. It was posted as a prank Unsubstantiated 'chemtrail' conspiracy theories lead to legislation proposed in US statehouses FACT FOCUS: Trump’s claims about remedial math at Harvard don’t add up OdditiesTOP STORIESThe world's oldest restaurant faces a challenge from another Madrid tavern that says it's even olderLeaders of ‘orgasmic meditation’ women's wellness company OneTaste convicted in forced labor trialA runaway pet zebra has been captured in TennesseeA quirky vegetable sculpture contest features a squash Donald Trump and a papal 'Cornclave'Why a Minneapolis neighborhood sharpens a giant pencil every yearFlying boats make for a rare sight as Washington clears an island of derelict vessels by helicopter The world's oldest restaurant faces a challenge from another Madrid tavern that says it's even older Leaders of ‘orgasmic meditation’ women's wellness company OneTaste convicted in forced labor trial A runaway pet zebra has been captured in Tennessee A quirky vegetable sculpture contest features a squash Donald Trump and a papal 'Cornclave' Why a Minneapolis neighborhood sharpens a giant pencil every year Flying boats make for a rare sight as Washington clears an island of derelict vessels by helicopter The world's oldest restaurant faces a challenge from another Madrid tavern that says it's even older Leaders of ‘orgasmic meditation’ women's wellness company OneTaste convicted in forced labor trial A runaway pet zebra has been captured in Tennessee A quirky vegetable sculpture contest features a squash Donald Trump and a papal 'Cornclave' Why a Minneapolis neighborhood sharpens a giant pencil every year Flying boats make for a rare sight as Washington clears an island of derelict vessels by helicopter Be WellTOP STORIESYou should wear sunscreen even if you have darker skin. Here's whyFrom frustration to joy: What I learned about getting a hearing aidMore at-home health tests are now available. How to know what's right for youOne Life Hack: How to treat allergies in dogs and catsHow to stay safe when the air quality is badOne Life Hack: How to budget for vacation You should wear sunscreen even if you have darker skin. Here's why From frustration to joy: What I learned about getting a hearing aid More at-home health tests are now available. How to know what's right for you One Life Hack: How to treat allergies in dogs and cats How to stay safe when the air quality is bad One Life Hack: How to budget for vacation You should wear sunscreen even if you have darker skin. Here's why From frustration to joy: What I learned about getting a hearing aid More at-home health tests are now available. How to know what's right for you One Life Hack: How to treat allergies in dogs and cats How to stay safe when the air quality is bad One Life Hack: How to budget for vacation NewslettersNewslettersAP News AlertsKeep your pulse on the news with breaking news alerts from The AP.The Morning WireOur flagship newsletter breaks down the biggest headlines of the day.Ground GameExclusive insights and key stories from the world of politics.Beyond the StoryExecutive Editor Julie Pace brings you behind the scenes of the AP newsroom.The Afternoon WireGet caught up on what you may have missed throughout the day.AP Entertainment WireGet AP's first personalized newsletter delivering you entertainment news twice a week.See All Newsletters PhotographySECTIONS2024 YEAR END PHOTOSPhoto EssaysPhotographyTOP STORIESBrian Wilson's life in photosAP PHOTOS: Protests over immigration raids spread beyond Los AngelesThe top photos of the day by AP's photojournalistsNewslettersThe World in PicturesGet The AP’s most compelling photographs sent directly to your inbox.See All Newsletters Brian Wilson's life in photos AP PHOTOS: Protests over immigration raids spread beyond Los Angeles The top photos of the day by AP's photojournalists Brian Wilson's life in photos AP PHOTOS: Protests over immigration raids spread beyond Los Angeles The top photos of the day by AP's photojournalists AP Investigations ClimateSECTIONSIndigenous peoples and climateClimate QuestionsClimate MigrationIndia FocusTOP STORIESEPA moves to repeal rules that limit greenhouse gas emissions from US power plantsPeanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meatAhead of UN climate talks, Brazil fast-tracks oil and highway projects that threaten the Amazon EPA moves to repeal rules that limit greenhouse gas emissions from US power plants Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat Ahead of UN climate talks, Brazil fast-tracks oil and highway projects that threaten the Amazon EPA moves to repeal rules that limit greenhouse gas emissions from US power plants Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat Ahead of UN climate talks, Brazil fast-tracks oil and highway projects that threaten the Amazon HealthTOP STORIESHundreds of laid-off CDC employees are being reinstatedTakeaways from AP's report on financial interests of RFK Jr. adviser who runs wellness platformTop RFK Jr. aide attacks US health system while running company that promotes wellness alternativesMore at-home health tests are now available. How to know what's right for youDogs and cats can also suffer from allergies, but there are ways to help our furry friendsYou should wear sunscreen even if you have darker skin. Here's why Hundreds of laid-off CDC employees are being reinstated Takeaways from AP's report on financial interests of RFK Jr. adviser who runs wellness platform Top RFK Jr. aide attacks US health system while running company that promotes wellness alternatives More at-home health tests are now available. How to know what's right for you Dogs and cats can also suffer from allergies, but there are ways to help our furry friends You should wear sunscreen even if you have darker skin. Here's why Hundreds of laid-off CDC employees are being reinstated Takeaways from AP's report on financial interests of RFK Jr. adviser who runs wellness platform Top RFK Jr. aide attacks US health system while running company that promotes wellness alternatives More at-home health tests are now available. How to know what's right for you Dogs and cats can also suffer from allergies, but there are ways to help our furry friends You should wear sunscreen even if you have darker skin. Here's why TechSECTIONSArtificial IntelligenceSocial MediaTOP STORIESDisney and Universal sue AI firm Midjourney for copyright infringementGoogle offers buyouts to more workers amid AI-driven tech upheaval and antitrust uncertaintyMusk says Tesla's robotaxi service to 'tentatively' launch in Austin on June 22 Disney and Universal sue AI firm Midjourney for copyright infringement Google offers buyouts to more workers amid AI-driven tech upheaval and antitrust uncertainty Musk says Tesla's robotaxi service to 'tentatively' launch in Austin on June 22 Disney and Universal sue AI firm Midjourney for copyright infringement Google offers buyouts to more workers amid AI-driven tech upheaval and antitrust uncertainty Musk says Tesla's robotaxi service to 'tentatively' launch in Austin on June 22 LifestyleSECTIONSFood & RecipesGardeningHomesTravelFashionPetsTOP STORIESPeanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meatShould you let pets sleep next to you? (Does it even matter what the experts say?)He loved ribs more than anyone. This Cajun-flavored recipe is for him on Father's Day Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat Should you let pets sleep next to you? (Does it even matter what the experts say?) He loved ribs more than anyone. This Cajun-flavored recipe is for him on Father's Day Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat Should you let pets sleep next to you? (Does it even matter what the experts say?) He loved ribs more than anyone. This Cajun-flavored recipe is for him on Father's Day ReligionTOP STORIESMandatory military service for Israel's ultra-Orthodox tests Netanyahu's ruleMore than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials sayPope Leo XIV names first Chinese bishop, signalling he is continuing Vatican's controversial accordNewslettersWorld of FaithComprehensive global coverage of how religion shapes our world.See All Newsletters Mandatory military service for Israel's ultra-Orthodox tests Netanyahu's rule More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Pope Leo XIV names first Chinese bishop, signalling he is continuing Vatican's controversial accord Mandatory military service for Israel's ultra-Orthodox tests Netanyahu's rule More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Pope Leo XIV names first Chinese bishop, signalling he is continuing Vatican's controversial accord EspañolTOP STORIESArrestan a más de 20 personas tras primera noche de toque de queda por protestas en Los ÁngelesAgentes de inmigración de EEUU intensifican arrestos en juzgados para acelerar deportacionesProtestas por redadas migratorias surgen en todo EEUU; hay más planeadasSoldados de la Guardia Nacional detienen temporalmente a civiles en protestas de LA, dice comandanteHegseth defiende uso de tropas para proteger redadas de inmigración en Los Ángeles Arrestan a más de 20 personas tras primera noche de toque de queda por protestas en Los Ángeles Agentes de inmigración de EEUU intensifican arrestos en juzgados para acelerar deportaciones Protestas por redadas migratorias surgen en todo EEUU; hay más planeadas Soldados de la Guardia Nacional detienen temporalmente a civiles en protestas de LA, dice comandante Hegseth defiende uso de tropas para proteger redadas de inmigración en Los Ángeles Arrestan a más de 20 personas tras primera noche de toque de queda por protestas en Los Ángeles Agentes de inmigración de EEUU intensifican arrestos en juzgados para acelerar deportaciones Protestas por redadas migratorias surgen en todo EEUU; hay más planeadas Soldados de la Guardia Nacional detienen temporalmente a civiles en protestas de LA, dice comandante Hegseth defiende uso de tropas para proteger redadas de inmigración en Los Ángeles Standards Quizzes Press Releases My Account MOREWorldIsrael-Hamas warRussia-Ukraine WarEspañolChinaAsia PacificLatin AmericaEuropeAfricaAustraliaMiddle EastGlobal ElectionsU.S.ImmigrationWeatherEducationTransportationAbortionLGBTQ+Notable DeathsPoliticsWhite HouseCongressU.S. Supreme Court2025 Election CalendarSportsNBAMLBNHLTennisTennisWNBANFLAuto RacingSoccerEntertainmentMovie ReviewsWhat to StreamTelevisionBook ReviewsMusicCelebrity InterviewsBusinessTariffsInflationFinancial MarketsFinancial WellnessTechnologyScienceSpaceAnimalsThe Ancient WorldClimateMedicineFact CheckOdditiesBe WellNewslettersPhotography2024 YEAR END PHOTOSPhoto EssaysPhotographyAP InvestigationsClimateIndigenous peoples and climateClimate QuestionsClimate MigrationIndia FocusHealthTechArtificial IntelligenceSocial MediaLifestyleFood & RecipesGardeningHomesTravelFashionPetsReligionEspañolStandardsQuizzesPress ReleasesMy Account WorldIsrael-Hamas warRussia-Ukraine WarEspañolChinaAsia PacificLatin AmericaEuropeAfricaAustraliaMiddle EastGlobal Elections Israel-Hamas war Russia-Ukraine War Español China Asia Pacific Latin America Europe Africa Australia Middle East Global Elections U.S.ImmigrationWeatherEducationTransportationAbortionLGBTQ+Notable Deaths Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths PoliticsWhite HouseCongressU.S. Supreme Court2025 Election Calendar White House Congress U.S. Supreme Court 2025 Election Calendar SportsNBAMLBNHLTennisTennisWNBANFLAuto RacingSoccer NBA MLB NHL TennisTennis WNBA NFL Auto Racing Soccer EntertainmentMovie ReviewsWhat to StreamTelevisionBook ReviewsMusicCelebrity Interviews Movie Reviews What to Stream Television Book Reviews Music Celebrity Interviews BusinessTariffsInflationFinancial MarketsFinancial WellnessTechnology Tariffs Inflation Financial Markets Financial Wellness Technology ScienceSpaceAnimalsThe Ancient WorldClimateMedicine Space Animals The Ancient World Climate Medicine Fact Check Oddities Be Well Newsletters Photography2024 YEAR END PHOTOSPhoto EssaysPhotography 2024 YEAR END PHOTOS Photo Essays Photography AP Investigations ClimateIndigenous peoples and climateClimate QuestionsClimate MigrationIndia Focus Indigenous peoples and climate Climate Questions Climate Migration India Focus Health TechArtificial IntelligenceSocial Media Artificial Intelligence Social Media LifestyleFood & RecipesGardeningHomesTravelFashionPets Food & Recipes Gardening Homes Travel Fashion Pets Religion Español Standards Quizzes Press Releases My Account WorldIsrael-Hamas warRussia-Ukraine WarEspañolChinaAsia PacificLatin AmericaEuropeAfricaAustraliaMiddle EastGlobal Elections Israel-Hamas war Russia-Ukraine War Español China Asia Pacific Latin America Europe Africa Australia Middle East Global Elections Israel-Hamas war Russia-Ukraine War Español China Asia Pacific Latin America Europe Africa Australia Middle East Global Elections U.S.ImmigrationWeatherEducationTransportationAbortionLGBTQ+Notable Deaths Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths PoliticsWhite HouseCongressU.S. Supreme Court2025 Election Calendar White House Congress U.S. Supreme Court 2025 Election Calendar White House Congress U.S. Supreme Court 2025 Election Calendar SportsNBAMLBNHLTennisTennisWNBANFLAuto RacingSoccer NBA MLB NHL TennisTennis WNBA NFL Auto Racing Soccer NBA MLB NHL TennisTennis WNBA NFL Auto Racing Soccer EntertainmentMovie ReviewsWhat to StreamTelevisionBook ReviewsMusicCelebrity Interviews Movie Reviews What to Stream Television Book Reviews Music Celebrity Interviews Movie Reviews What to Stream Television Book Reviews Music Celebrity Interviews BusinessTariffsInflationFinancial MarketsFinancial WellnessTechnology Tariffs Inflation Financial Markets Financial Wellness Technology Tariffs Inflation Financial Markets Financial Wellness Technology ScienceSpaceAnimalsThe Ancient WorldClimateMedicine Space Animals The Ancient World Climate Medicine Space Animals The Ancient World Climate Medicine Fact Check Oddities Be Well Newsletters Photography2024 YEAR END PHOTOSPhoto EssaysPhotography 2024 YEAR END PHOTOS Photo Essays Photography 2024 YEAR END PHOTOS Photo Essays Photography AP Investigations ClimateIndigenous peoples and climateClimate QuestionsClimate MigrationIndia Focus Indigenous peoples and climate Climate Questions Climate Migration India Focus Indigenous peoples and climate Climate Questions Climate Migration India Focus Health TechArtificial IntelligenceSocial Media Artificial Intelligence Social Media Artificial Intelligence Social Media LifestyleFood & RecipesGardeningHomesTravelFashionPets Food & Recipes Gardening Homes Travel Fashion Pets Food & Recipes Gardening Homes Travel Fashion Pets Religion Español Standards Quizzes Press Releases My Account WorldIsrael-Hamas warRussia-Ukraine WarEspañolChinaAsia PacificLatin AmericaEuropeAfricaAustraliaMiddle EastGlobal ElectionsSECTIONSIsrael-Hamas warRussia-Ukraine WarEspañolChinaAsia PacificLatin AmericaEuropeAfricaTOP STORIESMore than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials sayNetanyahu's government faces possible collapse as the opposition seeks to dissolve parliamentMandatory military service for Israel's ultra-Orthodox tests Netanyahu's ruleNewslettersThe Morning WireOur flagship newsletter breaks down the biggest headlines of the day.The Afternoon WireGet caught up on what you may have missed throughout the day.See All Newsletters Israel-Hamas war Russia-Ukraine War Español China Asia Pacific Latin America Europe Africa Australia Middle East Global Elections More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Netanyahu's government faces possible collapse as the opposition seeks to dissolve parliament Mandatory military service for Israel's ultra-Orthodox tests Netanyahu's rule Israel-Hamas war Russia-Ukraine War Español China Asia Pacific Latin America Europe Africa Australia Middle East Global Elections More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Netanyahu's government faces possible collapse as the opposition seeks to dissolve parliament Mandatory military service for Israel's ultra-Orthodox tests Netanyahu's rule U.S.ImmigrationWeatherEducationTransportationAbortionLGBTQ+Notable DeathsSECTIONSImmigrationWeatherEducationTransportationAbortionLGBTQ+Notable DeathsTOP STORIESPolice detain more than 20 people on first night of curfew aimed at protests in downtown Los AngelesWhat to know about the protests over Trump's immigration crackdown in LA and other citiesBrian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82NewslettersThe Morning WireOur flagship newsletter breaks down the biggest headlines of the day.See All NewslettersAP QUIZZESTest Your News I.Q. — take today’s quiz Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths Police detain more than 20 people on first night of curfew aimed at protests in downtown Los Angeles What to know about the protests over Trump's immigration crackdown in LA and other cities Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82 Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths Police detain more than 20 people on first night of curfew aimed at protests in downtown Los Angeles What to know about the protests over Trump's immigration crackdown in LA and other cities Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82 PoliticsWhite HouseCongressU.S. Supreme Court2025 Election CalendarSECTIONSWhite HouseCongressU.S. Supreme Court2025 Election CalendarTOP STORIESNational Guard troops have temporarily detained civilians in LA protests, commander saysUS reduces the presence of staffers not deemed essential in the Middle East as tensions riseTrump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55%NewslettersGround GameExclusive insights and key stories from the world of politics.See All Newsletters White House Congress U.S. Supreme Court 2025 Election Calendar National Guard troops have temporarily detained civilians in LA protests, commander says US reduces the presence of staffers not deemed essential in the Middle East as tensions rise Trump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55% White House Congress U.S. Supreme Court 2025 Election Calendar National Guard troops have temporarily detained civilians in LA protests, commander says US reduces the presence of staffers not deemed essential in the Middle East as tensions rise Trump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55% SportsNBAMLBNHLTennisTennisWNBANFLAuto RacingSoccerSECTIONSNBAMLBNHLTennisWNBANFLAuto RacingSoccerTOP STORIESUS Open gets a peaceful day of practice ahead of tough test that awaits at Oakmont25 years after Tiger's romp, a huge fan, Chase Johnson, is US Open's only player of Black heritageFemale athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination lawNewslettersAP Top 25 Poll AlertsGet email alerts for every college football Top 25 Poll release.The Sports WireYour home base for in-depth reporting from the world of sports.See All Newsletters NBA MLB NHL TennisTennis WNBA NFL Auto Racing Soccer US Open gets a peaceful day of practice ahead of tough test that awaits at Oakmont 25 years after Tiger's romp, a huge fan, Chase Johnson, is US Open's only player of Black heritage Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law NBA MLB NHL TennisTennis WNBA NFL Auto Racing Soccer US Open gets a peaceful day of practice ahead of tough test that awaits at Oakmont 25 years after Tiger's romp, a huge fan, Chase Johnson, is US Open's only player of Black heritage Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law EntertainmentMovie ReviewsWhat to StreamTelevisionBook ReviewsMusicCelebrity InterviewsSECTIONSMovie ReviewsWhat to StreamTelevisionBook ReviewsMusicCelebrity InterviewsTOP STORIESBrian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82How the ‘F1’ soundtrack came together, with a little help from Lewis Hamilton10 songs to celebrate the life and legacy of the Beach Boys' Brian WilsonNewslettersAP Entertainment WireGet AP's first personalized newsletter delivering you entertainment news twice a week.See All Newsletters Movie Reviews What to Stream Television Book Reviews Music Celebrity Interviews Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82 How the ‘F1’ soundtrack came together, with a little help from Lewis Hamilton 10 songs to celebrate the life and legacy of the Beach Boys' Brian Wilson Movie Reviews What to Stream Television Book Reviews Music Celebrity Interviews Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82 How the ‘F1’ soundtrack came together, with a little help from Lewis Hamilton 10 songs to celebrate the life and legacy of the Beach Boys' Brian Wilson BusinessTariffsInflationFinancial MarketsFinancial WellnessTechnologySECTIONSTariffsInflationFinancial MarketsFinancial WellnessTechnologyTOP STORIESInflation barely rose last month as cheaper gas and cars offset some costlier importsTrump hails favorable federal appeals court ruling on his sweeping tariff policy as a 'great' winMusk backs off from Trump feud, saying he regrets some posts that 'went too far' Tariffs Inflation Financial Markets Financial Wellness Technology Inflation barely rose last month as cheaper gas and cars offset some costlier imports Trump hails favorable federal appeals court ruling on his sweeping tariff policy as a 'great' win Musk backs off from Trump feud, saying he regrets some posts that 'went too far' Tariffs Inflation Financial Markets Financial Wellness Technology Inflation barely rose last month as cheaper gas and cars offset some costlier imports Trump hails favorable federal appeals court ruling on his sweeping tariff policy as a 'great' win Musk backs off from Trump feud, saying he regrets some posts that 'went too far' ScienceSpaceAnimalsThe Ancient WorldClimateMedicineSECTIONSSpaceAnimalsThe Ancient WorldClimateMedicineTOP STORIESEmperor penguins show dramatic decline in one region of Antarctica, satellite photos showPrivate lunar lander from Japan crashes into moon in failed missionWhat is Fusarium graminearum, the fungus US authorities say was smuggled in from China? Space Animals The Ancient World Climate Medicine Emperor penguins show dramatic decline in one region of Antarctica, satellite photos show Private lunar lander from Japan crashes into moon in failed mission What is Fusarium graminearum, the fungus US authorities say was smuggled in from China? Space Animals The Ancient World Climate Medicine Emperor penguins show dramatic decline in one region of Antarctica, satellite photos show Private lunar lander from Japan crashes into moon in failed mission What is Fusarium graminearum, the fungus US authorities say was smuggled in from China? Fact CheckTOP STORIESFACT FOCUS: A Craigslist ad is not proof of paid protesters in LA. It was posted as a prankUnsubstantiated 'chemtrail' conspiracy theories lead to legislation proposed in US statehousesFACT FOCUS: Trump’s claims about remedial math at Harvard don’t add up FACT FOCUS: A Craigslist ad is not proof of paid protesters in LA. It was posted as a prank Unsubstantiated 'chemtrail' conspiracy theories lead to legislation proposed in US statehouses FACT FOCUS: Trump’s claims about remedial math at Harvard don’t add up FACT FOCUS: A Craigslist ad is not proof of paid protesters in LA. It was posted as a prank Unsubstantiated 'chemtrail' conspiracy theories lead to legislation proposed in US statehouses FACT FOCUS: Trump’s claims about remedial math at Harvard don’t add up OdditiesTOP STORIESThe world's oldest restaurant faces a challenge from another Madrid tavern that says it's even olderLeaders of ‘orgasmic meditation’ women's wellness company OneTaste convicted in forced labor trialA runaway pet zebra has been captured in TennesseeA quirky vegetable sculpture contest features a squash Donald Trump and a papal 'Cornclave'Why a Minneapolis neighborhood sharpens a giant pencil every yearFlying boats make for a rare sight as Washington clears an island of derelict vessels by helicopter The world's oldest restaurant faces a challenge from another Madrid tavern that says it's even older Leaders of ‘orgasmic meditation’ women's wellness company OneTaste convicted in forced labor trial A runaway pet zebra has been captured in Tennessee A quirky vegetable sculpture contest features a squash Donald Trump and a papal 'Cornclave' Why a Minneapolis neighborhood sharpens a giant pencil every year Flying boats make for a rare sight as Washington clears an island of derelict vessels by helicopter The world's oldest restaurant faces a challenge from another Madrid tavern that says it's even older Leaders of ‘orgasmic meditation’ women's wellness company OneTaste convicted in forced labor trial A runaway pet zebra has been captured in Tennessee A quirky vegetable sculpture contest features a squash Donald Trump and a papal 'Cornclave' Why a Minneapolis neighborhood sharpens a giant pencil every year Flying boats make for a rare sight as Washington clears an island of derelict vessels by helicopter Be WellTOP STORIESYou should wear sunscreen even if you have darker skin. Here's whyFrom frustration to joy: What I learned about getting a hearing aidMore at-home health tests are now available. How to know what's right for youOne Life Hack: How to treat allergies in dogs and catsHow to stay safe when the air quality is badOne Life Hack: How to budget for vacation You should wear sunscreen even if you have darker skin. Here's why From frustration to joy: What I learned about getting a hearing aid More at-home health tests are now available. How to know what's right for you One Life Hack: How to treat allergies in dogs and cats How to stay safe when the air quality is bad One Life Hack: How to budget for vacation You should wear sunscreen even if you have darker skin. Here's why From frustration to joy: What I learned about getting a hearing aid More at-home health tests are now available. How to know what's right for you One Life Hack: How to treat allergies in dogs and cats How to stay safe when the air quality is bad One Life Hack: How to budget for vacation NewslettersNewslettersAP News AlertsKeep your pulse on the news with breaking news alerts from The AP.The Morning WireOur flagship newsletter breaks down the biggest headlines of the day.Ground GameExclusive insights and key stories from the world of politics.Beyond the StoryExecutive Editor Julie Pace brings you behind the scenes of the AP newsroom.The Afternoon WireGet caught up on what you may have missed throughout the day.AP Entertainment WireGet AP's first personalized newsletter delivering you entertainment news twice a week.See All Newsletters Photography2024 YEAR END PHOTOSPhoto EssaysPhotographySECTIONS2024 YEAR END PHOTOSPhoto EssaysPhotographyTOP STORIESBrian Wilson's life in photosAP PHOTOS: Protests over immigration raids spread beyond Los AngelesThe top photos of the day by AP's photojournalistsNewslettersThe World in PicturesGet The AP’s most compelling photographs sent directly to your inbox.See All Newsletters 2024 YEAR END PHOTOS Photo Essays Photography Brian Wilson's life in photos AP PHOTOS: Protests over immigration raids spread beyond Los Angeles The top photos of the day by AP's photojournalists 2024 YEAR END PHOTOS Photo Essays Photography Brian Wilson's life in photos AP PHOTOS: Protests over immigration raids spread beyond Los Angeles The top photos of the day by AP's photojournalists AP Investigations ClimateIndigenous peoples and climateClimate QuestionsClimate MigrationIndia FocusSECTIONSIndigenous peoples and climateClimate QuestionsClimate MigrationIndia FocusTOP STORIESEPA moves to repeal rules that limit greenhouse gas emissions from US power plantsPeanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meatAhead of UN climate talks, Brazil fast-tracks oil and highway projects that threaten the Amazon Indigenous peoples and climate Climate Questions Climate Migration India Focus EPA moves to repeal rules that limit greenhouse gas emissions from US power plants Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat Ahead of UN climate talks, Brazil fast-tracks oil and highway projects that threaten the Amazon Indigenous peoples and climate Climate Questions Climate Migration India Focus EPA moves to repeal rules that limit greenhouse gas emissions from US power plants Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat Ahead of UN climate talks, Brazil fast-tracks oil and highway projects that threaten the Amazon HealthTOP STORIESHundreds of laid-off CDC employees are being reinstatedTakeaways from AP's report on financial interests of RFK Jr. adviser who runs wellness platformTop RFK Jr. aide attacks US health system while running company that promotes wellness alternativesMore at-home health tests are now available. How to know what's right for youDogs and cats can also suffer from allergies, but there are ways to help our furry friendsYou should wear sunscreen even if you have darker skin. Here's why Hundreds of laid-off CDC employees are being reinstated Takeaways from AP's report on financial interests of RFK Jr. adviser who runs wellness platform Top RFK Jr. aide attacks US health system while running company that promotes wellness alternatives More at-home health tests are now available. How to know what's right for you Dogs and cats can also suffer from allergies, but there are ways to help our furry friends You should wear sunscreen even if you have darker skin. Here's why Hundreds of laid-off CDC employees are being reinstated Takeaways from AP's report on financial interests of RFK Jr. adviser who runs wellness platform Top RFK Jr. aide attacks US health system while running company that promotes wellness alternatives More at-home health tests are now available. How to know what's right for you Dogs and cats can also suffer from allergies, but there are ways to help our furry friends You should wear sunscreen even if you have darker skin. Here's why TechArtificial IntelligenceSocial MediaSECTIONSArtificial IntelligenceSocial MediaTOP STORIESDisney and Universal sue AI firm Midjourney for copyright infringementGoogle offers buyouts to more workers amid AI-driven tech upheaval and antitrust uncertaintyMusk says Tesla's robotaxi service to 'tentatively' launch in Austin on June 22 Artificial Intelligence Social Media Disney and Universal sue AI firm Midjourney for copyright infringement Google offers buyouts to more workers amid AI-driven tech upheaval and antitrust uncertainty Musk says Tesla's robotaxi service to 'tentatively' launch in Austin on June 22 Artificial Intelligence Social Media Disney and Universal sue AI firm Midjourney for copyright infringement Google offers buyouts to more workers amid AI-driven tech upheaval and antitrust uncertainty Musk says Tesla's robotaxi service to 'tentatively' launch in Austin on June 22 LifestyleFood & RecipesGardeningHomesTravelFashionPetsSECTIONSFood & RecipesGardeningHomesTravelFashionPetsTOP STORIESPeanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meatShould you let pets sleep next to you? (Does it even matter what the experts say?)He loved ribs more than anyone. This Cajun-flavored recipe is for him on Father's Day Food & Recipes Gardening Homes Travel Fashion Pets Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat Should you let pets sleep next to you? (Does it even matter what the experts say?) He loved ribs more than anyone. This Cajun-flavored recipe is for him on Father's Day Food & Recipes Gardening Homes Travel Fashion Pets Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat Should you let pets sleep next to you? (Does it even matter what the experts say?) He loved ribs more than anyone. This Cajun-flavored recipe is for him on Father's Day ReligionTOP STORIESMandatory military service for Israel's ultra-Orthodox tests Netanyahu's ruleMore than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials sayPope Leo XIV names first Chinese bishop, signalling he is continuing Vatican's controversial accordNewslettersWorld of FaithComprehensive global coverage of how religion shapes our world.See All Newsletters Mandatory military service for Israel's ultra-Orthodox tests Netanyahu's rule More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Pope Leo XIV names first Chinese bishop, signalling he is continuing Vatican's controversial accord Mandatory military service for Israel's ultra-Orthodox tests Netanyahu's rule More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Pope Leo XIV names first Chinese bishop, signalling he is continuing Vatican's controversial accord EspañolTOP STORIESArrestan a más de 20 personas tras primera noche de toque de queda por protestas en Los ÁngelesAgentes de inmigración de EEUU intensifican arrestos en juzgados para acelerar deportacionesProtestas por redadas migratorias surgen en todo EEUU; hay más planeadasSoldados de la Guardia Nacional detienen temporalmente a civiles en protestas de LA, dice comandanteHegseth defiende uso de tropas para proteger redadas de inmigración en Los Ángeles Arrestan a más de 20 personas tras primera noche de toque de queda por protestas en Los Ángeles Agentes de inmigración de EEUU intensifican arrestos en juzgados para acelerar deportaciones Protestas por redadas migratorias surgen en todo EEUU; hay más planeadas Soldados de la Guardia Nacional detienen temporalmente a civiles en protestas de LA, dice comandante Hegseth defiende uso de tropas para proteger redadas de inmigración en Los Ángeles Arrestan a más de 20 personas tras primera noche de toque de queda por protestas en Los Ángeles Agentes de inmigración de EEUU intensifican arrestos en juzgados para acelerar deportaciones Protestas por redadas migratorias surgen en todo EEUU; hay más planeadas Soldados de la Guardia Nacional detienen temporalmente a civiles en protestas de LA, dice comandante Hegseth defiende uso de tropas para proteger redadas de inmigración en Los Ángeles Standards Quizzes Press Releases My Account The Associated Press is an independent global news organization dedicated to factual reporting. Founded in 1846, AP today remains the most trusted source of fast, accurate, unbiased news in all formats and the essential provider of the technology and services vital to the news business. More than half the world’s population sees AP journalism every day. twitterinstagramfacebook twitter instagram facebook twitter instagram facebook The Associated Pressap.orgCareersAdvertise with usContact UsAccessibility StatementTerms of UsePrivacy PolicyCookie SettingsDo Not Sell or Share My Personal InformationLimit Use and Disclosure of Sensitive Personal InformationCA Notice of Collection ap.org Careers Advertise with us Contact Us Accessibility Statement Terms of Use Privacy Policy Cookie Settings Do Not Sell or Share My Personal Information Limit Use and Disclosure of Sensitive Personal Information CA Notice of Collection ap.org Careers Advertise with us Contact Us Accessibility Statement Terms of Use Privacy Policy Cookie Settings Do Not Sell or Share My Personal Information Limit Use and Disclosure of Sensitive Personal Information CA Notice of Collection More From AP NewsAboutAP News Values and PrinciplesAP’s Role in ElectionsAP LeadsAP Definitive Source BlogAP Images Spotlight BlogAP Stylebook About AP News Values and Principles AP’s Role in Elections AP Leads AP Definitive Source Blog AP Images Spotlight Blog AP Stylebook About AP News Values and Principles AP’s Role in Elections AP Leads AP Definitive Source Blog AP Images Spotlight Blog AP Stylebook The Associated Pressap.orgCareersAdvertise with usContact UsAccessibility StatementTerms of UsePrivacy PolicyCookie SettingsDo Not Sell or Share My Personal InformationLimit Use and Disclosure of Sensitive Personal InformationCA Notice of Collection ap.org Careers Advertise with us Contact Us Accessibility Statement Terms of Use Privacy Policy Cookie Settings Do Not Sell or Share My Personal Information Limit Use and Disclosure of Sensitive Personal Information CA Notice of Collection ap.org Careers Advertise with us Contact Us Accessibility Statement Terms of Use Privacy Policy Cookie Settings Do Not Sell or Share My Personal Information Limit Use and Disclosure of Sensitive Personal Information CA Notice of Collection More From AP NewsAboutAP News Values and PrinciplesAP’s Role in ElectionsAP LeadsAP Definitive Source BlogAP Images Spotlight BlogAP StylebookSECTIONSAboutAP News Values and PrinciplesAP’s Role in ElectionsAP LeadsAP Definitive Source BlogAP Images Spotlight BlogAP Stylebook About AP News Values and Principles AP’s Role in Elections AP Leads AP Definitive Source Blog AP Images Spotlight Blog AP Stylebook About AP News Values and Principles AP’s Role in Elections AP Leads AP Definitive Source Blog AP Images Spotlight Blog AP Stylebook Copyright 2025 The Associated Press. All Rights Reserved. Copyright 2025 The Associated Press. All Rights Reserved. Copyright 2025 The Associated Press. All Rights Reserved. WorldSECTIONSIsrael-Hamas warRussia-Ukraine WarEspañolChinaAsia PacificLatin AmericaEuropeAfricaTOP STORIESMore than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials sayNetanyahu's government faces possible collapse as the opposition seeks to dissolve parliamentMandatory military service for Israel's ultra-Orthodox tests Netanyahu's ruleNewslettersThe Morning WireOur flagship newsletter breaks down the biggest headlines of the day.The Afternoon WireGet caught up on what you may have missed throughout the day.See All Newsletters More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Netanyahu's government faces possible collapse as the opposition seeks to dissolve parliament Mandatory military service for Israel's ultra-Orthodox tests Netanyahu's rule More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Netanyahu's government faces possible collapse as the opposition seeks to dissolve parliament Mandatory military service for Israel's ultra-Orthodox tests Netanyahu's rule U.S.SECTIONSImmigrationWeatherEducationTransportationAbortionLGBTQ+Notable DeathsTOP STORIESPolice detain more than 20 people on first night of curfew aimed at protests in downtown Los AngelesWhat to know about the protests over Trump's immigration crackdown in LA and other citiesBrian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82NewslettersThe Morning WireOur flagship newsletter breaks down the biggest headlines of the day.See All NewslettersAP QUIZZESTest Your News I.Q. — take today’s quiz Police detain more than 20 people on first night of curfew aimed at protests in downtown Los Angeles What to know about the protests over Trump's immigration crackdown in LA and other cities Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82 Police detain more than 20 people on first night of curfew aimed at protests in downtown Los Angeles What to know about the protests over Trump's immigration crackdown in LA and other cities Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82 PoliticsSECTIONSWhite HouseCongressU.S. Supreme Court2025 Election CalendarTOP STORIESNational Guard troops have temporarily detained civilians in LA protests, commander saysUS reduces the presence of staffers not deemed essential in the Middle East as tensions riseTrump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55%NewslettersGround GameExclusive insights and key stories from the world of politics.See All Newsletters National Guard troops have temporarily detained civilians in LA protests, commander says US reduces the presence of staffers not deemed essential in the Middle East as tensions rise Trump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55% National Guard troops have temporarily detained civilians in LA protests, commander says US reduces the presence of staffers not deemed essential in the Middle East as tensions rise Trump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55% SportsSECTIONSNBAMLBNHLTennisWNBANFLAuto RacingSoccerTOP STORIESUS Open gets a peaceful day of practice ahead of tough test that awaits at Oakmont25 years after Tiger's romp, a huge fan, Chase Johnson, is US Open's only player of Black heritageFemale athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination lawNewslettersAP Top 25 Poll AlertsGet email alerts for every college football Top 25 Poll release.The Sports WireYour home base for in-depth reporting from the world of sports.See All Newsletters US Open gets a peaceful day of practice ahead of tough test that awaits at Oakmont 25 years after Tiger's romp, a huge fan, Chase Johnson, is US Open's only player of Black heritage Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law US Open gets a peaceful day of practice ahead of tough test that awaits at Oakmont 25 years after Tiger's romp, a huge fan, Chase Johnson, is US Open's only player of Black heritage Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law EntertainmentSECTIONSMovie ReviewsWhat to StreamTelevisionBook ReviewsMusicCelebrity InterviewsTOP STORIESBrian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82How the ‘F1’ soundtrack came together, with a little help from Lewis Hamilton10 songs to celebrate the life and legacy of the Beach Boys' Brian WilsonNewslettersAP Entertainment WireGet AP's first personalized newsletter delivering you entertainment news twice a week.See All Newsletters Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82 How the ‘F1’ soundtrack came together, with a little help from Lewis Hamilton 10 songs to celebrate the life and legacy of the Beach Boys' Brian Wilson Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82 How the ‘F1’ soundtrack came together, with a little help from Lewis Hamilton 10 songs to celebrate the life and legacy of the Beach Boys' Brian Wilson BusinessSECTIONSTariffsInflationFinancial MarketsFinancial WellnessTechnologyTOP STORIESInflation barely rose last month as cheaper gas and cars offset some costlier importsTrump hails favorable federal appeals court ruling on his sweeping tariff policy as a 'great' winMusk backs off from Trump feud, saying he regrets some posts that 'went too far' Inflation barely rose last month as cheaper gas and cars offset some costlier imports Trump hails favorable federal appeals court ruling on his sweeping tariff policy as a 'great' win Musk backs off from Trump feud, saying he regrets some posts that 'went too far' Inflation barely rose last month as cheaper gas and cars offset some costlier imports Trump hails favorable federal appeals court ruling on his sweeping tariff policy as a 'great' win Musk backs off from Trump feud, saying he regrets some posts that 'went too far' ScienceSECTIONSSpaceAnimalsThe Ancient WorldClimateMedicineTOP STORIESEmperor penguins show dramatic decline in one region of Antarctica, satellite photos showPrivate lunar lander from Japan crashes into moon in failed missionWhat is Fusarium graminearum, the fungus US authorities say was smuggled in from China? Emperor penguins show dramatic decline in one region of Antarctica, satellite photos show Private lunar lander from Japan crashes into moon in failed mission What is Fusarium graminearum, the fungus US authorities say was smuggled in from China? Emperor penguins show dramatic decline in one region of Antarctica, satellite photos show Private lunar lander from Japan crashes into moon in failed mission What is Fusarium graminearum, the fungus US authorities say was smuggled in from China? Fact CheckTOP STORIESFACT FOCUS: A Craigslist ad is not proof of paid protesters in LA. It was posted as a prankUnsubstantiated 'chemtrail' conspiracy theories lead to legislation proposed in US statehousesFACT FOCUS: Trump’s claims about remedial math at Harvard don’t add up FACT FOCUS: A Craigslist ad is not proof of paid protesters in LA. It was posted as a prank Unsubstantiated 'chemtrail' conspiracy theories lead to legislation proposed in US statehouses FACT FOCUS: Trump’s claims about remedial math at Harvard don’t add up FACT FOCUS: A Craigslist ad is not proof of paid protesters in LA. It was posted as a prank Unsubstantiated 'chemtrail' conspiracy theories lead to legislation proposed in US statehouses FACT FOCUS: Trump’s claims about remedial math at Harvard don’t add up OdditiesTOP STORIESThe world's oldest restaurant faces a challenge from another Madrid tavern that says it's even olderLeaders of ‘orgasmic meditation’ women's wellness company OneTaste convicted in forced labor trialA runaway pet zebra has been captured in TennesseeA quirky vegetable sculpture contest features a squash Donald Trump and a papal 'Cornclave'Why a Minneapolis neighborhood sharpens a giant pencil every yearFlying boats make for a rare sight as Washington clears an island of derelict vessels by helicopter The world's oldest restaurant faces a challenge from another Madrid tavern that says it's even older Leaders of ‘orgasmic meditation’ women's wellness company OneTaste convicted in forced labor trial A runaway pet zebra has been captured in Tennessee A quirky vegetable sculpture contest features a squash Donald Trump and a papal 'Cornclave' Why a Minneapolis neighborhood sharpens a giant pencil every year Flying boats make for a rare sight as Washington clears an island of derelict vessels by helicopter The world's oldest restaurant faces a challenge from another Madrid tavern that says it's even older Leaders of ‘orgasmic meditation’ women's wellness company OneTaste convicted in forced labor trial A runaway pet zebra has been captured in Tennessee A quirky vegetable sculpture contest features a squash Donald Trump and a papal 'Cornclave' Why a Minneapolis neighborhood sharpens a giant pencil every year Flying boats make for a rare sight as Washington clears an island of derelict vessels by helicopter Be WellTOP STORIESYou should wear sunscreen even if you have darker skin. Here's whyFrom frustration to joy: What I learned about getting a hearing aidMore at-home health tests are now available. How to know what's right for youOne Life Hack: How to treat allergies in dogs and catsHow to stay safe when the air quality is badOne Life Hack: How to budget for vacation You should wear sunscreen even if you have darker skin. Here's why From frustration to joy: What I learned about getting a hearing aid More at-home health tests are now available. How to know what's right for you One Life Hack: How to treat allergies in dogs and cats How to stay safe when the air quality is bad One Life Hack: How to budget for vacation You should wear sunscreen even if you have darker skin. Here's why From frustration to joy: What I learned about getting a hearing aid More at-home health tests are now available. How to know what's right for you One Life Hack: How to treat allergies in dogs and cats How to stay safe when the air quality is bad One Life Hack: How to budget for vacation NewslettersNewslettersAP News AlertsKeep your pulse on the news with breaking news alerts from The AP.The Morning WireOur flagship newsletter breaks down the biggest headlines of the day.Ground GameExclusive insights and key stories from the world of politics.Beyond the StoryExecutive Editor Julie Pace brings you behind the scenes of the AP newsroom.The Afternoon WireGet caught up on what you may have missed throughout the day.AP Entertainment WireGet AP's first personalized newsletter delivering you entertainment news twice a week.See All Newsletters PhotographySECTIONS2024 YEAR END PHOTOSPhoto EssaysPhotographyTOP STORIESBrian Wilson's life in photosAP PHOTOS: Protests over immigration raids spread beyond Los AngelesThe top photos of the day by AP's photojournalistsNewslettersThe World in PicturesGet The AP’s most compelling photographs sent directly to your inbox.See All Newsletters Brian Wilson's life in photos AP PHOTOS: Protests over immigration raids spread beyond Los Angeles The top photos of the day by AP's photojournalists Brian Wilson's life in photos AP PHOTOS: Protests over immigration raids spread beyond Los Angeles The top photos of the day by AP's photojournalists AP Investigations ClimateSECTIONSIndigenous peoples and climateClimate QuestionsClimate MigrationIndia FocusTOP STORIESEPA moves to repeal rules that limit greenhouse gas emissions from US power plantsPeanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meatAhead of UN climate talks, Brazil fast-tracks oil and highway projects that threaten the Amazon EPA moves to repeal rules that limit greenhouse gas emissions from US power plants Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat Ahead of UN climate talks, Brazil fast-tracks oil and highway projects that threaten the Amazon EPA moves to repeal rules that limit greenhouse gas emissions from US power plants Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat Ahead of UN climate talks, Brazil fast-tracks oil and highway projects that threaten the Amazon HealthTOP STORIESHundreds of laid-off CDC employees are being reinstatedTakeaways from AP's report on financial interests of RFK Jr. adviser who runs wellness platformTop RFK Jr. aide attacks US health system while running company that promotes wellness alternativesMore at-home health tests are now available. How to know what's right for youDogs and cats can also suffer from allergies, but there are ways to help our furry friendsYou should wear sunscreen even if you have darker skin. Here's why Hundreds of laid-off CDC employees are being reinstated Takeaways from AP's report on financial interests of RFK Jr. adviser who runs wellness platform Top RFK Jr. aide attacks US health system while running company that promotes wellness alternatives More at-home health tests are now available. How to know what's right for you Dogs and cats can also suffer from allergies, but there are ways to help our furry friends You should wear sunscreen even if you have darker skin. Here's why Hundreds of laid-off CDC employees are being reinstated Takeaways from AP's report on financial interests of RFK Jr. adviser who runs wellness platform Top RFK Jr. aide attacks US health system while running company that promotes wellness alternatives More at-home health tests are now available. How to know what's right for you Dogs and cats can also suffer from allergies, but there are ways to help our furry friends You should wear sunscreen even if you have darker skin. Here's why TechSECTIONSArtificial IntelligenceSocial MediaTOP STORIESDisney and Universal sue AI firm Midjourney for copyright infringementGoogle offers buyouts to more workers amid AI-driven tech upheaval and antitrust uncertaintyMusk says Tesla's robotaxi service to 'tentatively' launch in Austin on June 22 Disney and Universal sue AI firm Midjourney for copyright infringement Google offers buyouts to more workers amid AI-driven tech upheaval and antitrust uncertainty Musk says Tesla's robotaxi service to 'tentatively' launch in Austin on June 22 Disney and Universal sue AI firm Midjourney for copyright infringement Google offers buyouts to more workers amid AI-driven tech upheaval and antitrust uncertainty Musk says Tesla's robotaxi service to 'tentatively' launch in Austin on June 22 LifestyleSECTIONSFood & RecipesGardeningHomesTravelFashionPetsTOP STORIESPeanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meatShould you let pets sleep next to you? (Does it even matter what the experts say?)He loved ribs more than anyone. This Cajun-flavored recipe is for him on Father's Day Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat Should you let pets sleep next to you? (Does it even matter what the experts say?) He loved ribs more than anyone. This Cajun-flavored recipe is for him on Father's Day Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat Should you let pets sleep next to you? (Does it even matter what the experts say?) He loved ribs more than anyone. This Cajun-flavored recipe is for him on Father's Day ReligionTOP STORIESMandatory military service for Israel's ultra-Orthodox tests Netanyahu's ruleMore than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials sayPope Leo XIV names first Chinese bishop, signalling he is continuing Vatican's controversial accordNewslettersWorld of FaithComprehensive global coverage of how religion shapes our world.See All Newsletters Mandatory military service for Israel's ultra-Orthodox tests Netanyahu's rule More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Pope Leo XIV names first Chinese bishop, signalling he is continuing Vatican's controversial accord Mandatory military service for Israel's ultra-Orthodox tests Netanyahu's rule More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Pope Leo XIV names first Chinese bishop, signalling he is continuing Vatican's controversial accord EspañolTOP STORIESArrestan a más de 20 personas tras primera noche de toque de queda por protestas en Los ÁngelesAgentes de inmigración de EEUU intensifican arrestos en juzgados para acelerar deportacionesProtestas por redadas migratorias surgen en todo EEUU; hay más planeadasSoldados de la Guardia Nacional detienen temporalmente a civiles en protestas de LA, dice comandanteHegseth defiende uso de tropas para proteger redadas de inmigración en Los Ángeles Arrestan a más de 20 personas tras primera noche de toque de queda por protestas en Los Ángeles Agentes de inmigración de EEUU intensifican arrestos en juzgados para acelerar deportaciones Protestas por redadas migratorias surgen en todo EEUU; hay más planeadas Soldados de la Guardia Nacional detienen temporalmente a civiles en protestas de LA, dice comandante Hegseth defiende uso de tropas para proteger redadas de inmigración en Los Ángeles Arrestan a más de 20 personas tras primera noche de toque de queda por protestas en Los Ángeles Agentes de inmigración de EEUU intensifican arrestos en juzgados para acelerar deportaciones Protestas por redadas migratorias surgen en todo EEUU; hay más planeadas Soldados de la Guardia Nacional detienen temporalmente a civiles en protestas de LA, dice comandante Hegseth defiende uso de tropas para proteger redadas de inmigración en Los Ángeles Standards Quizzes Press Releases My Account MOREWorldIsrael-Hamas warRussia-Ukraine WarEspañolChinaAsia PacificLatin AmericaEuropeAfricaAustraliaMiddle EastGlobal ElectionsU.S.ImmigrationWeatherEducationTransportationAbortionLGBTQ+Notable DeathsPoliticsWhite HouseCongressU.S. Supreme Court2025 Election CalendarSportsNBAMLBNHLTennisTennisWNBANFLAuto RacingSoccerEntertainmentMovie ReviewsWhat to StreamTelevisionBook ReviewsMusicCelebrity InterviewsBusinessTariffsInflationFinancial MarketsFinancial WellnessTechnologyScienceSpaceAnimalsThe Ancient WorldClimateMedicineFact CheckOdditiesBe WellNewslettersPhotography2024 YEAR END PHOTOSPhoto EssaysPhotographyAP InvestigationsClimateIndigenous peoples and climateClimate QuestionsClimate MigrationIndia FocusHealthTechArtificial IntelligenceSocial MediaLifestyleFood & RecipesGardeningHomesTravelFashionPetsReligionEspañolStandardsQuizzesPress ReleasesMy Account WorldIsrael-Hamas warRussia-Ukraine WarEspañolChinaAsia PacificLatin AmericaEuropeAfricaAustraliaMiddle EastGlobal Elections Israel-Hamas war Russia-Ukraine War Español China Asia Pacific Latin America Europe Africa Australia Middle East Global Elections U.S.ImmigrationWeatherEducationTransportationAbortionLGBTQ+Notable Deaths Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths PoliticsWhite HouseCongressU.S. Supreme Court2025 Election Calendar White House Congress U.S. Supreme Court 2025 Election Calendar SportsNBAMLBNHLTennisTennisWNBANFLAuto RacingSoccer NBA MLB NHL TennisTennis WNBA NFL Auto Racing Soccer EntertainmentMovie ReviewsWhat to StreamTelevisionBook ReviewsMusicCelebrity Interviews Movie Reviews What to Stream Television Book Reviews Music Celebrity Interviews BusinessTariffsInflationFinancial MarketsFinancial WellnessTechnology Tariffs Inflation Financial Markets Financial Wellness Technology ScienceSpaceAnimalsThe Ancient WorldClimateMedicine Space Animals The Ancient World Climate Medicine Fact Check Oddities Be Well Newsletters Photography2024 YEAR END PHOTOSPhoto EssaysPhotography 2024 YEAR END PHOTOS Photo Essays Photography AP Investigations ClimateIndigenous peoples and climateClimate QuestionsClimate MigrationIndia Focus Indigenous peoples and climate Climate Questions Climate Migration India Focus Health TechArtificial IntelligenceSocial Media Artificial Intelligence Social Media LifestyleFood & RecipesGardeningHomesTravelFashionPets Food & Recipes Gardening Homes Travel Fashion Pets Religion Español Standards Quizzes Press Releases My Account WorldIsrael-Hamas warRussia-Ukraine WarEspañolChinaAsia PacificLatin AmericaEuropeAfricaAustraliaMiddle EastGlobal Elections Israel-Hamas war Russia-Ukraine War Español China Asia Pacific Latin America Europe Africa Australia Middle East Global Elections Israel-Hamas war Russia-Ukraine War Español China Asia Pacific Latin America Europe Africa Australia Middle East Global Elections U.S.ImmigrationWeatherEducationTransportationAbortionLGBTQ+Notable Deaths Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths PoliticsWhite HouseCongressU.S. Supreme Court2025 Election Calendar White House Congress U.S. Supreme Court 2025 Election Calendar White House Congress U.S. Supreme Court 2025 Election Calendar SportsNBAMLBNHLTennisTennisWNBANFLAuto RacingSoccer NBA MLB NHL TennisTennis WNBA NFL Auto Racing Soccer NBA MLB NHL TennisTennis WNBA NFL Auto Racing Soccer EntertainmentMovie ReviewsWhat to StreamTelevisionBook ReviewsMusicCelebrity Interviews Movie Reviews What to Stream Television Book Reviews Music Celebrity Interviews Movie Reviews What to Stream Television Book Reviews Music Celebrity Interviews BusinessTariffsInflationFinancial MarketsFinancial WellnessTechnology Tariffs Inflation Financial Markets Financial Wellness Technology Tariffs Inflation Financial Markets Financial Wellness Technology ScienceSpaceAnimalsThe Ancient WorldClimateMedicine Space Animals The Ancient World Climate Medicine Space Animals The Ancient World Climate Medicine Fact Check Oddities Be Well Newsletters Photography2024 YEAR END PHOTOSPhoto EssaysPhotography 2024 YEAR END PHOTOS Photo Essays Photography 2024 YEAR END PHOTOS Photo Essays Photography AP Investigations ClimateIndigenous peoples and climateClimate QuestionsClimate MigrationIndia Focus Indigenous peoples and climate Climate Questions Climate Migration India Focus Indigenous peoples and climate Climate Questions Climate Migration India Focus Health TechArtificial IntelligenceSocial Media Artificial Intelligence Social Media Artificial Intelligence Social Media LifestyleFood & RecipesGardeningHomesTravelFashionPets Food & Recipes Gardening Homes Travel Fashion Pets Food & Recipes Gardening Homes Travel Fashion Pets Religion Español Standards Quizzes Press Releases My Account WorldIsrael-Hamas warRussia-Ukraine WarEspañolChinaAsia PacificLatin AmericaEuropeAfricaAustraliaMiddle EastGlobal ElectionsSECTIONSIsrael-Hamas warRussia-Ukraine WarEspañolChinaAsia PacificLatin AmericaEuropeAfricaTOP STORIESMore than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials sayNetanyahu's government faces possible collapse as the opposition seeks to dissolve parliamentMandatory military service for Israel's ultra-Orthodox tests Netanyahu's ruleNewslettersThe Morning WireOur flagship newsletter breaks down the biggest headlines of the day.The Afternoon WireGet caught up on what you may have missed throughout the day.See All Newsletters Israel-Hamas war Russia-Ukraine War Español China Asia Pacific Latin America Europe Africa Australia Middle East Global Elections More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Netanyahu's government faces possible collapse as the opposition seeks to dissolve parliament Mandatory military service for Israel's ultra-Orthodox tests Netanyahu's rule Israel-Hamas war Russia-Ukraine War Español China Asia Pacific Latin America Europe Africa Australia Middle East Global Elections More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Netanyahu's government faces possible collapse as the opposition seeks to dissolve parliament Mandatory military service for Israel's ultra-Orthodox tests Netanyahu's rule U.S.ImmigrationWeatherEducationTransportationAbortionLGBTQ+Notable DeathsSECTIONSImmigrationWeatherEducationTransportationAbortionLGBTQ+Notable DeathsTOP STORIESPolice detain more than 20 people on first night of curfew aimed at protests in downtown Los AngelesWhat to know about the protests over Trump's immigration crackdown in LA and other citiesBrian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82NewslettersThe Morning WireOur flagship newsletter breaks down the biggest headlines of the day.See All NewslettersAP QUIZZESTest Your News I.Q. — take today’s quiz Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths Police detain more than 20 people on first night of curfew aimed at protests in downtown Los Angeles What to know about the protests over Trump's immigration crackdown in LA and other cities Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82 Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths Police detain more than 20 people on first night of curfew aimed at protests in downtown Los Angeles What to know about the protests over Trump's immigration crackdown in LA and other cities Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82 PoliticsWhite HouseCongressU.S. Supreme Court2025 Election CalendarSECTIONSWhite HouseCongressU.S. Supreme Court2025 Election CalendarTOP STORIESNational Guard troops have temporarily detained civilians in LA protests, commander saysUS reduces the presence of staffers not deemed essential in the Middle East as tensions riseTrump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55%NewslettersGround GameExclusive insights and key stories from the world of politics.See All Newsletters White House Congress U.S. Supreme Court 2025 Election Calendar National Guard troops have temporarily detained civilians in LA protests, commander says US reduces the presence of staffers not deemed essential in the Middle East as tensions rise Trump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55% White House Congress U.S. Supreme Court 2025 Election Calendar National Guard troops have temporarily detained civilians in LA protests, commander says US reduces the presence of staffers not deemed essential in the Middle East as tensions rise Trump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55% SportsNBAMLBNHLTennisTennisWNBANFLAuto RacingSoccerSECTIONSNBAMLBNHLTennisWNBANFLAuto RacingSoccerTOP STORIESUS Open gets a peaceful day of practice ahead of tough test that awaits at Oakmont25 years after Tiger's romp, a huge fan, Chase Johnson, is US Open's only player of Black heritageFemale athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination lawNewslettersAP Top 25 Poll AlertsGet email alerts for every college football Top 25 Poll release.The Sports WireYour home base for in-depth reporting from the world of sports.See All Newsletters NBA MLB NHL TennisTennis WNBA NFL Auto Racing Soccer US Open gets a peaceful day of practice ahead of tough test that awaits at Oakmont 25 years after Tiger's romp, a huge fan, Chase Johnson, is US Open's only player of Black heritage Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law NBA MLB NHL TennisTennis WNBA NFL Auto Racing Soccer US Open gets a peaceful day of practice ahead of tough test that awaits at Oakmont 25 years after Tiger's romp, a huge fan, Chase Johnson, is US Open's only player of Black heritage Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law EntertainmentMovie ReviewsWhat to StreamTelevisionBook ReviewsMusicCelebrity InterviewsSECTIONSMovie ReviewsWhat to StreamTelevisionBook ReviewsMusicCelebrity InterviewsTOP STORIESBrian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82How the ‘F1’ soundtrack came together, with a little help from Lewis Hamilton10 songs to celebrate the life and legacy of the Beach Boys' Brian WilsonNewslettersAP Entertainment WireGet AP's first personalized newsletter delivering you entertainment news twice a week.See All Newsletters Movie Reviews What to Stream Television Book Reviews Music Celebrity Interviews Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82 How the ‘F1’ soundtrack came together, with a little help from Lewis Hamilton 10 songs to celebrate the life and legacy of the Beach Boys' Brian Wilson Movie Reviews What to Stream Television Book Reviews Music Celebrity Interviews Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82 How the ‘F1’ soundtrack came together, with a little help from Lewis Hamilton 10 songs to celebrate the life and legacy of the Beach Boys' Brian Wilson BusinessTariffsInflationFinancial MarketsFinancial WellnessTechnologySECTIONSTariffsInflationFinancial MarketsFinancial WellnessTechnologyTOP STORIESInflation barely rose last month as cheaper gas and cars offset some costlier importsTrump hails favorable federal appeals court ruling on his sweeping tariff policy as a 'great' winMusk backs off from Trump feud, saying he regrets some posts that 'went too far' Tariffs Inflation Financial Markets Financial Wellness Technology Inflation barely rose last month as cheaper gas and cars offset some costlier imports Trump hails favorable federal appeals court ruling on his sweeping tariff policy as a 'great' win Musk backs off from Trump feud, saying he regrets some posts that 'went too far' Tariffs Inflation Financial Markets Financial Wellness Technology Inflation barely rose last month as cheaper gas and cars offset some costlier imports Trump hails favorable federal appeals court ruling on his sweeping tariff policy as a 'great' win Musk backs off from Trump feud, saying he regrets some posts that 'went too far' ScienceSpaceAnimalsThe Ancient WorldClimateMedicineSECTIONSSpaceAnimalsThe Ancient WorldClimateMedicineTOP STORIESEmperor penguins show dramatic decline in one region of Antarctica, satellite photos showPrivate lunar lander from Japan crashes into moon in failed missionWhat is Fusarium graminearum, the fungus US authorities say was smuggled in from China? Space Animals The Ancient World Climate Medicine Emperor penguins show dramatic decline in one region of Antarctica, satellite photos show Private lunar lander from Japan crashes into moon in failed mission What is Fusarium graminearum, the fungus US authorities say was smuggled in from China? Space Animals The Ancient World Climate Medicine Emperor penguins show dramatic decline in one region of Antarctica, satellite photos show Private lunar lander from Japan crashes into moon in failed mission What is Fusarium graminearum, the fungus US authorities say was smuggled in from China? Fact CheckTOP STORIESFACT FOCUS: A Craigslist ad is not proof of paid protesters in LA. It was posted as a prankUnsubstantiated 'chemtrail' conspiracy theories lead to legislation proposed in US statehousesFACT FOCUS: Trump’s claims about remedial math at Harvard don’t add up FACT FOCUS: A Craigslist ad is not proof of paid protesters in LA. It was posted as a prank Unsubstantiated 'chemtrail' conspiracy theories lead to legislation proposed in US statehouses FACT FOCUS: Trump’s claims about remedial math at Harvard don’t add up FACT FOCUS: A Craigslist ad is not proof of paid protesters in LA. It was posted as a prank Unsubstantiated 'chemtrail' conspiracy theories lead to legislation proposed in US statehouses FACT FOCUS: Trump’s claims about remedial math at Harvard don’t add up OdditiesTOP STORIESThe world's oldest restaurant faces a challenge from another Madrid tavern that says it's even olderLeaders of ‘orgasmic meditation’ women's wellness company OneTaste convicted in forced labor trialA runaway pet zebra has been captured in TennesseeA quirky vegetable sculpture contest features a squash Donald Trump and a papal 'Cornclave'Why a Minneapolis neighborhood sharpens a giant pencil every yearFlying boats make for a rare sight as Washington clears an island of derelict vessels by helicopter The world's oldest restaurant faces a challenge from another Madrid tavern that says it's even older Leaders of ‘orgasmic meditation’ women's wellness company OneTaste convicted in forced labor trial A runaway pet zebra has been captured in Tennessee A quirky vegetable sculpture contest features a squash Donald Trump and a papal 'Cornclave' Why a Minneapolis neighborhood sharpens a giant pencil every year Flying boats make for a rare sight as Washington clears an island of derelict vessels by helicopter The world's oldest restaurant faces a challenge from another Madrid tavern that says it's even older Leaders of ‘orgasmic meditation’ women's wellness company OneTaste convicted in forced labor trial A runaway pet zebra has been captured in Tennessee A quirky vegetable sculpture contest features a squash Donald Trump and a papal 'Cornclave' Why a Minneapolis neighborhood sharpens a giant pencil every year Flying boats make for a rare sight as Washington clears an island of derelict vessels by helicopter Be WellTOP STORIESYou should wear sunscreen even if you have darker skin. Here's whyFrom frustration to joy: What I learned about getting a hearing aidMore at-home health tests are now available. How to know what's right for youOne Life Hack: How to treat allergies in dogs and catsHow to stay safe when the air quality is badOne Life Hack: How to budget for vacation You should wear sunscreen even if you have darker skin. Here's why From frustration to joy: What I learned about getting a hearing aid More at-home health tests are now available. How to know what's right for you One Life Hack: How to treat allergies in dogs and cats How to stay safe when the air quality is bad One Life Hack: How to budget for vacation You should wear sunscreen even if you have darker skin. Here's why From frustration to joy: What I learned about getting a hearing aid More at-home health tests are now available. How to know what's right for you One Life Hack: How to treat allergies in dogs and cats How to stay safe when the air quality is bad One Life Hack: How to budget for vacation NewslettersNewslettersAP News AlertsKeep your pulse on the news with breaking news alerts from The AP.The Morning WireOur flagship newsletter breaks down the biggest headlines of the day.Ground GameExclusive insights and key stories from the world of politics.Beyond the StoryExecutive Editor Julie Pace brings you behind the scenes of the AP newsroom.The Afternoon WireGet caught up on what you may have missed throughout the day.AP Entertainment WireGet AP's first personalized newsletter delivering you entertainment news twice a week.See All Newsletters Photography2024 YEAR END PHOTOSPhoto EssaysPhotographySECTIONS2024 YEAR END PHOTOSPhoto EssaysPhotographyTOP STORIESBrian Wilson's life in photosAP PHOTOS: Protests over immigration raids spread beyond Los AngelesThe top photos of the day by AP's photojournalistsNewslettersThe World in PicturesGet The AP’s most compelling photographs sent directly to your inbox.See All Newsletters 2024 YEAR END PHOTOS Photo Essays Photography Brian Wilson's life in photos AP PHOTOS: Protests over immigration raids spread beyond Los Angeles The top photos of the day by AP's photojournalists 2024 YEAR END PHOTOS Photo Essays Photography Brian Wilson's life in photos AP PHOTOS: Protests over immigration raids spread beyond Los Angeles The top photos of the day by AP's photojournalists AP Investigations ClimateIndigenous peoples and climateClimate QuestionsClimate MigrationIndia FocusSECTIONSIndigenous peoples and climateClimate QuestionsClimate MigrationIndia FocusTOP STORIESEPA moves to repeal rules that limit greenhouse gas emissions from US power plantsPeanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meatAhead of UN climate talks, Brazil fast-tracks oil and highway projects that threaten the Amazon Indigenous peoples and climate Climate Questions Climate Migration India Focus EPA moves to repeal rules that limit greenhouse gas emissions from US power plants Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat Ahead of UN climate talks, Brazil fast-tracks oil and highway projects that threaten the Amazon Indigenous peoples and climate Climate Questions Climate Migration India Focus EPA moves to repeal rules that limit greenhouse gas emissions from US power plants Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat Ahead of UN climate talks, Brazil fast-tracks oil and highway projects that threaten the Amazon HealthTOP STORIESHundreds of laid-off CDC employees are being reinstatedTakeaways from AP's report on financial interests of RFK Jr. adviser who runs wellness platformTop RFK Jr. aide attacks US health system while running company that promotes wellness alternativesMore at-home health tests are now available. How to know what's right for youDogs and cats can also suffer from allergies, but there are ways to help our furry friendsYou should wear sunscreen even if you have darker skin. Here's why Hundreds of laid-off CDC employees are being reinstated Takeaways from AP's report on financial interests of RFK Jr. adviser who runs wellness platform Top RFK Jr. aide attacks US health system while running company that promotes wellness alternatives More at-home health tests are now available. How to know what's right for you Dogs and cats can also suffer from allergies, but there are ways to help our furry friends You should wear sunscreen even if you have darker skin. Here's why Hundreds of laid-off CDC employees are being reinstated Takeaways from AP's report on financial interests of RFK Jr. adviser who runs wellness platform Top RFK Jr. aide attacks US health system while running company that promotes wellness alternatives More at-home health tests are now available. How to know what's right for you Dogs and cats can also suffer from allergies, but there are ways to help our furry friends You should wear sunscreen even if you have darker skin. Here's why TechArtificial IntelligenceSocial MediaSECTIONSArtificial IntelligenceSocial MediaTOP STORIESDisney and Universal sue AI firm Midjourney for copyright infringementGoogle offers buyouts to more workers amid AI-driven tech upheaval and antitrust uncertaintyMusk says Tesla's robotaxi service to 'tentatively' launch in Austin on June 22 Artificial Intelligence Social Media Disney and Universal sue AI firm Midjourney for copyright infringement Google offers buyouts to more workers amid AI-driven tech upheaval and antitrust uncertainty Musk says Tesla's robotaxi service to 'tentatively' launch in Austin on June 22 Artificial Intelligence Social Media Disney and Universal sue AI firm Midjourney for copyright infringement Google offers buyouts to more workers amid AI-driven tech upheaval and antitrust uncertainty Musk says Tesla's robotaxi service to 'tentatively' launch in Austin on June 22 LifestyleFood & RecipesGardeningHomesTravelFashionPetsSECTIONSFood & RecipesGardeningHomesTravelFashionPetsTOP STORIESPeanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meatShould you let pets sleep next to you? (Does it even matter what the experts say?)He loved ribs more than anyone. This Cajun-flavored recipe is for him on Father's Day Food & Recipes Gardening Homes Travel Fashion Pets Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat Should you let pets sleep next to you? (Does it even matter what the experts say?) He loved ribs more than anyone. This Cajun-flavored recipe is for him on Father's Day Food & Recipes Gardening Homes Travel Fashion Pets Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat Should you let pets sleep next to you? (Does it even matter what the experts say?) He loved ribs more than anyone. This Cajun-flavored recipe is for him on Father's Day ReligionTOP STORIESMandatory military service for Israel's ultra-Orthodox tests Netanyahu's ruleMore than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials sayPope Leo XIV names first Chinese bishop, signalling he is continuing Vatican's controversial accordNewslettersWorld of FaithComprehensive global coverage of how religion shapes our world.See All Newsletters Mandatory military service for Israel's ultra-Orthodox tests Netanyahu's rule More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Pope Leo XIV names first Chinese bishop, signalling he is continuing Vatican's controversial accord Mandatory military service for Israel's ultra-Orthodox tests Netanyahu's rule More than 55,000 Palestinians have been killed in the Israel-Hamas war, Gaza health officials say Pope Leo XIV names first Chinese bishop, signalling he is continuing Vatican's controversial accord EspañolTOP STORIESArrestan a más de 20 personas tras primera noche de toque de queda por protestas en Los ÁngelesAgentes de inmigración de EEUU intensifican arrestos en juzgados para acelerar deportacionesProtestas por redadas migratorias surgen en todo EEUU; hay más planeadasSoldados de la Guardia Nacional detienen temporalmente a civiles en protestas de LA, dice comandanteHegseth defiende uso de tropas para proteger redadas de inmigración en Los Ángeles Arrestan a más de 20 personas tras primera noche de toque de queda por protestas en Los Ángeles Agentes de inmigración de EEUU intensifican arrestos en juzgados para acelerar deportaciones Protestas por redadas migratorias surgen en todo EEUU; hay más planeadas Soldados de la Guardia Nacional detienen temporalmente a civiles en protestas de LA, dice comandante Hegseth defiende uso de tropas para proteger redadas de inmigración en Los Ángeles Arrestan a más de 20 personas tras primera noche de toque de queda por protestas en Los Ángeles Agentes de inmigración de EEUU intensifican arrestos en juzgados para acelerar deportaciones Protestas por redadas migratorias surgen en todo EEUU; hay más planeadas Soldados de la Guardia Nacional detienen temporalmente a civiles en protestas de LA, dice comandante Hegseth defiende uso de tropas para proteger redadas de inmigración en Los Ángeles Standards Quizzes Press Releases My Account The Associated Press is an independent global news organization dedicated to factual reporting. Founded in 1846, AP today remains the most trusted source of fast, accurate, unbiased news in all formats and the essential provider of the technology and services vital to the news business. More than half the world’s population sees AP journalism every day. twitterinstagramfacebook twitter instagram facebook twitter instagram facebook The Associated Pressap.orgCareersAdvertise with usContact UsAccessibility StatementTerms of UsePrivacy PolicyCookie SettingsDo Not Sell or Share My Personal InformationLimit Use and Disclosure of Sensitive Personal InformationCA Notice of Collection ap.org Careers Advertise with us Contact Us Accessibility Statement Terms of Use Privacy Policy Cookie Settings Do Not Sell or Share My Personal Information Limit Use and Disclosure of Sensitive Personal Information CA Notice of Collection ap.org Careers Advertise with us Contact Us Accessibility Statement Terms of Use Privacy Policy Cookie Settings Do Not Sell or Share My Personal Information Limit Use and Disclosure of Sensitive Personal Information CA Notice of Collection More From AP NewsAboutAP News Values and PrinciplesAP’s Role in ElectionsAP LeadsAP Definitive Source BlogAP Images Spotlight BlogAP Stylebook About AP News Values and Principles AP’s Role in Elections AP Leads AP Definitive Source Blog AP Images Spotlight Blog AP Stylebook About AP News Values and Principles AP’s Role in Elections AP Leads AP Definitive Source Blog AP Images Spotlight Blog AP Stylebook The Associated Pressap.orgCareersAdvertise with usContact UsAccessibility StatementTerms of UsePrivacy PolicyCookie SettingsDo Not Sell or Share My Personal InformationLimit Use and Disclosure of Sensitive Personal InformationCA Notice of Collection ap.org Careers Advertise with us Contact Us Accessibility Statement Terms of Use Privacy Policy Cookie Settings Do Not Sell or Share My Personal Information Limit Use and Disclosure of Sensitive Personal Information CA Notice of Collection ap.org Careers Advertise with us Contact Us Accessibility Statement Terms of Use Privacy Policy Cookie Settings Do Not Sell or Share My Personal Information Limit Use and Disclosure of Sensitive Personal Information CA Notice of Collection More From AP NewsAboutAP News Values and PrinciplesAP’s Role in ElectionsAP LeadsAP Definitive Source BlogAP Images Spotlight BlogAP StylebookSECTIONSAboutAP News Values and PrinciplesAP’s Role in ElectionsAP LeadsAP Definitive Source BlogAP Images Spotlight BlogAP Stylebook About AP News Values and Principles AP’s Role in Elections AP Leads AP Definitive Source Blog AP Images Spotlight Blog AP Stylebook About AP News Values and Principles AP’s Role in Elections AP Leads AP Definitive Source Blog AP Images Spotlight Blog AP Stylebook Copyright 2025 The Associated Press. All Rights Reserved. Copyright 2025 The Associated Press. All Rights Reserved. Copyright 2025 The Associated Press. All Rights Reserved. BTS members Jimin and Jung Kook are discharged from South Korea’s military after completing service **BTS members Jimin and Jung Kook are discharged from South Korea’s military after completing service** Facebook CopyLink copied Print Email X LinkedIn Bluesky Flipboard Pinterest Reddit The Associated Pressap.orgCareersAdvertise with usContact UsAccessibility StatementTerms of UsePrivacy PolicyCookie SettingsDo Not Sell or Share My Personal InformationLimit Use and Disclosure of Sensitive Personal InformationCA Notice of Collection ap.org Careers Advertise with us Contact Us Accessibility Statement Terms of Use Privacy Policy Cookie Settings Do Not Sell or Share My Personal Information Limit Use and Disclosure of Sensitive Personal Information CA Notice of Collection ap.org Careers Advertise with us Contact Us Accessibility Statement Terms of Use Privacy Policy Cookie Settings Do Not Sell or Share My Personal Information Limit Use and Disclosure of Sensitive Personal Information CA Notice of Collection More From AP NewsAboutAP News Values and PrinciplesAP’s Role in ElectionsAP LeadsAP Definitive Source BlogAP Images Spotlight BlogAP Stylebook About AP News Values and Principles AP’s Role in Elections AP Leads AP Definitive Source Blog AP Images Spotlight Blog AP Stylebook About AP News Values and Principles AP’s Role in Elections AP Leads AP Definitive Source Blog AP Images Spotlight Blog AP Stylebook The Associated Pressap.orgCareersAdvertise with usContact UsAccessibility StatementTerms of UsePrivacy PolicyCookie SettingsDo Not Sell or Share My Personal InformationLimit Use and Disclosure of Sensitive Personal InformationCA Notice of Collection ap.org Careers Advertise with us Contact Us Accessibility Statement Terms of Use Privacy Policy Cookie Settings Do Not Sell or Share My Personal Information Limit Use and Disclosure of Sensitive Personal Information CA Notice of Collection ap.org Careers Advertise with us Contact Us Accessibility Statement Terms of Use Privacy Policy Cookie Settings Do Not Sell or Share My Personal Information Limit Use and Disclosure of Sensitive Personal Information CA Notice of Collection More From AP NewsAboutAP News Values and PrinciplesAP’s Role in ElectionsAP LeadsAP Definitive Source BlogAP Images Spotlight BlogAP StylebookSECTIONSAboutAP News Values and PrinciplesAP’s Role in ElectionsAP LeadsAP Definitive Source BlogAP Images Spotlight BlogAP Stylebook About AP News Values and Principles AP’s Role in Elections AP Leads AP Definitive Source Blog AP Images Spotlight Blog AP Stylebook About AP News Values and Principles AP’s Role in Elections AP Leads AP Definitive Source Blog AP Images Spotlight Blog AP Stylebook Copyright 2025 The Associated Press. All Rights Reserved. twitter instagram facebook"}