{"id": 670, "name": "Santa Barbara Independent", "domain": "independent.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.independent.com/2025/06/11/grace-housing-inc-announces-15-local-nonprofits-receiving-funds-during-its-10th-annual-grant-recipient-reception-organization-has-deep-legacy-of-local-charitable-work-since-1902/", "title": "Grace Housing Inc Announces 15 Local Nonprofits Receiving Funds During Its 10th Annual Grant Recipient Reception Organization Has Deep Legacy Of Local Charitable Work Since 1902", "content": "News Arts & Entertainment Living Best of Santa Barbara® 2024 Food & Drink Opinion Events Sports Obituaries Real Estate Indy Parenting Extra! Classifieds Home News Got a Scoop? Arts & Entertainment Santa Barbara Live Music Venues Living Food & Drink Opinion Events Sports Obituaries Real Estate Indy Parenting Cover Stories Extra! Best of Santa Barbara® 2024 Wedding Santa Barbara Green Guide Classifieds Advertise About Us Contact Us Create Event Subscribe **Grace Housing, Inc. Announces 15 Local Nonprofits Receiving Funds During its 10th Annual Grant Recipient Reception Organization has Deep Legacy of Local Charitable Work, Since 1902** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print Press releases are posted on Independent.com as a free community service. Santa Barbara, CA, June 10, 2025— Grace Housing Inc. (GHI) announces 15 grant recipients at its10th Annual Grant Recipient ReceptiononTuesday, June 10thatGrace Village Apartments. The reception celebrates the 2025 recipients of Grace Housing Inc.’s charitable grants, which empower local organizations to meet the community’s most urgent needs. Since its inception in 2015, GHI has distributedover $1.25 million in charitable grants, continuing the legacy of service established by Grace Lutheran Church, which donated the land that made this mission possible. Grace Housing Inc. operates with a commitment to sustaining and expanding the impact of Grace Lutheran’s charitable work. Beyond managing affordable housing properties, GHI actively seeks to fund initiatives that address Santa Barbara’s community needs. Its charitable grant program supports organizations focused on essential services, including food security, healthcare access, and housing solutions for vulnerable populations. By reinvesting rental income from its properties, Grace Housing Inc. maintains a steady source of funding that ensures long-term support for Santa Barbara’s most pressing social challenges. Prior to the establishment of Grace Housing, Inc. Grace Lutheran Church and its congregation has always had the vision of continued service to others, beginning as a small but dedicated group in the early 1900s with a mission to provide food for the hungry, shelter for people who are homeless, and supportive services for low income families, individuals and seniors. Through its partnership with the Housing Authority of the City of Santa Barbara and California Lutheran Homes, Grace Housing Inc. has developed an ever-growing fund dedicated to future affordable housing projects in the greater Santa Barbara community. This year,15 nonprofitsreceived a total of$148,000in funding, with individual grants ranging from $5,000 to $25,000. Transition Houseserves homeless families through shelter, housing and support. Grace was one of the 5 original congregations that housed Transition House for about 2 years until the agency was able to get a permanent site. Grace Food Pantryprovides food to individuals and families. The weekly pantry was started by Grace as a Saturday food distribution program in the early 80s before we had a local food bank. The program continues onsite at Grace Village and is administered by Trinity Lutheran Church. Grace Village Fund (Second Story)is a growing fund held for the development of future low-income senior housing. SW California Synod, ELCA– providing supportive services in the greater Santa Barbara community Habitat for Humanity– Grace Lutheran was one of the sponsoring agencies bringing a Habitat chapter to Santa Barbara. Habitat helps families build and improve places to call home. Society of Saint Vincent de Paul– provides short-term income and support for unexpected and needed services for very low-income people Second Story-Provides financial support to senior residents in Housing Authority properties like Grace Village for needed services or supportive services. Santa Barbara Food Bank– Provides healthy foods to families and individuals in need Trinity Gardens– Grows organic produce to help meet food needs in our local community Santa Barbara ACT FARO Centeris a daytime navigation center for persons experiencing homelessness Showers of Blessing– Provides free hot showers and hygiene products for persons experiencing homelessness Food for the Kitchen-less– Provides bags of food to persons experiencing homelessness and who do not have a place to cook their food. Good Samaritan Shelter– Provides the community with programs that address homelessness as well as alcohol and substance abuse Doctors Without Walls– Provides free volunteer medical care to people living on the streets of our community New Beginnings, Safe Parking– Provides Safe Parking and rapid rehousing to persons living in their vehicles. Grace Housing Inc. was founded to steward the charitable legacy ofGrace Lutheran Church, a long-standing Santa Barbara faith community that prioritized service and social good. When the church transitioned out of regular worship services, its leadership made a transformational gift—donating landto theHousing Authority of the City of Santa Barbara. Grace Village is a 58-unit affordable senior housing community created on the donated land. Opened in partnership with the Housing Authority of the City of Santa Barbara, it provides safe, supportive homes for low-income seniors. Today, Grace Housing Inc., in coordination with California Lutheran Homes and the Housing Authority for the City of Santa Barbara, manages its remaining properties and business tenancies, using the rental income togenerate annual charitable grantsto organizations serving vulnerable populations in Santa Barbara County and a designated fund for future low-income housing in our community.. Through this innovative model, GHI continues to honor the mission of Grace Lutheran Church—supporting dignity, shelter, food security, and community connection creating a living legacy of faith that keeps giving.. For more information about Grace Housing Inc., visithttp://www.gracehousinginc.comor contact: Pat Wheatley, GHI Board Member – (805) 896-0693 **Login** Please note this login is to submit events or press releases. Use this pagehereto login for your Independent subscription Username or Email Address Password Remember Me Not a member? Sign uphere. News Arts & Entertainment Living Food & Drink Opinion Promote Event Sports Events Real Estate Indy Parenting Cover Story Extra! About Us Contact Us Submit Press Release Obituaries Classifieds Advertise Promote Events Create Event Create Obituary Submit Letter Admin Login FOLLOW US ON NEWSLETTER SIGN UP Copyright ©2025 Santa Barbara Independent, Inc. Reproduction of material from any Independent.com pages without written permission is strictly prohibited. If you believe an Independent.com user or any material appearing on Independent.com is copyrighted material used without proper permission, pleaseclick here. Site byTrew Knowledge.Powered byWordPress VIP. **** **** You must belogged into post a comment. ****"}