{"id": 1083, "name": "Park Record", "domain": "parkrecord.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.parkrecord.com/2025/06/10/parkites-alex-hall-and-quinn-dehlinger-among-first-u-s-skiers-to-qualify-for-2026-olympics/", "title": "Parkites Alex Hall And Quinn Dehlinger Among First U S Skiers To Qualify For 2026 Olympics", "content": "SUBSCRIBE NewsOpen dropdown menuPark CitySummit CountyWasatch CountyBusinessEducationSponsoredObituariesCelebrations Park City Summit County Wasatch County Business Education Sponsored Obituaries Celebrations Park City Summit County Wasatch County Business Education Sponsored Obituaries Celebrations SportsOpen dropdown menuOlympics Olympics Olympics EntertainmentOpen dropdown menuSundance/SlamdanceCalendarAdd an Event Sundance/Slamdance Calendar Add an Event Sundance/Slamdance Calendar Add an Event OpinionOpen dropdown menuOur ViewColumnsLettersSubmit a Letter Our View Columns Letters Submit a Letter Our View Columns Letters Submit a Letter MagazinesOpen dropdown menuAdventure GuideShop, Dine, PlayMile PostPark City’s BestPark City HomePark City ParentMagazine Archives Adventure Guide Shop, Dine, Play Mile Post Park City’s Best Park City Home Park City Parent Magazine Archives Adventure Guide Shop, Dine, Play Mile Post Park City’s Best Park City Home Park City Parent Magazine Archives ClassifiedsOpen dropdown menuView All ClassifiedsView Job PostingsPlace Classified AdPlace a LegalPlace Celebration View All Classifieds View Job Postings Place Classified Ad Place a Legal Place Celebration View All Classifieds View Job Postings Place Classified Ad Place a Legal Place Celebration Real Estate Monthly Buy Photos E-Edition Submissions Advertise Facebook Instagram X E-Edition Submissions Advertise Facebook Instagram X Park Record Park City and Wasatch Back News SUBSCRIBE NewsOpen dropdown menuPark CitySummit CountyWasatch CountyBusinessEducationSponsoredObituariesCelebrations Park City Summit County Wasatch County Business Education Sponsored Obituaries Celebrations Park City Summit County Wasatch County Business Education Sponsored Obituaries Celebrations SportsOpen dropdown menuOlympics Olympics Olympics EntertainmentOpen dropdown menuSundance/SlamdanceCalendarAdd an Event Sundance/Slamdance Calendar Add an Event Sundance/Slamdance Calendar Add an Event OpinionOpen dropdown menuOur ViewColumnsLettersSubmit a Letter Our View Columns Letters Submit a Letter Our View Columns Letters Submit a Letter MagazinesOpen dropdown menuAdventure GuideShop, Dine, PlayMile PostPark City’s BestPark City HomePark City ParentMagazine Archives Adventure Guide Shop, Dine, Play Mile Post Park City’s Best Park City Home Park City Parent Magazine Archives Adventure Guide Shop, Dine, Play Mile Post Park City’s Best Park City Home Park City Parent Magazine Archives ClassifiedsOpen dropdown menuView All ClassifiedsView Job PostingsPlace Classified AdPlace a LegalPlace Celebration View All Classifieds View Job Postings Place Classified Ad Place a Legal Place Celebration View All Classifieds View Job Postings Place Classified Ad Place a Legal Place Celebration Real Estate Monthly Buy Photos **Parkites Alex Hall and Quinn Dehlinger among first U.S. skiers to qualify for 2026 Olympics** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Tuesday morning, the Stifel U.S. Ski Team announced the first four athletes to qualify for the 2026 Olympic team: Parkite freeskier Alex Hall, Parkite freestylist Quinn Dehlinger, freeskier Alex Ferreira and freestylist Jaelin Kauf. Hall, Ferreira and Kauf all have Olympic medals to their names, while it’s Dehlinger’s first Games. The four skiers secured their spots by ranking as the top American among the top three athletes on the2026 FIS Base List, based on their 2024-25 season results. Hall and Ferreira took the top spots in slopestyle and halfpipe, respectively, and Kauf took the top spot in moguls, dual moguls and overall after the best season of her career. Dehlinger finished third following his World Championships success. Ferreira seeks third Olympic medal After winning every contest he entered in the 2023-24 season and finishing last season in the top spot of the FIS Base List, Ferreira kept the momentum going in 2024-25 to secure his Olympic spot. He ended the season of seven events with two victories and seven podiums, with his biggest victory this season at the Toyota U.S. Grand Prix in his hometown of Aspen, Colorado. He also went on to place third at the World Championships in Engadin, Switzerland, his second consecutive World Championships medal. Ferreira has been on the podium at every FIS event since January 2023 — 13 and counting. His dominance led to his second consecutive halfpipe Crystal Globe. “It means the world to be prequalified for the Olympics,” said Ferreira, who holds two halfpipe medals from the 2018 and 2022 Olympic Games. “It’s a huge weight off my shoulders. Usually I’m coming in, skidding in, to the very last spot. So, to be the first person on the team is really, really rewarding. I worked extremely hard for it, and I’m grateful to have a more tranquil incoming to the Games. I’m ecstatic. Milano Cortina is going to be a great competition, probably the best competition ever hosted and definitely the highest level of progression thus far. I’m going to give it my all, and I’m excited to battle it out with everyone.” Hall aims for slopestyle defense Defending 2022 slopestyle gold medalist Alex Hall also secured his spot in Milano Cortina to return for his third Olympic Games in both slopestyle and big air. He finished the 2023-24 season with the big air Crystal Globe and successfully refocused his sights on slopestyle for 2024-25, winning two World Cups, a World Championship medal and the slopestyle Crystal Globe. Hall has 16 World Cup podiums in eight years of competition. “I’m super stoked to qualify for Milano Cortina a year early,” said Hall. “I had a great season and ended up winning the slopestyle Crystal Globe, so it felt really good to lock in my spot that way. I’m looking forward to the Olympics in Italy. I think it’s going to be sweet. My mom is Italian, so it’s going to feel a bit like a home Olympics for me as well. It will be amazing over there.” Kauf’s road to the Games Kauf quickly rebounded from a tough start to the 2024-25 season. In Bakuriani, Georgia, in mid-December, Kauf landed on her first podium of the season, kicking off a season-long podium streak of 14 consecutive. Eight of those 14 podiums were wins, nearly doubling her career win count in one year. Kauf won all three FIS Freestyle Crystal Globes — moguls, dual moguls and the overall, becoming the first American to win a freestyle globe since 2015. Kauf also had a great showing at the 2025 FIS Freestyle World Championships in St. Moritz, Switzerland, earning the title of 2025 dual moguls world champion. Kauf returns to the Games as the 2022 Olympic silver medalist in moguls, and this time around, she’ll also have the opportunity to compete in dual moguls, newly added to the Olympic schedule for 2026. “It’s super crazy to be qualified for the Olympics already” said Kauf. “(There is) still a whole lot of work to be put in before then, but it’s a bit of a weight off, especially with how insanely good this women’s team is. It’s also been a dream to compete dual moguls at the Olympics for a long time, so I am extra excited to be a part of the sport’s Olympic debut this time around!” Dehlinger’s first Olympic team After an injury took Dehlinger out for most of the 2023-24 season, he was determined to come back stronger than ever. As soon as he was cleared, he was back on the water ramps getting his difficulty up to where it needed to be to return to the World Cup circuit. The season was filled with highs and lows as he returned to competition, including Dehlinger’s first-ever win on home snow at the 2025 Intermountain Health Freestyle International presented by Stifel. After finishing the World Cup season ranked sixth in the world, Dehlinger had something to prove heading into World Championships. Dehlinger entered the competition as the reigning champion in aerials team and the 2023 aerials silver medalist. Dehlinger helped lead the team to a second consecutive aerials team gold, becoming the first nation to ever earn back-to-back titles. Two days later, Dehlinger stomped some of the best jumps of his life to land on the podium again in individual silver medal position. Every time Dehlinger has started at a World Championships event, he has finished on the podium. These results were just what Dehlinger needed to move up into the top three in the world, clinching his spot on his first Olympic team. “Making the Olympic team is a dream come true,” said Dehlinger. “I’ve dreamed of going to the Olympics since I was a little boy. To have qualified for the 2026 Olympics brings me joy that words can’t describe!” The remaining Olympic spots for freestyle and freeski will be filled based on upcoming World Cup events throughout the 2025-26 FIS Freestyle World Cup season. For full 2026 Olympic criteria, visitusskiandsnowboard.org. **Related Stories** News (35,958) Entertainment (7,450) Sports (6,738) Park City (6,211) Summit County (5,881) home (2,799) park city (780) Coronavirus (480) park city high school (392) photography (253) 2025 (2,070) 2024 (4,389) 2023 (3,082) 2022 (2,137) 2021 (2,417) Park City HomeSummer 2025 **Park Record E-Edition** Facebook Instagram X The Park Record newspaper publishes twice weekly in Park City, Utah, and has been serving the Wasatch Back since 1880. **Marketplace** Jobs Work for us Rentals Place A Classified Classifieds Place Legal Ad Search Legal Ads **Reader Tools** Subscribe E-Edition Contact Us Archives Submit an Obituary Submit a Letter Submit an Event Advertise About Us Terms of Use Terms and Conditions"}