{"id": 1688, "name": "The Defender", "domain": "childrenshealthdefense.org/defender", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://childrenshealthdefense.org/defender/their-babies-died-suddenly-sleep-police-charging-parents-felonies-not-placing-infants-backs/", "title": "Their Babies Died Suddenly Sleep Police Charging Parents Felonies Not Placing Infants Backs", "content": "Twitter Telegram Rumble Home Defender News CHD.TV Resources Community Science Litigation About Shop Donate Free Signup Twitter Telegram Rumble Explore The DefenderThe DefenderAbout The DefenderThe Defender StaffRFK Jr: Why The Defender The Defender About The Defender The Defender Staff RFK Jr: Why The Defender The Defender About The Defender The Defender Staff RFK Jr: Why The Defender CategoriesCOVIDHealth ConditionsToxic ExposuresCensorship/SurveillanceAgency CaptureGlobal ThreatsScienceLegal COVID Health Conditions Toxic Exposures Censorship/Surveillance Agency Capture Global Threats Science Legal COVID Health Conditions Toxic Exposures Censorship/Surveillance Agency Capture Global Threats Science Legal Explore CHD.TVCHD.TVSearch CHD.TVGet Alerts CHD.TV Search CHD.TV Get Alerts CHD.TV Search CHD.TV Get Alerts ArchiveShowsEventsMoviesThe People’s Study Shows Events Movies The People’s Study Shows Events Movies The People’s Study Explore Our ResourcesVaccinesAutismSelf-Help ResourcesArticles, Brochures, & FlyersCHD StoreSpeakers BureauCHD in the MediaI Wish I Had Known Vaccines Autism Self-Help Resources Articles, Brochures, & Flyers CHD Store Speakers Bureau CHD in the Media I Wish I Had Known Vaccines Autism Self-Help Resources Articles, Brochures, & Flyers CHD Store Speakers Bureau CHD in the Media I Wish I Had Known CHD BookstoreVax-Unvax: Let the Science SpeakThe Wuhan Cover-up Vax-Unvax: Let the Science Speak The Wuhan Cover-up Vax-Unvax: Let the Science Speak The Wuhan Cover-up CHD FilmsVaxxed III: Authorized To KillMedical Racism: The New ApartheidInfertility: A Diabolical Agenda Vaxxed III: Authorized To Kill Medical Racism: The New Apartheid Infertility: A Diabolical Agenda Vaxxed III: Authorized To Kill Medical Racism: The New Apartheid Infertility: A Diabolical Agenda eBooksA Parents’ Guide to Healthy Children A Parents’ Guide to Healthy Children A Parents’ Guide to Healthy Children Explore CommunityOverviewCommunity ForumCommunity News & ViewsChaptersCalendarTake Action Overview Community Forum Community News & Views Chapters Calendar Take Action Overview Community Forum Community News & Views Chapters Calendar Take Action Advocacy ResourcesPlan a WalkoutPrevent MandatesEMR AdvocacyHealth FreedomInfluence Public Health Policy Plan a Walkout Prevent Mandates EMR Advocacy Health Freedom Influence Public Health Policy Plan a Walkout Prevent Mandates EMR Advocacy Health Freedom Influence Public Health Policy Action AlertsFind Your CandidatesFind LegislationFind Your Legislators Find Your Candidates Find Legislation Find Your Legislators Find Your Candidates Find Legislation Find Your Legislators Explore the Science SectionScience OverviewWatch Doctors & ScientistsRead Vax-UnvaxCurrent ProjectsRecent PublicationsAbout Us Science Overview Watch Doctors & Scientists Read Vax-Unvax Current Projects Recent Publications About Us Science Overview Watch Doctors & Scientists Read Vax-Unvax Current Projects Recent Publications About Us Science LibraryThe Covid IndexResearch DatabaseScientific CritiquesScience DigestMercury, Thimerosal & AutismSilenced & CensoredChronic Health Conditions The Covid Index Research Database Scientific Critiques Science Digest Mercury, Thimerosal & Autism Silenced & Censored Chronic Health Conditions The Covid Index Research Database Scientific Critiques Science Digest Mercury, Thimerosal & Autism Silenced & Censored Chronic Health Conditions VaccinesVaccines 101Vaccine Secrets7 Steps To Vaccine SafetyVaccine Safety ProjectI Wish I Had KnownMMR Vaccine & Measles Fact SheetGet The Facts: Vaccine Risk Resources Vaccines 101 Vaccine Secrets 7 Steps To Vaccine Safety Vaccine Safety Project I Wish I Had Known MMR Vaccine & Measles Fact Sheet Get The Facts: Vaccine Risk Resources Vaccines 101 Vaccine Secrets 7 Steps To Vaccine Safety Vaccine Safety Project I Wish I Had Known MMR Vaccine & Measles Fact Sheet Get The Facts: Vaccine Risk Resources Electromagnetic RadiationNewsEMR & Wireless LitigationEducationAdvocacyFAQsKey Terms & Descriptions News EMR & Wireless Litigation Education Advocacy FAQs Key Terms & Descriptions News EMR & Wireless Litigation Education Advocacy FAQs Key Terms & Descriptions Explore LitigationLitigation OverviewImmediate ThreatsLegal ActionsNewsEMR & Wireless LitigationFOIASelf Help Resources Litigation Overview Immediate Threats Legal Actions News EMR & Wireless Litigation FOIA Self Help Resources Litigation Overview Immediate Threats Legal Actions News EMR & Wireless Litigation FOIA Self Help Resources Learn The LawLaw 101Key FactsFAQs Law 101 Key Facts FAQs Law 101 Key Facts FAQs About Children’s Health DefenseLeadership TeamDefender StaffScience StaffOur MissionHistory of CHDRobert F. Kennedy Jr. Leadership Team Defender Staff Science Staff Our Mission History of CHD Robert F. Kennedy Jr. Leadership Team Defender Staff Science Staff Our Mission History of CHD Robert F. Kennedy Jr. More from CHDSpeakers BureauCHD in the MediaCHD StorePress ReleasesWork for CHD Speakers Bureau CHD in the Media CHD Store Press Releases Work for CHD Speakers Bureau CHD in the Media CHD Store Press Releases Work for CHD Health ConditionsAll Health ConditionsADHDAsthmaAutismAutoimmune DiseaseBird FluCOVIDInfertilityMeaslesObesity All Health Conditions ADHD Asthma Autism Autoimmune Disease Bird Flu COVID Infertility Measles Obesity All Health Conditions ADHD Asthma Autism Autoimmune Disease Bird Flu COVID Infertility Measles Obesity Toxic ExposuresAll Toxic Exposures5G/EMRBig FoodChemicalsFluorideHeavy MetalsPesticidesPharmaceuticalsVaccines All Toxic Exposures 5G/EMR Big Food Chemicals Fluoride Heavy Metals Pesticides Pharmaceuticals Vaccines All Toxic Exposures 5G/EMR Big Food Chemicals Fluoride Heavy Metals Pesticides Pharmaceuticals Vaccines PolicyAll PolicyAgricultural PolicyEnvironmental PolicyFood PolicyHealth Policy All Policy Agricultural Policy Environmental Policy Food Policy Health Policy All Policy Agricultural Policy Environmental Policy Food Policy Health Policy Censorship/SurveillanceAll Censorship/SurveillanceArtificial IntelligenceBiometricsDigital IDMediaFirst AmendmentVaccine Mandates All Censorship/Surveillance Artificial Intelligence Biometrics Digital ID Media First Amendment Vaccine Mandates All Censorship/Surveillance Artificial Intelligence Biometrics Digital ID Media First Amendment Vaccine Mandates Agency CaptureAll Agency CaptureCDCEPAFCCFDAFTCHHSNIHUSAIDUSDA All Agency Capture CDC EPA FCC FDA FTC HHS NIH USAID USDA All Agency Capture CDC EPA FCC FDA FTC HHS NIH USAID USDA Global ThreatsAll Global ThreatsBill Gates/Gates FoundationBioweaponsGain-of-FunctionUnited NationsWEFWHO All Global Threats Bill Gates/Gates Foundation Bioweapons Gain-of-Function United Nations WEF WHO All Global Threats Bill Gates/Gates Foundation Bioweapons Gain-of-Function United Nations WEF WHO Science Legal AboutAbout The DefenderThe Defender StaffRFK Jr: Why The Defender About The Defender The Defender Staff RFK Jr: Why The Defender About The Defender The Defender Staff RFK Jr: Why The Defender Search **Toxic Exposures** **Their Babies Died Suddenly in Their Sleep. Police Are Charging the Parents With Felonies for Not Placing Infants on Their Backs** Pennsylvania authorities brought felony charges against the parents of two different babies after police said the infants died because the parents placed them in unsafe sleeping positions, SpotlightPA reported. The deaths were ruled accidental, but police allege the parents failed to follow “Safe to Sleep” guidance, which states that babies should be put to sleep on their backs. Photo credit: David Strause GoFundMe page. Share Options Copy Link Email Facebook X(Twitter) Telegram LinkedIn Parents of two different babies are being charged with felonies in Pennsylvania after police say their babies died because the parents placed them in unsafe sleeping positions,SpotlightPA reported. In both cases, police allege that the parents failed to follow guidance, including handouts given to them at doctor’s visits, stating that babies should be put to sleep on their backs. GinaandDavid Strauseof Lebanon County are accused of putting their 3-month-old infant son, Gavin, to sleep on his stomach and allowing him to sleep with stuffed animals in the crib. They are charged with involuntary manslaughter, recklessly endangering another person, and endangering the welfare of children. Natalee Rasmus of Luzerne County is accused of putting her 1-month-old daughter, Avaya Jade Rasmus-Alberto, to sleep on her stomach on aboppy pillow, often used for nursing. She ischargedwith third-degree murder, involuntary manslaughter and endangering the welfare of children. Rasmus was a 17-year-old mother when her daughter died in 2022. Court records show that she continues to be held at the Luzerne County Correctional Facility with bail set at $25,000 pending resolution of her case. In both cases, autopsiesconcludedthe babies died of accidental death from asphyxiation. Law enforcement argued in both cases that parents should have known that putting the babies to sleep on their stomachs was unsafe, because they had received paperwork at wellness visits informing them of safe sleeping practices. They pointed to signedacknowledgementsin the babies’ medical records that were created as part of a 2010 statelawto educate parents about Sudden Infant Death Syndrome (SIDS). The law requires hospitals, birthing centers and medical providers to give parents educational materials from the nationalSafe to Sleep campaign, and ask them to certify that they received them. Signing the statement is voluntary. The statement doesn’t indicate that parents can be charged with a criminal offense if they don’t follow the campaign advice. Advocates from national organizations that educate parents about safe sleep practices found the charges shocking. Nancy Maruyama, the executive director ofSudden Infant Death Services of IllinoistoldSpotlight PA, “To charge them criminally is a crime, because they have already suffered the worst loss.” Alison Jacobson, executive director ofFirst Candle, a nonprofit that also educates parents about safe sleep practices, toldPennlive,“There is no law against placing a baby on his or her stomach to sleep. How they can charge this family with involuntary manslaughter is completely baffling to me.” ResearcherNeil Z. Miller, an expert on SIDS and the Safe to Sleep campaign, told The Defender, “Parents of a sleeping baby who dies in the middle of the night should never be charged with murder. That’s just cruel.” Miller, author of “Vaccines: Are They Really Safe and Effective?” added: “Should parents be obligated to follow every ‘recommendation’ made by their doctor or the Safe to Sleep campaign? Would we as a society prefer that doctors raise our babies instead of the parents? Have other possible causes of death been considered, such as vaccinations? As a society, we can, and must, do much better.” Does placing infants on their backs make a difference? The handouts shared with new Pennsylvania parents are based on the National Institutes of Health “Safe to Sleep” campaign, which institutionalized a program initiated by theAmerican Academy of Pediatrics(AAP) in 1992 to inform parents to put children to sleep on their backs rather than on their stomachs. The campaign is based on the premise that babies who sleep on their backs or sides are less likely to die in their sleep. Until that time, it was common for babies to sleep on their stomachs. The program was launched in the wake of a rising number of SIDS deaths — and growing concern among some parents that the deaths were linked to vaccination. In a 2021 article in the peer-reviewed journalToxicology Reports, vaccine researcherNeil Z. Millerprovides a history of the SIDS diagnosis, noting that the rise of SIDS coincided with the firstmass immunization campaigns. Between 1992, when the Safe to Sleep program launched, and 2001,SIDS deaths reportedly declineda whopping 55% — anumber toutedin articles celebrating the program, making it appear that babies sleeping on their stomachs was the cause of SIDS, not vaccines. However, at the same time deaths from SIDS decreased, the rate of mortality from “suffocation in bed,” “suffocation other,” “unknown and unspecified causes,” and “intent unknown” all increased significantly. Why? The classification system had changed. SIDS deaths were being reclassified by medical certifiers, usually coroners, as one of the other similar categories, not SIDS. Research published in the journalPediatrics, the AAP’s flagship journal, concluded that deaths previously certified as SIDs were simply being certified as other non-SIDS causes, such as suffocation — but the deaths were still essentially SIDS deaths. That change in classification accounted for more than 90% of the drop in SIDS rates. The Pediatrics paper showed no decline in overall postneonatal mortality after the Safe to Sleep campaign was launched, despite the program’s — and the AAP’s — claims to the contrary. Others verified the Pediatrics paper’s findings, and the trend continued, as reported bymultiple studiesintop journals. Miller reported that, for example, “From 1999 through 2015, the U.S. SIDS rate declined 35.8% while infant deaths due to accidental suffocation increased 183.8%.” Research shows that almost80% of SIDS deathsreported to the Vaccine Adverse Event Reporting System (VAERS) happen within seven days of vaccination. Theories linking vaccines to SIDS suggest that, in some cases,underdeveloped liver enzyme pathwaysmay make it harder for some infants to processtoxic ingredientsin vaccines. Others argue that other,multiple, complex factorscan make some infants vulnerable to toxic ingredients invaccines. Baby Gavin was ‘a dream come true’ On April 30, Gina and David Strause were charged with involuntary manslaughter, which carries a sentence of up to 10 years, and other lesser charges in the death of their son Gavin. According to thepolice report, Gina found her son unresponsive, cold and blue in his crib when she woke up to feed him on the morning of May 8, 2024. She immediately called 911 and performed CPR until the police arrived. The baby was pronounced dead at the hospital. The autopsy report found the cause of death to be “complications of asphyxia.” Police said they observed loose items in the crib, “such as blankets and stuffed animals.” Gina said that after feeding her baby at about 11:30 the night before he died, she placed him in his crib on his belly, because he was a “belly sleeper,” and covered him with a blanket. She said that she had received the recommendation that he should sleep on his back, but that he preferred to sleep on his stomach. In aninterview with Pennlive, Gina said that she typically put Gavin to sleep on his back, but he had gotten into the daily habit of rolling onto his belly. Davis Stause told police that when he left for work at 5:30 am, he checked on Gavin, who was sleeping on his stomach and moving around a little bit. David said he “patted his butt” to put him back to sleep. The police reported that they also obtained medical records from birth through death that showed that on the discharge paperwork that the parents received information about safe sleep practices, which included putting the baby on its back, having it sleep in the same room as the parents, and keeping the crib clear of bumper pads and stuffed animals. They said this paperwork explained how parents could create a safe sleeping environment for their babies to reduce the risk of SIDS. Baby Gavin also went to the pediatrician for well-child visits on Feb. 7 and 14, March 5 and April 9, a month before he died. Gina told Pennlive that Gavin, who was born when she was almost 40, was “a dream come true.” She had taken 10 weeks of maternity leave and largely worked at home to spend as much time with him as possible. She said that after she gave birth, she was “overwhelmed” and didn’t remember receiving any paperwork or instructions about sleep. Gina also said that at the hospital, police treated her and her husband with immediate suspicion, separating and questioning them. They were not allowed to see their baby again before he was taken by the coroner’s office. The parents created aGoFundMe page, where they shared a copy of the police report, to help cover their legal costs, because they said they do not qualify for a public defender. The Defenderattempted to contact the parents to inquire about the baby’s overall health, if he had any medical conditions, was born prematurely or had recently received any vaccines, but the parents did not respond by deadline. The district attorney’s office also did not respond to requests for comment. ‘Tragic accident with no criminal intent to harm or kill the baby’ The forensic pathologist who performed the autopsy for Natalee Rasmus’ baby listed the cause of death as accidental. According to the report, the baby died from asphyxiation, theTimes Leader reported. Rasmus discovered her baby had died on the morning of Oct. 23, 2022, when she picked her up to get her ready for a doctor’s appointment. Pennsylvania State Police in December charged Rasmus, alleging that she placed her baby face down to sleep against the recommendations of medical personnel and prenatal classes at Geisinger Wyoming Valley Medical Center. At a preliminary hearing on the case in February, a state trooper testified that Rasmus ignored safe sleeping practices because she had placed her baby face down in her bassinet with a Boppy pillow, which has a tag warning, “Do not use for sleeping.” The trooper, Caroline Rayeski, also testified that a search of Rasmus’ cellphone found that she had searched the internet to see whether it was ok to allow newborns to sleep on their stomachs. The trooper also seized literature from the prenatal classes stating it is “recommended” to put newborns to sleep on their backs. “Yeah, she wouldn’t sleep, she’ll just scream, so she has to be like propped up,” Rasmus told the investigating officer, according toSpotlight PA, which reported the story. Assistant attorneys argued in a preliminary hearing that she disregarded safe sleeping practices, and a judge forwarded the criminal case to county court. Rasmus is being represented by public defenders Joseph Yeager and Melissa Ann Sulima, who told the Times Leader the baby’s death was “a tragic accident with no criminal intent to harm or kill the baby.” Yeager said the prenatal literature referring to newborn sleep positions are “recommendations,” not mandates. “As the death certificate says, it was an accident. Clearly, there was no malice in this accidental death,” said Yeager, who also said the case should be dismissed. Rasmus’ most serious charge, third-degree murder, is a homicide that involves killing someone without intent to kill, but with reckless disregard for human life. In Pennsylvania, it can carry a prison sentence ofup to 40 years. Court documents indicatethat Rasmus remains in jail with a $25,000 bail, pending the outcome of her case. Neither the district attorney nor Rasmus’ attorneys responded to The Defender’s request for comment. This article was funded by critical thinkers like you.The Defender is 100% reader-supported. No corporate sponsors. No paywalls. Our writers and editors rely on you to fund stories like this that mainstream media won’t write.Please Donate Today **This article was funded by critical thinkers like you.** The Defender is 100% reader-supported. No corporate sponsors. No paywalls. Our writers and editors rely on you to fund stories like this that mainstream media won’t write. Please Donate Today **This article was funded by critical thinkers like you.** The Defender is 100% reader-supported. No corporate sponsors. No paywalls. Our writers and editors rely on you to fund stories like this that mainstream media won’t write. Please Donate Today How common is it to bring criminal charges against parents in infant deaths? Attorney Daniel Nevins toldSpotlightPAsaid it is extremely rare for parents to be criminally charged when infants die after sleeping on their stomachs, and that the burden of proof on the prosecutors will be high. In 2014, Virginia resident Candice Christa Semidey, age 25, was charged with murder after she swaddled her baby and put it to sleep on its stomach,The Washington Post reported. In that case, police similarly did not think that she intended for the baby to die. Shepleaded guiltyto involuntary manslaughter and child neglect. She was ordered to serve three years of probation to avoid thefive-year prison termshe was sentenced to. Somechargeshave also been brought againstparentsin deaths of infants sleeping with Boppy pillows. There have also been severalcasesofparents chargedfor sleeping in thesame bedas their child. The Defender recently reported on three SIDS deaths that occurred shortly after vaccination. Police are still investigating the parents of18-month-old twins who diedtogether a week after receiving three vaccines. Authorities have not yet charged the parents, but initially said they were investigating the deaths as homicides. Blessings Myrical Jean Simmons, age 6 months, receivedsix routine vaccinesat a well-baby visit on Jan. 13. The next morning, her parents found the baby dead in her bassinet. The autopsy SIDS as the infant’s cause of death, and no charges were filed against the parents. Media Slam NIH for Axing ‘Safe to Sleep’ Campaign — But Evidence Shows the Program Never Reduced SIDS Deaths ‘Double Tragedy’: Twins’ Deaths Likely Caused by Vaccines, Not Parents Police Detective: 50% of Sudden Infant Deaths Happened Within 48 Hours of Vaccination — But No One Is Allowed to Say It Brenda Baletti, Ph.D., is a senior reporter for The Defender. She wrote and taught about capitalism and politics for 10 years in the writing program at Duke University. She holds a Ph.D. in human geography from the University of North Carolina at Chapel Hill and a master's from the University of Texas at Austin. Categories:Death,Health Conditions,Toxic Exposures,Vaccines,Vaccines Tags:Childhood Vaccination Schedule,Children's Health,Infant Death,Sudden Infant Death Syndrome - SIDS Share Options Copy Link Email Facebook X(Twitter) Telegram LinkedIn **Republish Article** Please use the HTML above to republish this article. It is pre-formatted to follow ourrepublication guidelines. Among other things, these require that the article not be edited; that the author’s byline is included; and that The Defender is clearly credited as the original source. Please visit ourfull guidelinesfor more information. By republishing this article, you agree to these terms. Get The Defender delivered to your inbox.No paywall. No ads. Just the uncensored news. Name*FirstLast Email* This field is hidden when viewing the formDateMM slash DD slash YYYY This field is hidden when viewing the formSource EmailThis field is for validation purposes and should be left unchanged. Δ **Yes! I Support Uncensored News & Scientific Debate** **Latest News** **Latest Views** **Get Text Alerts** Sign up for breaking news from The Defender **Mission** Children’s Health Defense®is a 501(c)(3) non-profit organization. Our mission is ending childhood health epidemics by eliminating toxic exposure. We will restore and protect the health of children by eliminating environmental exposures, holding responsible parties accountable, and establishing safeguards to prevent future harm of children's health. Protecting Children. Exposing Harms. Seeking Justice. Twitter LinkedIn Rumble BitChute Reddit Sovren Truth Social Telegram Gettr Substack **Take action** Donations are tax deductible to the full extent of the law. EIN #26-0388604 Children’s Health Defense Legal Disclaimer Terms of Use Privacy Policy Donate About Us Work for CHD Contact Social © 2016 - 2025 Children's Health Defense®•All Rights Reserved•Sitemap <div align=”center”>Sign Up for FREE<br />News & Updates!<hr>[easy_sign_up phone=”0″]</div> We won’t let censorship hold us down. Don’t miss our articles and updates critical to children’s health. Name*FirstLast Email* This field is hidden when viewing the formDateMM slash DD slash YYYY This field is hidden when viewing the formSource PhoneThis field is for validation purposes and should be left unchanged. Δ We’re not hiding. We’re being censored. Get important articles and updates on issues critical to children’s health. Name*FirstLast Email* This field is hidden when viewing the formDateMM slash DD slash YYYY This field is hidden when viewing the formSource NameThis field is for validation purposes and should be left unchanged. Δ **Sign In** Email(Required)Password(Required)Remember MeForgot Password?FAQ Members must be logged in to receive10% discount. Not a memberJOIN NOW!"}