{"id": 2034, "name": "Libertarian Institute", "domain": "libertarianinstitute.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://libertarianinstitute.org/blog/is-trump-the-free-speech-president-keith-knight-on-the-latest-episode-of-the-kyle-anzalone-show/", "title": "Is Trump The Free Speech President Keith Knight On The Latest Episode Of The Kyle Anzalone Show", "content": "Scott Horton Sheldon Richman Laurie Calhoun James Bovard Ted G. Carpenter Kyle Anzalone Keith Knight Writers About News BooksProvoked: How Washington Started the New Cold War with Russia and the Catastrophe in UkraineFool’s Errand: Time to End the War in AfghanistanEnough Already: Time to End the War on TerrorismHotter Than The Sun: Time To Abolish Nuclear WeaponsThe Great Ron Paul: The Scott Horton Show Interviews 2004–2019Coming to PalestineWhat Social Animals Owe to Each OtherVoluntaryist HandbookQuestioning the COVID Company LineLast Rights: The Death of American LibertyDiary of a Psychosis: How Public Health Disgraced Itself During COVID ManiaThe Fake China Threat and Its Very Real DangerDomestic Imperialism: Nine Reasons I Left ProgressivismIsrael Winner of the 2003 Iraq Oil WarNo Quarter: The Ravings of William Norman Grigg Provoked: How Washington Started the New Cold War with Russia and the Catastrophe in Ukraine Fool’s Errand: Time to End the War in Afghanistan Enough Already: Time to End the War on Terrorism Hotter Than The Sun: Time To Abolish Nuclear Weapons The Great Ron Paul: The Scott Horton Show Interviews 2004–2019 Coming to Palestine What Social Animals Owe to Each Other Voluntaryist Handbook Questioning the COVID Company Line Last Rights: The Death of American Liberty Diary of a Psychosis: How Public Health Disgraced Itself During COVID Mania The Fake China Threat and Its Very Real Danger Domestic Imperialism: Nine Reasons I Left Progressivism Israel Winner of the 2003 Iraq Oil War No Quarter: The Ravings of William Norman Grigg Provoked: How Washington Started the New Cold War with Russia and the Catastrophe in Ukraine Fool’s Errand: Time to End the War in Afghanistan Enough Already: Time to End the War on Terrorism Hotter Than The Sun: Time To Abolish Nuclear Weapons The Great Ron Paul: The Scott Horton Show Interviews 2004–2019 Coming to Palestine What Social Animals Owe to Each Other Voluntaryist Handbook Questioning the COVID Company Line Last Rights: The Death of American Liberty Diary of a Psychosis: How Public Health Disgraced Itself During COVID Mania The Fake China Threat and Its Very Real Danger Domestic Imperialism: Nine Reasons I Left Progressivism Israel Winner of the 2003 Iraq Oil War No Quarter: The Ravings of William Norman Grigg PodcastsThe Scott Horton ShowConflicts of InterestDon’t Tread on AnyoneVital DissentYear ZeroLibertarian Institute RoundtableChasing Ghosts PodcastThe Dangerous History PodcastWarNotes: A Conflict Podcast The Scott Horton Show Conflicts of Interest Don’t Tread on Anyone Vital Dissent Year Zero Libertarian Institute Roundtable Chasing Ghosts Podcast The Dangerous History Podcast WarNotes: A Conflict Podcast The Scott Horton Show Conflicts of Interest Don’t Tread on Anyone Vital Dissent Year Zero Libertarian Institute Roundtable Chasing Ghosts Podcast The Dangerous History Podcast WarNotes: A Conflict Podcast ArchivesOKC Bombing ArchiveWill Grigg ArchivesPodcast ArchivesWill Grigg’s Freedom Zealot RadioFree Man Beyond the WallEnd of the Empire OKC Bombing Archive Will Grigg Archives Podcast ArchivesWill Grigg’s Freedom Zealot RadioFree Man Beyond the WallEnd of the Empire Will Grigg’s Freedom Zealot Radio Free Man Beyond the Wall End of the Empire OKC Bombing Archive Will Grigg Archives Podcast ArchivesWill Grigg’s Freedom Zealot RadioFree Man Beyond the WallEnd of the Empire Will Grigg’s Freedom Zealot Radio Free Man Beyond the Wall End of the Empire Will Grigg’s Freedom Zealot Radio Free Man Beyond the Wall End of the Empire DonateDonateDonor Dashboard Donate Donor Dashboard Donate Donor Dashboard Blog Submission Blog About News PodcastConflicts of InterestDon’t Tread on AnyoneThe Scott Horton ShowVital DissentYear ZeroChasing Ghosts PodcastThe Dangerous History PodcastWarNotes: A Conflict Podcast Conflicts of Interest Don’t Tread on Anyone The Scott Horton Show Vital Dissent Year Zero Chasing Ghosts Podcast The Dangerous History Podcast WarNotes: A Conflict Podcast Conflicts of Interest Don’t Tread on Anyone The Scott Horton Show Vital Dissent Year Zero Chasing Ghosts Podcast The Dangerous History Podcast WarNotes: A Conflict Podcast Books ArchivesOKC ArchiveWill Grigg Archive OKC Archive Will Grigg Archive OKC Archive Will Grigg Archive Our WritersScott HortonSheldon RichmanLaurie CalhounJames BovardTed G. CarpenterKeith KnightKyle Anzalone Scott Horton Sheldon Richman Laurie Calhoun James Bovard Ted G. Carpenter Keith Knight Kyle Anzalone Scott Horton Sheldon Richman Laurie Calhoun James Bovard Ted G. Carpenter Keith Knight Kyle Anzalone DonateDonateDonor Dashboard Donate Donor Dashboard Donate Donor Dashboard **Is Trump the ‘Free Speech President?’ Keith Knight on the latest episode of The Kyle Anzalone Show** byKyle Anzalone|Jun 10, 2025 **Is Trump the ‘Free Speech President?’ Keith Knight on the latest episode of The Kyle Anzalone Show** byKyle Anzalone|Jun 10, 2025 The Institute’s managing and news editors get together for a conversation on Trump’s attacks on Free Speech. Also, Keith Knight explains why Douglas Murray is wrong about WWII. Facebook Twitter Pinterest reddit LinkedIn Buffer Kyle AnzaloneKyle Anzalone is news editor of the Libertarian Institute, opinion editor of Antiwar.com and co-host of Conflicts of Interest with Will Porter and Connor Freeman.View all posts **Kyle Anzalone** Kyle Anzalone is news editor of the Libertarian Institute, opinion editor of Antiwar.com and co-host of Conflicts of Interest with Will Porter and Connor Freeman. **Kyle Anzalone** Kyle Anzalone is news editor of the Libertarian Institute, opinion editor of Antiwar.com and co-host of Conflicts of Interest with Will Porter and Connor Freeman. **Our Books** **Our Books** **Recent Articles** Recent **God Save The King, Sir Savile, Etc** byKym Robinson|Jun 8, 2025 God Save The King! It’s a public holiday and that is enough for many of his subjects to rejoice for. The magical exuberance and privilege to have a sitting regent, whose majestic reign stabs back to times when warlords, bandits and pirates took land, rallied warriors... **Interview: A Rabbi, a Jewish Historian, and I Explain the Israel-Palestine Conflict** byJeremy R. Hammond|Jun 5, 2025 I was a guest alongside Rabbi Dovid Feldman and Dr. Zachary Foster to discuss the true nature of the Israel-Palestine conflict. **Immigration Conversation with Jacob Hornberger** bySheldon Richman|Jun 4, 2025 Follow Follow Follow Follow **Join The Newsletter** Get the latest news and updates from The Institute, straight to your inbox. **Success!** First Name Last Name Email Subscribe Website byExpand Designs **Pin It on Pinterest** Facebook Twitter Pinterest reddit LinkedIn Buffer"}