{"id": 1401, "name": "The Local (Norway)", "domain": "thelocal.no", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thelocal.no/20250604/without-bankid-you-are-nobody-foreigners-in-norway-lament-bureaucratic-headaches/#article-comments", "title": "Without Bankid You Are Nobody Foreigners In Norway Lament Bureaucratic Headaches", "content": "**Advertisement** **Advertisement** NewsLatest newsOsloBergentrondheimCost of livingPoliticsTravel news Latest news Oslo Bergen trondheim Cost of living Politics Travel news Latest news Oslo Bergen trondheim Cost of living Politics Travel news Living in Norway EssentialsLiving CostsVisasCitizenshipReader questions Living Costs Visas Citizenship Reader questions Living Costs Visas Citizenship Reader questions LanguageLearning NorwegianNorwegian word of the Day Learning Norwegian Norwegian word of the Day Learning Norwegian Norwegian word of the Day HomesPropertyRenting Property Renting Property Renting JobsWorking in NorwayFind jobs in Norway Working in Norway Find jobs in Norway Working in Norway Find jobs in Norway NewsLatest newsOsloBergentrondheimCost of livingPoliticsTravel news Latest news Oslo Bergen trondheim Cost of living Politics Travel news Latest news Oslo Bergen trondheim Cost of living Politics Travel news Living in Norway EssentialsLiving CostsVisasCitizenshipReader questions Living Costs Visas Citizenship Reader questions Living Costs Visas Citizenship Reader questions LanguageLearning NorwegianNorwegian word of the Day Learning Norwegian Norwegian word of the Day Learning Norwegian Norwegian word of the Day HomesPropertyRenting Property Renting Property Renting JobsWorking in NorwayFind jobs in Norway Working in Norway Find jobs in Norway Working in Norway Find jobs in Norway norwayAll EditionsAustriaDenmarkFranceGermanyItalyNorwaySpainSwedenSwitzerland All Editions Austria Denmark France Germany Italy Norway Spain Sweden Switzerland All Editions Austria Denmark France Germany Italy Norway Spain Sweden Switzerland Become a member Newsletters Help Centre Gift Vouchers Educational Access Corporate Access About Us Contact Us News Archive Search articles All topics Advertise with us Post a job ad The Local Europe ABVästmannagatan 43113 25 StockholmSweden **'Without BankID you are nobody': Foreigners in Norway lament bureaucratic headaches** 1 comment From BankID to national identity numbers and visa delays, foreign residents living in Norway have a lengthy list of common frustrations with Norwegian bureaucracy. What else would you add? **Advertisement** Getting a Bank ID When asked to list their worst bureaucratic headaches in Norway the single most widespread gripe among our international readership and online groups was the complex and drawn-out process of obtaining a BankID, Norway’s digital identity system. Without it, daily life grinds to a halt. “You are effectively locked out of Norwegian society,” one reader said. “No mobile phone number, no online shopping, no Vipps. There are some places where that is the only payment option, which is very frustrating.\" One respondent, Abby Noble, described it as a “chicken and egg” conundrum. To get a BankID, you need a bank account. But to open a bank account, you need a registered address — which you often can’t get without a bank account. \"Why is a bank account necessary for having access to your health page in Norway?\" complained Sebastian Rojas, from Chile. READ ALSO:What are the rules for getting a BankID at Norway's banks? The frustrations of having a D-number Many people, such as newly arrived asylum seekers or EU citizens planning to work in Norway for less than six months, or other foreign workers on job seeker permits, are only eligible for aD-number,which can make it hard to open a bank account or access a wide range of other services. Megan Thorsen said that after she was given a D-number on the back of her job-seeker visa, she struggled to set up something as basic as an internet connection. Others found that banks simply had no process for D-number holders, even when they had job offers in hand. “I went to four banks,” one reader recalled. “Eventually my Norwegian friend called his banker, who was shocked they couldn’t help. They just hadn’t seen the issue before.” But even getting a D-number seemed to take some time. “Without a D-number, you are nobody. And nobody tells you what you’re supposed to do next,\" one respondent moaned. **Advertisement** READ ALSO:How to switch from a D-number to afødselsnummerin Norway Trouble opening bank accounts It wasn't only people on D-visas who had trouble opening bank accounts. One Polish respondent said the most frustrating thing about living and working in Norway was simply \"waiting\". \"Over two months to open a bank account!\" he exclaimed. \"I think the response time to get all the papers ready is sometimes too much,\" Sebastian Rojas said. \"To get my National ID number and the bank account took me at least three months. Without those two things in Norway you are very restricted to what you can actually do.\" Banks require physical documents, which are sent by post, and Norwegian post won’t deliver unless your name is on the letter box. “It was a nightmare,” said Abby Noble. “I was only able to solve it thanks to kind Airbnb owners and friends I made at Norskkurs.” READ ALSO:What you need to know about opening a bank account in Norway UDI processing times **Advertisement** The Norwegian Directorate of Immigration (UDI) also came in for heavy criticism — particularly for long waits for family reunification and citizenship applications. “Family visas are taking 12 to 15 months,” said Frida Cota, who had to endure a long-distance relationship while waiting. \"Citizenship applications are now taking 30 months if they are not automatically processed. And nobody knows or will tell what the criteria is for automatic processing.\" Carla Colombon, from Mexico, was unable to work for over 18 months while waiting to get all the necessary paperwork done. “Such a waste of time and skills and super expensive for my partner and me to live on only one income.\" She said it has also been \"incredibly frustrating\" not to be able to travel freely when living in Norway on a temporary visa. **Advertisement** Problems getting appointments/phone contact \"Have you tried calling any institutions? Waiting times of 30 min and more,\" complained one anonymous respondent, who described Norway as \"close to a failed state\". \"And there is no feedback, as in normal countries (you don't get an option to evaluate how the phone call went)\". \"When you have to register in the country, the next appointment with the police is like half a year away somewhere in Finnmark,\" the commenter added. Contradictory answers/poor information Several respondents complained of getting contradictory information from different government officials, or on different government websites. \"The information is not coherent,\" complained Elva Popsen from Greece. \"When you register at UDI as a job seeker, nobody tells you that you should go to NAV [the unemployment service]. Also at the tax office, nobody tells you that you should try NAV first if you don't have a job yet.\" \"Any interaction with government institutions leads to contradictory answers,\" agreed an anonymous respondent, pointing to a \"discrepancy between what is indicated on the website and what was provided by direct communication\". Lack of understanding among ordinary Norwegians \"The challenges immigrants face are not relatable to most locals,\" Amber Renee explained. \"They’ve never had to get a personal number, never had to deal with UDI, and never had to understand or care about any of these processes.\" \"This seems to carry over to the native Norwegians who design the processes or are working in service positions for the bureaucracy. They still do not relate or understand the full picture and do not really care because it doesn’t affect them.\" Would you add any other obvious bureaucratic hurdles? Share your own experience in the comments section below. **More** **Comments (1)** Join the conversation in our comments section below.Share your own views and experience and if you have a question or suggestion for our journalists then email us atnews@thelocal.no.Please keep comments civil, constructive and on topic – and make sure to read ourterms of usebefore getting involved. Please log inhereto leave a comment. **See Also** **Advertisement** The Local Europe ABVästmannagatan 43113 25 StockholmSweden By signing up you agree to ourTerms of UseandPrivacy Policy.We will use your email address to send you newsletters as well as information and offers related to your account. 2025 The Local, All Rights Reserved."}