{"id": 432, "name": "Fairness and Accuracy in Reporting", "domain": "fair.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://fair.org/home/media-credit-trump-for-gaza-truce-sidelining-palestinian-resistance-and-solidarity/", "title": "Media Credit Trump For Gaza Truce Sidelining Palestinian Resistance And Solidarity", "content": "HOME ABOUT DONATE COUNTERSPIN RADIO EXTRA! NEWSLETTER FAIR STUDIES ISSUES / TOPICS STORE TAKE ACTION FAIRNESS & ACCURACY IN REPORTING Challenging media bias since 1986. Mission Statement Staff, Associates & Board of Directors Contact FAIR Internship Program What’s FAIR? What’s Wrong With the News? FAIR’s Financial Overview Privacy Policy Current Show Program Archives Transcript Archives Get CounterSpin on Your Station Radio Station Finder Subscribe to Extra! Customer Care FAIR’s Media Contact List FAIR’s Resource List HOME ABOUT DONATE COUNTERSPIN RADIO EXTRA! NEWSLETTER FAIR STUDIES ISSUES / TOPICS STORE TAKE ACTION FAIR FAIR is the national progressive media watchdog group, challenging corporate media bias, spin and misinformation. HOME ABOUTAbout/Mission StatementStaff, Associates & Board of DirectorsContact FAIRInternship ProgramFinancial OverviewWhat’s FAIR?What’s Wrong With the News? About/Mission Statement Staff, Associates & Board of Directors Contact FAIR Internship Program Financial Overview What’s FAIR? What’s Wrong With the News? About/Mission Statement Staff, Associates & Board of Directors Contact FAIR Internship Program Financial Overview What’s FAIR? What’s Wrong With the News? DONATEUpdate Recurring Donation Update Recurring Donation Update Recurring Donation COUNTERSPIN RADIOAbout CounterSpinProgram ArchivesTranscript ArchivesFind a Station Near You!Get CounterSpin on Your Station About CounterSpin Program Archives Transcript Archives Find a Station Near You! Get CounterSpin on Your Station About CounterSpin Program Archives Transcript Archives Find a Station Near You! Get CounterSpin on Your Station EXTRA!About Extra!Subscribe to Extra!Customer Care About Extra! Subscribe to Extra! Customer Care About Extra! Subscribe to Extra! Customer Care FAIR STUDIES ISSUES / TOPICS TAKE ACTIONAction AlertsActivism UpdatesJoin Our Email NetworkFAIR’s Media Activism KitFAIR’s Media Literacy GuideOrganize!Media Contact ListResource ListRecommended ReadingMedia Activism Groups Action AlertsActivism UpdatesJoin Our Email Network Activism Updates Join Our Email Network FAIR’s Media Activism KitFAIR’s Media Literacy GuideOrganize!Media Contact ListResource ListRecommended ReadingMedia Activism Groups FAIR’s Media Literacy Guide Organize! Media Contact List Resource List Recommended Reading Media Activism Groups Action AlertsActivism UpdatesJoin Our Email Network Activism Updates Join Our Email Network Activism Updates Join Our Email Network FAIR’s Media Activism KitFAIR’s Media Literacy GuideOrganize!Media Contact ListResource ListRecommended ReadingMedia Activism Groups FAIR’s Media Literacy Guide Organize! Media Contact List Resource List Recommended Reading Media Activism Groups FAIR’s Media Literacy Guide Organize! Media Contact List Resource List Recommended Reading Media Activism Groups EMAIL NETWORK STORE CounterSpin Radio About CounterSpin Current Show Program Archives Transcript Archives Get CounterSpin on Your Station Radio Station Finder **Media Credit Trump for Gaza Truce—Sidelining Palestinian Resistance and Solidarity** Shadi Hamid (Washington Post,1/16/25): “Donald Trump might seem like a madman. But it turns out that might be a good thing—at least for the moment.” Many leading US media outlets were quick to attribute the suspension of hostilities in Gaza to incoming president Donald Trump’s intervention. Ariel Kahana argued in theWall Street Journal(1/15/25) that “Trump Forced Netanyahu to Make a Deal With the Devil”—Satan, in this formulation, being Hamas, as opposed to the parties responsible for more than 15 months ofgenocide. In theWashington Post(1/16/25), a Shadi Hamid column contended that “Trump’s ‘Madman Theory’ Worked in Gaza When All Else Failed.” Other coverage highlighted how Trump’s team coordinated with the Biden administration in its final weeks. TheJournal (1/15/25) foregrounded the “pointed debate over who deserves the credit” while theNew York Times(1/15/25) marveled at the “remarkable collaboration between President Biden and President-elect Donald J. Trump, who temporarily put aside mutual animosity to achieve a mutual goal.” ThePost(1/18/25) emphasized how incoming and outgoing administration teams with little ideological affinity—and considerable political enmity—embarked on a virtually unprecedented collaboration to seal the ceasefire deal. I ran a search using the news media aggregator Factiva and found that theNew York Times,Washington PostandWall Street Journalran a combined 19 articles containing the words “Gaza” and “ceasefire” in the five-day period from when the ceasefire was agreed upon, January 15, until it took effect on January 19. Yet these newspapers consistently ignored other crucial features of the environment in which the ceasefire came together. **‘Heavy losses on Israeli forces’** Foreign Policy(4/9/24): The Biden administration warned Israel not to “get bogged down in an endless quagmire with no way out.” A major overlooked factor is that Israeli occupation forces faced fierce resistance from Hamas and other Palestinian militant groups in Gaza. Israeli media and former Israeli officials have described Israel as being in a “quagmire” in Gaza (Haaretz,8/15/24,9/16/24). International media reached the same conclusion (Irish Times,4/7/24;Foreign Policy,4/9/24). As it became likely that a ceasefire would come to pass,Haaretzmilitary analyst Amos Harel (1/14/25) wrote that until a deal is signed, Israel is bleeding in Gaza…. The number of fallen soldiers in the area has risen to 15 in less than a week. It’s not just that time is running out for the hostages. Soldiers, too, are dying without any clear reason in a prolonged operation in Northern Gaza…. In practice, despite the heavy losses sustained by Hamas, it is clear that the operation has not yielded decisive results. The fighting in Jabaliya has subsided, but an estimated several dozen active [Palestinian fighters] remain there. A similar number are also active in Beit Hanoun and have managed to inflict relatively heavy losses on the Israeli forces. Despite using nearly apocalyptic force against Gaza and inflicting incomprehensible suffering on its civilian population, the US/Israeli alliance could not vanquish Palestinian resistance forces, and Israel was forced to absorb substantial casualties. However, the 19Journal,PostandTimesarticles make only one mention of Israeli losses in Gaza. That occurred in the final sentence of aPostarticle (1/15/25), which read, “[Israel] says 405 soldiers have been killed during its military operation in Gaza”—a figure that cannot be verified because the Israeli military is secretive and censorious (+972,5/20/24). **Economic toll** CNN(10/4/24): “As the conflict spills over into the wider region, the economic costs will spiral too.” Other costs were also exacted from Israel. For months, 68,000 Israelis living near the Israel/Lebanon armistice line have been evacuated from their homes because of rockets Hezbollah has fired, which the group consistently said it did to pressure Israel into a Gaza ceasefire. Although Hezbollah has stopped since it signed a “ceasefire” with Israel (that Israel has ignored—FAIR.org,1/9/25), Israelis have not gone back to their homes in the north, and are not expected to until March at the earliest (Haaretz,1/1/25). None of the 19Journal,TimesandPostpieces I examined make any reference to these almost 70,000 Israelis who have been driven from their homes by the Palestinians’ Lebanese allies. The drawn-out genocide exacted economic costs on Israel as well. In October,CNN(10/4/24) said that Israelis’ living standards are declining and that, prior to the events of October 7, 2023, the International Monetary Fund forecast that Israel’s economy would grow by an enviable 3.4% [in 2024]. Now, economists’ projections range from 1% to 1.9%. Growth [in 2025] is also expected to be weaker than earlier forecasts…. Inflation is accelerating, propelled by rising wages and soaring government spending to fund the war…. The conflict has caused Israel’s budget deficit—the difference between government spending and revenue, mostly from taxes—to double to 8% of GDP, from 4% before the war…. To shrink the fiscal hole, the government can’t rely on a healthy flow of tax revenue from businesses, many of which are collapsing, while others are reluctant to invest while it’s unclear how long the war will last. AReutersheadline (10/15/24) the next day noted that Israeli GDP growth for April–June 2024 had to be “Revised Down to 0.3% as Gaza War Takes Economic Toll.” Nevertheless, the 19Journal,TimesandPostarticles in my data set contained zero references to Israel’s economic problems. **‘Costs piling up for importers’** New York Times(12/11/24): Yemeni attacks on cargo traffic in the Red Sea were “one of the most significant challenges that shipping has faced in a long time.” Along similar lines, the Yemeni groupAnsar Allah(usually referred to in Western media as the Houthis) has been intercepting commercial ships in the Red Sea since October 2023, promising to stop once there is a Gaza ceasefire. Ansar Allah’s commandeering the vessels has had a substantial impact on the global economy. A Defense Intelligence Agencyreportsaid that Red Sea shipping usually accounts for 10–15% of international maritime trade, and container shipping through those waters declined by roughly 90% from December 2023 to February 2024. A December 2024 article in theNew YorkTimes(12/11/24) explained that Ansar Allah’s actions forced shipping companies to take a route “that is some 3,500 nautical miles and 10 days longer.” While “Western-led naval fleets were sent to the Red Sea…the attacks continued, and commercial vessels have, for the most part, stayed away.” According to the report, “the costs are piling up for importers,” as shipping “rates have surged,” and economists say that “the Houthi attacks have contributed to inflation around the world.” TheTimessaid that “the cost of shipping a container from China to a West Coast port in the United States is up 217% over 12 months.” Meanwhile,AP(1/3/25) reported that “Houthi attacks on shipping in the Red Sea have all but shuttered an Israeli port in the city of Eilat.” Nor have Ansar Allah’s activities been limited to the seas. AsAPpointed out: In recent weeks, missiles and drones from Yemen have struck nearly every day…setting off air raid sirensin broad swaths of Israel…. The rocket fire is posing a threat to Israel’s economy, keeping many foreign airlines away and preventing the country from jump-starting its hard-hit tourism industry. The 19 Gaza ceasefire articles in theJournal,TimesandPostsaid nothing about the economic and military impact of Ansar Allah’s operations. An accounting of the ceasefire is incomplete if it excludes how anti-Zionist and anti-imperialist forces in the Middle East thwarted US/Israeli designs for over 15 months, levying considerable battlefield and financial losses. Palestinians are protagonists in their own history, whether the US media like it or not. FAIR’s work is sustained by our generous contributors, who allow us to remain independent.Donatetoday to be a part of this important mission. **Related Posts** IDF Shells Gaza Media, U.N., More Civilians Local Paper Grades Big Media on Gaza Donald Trump's Mysterious Control of the Media Another 'Palestinian Gandhi' Ignored by U.S. Media Filed under:Donald Trump,Israel/Palestine,Lebanon,War & Military Gregory Shupak teaches media studies at the University of Guelph-Humber in Toronto. His book,The Wrong Story: Palestine, Israel and the Media, is published by OR Books. Gregory Shupak teaches media studies at the University of Guelph-Humber in Toronto. His book,The Wrong Story: Palestine, Israel and the Media, is published by OR Books. Gregory Shupak teaches media studies at the University of Guelph-Humber in Toronto. His book,The Wrong Story: Palestine, Israel and the Media, is published by OR Books. **Comments** KenJanuary 24, 2025 at 7:34 pmOf course we are. As we talk, little may it be, we are completely ignoring the fact that the West Bank is being completely overrun.Reply Ken January 24, 2025 at 7:34 pm Of course we are. As we talk, little may it be, we are completely ignoring the fact that the West Bank is being completely overrun. Ken January 24, 2025 at 7:34 pm Of course we are. As we talk, little may it be, we are completely ignoring the fact that the West Bank is being completely overrun. MilhouseMarch 31, 2025 at 9:59 amThis article didn’t age well. Shupak credits the less equipped nationalists for getting their hands dirty with violence for a pause in the war, right before the other nationalists decided they had to recover their monopoly on force. Did it feel good to believe for a moment that history automatically gives the underdog wins like a snack machine if you ask for change from the non western ruling elites with no skin in the game?Reply Milhouse March 31, 2025 at 9:59 am This article didn’t age well. Shupak credits the less equipped nationalists for getting their hands dirty with violence for a pause in the war, right before the other nationalists decided they had to recover their monopoly on force. Did it feel good to believe for a moment that history automatically gives the underdog wins like a snack machine if you ask for change from the non western ruling elites with no skin in the game? Milhouse March 31, 2025 at 9:59 am This article didn’t age well. Shupak credits the less equipped nationalists for getting their hands dirty with violence for a pause in the war, right before the other nationalists decided they had to recover their monopoly on force. Did it feel good to believe for a moment that history automatically gives the underdog wins like a snack machine if you ask for change from the non western ruling elites with no skin in the game? **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Δ This site uses Akismet to reduce spam.Learn how your comment data is processed. **JOIN OUR EMAIL NETWORK** News analysis and media criticism delivered to your inbox All posts Weekly alerts FAIR’s 4-page, ad-free, newsletter publishes ten times a year bringing you the media analysis and activism that you won’t find anywhere else. Choose a print subscription, a digital PDF edition, or both together. Media Monopoly RevisitedOctober 1, 2011How Television Sold the Panama InvasionJanuary 1, 1990Media MillionairesJuly 1, 2013When NBC Says ‘Meeting America,’ It Means White, Republican AmericaMay 20, 2014Iran/Contra: Sweep It AwayMarch 1, 1993Liddy’s Lethal AdviceJuly 1, 1995The ‘Center’ Always HoldsDecember 1, 2014Bill O’Reilly’s Sheer O’ReillynessJuly 1, 2001When Is a Commercial Not a Commercial?September 1, 1993ACTION ALERT: The Philadelphia Inquirer’s New Spectrum: From Centrism to AntisemitismNovember 1, 1995123456...25>> Media Monopoly RevisitedOctober 1, 2011 How Television Sold the Panama InvasionJanuary 1, 1990 Media MillionairesJuly 1, 2013 When NBC Says ‘Meeting America,’ It Means White, Republican AmericaMay 20, 2014 Iran/Contra: Sweep It AwayMarch 1, 1993 Liddy’s Lethal AdviceJuly 1, 1995 The ‘Center’ Always HoldsDecember 1, 2014 Bill O’Reilly’s Sheer O’ReillynessJuly 1, 2001 When Is a Commercial Not a Commercial?September 1, 1993 ACTION ALERT: The Philadelphia Inquirer’s New Spectrum: From Centrism to AntisemitismNovember 1, 1995 1 2 3 4 5 6 25 >> Media Monopoly RevisitedOctober 1, 2011 How Television Sold the Panama InvasionJanuary 1, 1990 Media MillionairesJuly 1, 2013 When NBC Says ‘Meeting America,’ It Means White, Republican AmericaMay 20, 2014 Iran/Contra: Sweep It AwayMarch 1, 1993 Liddy’s Lethal AdviceJuly 1, 1995 The ‘Center’ Always HoldsDecember 1, 2014 Bill O’Reilly’s Sheer O’ReillynessJuly 1, 2001 When Is a Commercial Not a Commercial?September 1, 1993 ACTION ALERT: The Philadelphia Inquirer’s New Spectrum: From Centrism to AntisemitismNovember 1, 1995 1 2 3 4 5 6 25 >> FAIR is the national progressive media watchdog group, challenging corporate media bias, spin and misinformation. We work to invigorate the First Amendment by advocating for greater diversity in the press and by scrutinizing media practices that marginalize public interest, minority and dissenting viewpoints. We expose neglected news stories and defend working journalists when they are muzzled. As a progressive group, we believe that structural reform is ultimately needed to break up the dominant media conglomerates, establish independent public broadcasting and promote strong non-profit sources of information. Fairness & Accuracy In Reporting124 W. 30th Street, Suite 201New York, NY 10001 Tel: 212-633-6700 We rely on your support to keep running. Please consider donating."}