{"id": 330, "name": "Daily Record (Scotland)", "domain": "dailyrecord.co.uk", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.dailyrecord.co.uk/sport/football/football-transfer-news/transfer-news-live-rangers-celtic-35358072#comments-wrapper", "title": "Transfer News Live Rangers Celtic 35358072#comments Wrapper", "content": "NewsLatest NewsScottish NewsUK & World NewsPoliticsCrimeHealthReal LifeBusiness & ConsumerWeird NewsScience & TechnologyNews By AreaExpand Latest News Scottish News UK & World News Politics Crime Health Real Life Business & Consumer Weird News Science & Technology News By Area Latest News Scottish News UK & World News Politics Crime Health Real Life Business & Consumer Weird News Science & Technology News By Area Politics FootballScottish PremiershipScottish ChampionshipScottish CupPremier Sports CupScotland Football TeamTransfer NewsEnglish Premier LeagueExpand Scottish Premiership Scottish Championship Scottish Cup Premier Sports Cup Scotland Football Team Transfer News English Premier League Scottish Premiership Scottish Championship Scottish Cup Premier Sports Cup Scotland Football Team Transfer News English Premier League SportLatest SportFootballHorse RacingRugbyGolfTennisBoxingDartsExpand Latest Sport Football Horse Racing Rugby Golf Tennis Boxing Darts Latest Sport Football Horse Racing Rugby Golf Tennis Boxing Darts TV & CelebsLatest CelebsCelebrity NewsTV & Radio NewsCelebrity InterviewsExpand Latest Celebs Celebrity News TV & Radio News Celebrity Interviews Latest Celebs Celebrity News TV & Radio News Celebrity Interviews Life & Style Partner Stories Legal Matters Scotland Now In Your Area Business Travel Follow us Buy a Paper Road Record Property Public Notices Competitions Horoscopes Deals Funeral Notices Jobs Crosswords Advertise With Us Newsletter signup mynewsassistant In Your Area About Us Contact Us Work for us Got A Story? Local News Cookie Notice Advertising Marketplace Book an Ad Marketplace Beauty Box Subscription Yimbly Shop Jobs Buy a Photo Competition Rules How to Complain Corrections & Clarifications Google Survey Privacy Notice AI Notice Sunday Mail Centenary Fund Paper Subscription to the Daily Record and Sunday Mail Paper Subscription to the Paisley Daily Express Newsletters Signup Syndication & Licensing Terms and Conditions Notifications and alerts help © 2025 Scottish Daily Record and Sunday Mail Ltd Home Sport Football Transfer Talk **Transfer news LIVE as Rangers and Celtic plus Aberdeen, Hearts and Hibs eye signings** **Your one stop shop for rumours and done deals is in full swing as the summer kicks into gear** Bookmark Share Comments Updated22:37, 11 JUN 2025 Bookmark The summer break might be in full swing, but there’s no rest for Scotland’s top clubs as the transfer window kicks into high gear. While SPFL stars are enjoying some well-earned downtime after a gruelling season, agents and decision-makers are hard at work shaping squads for the new campaign - and the deals are coming thick and fast. At Ibrox,Rangersare wasting no time under new boss Russell Martin.Record Sportunderstands the club are in talks to signMaccabi Tel Aviv striker Dor TurgemanandLeicester City defender Conor Coady.There’s also interest in Southampton midfielder Flynn Downes - well known to Martin - but stiff competition could see the Light Blues miss out. Cyriel Dessers looks set for the exit door, with AEK Athens keen,and we can reveal the asking price for the Nigerian striker.Ross McCausland could also be heading for a summer departure,with strong interest in the Northern Ireland international. Across the city, Celtic have confirmed the blockbuster return ofKieran Tierneyand are closing in on a second signing, with Fulham forward Callum Osmand set for a medical.Record Sportalso understands Lennon Miller remains firmly on their radar, while Hearts’ James Penrice has been scouted as Brendan Rodgers looks to strengthen his squad. Speaking of Hearts,Derek McInnes is close to reuniting with former Kilmarnock defender Stuart Findlay, while Portuguese striker Claudio Braga is in talks over a £400,000 move to Tynecastle from Aaselund. Scottish Cup winnersAberdeenhave already made four signings, with Aussie striker Kusini Yengi the latest through the door. Boss Jimmy Thelin is far from done as he continues to target fresh firepower. Dundee United are also getting business done early, snapping up Moldovan centre-back Iurie Iovu and Western Sydney Wanderers striker Zac Stapsford ahead of their European campaign. And down south,Manchester Cityhave sealed a deal for Lyon star Rayan Cherki, with AC Milan’s Tijani Reijnders expected to follow. Meanwhile, Liverpool are ready to smash the British transfer record to land Bayer Leverkusen’s Florian Wirtz. Get all the transfer news you need with us right here LIVE. **Key Events** BREAKING! Igamane sparks transfer battle20:59 Hoops eye Nygren20:31 11 forgotten Celts poised for transfer summits17:00 Celtic eye some more Ange ball07:34 BREAKING! KT speaks on Celtic return14:43 **Brentford break silence on Frank to Spurs** Brentford director Preeti Shetty is confident the club will find the ideal replacement for Thomas Frank. Frank is poised to be confirmed as Ange Postecoglou's successor at Tottenham Hotspur over the coming days. Bees owner Matthew Benham and director of football Phil Giles have already begun the search for a new head coach. And Shetty is adamant the Premier League side's decision-makers will appoint the right man. He told Sky Sports News: What I can reassure everybody is: this is an amazing football club. The people who run this football club are fantastic and the people involved with it. We’re really proud of what we’ve achieved so far, the journey from the lower tiers of the league to an established Premier League football club. We are really confident in going in that direction going forwards. We’ve got a brilliant director of football here and a wonderful owner who will be making all those decisions. All I can say is: in them we trust. Share Comments **Latest on Motherwell's managerial search** Motherwell's search for a new manager is ongoing after Michael Wimmer’s shock exit. The German has returned to SSV Jahn Regensburg citing family reasons for his return. Well are still considering their options with the likes of Robbie Neilson and Tony Docherty all in for the job. Central Coast Mariners boss Mark Jackson’s name has been put forward for the Fir Park job. Jackson, who has previously managed MK Dons, replaced Nick Montgomery when he went to Hibs at Central Coast. He helped them win the regular season and their Grand Final trophy the following season and was named as the A-League coach of the year in 2024. Share Comments **BREAKING! Igamane sparks transfer battle** Rangers striker Hamza Igamane is reportedly the subject of interest from clubs in the Premier League and Ligue 1. The Morocco international enjoyed a productive first season at Ibrox following his £1.7milion move from FAR Rabat last summer, notching 16 times in 46 matches in all competitions. Those displays have helped the 22-year-old make the breakthrough at international level, with Igamane making his senior bow for Morocco in a World Cup qualifying victory against Niger back in March. But reports out of France claim that new Gers boss Russell Martin will have a fight on their hands to keep a hold of the frontman ahead of the new season. READ THE FULL STORY HERE. Share Comments **Hoops eye Nygren** Celtic are reportedly keen on a summer transfer for Nordsjaelland playmaker Benjamin Nygren. Brendan Rodgers is already off the mark in the window after Kieran Tierney's sensational Parkhead return from Arsenal on a free transfer was confirmed while young Fulham striker Callum Osmand is having a medical ahead of a move north of the border. And it's now claimed thatSweden international Nygren is also on the Irishman's radar. Share Comments **Ex Hibee on the move** Former Hibs loanee CJ Egan-Riley is on his way out of Burnley - with the defender set to land a big move to Ligue 1. That's according to La Provence, who claim that the ex Manchester City kid will join Marseille after turning down a contract extension at Turf Moor. Egan-Riley spent the second half of the 2022/23 season at Easter Road, making 14 Premiership appearances. Share Comments **Tudor agrees Juve stay** Igor Tudor is set to land the top job at Juventus on a permanent basis. The Croatian coach replaced Thiago Motta back in March on a deal for the remainder of the campaign and guided Juve to a fourth place finish to bring back Champions League football to Turin next season. And Italian transfer guru Matteo Moretto now claims that the former Lazio boss will pen a two-year contract with Juve that includes the option of an additional year. Share Comments **EXCLUSIVE! Motherwell hold Sylla talks** Motherwell have made a move to land Mo Sylla. The Fir Park club has held talks with the midfielder’s representatives. The Frenchman is a free agent after leaving Dundee. The 31-year-old was offered a new deal at Dens Park but turned it down. Their rivals have stepped in to try and keep him in the Premiership. Motherwell are without a manager but their head of recruitment has continued making signings. The ‘Well have already raided Dundee to sign defender Jordan McGhee on freedom of contract and Austrian midfielder Lukas Fadinger. Share Comments **Boyd makes Gers transfer plea** Kris Boyd insists that James Tavernier still has a big part to play at Rangers going forward - and is desperate to see his old team hold onto Nicolas Raskin and Mohamed Diomande this summer. Despite coming under-fire for a number of his performances last season - where he was left out of the starting XI by Philippe Clement -Record Sportrevealed last week that Tavernier, 33, is expected to retain the captaincy at Ibrox under new boss Russell Martin. The former Newcastle ace is gearing up for his 11th season with the Gers but has just 12 months remaining on his current deal. But Boyd is hopeful that the Englishman can recapture some of his previous form from years gone by if new owners 49ers Enterprises can splash some cash to improve the squad. Read the full storyHERE. Share Comments **Dundee locked in talks with trio as duo depart** Mo Sylla and Antonio Portales will be leaving Dundee on freedom of contract. The Dees had previously made offers to the French midfielder and Mexican defender but they have both decided to take on fresh challenges. Club chiefs remain in talks with Scott Tiffoney, captain Joe Shaughnessy and Josh Mulligan, although the latter has a string of options. The Dens Park outfit have also offered Scott Fraser, who struggled with a groin issue, the chance to return in pre-season to prove his fitness. Share Comments **EXCLUSIVE! Hearts make pitch for striker** Hearts are looking to land Nigerian striker Uchenna Ogundu. The Jambos havepitched to land the teenager from Sanliurfaspor. The Turkish second-tier club are prepared to let their prize asset go for a small fee but are looking for a large sell-on. The 19-year-old has been flagged up by analytics with Derek McInnes and his scouting team doing a lot of additional work on him. Share Comments **11 forgotten Celts poised for transfer summits** The sight of Kieran Tierney back home at Paradise is such a joy to see for Celtic fans. But the prospect of some other returning stars donning the hoops again may not prove so popular. Brendan Rodgers will oversee another summer transfer window ahead of August's crucial Champions League play-offs. No fewer than 11 forgotten men will report back to Lennoxtown after mixed loan stints elsewhere in 2024/25. One or two of the club's academy graduates will have done their chances of making the grade no harm after some standout displays. Then there are some big-money signings who may already be resigned to the fact that their long-term futures lie away from Parkhead. Here,Record Sportruns the ruleover the raft of loanees who are set to discover whether they will be part of Rodgers' plans going forward. Share Comments **Garnacho asking price set** Alejandro Garnacho looks set to be heading for the exit door at Manchester United this summer. But any interested parties who want to land the Argentina international have been warned that he won't come cheap. That's because The Independent claim that the Red Devils have slapped a £70million price tag on Garnacho's head. Share Comments **Sane to Gala edges closer** Galatasaray are reportedly poised to seal a deal for Bayern Munich winger Leroy Sane. Fabrizio Romano states that the Germany star is on his way to Istanbul for a medical after agreeing a three-year contract with the Turkish giants. Sane has scored 60 goals in 220 games for Bayern. Share Comments **City and Nypan in 'advanced talks'** It's been a busy summer already at Man City and it is showing no signs of stopping. The EPL outfit are now in advanced talks for Rosenborg teen talent Sverre Nypan. Sky Sports report that the likes of Arsenal and Aston Villa also had visits from the 18-year-old in January but he decided to wait until the summer to move. They report that Pep Guardiola is now closign in on the signing. Share Comments **Tsimikas likely to leave Liverpool** Kostas Tsimikars is likely to leave Liverpool this summer. The champions are on the verge of signing Milos Kerkez from Bournemouth, which would leave Tsimikas fighting with him and Andy Robertson for the left back slot. And the Mirror reports that the greek defender is more likely to leave than Scotland skipper Robertson. Tsimikas has interest from Wolves, Nottingham Forest and Europe. Share Comments **Valuation apart on Trafford** Newcastle and Burnley are apart on James Trafford. The Champions League bound side are keen on the stopper - but the two clubs are not close in a valuation for the player. Burnley value him at £40m according to the Daily Mail. Eddie Howe wants a new goalkeeper to compete with Nick Pope. Share Comments **McKenna expected to leave Las Palmas** Las Palmas are looking to offload Scott McKenna this summer - according to a report. udlaspalmas.netclaim that the Scotland defender and former Ajax goalkeeper Jasper Cillessen are both set to be moved on because of their high salaries. Las Palmas suffered relegation from La Liga last season after just two seasons in Spain's top tier and are said to be keen on cutting down their wage bill. McKenna's international teammate Oli McBurnie has already left the club after activating a clause in his contract that would allow him to leave on a free transfer if the team were relegated, less than 12 months after his arrival from Sheffield United. Share Comments **Hale makes Staggies admission** Ross County striker Ronan Hale has admitted he wants to play at the highest level he can. It comes after he made his international debut for Northern Ireland in the 1-0 friendly win over Iceland. Hale is still under contract at Dingwall but the Staggies have just been relegated from the Premiership. He said: I'm just going to take it as it comes. I'm a Ross County player and I'm contracted to them but things can change. “It's just about seeing what the future holds for me and the best decision to keep me playing at the highest level I can. The 26-year-old made his international bow after switching allegiances from the Republic of Ireland for whom he played up to under-21 level. He knows to stake his claim he needs to be prodding at the best level he can. Hale claimed: I’m hungry for more now. It's one that I can build on. I've done what I can and hopefully it’s enough to keep me in the squad for the World Cup games though it's down to club form as well. I need to be performing every week because there's a tough pool of strikers that are all competing to be included. There's people playing in the League One and the Championship and we're all fighting for that number nine spot. Share Comments **County returns** Ross County have confirmed four player returns. Eamonn Brophy, Jay Henderson, Ricki Lamie and Josh Reid have all returned from loan spells away from the Staggies. The Dingwall outfit offered thanks to the clubs for the temporary deals of the quartet. Share Comments **Karius lands extended Schalke stay** Remember Loris Karius? He is set to pen a new two-year deal in Germany. The former Liverpool keeper is on the books at Schalke 04. And he is set to extend his stay by two more seasons. Share Comments **Chelsea leave out 2 big names** Raheem Sterling and Joao Felix will NOT be part of Chelsea' Club World Cup plans. Both players are back from loan deals having fallen down the pecking order. And it appers Enzo Maresca has made up his mind on the pair. The Sun reports the Blues are expected to put them up for sale in the coming weeks. Share Comments **EXCLUSIVE! Dons briefed on Gyamfi** Aberdeen newboy Emmanuel Gyamfi won't have to worry about looking out for himself in the Scottish Premiership. That's according to the versatile full back's former manager at VVV-Venlo John Lammers, who reckons the youngster's physical attributes are tailor-made for his new endeavour. Read the full storyHERE. Share Comments **EXCLUSIVE! Want heading to Somerset** Ayr United are set to bring Shaun Want back from Ireland. The experienced defender has just turned down a new deal at Larne. Want has been in Northern Ireland for three years and wanted to be closer to home for family reasons. Scott Brown is set to fight off competition from several other Championship rivals to sign him. He is expected to sign a two year deal at Somerset Park, subject to a medical. Want came through the ranks at Hamilton Accies before he went out and had title success and tasted European football with Larne. Share Comments **Sporting president slams Gyokeres' agent** Sporting CP president Federico Varandas has hit out at Viktor Gyokeres' agent as the Swede attempts to force a move. The striker could go on STRIKE as he feels the Lisbon club have reneged on an agreement to let him leave for less than his miniumum fee release clause. Arsenal, Man Utd and Chelsea have all been linked with the former Coventry City stirker, who is expected t leave the Portuguese double winners this summer. But Sporting supremo Varandas insists no such agreement exists with their star man and that no offers have been made for him, this summer or last season. One thing you should already know is me better. Threats, blackmail and insults don't work with me. I can guarantee that Viktor Gyökeres will not leave for 60+10 because I never promised him that. This game that the agent is playing only makes the situation worse. To this day, Sporting has not had an offer for Viktor Gyökeres, neither today nor last season. Share Comments **Digby heading for Dens** Dundee are about to sign midfielder Paul Digby. The 30-year-old is a free agent after leaving Cambridge United. Digby has travelled north for a medical and to complete the move. He will be one of Steven Pressley’s first signings. He has previously had spells with Barnsley, Ipswich Town, Mansfield Town, Forest Green Rovers and Stevenage. Digby has been flagged up by Dundee’s new recruitment department that is now identifying the players. A deal for Drey Wright is also expected to be announced in the coming days. The former Hibs wide man will make the move from St Johnstone. Share Comments **Celtic poised for Miller relaunch!** Celtic are poised torelaunch their efforts to sign Lennon Miller. The new Scotland cap is of interest to Brendan Rodgers and the Hoops, who reportedly had an offer booted out in January. However, the Scottish champions are expected to go back in for the talented teen as competition for the Fir Park starlet builds further and further. Meanwhile, James Penrice has been scouted amid a left-back hunt. However, that won't necessarily mean Celtic will pursue a deal for the Hearts man. Share Comments **That's a wrap!** Our transfer Q&A with resident guru Scott Burns has come to an end. Thank you for all your questions! Stick with us throughout the day as we bring you all the latest done deals, breaking news and rumours from across the SPFL and beyond. Share Comments **Anything imminent at Falkirk?** Could be some big contract news pending. Share Comments **'Hibs latest? Anything in Porto rumours?'** Xavier Simons was up last week but is also talking to other clubs. Should be a decision very soon. It is still the waiting game with Nectarios Triantis and on Rocky Bushiri’s contract. They are also interested in a versatile defender from England who has previous Scottish Premiership experience. Ryan Porteous would be dependent on Rocky Bushiri’s decision. Hibs tried to get him in January but haven’t renewed that interest this summer. They could, however, if Bushiri was to decide he was to move on. Share Comments **Danny Armstrong to Aberdeen?** Danny Armstrong is a player that has been recommended to Jimmy Thelin from within the club. It was first flagged up ahead of January. The manager had other preferences at that point. The one thing is that Aberdeen need to bring in more Scottish players. There are a few clubs interested in Armstrong but the last I head, Hull City were well-positioned. I don’t know if that has changed or not now they are under new management. Aberdeen would certainly have the finances to do it. Share Comments Celtic FC Celtic Transfer News Footballblog Transfer Talk Rangers FC Transfer News Rangers FC Aberdeen FC Hibernian FC Hearts FC Scottish Premiership English Premier League Manchester United FC Sport all Most Read Most Recent Most Read Most Recent News Sport Celebs Life & Style Follow us mynewsassistant In Your Area About Us Contact Us Work for us Got A Story? Local News Cookie Notice Advertising Marketplace Book an Ad Marketplace Beauty Box Subscription Yimbly Shop Jobs Buy a Photo Competition Rules How to Complain Corrections & Clarifications Google Survey Privacy Notice AI Notice Sunday Mail Centenary Fund Paper Subscription to the Daily Record and Sunday Mail Paper Subscription to the Paisley Daily Express Newsletters Signup Syndication & Licensing Terms and Conditions Notifications and alerts help © 2025 Scottish Daily Record and Sunday Mail Ltd"}