{"id": 774, "name": "KRBD - NPR - Ketchikan", "domain": "krbd.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.krbd.org/2025/05/20/ketchikan-middle-school-principal-is-finalist-for-national-award/", "title": "Ketchikan Middle School Principal Is Finalist For National Award", "content": "FCC Public File Contact Us Program Schedule NewsLocal NewsSoutheast NewsAlaska NewsNational News Local News Southeast News Alaska News National News Local News Southeast News Alaska News National News ContributeGive NowUpdate Membership InfoMembership FAQs Give Now Update Membership Info Membership FAQs Give Now Update Membership Info Membership FAQs Sponsorship Community Calendar Where to Tune in About UsAbout KRBDThe StationContactCoastAlaskaKRBD Board of DirectorsKRBD Board BylawsKRBD StaffCommunity Advisory BoardMission Statement/Financial Statement/Code of Integrity/Diversity StatementKRBD PoliciesKRBD Commentary PolicyCommunity Calendar Guidelines About KRBD The Station Contact CoastAlaska KRBD Board of DirectorsKRBD Board Bylaws KRBD Board Bylaws KRBD Staff Community Advisory Board Mission Statement/Financial Statement/Code of Integrity/Diversity Statement KRBD PoliciesKRBD Commentary PolicyCommunity Calendar Guidelines KRBD Commentary Policy Community Calendar Guidelines About KRBD The Station Contact CoastAlaska KRBD Board of DirectorsKRBD Board Bylaws KRBD Board Bylaws KRBD Board Bylaws KRBD Staff Community Advisory Board Mission Statement/Financial Statement/Code of Integrity/Diversity Statement KRBD PoliciesKRBD Commentary PolicyCommunity Calendar Guidelines KRBD Commentary Policy Community Calendar Guidelines KRBD Commentary Policy Community Calendar Guidelines Wish List Job Opportunities Select Page **Ketchikan middle school principal is finalist for national award** Posted by Jack Darrell |May 20, 2025 A Ketchikan principal is one of three finalists for a national award. Earlier this year, Schoenbar Middle School Principal Sheri Boehlert was namedAlaska’s Principal of the Yearby a statewide association of principals. Now, she’s in the final running for National Middle School Principal of the Year. The title is given out by the National Association of Secondary School Principals. Boehlert has taught in Ketchikan her entire career, first as a teacher and principal at Point Higgins Elementary. And then as the Schoenbar Principal for nearly a decade. While she led Point Higgins, the school received a national Blue Ribbon award for excellence in public education. Boehlert said that she is focused on using data to change their approach to education. “So, we really have been moving towards becoming a true ‘middle school,’ which really focuses on building connections, building relationships, not only student-to-student, but student-to-teacher, student-to-school, to the community, school-to-parents, really kind of developing an approach that really supports the whole student,” Boehlert said during an interview in February. Ronn Nozoe leads the National Association of Secondary School Principals. He said in a statement that Boehlert and the other finalists have found creative ways to meet the challenges facing the modern education system. Nozoe referenced research from the Wallace Foundation that found that students with effective principals gain up to three months of additional learning on average every year. The winner will be announced at a gala in Seattle in July. Boehlert will also head to Washington, D.C. this fall to represent Alaska at a national summit for school principals. Share: © 2024 Rainbird Community Radio FCC Public File Contact Us"}