{"id": 186, "name": "Canary Media", "domain": "canarymedia.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.canarymedia.com/articles/electric-vehicles/how-to-get-the-most-out-of-your-electric-vehicle-in-the-winter", "title": "How To Get The Most Out Of Your Electric Vehicle In The Winter", "content": "How to get the most out of your electric vehicle in the winter Donate Solar Wind Batteries Electrification U.S. regionsNortheastSoutheastMidwestWest Northeast Southeast Midwest West Northeast Southeast Midwest West NewslettersSubscribe to Canary Media newslettersYou selected1newsletters **Subscribe to Canary Media newsletters** **Subscribe to Canary Media newsletters** EventsBrowse all White papersUnderstand the True Cost Impact of 2025 Tariffs on Battery SystemsBenchmarking solar's performance gap: Insights from 193GW of analysisFrom Grid Challenge to Grid Asset: Data Center Load FlexibilityTapping Residential Capacity to Power an Evolving GridBrowse all **Understand the True Cost Impact of 2025 Tariffs on Battery Systems** **Benchmarking solar's performance gap: Insights from 193GW of analysis** **From Grid Challenge to Grid Asset: Data Center Load Flexibility** **Tapping Residential Capacity to Power an Evolving Grid** **Understand the True Cost Impact of 2025 Tariffs on Battery Systems** **Understand the True Cost Impact of 2025 Tariffs on Battery Systems** **Benchmarking solar's performance gap: Insights from 193GW of analysis** **Benchmarking solar's performance gap: Insights from 193GW of analysis** **From Grid Challenge to Grid Asset: Data Center Load Flexibility** **From Grid Challenge to Grid Asset: Data Center Load Flexibility** **Tapping Residential Capacity to Power an Evolving Grid** **Tapping Residential Capacity to Power an Evolving Grid** Solar Wind Batteries Electrification View All Topics U.S. regionsNortheastSoutheastMidwestWest Northeast Southeast Midwest West Northeast Southeast Midwest West Newsletters Events White papers Canary MediaAboutOur teamCareersDonateSupportersSponsorships Canary Media About Our team Careers Donate Supporters Sponsorships Canary Media About Our team Careers Donate Supporters Sponsorships View all topicsAir travelBatteriesCanary MediaCarbon captureCarbon removalCarbon-free buildingsClean aluminumClean energyClean energy jobsClean energy manufacturingClean energy supply chainClean fleetsClean industryClimate crisisClimate justiceClimatetech financeCorporate procurementCultureDistributed energy resourcesElectric vehiclesElectrificationEmissions reductionEnergy efficiencyEnergy equityEnergy marketsEnergy storageENNEV chargingFood and farmsFossil fuelsFun stuffGeothermalGreen steelGrid edgeGuides and how-tosHeat pumpsHydrogenHydropowerJust transitionLand useLiquefied natural gasLong-duration energy storageMarine transportMethaneNuclearOcean energyOffshore windPolicy & regulationPoliticsPublic transitRecycling renewablesSolarSponsoredTransmissionTransportationUtilitiesVirtual power plantsWindWorkforce diversity Air travel Batteries Canary Media Carbon capture Carbon removal Carbon-free buildings Clean aluminum Clean energy Clean energy jobs Clean energy manufacturing Clean energy supply chain Clean fleets Clean industry Climate crisis Climate justice Climatetech finance Corporate procurement Culture Distributed energy resources Electric vehicles Electrification Emissions reduction Energy efficiency Energy equity Energy markets Energy storage ENN EV charging Food and farms Fossil fuels Fun stuff Geothermal Green steel Grid edge Guides and how-tos Heat pumps Hydrogen Hydropower Just transition Land use Liquefied natural gas Long-duration energy storage Marine transport Methane Nuclear Ocean energy Offshore wind Policy & regulation Politics Public transit Recycling renewables Solar Sponsored Transmission Transportation Utilities Virtual power plants Wind Workforce diversity Air travel Batteries Canary Media Carbon capture Carbon removal Carbon-free buildings Clean aluminum Clean energy Clean energy jobs Clean energy manufacturing Clean energy supply chain Clean fleets Clean industry Climate crisis Climate justice Climatetech finance Corporate procurement Culture Distributed energy resources Electric vehicles Electrification Emissions reduction Energy efficiency Energy equity Energy markets Energy storage ENN EV charging Food and farms Fossil fuels Fun stuff Geothermal Green steel Grid edge Guides and how-tos Heat pumps Hydrogen Hydropower Just transition Land use Liquefied natural gas Long-duration energy storage Marine transport Methane Nuclear Ocean energy Offshore wind Policy & regulation Politics Public transit Recycling renewables Solar Sponsored Transmission Transportation Utilities Virtual power plants Wind Workforce diversity About Our team Careers Donate Supporters Sponsorships **How to get the most out of your electric vehicle in the winter** 10 February 2025 Link copied to clipboard Canary Media’sElectrified Lifecolumn shares real-world tales, tips, and insights to demystify what individuals can do to shift their homes and lives to clean electric power. Andrew Garberson isn’t worried about his electric vehicle handling cold winters. He recently drove hisEVto the gym when the temperature where he lives in Des Moines, Iowa, was a biting4degrees Fahrenheit. A polar vortex had brought a brutal wind,​“the kind that whistles in the cracks of the car doors when you drive.” Garberson relies on his electric truck, a graphite-gray Rivian, for year-round family road trips to see his parents, who live a few hours away.​“My car will drive200miles in freezing conditions in the Midwest,” saidthe head of growth and researchatRecurrent, a company that aggregates data onbattery healthfrom more than29,000EVs across the United States. Switching from a gas car to anEVisone the biggest actionsan individual can take to reduce their emissions. But EVs have gotten something of abad rep in cold weather. It’s true that they,like gas cars, lose range as temperatures fall: Depending on theEV, the drop can be16% to46%. That loss may be anxiety-provoking, especially forEVowners-to-be. From Garberson’s perspective, the criticisms are overblown. EVs work even in the most bone-chilling climates across the continental U.S., he said. In any case, Recurrent has found that knowledge and experiencego a long way toward relieving those fears. Plenty of frosty regions are embracing electric cars. Just look at Chicago. Despite its freezing winters, it’s one of the top cities forEVregistrations, with more than25,000in the12months ending in June2024, according to Experian’s most recent available data. Outside the U.S., the trend holds, too: In Norway, where temperatures can drop below -4˚F, nearly9out of10new cars sold in2024were fully electric. In this article, we’ll dive into how to get the most winter range out of anEV. First up is a keyEVfeature to look for if you’re still shopping. Then, for those who already have an electric car, Garberson shares his top range-extending strategies. **Heat pumps boost winterEVrange** EVrange shrinks in the cold partly because the chemical reaction in their massive lithium-ion batteries slows down. But the biggest reason for winter range decline is the need to keep passengers warm, Garberson said. Gas carsuse the waste heatgenerated from the internal combustion engine for cabin heating. EVs don’t have an engine (they have amotor), so they don’t produce enough accidental heat to keep occupants cozy in frigid weather. Instead, EVs siphon energy from the battery to heat the cab, leaving less for propulsion. EVs can either make heat with an electric-resistance heater, which is like turning on a toaster, or much more efficientlymoveheat from the outdoors into the car using a heat pump. Heat pumpsare famous for their critical role in decarbonizing space heating in buildings. They don’t burn fossil fuel, and they’re typically two to three times as efficient as gas and electric-resistance systems, even below freezing. But the tech has also made its way intoclothes dryersandwater heaters. Now found in some EVs, heat pumps improve range by8% to10%in cold conditions, according to Recurrent. According to Recurrent’sanalysis, electric vehicles with the best winter range tend to have heat pumps, including the Tesla Models X, S,3, and Y; Audi e-tron; and Hyundai Ioniq5and Kona. ‘I’ll drive what she’s driving’: This campaign wants more women to try EVs **‘I’ll drive what she’s driving’: This campaign wants more women to try EVs** **‘I’ll drive what she’s driving’: This campaign wants more women to try EVs** **‘I’ll drive what she’s driving’: This campaign wants more women to try EVs** Chart: A quarter of cars sold in2025will be battery-powered **Chart: A quarter of cars sold in2025will be battery-powered** **Chart: A quarter of cars sold in2025will be battery-powered** **Chart: A quarter of cars sold in2025will be battery-powered** Chart: Tesla is losing its grip onEVbuyers in theUS **Chart: Tesla is losing its grip onEVbuyers in theUS** **Chart: Tesla is losing its grip onEVbuyers in theUS** **Chart: Tesla is losing its grip onEVbuyers in theUS** It’s worth pointing out that heat pumps themselves are less effective as temperatures drop. Even so, EVs with heat pumps offer better range than those with electric-resistance heating. Recurrent points out that at55˚F, a heat pump reduced range by20% while a resistance heater lowered it by33%. As the weather gets colder, the difference in range between EVs with heat pumps and those with resistance heaters shrinks. To be clear, EVs work well in the winter even without heat pumps, Garberson said. His Rivian truck doesn’t have one, and on a day-to-day basis, he doesn’t even notice the decline in range. He charges at home, which makes topping up easy. For longer road trips, cold weather might mean he needs one more charging stop than he normally would. **Strategies to maximize winterEVrange** Heating technology aside, drivers can take steps to get more out of their EVs in the cold. Recurrent’s Garberson offered his top three range-saving strategies for winterEVdrivers. Prewarm yourEVwhile it’s plugged in.Garberson’s garage isn’t climate-controlled, so his vehicle gets chilly when the weather does. About10minutes before he hops in, he uses his car’s app to warm up the cabin. Pulling electricity from the wall outlet means he won’t have to use the battery to bring his car from4˚F to a toasty70°F. Set your charging limit higher.Batteries are happiest when balanced at50% charge, Garberson said. Because huge charge-level swings are harder on the battery, Recurrent recommends keeping it between20% and80% full. But​“let’s eliminate anxiety from the discussion and just charge cars a bit more in cold conditions,” he advised. If you normally charge to70% to keep the battery healthy, as Garberson does, increase it to80% in the winter. When you’re headed to a fast charger, set the destination in the car’sGPS, a feature in most modern EVs.Letting theEVknow will allow it to start preconditioning the battery so it’s ready to charge when you get there. Otherwise, you may need to wait15to20minutes at the charger for the battery to warm up sufficiently, Garberson said.​“It’s just amazing how [electric] vehicles have been designed over the last few years to help drivers without them even knowing.” One more tip for your kit? Turning on the heated steering wheel and heated seats​“is a far more efficient way” to warm yourself and passengers than heating up the air in the car’s cabin, Garberson said. Once the car is prewarmed and you’re on the road, you could dial down the thermostat and use the targeted heat features to keep you cozy. But most importantly, Garberson added, do what you need in order to keep yourself and your passengers happy. He’s father to a one-year-old, so​“relying on heated seats is not part of my driving equation.” Besides,​“I will admit I am kind of a sucker for creature comforts,” Garberson said.​“I need heat any way I can get it.” Manufacturers provide even more advice on how to extend the winter range of your particularEVmodel, so be sure to check out their online guides. A little planning and know-how can go a long way toward a smoothEVexperience in frosty weather, Garberson said. Winter takes a bite out of his EV’s range, yes, but​“I get by just fine.” Electric vehicles Emissions reduction Guides and how-tos Alison F. Takemurais staff writer at Canary Media. She reports on home electrification, building decarbonization strategies, and the clean energy workforce. **read next** SolarThis food bank saved big with solar. GOP cuts could crush similar efforts. Solar **This food bank saved big with solar. GOP cuts could crush similar efforts.** Solar **This food bank saved big with solar. GOP cuts could crush similar efforts.** **This food bank saved big with solar. GOP cuts could crush similar efforts.** Policy & regulationA proposal for a Massachusetts wood-burning plant is back from the dead Policy & regulation **A proposal for a Massachusetts wood-burning plant is back from the dead** Policy & regulation **A proposal for a Massachusetts wood-burning plant is back from the dead** **A proposal for a Massachusetts wood-burning plant is back from the dead** Clean industryThis start-up turns steel and aluminum waste into usable metals Clean industry **This start-up turns steel and aluminum waste into usable metals** Clean industry **This start-up turns steel and aluminum waste into usable metals** **This start-up turns steel and aluminum waste into usable metals** PoliticsWill Senate Republicans block the climate law rollback? Politics **Will Senate Republicans block the climate law rollback?** Politics **Will Senate Republicans block the climate law rollback?** **Will Senate Republicans block the climate law rollback?** **Subscribe to our daily newsletter** About. Sponsorships. Got a tip?. Contact. Privacy policy. Careers. RSSfeed © 2025 Canary Media"}