{"id": 431, "name": "Fact/Myth", "domain": "factmyth.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://factmyth.com/factoids/there-are-more-possible-iterations-of-a-game-of-chess-than-there-are-atoms-in-the-known-universe/", "title": "There Are More Possible Iterations Of A Game Of Chess Than There Are Atoms In The Known Universe", "content": "Facts Myths Blog **There are more possible iterations of a game of chess than there are atoms in the known universefact** One claim has caught our attention in a world full of facts and mind-boggling comparisons: “There are more possible iterations of a game of chess than atoms in the known universe.” This statement may seem unfathomable, so let’s do the math. **The Claim** The claim states that the number of potential games of chess, or unique sequences of moves, exceeds the number of atoms in the known universe. **Let us examine the number of atoms in the known universe.** According to a 2013 study by the European Space Agency’s Planck mission, the observable universe contains around 10^80 atoms (Planck Collaboration, 2013). This number is already staggering and challenging to comprehend. **Now let us turn our attention to chess.** In 1950, mathematician Claude Shannon calculated an estimate for the game-tree complexity of chess, which he placed at around 10^120 (Shannon, 1950). This figure represents the number of possible iterations or unique game move sequences. **Comparing the Numbers** When we put the numbers side by side, we can see that there are indeed more possible iterations of a game of chess (10^120) than atoms in the known universe (10^80). This comparison is astonishing and demonstrates the incredible complexity and depth of the chess game. The claim that a game of chess has more possible iterations than atoms in the known universe is valid. While the number of atoms in the universe is incomprehensibly large, the possibilities in a game of chess are even more remarkable. By understanding this fact, we can appreciate the depth and complexity of the chess game and feel empowered by the knowledge that such a seemingly simple board game can surpass even the vastness of the universe in terms of possibilities. Planck Collaboration. (2013). Planck 2013 results. I. Overview of products and scientific results. Astronomy & Astrophysics, 571, A1.https://doi.org/10.1051/0004-6361/201321529 Shannon, C. E. (1950). Programming a computer for playing chess. Philosophical Magazine, 41(314), 256-275. Walt Whitney is the co-founder of Dog Media Solutions. He is our head editor and is, along with his other founder Thomas DeMichele behind many popular websites, including FactMyth.com, ObamaCareFacts.com,... **Leave a commentCancel reply** FactMyth Δ **Related Factoids** “e” is Just as Important as Pi There are more possible iterations of a game of chess than there are atoms in the known universe There is a Difference Between Chaos and Randomness There are No Straight Lines or Perfect Circles The Term “Computer” Used to Refer to Humans There is a Limit to How Many Times You Can Fold a Piece Paper Slots Account for More Revenue than all other Casino Games Combined Fibonacci Introduced the Modern Numeral System to Europe The More Instances Considered, The More Theoretical and Actual Results Converge Probability Theory Was Invented to Solve a Gambling Problem **Related Subjects** Mathematics35 Mathematics and Logic38 © 2025 Fact / Myth By continuing to use the site, you agree to the use of cookies.more informationAccept The cookie settings on this website are set to \"allow cookies\" to give you the best browsing experience possible. If you continue to use this website without changing your cookie settings or you click \"Accept\" below then you are consenting to this. Close"}