{"id": 329, "name": "Escanaba Daily Press", "domain": "dailypress.net", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.dailypress.net/opinion/local-columns/2025/06/what-to-know-about-trumps-deployment-of-marines-and-national-guard/", "title": "What To Know About Trumps Deployment Of Marines And National Guard", "content": "NewsLocal NewsCommunityBusiness NewsMichigan NewsNational NewsInternational NewsReal Estate Local News Community Business News Michigan News National News International News Real Estate Local News Community Business News Michigan News National News International News Real Estate SportsLocal SportsOutdoorsMichigan SportsNational Sports Local Sports Outdoors Michigan Sports National Sports Local Sports Outdoors Michigan Sports National Sports OpinionLocal columnsEditorialLetters to the Editor Local columns Editorial Letters to the Editor Local columns Editorial Letters to the Editor LifeFeaturesEngagementsWeddingsHealth Features Engagements Weddings Health Features Engagements Weddings Health Obituaries Special Sections Classifieds Jobs Garage Sales Contact InformationContact UsSubscribeAdvertiseStatement of ValuesTerms of Service Contact Us Subscribe Advertise Statement of Values Terms of Service Contact Us Subscribe Advertise Statement of Values Terms of Service Submit News Public NoticesBrowse NoticesPlace a Notice Browse Notices Place a Notice Browse Notices Place a Notice News Sports Opinion Life Obituaries Classifieds Jobs Garage Sales Place Notices SUBSCRIBE SUBSCRIBE June 11, 2025 | Today's Paper | Submit News | Subscribe Today Today's Paper | Subscribe Today **What to know about Trump’s deployment of Marines and National Guard** **** Jun 11, 2025 LOS ANGELES (AP) — Marines and additional National Guard troops headed to Los Angeles on Tuesday, sent in by President Donald Trump in response to protests over immigration raids despite the objections of the governor and local leaders. The authorization came amid mostly peaceful protests in country’s second-largest city on Monday. California officials sued Trump on Monday to roll back the administration’s National Guard deployment, saying the president trampled on the state’s sovereignty. Local officials and Democratic Gov. Gavin Newsom don’t want the military deployed in the city, and the police chief said it creates logistical challenges for safely handling protests. The 2,000 Guard members authorized Monday are an addition to the 2,100 the president mobilized for the protests Sunday. Trump has also deployed 700 Marines to help them, which the Pentagon said Tuesday will cost taxpayers $134 million. Trump, a Republican, said in a social media post that the city would have been “completely obliterated” if he hadn’t sent Guard members. This appears to be the first time in decades that a state’s National Guard was activated without a request from its governor. Here are some things to know about the lawsuit, the protests and the troop deployments: State sues the president over troops California Attorney General Rob Bonta filed a lawsuit over the use of National Guard troops following the first deployment, telling reporters Monday that Trump had “trampled” the state’s sovereignty. “We don’t take lightly to the president abusing his authority and unlawfully mobilizing California National Guard troops,” Bonta said. He sought a court order declaring Trump’s use of the Guard unlawful and asking for a restraining order to halt the deployment. Bonta has said the lawsuit became necessary once Trump escalated the number of troops, leading to growing unrest. Newsom vs. Trump Trump and his border czar, Tom Holman, traded taunts with Newsom about the possibility of arresting the governor if he interfered with federal immigration enforcement efforts. “I would do it if I were Tom. I think it’s great,” Trump said. Newsom responded in a post on X: “The President of the United States just called for the arrest of a sitting Governor. This is a day I hoped I would never see in America.” Newsom has called the presence of troops on the streets of Los Angeles both “illegal and immoral.” “This isn’t about public safety. It’s about stroking a dangerous President’s ego,” Newsom said on social media. In a post Monday, Newsom called the deployment of Marines “a blatant abuse of power” and said officials would sue to stop it. “U.S. Marines serve a valuable purpose for this country — defending democracy. They are not political pawns,” Newsom posted on social media. “The Courts and Congress must act. Checks and balances are crumbling.” What’s behind the demonstrations? The protests were sparked by Trump’s immigration crackdown in the area. They started Friday in downtown Los Angeles before spreading on Saturday to Paramount and neighboring Compton. Federal agents arrested immigrants in LA’s fashion district, in a Home Depot parking lot and at several other locations on Friday. The next day, they were staging at a Department of Homeland Security office near another Home Depot in Paramount, which drew out protesters who suspected another raid. Federal authorities later said there was no enforcement activity at that Home Depot. Demonstrators attempted to block Border Patrol vehicles by hurling rocks and chunks of cement. In response, agents in riot gear unleashed tear gas, flash-bang explosives and pepper balls. The weeklong tally of immigrant arrests in the LA area climbed above 100, federal authorities said. Many have also been arrested while protesting. What’s happening elsewhere? Protest over immigration raids have happened in several major cities, though none have reached the scale of those in Los Angeles. Hundreds of protestors organized by the Austin, Texas, chapter of the Party for Socialism and Liberation gathered near the state Capitol before moving toward the federal building that houses an Immigration and Customs Enforcement office. Authorities appeared to use chemical irritants to disperse a crowd, and Republican Gov. Greg Abbott said authorities arrested more than a dozen protesters. “Peaceful protesting is legal,” Abbott posted on X. “But once you cross the line, you will be arrested.” In Dallas, hundreds of people demonstrated on a city bridge for hours before police determined the rally to be “unlawful.” Police said one person was arrested and that charges were pending. In Boston, hundreds gathered on City Hall Plaza on Monday to protest the deployment of the National Guard in Los Angeles and the detainment of union leader David Huerta. Protesters, some holding signs reading “Massachusetts stands with our neighbors in Los Angeles” and “Protect our immigrant neighbors,” shouted “Come for one, come for all” and “Free David, free them all.” Touting Florida’s efforts to lead the country in cooperating with federal immigration enforcement, Republican Gov. Ron DeSantis said law enforcement in his state is ready to crack down if demonstrations there boil over into riots, warning that “commandeering roadways” isn’t a form of “peaceful protest” in his eyes. “The minute you cross into attacking law enforcement, any type of rioting, any type of vandalism, looting, just be prepared to have the law come down on you,” DeSantis added. “And we will make an example of you, you can guarantee it.” Demonstrations also took place in Chicago, San Francisco and inside Trump Tower in Manhattan. More than a dozen were planned in all, including one that attracted hundreds in Providence, Rhode Island. What’s the mood in Los Angeles? A large crowd gathered Monday in a park across from City Hall to protest the arrest of Huerta, a prominent labor leader whose detainment Friday while protesting immigration raids became a rallying cry for people angry over the administration’s crackdown. He was later released on $50,000 bond. Monday’s demonstrations were less raucous than Sunday’s, with thousands peacefully attending the rally at City Hall and hundreds protesting outside a federal complex that includes a detention center where some immigrants are being held. The protests have been driven by anger over Trump’s stepped-up enforcement of immigration laws that critics say are tearing apart migrant families. On Los Angeles Street, a major thoroughfare that runs through the city’s downtown, the smell of fire hung as workers swept debris among the charred remnants of cars that were set ablaze during the protests. Police cars blocked streets as crews painted over graffiti scrawled on surrounding buildings. **Newsletter** **Local columns** **Local columns** **Almanac** **Almanac** Today is Tuesday, June 11, the 163rd day of 2024. There are 203 days left in the year. Today's Highlight in ... **What to know about Trump’s deployment of Marines and National Guard** **What to know about Trump’s deployment of Marines and National Guard** LOS ANGELES (AP) — Marines and additional National Guard troops headed to Los Angeles on Tuesday, sent in by ... **Escape and return** **Escape and return** **The Human Rights Campaign** **The Human Rights Campaign** **What Trump ordering an investigation into Biden’s actions might mean legally and politically** **What Trump ordering an investigation into Biden’s actions might mean legally and politically** WASHINGTON (AP) — President Donald Trump has ordered an investigation into pardons and other executive actions ... **Almanac** **Almanac** Today is Tuesday, June 10, the 161st day of 2025. There are 204 days left in the year. Today in History Today ... MOST READ **Learning to love from afar** **Learning to love from afar** **What to know about Trump's deployment of Marines and National Guard** **What to know about Trump's deployment of Marines and National Guard** **Creating a nature trail** **Creating a nature trail** **Ruth Doris Ostlund-Carlson** **Ruth Doris Ostlund-Carlson** **Political cartoon 6-11** **Political cartoon 6-11** **Briefs for Wednesday, June 11, 2025** **Briefs for Wednesday, June 11, 2025** **Newsletter** **Starting at $3.50/week.** **Subscribe Today** **Subscribe Today** NewsLocal NewsCommunityMichigan NewsObituaries Local News Community Michigan News Obituaries Local News Community Michigan News Obituaries SportsLocal SportsOutdoorsMichigan SportsNational Sports Local Sports Outdoors Michigan Sports National Sports Local Sports Outdoors Michigan Sports National Sports OpinionLocal columnsEditorialLetters to the Editor Local columns Editorial Letters to the Editor Local columns Editorial Letters to the Editor LifeFeaturesEntertainmentEngagementsWeddings Features Entertainment Engagements Weddings Features Entertainment Engagements Weddings ContactSubmit NewsAdvertiseGarage SalesContact Us Submit News Advertise Garage Sales Contact Us Submit News Advertise Garage Sales Contact Us Copyright © 2025 Ogden News Publishing of Michigan, Inc. | https://www.dailypress.net | 600 Ludington St., Escanaba, MI 49829 | 906-786-2021"}