{"id": 1579, "name": "WHEC - Rochester News", "domain": "whec.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.whec.com/top-news/news10nbc-investigates-blue-heron-golf-club-played-by-golf-legends-will-transition-to-nine-hole-layout-amid-housing-development-concerns/", "title": "News10nbc Investigates Blue Heron Golf Club Played By Golf Legends Will Transition To Nine Hole Layout Amid Housing Development Concerns", "content": "WatchLivestream10 TalkProgramming GuideMeTV RochesterSunday MassRochester in FocusRequest Video NewsInvestigatesIn-DepthLocal NewsConsumer AlertsFact CheckGood QuestionNew York State ExposedUS HeadlinesPolitical NewsInternational NewsHealth NewsBusiness NewsTechnology NewsScience NewsStrange NewsEntertainment News First Alert WeatherClosings and DelaysWeatherCurrent ConditionsRochester 10-Day ForecastInteractive Rochester RadarFirst Alert Weather AppFirst Alert Live Camera NetworkFirst Alert Weather In-DepthTraffic and Travel Conditions SportsSportsBuffalo BillsBuffalo Bills Training CampHigh School SportsScholar AthletePlay of the Week Contact UsContact News10NBCNewsletterShare a photo or video with News10NBCNews TeamCareersRequest VideoAbout News10NBCAdvertisingNews and Weather AppsNews10NBC on Alexa ContestsSahlen's Six Hours of The Glen GiveawayContest Rules CommunityCommunity CalendarSusan B. Anthony Museum & House ExpansionRochester Gas PricesPet of the WeekDo The Right ThingESL Heart of Service Awards Careers **News10NBC Investigates: Blue Heron Golf Club, played by golf legends, will transition to nine-hole layout amid housing development concerns** WALWORTH, N.Y. – There is concern around a local golf course played by Jack Nicklaus, Arnold Palmer and John Daly. The concern at Blue Heron Golf Club in Wayne County is that the new owners want to build homes on the fairways. The golf course sent a note to members yesterday saying next year, Blue Heron will “transition to a nine-hole layout.” The message began “We want to take a moment to address of the concerns that have been circulating regarding the future of the golf course.” The note said the course will remain open for the “remainder of the season” and that “no refunds will be issued.” There is awebsiteof a company advertising to people to build their dream homes here. The website is Windward Lake Homes LLC. The video on the main page of the website is the 18th hole at Blue Heron. The page says “build your dream home” and it includes a map that highlights the border of the golf course. New York State Department of State records show Windward Lake Homes LLC was created on January 6, 2025. The name listed is William Calder, the father of the club’s new owner. The owner, Jason Calder, texted News10NBC Chief Investigative Reporter Berkeley Brean, writing “At this time, it’s too preliminary to discuss. My family won’t have an application turned into the town for several months.” “After having this beautiful view the last thing we want to look at is the back of a house,” Joyce Stadmiller said as she looked out over the course from her deck.Stadmiller has lived on the course for 26 years. Berkeley Brean, News10NBC: “What is it that you’re concerned about?” Joyce Stadmiller, lives on Blue Heron Golf Course: “Being honest we’re concerned what this will do to the value of our home.” Brean talked to members after they putted out on 14. Brean: “Is there one thing you want to hear from the owners?” Joe Seil, Blue Heron member: “Yeah, we’d just like them to be transparent and what’s their real plan. We had a meet and greet a couple of months ago and this topic came up and they didn’t say anything about building homes on the golf course. And I don’t know if that’s their plan long term.” Jack Nicklaus helped design Blue Heron. Arnold Palmer played a skins game there in 1995. Blue Heron is one of 61 member courses of the Rochester District Golf Association. In the last 20 years, at least 10 local courses closed and one never opened. Brean received the following statement from the town of Walworth: “The Town of Walworth has not received an application for the Winward Lake Home Project. The new property owners have not approached any of the Walworth Town Board, Planning Board, or Zoning Board regarding any possible proposed plans for the property. Until an application is filed, the Town will refrain from discourse regarding the property as its future remains conjecture until the point of formal site application.” Some members started apetitionon Change.org. It’s nearing 800 signatures in three days. AI assisted with the formatting of this story.Click hereto see how WHEC News 10 uses AI Watch News First Alert Weather Sports Contact Us Contests Community Careers News Team Closed Captioning Information for WHEC-TV Contact News10NBC Public Files About News10NBC FCC EEO Terms of Service DMCA Notice A.I. Usage Policy Hubbard Television Group Privacy Policy Any person with disabilities who needs help accessing the content of the FCC Public file should contact Richard Reingold atrreingold@whec.comor 585-546-1701 This website is not intended for users located within the European Economic Area.©WHEC-TV, LLCA Hubbard Broadcasting Company"}