{"id": 1815, "name": "The Organic Prepper", "domain": "theorganicprepper.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.theorganicprepper.com/how-to-make-homemade-artisanal-jam-without-pectin/#comment-1067519", "title": "How To Make Homemade Artisanal Jam Without Pectin", "content": "Prepping & Survival Self Reliance Commentary Health & Mindset Courses & Books Prepping & Survival Self Reliance Commentary Health & Mindset Courses & Books Preserving,Recipes **How to Make Homemade Artisanal Jam Without Pectin** Daisy Luther June 6, 2025 41 Comments If you're new here, you may want to subscribe to myRSS feed. Thanks for visiting! **Author ofBe Ready for AnythingandBloom Where You’re Plantedonline course** Nothing is more of a summer tradition here at our house than making enough homemade jam from fresh fruit to see us through the winter. Get some fruit, some sugar, and a box of pectin and you’re good to go, right? Not so fast! You can actually make jam without pectin if you use my favoriteold-fashioned methodof thickening your product. (Find this canning recipe and many more in my book,The Prepper’s Canning Guide.) **Why You Might Want to Make Your Jam WITHOUT Pectin** As the name of this website implies, we like to keep things nourishing and natural. A while back, I spent some time reading up onstore-bought pectinand I was very unhappy to discover the jams I had been making for my family have been tainted with GMOs. I had unknowingly been contaminating the carefully sourced fruit and pricey turbinado sugar with the very things I strive to avoid, and I hadn’t even given it a second thought. Most brands exclaim breathlessly, “All natural pectin” or “Made from real fruit”. And this is true – it does originate from fruit. Sound okay, right? Don’t be deceived. This misleading label makes it sound as though this is nothing more than some powdered fruit. Storebought pectin contains additives that are most likely genetically modified. Dextrose is generally made from corn products (GMOs that are absolutely SOAKED in glyphosate). It is made from cornstarch, the main ingredient in good old High Fructose Corn Syrup. Don’t let anyone tell you that citric acid is “just Vitamin C”. It is derivedfrom GMO mold. Not only does store-bought pectin contain unsavory ingredients, but it is also very highly processed.According to Wikipedia, this is how it is produced: The main raw materials for pectin production are dried citrus peel or apple pomace, both by-products of juice production. Pomace from sugar beet is also used to a small extent. From these materials, pectin is extracted by adding hot dilute acid at pH-values from 1.5 – 3.5. During several hours of extraction, the protopectin loses some of its branching and chain length and goes into solution. After filtering, the extract is concentrated in vacuum and the pectin then precipitated by adding ethanol or isopropanol. An old technique of precipitating pectin with aluminium salts is no longer used (apart from alcohols and polyvalent cations, pectin also precipitates with proteins and detergents). Alcohol-precipitated pectin is then separated, washed and dried. Treating the initial pectin with dilute acid leads to low-esterified pectins. When this process includes ammonium hydroxide, amidated pectins are obtained. After drying and milling, pectin is usually standardised with sugar and sometimes calcium salts or organic acids to have optimum performance in a particular application. (source) **Old-fashioned jam-making methods** So, if you want to avoid GMOs and processed foods, what’s a homemade-jam making mama to do? Jam has been around for thousands of years. The first known book of jam recipes was written in Rome in the 1st century (source). Since I’m pretty sure our ancestors didn’t have those handy little boxes ofSure-JellorRealFruitorCertositting in their pantries, I set out to learn how they made a thick delicious preserve to spread on their biscuits. My first attempt at breaking up with the box was to make my own pectin with green apples. While I ended up with a tasty product, it wasn’t really jam-like. It’s possible, considering the time of year, that the apples were too ripe to allow this to work for me. You can find instructions on how to make your own pectin from applesHERE. I continued to read recipes and methods from days gone by. It soon became clear that adding pectin wasn’t really necessary at all. In days past, the sugar and the fruit worked hand-in-hand to create the desired consistency. If you are determined to use pectin (some fancier jams are nicer with a thicker set-up) I strongly recommendPomona’s Universal Pectin, a non-GMO, non-toxic pectin. Don’t be put off by the higher price – you can get several batches of jam from one packet of pectin, so it works out to a similar cost as the yucky stuff. I combined bits from a few different methods and finally came up with a jam that the entire family was happy with. In comparison with the boxed pectin jam, it doesn’t gel quite as much, but after trying this jam, the texture of the other now seems slightly artificial to me. This produces an artisanal jam, a softer preserve with an incredibly intense fruit flavor. When using this method, you don’t get that layer of foam that you have to skim off the top as you do with the boxed pectin method. And best of all, you get two products for the price of one. You’ll have an additional sweet juice or syrup at the end of your process. **How to Make Jam without Pectin** First of all, I want to encourage you not to be deterred by the lengthy amount of time to make this jam. Very little of that time is spent hands-on. Nearly all of it is draining time. You’ll end up cooking your fruit down for far less time than the standard pectin-included method, and your fruit will taste fruitier because it’s so concentrated. Give it a try! You’ll be hooked! 7 pounds of fresh or frozen fruit (approximately 14-20 cups) ¼ cup of lemon or lime juice 3 cups + 2 tbsp of sugar* A piece of clean, non-linty cotton fabric for draining (I used aflour sack towel. This will be permanently stained, so don’t use something you want to keep pretty.) *I’ve experimented – you can even useno sugarat all, but this seems to be the happy place for my family’s preferences. **Directions:** Prepare your fruit. For berries, this means washing them and sorting them, removing little leaves and twigs, as well as berries that are shriveled. For fruits like apples or peaches, this might mean blanching and peeling them, then removing the cores. Leave the odd green bit of fruit in, because less ripe fruit has more naturally occurring pectin than ripe fruit. Mash, finely chop, or puree your fruit. I used a blender to puree half of the fruit, and a food processor to finely chop the other half. We prefer a rough puree texture. Pour this into a large crock or non-reactive bowl, layering your fruit with half of the sugar. I use the ceramic insert from my crock-pot for this.If you aren’t using sugar, skip ahead to step 5. Leave the fruit and sugar mixture in your refrigerator overnight. The juice from the fruit will combine with the sugar and form a slightly gelled texture. Some liquid will separate from the sugar and fruit. The next day, line a colander with a flour sack towel. Place the colander into a pot to catch the liquid from the fruit and sugar mixture. Pour your fruit and sugar mixture into the fabric-lined colander.If you are not using sugar, let it drain overnight. If you are using sugar, put this back in the refrigerator for at least an hour to drain. You can let it drain for longer with no ill effect – in fact, this will result in an even thicker jam. **From this point on, you’ll be making two separate products: jam and fruit syrup.** When you’re ready to make jam, scoop the fruit out of the fabric-lined colander and place it in a pot with lots of open area to help it cook down faster. (This gives more space for the liquid to evaporate.) The liquid that you caught in the other pot is the basis for your fruit syrup (or juice if you aren’t using sugar). You’ll have about 1-2 pints of liquid. Place that on the stove and bring it to a rolling boil. Add 1/4 cup of sugar and a tbsp of lemon juice per pint and reduce heat to a simmer. I like to add one big spoonful of jam to this to add a little texture to the syrup. Meanwhile, on another burner, add lemon juice and bring your fruit and sugar mixture to a simmer, stirring frequently. After about an hour, the texture will have thickened. If you still have a great deal of liquid, you can use a fabric lined sieve to strain some more out. (You can add this liquid to the syrup.) Fillsanitized jarswith your products (syrup or jam). Process the jam in awater bath canner, according to the type of fruit you are canning andmaking adjustments for your altitude. Refer to the chart below for processing times. And there you have it…it’s easy to make an intensely fruity artisanal jam without pectin! **Universal Jam Making Chart** The processing times are based on sea level. Adjust these times based on your altitude. FRUIT SPECIAL INSTRUCTIONS PROCESSING TIME ***Note: Since this article was written, I’ve experimented with a no-sugar jam. Simply follow the other instructions but leave out the sugar and you will have a thick, delicious fruit spread.** **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Δ **41 Responses** Sharlenesays:August 3, 2016 at 3:01 pmI don’t see where you add lemon juice to the jam; just to the syrup. Is it not needed in the jam? Thank you.ReplyDaisy Luthersays:August 3, 2016 at 10:14 pmOops – thanks for catching that. I added it on step 8 🙂Reply I don’t see where you add lemon juice to the jam; just to the syrup. Is it not needed in the jam? Thank you. Daisy Luthersays:August 3, 2016 at 10:14 pmOops – thanks for catching that. I added it on step 8 🙂Reply Oops – thanks for catching that. I added it on step 8 🙂 I don’t see where you add lemon juice to the jam; just to the syrup. Is it not needed in the jam? Thank you. Daisy Luthersays:August 3, 2016 at 10:14 pmOops – thanks for catching that. I added it on step 8 🙂Reply Oops – thanks for catching that. I added it on step 8 🙂 Oops – thanks for catching that. I added it on step 8 🙂 Lorisays:August 3, 2016 at 3:04 pmWell shoot! I just made a big batch of grape jelly and blackberry jam and used pectin in both. I don’t know why I didn’t take the time to research it myself and not use the pectin. I feel so foolish! Well, now I know. Lesson learned. Thanks for sharing.Reply Well shoot! I just made a big batch of grape jelly and blackberry jam and used pectin in both. I don’t know why I didn’t take the time to research it myself and not use the pectin. I feel so foolish! Well, now I know. Lesson learned. Thanks for sharing. Well shoot! I just made a big batch of grape jelly and blackberry jam and used pectin in both. I don’t know why I didn’t take the time to research it myself and not use the pectin. I feel so foolish! Well, now I know. Lesson learned. Thanks for sharing. april in n idahosays:August 6, 2016 at 10:16 pmThis was a timely, GOD sent post! I’m tired of the pectin and TONS of sugar ending in a not so appetizing product. THANK YOU FOR DOING ALL THE WORK FOR ME.GOD bless you and your family.aprilReplyDaisy Luthersays:August 7, 2016 at 2:23 amThanks, April! I hope you enjoy your jam! 🙂Reply This was a timely, GOD sent post! I’m tired of the pectin and TONS of sugar ending in a not so appetizing product. THANK YOU FOR DOING ALL THE WORK FOR ME. GOD bless you and your family. april Daisy Luthersays:August 7, 2016 at 2:23 amThanks, April! I hope you enjoy your jam! 🙂Reply Thanks, April! I hope you enjoy your jam! 🙂 This was a timely, GOD sent post! I’m tired of the pectin and TONS of sugar ending in a not so appetizing product. THANK YOU FOR DOING ALL THE WORK FOR ME. GOD bless you and your family. april Daisy Luthersays:August 7, 2016 at 2:23 amThanks, April! I hope you enjoy your jam! 🙂Reply Thanks, April! I hope you enjoy your jam! 🙂 Thanks, April! I hope you enjoy your jam! 🙂 Suzannesays:August 9, 2016 at 6:40 pmWill coconut sugar work?ReplyDaisy Luthersays:August 9, 2016 at 7:29 pmI’m not sure – I’ve never tried that. Sorry that I can’t be more helpful. What I’d do is start with a smaller amount of jam, just in case it doesn’t turn out.Apparently it can be done safely – here’s a book review about this process. 🙂http://www.sandiegouniontribune.com/news/2016/jun/23/foodie-delves-into-preserving-using-sugar/Reply Will coconut sugar work? Daisy Luthersays:August 9, 2016 at 7:29 pmI’m not sure – I’ve never tried that. Sorry that I can’t be more helpful. What I’d do is start with a smaller amount of jam, just in case it doesn’t turn out.Apparently it can be done safely – here’s a book review about this process. 🙂http://www.sandiegouniontribune.com/news/2016/jun/23/foodie-delves-into-preserving-using-sugar/Reply I’m not sure – I’ve never tried that. Sorry that I can’t be more helpful. What I’d do is start with a smaller amount of jam, just in case it doesn’t turn out. Apparently it can be done safely – here’s a book review about this process. 🙂 http://www.sandiegouniontribune.com/news/2016/jun/23/foodie-delves-into-preserving-using-sugar/ Will coconut sugar work? Daisy Luthersays:August 9, 2016 at 7:29 pmI’m not sure – I’ve never tried that. Sorry that I can’t be more helpful. What I’d do is start with a smaller amount of jam, just in case it doesn’t turn out.Apparently it can be done safely – here’s a book review about this process. 🙂http://www.sandiegouniontribune.com/news/2016/jun/23/foodie-delves-into-preserving-using-sugar/Reply I’m not sure – I’ve never tried that. Sorry that I can’t be more helpful. What I’d do is start with a smaller amount of jam, just in case it doesn’t turn out. Apparently it can be done safely – here’s a book review about this process. 🙂 http://www.sandiegouniontribune.com/news/2016/jun/23/foodie-delves-into-preserving-using-sugar/ I’m not sure – I’ve never tried that. Sorry that I can’t be more helpful. What I’d do is start with a smaller amount of jam, just in case it doesn’t turn out. Apparently it can be done safely – here’s a book review about this process. 🙂 http://www.sandiegouniontribune.com/news/2016/jun/23/foodie-delves-into-preserving-using-sugar/ Saralenasays:August 24, 2016 at 1:56 pmHello! I have 3 questions. The first is how long will the jam last in food storage? Do you process the syrup in a water bath as well? If so how long? How long will they last in food storage or the fridge? And last can you adapt your method for any recipe? I have a spiced plum jam recipe I would to try this on! Thank you!ReplyDaisy Luthersays:August 24, 2016 at 3:51 pmHi Saralena!1) Your jam will last approximately one year, often closer to 2 years.2) Process the syrup in a water bath for the same amount of time that you process the jam.3) It will last for a few weeks to a month in the fridge after it’s opened.4) Yes – you can adapt this to any recipe. Be sure to go with the longest time recommended for processing!🙂ReplySaralenasays:August 24, 2016 at 4:11 pmThank you! I am so excited to get started! Will the syrup last up to a year as well? Thank you so much posting all of this I had no idea all of my efforts were not what I thought they were with using pectin! I threw out a few jars of peach jam I had made last year because they smelled horrible and it had two different colors! I am hoping that my family will love this new way of making jam! Thanks again!ReplyJerriannsays:June 3, 2017 at 12:19 amPlums have a lot of natural pectin. I make plum jam and jelly without pectin. Never had a problem.Reply Hello! I have 3 questions. The first is how long will the jam last in food storage? Do you process the syrup in a water bath as well? If so how long? How long will they last in food storage or the fridge? And last can you adapt your method for any recipe? I have a spiced plum jam recipe I would to try this on! Thank you! Daisy Luthersays:August 24, 2016 at 3:51 pmHi Saralena!1) Your jam will last approximately one year, often closer to 2 years.2) Process the syrup in a water bath for the same amount of time that you process the jam.3) It will last for a few weeks to a month in the fridge after it’s opened.4) Yes – you can adapt this to any recipe. Be sure to go with the longest time recommended for processing!🙂ReplySaralenasays:August 24, 2016 at 4:11 pmThank you! I am so excited to get started! Will the syrup last up to a year as well? Thank you so much posting all of this I had no idea all of my efforts were not what I thought they were with using pectin! I threw out a few jars of peach jam I had made last year because they smelled horrible and it had two different colors! I am hoping that my family will love this new way of making jam! Thanks again!Reply Hi Saralena! 1) Your jam will last approximately one year, often closer to 2 years.2) Process the syrup in a water bath for the same amount of time that you process the jam.3) It will last for a few weeks to a month in the fridge after it’s opened.4) Yes – you can adapt this to any recipe. Be sure to go with the longest time recommended for processing! 🙂 Saralenasays:August 24, 2016 at 4:11 pmThank you! I am so excited to get started! Will the syrup last up to a year as well? Thank you so much posting all of this I had no idea all of my efforts were not what I thought they were with using pectin! I threw out a few jars of peach jam I had made last year because they smelled horrible and it had two different colors! I am hoping that my family will love this new way of making jam! Thanks again!Reply Thank you! I am so excited to get started! Will the syrup last up to a year as well? Thank you so much posting all of this I had no idea all of my efforts were not what I thought they were with using pectin! I threw out a few jars of peach jam I had made last year because they smelled horrible and it had two different colors! I am hoping that my family will love this new way of making jam! Thanks again! Jerriannsays:June 3, 2017 at 12:19 amPlums have a lot of natural pectin. I make plum jam and jelly without pectin. Never had a problem.Reply Plums have a lot of natural pectin. I make plum jam and jelly without pectin. Never had a problem. Hello! I have 3 questions. The first is how long will the jam last in food storage? Do you process the syrup in a water bath as well? If so how long? How long will they last in food storage or the fridge? And last can you adapt your method for any recipe? I have a spiced plum jam recipe I would to try this on! Thank you! Daisy Luthersays:August 24, 2016 at 3:51 pmHi Saralena!1) Your jam will last approximately one year, often closer to 2 years.2) Process the syrup in a water bath for the same amount of time that you process the jam.3) It will last for a few weeks to a month in the fridge after it’s opened.4) Yes – you can adapt this to any recipe. Be sure to go with the longest time recommended for processing!🙂ReplySaralenasays:August 24, 2016 at 4:11 pmThank you! I am so excited to get started! Will the syrup last up to a year as well? Thank you so much posting all of this I had no idea all of my efforts were not what I thought they were with using pectin! I threw out a few jars of peach jam I had made last year because they smelled horrible and it had two different colors! I am hoping that my family will love this new way of making jam! Thanks again!Reply Hi Saralena! 1) Your jam will last approximately one year, often closer to 2 years.2) Process the syrup in a water bath for the same amount of time that you process the jam.3) It will last for a few weeks to a month in the fridge after it’s opened.4) Yes – you can adapt this to any recipe. Be sure to go with the longest time recommended for processing! 🙂 Saralenasays:August 24, 2016 at 4:11 pmThank you! I am so excited to get started! Will the syrup last up to a year as well? Thank you so much posting all of this I had no idea all of my efforts were not what I thought they were with using pectin! I threw out a few jars of peach jam I had made last year because they smelled horrible and it had two different colors! I am hoping that my family will love this new way of making jam! Thanks again!Reply Thank you! I am so excited to get started! Will the syrup last up to a year as well? Thank you so much posting all of this I had no idea all of my efforts were not what I thought they were with using pectin! I threw out a few jars of peach jam I had made last year because they smelled horrible and it had two different colors! I am hoping that my family will love this new way of making jam! Thanks again! Hi Saralena! 1) Your jam will last approximately one year, often closer to 2 years.2) Process the syrup in a water bath for the same amount of time that you process the jam.3) It will last for a few weeks to a month in the fridge after it’s opened.4) Yes – you can adapt this to any recipe. Be sure to go with the longest time recommended for processing! 🙂 Saralenasays:August 24, 2016 at 4:11 pmThank you! I am so excited to get started! Will the syrup last up to a year as well? Thank you so much posting all of this I had no idea all of my efforts were not what I thought they were with using pectin! I threw out a few jars of peach jam I had made last year because they smelled horrible and it had two different colors! I am hoping that my family will love this new way of making jam! Thanks again!Reply Thank you! I am so excited to get started! Will the syrup last up to a year as well? Thank you so much posting all of this I had no idea all of my efforts were not what I thought they were with using pectin! I threw out a few jars of peach jam I had made last year because they smelled horrible and it had two different colors! I am hoping that my family will love this new way of making jam! Thanks again! Thank you! I am so excited to get started! Will the syrup last up to a year as well? Thank you so much posting all of this I had no idea all of my efforts were not what I thought they were with using pectin! I threw out a few jars of peach jam I had made last year because they smelled horrible and it had two different colors! I am hoping that my family will love this new way of making jam! Thanks again! Jerriannsays:June 3, 2017 at 12:19 amPlums have a lot of natural pectin. I make plum jam and jelly without pectin. Never had a problem.Reply Plums have a lot of natural pectin. I make plum jam and jelly without pectin. Never had a problem. Plums have a lot of natural pectin. I make plum jam and jelly without pectin. Never had a problem. anette showaltersays:August 25, 2016 at 2:35 pmcan you use this method for freezer jam?? i have some strawberries frozen that i would like to make into freezer jam because it keeps the brightness of the flavor more than cooking the fruit. part of the strawberries have lime juice and peel and the other part is with lemon juice and peel. thanks for any help.ReplyDaisy Luthersays:August 25, 2016 at 7:56 pmI’ve never made freezer jam before so I can’t say 100% if it would work. It definitely won’t be the same thick texture as a pectin containing jam. If you do try it, I would probably strain it even longer – perhaps for 48 hours. I’d really love to hear about your results if you give it a try!Speaking of the brightness of the flavor, I’ve found that straining instead of cooking it down helps greatly with that. You might end up with an awesome double-fruit-whammy with the freezer version.Reply can you use this method for freezer jam?? i have some strawberries frozen that i would like to make into freezer jam because it keeps the brightness of the flavor more than cooking the fruit. part of the strawberries have lime juice and peel and the other part is with lemon juice and peel. thanks for any help. Daisy Luthersays:August 25, 2016 at 7:56 pmI’ve never made freezer jam before so I can’t say 100% if it would work. It definitely won’t be the same thick texture as a pectin containing jam. If you do try it, I would probably strain it even longer – perhaps for 48 hours. I’d really love to hear about your results if you give it a try!Speaking of the brightness of the flavor, I’ve found that straining instead of cooking it down helps greatly with that. You might end up with an awesome double-fruit-whammy with the freezer version.Reply I’ve never made freezer jam before so I can’t say 100% if it would work. It definitely won’t be the same thick texture as a pectin containing jam. If you do try it, I would probably strain it even longer – perhaps for 48 hours. I’d really love to hear about your results if you give it a try! Speaking of the brightness of the flavor, I’ve found that straining instead of cooking it down helps greatly with that. You might end up with an awesome double-fruit-whammy with the freezer version. can you use this method for freezer jam?? i have some strawberries frozen that i would like to make into freezer jam because it keeps the brightness of the flavor more than cooking the fruit. part of the strawberries have lime juice and peel and the other part is with lemon juice and peel. thanks for any help. Daisy Luthersays:August 25, 2016 at 7:56 pmI’ve never made freezer jam before so I can’t say 100% if it would work. It definitely won’t be the same thick texture as a pectin containing jam. If you do try it, I would probably strain it even longer – perhaps for 48 hours. I’d really love to hear about your results if you give it a try!Speaking of the brightness of the flavor, I’ve found that straining instead of cooking it down helps greatly with that. You might end up with an awesome double-fruit-whammy with the freezer version.Reply I’ve never made freezer jam before so I can’t say 100% if it would work. It definitely won’t be the same thick texture as a pectin containing jam. If you do try it, I would probably strain it even longer – perhaps for 48 hours. I’d really love to hear about your results if you give it a try! Speaking of the brightness of the flavor, I’ve found that straining instead of cooking it down helps greatly with that. You might end up with an awesome double-fruit-whammy with the freezer version. I’ve never made freezer jam before so I can’t say 100% if it would work. It definitely won’t be the same thick texture as a pectin containing jam. If you do try it, I would probably strain it even longer – perhaps for 48 hours. I’d really love to hear about your results if you give it a try! Speaking of the brightness of the flavor, I’ve found that straining instead of cooking it down helps greatly with that. You might end up with an awesome double-fruit-whammy with the freezer version. Deesays:September 3, 2016 at 10:05 pmThanks for all the information. I was given 2 large bags of apples. I processed them but didn’t can because I knew something was missing. This post just explained what. I don’t like the idea of artificial chemicals either.By the by: I buy unbleached muslin in the 36′ width for draining such things as this, making fresh mozarella cheese, covers for making my own vinegars, and of course straining infusions and jellies/juices. I make it also into tea bags and all sorts of things for foods. No bleach is important for sanitizing after washing, lemon juice in water then sunlight if possible. After all, if you can burn in cloudy weather, then those uv’s are able to sanitize textiles too.Reply Thanks for all the information. I was given 2 large bags of apples. I processed them but didn’t can because I knew something was missing. This post just explained what. I don’t like the idea of artificial chemicals either. By the by: I buy unbleached muslin in the 36′ width for draining such things as this, making fresh mozarella cheese, covers for making my own vinegars, and of course straining infusions and jellies/juices. I make it also into tea bags and all sorts of things for foods. No bleach is important for sanitizing after washing, lemon juice in water then sunlight if possible. After all, if you can burn in cloudy weather, then those uv’s are able to sanitize textiles too. Thanks for all the information. I was given 2 large bags of apples. I processed them but didn’t can because I knew something was missing. This post just explained what. I don’t like the idea of artificial chemicals either. By the by: I buy unbleached muslin in the 36′ width for draining such things as this, making fresh mozarella cheese, covers for making my own vinegars, and of course straining infusions and jellies/juices. I make it also into tea bags and all sorts of things for foods. No bleach is important for sanitizing after washing, lemon juice in water then sunlight if possible. After all, if you can burn in cloudy weather, then those uv’s are able to sanitize textiles too. Winniesays:May 28, 2017 at 11:03 amJust a quick tip that I use when preparing my strawberries for jam. We pick in quantity and clean, then slice and sugar for ice cream, or mash with no sugar to be used for jam. I measure out 2 cups each and place in ziplock bags and freeze on their sides, in a cake pan with the strawberries spread out and stacked on top of each other. (Once frozen you can retrieve your cake pan.) The berries can then be used for a quick batch of jam when needed, and since I make freezer jam, this keeps my freezer from being filled with a million jars.This year I’ll be trying to make my own pectin from crab apples and cranberries. Thanks so much for the GMO info!Reply Just a quick tip that I use when preparing my strawberries for jam. We pick in quantity and clean, then slice and sugar for ice cream, or mash with no sugar to be used for jam. I measure out 2 cups each and place in ziplock bags and freeze on their sides, in a cake pan with the strawberries spread out and stacked on top of each other. (Once frozen you can retrieve your cake pan.) The berries can then be used for a quick batch of jam when needed, and since I make freezer jam, this keeps my freezer from being filled with a million jars. This year I’ll be trying to make my own pectin from crab apples and cranberries. Thanks so much for the GMO info! Just a quick tip that I use when preparing my strawberries for jam. We pick in quantity and clean, then slice and sugar for ice cream, or mash with no sugar to be used for jam. I measure out 2 cups each and place in ziplock bags and freeze on their sides, in a cake pan with the strawberries spread out and stacked on top of each other. (Once frozen you can retrieve your cake pan.) The berries can then be used for a quick batch of jam when needed, and since I make freezer jam, this keeps my freezer from being filled with a million jars. This year I’ll be trying to make my own pectin from crab apples and cranberries. Thanks so much for the GMO info! Dougsays:June 23, 2017 at 9:51 pmI have been canning for a few years. 1 thing to save a lot of work is too put my jars in the oven at 250 for no less than 25 mins instead water-bath them for user. I put them in both my toaster oven & my big oven. I then rotate them for user. This way i i always have hot jars ready. I put them in a pan with a big lip so when I remove them & they slide they won’t fall out of the pan.This will sterilize them & get them hot for canning. No more big pot of boiling water to mess with.Reply I have been canning for a few years. 1 thing to save a lot of work is too put my jars in the oven at 250 for no less than 25 mins instead water-bath them for user. I put them in both my toaster oven & my big oven. I then rotate them for user. This way i i always have hot jars ready. I put them in a pan with a big lip so when I remove them & they slide they won’t fall out of the pan.This will sterilize them & get them hot for canning. No more big pot of boiling water to mess with. I have been canning for a few years. 1 thing to save a lot of work is too put my jars in the oven at 250 for no less than 25 mins instead water-bath them for user. I put them in both my toaster oven & my big oven. I then rotate them for user. This way i i always have hot jars ready. I put them in a pan with a big lip so when I remove them & they slide they won’t fall out of the pan.This will sterilize them & get them hot for canning. No more big pot of boiling water to mess with. Stacisays:June 30, 2017 at 8:28 pmThank you for this excellent post that I came across while searching for what on earth is pectin while learning about making jam. Now I know and we can avoid it! What about “fruit-fresh protector” products? What is in that stuff? I’m thinking we should probably avoid that too. Please let us know. Thanks again!Reply Thank you for this excellent post that I came across while searching for what on earth is pectin while learning about making jam. Now I know and we can avoid it! What about “fruit-fresh protector” products? What is in that stuff? I’m thinking we should probably avoid that too. Please let us know. Thanks again! Thank you for this excellent post that I came across while searching for what on earth is pectin while learning about making jam. Now I know and we can avoid it! What about “fruit-fresh protector” products? What is in that stuff? I’m thinking we should probably avoid that too. Please let us know. Thanks again! Jensays:July 4, 2017 at 12:19 amThis sounds brilliant, except the refrigerator part. Have you attempted to make this without putting in fridge? It seems like a helpful idea to be able to make jam successfully if you don’t have access to the pectin, but what if you don’t have access to power for a refrigerator? If the power went out, most of us wouldn’t. Just saying. 🙂 I would love to know if this could turn out as great sans the fridge.Reply This sounds brilliant, except the refrigerator part. Have you attempted to make this without putting in fridge? It seems like a helpful idea to be able to make jam successfully if you don’t have access to the pectin, but what if you don’t have access to power for a refrigerator? If the power went out, most of us wouldn’t. Just saying. 🙂 I would love to know if this could turn out as great sans the fridge. This sounds brilliant, except the refrigerator part. Have you attempted to make this without putting in fridge? It seems like a helpful idea to be able to make jam successfully if you don’t have access to the pectin, but what if you don’t have access to power for a refrigerator? If the power went out, most of us wouldn’t. Just saying. 🙂 I would love to know if this could turn out as great sans the fridge. irene lowstettersays:July 30, 2017 at 10:57 amdo you have to put the lemon juice to make the artisian jams and if so whyReply do you have to put the lemon juice to make the artisian jams and if so why do you have to put the lemon juice to make the artisian jams and if so why Vickiesays:September 10, 2017 at 10:41 amHow do you get the seeds out of the mashed Concord grapes?Reply How do you get the seeds out of the mashed Concord grapes? How do you get the seeds out of the mashed Concord grapes? Saidasays:January 29, 2018 at 9:14 pmHello Daisy,Thank you for your due diligence and obvious dedication to helping us in this endeavor to live a healthier organic life. I just had my very first experience with making homemade jelly and of course the demonstration included the use of pectin. Because I research everything, I’ve discovered this is an ingredient I’d like to avoid. Again thank you for the post. Can you tell me how many jars and ounces does 1 batch usually yield?ReplyDaisy Luthersays:January 29, 2018 at 9:25 pmIt’s hard to put a number on it because it depends on lots of things – how juicy was the fruit? How long did you drain it? How much liquid came out? I just have a full batch of jars ready and use what I use 🙂 I’m sorry I can’t be more specific.Reply Hello Daisy, Thank you for your due diligence and obvious dedication to helping us in this endeavor to live a healthier organic life. I just had my very first experience with making homemade jelly and of course the demonstration included the use of pectin. Because I research everything, I’ve discovered this is an ingredient I’d like to avoid. Again thank you for the post. Can you tell me how many jars and ounces does 1 batch usually yield? Daisy Luthersays:January 29, 2018 at 9:25 pmIt’s hard to put a number on it because it depends on lots of things – how juicy was the fruit? How long did you drain it? How much liquid came out? I just have a full batch of jars ready and use what I use 🙂 I’m sorry I can’t be more specific.Reply It’s hard to put a number on it because it depends on lots of things – how juicy was the fruit? How long did you drain it? How much liquid came out? I just have a full batch of jars ready and use what I use 🙂 I’m sorry I can’t be more specific. Hello Daisy, Thank you for your due diligence and obvious dedication to helping us in this endeavor to live a healthier organic life. I just had my very first experience with making homemade jelly and of course the demonstration included the use of pectin. Because I research everything, I’ve discovered this is an ingredient I’d like to avoid. Again thank you for the post. Can you tell me how many jars and ounces does 1 batch usually yield? Daisy Luthersays:January 29, 2018 at 9:25 pmIt’s hard to put a number on it because it depends on lots of things – how juicy was the fruit? How long did you drain it? How much liquid came out? I just have a full batch of jars ready and use what I use 🙂 I’m sorry I can’t be more specific.Reply It’s hard to put a number on it because it depends on lots of things – how juicy was the fruit? How long did you drain it? How much liquid came out? I just have a full batch of jars ready and use what I use 🙂 I’m sorry I can’t be more specific. It’s hard to put a number on it because it depends on lots of things – how juicy was the fruit? How long did you drain it? How much liquid came out? I just have a full batch of jars ready and use what I use 🙂 I’m sorry I can’t be more specific. janetsays:May 5, 2018 at 9:17 pmhi at the farmers market where i sell my jams and preserves i was asked about gmo, i was shocked, then i got home and started looking up and found your sight, anything you can help me with would be great, i heard you can make your ownbut your recipe sounds goodReply hi at the farmers market where i sell my jams and preserves i was asked about gmo, i was shocked, then i got home and started looking up and found your sight, anything you can help me with would be great, i heard you can make your ownbut your recipe sounds good hi at the farmers market where i sell my jams and preserves i was asked about gmo, i was shocked, then i got home and started looking up and found your sight, anything you can help me with would be great, i heard you can make your ownbut your recipe sounds good TJBsays:May 8, 2018 at 2:01 pmDear Daisy,All though this is a great way to make jam, I have read about and tried another “no Pectin” way that worked out great.I use fruit (mashed up to desired texture) of choice, sugar (Any kind you want and in any amount), Lemon Juice (if you want) and the thickener: Chia Seeds (ground up or whole depends on the texture you like).I use about 1 to 2 table spoons of chia seeds per cup of fruit jam (once cooked/mashed).Cook the fruit, sugar and lemon juice first. Maybe cook it down a bit. Add the chia seeds. You can add them a bit at a time, to try to adjust the thickness. The whole thing will thicken up after an hour or two and also when cold. You can “can” this like jam or freeze it.Though I have not tried it yet, I am sure you could use the chia seed method to make raw freezer jam.The end texture is different than traditional jam, but it is very thick and spreadable and so far tastes great. I have made Cherry and Wild Blueberry so far. I just use organic frozen fruit, since I don’t have any fruit plants at present.Nice thing is Chia Seeds can be grown at home, so it is sustainable. They are healthy and easy to store and use.If one is growing their own fruit, sugar (beet or cane or sorghum or honey), lemons and chia seeds; then making jam would never take going to the store.Hope you or anyone finds this interesting.Thank you for all the articles. Take care!Reply Dear Daisy,All though this is a great way to make jam, I have read about and tried another “no Pectin” way that worked out great. I use fruit (mashed up to desired texture) of choice, sugar (Any kind you want and in any amount), Lemon Juice (if you want) and the thickener: Chia Seeds (ground up or whole depends on the texture you like). I use about 1 to 2 table spoons of chia seeds per cup of fruit jam (once cooked/mashed). Cook the fruit, sugar and lemon juice first. Maybe cook it down a bit. Add the chia seeds. You can add them a bit at a time, to try to adjust the thickness. The whole thing will thicken up after an hour or two and also when cold. You can “can” this like jam or freeze it. Though I have not tried it yet, I am sure you could use the chia seed method to make raw freezer jam. The end texture is different than traditional jam, but it is very thick and spreadable and so far tastes great. I have made Cherry and Wild Blueberry so far. I just use organic frozen fruit, since I don’t have any fruit plants at present. Nice thing is Chia Seeds can be grown at home, so it is sustainable. They are healthy and easy to store and use. If one is growing their own fruit, sugar (beet or cane or sorghum or honey), lemons and chia seeds; then making jam would never take going to the store. Hope you or anyone finds this interesting. Thank you for all the articles. Take care! Dear Daisy,All though this is a great way to make jam, I have read about and tried another “no Pectin” way that worked out great. I use fruit (mashed up to desired texture) of choice, sugar (Any kind you want and in any amount), Lemon Juice (if you want) and the thickener: Chia Seeds (ground up or whole depends on the texture you like). I use about 1 to 2 table spoons of chia seeds per cup of fruit jam (once cooked/mashed). Cook the fruit, sugar and lemon juice first. Maybe cook it down a bit. Add the chia seeds. You can add them a bit at a time, to try to adjust the thickness. The whole thing will thicken up after an hour or two and also when cold. You can “can” this like jam or freeze it. Though I have not tried it yet, I am sure you could use the chia seed method to make raw freezer jam. The end texture is different than traditional jam, but it is very thick and spreadable and so far tastes great. I have made Cherry and Wild Blueberry so far. I just use organic frozen fruit, since I don’t have any fruit plants at present. Nice thing is Chia Seeds can be grown at home, so it is sustainable. They are healthy and easy to store and use. If one is growing their own fruit, sugar (beet or cane or sorghum or honey), lemons and chia seeds; then making jam would never take going to the store. Hope you or anyone finds this interesting. Thank you for all the articles. Take care! Nancy in Albertasays:May 22, 2018 at 8:13 pmI am so excited about this post! In the past, I’ve tried Pomona’s, and liked the results, but I had zero idea how much better it is for us.I’m going to send this to all four of my daughters, who are also interested in artisanal “kitchen arts”.I’m actually finding it difficult to express my gratitude for the research, as well as the recipe and careful instructions! Thank you will have to suffice.Looking forward forward to fruit season to try this out.Reply I am so excited about this post! In the past, I’ve tried Pomona’s, and liked the results, but I had zero idea how much better it is for us.I’m going to send this to all four of my daughters, who are also interested in artisanal “kitchen arts”.I’m actually finding it difficult to express my gratitude for the research, as well as the recipe and careful instructions! Thank you will have to suffice.Looking forward forward to fruit season to try this out. I am so excited about this post! In the past, I’ve tried Pomona’s, and liked the results, but I had zero idea how much better it is for us.I’m going to send this to all four of my daughters, who are also interested in artisanal “kitchen arts”.I’m actually finding it difficult to express my gratitude for the research, as well as the recipe and careful instructions! Thank you will have to suffice.Looking forward forward to fruit season to try this out. Anjalisays:August 20, 2018 at 5:55 pmCan this be done without the water bath canning and then freezing it instead?ReplyDaisy Luthersays:August 21, 2018 at 7:54 amYes, it can 🙂 Simply let it cool completely before putting it in the freezer.Reply Can this be done without the water bath canning and then freezing it instead? Daisy Luthersays:August 21, 2018 at 7:54 amYes, it can 🙂 Simply let it cool completely before putting it in the freezer.Reply Yes, it can 🙂 Simply let it cool completely before putting it in the freezer. Can this be done without the water bath canning and then freezing it instead? Daisy Luthersays:August 21, 2018 at 7:54 amYes, it can 🙂 Simply let it cool completely before putting it in the freezer.Reply Yes, it can 🙂 Simply let it cool completely before putting it in the freezer. Yes, it can 🙂 Simply let it cool completely before putting it in the freezer. MQsays:June 27, 2019 at 3:39 pmYou can also put your fruit pulp and sugar, and lemon juice to keep the color bright, into a stainless steel (important) roasting pan and put it into a low oven, stirring every half hour or so until it reaches the desired thickness. Keep a saucer in the freezer to place a dab onto to test for thickness as jam gets thicker as it cools. Quince is also an oldtime addition to fruit to make it thicken.I use my steamer-juicer to separate the juice from fruits, including tomatoes. The resulting pulp can be strained of seeds and tough skins and then either used for jam or dried for roll-ups. The juice from this is pretty concentrated and will need to be thinned before drinking–also sweetened to taste. Can the juice, still hot, 10 minutes to seal. If your jars are clean, as they certainly should be!!, the 10 min. water bath will sterilize them. Tomato juice made like this looks strange, but tastes like essence of tomato. I’ve canned with a gas stove, an electric stove, and a wood stove–water bath and pressure. It’s hard, but possible to keep the heat even on a wood stove. In some dystopian fiction, our heroines are pressure canning over campfires. If they can pull that off, more power to them, they are absolutely heroic. Keeping the pressure even would be something I wouldn’t even try. Dry the meat and vegetables and be safe if you should ever be in that position.Reply You can also put your fruit pulp and sugar, and lemon juice to keep the color bright, into a stainless steel (important) roasting pan and put it into a low oven, stirring every half hour or so until it reaches the desired thickness. Keep a saucer in the freezer to place a dab onto to test for thickness as jam gets thicker as it cools. Quince is also an oldtime addition to fruit to make it thicken. I use my steamer-juicer to separate the juice from fruits, including tomatoes. The resulting pulp can be strained of seeds and tough skins and then either used for jam or dried for roll-ups. The juice from this is pretty concentrated and will need to be thinned before drinking–also sweetened to taste. Can the juice, still hot, 10 minutes to seal. If your jars are clean, as they certainly should be!!, the 10 min. water bath will sterilize them. Tomato juice made like this looks strange, but tastes like essence of tomato. I’ve canned with a gas stove, an electric stove, and a wood stove–water bath and pressure. It’s hard, but possible to keep the heat even on a wood stove. In some dystopian fiction, our heroines are pressure canning over campfires. If they can pull that off, more power to them, they are absolutely heroic. Keeping the pressure even would be something I wouldn’t even try. Dry the meat and vegetables and be safe if you should ever be in that position. You can also put your fruit pulp and sugar, and lemon juice to keep the color bright, into a stainless steel (important) roasting pan and put it into a low oven, stirring every half hour or so until it reaches the desired thickness. Keep a saucer in the freezer to place a dab onto to test for thickness as jam gets thicker as it cools. Quince is also an oldtime addition to fruit to make it thicken. I use my steamer-juicer to separate the juice from fruits, including tomatoes. The resulting pulp can be strained of seeds and tough skins and then either used for jam or dried for roll-ups. The juice from this is pretty concentrated and will need to be thinned before drinking–also sweetened to taste. Can the juice, still hot, 10 minutes to seal. If your jars are clean, as they certainly should be!!, the 10 min. water bath will sterilize them. Tomato juice made like this looks strange, but tastes like essence of tomato. I’ve canned with a gas stove, an electric stove, and a wood stove–water bath and pressure. It’s hard, but possible to keep the heat even on a wood stove. In some dystopian fiction, our heroines are pressure canning over campfires. If they can pull that off, more power to them, they are absolutely heroic. Keeping the pressure even would be something I wouldn’t even try. Dry the meat and vegetables and be safe if you should ever be in that position. MQsays:June 27, 2019 at 3:44 pmSince I now live in civilization 21st century-style, I also use Pomoma pectin. Love it. But it gives me a feeling of satisfaction to know I can do as well without it. Just more time and work…Reply Since I now live in civilization 21st century-style, I also use Pomoma pectin. Love it. But it gives me a feeling of satisfaction to know I can do as well without it. Just more time and work… Since I now live in civilization 21st century-style, I also use Pomoma pectin. Love it. But it gives me a feeling of satisfaction to know I can do as well without it. Just more time and work… Joe Nobodysays:June 27, 2019 at 5:17 pmCan you post a printable version? If you did I can’t find it. Thanks.Reply Can you post a printable version? If you did I can’t find it. Thanks. Can you post a printable version? If you did I can’t find it. Thanks. woodsrunnersays:June 27, 2019 at 11:32 pmThanks for this article, Daisy. My favorite jam is raspberry with jalapeno. Some cranberries added to the fruit if the flavors combine well would help with the texture as cranberries have natural pectin.I also liked your article on what to do with peaches. I had never thought of making peach candy with the peels. I’m going to try it.Reply Thanks for this article, Daisy. My favorite jam is raspberry with jalapeno. Some cranberries added to the fruit if the flavors combine well would help with the texture as cranberries have natural pectin.I also liked your article on what to do with peaches. I had never thought of making peach candy with the peels. I’m going to try it. Thanks for this article, Daisy. My favorite jam is raspberry with jalapeno. Some cranberries added to the fruit if the flavors combine well would help with the texture as cranberries have natural pectin.I also liked your article on what to do with peaches. I had never thought of making peach candy with the peels. I’m going to try it. John Millersays:June 29, 2019 at 6:39 pmI have used chia seed as thickener for home made jam. Here is a link to a freezer blueberry jam I tried.http://kitchen.nutiva.com/easyrecipe-print/13611-0/Reply I have used chia seed as thickener for home made jam. Here is a link to a freezer blueberry jam I tried.http://kitchen.nutiva.com/easyrecipe-print/13611-0/ I have used chia seed as thickener for home made jam. Here is a link to a freezer blueberry jam I tried.http://kitchen.nutiva.com/easyrecipe-print/13611-0/ Kaitlynsays:May 13, 2020 at 10:52 amHi! Thank you for the recipe! I’m very excited to see the results.Is it ok that I had to leave the sugar fruit mixture draining all night?ReplyDaisy Luthersays:May 13, 2020 at 11:23 amYep – that’s absolutely fine. I’ve left it for a couple of days just because I ran out of time to get the jam-making done 🙂Reply Hi! Thank you for the recipe! I’m very excited to see the results.Is it ok that I had to leave the sugar fruit mixture draining all night? Daisy Luthersays:May 13, 2020 at 11:23 amYep – that’s absolutely fine. I’ve left it for a couple of days just because I ran out of time to get the jam-making done 🙂Reply Yep – that’s absolutely fine. I’ve left it for a couple of days just because I ran out of time to get the jam-making done 🙂 Hi! Thank you for the recipe! I’m very excited to see the results.Is it ok that I had to leave the sugar fruit mixture draining all night? Daisy Luthersays:May 13, 2020 at 11:23 amYep – that’s absolutely fine. I’ve left it for a couple of days just because I ran out of time to get the jam-making done 🙂Reply Yep – that’s absolutely fine. I’ve left it for a couple of days just because I ran out of time to get the jam-making done 🙂 Yep – that’s absolutely fine. I’ve left it for a couple of days just because I ran out of time to get the jam-making done 🙂 Mary Tuihalangingiesays:September 17, 2020 at 1:12 pmHi Im making cactus pear fruit jame. Is it safe to use this method as well. This fruit has lots of seeds how do you as you wrote “mill” seeds out from the pulp?ReplyDaisy Luthersays:September 17, 2020 at 3:18 pmYou have a few options.Depending on the size of the seeds (and I think they’re bigger) you might be able to use aa stainless steel colander. Use the back of a big spoon to “push” the fruit through the holes and the seeds will remain.If this is something you’ll be making regularly (or something like it) you may wish to invest in a food mill. I have this onehttps://amzn.to/35Rn7GNwith the accessory sethttps://amzn.to/35MgdlSbecause I’ve always done a lot of canning.There are less expensive food mills that are highly reviewed. I can’t personally vouch for them because I’m never tried them. This one appears to be very popular.https://amzn.to/2ZKgQsAI hope this helps. Don’t hesitate to ask for more clarification. 🙂Reply Hi Im making cactus pear fruit jame. Is it safe to use this method as well. This fruit has lots of seeds how do you as you wrote “mill” seeds out from the pulp? Daisy Luthersays:September 17, 2020 at 3:18 pmYou have a few options.Depending on the size of the seeds (and I think they’re bigger) you might be able to use aa stainless steel colander. Use the back of a big spoon to “push” the fruit through the holes and the seeds will remain.If this is something you’ll be making regularly (or something like it) you may wish to invest in a food mill. I have this onehttps://amzn.to/35Rn7GNwith the accessory sethttps://amzn.to/35MgdlSbecause I’ve always done a lot of canning.There are less expensive food mills that are highly reviewed. I can’t personally vouch for them because I’m never tried them. This one appears to be very popular.https://amzn.to/2ZKgQsAI hope this helps. Don’t hesitate to ask for more clarification. 🙂Reply You have a few options. Depending on the size of the seeds (and I think they’re bigger) you might be able to use aa stainless steel colander. Use the back of a big spoon to “push” the fruit through the holes and the seeds will remain. If this is something you’ll be making regularly (or something like it) you may wish to invest in a food mill. I have this onehttps://amzn.to/35Rn7GNwith the accessory sethttps://amzn.to/35MgdlSbecause I’ve always done a lot of canning. There are less expensive food mills that are highly reviewed. I can’t personally vouch for them because I’m never tried them. This one appears to be very popular.https://amzn.to/2ZKgQsA I hope this helps. Don’t hesitate to ask for more clarification. 🙂 Hi Im making cactus pear fruit jame. Is it safe to use this method as well. This fruit has lots of seeds how do you as you wrote “mill” seeds out from the pulp? Daisy Luthersays:September 17, 2020 at 3:18 pmYou have a few options.Depending on the size of the seeds (and I think they’re bigger) you might be able to use aa stainless steel colander. Use the back of a big spoon to “push” the fruit through the holes and the seeds will remain.If this is something you’ll be making regularly (or something like it) you may wish to invest in a food mill. I have this onehttps://amzn.to/35Rn7GNwith the accessory sethttps://amzn.to/35MgdlSbecause I’ve always done a lot of canning.There are less expensive food mills that are highly reviewed. I can’t personally vouch for them because I’m never tried them. This one appears to be very popular.https://amzn.to/2ZKgQsAI hope this helps. Don’t hesitate to ask for more clarification. 🙂Reply You have a few options. Depending on the size of the seeds (and I think they’re bigger) you might be able to use aa stainless steel colander. Use the back of a big spoon to “push” the fruit through the holes and the seeds will remain. If this is something you’ll be making regularly (or something like it) you may wish to invest in a food mill. I have this onehttps://amzn.to/35Rn7GNwith the accessory sethttps://amzn.to/35MgdlSbecause I’ve always done a lot of canning. There are less expensive food mills that are highly reviewed. I can’t personally vouch for them because I’m never tried them. This one appears to be very popular.https://amzn.to/2ZKgQsA I hope this helps. Don’t hesitate to ask for more clarification. 🙂 You have a few options. Depending on the size of the seeds (and I think they’re bigger) you might be able to use aa stainless steel colander. Use the back of a big spoon to “push” the fruit through the holes and the seeds will remain. If this is something you’ll be making regularly (or something like it) you may wish to invest in a food mill. I have this onehttps://amzn.to/35Rn7GNwith the accessory sethttps://amzn.to/35MgdlSbecause I’ve always done a lot of canning. There are less expensive food mills that are highly reviewed. I can’t personally vouch for them because I’m never tried them. This one appears to be very popular.https://amzn.to/2ZKgQsA I hope this helps. Don’t hesitate to ask for more clarification. 🙂 Ivysays:August 1, 2022 at 10:01 amCould honey be used instead of the sugar with the same result?ReplyDaisy Luthersays:August 1, 2022 at 10:03 amI’m not sure – I don’t see why not, but I can’t guarantee it because I’ve never tried it. 🙂Reply Could honey be used instead of the sugar with the same result? Daisy Luthersays:August 1, 2022 at 10:03 amI’m not sure – I don’t see why not, but I can’t guarantee it because I’ve never tried it. 🙂Reply I’m not sure – I don’t see why not, but I can’t guarantee it because I’ve never tried it. 🙂 Could honey be used instead of the sugar with the same result? Daisy Luthersays:August 1, 2022 at 10:03 amI’m not sure – I don’t see why not, but I can’t guarantee it because I’ve never tried it. 🙂Reply I’m not sure – I don’t see why not, but I can’t guarantee it because I’ve never tried it. 🙂 I’m not sure – I don’t see why not, but I can’t guarantee it because I’ve never tried it. 🙂 Josesays:June 6, 2025 at 8:20 amDear Daisy,As a sweets lover, jam is one of those little guilty pleasures I have. Never gave a second look to the pectine…until I started to read terms like “(…)Alcohol-precipitated pectine…” and was like…”This seems something I’d make in a lab back in engineering college. Would I eat one of those precipitates?”Happily, poor finances led me to use some guavas, cut them in half, and boiled them with water, some cloves, a tiny bit of cinammon, and other local spices, and sugar for a great little dessert every now and then. Same thing I do with very raw plaintains and the result is delicious. Haven’t tasted commercial jam in years.Reply Dear Daisy,As a sweets lover, jam is one of those little guilty pleasures I have. Never gave a second look to the pectine…until I started to read terms like “(…)Alcohol-precipitated pectine…” and was like…”This seems something I’d make in a lab back in engineering college. Would I eat one of those precipitates?”Happily, poor finances led me to use some guavas, cut them in half, and boiled them with water, some cloves, a tiny bit of cinammon, and other local spices, and sugar for a great little dessert every now and then. Same thing I do with very raw plaintains and the result is delicious. Haven’t tasted commercial jam in years. Dear Daisy,As a sweets lover, jam is one of those little guilty pleasures I have. Never gave a second look to the pectine…until I started to read terms like “(…)Alcohol-precipitated pectine…” and was like…”This seems something I’d make in a lab back in engineering college. Would I eat one of those precipitates?”Happily, poor finances led me to use some guavas, cut them in half, and boiled them with water, some cloves, a tiny bit of cinammon, and other local spices, and sugar for a great little dessert every now and then. Same thing I do with very raw plaintains and the result is delicious. Haven’t tasted commercial jam in years. Ginasays:June 6, 2025 at 11:17 amThanks for this timely article! I do love the idea of straining off the liquid for another use. I am printing this one…Earlier this spring I made a delicious violet jelly, but it does require pectin. I was just experimenting, not following any exact recipe. I didn’t use enough pectin to set up completely, so it must be refrigerated. I should have just made syrup instead of jelly. I used cider vinegar instead of citrus, because DH is allergic to citrus. Came out really delicious! Just made a violet tea by pouring boiling water over a packed jar of flowers minus the stems. Let is soak for about an hour, although recipes call for overnight, then I added the strained liquid to a pan, added sugar to taste, vinegar to taste, and eyeballed the pectin. WOW, talk about a fruity, zingy delight! I will definitely make more next spring.I once read an article about making pectin from crab apples, because they contain more than regular apples do. I think one can find it with a quick internet search. I don’t have a large fruiting crab apple tree on my property, but I know where a few are roadside, and I can pick those with impunity because they are in the easement. Will have to wash them well because of road dirt and exhaust fumes, but it has to be safer than the glyphosate in the corn!Reply Thanks for this timely article! I do love the idea of straining off the liquid for another use. I am printing this one… Earlier this spring I made a delicious violet jelly, but it does require pectin. I was just experimenting, not following any exact recipe. I didn’t use enough pectin to set up completely, so it must be refrigerated. I should have just made syrup instead of jelly. I used cider vinegar instead of citrus, because DH is allergic to citrus. Came out really delicious! Just made a violet tea by pouring boiling water over a packed jar of flowers minus the stems. Let is soak for about an hour, although recipes call for overnight, then I added the strained liquid to a pan, added sugar to taste, vinegar to taste, and eyeballed the pectin. WOW, talk about a fruity, zingy delight! I will definitely make more next spring. I once read an article about making pectin from crab apples, because they contain more than regular apples do. I think one can find it with a quick internet search. I don’t have a large fruiting crab apple tree on my property, but I know where a few are roadside, and I can pick those with impunity because they are in the easement. Will have to wash them well because of road dirt and exhaust fumes, but it has to be safer than the glyphosate in the corn! Thanks for this timely article! I do love the idea of straining off the liquid for another use. I am printing this one… Earlier this spring I made a delicious violet jelly, but it does require pectin. I was just experimenting, not following any exact recipe. I didn’t use enough pectin to set up completely, so it must be refrigerated. I should have just made syrup instead of jelly. I used cider vinegar instead of citrus, because DH is allergic to citrus. Came out really delicious! Just made a violet tea by pouring boiling water over a packed jar of flowers minus the stems. Let is soak for about an hour, although recipes call for overnight, then I added the strained liquid to a pan, added sugar to taste, vinegar to taste, and eyeballed the pectin. WOW, talk about a fruity, zingy delight! I will definitely make more next spring. I once read an article about making pectin from crab apples, because they contain more than regular apples do. I think one can find it with a quick internet search. I don’t have a large fruiting crab apple tree on my property, but I know where a few are roadside, and I can pick those with impunity because they are in the easement. Will have to wash them well because of road dirt and exhaust fumes, but it has to be safer than the glyphosate in the corn! Nativesays:June 11, 2025 at 6:14 pmVery simple jam from hawthorn berry powder and rose hips. Rehydrate 1 part hawthorn berry powder and separately rehydrate the rosehips. It takes about 5 minutes; mix them together. Add honey to taste and lemon juice or citric acid as a preservative.Hawthorn is very high in pectin and does not need to be cooked. Rosehips don’t need to be cooked, either. If you cook fruits, you damage their Vitamin C content.Germany’s Commission E recognizes the heart related benefits of hawthorn berry. Rosehips are high in bioflavinoids that help your body absorb Vitamin C. This jam is very nice on toast.Reply Very simple jam from hawthorn berry powder and rose hips. Rehydrate 1 part hawthorn berry powder and separately rehydrate the rosehips. It takes about 5 minutes; mix them together. Add honey to taste and lemon juice or citric acid as a preservative. Hawthorn is very high in pectin and does not need to be cooked. Rosehips don’t need to be cooked, either. If you cook fruits, you damage their Vitamin C content. Germany’s Commission E recognizes the heart related benefits of hawthorn berry. Rosehips are high in bioflavinoids that help your body absorb Vitamin C. This jam is very nice on toast. Very simple jam from hawthorn berry powder and rose hips. Rehydrate 1 part hawthorn berry powder and separately rehydrate the rosehips. It takes about 5 minutes; mix them together. Add honey to taste and lemon juice or citric acid as a preservative. Hawthorn is very high in pectin and does not need to be cooked. Rosehips don’t need to be cooked, either. If you cook fruits, you damage their Vitamin C content. Germany’s Commission E recognizes the heart related benefits of hawthorn berry. Rosehips are high in bioflavinoids that help your body absorb Vitamin C. This jam is very nice on toast. **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Δ **About Us** **Forum** **Subscribe** Most Recent Comments: NativeonHow to Make Homemade Artisanal Jam Without Pectin AngelaonIs Weight Loss a Prep? ClaudiaonIs Weight Loss a Prep? SteveonIs Weight Loss a Prep? Esther CookonMy Worst SHTF Fear Copyright Information: ©The Organic Prepper and ©LutherCompany 2022. Feel free to share this information in full or in part in digital form, leaving all links intact, with full attribution to the author and a link to www.theorganicprepper.com. Please contact us for permission to reproduce this content in other media formats. Affiliate Information: The Organic Prepper website is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to Amazon.com. The Organic Prepper Website is an affiliate of several other companies, from which commission is earned. Mission Statement: The Organic Prepper website is not a news organization. We provide commentary on current events to encourage critical thinking and self-reliance. Readers are encouraged to discuss and debate their conclusions. Disclaimer: The content on this site is provided as general information and entertainment. Promoted content is paid advertising. The ideas expressed on this site are solely the opinions of the author(s) and do not necessarily represent the opinions of sponsors or firms affiliated with the author(s). The author(s) may or may not have a financial interest in any company or advertiser referenced. We do not provide medical advice and recommend you see your doctor before making any medical decisions. We do not provide financial advice and recommend you speak to a financial advisor before making any financial decisions. Any action taken as a result of information, analysis or advertisement on this site is ultimately the responsibility of the reader. Corrections Policy: The Organic Prepper website strives to provide accurate information. If we discover inaccuracies, the article in question will be updated with new information and a correction note will appear at the bottom of the article. About Media Forum SUBSCRIBE SUPPORT THE OP Prepping & Survival Commentary Shop AUTHORS Privacy Policy About Media Forum SUBSCRIBE SUPPORT THE OP Prepping & Survival Commentary Shop AUTHORS Privacy Policy In the event of a long-term disaster, there are non-food essentials that can be vital to your survival and well-being. Make certain you have these 50 non-food stockpile essentials. Sign up for your FREE report and get prepared."}