{"id": 959, "name": "NBC News", "domain": "nbcnews.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-administration-musk-newsom-nj-primary-china-tariffs-live-updates-rcna211669", "title": "Trump Administration Musk Newsom Nj Primary China Tariffs Live Updates Rcna211669", "content": "BREAKING: Mahmoud Khalil cannot be held or deported by U.S. government, a federal judge rules ICE protest Trump admin Politics U.S. News LocalNew YorkLos AngelesChicagoDallas-Fort WorthPhiladelphiaWashington, D.C.BostonBay AreaSouth FloridaSan DiegoConnecticut New York Los Angeles Chicago Dallas-Fort Worth Philadelphia Washington, D.C. Boston Bay Area South Florida San Diego Connecticut New York Los Angeles Chicago Dallas-Fort Worth Philadelphia Washington, D.C. Boston Bay Area South Florida San Diego Connecticut World Sports Shopping Tipline Business Health Science Culture & Trends Share & Save — Profile Sections U.S. News Politics World Business Sports Investigations Culture & Trends Health Science Tech Weather Video Features Photos NBC Select NBC Asian America NBC BLK NBC Latino NBC OUT Local New York Los Angeles Chicago Dallas-Fort Worth Philadelphia Washington, D.C. Boston Bay Area South Florida San Diego Connecticut tv Today Nightly News MSNBC Meet the Press Dateline Featured NBC News Now Nightly Films Stay Tuned Special Features Newsletters Podcasts Listen Now More From NBC CNBC NBC.COM NBCU Academy Peacock NEXT STEPS FOR VETS NBC News Site Map Help Follow NBC News news Alerts There are no new alerts at this time Facebook Twitter Email SMS Print Whatsapp Reddit Pocket Flipboard Pinterest Linkedin Latest Stories ICE protest Trump admin Politics U.S. News World Sports Shopping Tipline Business Health Science Culture & Trends **Live updates: Washington prepares for Trump's military parade; Elon Musk says he regrets some posts about Trump** **What to know today** ELON MUSK:The Tesla and SpaceX CEOsaid on Xthat he regrets some of his posts about President Donald Trump. Musk apologized after Vice President JD Vance and White House chief of staff Susie Wiles reached out to him and urged him to end the feud, according to two sources familiar with the matter. MILITARY PARADE:Officials in Washington, D.C., are preparing for Saturday's military parade in honor of the Army's 250th anniversary. TRADE TALKS:The United States and China have agreed on the framework fora trade agreementafter yesterday's talks. Trump posted on Truth Social that a deal is \"done\" but still needs \"final approval\" from him and Chinese President Xi Jinping. LOS ANGELES PROTESTS:The Justice Department called California's bid to block the Trump administration fromsending the militaryto deal with protestors in Los Angeles a \"crass political stunt.\" Thousands of people across the country have joined demonstrations against the administration's immigration raids. **Three-judge panel denies former Sen. Bob Menendez bail pending appeal** Gary GrumbachGary Grumbach is a NBC News Legal Affairs Reporter, based in Washington, D.C. Gary GrumbachGary Grumbach is a NBC News Legal Affairs Reporter, based in Washington, D.C. Zoë Richards Zoë Richards A three-judge panel on the 2nd U.S. Court of Appeals has denied bail, pending appeal, to former Sen. Bob Menendez, D-N.J., according to an order filed today. Menendez made the bail request to avoid reporting to prison next Tuesday after he wasfound guiltyon charges of bribery, extortion, acting as a foreign agent, obstruction of justice and several counts of conspiracy in connection with acceptingcash, gold barsand other bribes to benefit the governments of Egypt and Qatar during a corruption trial last year. He wassentenced to 11 yearsin prison in January. Judge Steven Menashi, a Trump appointee, and Judge Katherine Polk Failla, an Obama appointee, denied bail. Judge Alison Nathan, a Biden appointee, would have granted the bail motion. **FAA to issue airspace restrictions for the Army’s 250th anniversary celebration this weekend** Jay Blackman Zoë Richards Zoë Richards The Federal Aviation Administration said in a statement today that it would implement temporary airspace restrictions for Washington in preparation for the Army's 250th anniversary celebration, citing \"safety and security\" concerns. \"In partnership with the Department of Homeland Security, the FAA will issue Temporary Flight Restrictions (TFRs) for the Washington, D.C., area to ensure safety and security during the Army’s 250th Anniversary Celebration,\" the agency said. \"The FAA will implement traffic management initiatives (TMI) at Ronald Reagan Washington National Airport (DCA) before, during, and after the event to ensure safety and will facilitate a return to normal operations once the event concludes,\" it added. The restrictions will be in place for Saturday, when the parade is scheduled, and flight arrivals and departures will be halted at Ronald Reagan Washington National Airport from 6 p.m. to 9:30 p.m., according to the statement. **Texas governor says he wants to 'make sure' what happened during L.A. protests isn't repeated in Texas** Juliette Arcodia Zoë Richards Zoë Richards Texas Gov.Greg Abbottsaid today that the Texas National Guard will be deployed because he wants to ensure his state doesn't repeat what has unfolded during protests in the Los Angeles area. \"First of all, we want to make sure that what has happened in California does not happen in Texas,\" Abbott said during a question-and-answer session at an event for an unrelated bill signing. \"Texas is a law-and-order state, and we will use every tool that we can to ensure order across our state. That includes the deployment of Texas Department of Public Safety officers, as well as Texas National Guard, in strategic locations where they can provide the most robust response where needed,\" he added. Abbott declined to provide details about what tactics would be used, saying, \"You will see them arise in response to what we see on the ground.\" He also said law enforcement is prepared to make arrests. \"You break the law, you cross the line, you will be arrested,\" he said. \"There is freedom of speech. However, if, in your protest, you damage somebody’s property or you harm an individual, that’s violating the law, and you will be arrested for it.\" Abbottannouncedplanson Xearly this morning to deploy the National Guard across the state in anticipation of aprotest scheduled in San Antonio. **Senate Democrats to force votes to block arms deals in response to Trump business deals** Frank Thorp Vproducer and off-air reporter Frank Thorp Vproducer and off-air reporter Senate Democrats will force two votes this afternoon to object to U.S. arms deals with Qatar and the United Arab Emirates because, they say, they were done in response to business deals and the gift of a luxury jet to Trump. The votes are expected to be largely symbolic, as they will most likely not pass. While the resolutions don’t target the gift of the $400 million jet to Trump specifically, Democrats argue that by targeting the arms deals with those countries, it would indirectly hit at the same issue, saying the gifts to Trump enabled the corruption of the arms deals. Sen. Chris Murphy, D-Conn., who is leading the charge, will begin speaking on the Senate floor around 3:45 p.m., and votes will start around 4:30 p.m. The resolutions would need simple majorities to pass, but they are not expected to pass. **DOJ calls Newsom bid to limit National Guard activity 'dangerous'** Gary GrumbachGary Grumbach is a NBC News Legal Affairs Reporter, based in Washington, D.C. Gary GrumbachGary Grumbach is a NBC News Legal Affairs Reporter, based in Washington, D.C. Dareh Gregorian Dareh Gregorian The Trump administration responded to California's bid to block the military from getting involved in immigration enforcement a \"crass political stunt” that is “endangering American lives.” The president \"has every right under the Constitution and by statute to call forth the National Guard and Marines to quell lawless violence directed against enforcement of federal law,\" the Justice Department's filing said. The filing argues that “instead of working to bring order to Los Angeles,”Newsom suedseeking a court order “limiting the federal government’s ability to protect its property and officials.” The filing is a response to Newsom and Attorney General Rob Bonta's request for a temporary restraining order to bar National Guard troops and Marines that Trump sent to Los Angeles L.A. from getting involved in immigration enforcement activities. The state's filing says that it does not seek to prevent those forces \"from protecting the safety of federal buildings\" or \"federal personnel on such property\" but that it would be unlawful for them to get involved with law enforcement activities. Two sources toldNBC Newsthe Marines could be used to provide security and transportation for Immigration and Customs Enforcement personnel as they continue to arrest immigrants. The Justice Department filing maintains neither \"the National Guard nor the Marines are engaged in law enforcement. Rather, they are protecting law enforcement, consistent with longstanding practice and the inherent protective power to provide for the safety of federal property and personnel.\" A judge is scheduled to hear arguments on the state's request tomorrow. **White House press secretary Karoline Leavitt says Trump would be fine with peaceful protests during military parade** Rebecca Shabad Rebecca Shabad White House press secretary Karoline Leavitt told reporters today that Trump would be fine with peaceful protests Saturday during the military parade set to take place in downtown Washington. \"The president absolutely supports peaceful protests,\" she said at the news briefing when she was asked what protests he would view as acceptable after hethreatened yesterday that protesters would be met with \"very heavy force.\"She added that Trump \"does not support violence of any kind.\" If there are peaceful protests Saturday, Leavitt said, “of course\" Trump would be fine with them. \"What a stupid question,\" she said. **Trump to attend ‘Les Misérables’ premiere as protests continue across the country** Dareh Gregorian Dareh Gregorian Trump is set to attend the opening night of “Les Misérables,” a musical set against a background of revolution and protest, at Washington’s John F.Kennedy Centerfor the Performing Arts today. “I love the songs, I love the play,” Trump toldFox News Digitallast week. “I think it’s great.” The monthlong run of the Tony Award-winning show is opening amidwidespread protestsagainst Trump’s immigration policies and his decision todeploy members of the militaryin response. Protests against power are a major theme in the show, which is centered on student-led demonstrations against the French monarchy. Read the full story here. **Bill aims to reverse Trump administration's funding cuts to health insurance navigators** Aria Bendix Aria Bendix Democratic lawmakers today introduced a bill in the House and the Senate that would restore funding to a federal program that helps people enroll in health insurance. In February, the Trump administration announced a 90% reduction in funding for the Affordable Care Act Navigator program, which helps people in nearly 30 states obtain coverage through the federal marketplace. The bill, first reported by NBC News, would restore the program's funding to $100 million annually, the amount allocated under the Biden administration. The lawmakers behind the bill — Sens. Tammy Baldwin of Wisconsin and Jeanne Shaheen of New Hampshire and Reps. Kathy Castor of Florida and Dwight Evans of Pennsylvania — said in an announcement that previous cuts to the program contributed to 2.5 million fewer people’s accessing health care through the federal marketplace. The first Trump administrationreduced funding for the programby 84%. “We have seen this movie before: when he doesn’t get his way to fully repeal it, Donald Trump tries every which way to chip away at the Affordable Care Act,” Baldwin said in the announcement. The program's navigators help people find and enroll in affordable plans, which may involve preparing documents to verify their incomes or apply for subsidies. They also conduct outreach in low-income and minority communities to make residents aware of their health insurance options and help with claims and billing issues once people are enrolled. In addition to marketplace plans, navigators can help enroll people in Medicaid and the Children’s Health Insurance Program. The Trump administration has said that navigators don't have much impact on overall enrollment numbers and that slashing funding for the program could reduce premiums for some payers. But the program’s supporters argue that it increases enrollment among people who would otherwise be uninsured or underinsured. A2022 studyfound that funding cuts to the navigator program significantly decreased ACA coverage among lower-income adults and overall health insurance coverage among Hispanic adults. **Sen. Jack Reed presses Hegseth for price related to Qatari jet** Megan Lebowitz Megan Lebowitz Mosheh Gains Sen. Jack Reed, D-R.I., criticized Hegseth for his refusal to disclose the price of the contract with a company tasked with reconfiguring the Qatari plane that the administration intends to eventually use as Air Force One. \"You’ve signed a contract with a company to reconfigure the aircraft. What is the price of that contract?\" Reed asked. \"That cannot be revealed in this setting,\" Hegseth said. \"Why can’t it be revealed in this setting? This is the Appropriations Committee of the United States Senate,\" Reed said. \"We appropriate the money that you will spend after it’s authorized by my committee. And you cannot tell us how much the contract is for?\" \"You will have that number,\" Hegseth said, adding that it would not be discussed now. Asked later for confirmation that a contract with an American contractor has been signed, Hegseth said, \"Nothing on that front that I’m aware of is being executed.\" **Treasury Secretary Scott Bessent says it 'remains to be seen' if GOP tax bill would add to the national debt** Rebecca Shabad Rebecca Shabad Treasury Secretary Scott Bessent couldn't definitively say in testimony before Congress today whether theHouse-passed GOP tax policy billwould add to the national debt despite estimates suggesting it would. \"It remains to be seen,\" Bessent told members of the House Ways and Means Committee when he was asked whether the legislation would add to the debt. Rep. Terri Sewell, D-Ala., said the nonpartisan Congressional Budget Office estimates that the bill wouldincrease the deficit by $2.4 trillion. Bessent responded, however, that the CBO also estimated separately that revenue generated by Trump's tariffs would shrink the deficit by $2.8 trillion. He also said it's \"impossible\" for him to say whether all Americans would experience a net benefit as a result of the measure. **Sen. Patty Murray slams Hegseth for Signal use, L.A. response** Megan Lebowitz Megan Lebowitz Sen. Patty Murray, D-Wash., slammed Hegseth on a slew of topics ranging from an overhaul of the Defense Department to his involvement in sharing military attack plans in a Signal chat, saying the department \"needs stable, competent and strategic leadership\" and adding that's not what she has been seeing. \"In a matter of months, you have lost top aides and reportedly struggled to hire new ones,\" she said. \"You have fired highly respected top military officials. You shared highly sensitive attack plans over Signal and apparently with people in your own personal circles, and you've not taken responsibility for those mistakes.\" Murray then went on to say Hegseth had taken a series of steps that have weakened military preparedness. \"Mr. Secretary, you talk about returning the department to its mission of war-fighting, but I am repeatedly hearing that your policy and personnel changes at the Pentagon are undermining, not strengthening, our military's preparedness to protect our country,\" Murray said, specifically focusing on the administration's response to the Los Angeles protests. \"You're sending the National Guard into California without the governor's request, sending the Marines not after foreign threats, but after American protesters,\" Murray said. \"And now President Trump is promising heavy force against peaceful protesters at his D.C. military parade. Those sorts of actions and that sort of rhetoric from a president of the United States should stop every one of us cold.\" **Sen. Jack Reed says he believes military response to L.A. is illegal** Megan Lebowitz Megan Lebowitz Hegseth said that he and others were \"very proud\" that the National Guard and Marines were responding to protests in Los Angeles. Sen. Jack Reed, D-R.I., said that law and order was a \"civil function,\" rather than a military one. Hegseth butted in, saying that there was precedent for the military to support this mission. Reed said that he believed the military involvement was illegal and served as a \"diminution of the readiness and the focus of the military.\" **Trump says China tariffs will stay high after two days of talks** Mike Calia Mike Calia Steve Kopack Steve Kopack Katherine Doyle Katherine Doyle The U.S. will keep high tariffs on Chinese goods, Trump said this morning, touting a preliminary trade agreement that he and his Chinese counterpart, Xi Jinping, will need to approve. China will supply rare earth minerals and magnets “up front,” Trump said in a post on hisTruth Socialplatform, although he didn’t clarify the exact terms. Trump also said “we are getting a total of 55% of tariffs, China is getting 10%” without explaining further. Read the full story here. **McConnell grills Hegseth on the Russia-Ukraine war** Megan Lebowitz Megan Lebowitz Sen. Mitch McConnell, R-Ky., used his question time at a hearing on the Defense Department's budget request to grill Hegseth on the Trump administration's response to the war in Ukraine. The former Senate leader's questions came after he had asked in his opening statement, \"Why would Asian partners trust us if we abandon partners in Europe?\" McConnell began by asking Hegseth who was the aggressor in the war. Hegseth answered that it was Russia. Asked who he wanted to win the war, Hegseth did not answer directly. \"As we've said time and time again, this president is committed to peace in that conflict,\" he said. \"Ultimately peace serves our national interests and we think the interests of both parties, even if that outcome will not be preferable to many in this room and many in our country.\" McConnell also asked Hegseth who China wants to win the war, to which the defense secretary responded that China prefers that Russia win. **Sen. Chris Coons says Hegseth spending too much time 'fighting culture wars'** Megan Lebowitz Megan Lebowitz Sen. Chris Coons, D-Del., the top Democrat on the subcommitte, criticized staffing shake-ups at the Pentagon and the focus on culture war issues. \"Mr. Secretary, I’m also concerned that far more of your time so far has been spent inside the building on culture wars, rather than outside the building, deterring real ones,\" he said. He also slammed Hegseth for sharing military information on Signal. \"Mishandling important and sensitive information in the middle of an operation by a secretary is unthinkable,\" Coons said. **Sen. Mitch McConnell criticizes reconciliation for defense spending, asks about U.S. policy toward Ukraine** Megan Lebowitz Megan Lebowitz Sen. Mitch McConnell, R-Ky., began his opening remarks to Hegseth by criticizing the fact that the administration was seeking to add defense funding through a reconciliation package. \"Lumping reconciliation spending in with full-year appropriations risks conflating different objectives,\" he said. A reconciliation package pushes forward funding through a different mechanism than typical budget processes, and it allows Republicans to pass funding through just a simple majority. McConnell also urged the U.S. to continue its support of Ukraine, saying that the war was \"profoundly\" important to U.S. interests. \"I'd like to hear your views on this conflict. Who is the aggressor? What are the stakes for America and the West? What is the return on investment of our assistance to Ukraine?\" McConnell said. Trump has previously blamed Ukrainian President Volodymyr Zelenskyy for the war, which began when Russia invaded Ukraine in February 2022. **Hegseth kicks off Day 2 of testimony before Congress** Megan Lebowitz Megan Lebowitz Defense Secretary Pete Hegseth began his second day of testifying before Congress, this time appearing before a Senate Appropriations subcommittee. Yesterday he testified before a House Appropriations subcommittee, and he is set to testify before the House Armed Services Committee tomorrow. The hearings were convened to discuss the Defense Department's budget, though lawmakers can ask questions about any topic. Yesterday, Hegseth faced questions about the deployment of troops to Los Angeles, Trump's plan for a \"Golden Dome\" and U.S. military equipment and technology preparedness. **Rubio condemns sanctions on far-right Israeli ministers by U.K., Canada and others** Jennifer Jett Jennifer Jett Secretary of State Marco Rubio condemned sanctionsimposed on two far-right Israeli government ministersby Britain, Canada and other U.S. allies who accused them of “inciting extremist violence” against Palestinians in the Israeli-occupied West Bank. The five Western governments, which also included Australia, New Zealand and Norway, sanctioned National Security Minister Itamar Ben-Gvir and Finance Minister Bezalel Smotrich over their advocacy of Israeli settlements in the West Bank, where violence against Palestinians has sharply increased during the Israel-Hamas war. “Extremist rhetoric advocating the forced displacement of Palestinians and the creation of new Israeli settlements is appalling and dangerous,” the five countries’ foreign ministers said in a statement yesterday. Rubio urged the reversal of the sanctions, which could expose the two Israeli officials to asset freezes and travel bans. “We reject any notion of equivalence: Hamas is a terrorist organization that committed unspeakable atrocities, continues to hold innocent civilians hostage, and prevents the people of Gaza from living in peace,” he said in apost on X. “We remind our partners not to forget who the real enemy is.” The Israeli government and the ministers themselves also condemned the sanctions, saying they would give a boost to Hamas. **Texas Gov. Greg Abbott to deploy National Guard across the state in response to protests** Marlene Lenthang Marlene Lenthang Texas Gov. Greg Abbott said he’ll deploy the National Guard across the state “to ensure peace and order,”ahead of a planned protest in San Antonio. “Peaceful protest is legal. Harming a person or property is illegal & will lead to arrest.@TexasGuardwill use every tool & strategy to help law enforcement maintain order,”he wrote on Xlate yesterday evening local time. Read the full story here. **Tulsi Gabbard criticizes nuclear 'warmongers' after Hiroshima visit** Arata Yamamoto Jennifer Jett Jennifer Jett Reporting from Tokyo “Warmongers” are pushing the world to the brink of nuclear war, U.S. intelligence chief Tulsi Gabbard said as she appeared to call for the abolition of nuclear weapons. In a videoposted yesterday on X, Gabbard describes her recent visit to the Japanese city of Hiroshima, which along with the city of Nagasaki was hit by an atomic bomb in August 1945, at the end of World War II. The two bombs and the subsequent effects from radiation killed an estimated 214,000 people by the end of the year and prompted Japan to surrender within days. “As we stand here today closer to the brink of nuclear annihilation than ever before, political elite warmongers are carelessly fomenting fear and tensions between nuclear powers,” Gabbard says in the three-and-a-half-minute video, which fails to mention that it was the United States that dropped the two atomic bombs. She did not specify who she was referring to. “So it’s up to us, the people, to speak up and demand an end to this madness,” she said. “We must reject this path to nuclear war and work toward a world where no one has to live in fear of a nuclear holocaust.” Japanese news outlets noted that it is rare for a U.S. Cabinet member to publicly voice opposition to nuclear weapons. Gabbard’s comments were inconsistent with the longtime U.S. argument that the bombings actually saved lives by ending the war. Yoshimasa Hayashi, the Japanese government’s top spokesperson, declined to comment on Gabbard’s visit to Hiroshima but said, “in general, we believe that accurate understanding of the reality of atomic bombing is important for any efforts aimed at nuclear disarmament.” “As the only country to have experienced wartime atomic bombing, based on the belief that the horrors of Hiroshima and Nagasaki must never be repeated, we believe it is important to continue to cooperate with the United States and make realistic and practical efforts to realize a world free of nuclear weapons,” he said. **Trump and first lady to attend 'Les Misérables' at the Kennedy Center tonight** Megan Lebowitz Megan Lebowitz Trump and first lady Melania Trump will attend the opening night of \"Les Misérables\" at the Kennedy Center tonight. Trump and his alliestook overthe D.C. theater center's board and the president now serves as chair of the Kennedy Center. The president frequently played songs from musicals, including \"Les Misérables,\" at his rallies. CNN hasreportedthat several cast members planned to boycott the production when Trump attends. NBC News has not independently verified the report. **Rep. Jake Auchincloss says Marines deployed to L.A. 'are trained to be lethal'** Ali Vitali Rep. Jake Auchincloss, D-Mass., expressed concern about the ability of Marines to successfully de-escalate protests in Los Angeles, noting in an interview on MSNBC's \"Way Too Early\" that \"those boys are trained to be lethal.\" \"They are training to destroy the Iran Revolutionary Guard Corps in Syria or to fight off the People’s Liberation Army in Guam,\" said Auchincloss, a former Marine. \"They are not trained to do de-escalation of fellow citizens in Los Angeles — nor is it necessary.\" The Massachusetts Democrat also argued that the Marines are being \"put in this impossible situation of either disobeying what I have to at least presume is a lawful order until a judge rules otherwise or going against my instincts on the Constitution.\" \"That is such an unfair situation to put these young men and women in,\" he added. Auchincloss called Trump's deployment of troops to the city “an authoritarian power grab” and claimed the president was \"manufacturing a crisis\" as a way \"to test the bounds of his power over the military and more precisely to use the military as a police force.” **Trump posts about possible China trade deal** Rebecca Shabad Rebecca Shabad Katherine Doyle Katherine Doyle Trump said this morning in a post on Truth Social that the U.S. has reached a trade deal with China, though he said he and Chinese President Xi Jinping still have to greenlight it. \"Our deal with China is done, subject to final approval with President Xi and me. Full magnets, and any necessary rare earths, will be supplied, up front by China,\" he wrote. \"Likewise, we will provide to China what was agreed to, including Chinese students using our colleges and universities (which has always been good with me!).\" He added, \"We are getting a total of 55% tariffs, China is getting 10%. Relationship is excellent! Thank you for your attention to this matter!\" A White House official told NBC News that “the 55% isn’t new,\" and included \"20% fentanyl tariffs + 10% reciprocal baseline + 25% from Section 301s and other pre-existing duties.\" NBC News reached out to the Chinese embassy for comment. **Trump tariffs may remain in effect while appeals proceed, federal appeals court rules** Reuters A federal appeals court allowed Trump’s most sweeping tariffs toremain in effectwhile it reviews a lower court decision blocking them on grounds that Trump had exceeded his authority by imposing them. The decision yesterday by the U.S. Court of Appeals for the Federal Circuit in Washington, D.C., means Trump may continue to enforce, for now, his “Liberation Day” tariffs on imports from most U.S. trading partners, as well as a separate set of tariffs levied on Canada, China and Mexico. Read the full story. **China and U.S. agree on framework to implement Geneva trade consensus** Evelyn Cheng, CNBC The U.S. and China have reached an agreement on trade, representatives from both sides said after a second day ofhigh-level talks in London. “We have reached a framework to implement the Geneva consensus and the call between the two presidents,” U.S. Commerce Secretary Howard Lutnick told reporters. Read the full story here. **Trump says he was 'not a happy camper' when Musk attacked his bill, but ‘I have no hard feelings’** Megan Lebowitz Megan Lebowitz Tara Prindiville Trump said in an interview with theNew York Postthat he has \"no hard feelings\" after Musk attacked the Trump-backed Republican domestic policy bill, though the president noted that he was \"not a happy camper\" at the time. \"I have no hard feelings,\" Trump said in the interview. \"I was really surprised that that happened.\" The president added that he believed the bill was \"coming together so well,\" but when Musk attacked it, \"I was not a happy camper.\" Trump said he was \"disappointed\" in Musk, but added that \"things like that happen,\" and \"I don't blame him for anything.\" Asked if he and Musk could reconcile, the president said, \"I guess I could.\" **Speaker Johnson to address Israel's Knesset this month** Megan Lebowitz Megan Lebowitz Kyle Stewart Kyle Stewart House Speaker Mike Johnson will address Israel's parliament, or Knesset, on June 22, his office announced this morning. “It will be one of the highest honors of my life to address the Israeli Knesset at this fateful moment,” Johnson said in a press release. “Our ties run deeper than military partnerships and trade agreements. We’re bound by the same beliefs, the same psalms, and the same sacred pursuit of liberty.” Speaker of the Knesset Amir Ohana said in a statement released by Johnson’s office that Johnson “is highly deserving of addressing the Knesset.” “From the moment he was elected, he not only expressed his support through words but also took decisive action, even at the risk of his position, to support Israel in its most challenging moments,” Ohana said. Then-Speaker Kevin McCarthy addressed the Knesset in May 2023, and Newt Gingrich was the first House speaker to address the Knesset, in 1998. **Five takeaways from New Jersey’s primaries for governor: How the candidates are handling Trump and more** Bridget Bowman Bridget Bowman Ben Kamisar Ben Kamisar The matchup in New Jersey’s race for governor is officially set — and yesterday’s primaries also laid down big indicators about the state of both political parties after the first major intraparty contests since the 2024 election. Republican Jack Ciattarelli, a former state legislator, easily won his party’s primary with Trump’s endorsement, underscoring the president’s significant sway over the GOP electorate. U.S. Rep. Mikie Sherrill won the crowded Democratic primary, pitching herself as the candidate with the best shot at holding on to the governorship and steering past ideological and antiestablishment sentiment simmering in her party. She defeated candidates who were to her left and to her right. Read the full story here. **Elon Musk says he now ‘regrets’ some of his social media posts about Trump after major fallout** Patrick Smith Patrick Smith A reunion of the world’s richest man and the most powerful may not be imminent, but at least one of them has now expressed his regrets as theirrelationship lies in ruins. Elon Musk said on X in the early hours of Wednesday that he “regrets” some of the barbs he posted as he and Trump traded insults on social media and said they “went too far.” Read the full story here. **Gavin Newsom warns ‘democracy is under assault’ in speech blasting Trump’s immigration tactics** Zoë Richards Zoë Richards California Gov. Gavin Newsom delivered a scathing address last night that took aim at Trump’s federalization of the National Guard and use of Marines to quell protests in Los Angeles. Newsom, a Democrat who is considered a potential 2028 presidential candidate, blasted the president’s immigration enforcement tactics in remarks designed for a national audience after days of clashes between protesters and law enforcement. Read the full story here. About Contact Help Careers Ad Choices Privacy Policy Your Privacy Choices CA Notice Terms of Service (Updated JULY 7, 2023) NBC News Sitemap Closed Captioning Advertise Select Shopping © 2025 NBCUniversal Media, LLC"}