{"id": 69, "name": "American Action Forum", "domain": "americanactionforum.org", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.americanactionforum.org/research/trumps-10-percent-tariffs-projected-impacts-on-u-s-households-and-allies/", "title": "Trumps 10 Percent Tariffs Projected Impacts On U S Households And Allies", "content": "**Thank You!** Serving economic news and views every morning. Analysis on the underemployment number in the monthly jobs report. Explains and analyzes the biggest news in international trade. At least one search term must be present. The Daily Dish Research Press About AAF Events Experts The Daily Dish Research Press About AAF Events Experts At least one search term must be present. Research June 25, 2024 **Trump’s 10 Percent Tariffs: Projected Impacts on U.S. Households and Allies** Jacob Jensen Executive Summary Former president and presidential candidate Donald Trump has proposed a 10 percent tariff on all imports into the United States, which would result in average estimated additional costs per U.S. household of between $1,700 and $2,350 annually. The top 10 U.S. import partners, which represent nearly 70 percent of all imports, would be hit with tariffs up to 3 percent of their gross domestic product (GDP); retaliatory tariffs against the United States could amount to $200 billion in the event of a tit-for-tat trade war, with the aggregate impact of tariff hikes reaching up to 5 percent of GDP for the country’s largest trade partner. A targeted 60 percent tariff on China, as candidate Trump also proposed, would balloon additional U.S. consumer costs from $300 billion to over $500 billion and on its own increase household costs by $1,950 annually. Introduction Former president and presidential candidate Donald Trump has proposed a uniform 10 percent tariff on all imports into the United States, with the potential for a specific 60 percent tariff on Chinese imports.[1]Trump doubled down on his proposals on June 13, when he floated the idea of replacing all income tax revenue with tariff revenue.[2]Currently, the United States brings in over $2 trillion in income tax revenue and roughly $99 billion in tariff revenue. To implement Trump’s income tax replacement proposal, the United States would need a tariff with a rate of approximately 67 percent, the equivalent of imposing a new flat income tax of nearly 15 percent on all households.[3] Several estimates have projected the cost of a 10 percent tariff for U.S. consumers, ranging from $300 billion to $500 billion on an annual basis. Less discussed is which U.S. allies would be most impacted by the imposition of a 10 percent tariff and what retaliatory measures these countries might pursue. It is possible that many countries would respond with similar tariff hikes on U.S. exports, potentially amounting to $200 billion globally. The escalation of trade restrictions would presumably result in large-scale tax increases on consumers throughout the world, reducing global output, stunting economic growth, and eroding job market stability. Impact in the United States U.S. consumers import roughly $1 trillion more into the country than U.S. producers export, meaning the United States is a net importer of goods and services.[4]This trade deficit has long been a key talking point of former President Trump, who during his presidency proposed and later enacted import tariffs as a remedy. The Trump Administration increased tariffs by roughly $80 billion during its tenure, with the Congressional Budget Office estimating a cost of $1,300 for each U.S. household in 2020.[5]While these efforts contributed to creating thousands of domestic manufacturing jobs, the price tag for creating a single new position in the steel industry, for example, came to $900,000, which came with severe knock-on effects for other domestic industries.[6] A 10 percent tariff on all imports would have similar consequences for U.S. consumers, with middle-income families facing upward of $1,700 in additional annual costs.[7]New tariffs could increase household costs by as much as $2,350 annually if tariffs are fully passed on to consumers, resulting in a 3 percent decrease in income for the median earner.[8]If a specialized 60 percent tariff were levied against China, costs would likely increase by $3,900, an effective income loss of 5 percent for the median-income household. The desired objective of creating U.S. jobs would be achieved in certain industries but the exact figure and cost per job would be difficult to estimate. The U.S. Trade Partners Hardest Hit by Tariffs In response to a blanket tariff on all U.S. imports, American consumers would likely search for cheaper domestic alternatives, thereby reducing total imports and reducing the profits of foreign exporters. The top 10 countries the United States imports from are displayed in Table 1 and represent 69 percent of total U.S. imports.[9]Of note, the United States imports from a highly concentrated set of nations, as the top 25 import partners represent 88 percent of all imports. This suggests that the brunt of all tariff value would be imposed upon the top 10 importing partners (the majority of which are close U.S. allies) and particularly the top three. Table 1: Top 10 U.S. Import Partners ($ billions) Table 1 displays the top 10 U.S. trading partners by export value to the United States and the relative percentage of exports sent to the United States.[10]Mexico, China, and Canada would be the most impacted by higher U.S. tariffs in absolute terms. In terms of proportionality, Mexico and Canada would still be most impacted by higher U.S. tariffs, but Ireland and Vietnam would shift up the list as a greater share of their exports would be targeted compared to other U.S. trade partners. Table 2: Top 10 U.S. Import Partners by GDP Impact of U.S. Tariffs The median U.S. tariff value as a percent of a top 10 partner’s gross domestic product (GDP) would be 0.9 percent, compared to 0.4 percent for a top 25 import partner.[11]Vietnam would bear the heaviest tariff in terms of its GDP, with Mexico and Canada not far behind. Each of these countries would likely suffer economic ripple effects as many of their domestic industries heavily rely upon the U.S. market and would have trouble finding replacement markets for the inevitable decline in demand. Table 3: Top 10 Countries by GDP Impact of U.S. Tariffs When examining a broader context of 187 countries and territories, rather than just the top U.S. import partners, numerous developing countries would face a proportionally high U.S. trade barrier. Cambodia and Nicaragua would contend with a higher U.S. tariff as a percent of GDP compared to all U.S. trade partners. The overall median tariff value for all 187 countries and territories would be 0.1 percent of GDP.[12]This means that Cambodia, for example, would have a U.S. import tariff 31 times greater than the median impact on GDP. Retaliatory Measures Against the United States U.S. tariff increases would almost certainly push trade partners to respond with trade restrictions of their own, whether those be additional tariffs on U.S. exports, quotas, or other industrial policies. It is difficult to predict exactly how countries would respond, especially those that are allied with the United States. Precedent indicates that many developed nations would respond to U.S. tariff hikes with similar if not identical tariffs.[13]Developing nations have less of an ability to react dramatically given limited governmental and economic capacity. If a new Trump Administration were to signal a serious intent to implement a 10 percent tariff, trade partners would likely first attempt to negotiate exemptions before escalation. Table 4: Foreign Tariff Values and Their Domestic Costs (10 percent retaliatory rate) ($ billions) Countries most impacted by U.S. tariffs would be likely to negotiate or retaliate. Assuming all countries were to respond with a 10 percent tariff on goods imported from the United States, retaliatory tariff values could reach $200 billion. This would result in major additional costs to households in each country, as shown in Table 4.[14] Table 5: Top 10 U.S. Import Partners by Retaliatory Tariff Impact to GDP If diplomacy fails to avert a trade war, retaliatory tariffs between the United States and its key import partners would result in rather significant economic impacts given the total tariff values as a percent of GDP. While any projection of the job, productivity, and standard of living losses that would arise from these distortionary trade policies would be inherently speculative, these effects would certainly cause pain in global markets. While it may be appealing to respond to new U.S. trade barriers with further restrictions, these countries would have to consider the impact of increased tariffs on exchange rates. Increased tariffs tend to inflate that country’s exchange rate, which ultimately lowers exports as consumers search for cheaper alternatives. Should the United States impose a 10 percent tariff, the U.S. dollar would appreciate in value compared to other currencies, thereby making the goods of U.S. trade partners “cheaper” while U.S. exports fall. This exchange rate mechanism would eventually offset tariff values as American consumers would start to buy more foreign products. If these countries were to impose their own tariffs, their domestic consumers would initially buy fewer foreign goods, but as their currency appreciated, so too would their appetite for increasingly “cheaper” alternatives. In the end, additional tariffs are likely to damage relations, markets, and global trade value, all without producing their intended effect. The 60 Percent China Tariff Presidential candidate Trump has also proposed a targeted 60 percent tariff on imports from China that would drive new U.S. tariffs from an estimated $300 billion to $522 billion, having considerable ramifications for both U.S. and Chinese households. As Table 6 indicates, the cost of a trade war would be significant for consumers, amounting to roughly 3 percent of median income for households in both countries. The true costs would likely be even higher than the figures below given the ability for domestic firms to raise prices with the new tariff wall. Table 6: 60 Percent Tariff on Chinese Imports A situation where China and the United States place a 60 percent tariff on bilateral trade would likely drive the global economy into a depression. The size of both economies would make replacing lost trade between the two extremely difficult as well as upend current supply chains that would likely require years to repair. This scenario is highly unlikely to occur given the still-interdependent economies of China and the United States but puts into perspective how these sorts of restrictive trade policies add up over time. Conclusion Presidential candidate Trump’s proposed 10 percent tariff would result in hundreds of billions of dollars in additional costs to U.S. consumers and would have severe consequences for U.S. trade partners. Given a 10 percent tariff, U.S. households would have nearly $2,350 in additional annual costs, while adding a 60 percent tariff on China would drive costs up to $3,900. The top 10 U.S. import partners would face most of the fallout from U.S. tariffs, particularly Mexico, China, and Canada. In terms of the proportion of trade impacted by U.S. tariffs, Ireland and Vietnam would replace China on the list of countries most impacted. Cambodia, Nicaragua, and Vietnam have the highest U.S. tariff values as a percentage of GDP, with many top U.S. trade partners suffering sizeable tariff in terms of their respective GDPs. It is highly probable that countries hit with tariffs would retaliate with similar trade barriers that harm U.S. exports and have a chilling effect on the entire global economy. [1]Trump’s proposed 10% tariff plan would shake up every asset class: Strategist (cnbc.com);Trump floats ‘more than’ 60% tariffs on Chinese imports (cnbc.com) [2]Trump Suggests Tariffs Hikes to Pay for Some Income Tax Cuts – Bloomberg [3]Government revenues by category U.S. 2023 | Statista;Average, Median, Top 1% Household Income Percentiles – DQYDJ;U.S.: number of households 1960-2023 | Statista [4]DataWeb (usitc.gov) [5]Why Trump’s Tariff Proposals Would Harm Working Americans by Kimberly A. Clausing, Mary E. Lovely :: SSRN;Trump Tariffs: 10% Tariff on All Imports | Tax Foundation [6]Did Trump’s tariffs benefit American workers and national security? | Brookings [7]Why Trump’s Tariff Proposals Would Harm Working Americans by Kimberly A. Clausing, Mary E. Lovely :: SSRN [8]Average, Median, Top 1% Household Income Percentiles – DQYDJ;DataWeb (usitc.gov) [9]DataWeb (usitc.gov) [10]The Observatory of Economic Complexity (oec.world);DataWeb (usitc.gov) [11]Report for Selected Countries and Subjects (imf.org) [12]Report for Selected Countries and Subjects (imf.org);DataWeb (usitc.gov) [13]The Return of Industrial Policy in Data (imf.org) [14]Number of Households by Country 2024 (worldpopulationreview.com);Countries/Regions (ceicdata.com) Disclaimer **Jacob Jensen** **Trade Policy Analyst** Jacob Jensen is the Trade Policy Analyst at the American Action Forum. **Jacob Jensen** **Trade Policy Analyst** Jacob Jensen is the Trade Policy Analyst at the American Action Forum. **Related Posts** June 25, 2024 Research **Trump’s 10 Percent Tariffs: Projected Impacts on U.S. Households and Allies** Jacob Jensen Executive Summary Former president and presidential candidate Donald Trump has proposed a 10 percent tariff on all imports into the United States… June 25, 2024 Research **Trump’s 10 Percent Tariffs: Projected Impacts on U.S. Households and Allies** Jacob Jensen Executive Summary Former president and presidential candidate Donald Trump has proposed a 10 percent tariff on all imports into the United States… **Jacob Jensen** **Trade Policy Analyst** Jacob Jensen is the Trade Policy Analyst at the American Action Forum. **Jacob Jensen** **Trade Policy Analyst** Jacob Jensen is the Trade Policy Analyst at the American Action Forum. Get the Daily Dish* Δ Privacy Policy The American Action Forum is a 21st century center-right policy institute providing actionable research and analysis to solve America’s most pressing policy challenges. **Economic Indicators: Topline Numbers** **Consumer Price Index** April 2025 M/M Change:+0.2% +0.2% +0.2% Y/Y Change:+2.3% +2.3% +2.3% Measures the change in prices of all goods and services purchased for consumption by urban households. Bureau of Labor Statistics **Core Consumer Price Index** April 2025 M/M Change:+0.2% +0.2% +0.2% Y/Y Change:+2.8% +2.8% +2.8% Consumer Price Index excluding food and energy. Bureau of Labor Statistics **Core Personal Consumption Expenditures Price Index** April 2025 M/M Change:+0.1% +0.1% +0.1% Y/Y Change:+2.5% +2.5% +2.5% A measure of prices paid for goods and services excluding food and energy; the Federal Reserve’s preferred measure of inflation. Bureau of Economic Analysis **Producer Price Index** April 2025 M/M Change:-0.5% -0.5% -0.5% Y/Y Change:+2.4% +2.4% +2.4% Measures the change in selling prices received by domestic producers of goods and services. Bureau of Labor Statistics **Initial Jobless Claims** Week ending May 31, 2025 247,000 Change:+8,000 +8,000 +8,000 4-week Moving Average:230,500 230,500 230,500 Weekly unemployment insurance claims reported by each state’s unemployment insurance program offices. U.S. Department of Labor **ISM Services Index** May 2025 Index:49.9 49.9 49.9 Change:-1.7 -1.7 -1.7 A level above 50 indicates expansion Institute for Supply Management **ISM Manufacturing Index** May 2025 Index:48.5 48.5 48.5 Change:-0.2 -0.2 -0.2 A level above 50 indicates expansion Institute for Supply Management **Consumer Sentiment** May 2025 Index:52.2 52.2 52.2 Change:0.0 0.0 0.0 The core questions cover three broad areas of consumer sentiment: personal finances, business conditions, and buying conditions. University of Michigan **ADP Employment:** May 2025 Change in U.S. Private Employment:+37,000 +37,000 +37,000 Measures change in private-sector employment using ADP payroll data covering more than half a million companies with more than 25 million employees. ADP **Nondefense Capital Goods Orders Excluding Aircraft** April 2025 $74.8 B M/M Change:-1.3% -1.3% -1.3% Y/Y Change:+0.6% +0.6% +0.6% A new order is a communication of an intention to buy for immediate or future delivery. U.S. Census Bureau **New Residential Housing Starts** April 2025 1,361,000 M/M Change:+1.6% +1.6% +1.6% Y/Y Change:-1.7% -1.7% -1.7% Privately owned housing starts; seasonally adjusted at an annual rate. U.S. Census Bureau"}