{"id": 159, "name": "Boston Herald", "domain": "bostonherald.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.bostonherald.com/2025/06/11/dover-sherborn-schools-officials-update-on-photo-sharing-incident-investigation-as-parents-raise-bullying-concerns/", "title": "Dover Sherborn Schools Officials Update On Photo Sharing Incident Investigation As Parents Raise Bullying Concerns", "content": "E-Edition E-Edition NewsNewsLocal NewsCrime & Public SafetyYour Tax Dollars At WorkMassachusettsNationWorld NewsBusinessBest ReviewsHealthColumnistsTrafficAutomotiveReal Estate News Local News Crime & Public Safety Your Tax Dollars At Work Massachusetts Nation World News Business Best Reviews Health Columnists Traffic Automotive Real Estate News Local News Crime & Public Safety Your Tax Dollars At Work Massachusetts Nation World News Business Best Reviews Health Columnists Traffic Automotive Real Estate OpinionOpinionEditorialsLetters to the EditorSubmit a Letter Opinion Editorials Letters to the Editor Submit a Letter Opinion Editorials Letters to the Editor Submit a Letter SportsSportsBoston Red SoxNew England PatriotsBoston CelticsBoston BruinsOlympicsCollege SportsHigh School Sports Sports Boston Red Sox New England Patriots Boston Celtics Boston Bruins Olympics College Sports High School Sports Sports Boston Red Sox New England Patriots Boston Celtics Boston Bruins Olympics College Sports High School Sports PoliticsPoliticsDonald TrumpElection 2024State HouseBoston City Hall Politics Donald Trump Election 2024 State House Boston City Hall Politics Donald Trump Election 2024 State House Boston City Hall EntertainmentEntertainmentArtsMoviesTV and StreamingMusic and ConcertsEventsFun & GamesContestsComicsPuzzlesSpecial Sections Entertainment Arts Movies TV and Streaming Music and Concerts Events Fun & Games Contests Comics Puzzles Special Sections Entertainment Arts Movies TV and Streaming Music and Concerts Events Fun & Games Contests Comics Puzzles Special Sections LifestyleLifestyleRestaurants Food & DrinkTravelFashionBoston Herald Store Lifestyle Restaurants Food & Drink Travel Fashion Boston Herald Store Lifestyle Restaurants Food & Drink Travel Fashion Boston Herald Store Photo ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Subscribe Logout Login Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print Subscribe Login Sign up for email newsletters Subscribe Login E-Edition E-Edition Local Crime Your Tax Dollars Massachusetts Nation World News Business Health Columnists Traffic Trending: Read Howie Carr📌 Karen Read retrial Marco Sturm Elon Musk Stefon Diggs **Dover-Sherborn schools officials update on photo-sharing incident investigation as parents raise bullying concerns** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print The Dover-Sherborn Public Schools superintendent provided an update on a controversial incident involving the sharing of photos of young girls in the last school year, as parents continued to raise concerns over bullying responses at Tuesday night’s school committee meeting. “Our independent investigator has completed his report,” said Superintendent Elizabeth McCoy. … “At the end of the review, the independent investigator will determine if there is a violation of Title IX, and if so, what consequences are appropriate.” The update follows a highly-publicized back and forth between district officials, police and a former school committee member in May. In a widely-circulated email, former member Colleen Burt discussed a police investigation and warned parents of potential AI-generated explicit images created of middle and high school girls. Responses quickly came from Dover Police and the Dover-Sherborn superintendent, who said the email contained information that was “not factual and could be misleading.” Dover Police said a September investigation revealed male students had clothed photos of their female classmates, and one boy disseminated both the photos of students and “additional nude pictures of an unknown origin in these messages.” Charges were brought in juvenile court, but McCoy said they were eventually dismissed. McCoy said Tuesday an independent investigator employed by the district after the incident has completed seven reports for each student involved, some 30 pages long, that have been shared with the families. The reports are also now being reviewed by the Title IX coordinator and “decision maker in the district” she stated. Results of the review will be shared with the families, who may appeal the decision, McCoy said. Burt attended Tuesday’s School Committee meeting and read off anonymous statements she said parents had asked her to share. These included accounts from the parent of an alum who was subject to sexual harassment and a second parent of an 8th grade student who was sent pornography over Snapchat in the spring, stating the district denied her Title IX complaint and “appears to have doubled down on their stance of minimizing victims’ experiences.” A third anonymous statement came from the parent of one of the girls named as a victim in the photo-sharing police investigation in September, Burt read, and shared more allegations regarding the incident. “To brush this under the rug or turn a blind eye is not the solution,” Burt read. “What message are we sending to these boys, if there’s no discipline for their actions? The message we are sending the victims and other females is that is okay, and boys can get away with it.” School Committee Chair Angie Johnson raised concerns about sharing details of an investigation involving minor children, citing her history as a prosecutor. McCoy also stated district officials have not seen police reports from the incident. In the 2023-24 school year, Dover-Sherborn Public Schools reported a zero bullying allegations. The prior year, no information on the district’s bullying allegations was included in state data. The district consists of the local middle and high school and just over 1,000 students. **Related Articles** As feds resume student loan collections, states try to catch borrowers before they sink How scammers are using AI to steal college financial aid Behind on student loan payments? Act now as 5 million summer defaults loom Yglesias: Students need more challenges, not fewer tests Trump asks Supreme Court to allow Education Department purge McCoy addressed questions of “harassment, bullying and civil rights policies and protocols.” “We’ve updated our reporting mechanisms for both our own data as well as the state,” said McCoy, following an overview of reviews and planned overhauls. “And I feel like we’ve made a lot of progress and will continue to do so, knowing that we owe it to our students and our families.” **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print **RevContent Feed** **Most Popular** Boston’s Mass and Cass ‘remains an open-air drug market’ with residents begging for police crackdownBoston's Mass and Cass 'remains an open-air drug market' with residents begging for police crackdown **Boston’s Mass and Cass ‘remains an open-air drug market’ with residents begging for police crackdown** **Boston’s Mass and Cass ‘remains an open-air drug market’ with residents begging for police crackdown** Drake Maye to continue making his life difficult in Patriots practicesDrake Maye to continue making his life difficult in Patriots practices **Drake Maye to continue making his life difficult in Patriots practices** **Drake Maye to continue making his life difficult in Patriots practices** Battenfeld: Is Mayor Wu trying to cover up a #MeToo scandal in City Hall?Battenfeld: Is Mayor Wu trying to cover up a #MeToo scandal in City Hall? **Battenfeld: Is Mayor Wu trying to cover up a #MeToo scandal in City Hall?** **Battenfeld: Is Mayor Wu trying to cover up a #MeToo scandal in City Hall?** Auditor Diana DiZoglio wants to charge thousands for access to shelter audit recordsAuditor Diana DiZoglio wants to charge thousands for access to shelter audit records **Auditor Diana DiZoglio wants to charge thousands for access to shelter audit records** **Auditor Diana DiZoglio wants to charge thousands for access to shelter audit records** Boston Mayor Wu dismisses call for City Hall dating probe, after allegations surface against top aideBoston Mayor Wu dismisses call for City Hall dating probe, after allegations surface against top aide **Boston Mayor Wu dismisses call for City Hall dating probe, after allegations surface against top aide** **Boston Mayor Wu dismisses call for City Hall dating probe, after allegations surface against top aide** Massachusetts State Police trooper ‘seriously injured’ by hit-and-run driver: PoliceMassachusetts State Police trooper 'seriously injured' by hit-and-run driver: Police **Massachusetts State Police trooper ‘seriously injured’ by hit-and-run driver: Police** **Massachusetts State Police trooper ‘seriously injured’ by hit-and-run driver: Police** Massachusetts sex offender accused of recording woman in Target dressing roomMassachusetts sex offender accused of recording woman in Target dressing room **Massachusetts sex offender accused of recording woman in Target dressing room** **Massachusetts sex offender accused of recording woman in Target dressing room** Boston Mayor Wu signs executive order compelling President Trump to reveal ICE’s ‘secret police tactics’Boston Mayor Wu signs executive order compelling President Trump to reveal ICE's 'secret police tactics' **Boston Mayor Wu signs executive order compelling President Trump to reveal ICE’s ‘secret police tactics’** **Boston Mayor Wu signs executive order compelling President Trump to reveal ICE’s ‘secret police tactics’** Howie Carr: Numbers don’t lie! Immigration crackdown workingHowie Carr: Numbers don't lie! Immigration crackdown working **Howie Carr: Numbers don’t lie! Immigration crackdown working** **Howie Carr: Numbers don’t lie! Immigration crackdown working** MS-13 gang member arrested by ICE in Massachusetts: FedsMS-13 gang member arrested by ICE in Massachusetts: Feds **MS-13 gang member arrested by ICE in Massachusetts: Feds** **MS-13 gang member arrested by ICE in Massachusetts: Feds** **More in Local News** Gov. Maura Healey blasts Trump for ‘outrageous’ deployment of California National Guard **Gov. Maura Healey blasts Trump for ‘outrageous’ deployment of California National Guard** **Gov. Maura Healey blasts Trump for ‘outrageous’ deployment of California National Guard** Boston Mayor Wu dismisses call for City Hall dating probe, after allegations surface against top aide **Boston Mayor Wu dismisses call for City Hall dating probe, after allegations surface against top aide** **Boston Mayor Wu dismisses call for City Hall dating probe, after allegations surface against top aide** Tuesday’s high school roundup/scores: Reading bounces defending state champ Notre Dame **Tuesday’s high school roundup/scores: Reading bounces defending state champ Notre Dame** **Tuesday’s high school roundup/scores: Reading bounces defending state champ Notre Dame** Kassidy Carmichael, Westford girls upset Wellesley in 11-10 thriller **Kassidy Carmichael, Westford girls upset Wellesley in 11-10 thriller** **Kassidy Carmichael, Westford girls upset Wellesley in 11-10 thriller** 2025 June 11 Sign Up For Newsletterse-EditionSend a News Tip e-Edition Send a News Tip e-Edition Send a News Tip Contact UsBoston Herald Store/Back CopiesWork With UsLegal NoticesPrivacy PolicyAccessibilitySitemap Boston Herald Store/Back Copies Work With Us Legal Notices Privacy Policy Accessibility Sitemap Boston Herald Store/Back Copies Work With Us Legal Notices Privacy Policy Accessibility Sitemap ClassifiedsContestsSpecial SectionsFun & GamesJobs Contests Special Sections Fun & Games Jobs Contests Special Sections Fun & Games Jobs Business DirectoryNetwork AdvertisingAdtaxi Solutions Network Advertising Adtaxi Solutions Network Advertising Adtaxi Solutions Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Informatio Arbitration Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}