{"id": 1442, "name": "The Vintage News", "domain": "thevintagenews.com", "bias": "center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.thevintagenews.com/2016/07/31/amphicar-the-fastest-car-on-the-water-and-fastest-boat-on-the-road-the-car-boat-hybrid-of-the-1960s/", "title": "Amphicar The Fastest Car On The Water And Fastest Boat On The Road The Car Boat Hybrid Of The 1960s", "content": "**Old News, Vintage Photos & Nostalgic Stories** NewsFeaturedPhotosVideosToday in History Featured Photos Videos Today in History Featured Photos Videos Today in History DiscoveryAbandoned SpacesArcheologyBattlefieldsGeographyStrangeness Abandoned Spaces Archeology Battlefields Geography Strangeness Abandoned Spaces Archeology Battlefields Geography Strangeness EntertainmentGlamourPop CultureVintage Hollywood Glamour Pop Culture Vintage Hollywood Glamour Pop Culture Vintage Hollywood LifestyleFashionInteriorsCarsSelf-Propelled Fashion Interiors Cars Self-Propelled Fashion Interiors Cars Self-Propelled About us Contact us NewsFeaturedPhotosVideosToday in History Featured Photos Videos Today in History Featured Photos Videos Today in History DiscoveryAbandoned SpacesArcheologyBattlefieldsGeographyStrangeness Abandoned Spaces Archeology Battlefields Geography Strangeness Abandoned Spaces Archeology Battlefields Geography Strangeness EntertainmentGlamourPop CultureVintage Hollywood Glamour Pop Culture Vintage Hollywood Glamour Pop Culture Vintage Hollywood LifestyleFashionInteriorsCarsSelf-Propelled Fashion Interiors Cars Self-Propelled Fashion Interiors Cars Self-Propelled About us Contact us DMCA Privacy Policy Terms of Use **Amphicar-The fastest car on the water and fastest boat on the road- the car-boat hybrid of the 1960s** Strangeness Self-Propelled Is it a car? – Kind of. Is it a boat- Kind of! It’s the fastest car on the water and the fastest boat on the road, it’s the ambitious car-boat hybrid named Amphicar. While Time declared it as one of the worst cars in history by describing it as “. A vehicle that promised to revolutionize drowning,” we think it’s a genius solution for those who can afford to own both car and boat(tongue in cheek speaking, obviously). However, this car or this boat, it’s a riot, especially for me, who doesn’t have the slightest knowledge or interest in cars. Designed by Hanns Trippel, the amphibious vehicle was manufactured by the Quandt Group at Lübeck and at Berlin-Borsigwalde, with a total of 3,878 manufactured in a single generation. A descendant of the VolkswagenSchwimmwagen, the Amphicar offered only modest performance compared to most contemporary boats or cars, featured navigation lights and flag as mandated by Coast Guard — and after operating in water required greasing at 13 points, one of which required removal of the rear seat. The front is slightly pointed and sharply cut away below. The wheels are set low so that the vehicle stands well above ground level when on dry land. Front and rear bumpers are placed low on the body panels (but fairly high in relation to dry ground). The one-piece windshield is curved. The foldable top causes the body style to be classified as acabriolet. Its water propulsion is provided by twin propellers mounted under the rear bumper. The powerplant was the 1147 cc (69 in³) engine from the British Triumph Herald 1200. Many engines were tried in prototypes, but the Triumph engine was “state of the art” in 1961 and had the necessary combination of performance, weight, cool running and reliability. Updated versions of this engine remained in production in the Triumph Spitfire until 1980. The Amphicar engine had a power output of 43 hp (32 kW) at 4750 rpm, slightly more than the Triumph Herald due to a shorter exhaust. Designated the “Model 770”, the Amphicar could achieve speeds of 7 knots in the water and 70 mph (110 km/h) on land. Later versions of the engine displaced 1296 cc and 1493 cc and produced up to 75 bhp (56 kW). Some Amphicar owners have fitted these engines to improve performance. One owner was quoted “It’s not a good car and it’s not a good boat, but it does just fine” largely because of modest performance in and out of the water. Another added, “We like to think of it as the fastest car on the water and fastest boat on the road.” In water as well as on land, the Amphicar steered with the front wheels, making it less manoeuvrable than a conventional boat.Time’s Dan Neil called it “a vehicle that promised to revolutionize drowning”, explaining, “Its flotation was entirely dependent on whether the bilge pump could keep up with the leakage.” In reality, a well maintained Amphicar does not leak at all and can be left in water, parked at a dockside, for many days. **Ian Smith** Ian Smith is one of the authors writing for The Vintage News **Newsletter** **STAY UPDATED WITH OUR NEWS** Join 1000s of subscribers and receive the best Vintage News in your mailbox for FREE **Trending Today** This rotting wreck resting buried in white sandy dunes of the beach is a major tourist attraction Amphicar-The fastest car on the water and fastest boat on the road- the car-boat hybrid of the 1960s He found his grandparents vintage travel photos and embarked the adventure to recreate them ... To live in the 1920s - Fascinating reel shows what life was like in the \"Roaring Twenties\" Hurricane Sandy flooded New York back to its 17th century shape **Trending This Week** Amphicar-The fastest car on the water and fastest boat on the road- the car-boat hybrid of the 1960s These three Inca mummies, buried 500 years ago, look as if they died yesterday Delivering happiness through the years: The evolution of Coca-Cola delivery trucks Gary Cooper's Relationships: The Affairs and Scandals That Defined His Life Michelin Red Guide: How a tire company became the taste maker for the world's best restaurants ... **Most Read This Month** Amphicar-The fastest car on the water and fastest boat on the road- the car-boat hybrid of the 1960s The Skeleton Coast of Namibia is one of the harshest places on earth with ghostly remains of ships scattered along the shoreline A rare glance into the heart of a WWI German U-boat! Matthew Broderick's 1987 Car Accident in Ireland Killed a Mother and Daughter Jayne Mansfield’s Death: The Car Accident That Changed Federal Laws **Most Read This Year** The Skeleton Coast of Namibia is one of the harshest places on earth with ghostly remains of ships scattered along the shoreline A rare glance into the heart of a WWI German U-boat! Amphicar-The fastest car on the water and fastest boat on the road- the car-boat hybrid of the 1960s Richard Scarry's Classic Kids' Book updated to keep up with modern times ... Seen this - the Soviet Ekranoplan © 2014–2025The Vintage News |DMCA|Privacy Policy|Terms of Use"}