{"id": 91, "name": "Archaeology Magazine", "domain": "archaeology.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://archaeology.org/news/2025/06/10/archaeologists-identify-major-period-of-bronze-age-transformation-in-central-europe/", "title": "Archaeologists Identify Major Period Of Bronze Age Transformation In Central Europe", "content": "Archaeology Magazine Magazine Latest News **Magazine Departments** Features Digs & Discoveries Off the Grid Around the World Letters From Artifacts **Current and Past Issues** July/August 2025 **July/August 2025** **July/August 2025** May/June 2025 **May/June 2025** **May/June 2025** March/April 2025 **March/April 2025** **March/April 2025** January/February 2025 **January/February 2025** **January/February 2025** Subscribe Renew Subscription Magazine Issue Archive Find Archaeology Magazine on Facebook Find Archaeology Magazine on Twitter Find Archaeology Magazine on Instagram Find Archaeology Magazine on Threads **Archaeologists Identify Major Period of Bronze Age Transformation in Central Europe** NewsJune 10, 2025 Share to Facebook Share to X Share via Email Copy permalink to clipboardhttps://archaeology.org/news/2025/06/10/archaeologists-identify-major-period-of-bronze-age-transformation-in-central-europe/Copied to clipboard TISZAFÜRED-MAJOROSHALOM, HUNGARY—According to an announcement released by Hungary’sEötvös Loránd University, new research in the Carpathian Basin has pinpointed a major transformational period in the history of Central Europe. The study focused on eastern Hungary's Tiszafüred-Majoroshalom cemetery, which was used by two different cultures during two different time periods: the Füzesabony culture in the Middle Bronze Age and the Tumulus culture in the Late Bronze Age. Analysis of skeletal remains from the site indicates that there were major lifestyle changes in the region around 1500b.c.One of the most dramatic changes was seen in dietary habits. During the Middle Bronze Age prior to this transition, the inhabitants had a more varied diet and some community members had access to animal proteins. During the Late Bronze Age, diets became more uniform but poorer. The researchers believe this coincided with the introduction of millet, a high-energy plant that grows quickly. Thus far, the evidence of millet at Tiszafüred-Majoroshalom represents the earliest known consumption of the grain in Europe. The study also found that after 1500b.c.society became less mobile and welcomed fewer immigrants to the region, though those who did arrive traveled from greater distances. At the beginning of the Late Bronze Age, the report states, long-inhabited tell settlements were also abandoned as people moved to less centralized settlement networks. Read the original scholarly article about this research inScientific Reports. To read about evidence of skull modification uncovered at a Roman-era cemetery in western Hungary, go to \"Head Space.\" **Recommended Articles** Digs & DiscoveriesMarch/April 2025 **Ancient British Massacre** Letter from the LevantMarch/April 2025 **On the Origin of the Pork Taboo** Exploring ancient people’s shifting beliefs about rearing and eating pigs Digs & DiscoveriesNovember/December 2024 **Bronze Age Paleontologists** Digs & DiscoveriesNovember/December 2024 **Secrets of a Silver Hoard** **More to Discover** FeaturesMay/June 2025 **Lost City of the Samurai** Archaeologists rediscover Ichijodani, a formidable stronghold that flourished amid medieval Japan’s brutal power struggles FeaturesMay/June 2025A Passion for FruitExploring the surprisingly rich archaeological record of berries, melons…and moreRead Article© BnF, Dist. RMN-Grand Palais/Art Resource, NY FeaturesMay/June 2025 **A Passion for Fruit** Exploring the surprisingly rich archaeological record of berries, melons…and more FeaturesMay/June 2025 **A Passion for Fruit** Exploring the surprisingly rich archaeological record of berries, melons…and more ArtifactsMay/June 2025Etruscan Carved GemstoneRead Article© The Trustees of the British Museum ArtifactsMay/June 2025 **Etruscan Carved Gemstone** ArtifactsMay/June 2025 **Etruscan Carved Gemstone** Digs & DiscoveriesMay/June 2025The Cat and the FatRead ArticleSMB - Ägyptisches Museum und Papyrussammlung/Photo: Sandra Steiß Digs & DiscoveriesMay/June 2025 **The Cat and the Fat** Digs & DiscoveriesMay/June 2025 **The Cat and the Fat** Digs & DiscoveriesMay/June 2025The King's ThroneRead Article© Ministère de la Culture/Médiathèque du Patrimoine, Dist. RMN-Grand Palais/Art Resource, NY Digs & DiscoveriesMay/June 2025 **The King's Throne** Digs & DiscoveriesMay/June 2025 **The King's Throne** **NEVER MISS AN UPDATE** **Next Steps: Sync an Email Add-On** Archaeology Magazine Contact Us Privacy Policy Find Archaeology Magazine on Facebook Find Archaeology Magazine on Twitter Find Archaeology Magazine on Instagram Find Archaeology Magazine on Threads AboutAbout UsWriter’s GuidelinesAdvertise With UsFulfillment Policies About Us Writer’s Guidelines Advertise With Us Fulfillment Policies About Us Writer’s Guidelines Advertise With Us Fulfillment Policies MagazineFeaturesDigs & DiscoveriesOff the GridAround the WorldLetters FromArtifacts Features Digs & Discoveries Off the Grid Around the World Letters From Artifacts Features Digs & Discoveries Off the Grid Around the World Letters From Artifacts Today's News Travel **July/August 2025** Subscribe Renew Subscription Magazine Issue Archive © 2025 Archaeology Magazine, a publication of theArchaeological Institute of America Site made in collaboration withCMYK"}