{"id": 757, "name": "Kiplinger", "domain": "kiplinger.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kiplinger.com/personal-finance/banking/the-425-million-capital-one-settlement-find-out-whos-eligible-for-a-payout-and-what-happened", "title": "The 425 Million Capital One Settlement Find Out Whos Eligible For A Payout And What Happened", "content": "Save up to 74% Subscribe to Kiplinger Save up to 74% Subscribe to Kiplinger RetirementRetirementRetirementRetirementView all RetirementAnnuitiesEstate PlanningRetirement PlansSocial SecurityMedicare RetirementRetirementView all RetirementAnnuitiesEstate PlanningRetirement PlansSocial SecurityMedicare RetirementRetirementView all RetirementAnnuitiesEstate PlanningRetirement PlansSocial SecurityMedicare View all Retirement Annuities Estate Planning Retirement Plans Social Security Medicare RetirementRetirementView all RetirementAnnuitiesEstate PlanningRetirement PlansSocial SecurityMedicare RetirementRetirementView all RetirementAnnuitiesEstate PlanningRetirement PlansSocial SecurityMedicare View all Retirement Annuities Estate Planning Retirement Plans Social Security Medicare RetirementRetirementView all RetirementAnnuitiesEstate PlanningRetirement PlansSocial SecurityMedicare View all Retirement Annuities Estate Planning Retirement Plans Social Security Medicare View all Retirement Annuities Estate Planning Retirement Plans Social Security Medicare InvestingInvestingInvestingInvestingView all InvestingStocksETFsMutual FundsBondsWealth ManagementAI InvestingInvestingView all InvestingStocksETFsMutual FundsBondsWealth ManagementAI InvestingInvestingView all InvestingStocksETFsMutual FundsBondsWealth ManagementAI View all Investing Stocks ETFs Mutual Funds Bonds Wealth Management AI InvestingInvestingView all InvestingStocksETFsMutual FundsBondsWealth ManagementAI InvestingInvestingView all InvestingStocksETFsMutual FundsBondsWealth ManagementAI View all Investing Stocks ETFs Mutual Funds Bonds Wealth Management AI InvestingInvestingView all InvestingStocksETFsMutual FundsBondsWealth ManagementAI View all Investing Stocks ETFs Mutual Funds Bonds Wealth Management AI View all Investing Stocks ETFs Mutual Funds Bonds Wealth Management AI TaxesTaxesTaxesTaxesView all TaxesTax ReturnsTax DeductionsCapital Gains TaxesState TaxesTax Planning TaxesTaxesView all TaxesTax ReturnsTax DeductionsCapital Gains TaxesState TaxesTax Planning TaxesTaxesView all TaxesTax ReturnsTax DeductionsCapital Gains TaxesState TaxesTax Planning View all Taxes Tax Returns Tax Deductions Capital Gains Taxes State Taxes Tax Planning TaxesTaxesView all TaxesTax ReturnsTax DeductionsCapital Gains TaxesState TaxesTax Planning TaxesTaxesView all TaxesTax ReturnsTax DeductionsCapital Gains TaxesState TaxesTax Planning View all Taxes Tax Returns Tax Deductions Capital Gains Taxes State Taxes Tax Planning TaxesTaxesView all TaxesTax ReturnsTax DeductionsCapital Gains TaxesState TaxesTax Planning View all Taxes Tax Returns Tax Deductions Capital Gains Taxes State Taxes Tax Planning View all Taxes Tax Returns Tax Deductions Capital Gains Taxes State Taxes Tax Planning Personal FinancePersonal FinancePersonal FinancePersonal FinanceView all Personal FinanceSavingsShopping and DealsCredit CardsInsuranceMoney-savingBanking Personal FinancePersonal FinanceView all Personal FinanceSavingsShopping and DealsCredit CardsInsuranceMoney-savingBanking Personal FinancePersonal FinanceView all Personal FinanceSavingsShopping and DealsCredit CardsInsuranceMoney-savingBanking View all Personal Finance Savings Shopping and Deals Credit Cards Insurance Money-saving Banking Personal FinancePersonal FinanceView all Personal FinanceSavingsShopping and DealsCredit CardsInsuranceMoney-savingBanking Personal FinancePersonal FinanceView all Personal FinanceSavingsShopping and DealsCredit CardsInsuranceMoney-savingBanking View all Personal Finance Savings Shopping and Deals Credit Cards Insurance Money-saving Banking Personal FinancePersonal FinanceView all Personal FinanceSavingsShopping and DealsCredit CardsInsuranceMoney-savingBanking View all Personal Finance Savings Shopping and Deals Credit Cards Insurance Money-saving Banking View all Personal Finance Savings Shopping and Deals Credit Cards Insurance Money-saving Banking LifeLifeLifeLifeView all LifePlaces to LiveReal EstateTravelCareersPoliticsBusiness LifeLifeView all LifePlaces to LiveReal EstateTravelCareersPoliticsBusiness LifeLifeView all LifePlaces to LiveReal EstateTravelCareersPoliticsBusiness View all Life Places to Live Real Estate Travel Careers Politics Business LifeLifeView all LifePlaces to LiveReal EstateTravelCareersPoliticsBusiness LifeLifeView all LifePlaces to LiveReal EstateTravelCareersPoliticsBusiness View all Life Places to Live Real Estate Travel Careers Politics Business LifeLifeView all LifePlaces to LiveReal EstateTravelCareersPoliticsBusiness View all Life Places to Live Real Estate Travel Careers Politics Business View all Life Places to Live Real Estate Travel Careers Politics Business Building Wealth MoreKiplinger PuzzlesKiplinger Economic Forecasts Kiplinger Puzzles Kiplinger Economic Forecasts Kiplinger Puzzles Kiplinger Economic Forecasts NewslettersNewsletter sign-upManage my newslettersLatest issue of Kiplinger TodayLatest issue of Closing Bell Newsletter sign-up Manage my newsletters Latest issue of Kiplinger Today Latest issue of Closing Bell Newsletter sign-up Manage my newsletters Latest issue of Kiplinger Today Latest issue of Closing Bell SubscriptionsSubscriptions StoreMy SubscriptionsKiplinger Personal FinanceThe Kiplinger LetterThe Kiplinger Tax LetterKiplinger Investing for IncomeKiplinger Retirement ReportKiplinger Retirement Planning Subscriptions Store My Subscriptions Kiplinger Personal Finance The Kiplinger Letter The Kiplinger Tax Letter Kiplinger Investing for Income Kiplinger Retirement Report Kiplinger Retirement Planning Subscriptions Store My Subscriptions Kiplinger Personal Finance The Kiplinger Letter The Kiplinger Tax Letter Kiplinger Investing for Income Kiplinger Retirement Report Kiplinger Retirement Planning Newsletter sign upNewsletter A 10-Year Retirement Planning Checklist Best Dividend Kings for Decades of Dividend Growth Rules Frequent Flyers Swear By The Three C's to Financial Success Home Personal Finance Banking Savings **The $425 Million Capital One 360 Savings Settlement: Who’s Eligible for a Payout and What Happened?** Capital One agreed to a $425 million settlement over its 360 Savings account interest rates. Here’s what you need to know. Newsletter sign upNewsletter When you purchase through links on our site, we may earn an affiliate commission.Here’s how it works. Capital One agreed to pay a total of $425 million to customers who filed a class action lawsuit against the bank in 2024, according to anoticefiled in the U.S. federal court in Alexandria, Virginia last Friday. The settlement is still awaiting the judge’s approval before payments can be sent out. While there has been a ton of attention on theCapital One-Discover merger, the major bank has also been fighting a class action lawsuit regarding its savings account since last year. The lawsuit claims that Capital One pulled a bait and switch on savings account customers. It advertised the 360 Savings account as its high interest savings account and later froze rates on that account at 0.3% while rates on its newer, similarly-named 360 Performance Savings account soared to a peak of 4.3% when the Federal Reserve began rapidly increasing interest rates. **Subscribe toKiplinger’s Personal Finance** Be a smarter, better informed investor. **Sign up for Kiplinger’s Free E-Newsletters** Profit and prosper with the best of expert advice on investing, taxes, retirement, personal finance and more - straight to your e-mail. Profit and prosper with the best of expert advice - straight to your e-mail. As a result, the lawsuit alleges, Capital One avoided paying over $2 billion in interest to its customers between 2019 and 2025. As part of the agreement, Capital One denies any wrongdoing. Here’s what we know so far. **What are the accusations in the Capital One lawsuit?** When Capital One first launched its 360 Savings account in February 2019, it was advertised as a high interest savings account. By September of that year, the bank had removed all references to that account, stopped offering it to new customers and replaced it with information about the new 360 Performance Savings account. The new 360 Performance Savings account opened with a 1.9% APY, while the previous 360 Savings account earned just 1% APY. The lawsuit alleges that Capital One actively deceived customers by advertising the 360 Savings account as its high interest product, but then later creating a new, higher-earning account without automatically converting the older account type or notifying existing customers. When the pandemic hit in 2020 triggering even lower interest rates, Capital One dropped rates on the older account type to just 0.3%, while the 360 Performance Savings account earned 0.4%. The crux of the suit is what happened after this. When the Federal Reserve began a rapid series of rate hikes in 2022, the Capital One 360 Performance Savings account saw its APY soar to 4.3%, while the older 360 Savings accounts were frozen at the 0.3% rate. The claimants allege that Capital One avoided paying over $2 billion in interest between 2019 and 2025 as a result. The Consumer Financial Protection Bureau (CFPB)announced in Januarythat it was also suing Capital One over the same issue. The agency accused the bank of actively obscuring the newer, higher-earning 360 Performance Savings from existing 360 Savings accountholders. TheCFPBsuit alleged that Capital One did this by: Giving the new account an almost identical name, along with all the same terms and conditions (aside from the interest rate) Replacing all references to the original 360 Savings account on its website with information about the new 360 Performance Savings account, without notifying accountholders that it was maintaining the older account type as a distinct product (and that that product would no longer be its highest-earning savings account option) Forbidding employees from proactively telling 360 Savings accountholders about the new 360 Performance Savings product Excluding existing 360 Savings accountholders from an advertising campaign about the newer account – a campaign that showcased the higher earning product to all of Capital One’s other existing customers who didn’t currently have the older savings account By February, the Trump administrationdropped the Capital One casealong with dozens of others. But if the CFPB’s suit had moved forward, it would have forced Capital One to pay even more into a victims' relief fund that could help Capital One customers recoup even more of the potential earnings they missed out on between 2019 and 2025. **Who is eligible for a payout from the Capital One settlement?** The settlement will apply to both current and former customers who have or had a Capital One 360 Savings account at some point between September 18, 2019 and the date the judge approves the settlement. **How much will members of the class action lawsuit get?** The $425 million settlement will be paid out in two ways: $300 million will be used to pay all members of the class action lawsuit the amount of interest they would have earned if their account had been earning the same rates as the 360 Performance Savings account. The amount each member gets will be based on the length of time they held the account and what the rates were for the 360 Performance Savings account during the time that they had the older 360 Savings account. The remaining $125 million will go toward customers who still have a 360 Savings account. Their accounts will now earn at least double the national average rate for savings accounts, as defined by the FDIC. **When will Capital One begin sending out payments?** The settlement is still pending court approval, so there are no hard deadlines just yet. However, a court approval hearing is expected to happen later this year to finalize those details. After that, members of the class action lawsuit can likely expect to see payments start going out sometime next year. **How to make sure you’re really getting the best rate on your savings account** Whether you’re a Capital One customer or not, one thing this case highlights is the importance of being vigilant about your finances. Savings accounts – evenhigh yield savings accounts– have variable interest rates by nature. So, even if the account you opened offered the best rate at the time, that same bank or its competitors may be offering an even better rate now. Here are some steps you can take to make sure you’re always earning as much as possible on your savings: Check thebest high yield savings accountoffers available every few months and compare today’s best rates to what your existing account is earning. Opening a new account online takes as little as five minutes, so it’s easier than ever to move your savings around as often as needed to make sure you’re always earning the best rate. Stash any savings you don’t need immediate access to in ahigh-yield CD account. Unlike savings accounts, a CD offers a fixed rate for the entire term so you won’t see your initially high APY dwindle over the next few months or years. With terms ranging from as little as three months up to five years, you can pick a time frame that fits with your savings goals. These are great to use for short-term savings goals, like a vacation you’re planning next year or a down payment on a new car. Check for fees and account requirements before opening an account. Some banks have minimum balance requirements, maintenance fees or other restrictions that can result in charges that eat into your savings. Taking a slightly lower interest rate on ano-fee savings accountmight end up earning you more than the higher-yield account with hard-to-meet requirements. **Related content** Check Your Mailbox: Wells Fargo Settlement Payments Have Begun Is Your Local Bank Closing? Why Branches Are Disappearing Nationwide 5 Biggest Frauds To Watch Out For Scams: Senior Investors Targeted As Crypto Payment Use Grows **Get Kiplinger Today newsletter — free** Profit and prosper with the best of Kiplinger's advice on investing, taxes, retirement, personal finance and much more. Delivered daily. Enter your email in the box and click Sign Me Up. Rachael Green is a personal finance eCommerce writer specializing in insurance, travel, and credit cards. Before joining Kiplinger in 2025, she wrote blogs and whitepapers for financial advisors and reported on everything from the latest business news and investing trends to the best shopping deals. Her bylines have appeared in Benzinga, CBS News, Travel + Leisure, Bustle, and numerous other publications. A former digital nomad, Rachael lived in Lund, Vienna, and New York before settling down in Atlanta. She’s eager to share her tips for finding the best travel deals and navigating the logistics of managing money while living abroad. When she’s not researching the latest insurance trends or sharing the best credit card reward hacks, Rachael can be found traveling or working in her garden. Is Your Will 'Fair'? Estate Planning Is About More Than MoneyYour will and estate plan should leave your heirs feeling loved. An expert weighs in on how to avoid family feuds after you're gone. Your will and estate plan should leave your heirs feeling loved. An expert weighs in on how to avoid family feuds after you're gone. Your will and estate plan should leave your heirs feeling loved. An expert weighs in on how to avoid family feuds after you're gone. Your will and estate plan should leave your heirs feeling loved. An expert weighs in on how to avoid family feuds after you're gone. Will Your Home Still Appear on Zillow? New Rules Say Maybe NotZillow now requires that home listings be added to an MLS within one day of any public marketing. Here’s what home sellers and agents need to know about the updated rules. Zillow now requires that home listings be added to an MLS within one day of any public marketing. Here’s what home sellers and agents need to know about the updated rules. Zillow now requires that home listings be added to an MLS within one day of any public marketing. Here’s what home sellers and agents need to know about the updated rules. Zillow now requires that home listings be added to an MLS within one day of any public marketing. Here’s what home sellers and agents need to know about the updated rules. Kiplinger Readers' Choice Awards 2025: National BanksReaders' Choice AwardsIn our 2025 Readers' Choice Awards survey, readers evaluated financial providers. Find out which national banks came out on top. Readers' Choice AwardsIn our 2025 Readers' Choice Awards survey, readers evaluated financial providers. Find out which national banks came out on top. Readers' Choice AwardsIn our 2025 Readers' Choice Awards survey, readers evaluated financial providers. Find out which national banks came out on top. Readers' Choice AwardsIn our 2025 Readers' Choice Awards survey, readers evaluated financial providers. Find out which national banks came out on top. Kiplinger Readers' Choice Awards 2025: Internet BanksReaders' Choice AwardsIn our 2025 Readers' Choice Awards survey, readers evaluated financial providers. Find out which internet banks came out on top. Readers' Choice AwardsIn our 2025 Readers' Choice Awards survey, readers evaluated financial providers. Find out which internet banks came out on top. Readers' Choice AwardsIn our 2025 Readers' Choice Awards survey, readers evaluated financial providers. Find out which internet banks came out on top. Readers' Choice AwardsIn our 2025 Readers' Choice Awards survey, readers evaluated financial providers. Find out which internet banks came out on top. Stacked but Stagnant: All That Cash in Your Checking Account Might Be Holding You BackKeeping too much cash in your checking account might seem safe, but it could be costing you in missed opportunities. Keeping too much cash in your checking account might seem safe, but it could be costing you in missed opportunities. Keeping too much cash in your checking account might seem safe, but it could be costing you in missed opportunities. Keeping too much cash in your checking account might seem safe, but it could be costing you in missed opportunities. Seven Habits Rich People Swear By to Build and Maintain WealthUnlock the secret to lasting financial success by adopting the wealth-building habits of a high-net-worth individual. Unlock the secret to lasting financial success by adopting the wealth-building habits of a high-net-worth individual. Unlock the secret to lasting financial success by adopting the wealth-building habits of a high-net-worth individual. Unlock the secret to lasting financial success by adopting the wealth-building habits of a high-net-worth individual. A Smart Way to Combat Economic Rollercoasters: CD LaddersSavingsWith rates on CDs remaining high for now, a CD ladder allows you to maximize your returns with flexibility to your cash when you need it. SavingsWith rates on CDs remaining high for now, a CD ladder allows you to maximize your returns with flexibility to your cash when you need it. SavingsWith rates on CDs remaining high for now, a CD ladder allows you to maximize your returns with flexibility to your cash when you need it. SavingsWith rates on CDs remaining high for now, a CD ladder allows you to maximize your returns with flexibility to your cash when you need it. Rich, Single and Saving Smart: How to Maximize Your MoneyHigh-net-worth individuals often have plenty of cash on hand, but to truly maximize your income, that money needs to work for you. Here’s how. High-net-worth individuals often have plenty of cash on hand, but to truly maximize your income, that money needs to work for you. Here’s how. High-net-worth individuals often have plenty of cash on hand, but to truly maximize your income, that money needs to work for you. Here’s how. High-net-worth individuals often have plenty of cash on hand, but to truly maximize your income, that money needs to work for you. Here’s how. Does Your State Make it Easier to Save Money?The state you live in can influence how well you're able to save money. See which states make saving easier. The state you live in can influence how well you're able to save money. See which states make saving easier. The state you live in can influence how well you're able to save money. See which states make saving easier. The state you live in can influence how well you're able to save money. See which states make saving easier. Worried About Stock Market Volatility? Here’s Where to Put Your Money InsteadLearn how to use high-yield savings accounts, CDs, Treasury securities, annuities and dividend stocks to stay steady in uncertain times. Learn how to use high-yield savings accounts, CDs, Treasury securities, annuities and dividend stocks to stay steady in uncertain times. Learn how to use high-yield savings accounts, CDs, Treasury securities, annuities and dividend stocks to stay steady in uncertain times. Learn how to use high-yield savings accounts, CDs, Treasury securities, annuities and dividend stocks to stay steady in uncertain times. About Us Contact Future's experts Terms and Conditions Privacy Policy Cookie Policy Advertise with us Kiplinger is part of Future US Inc, an international media group and leading digital publisher.Visit our corporate site. © Future US, Inc. Full 7th Floor, 130 West 42nd Street, New York, NY 10036."}