{"id": 867, "name": "Malay Mail", "domain": "malaymail.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.malaymail.com/news/malaysia/2025/06/11/perak-police-advise-bus-driver-in-upsi-crash-to-hold-off-on-public-comments-pending-probe-dashcam-footage-of-accident-sent-for-analysis/179940", "title": "Perak Police Advise Bus Driver In Upsi Crash To Hold Off On Public Comments Pending Probe Dashcam Footage Of Accident Sent For Analysis", "content": "About Us Advertise Home MALAYSIA SINGAPORE MONEY WORLD LIFE EAT/DRINK SHOWBIZ OPINION SPORTS TECH/GADGETS What You Think 精彩大马 ARCHIVESABOUT USPRIVACY POLICYTERMS OF USEADVERTISE 精彩大马 **Loh Siew Hong’s ex-husband dies amid custody battle and domestic violence trial** **AGC rejects Najib’s bid to drop SRC RM27m money laundering charges, court to decide on DNAA by June 20** **Taxing the richest 10pc to redistribute wealth will make govt ‘very unpopular’, says Fuziah Salleh** **Bus operator’s permit revoked over Gerik crash, no appeal allowed, says Loke** **Malaysia EV registrations surge 69.3pc in May, Tesla Model Y overtakes Proton e.MAS 7** **Los Angeles declares curfew as Trump decries protests as ‘foreign invasion’** **In Melaka, Fama staff fined RM10,000 for offensive post on X** **Perak police advise bus driver in UPSI crash to hold off on public comments pending probe; dashcam footage of accident sent for analysis** **‘We’ve learned not to overpromise’: PKR sec-gen, Bersatu lawmaker reject call for binding election pledges** **No tax on essentials: Mat Sabu says govt prioritising food security in SST expansion** **Ex-varsity registrar pleads not guilty to forging documents to siphon over RM820,000 from university funds** **Eight restored George Town buildings to open for public tours during July heritage celebrations** **Police deploy drones to nab bikers flouting lane rules on Federal Highway** **In KL, ex-international school staff pleads not guilty to CBT, cheating involving over RM142,000** **Musk admits Trump criticisms ‘went too far,’ expresses regret after public clash** **Perak police advise bus driver in UPSI crash to hold off on public comments pending probe; dashcam footage of accident sent for analysis** IPOH, June 11 — Perak police have advised the bus driver involved in the tragic crash that claimed the lives of 15 Universiti Pendidikan Sultan Idris (UPSI) students to refrain from making any further public statements until his official statement is recorded. Perak police chief Datuk Noor Hisam Nordin said any premature public comments by the driver could jeopardise the ongoing investigation and potentially fuel unwarranted speculation. “While he has the right to speak, we recommend he waits until we officially record his statement. “This case involves multiple dimensions, including the bus company, road conditions, and various technical aspects. “It is crucial that we allow the authorities to carry out their investigation thoroughly before drawing any conclusions. “The final findings will be made public once the investigation is complete,” he told reporters during a press conference at the Perak police headquarters. Noor Hisam added that the police have not yet remanded the driver, pending his discharge from hospital. Yesterday, the driver, Mohd Amirul Fadhil Zulkifle, publicly apologised for the incident and denied allegations that he had been speeding. Speaking to Harian Metro, the driver claimed the crash was the result of a sudden brake failure while descending a hilly section of the East-West Highway near the elephant crossing bridge in Gerik. According to Mohd Amirul, he did his best to prevent the bus from crashing into other vehicles as it sped downhill uncontrollably. Separately, Noor Hisam said the police have recorded statements from 18 individuals in relation to the crash. “This includes 13 injured students, the driver of a red Perodua Alza and his wife, two forensic doctors from Gerik Hospital, and a witness who captured the incident in a viral dashcam recording,” he said. He also noted that the authorities are investigating the authenticity of the dashcam footage circulating online. “Many have questioned whether the bus shown in the footage is the actual vehicle involved. The video is not very clear and could be challenged. Verification is still ongoing. “We need experts to confirm the authenticity and whether the location and vehicle match the incident in question,” he explained. Noor Hisam confirmed that there is only one dashcam recording available so far, and a statement has been taken from the vehicle’s owner. “The video will be sent for forensic verification which will be handled by another agency as it falls outside our jurisdiction,” he added. He also urged the public to act responsibly and avoid spreading unverified or potentially harmful content about the tragedy. “This is a heartbreaking and sensitive event. We should be expressing sympathy and support, not seeking attention through sensational posts,” he said. He also said initial inspections of the bus by Puspakom have yet to yield conclusive findings. The fatal crash occurred early Monday morning when the bus carrying the UPSI students overturned at KM53 of the East-West Highway (JRTB), near Tasik Banding in Gerik, killing 15 students. **You May Also Like** **Related Articles** **No tax on essentials: Mat Sabu says govt prioritising food security in SST expansion** **Trash trouble in Sabah: Waste, pests and health risks plague tourist hotspots** **Zambry says PTPTN to write off loans of 13 UPSI crash victims, RM1,500 for each family** **Just IN** **No tax on essentials: Mat Sabu says govt prioritising food security in SST expansion** **Trash trouble in Sabah: Waste, pests and health risks plague tourist hotspots** **Zambry says PTPTN to write off loans of 13 UPSI crash victims, RM1,500 for each family** News MalaysiaSingaporeWorldMoneyLifeEat/Drink Malaysia Singapore World Money Life Eat/Drink Malaysia Singapore World Money Life Eat/Drink ShowbizOpinionWhat You ThinkSportsTech/Gadgets Showbiz Opinion What You Think Sports Tech/Gadgets Showbiz Opinion What You Think Sports Tech/Gadgets About ARCHIVES ABOUT US PRIVACY POLICY TERMS OF USE ADVERTISE"}