{"id": 55, "name": "American Journal of Archaeology", "domain": "ajaonline.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://ajaonline.org/archaeological-note/the-question-of-wine-consumption-in-early-bronze-age-troy-organic-residue-analysis-and-the-emdepas-amphikypellon-em/", "title": "The Question Of Wine Consumption In Early Bronze Age Troy Organic Residue Analysis And The Emdepas Amphikypellon Em", "content": "Home About Current Issue Access the AJA Author Guide Support the AJA **April 2025 (129.2)** **April 2025 (129.2)** **The Question of Wine Consumption in Early Bronze Age Troy: Organic Residue Analysis and theDepas amphikypellon** ByStephan W.E. Blum,Maxime Rageot, andTobias Mühlenbruch Since its discovery during Heinrich Schliemann’s excavations at Troy, thedepas amphikypellon, a cylindrical goblet with two curved handles which is thought to be the goblet mentioned in Homer’s epics, has been considered a potential drinking vessel for wine. Recent biomolecular investigations by the Institute of Prehistory, Early History, and Medieval Archaeology in Tübingen confirm this hypothesis by identifying high concentrations of fruit acids indicative of regular use specifically for wine—though these same acids were also found in cups and beakers from Troy. This raises questions regarding the social and cultural significance of the beverage: while previously perceived as an exclusive emblem of the Early Bronze Age elite, wine consumption may have been more widespread than previously assumed. Further examinations at other sites could reveal whether a wider range of vessels were utilized for wine elsewhere, potentially challenging current assumptions about the distribution and consumption of wine during the third millennium BCE. Depas amphikypellon from Schliemann’s excavations at Troy, ht. 19 cm. Institute of Classical Archaeology at the University of Tübingen, inv. KLA-Or-764, acq. 1901 (V. Marquardt). More articles like this: Depas amphikypellon from Schliemann’s excavations at Troy, ht. 19 cm. Institute of Classical Archaeology at the University of Tübingen, inv. KLA-Or-764, acq. 1901 (V. Marquardt). By Stephan W.E. Blum, Maxime Rageot, and Tobias Mühlenbruch American Journal of ArchaeologyVol. 129, No. 2 (April 2025), pp. 263-279 DOI: 10.1086/734061 © 2025 Archaeological Institute of America Subscribe to our email-only monthly newsletter highlighting the journal’s current table of contents and open access material, such as book reviews. AJA e-Update AIA e-Update Fieldnotes: Professional Newsletter Archaeology e-Update Yes No AboutWho We AreEditorial PolicyHistorical TimelineHow to Support Who We Are Editorial Policy Historical Timeline How to Support Who We Are Editorial Policy Historical Timeline How to Support AccessSubscribeOpen AccessArchiveUCPJSTOR Subscribe Open Access Archive UCP JSTOR Subscribe Open Access Archive UCP JSTOR SubmissionsGuidelinesManuscript PreparationForms and ChecklistsBooks Available for Review Guidelines Manuscript Preparation Forms and Checklists Books Available for Review Guidelines Manuscript Preparation Forms and Checklists Books Available for Review Contacts & FAQSubmission SiteAdvertisePermissions & Reprints Submission Site Advertise Permissions & Reprints Submission Site Advertise Permissions & Reprints The American Journal of Archaeology stands in solidarity with Black, Indigenous, and People of Color against systemic injustice in North America and throughout the world. The Journal fully endorses theAIA Statement on Archaeology and Social Justice. Privacy Policy Contact Us"}