{"id": 2231, "name": "The Hard Times", "domain": "thehardtimes.net", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://thehardtimes.net/music/laura-jane-grace-and-the-mississippi-medicals-debut-ep-technically-the-closest-thing-anyone-in-mississippi-has-to-healthcare/", "title": "Laura Jane Grace And The Mississippi Medicals Debut Ep Technically The Closest Thing Anyone In Mississippi Has To Healthcare", "content": "The Hard Times Hard Drive Aboutopen menuAboutContactPrivacy PolicyAdvertise About Contact Privacy Policy Advertise About Contact Privacy Policy Advertise Podcasts Home Musicopen menuMusicPremieresCountryEmo/ScreamoGothGrind/Noise/OtherIndieMetalOi!PopPop PunkPunk/HardcoreRapRockSka Music Premieres Country Emo/Screamo Goth Grind/Noise/Other Indie Metal Oi! Pop Pop Punk Punk/Hardcore Rap Rock Ska Music Premieres Country Emo/Screamo Goth Grind/Noise/Other Indie Metal Oi! Pop Pop Punk Punk/Hardcore Rap Rock Ska Real News Blog Video Games Cultureopen menuCultureActivismRecord CollectingStraight Edge/VeganTattoo/PiercingWeed Culture Activism Record Collecting Straight Edge/Vegan Tattoo/Piercing Weed Culture Activism Record Collecting Straight Edge/Vegan Tattoo/Piercing Weed Hall of Fame Opinion Reviews Video Live Events Shop **Laura Jane Grace and the Mississippi Medicals Debut EP Technically the Closest Thing Anyone in Mississippi Has to Healthcare** ByJames Knapp| September 22, 2024 BILOXI, Miss. — Recent reports from the United States Department of Health and Human Services indicate that thedebut EP by Laura Jane Grace and the Mississippi Medicalsis the only barrier standing between millions of Mississippians and grievous injury or illness on a daily basis, sources fearful for the state’s general well being confirmed. “I would like to start off by saying to the people of Mississippi, and I can’t stress this enough, this album is not intended to cure rickets. We don’t know how that rumor got started, but let’s just put an end to it right now,” stated noticeably frustrated Secretary of Health and Human Services Xavier Becerra in a press release earlier. “We’re still investigating just how a punk rock record became the state of Mississippi’s only semblance of healthcare. But until then we want to reiterate for all citizens that, if you are having a health emergency, please make sure you have crossed state lines before expecting anyone to be able to assist you.” Biloxi resident Curtis Jefferson detailed the local healthcare infrastructure his community is forced to deal with. “There’s not much point in having health insurance when the closest thing your town has to a doctor is just a horse that will kick you in the mouth for an apple. That’s how I tried to cure my jaundice one time – it didn’t work. Arguably it made it worse,” explained Jefferson. “We did have a kind of okay minute clinic up until a couple of years ago. That’s when Waffle House bought the building, loaded it onto the back of a tractor-trailer and created the ‘World’s First Mobile Meth Library.’ Now that that’s gone it makes that horse the only game in town.” In response to the EP’s growing popularity with the southern medical care seekers, Laura Jane Grace went on record with a recent statement. “While I am grateful for the enthusiasm for this batch of songs, I also want to acknowledge what a depressing hellhole Mississippi’s healthcare system is – and that’s not me passing judgment! Remember, I’m from Florida after all,” said Grace. “I just want to remind everyone who has no other healthcare alternative that the album is not intended to be taken orally. You just listen to it, so please stop tweeting at me asking if the vinyl comes in other ‘flavors.’” At press time, the Mississippi legislature introduced a bill transforming all of the state’s remaining ambulances into casino shuttle buses. **Purchase the EP wherever you get your music:** **Hard Shoppes** Punk News Comin' Your Way!!!"}