{"id": 2043, "name": "Metro UK", "domain": "metro.co.uk", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://metro.co.uk/2025/06/11/tottenham-aston-villa-and-newcastle-in-race-to-sign-25m-manchester-united-star-on-loan-23391635/", "title": "Tottenham Aston Villa And Newcastle In Race To Sign 25m Manchester United Star On Loan 23391635", "content": "NewsExpand News SubmenuExpand News SubmenuUKLondonUSWorldCrimeTechSciencePoliticsNews Updates newsletterE-edition UK London US World Crime Tech Science Politics News Updates newsletter E-edition UK London US World Crime Tech Science Politics News Updates newsletter E-edition EntertainmentExpand Entertainment SubmenuExpand Entertainment SubmenuShowbizTVFilmMusicGaming Showbiz TV Film Music Gaming Showbiz TV Film Music Gaming SportExpand Sport SubmenuExpand Sport SubmenuFootballPremier LeagueTransfer NewsCricketBoxingTennisSnooker Football Premier League Transfer News Cricket Boxing Tennis Snooker Football Premier League Transfer News Cricket Boxing Tennis Snooker LifestyleExpand Lifestyle SubmenuExpand Lifestyle SubmenuSexHealthPropertyFoodTravelHoroscopesMoneyShoppingLifelineThe Slice newsletter Sex Health Property Food Travel Horoscopes Money Shopping Lifeline The Slice newsletter Sex Health Property Food Travel Horoscopes Money Shopping Lifeline The Slice newsletter SoapsExpand Soaps SubmenuExpand Soaps SubmenuEastEndersEmmerdaleCoronation StreetHollyoaksSoaps ShowbizSoaps Newsletter EastEnders Emmerdale Coronation Street Hollyoaks Soaps Showbiz Soaps Newsletter EastEnders Emmerdale Coronation Street Hollyoaks Soaps Showbiz Soaps Newsletter OpinionExpand Opinion SubmenuExpand Opinion SubmenuColumnistsLettersCartoons Columnists Letters Cartoons Columnists Letters Cartoons ShoppingExpand Shopping SubmenuExpand Shopping SubmenuBeauty ProductsBlack FridayAmazon Prime DayShopping Newsletter Beauty Products Black Friday Amazon Prime Day Shopping Newsletter Beauty Products Black Friday Amazon Prime Day Shopping Newsletter NewslettersExpand Newsletters SubmenuExpand Newsletters SubmenuDaily HoroscopeThe GetawayNews UpdatesSoaps UpdatesThe Slice newsletterGame Central Daily Horoscope The Getaway News Updates Soaps Updates The Slice newsletter Game Central Daily Horoscope The Getaway News Updates Soaps Updates The Slice newsletter Game Central PuzzlesExpand Puzzles SubmenuExpand Puzzles SubmenuQuick CrosswordCryptic CrosswordWord WheelHangmanEasy SudokuMedium SudokuHard Sudoku Quick Crossword Cryptic Crossword Word Wheel Hangman Easy Sudoku Medium Sudoku Hard Sudoku Quick Crossword Cryptic Crossword Word Wheel Hangman Easy Sudoku Medium Sudoku Hard Sudoku MoneyExpand Money SubmenuExpand Money SubmenuCost of LivingDealsHacksSaving Cost of Living Deals Hacks Saving Cost of Living Deals Hacks Saving PropertyExpand Property SubmenuExpand Property SubmenuWhat I RentWhat I OwnProperty PricesHome renovationsInteriorsRentingBetter LivingThe Key Newsletter What I Rent What I Own Property Prices Home renovations Interiors Renting Better Living The Key Newsletter What I Rent What I Own Property Prices Home renovations Interiors Renting Better Living The Key Newsletter TravelExpand Travel SubmenuExpand Travel SubmenuTravel AdviceTravel ReviewsTravel InspirationThe Getaway Travel Advice Travel Reviews Travel Inspiration The Getaway Travel Advice Travel Reviews Travel Inspiration The Getaway HoroscopesExpand Horoscopes SubmenuExpand Horoscopes SubmenuYour Daily HoroscopeAstrologyTarotChinese ZodiacDaily Horoscope Newsletter Your Daily Horoscope Astrology Tarot Chinese Zodiac Daily Horoscope Newsletter Your Daily Horoscope Astrology Tarot Chinese Zodiac Daily Horoscope Newsletter MoreExpand More SubmenuExpand More SubmenuVideoGamesSubmit StuffCompetitionsAdvertiseWeatherTrendingPrivacy Policy Video Games Submit Stuff Competitions Advertise Weather Trending Privacy Policy Video Games Submit Stuff Competitions Advertise Weather Trending Privacy Policy Metro on Instagram Metro on Facebook Metro on X Metro on TikTok **Tottenham, Aston Villa and Newcastle in race to sign £25m Manchester United star on loan** Tottenham,Aston VillaandNewcastle Unitedare in the running to signJadon SanchofromManchester Unitedin the summer transfer window, according to reports. Chelsea confirmed on Wednesday that they are not taking up their £25 million permanent option to sign Sancho following his season-long stint at Stamford Bridgeand have paid a £5m penalty fee to send him back to United. Sancho’s future is now uncertainas it’s understood that Ruben Amorim has no plans to integrate the 25-year-old into his squad for United’s pre-season campaign. According toThe Sun, Sancho has already attracted interest from three Premier League clubs with Spurs, Villa and Newcastle all keeping tabs on the winger’s situation at Old Trafford. It’s claimed that Villa will aim to secure a loan deal but United are looking for a permanent sale this summer. **Get personalised updates on Manchester United every day** Wake up to find news on your club in your inbox every morning with Metro’s Football Newsletter. Sign up to our newsletterand then select your team in the link so we can send you football news tailored to you. Chelsea, who is on a £300,000-a-weekdeal with United, had the option to sign Sancho permanently for a £25m fee but could not reach an agreement with the winger over personal terms. Meanwhile, Borussia Dortmund have all but ruled out the prospect of re-signing Sancho this summer. **MoreTrending** Paul Scholes urges Man Utd to 'just buy' £68m England star during Senegal defeatChannel: FootballFootball22 hours agoByChris Davie **Paul Scholes urges Man Utd to 'just buy' £68m England star during Senegal defeat** **Paul Scholes urges Man Utd to 'just buy' £68m England star during Senegal defeat** Arsenal meet with Viktor Gyokeres' agent as striker makes Man Utd transfer decision Thomas Partey breaks silence on Arsenal future and reacts to Martin Zubimendi transfer Carlo Ancelotti praises Arsenal star and player Man Utd are 'open' to selling Dortmund signed Sancho from Manchester City for £8m in 2017 and the winger enjoyed the best seasons of his career with the Bundesliga club before his £73m move to United in 2021. Sancho has been linked with a return to Dortmund this summer but the German club’s sporting director, Sebastian Kehl, says the club have other priorities. ‘Of course, contact with Jadon is always there, in some way, because we have a very long history,’ Kehl told Ruhr Nachrichten. ‘But that’s not an issue for us right now. We have other priorities at the moment, and that’s why the Sancho issue may have been more talked about in the media than internally.’ For more stories like this,check our sport page. Follow Metro Sport for the latest news onFacebook,TwitterandInstagram. ArrowMORE:Newcastle in transfer talks for Brighton, Nottingham Forest and Burnley stars ArrowMORE:Former Premier League star accused of smuggling £48m of cocaine faces 13 years in prison ArrowMORE:Arsenal hold meeting with Viktor Gyokeres’ agent as striker makes Manchester United transfer call Sign up and tell us which team you support to get personalised updates about your club. Select your team for football news tailored to youClose This site is protected by reCAPTCHA and theGoogle Privacy PolicyandTerms of Serviceapply. Your information will be used in line with ourPrivacy Policy Aston Villa FC Aston Villa Transfer News Chelsea FC Chelsea transfer news Jadon Sancho Manchester United FC Manchester United Transfer News Newcastle United FC Newcastle United Transfer News Premier League Tottenham Hotspur Tottenham Hotspur transfer news Transfer News and Rumours **Arsenal meet with Viktor Gyokeres' agent as striker makes Man Utd transfer decision** **Newcastle in transfer talks for Brighton, Nottingham Forest and Burnley stars** **Must Read** **How to watch Club World Cup 2025 in UK: TV channel and live stream** **Wimbledon to be shown on new TV channel for 2025** **Football fan dies after falling from stand during Portugal v Spain final** **Napoli want to sign £40m Chelsea 'leader' to challenge in Champions League** **Viktor Gyokeres rejects £55m transfer after Man Utd, Arsenal and Chelsea talks** **Chelsea ready to pay £50m to sign Premier League star ahead of Arsenal** **Arsenal 'very close' to signing Konstantinos Karetsas in £37.8m transfer** **Chelsea 'hesitate' over signing £68m striker ahead of Liverpool** **'Disappointed' - Stuart Pearce slams 'slow and lethargic' England star after Andorra win** **Paul Scholes urges Man Utd to 'just buy' £68m England star during Senegal defeat** **Trending Now** Arsenal meet with Viktor Gyokeres' agent as striker makes Man Utd transfer decisionChannel: FootballFootball5 hours agoByChris Davie **Arsenal meet with Viktor Gyokeres' agent as striker makes Man Utd transfer decision** **Arsenal meet with Viktor Gyokeres' agent as striker makes Man Utd transfer decision** Paul Scholes urges Man Utd to 'just buy' £68m England star during Senegal defeat Newcastle in transfer talks for Brighton, Nottingham Forest and Burnley stars Arsenal urged to avoid transfer for £40m 'generation talent' seeking move Thomas Partey breaks silence on Arsenal future and reacts to Martin Zubimendi transfer **Metro Shorts** © 2025 Associated Newspapers Limited Powered by WordPress.com VIP Your ad choices IPSO Regulated Contributors Newzit Daily Mail Discount codes about us Discount codes FAQ Terms and Conditions Privacy Policy Do not sell or share my personal information Site map Contact Us About Metro on Instagram Metro on Facebook Metro on X Metro on TikTok Sign up and tell us which team you support to get personalised updates about your club. Select your team for football news tailored to youClose This site is protected by reCAPTCHA and theGoogle Privacy PolicyandTerms of Serviceapply. Your information will be used in line with ourPrivacy Policy"}