{"id": 230, "name": "Marion Chronicle-Tribune", "domain": "chronicle-tribune.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.chronicle-tribune.com/site/privacy.html", "title": "Www.chronicle Tribune.com", "content": "Log In My AccountMy AccountDashboardProfileSaved ItemsSubscribeManage ServiceLog Out My AccountMy AccountDashboardProfileSaved ItemsSubscribeManage ServiceLog Out My Account Dashboard Profile Saved Items Subscribe Manage Service Log Out My AccountMy AccountDashboardProfileSaved ItemsSubscribeManage ServiceLog Out My Account Dashboard Profile Saved Items Subscribe Manage Service Log Out My Account Dashboard Profile Saved Items Subscribe Manage Service Log Out Subscribe Manage Service About Us Contact Us Promote Your Event Historical Archives Subscribe e-Edition A.I. Policy Local News Business Celebrations Live National/World News Indiana News Local Sports Eastbrook Panthers Indiana Wesleyan Wildcats Madison-Grant Argylls Marion Giants Mississinewa Indians Oak Hill Golden Eagles Taylor Trojans Wire Opinion Page Editorials Letters to Editor Submit a letter Place an ad Historical Archives Site searchSearch Site searchSearch Site searchSearch About Us Contact Us Subscribe e-Edition Historical Archives How Do I?Place a Classified AdSubmit a Letter to the EditorPurchase a Subscription Place a Classified Ad Submit a Letter to the Editor Purchase a Subscription Place a Classified Ad Submit a Letter to the Editor Purchase a Subscription Log In My AccountMy AccountDashboardProfileSaved ItemsSubscribeManage ServiceLog Out My AccountMy AccountDashboardProfileSaved ItemsSubscribeManage ServiceLog Out My Account Dashboard Profile Saved Items Subscribe Manage Service Log Out My AccountMy AccountDashboardProfileSaved ItemsSubscribeManage ServiceLog Out My Account Dashboard Profile Saved Items Subscribe Manage Service Log Out My Account Dashboard Profile Saved Items Subscribe Manage Service Log Out Subscribe Manage Service 83°SunnyMarion, IN(46953)TodayPartly cloudy. Low 63F. Winds SW at 10 to 15 mph..TonightPartly cloudy. Low 63F. Winds SW at 10 to 15 mph.Updated: June 11, 2025 @ 5:23 pmFull Forecast Marion, IN(46953)TodayPartly cloudy. Low 63F. Winds SW at 10 to 15 mph..TonightPartly cloudy. Low 63F. Winds SW at 10 to 15 mph.Updated: June 11, 2025 @ 5:23 pm Partly cloudy. Low 63F. Winds SW at 10 to 15 mph.. Partly cloudy. Low 63F. Winds SW at 10 to 15 mph. Updated: June 11, 2025 @ 5:23 pm Full Forecast Marion, IN(46953)TodayPartly cloudy. Low 63F. Winds SW at 10 to 15 mph..TonightPartly cloudy. Low 63F. Winds SW at 10 to 15 mph.Updated: June 11, 2025 @ 5:23 pm Partly cloudy. Low 63F. Winds SW at 10 to 15 mph.. Partly cloudy. Low 63F. Winds SW at 10 to 15 mph. Updated: June 11, 2025 @ 5:23 pm Partly cloudy. Low 63F. Winds SW at 10 to 15 mph.. Partly cloudy. Low 63F. Winds SW at 10 to 15 mph. Updated: June 11, 2025 @ 5:23 pm Full Forecast Facebook HomeAbout UsContact UsPromote Your EventHistorical ArchivesSubscribee-EditionA.I. Policy About Us Contact Us Promote Your Event Historical Archives Subscribe e-Edition A.I. Policy About Us Contact Us Promote Your Event Historical Archives Subscribe e-Edition A.I. Policy NewsLocal NewsBusinessCelebrationsLiveNational/World NewsIndiana News Local News Business Celebrations Live National/World News Indiana News Local News Business Celebrations Live National/World News Indiana News SportsLocal SportsEastbrook PanthersIndiana Wesleyan WildcatsMadison-Grant ArgyllsMarion GiantsMississinewa IndiansOak Hill Golden EaglesTaylor TrojansWire Local Sports Eastbrook Panthers Indiana Wesleyan Wildcats Madison-Grant Argylls Marion Giants Mississinewa Indians Oak Hill Golden Eagles Taylor Trojans Wire Local Sports Eastbrook Panthers Indiana Wesleyan Wildcats Madison-Grant Argylls Marion Giants Mississinewa Indians Oak Hill Golden Eagles Taylor Trojans Wire OpinionOpinion PageEditorialsLetters to EditorSubmit a letter Opinion Page Editorials Letters to Editor Submit a letter Opinion Page Editorials Letters to Editor Submit a letter Obituaries Pet Tributes ClassifiedsPlace an ad Place an ad Place an ad Jobs ArchivesHistorical Archives Historical Archives Historical Archives Public Notices e-Edition Contact Us Puzzles Comics Archives Home **Privacy Policy** Privacy Policy Last Updated: June 11, 2024 This Privacy Policy explains how your (“your”, “you”) personally identifiable information is collected and used by Paxton Media Group LLC and affiliates (“Company”, “we”, or “us”) on this website and any website controlled by Company that includes, displays, attaches, links to, or references this Privacy Policy, including, without limitation, all services, products, applications, content, features, and functionality available through this website (the “Site”). We are committed to maintaining the privacy and confidentiality of your personal information and complying with applicable data protection laws. The purpose of this Privacy Policy is to provide you with information regarding how we collect, use, process, store, disclose, and protect the information you provide when you use the Site. This Privacy Policy also describes the choices you can make about our use of your information, and how you may contact us if you have further questions about Company’s use of your information. This Privacy Policy applies only to information collected by our Company through utilization of the Site. PLEASE READ THIS PRIVACY POLICY CAREFULLY. IT CONTAINS IMPORTANT INFORMATION APPLICABLE TO YOU, TOGETHER WITH ANY ENTITY OR ORGANIZATION FOR WHICH YOU ACCESS OR USE THE SITE, REGARDING THE PRIVACY AND SECURITY OF INFORMATION COLLECTED, USED, OR DISCLOSED BY COMPANY.You understand and agree that, by visiting the Site, you are accepting, without modification, this Privacy Policy. If you disagree with any portion of this Privacy Policy, then your only option is to not use the Site. This Privacy Policy is incorporated into our Terms and Conditions. This Privacy Policy is subject to change from time to time by the Company and your continued use of the Site means you agree to, without modification, any changes or revisions. Should you object to any such modifications to this Privacy Policy or become dissatisfied with the Company’s Site in any way, your only option is to immediately discontinue use of those products. Otherwise, continuing to use the Site after the effective date means that you agree to be bound by the changes, without modification. When you visit the Site, the Company may collect and store personally identifiable information, such as your name, address, and e-mail address. The information that we collect and store about you depends on the page you visit and the services in which you elect to participate. We use this information to operate our services, improve the quality of our services, offer you opportunities we think will interest you, and better tailor the advertising you see from us to suit you. This information is not shared with anyone outside of the Company except as provided for in this Privacy Policy or as explained at the time the information is collected. More specifics on the information we collect and how we use it are outlined within this Privacy Policy below. How to Contact Us If you would like to discuss any concerns that you may have regarding this Privacy Policy, please contactprivacypolicy@paxtonmedia.com We may collect certain personally identifiable information (“Personal Information”) that you voluntarily provide to us when you interact with the Site, such as your name, email address, postal address, phone number, or other contact details. Personal Information is information that identifies, relates to, describes, can reasonably be associated with, or can reasonably be linked to a particular individual. We automatically collect Personal Information when you visit the Site. We may also collect Personal Information from other sources, as described below. We may collect Personal Information from you and any devices (including mobile devices) you use when you: use the Site, make a donation or purchase, apply for a grant, subscribe to a newsletter or other publications, contact Company via phone, email, postal mail, or other means, connect with Company’s social media pages, or respond to Company’s communications to you, such as surveys or requests for feedback. Please remember that any information that is disclosed in comments, forums, or other areas enabling users to submit comments (“Forums”) becomes public information, is not maintained or treated as confidential, and you should exercise caution when deciding to disclose your Personal Information. In addition, we may also collect Personal Information about you from third parties in connection with the Site, including from the following sources: Service providers (e.g., hosting providers, logistics providers, etc.) Data analytics service providers Email, chat, survey, feedback, and other communications service providers Customer service and shipping providers Social media platforms Promotional partners If we combine or associate information from other sources with Personal Information that we collect through the Site, we will treat the combined information as Personal Information in accordance with this Privacy Policy. Information We Collect We may collect the following categories of Personal Information from you, depending on your interactions with the Site and the choices you make, as further described in the chart below: Category Data Types Identifiers Name, email address, shipping postal address, billing postal address, work address, telephone number, and Internet Protocol (IP) address. Payment and Purchasing Information Name, billing and shipping address, payment information, and other financial data. Interactions Records of transactions and other information you post or otherwise submit to the Site, including emails or other communications you provide to us. Internet/ Electronic Network Activity Browser History Data about the webpages you visit, including without limitation web browser specifications, website visits before accessing the Site, and website visits after leaving the Site. Device, Connectivity, and Configuration Data Data about your device and nearby networks, including internet connection information, computer equipment information, regional and language settings. Geolocation Data Data about your device’s location, which is inferred from your internet connection data, your IP address, and your postal address, or which you may choose to allow us to access by granting the Site access to your location when prompted. Demographic Data Data about you such as your business or company information, professional or personal reference contact information, and other data reflecting your preferences for the Site. Third-Party Social Network Services If you choose to access, visit, and/or use any third-party social networking service(s) that may be integrated with the Site, we may receive your Personal Information and other information about you and your computer, mobile, or other device that you have made available to those social networking services, including information about your contacts through those services. Some social networking services will facilitate registration or enhance or personalize your experience on the Site. This includes if you “follow,” “like,” or link your social networking account to the Site. Your decision to use a social networking service in connection with the Site is voluntary. However, you should make sure you are comfortable with the information your third-party social networking services may make available by reviewing privacy policies of those providers and/or modifying your privacy settings directly with those networking services. Use of Information We generally process your information when we need to do so to fulfill a contractual obligation or where we or someone we work with needs to use your Personal Information for a reason related to their provision of services on our behalf. We only process Personal Information for such legitimate interests as further detailed in the chart below: Collection Type Description How We Use Information Collected Customer Service Information This may include any information that you choose to provide, whether by phone, email, mail, or chat, to our customer service representatives or other Company employees or Representatives (as defined below). To provide, maintain, operate, personalize, and improve the Site and services. To evaluate and improve the content of the Site. To respond to your questions and requests. To provide customer support. To allow you to participate in interactive features of the Site when you choose to do so. Payment and Purchasing Information We may collect such Personal Information if you make a purchase or provide financial information through the Site. The exact Personal Information collected will vary depending on the payment method but will include information such as: Name; Email address; Billing and shipping addresses; Postal code; Credit card information; Bank information; and Phone number. We may also collect information concerning the products purchased or other purchasing or consuming histories or tendencies. To process payments. To process your purchases. To provide you with the products and services you have requested or purchased. To respond to your questions and requests. To provide customer support. To work with our service providers who perform certain business functions or services on our behalf (i.e., our third-party payment processors). Demographic Data We may collect such Personal Information when you make a purchase, contact us, and respond to our communications to you. Demographic data may include data about: Your business or company information; Your professional or personal reference contact information; and Other data reflecting your preferences for the Site. To provide, maintain, operate, personalize, and improve the Site. To evaluate and improve the consent of the Site. To provide customer support. To monitor the usage of the Site. To gather analysis and assess trends and interests. Third-Party Data This may include both Personal Information and non-personally identifiable information from our partners, vendors, data brokers, or public sources. To provide, maintain, operate, personalize, and improve the Site. To monitor the usage of the Site. To gather analysis and assess trends and interests. To work with our service providers who perform certain business functions or services on our behalf. To provide you with advertising content in which we think you will be interested. As part of this customization, we may observe your behaviors on the Site or on other websites. Location Information We may collect general location information if you use features on the Site that provide location-based services. To provide you with location-based services. To monitor the usage of the Site. To gather analysis and assess trends and interests. To customize the Site to your preferences and location. Anonymized Information We may use anonymized and aggregated information that may be created or derived from your Personal Information or usage of the Site for purposes that include data analysis, improving the Site, advertising, and developing new features and functionality within the Site. To provide, maintain, personalize, and improve the Site. To monitor the usage of the Site. To prevent or investigate fraud. To gather analysis and assess trends and interests. To conduct aggregate or research analysis to enhance, protect, and make informed decisions on the Site. To detect, prevent, and address technical issues. To enforce agreements, terms, conditions, and policies. To help maintain the safety, security, and integrity of the Site and technology assets. Usage Information This can be Personal Information and non-personally identifiable information that may be collected about you when you are using the Site, and this may include: Information about your interactions with the Site, which includes the date and time of any information you enter into the Site and your interactions with other users of the Site and what content or features you interacted with. Technical data which may include URL information,cookie data, web beacons, web pixels, clickstream information collection, and other tracking technology information, your IP address, the types of devices you are using to access or connect to the Site, unique device IDs, device attributes, network connection type (e.g., Wi-Fi, 3G, LTE, Bluetooth) and provider, network and device performance, browser type, language, and operating system. Further details about the technical data that is processed by us can be found below. The Site uses cookies, unique identifiers, and similar technologies to collect information over time and across different websites when you use or visit the Site. We or our third-party partners use common tracking tools to collect information about the pages you view, the Site functions that you access, the buttons and icons you click, and to remember your login information and Site settings to make it easier and more efficient for you to use the Site, and to provide advertising content that we think may be of interest to you. We or our third-party partners may use invisiblepixels or beaconson the Site to count how many users access or use certain pages, features, or content. To improve our content and the products, services, materials, and other content we make available through the Site. To optimize the display of the Site on your device. To provide, maintain, personalize, and improve the Site. To provide customer support. To monitor the usage of the Site. To allow you to participate in interactive features of the Site when you choose to do so. To gather analysis and assess trends and interests. To enforce our agreements, terms, conditions, and policies. To detect, prevent, and address technical issues. To prevent or investigate fraud. To provide you with advertising content in which we think you will be interested. As part of this customization, we may observe your behaviors on the Site or on other websites. To help maintain the safety, security, and integrity of the Site and technology assets. To investigate complaint and potential violations of our policies. Cookies.Cookies are small data files that are downloaded onto your computer or mobile device when you use the Site, which are unique to your device. Cookies make it easier for you to use the Site by saving your preferences so that we can use these to improve your next and subsequent visits to the Site. Cookies help us learn which areas of the Site are useful and which areas need improvement. You can choose whether to accept cookies by changing the settings on your browser or device. Each browser has its own methods for doing this. For detailed instructions on how to disable, block or delete cookies in your browser, consult your browser's help files or visitHow to Manage Cookies. Please bear in mind that if you choose to disable this function, your experience with the Site may be impaired and some features may not work as they were intended. When we use cookies or other similar technologies, we may set the cookies ourselves or ask third parties to do so to help us. Please note that the Site is not set up to respond to Do Not Track (DNT) signals, but it does respond to browser cookies settings. You may opt-out from receiving personalized advertising from some third parties by visitinghere. Please note that these choices will not opt you out of receiving advertisements. You will continue to receive generic advertisements. Like many websites, we use analytics, including Google Analytics. You may find out more about how Google Analytics collects and processes data by visiting “How Google uses data when you use our partners’ platforms or apps” foundhere. Further, you can elect to directly opt out of Google Analytics using your information by using the opt-out browser add-on, which you can learn abouthere. Pixels, Web Beacons.This information may be collected and reported in the aggregate. We may use this information to improve our current Site offerings, develop new products or services, and target information to you that may be helpful and useful to you based upon your use of the Site. Disclosing Information We may disclose non-personally identifiable information to third parties at our discretion. In connection with the Site, we may disclose your Personal Information to certain third parties who we engage to help us run our business and perform services on or through the Site, including under the following circumstances: Service providers who assist us in operating the Site, conducting our business, or servicing you (for example, a web hosting company whose services we use to host the Site). Software and service providers we use to manage and process your information (for example, shipping and logistics partners). Corporate affiliates, including corporate parents, subsidiaries, other affiliated entities and associated entities, and customers and clients. Google Analytics, a service provided by Google, Inc., to gather information about how you and other users engage with the Site and to allow tracking technologies and remarketing services on the Site through the use of first party cookies and third-party cookies, to, among other things, analyze and track users’ use of the Site, determine the popularity of certain content and better understand online activity. For more information about Google Analytics, please visitwww.google.com/policies/privacy/partners. Business partners, including promotional partners who are helping us run a joint promotion or who provide a product or service in partnership or collaboration with us in participating regions. Third parties in the event of a merger, acquisition, sale of assets, joint venture, assignment, transfer, or other disposition of all or any portion of our business, assets, or stock (including in connection with any bankruptcy or similar proceedings). Other third parties that you expressly request or authorize use to disclose your Personal Information to. Additionally, we may disclose your Personal Information to third parties where required to do so by law, where it is necessary in connection with the Site or products, where it is necessary in response to valid requests from public authorities (e.g., a court or government agency), where necessary to protect our rights, privacy, safety, or property, and/or that of our affiliates, you, or others, where necessary to detect, prevent, or otherwise address fraud, security, or technical issues, or where we have a legitimate interest in doing so. Company does not disclose Personal Information to public and government authorizes absent a court order or other legally enforceable request. Behavioral Targeting From time to time, the Company or its business partners may use collected data to optimize our offers of products and services to you. If you desire not to participate in this effort, please contactprivacypolicy@paxtonmedia.comwith your request to opt out. Affiliated sites, linked sites and advertisements Links to Other Websites Our Company expects its partners, providers of content and services and advertisers to respect the privacy of its users. Be aware, however, that links to third party websites, including our partners, providers of content and services, advertisers and others accessible through the Site have their own privacy and data collection policies and practices. We have no control over the content and practices of these websites and are not responsible for their privacy policies. You should use common sense when you navigate the web and be aware of when you travel outside of the Site. In addition, you should carefully review the applicable privacy policies of each website you visit and each web service you use. State and Federal Privacy Rights In certain jurisdictions, you may have the right to receive: a) information identifying any third-party company(ies) to whom our Company may have disclosed Personal Information pertaining to you and your family for that company’s direct marketing purposes; b) a description of the categories of Personal Information disclosed; and c) other enumerated information. To obtain such information, please e-mail your request to privacypolicy@paxtonmedia.com. Revisions From time to time, and without notice, the Company may revise this Privacy Policy. We will post updates and changes to the Site and the date that this Privacy Policy were last revised is identified at the top of the page. Your continued use of the Site after we have made updates to this Privacy Policy is considered your acceptance of those updates. For clarity, all updates are effective immediately when posted. Contact Information If you have any questions or comments about this Privacy Policy, we may be reached at the following: Paxton Media Group, LLC 201 South 4thStreet Paducah, KY42003 privacypolicy@paxtonmedia.com U.S. Users Only The Site is intended solely for individuals located in the United States. By using the Site, you represent that you are located in the United States and you consent to the general use and disclosure of your Personal Information as described in this Privacy Policy. The Site is not intended for use by persons located within the European Economic Area (EEA). We do not request or accept Personal Information concerning or supplied by persons who are located within the EEA at the time they access the Site. If you have accessed the Site from within the EEA, you should immediately discontinue your use. If you have supplied Personal Information to us in violation of this provision, whether through the registration of new user accounts or otherwise, please contact us atprivacypolicy@paxtonmedia.com. Policy on Children’s Information The Site is not created for anyone under the age of 13 (“Children” or “Child”), and we do not knowingly collect Personal Information from anyone under the age of 13 unless it is provided by or with the affirmative consent of the parents/legal guardians of those minors. By using the Site, you represent that you are at least 13 years old. If you do not meet this age requirement, then you must not access or use the Site. If we become aware that any such information has been provided or submitted to us without parental consent, we will delete the information as soon as practicable. For more information about the Children’s Online Privacy Protection Act (“COPPA”), which applies to websites that direct their services to children under the age of thirteen (13), please visit the Federal Trade Commission’s website:https://www.ftc.gov/tips-advice/business-center/guidance/complying-coppa-frequently-asked-questions. **Chronicle-Tribune** To view our latest e-Edition click the image on the left. **Senior Health 2024** May 7, 2024 **Business Cards** Mar 27, 2024 **Real Estate Mar 2024** Mar 6, 2024 **Small Business Showcase 2024** Feb 21, 2024 Articles Images Videos Commented Madison-Grant removes book from library collection What made Mount Etna's latest eruption so rare A changing of the guard Allure Beauty Bar officially opens in Marion Oak Hill begins search for new Ag teacher Cristiano Ronaldo by the numbers as he auditions for the Club World Cup The Carolina Hurricanes enter the offseason aiming to punch through an Eastern final roadblock Response to federal library cuts 'We came, we learned, we conquered' 'I hope the people who vote in our county take note' Sorry, there are no recent results for popular commented articles. For the Record Final decision Swayzee, Ind. Post Office Vying for the crown Upcoming Juneteenth events 'You are the light of the world' Grant County Community Calendar Local Briefs Sweetser Lions Club presents C&M Circus News Sports Obituaries Local Events Opinion Multimedia Online Features Subscribe Submission Forms Classifieds Public Notices Place an Ad Promote Your Event Email Alerts Search Weather Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: **** Sorry, an error occurred. **** Already Subscribed! Cancel anytime **Sign Up** Account processing issue - the email address may already exist **You're all set!** Thank you. Your account has been registered, and you are now logged in. Check your email for details. **Log In** Invalid password or account does not exist **Reset Password** Submitting this form below will send a message to your email with a link to change your password. **Forgot Password** An email message containing instructions on how to reset your password has been sent to the email address listed on your account. **Email me a log in link** **Promotional Offers** No promotional rates found. **Purchase GiftPurchase Access** Secure & Encrypted Secure transaction.Secure transaction. Cancel anytime. **You're all set!** Thank you. Your gift purchase was successful!Your purchase was successful, and you are now logged in. A receipt was sent to your email. **An error occurred**"}