{"id": 440, "name": "Frankfurter Allgemeine Zeitung (FAZ)", "domain": "faz.net", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.faz.net/aktuell/feuilleton/medien-und-film/medienpolitik/studie-von-corint-media-google-schuldet-deutscher-presse-1-3-milliarden-euro-110530503.html", "title": "Studie Von Corint Media Google Schuldet Deutscher Presse 1 3 Milliarden Euro 110530503.html", "content": "Startseite FAZ+Das Beste von FAZ+ PolitikÖffnenUSA unter TrumpUkraineInlandAuslandPolitische BücherPRO EinspruchGeschichteBriefe an die Herausgeber USA unter Trump Ukraine Inland Ausland Politische Bücher PRO Einspruch Geschichte Briefe an die Herausgeber USA unter Trump Ukraine Inland Ausland Politische Bücher PRO Einspruch Geschichte Briefe an die Herausgeber WirtschaftÖffnenEuropakonferenzWas kostet die Welt?UnternehmenWohnenAuto & VerkehrKlima & NachhaltigkeitPRO DigitalwirtschaftPRO WeltwirtschaftArm und reichSchneller SchlauWirtschaftswissen Europakonferenz Was kostet die Welt? Unternehmen Wohnen Auto & Verkehr Klima & Nachhaltigkeit PRO Digitalwirtschaft PRO Weltwirtschaft Arm und reich Schneller Schlau Wirtschaftswissen Europakonferenz Was kostet die Welt? Unternehmen Wohnen Auto & Verkehr Klima & Nachhaltigkeit PRO Digitalwirtschaft PRO Weltwirtschaft Arm und reich Schneller Schlau Wirtschaftswissen FinanzenÖffnenPRO FinanzenFinanzmarktBörsen & MärkteMein DepotBörsenlexikon PRO Finanzen Finanzmarkt Börsen & Märkte Mein Depot Börsenlexikon PRO Finanzen Finanzmarkt Börsen & Märkte Mein Depot Börsenlexikon FeuilletonÖffnenDebattenBücherMedien und FilmMusik und BühneKunst und ArchitekturKunstmarktKolumnenTV-Programm Debatten Bücher Medien und Film Musik und Bühne Kunst und Architektur Kunstmarkt Kolumnen TV-Programm Debatten Bücher Medien und Film Musik und Bühne Kunst und Architektur Kunstmarkt Kolumnen TV-Programm Karriere & HochSchuleÖffnenBüro & CoHörsaalKlassenzimmerDie Karrierefrage Büro & Co Hörsaal Klassenzimmer Die Karrierefrage Büro & Co Hörsaal Klassenzimmer Die Karrierefrage SportÖffnenFußballFormel 1Mehr SportFrench OpenRhein-Main-SportSportpolitikSport-TippsSport LiveSport-Ergebnisse Fußball Formel 1 Mehr Sport French Open Rhein-Main-Sport Sportpolitik Sport-Tipps Sport Live Sport-Ergebnisse Fußball Formel 1 Mehr Sport French Open Rhein-Main-Sport Sportpolitik Sport-Tipps Sport Live Sport-Ergebnisse GesellschaftÖffnenEurovision Song ContestMenschenKriminalitätUnglückeGesundheitTiereSmalltalkJugend schreibt Eurovision Song Contest Menschen Kriminalität Unglücke Gesundheit Tiere Smalltalk Jugend schreibt Eurovision Song Contest Menschen Kriminalität Unglücke Gesundheit Tiere Smalltalk Jugend schreibt StilÖffnenEssen & TrinkenMode & DesignLeib & SeeleEltern & FamilieTrends & NischenQuarterly Essen & Trinken Mode & Design Leib & Seele Eltern & Familie Trends & Nischen Quarterly Essen & Trinken Mode & Design Leib & Seele Eltern & Familie Trends & Nischen Quarterly Rhein-MainÖffnenFrankfurtRegion und HessenWirtschaftKulturSportF.A.Z. Leser helfenVeranstaltungen Frankfurt Region und Hessen Wirtschaft Kultur Sport F.A.Z. Leser helfen Veranstaltungen Frankfurt Region und Hessen Wirtschaft Kultur Sport F.A.Z. Leser helfen Veranstaltungen Technik & MotorÖffnenMotorElektromobilitätTechnikDigitalEnergie Motor Elektromobilität Technik Digital Energie Motor Elektromobilität Technik Digital Energie WissenÖffnenMedizin & ErnährungKrebsmedizinWeltraumLeben & GeneErde & KlimaPhysik & MehrArchäologie & AltertumGeist & SozialesForschung & PolitikAb in die BotanikNetzrätsel Medizin & Ernährung Krebsmedizin Weltraum Leben & Gene Erde & Klima Physik & Mehr Archäologie & Altertum Geist & Soziales Forschung & Politik Ab in die Botanik Netzrätsel Medizin & Ernährung Krebsmedizin Weltraum Leben & Gene Erde & Klima Physik & Mehr Archäologie & Altertum Geist & Soziales Forschung & Politik Ab in die Botanik Netzrätsel ReiseÖffnenWetter Wetter Wetter Abo Daten & Visualisierung Video Fotografie Newsletter Podcasts Themen Ticker Agenturmeldungen Spiele F.A.Z.-Archiv E-Paper F.A.Z. QuarterlyInspirationen und Denkanstöße für die Welt von Morgen F.A.Z. MagazinDas Magazin zu Stil, Leben und Gesellschaft F.A.Z. MetropolWirtschaft in Rhein-Main F.A.Z. Produkte F.A.Z. AppAktuelle Nachrichten F.A.Z. Der Tag AppDas Wichtigste des Tages F.A.Z. Kiosk AppDie digitalen Ausgaben F.A.Z. PRO Digitalwirtschaft F.A.Z. PRO Weltwirtschaft F.A.Z. PRO Einspruch F.A.Z. PRO Finanzen F.A.Z.-Portal Kaufkompass Stellenmarkt Immobilienmarkt Legalbrains Bildungsmarkt Lebenswege FAZschule Mehr als Wissen Vorteilswelt Selection Automarkt Best Ager Feuilleton Medien und Film Medienpolitik Studie von Corint Media: Google schuldet deutscher Presse 1,3 Milliarden Euro **Studie von Corint Media: Google schuldet deutscher Presse 1,3 Milliarden Euro** **Studie von Corint Media: Google schuldet deutscher Presse 1,3 Milliarden Euro** **Studie von Corint Media:„Google schuldet deutschen Medien 1,3 Milliarden Euro“** Der Digitalkonzern Google weigert sich, für Medieninhalte Lizenzgebühren zu zahlen. Wie die zu berechnen sind, lässt sich schwer ermessen, weil Google Umsätze geheim hält. Die Verwertungsgesellschaft Corint Media hat gerechnet. Anhören Merken Teilen Verschenken Drucken Zur App Das nennen wir eine starke Aussage: Der amerikanische Suchmaschinen- und WerbekonzernGoogle, schreibt die Verwertungsgesellschaft Corint Media, schulde den deutschen Medien die Summe von rund 1,3 Milliarden Euro. Wie das, wo der Konzern doch seit Jahr und Tag behauptet, der Beitrag zur digitalen Informationswelt, den Google in Deutschland bei der Suche mit einem Marktanteil von knapp 92 Prozent beherrscht, sei unerheblich? Viel mehr noch: Die Medienhäuser könnten von Glück reden, dass ihre Inhalte von Google angezeigt werden, argumentiert der Digitalkonzern, der durch seine aufgeschalteten KI-Zusammenfassungen inzwischen sogar dafür sorgt, dass Medienbeiträge kaum noch aufgegriffen werden. Google hat sich – wie andere KI-Entwickler auch – das geballte Wissen von Millionen Urhebern einverleibt und spuckt es als vermeintliche Eigenleistung aus. **Bislang zahlt Google nur Peanuts** Die Leistung aber erbringen andere und diese werden um ihren Lohn betrogen. Das ist der Grundgedanke des in der EU aus dem Urheberrecht entwickelten Leistungsschutzgedankens, den die Verwertungsgesellschaft Corint Media unter ihrem früheren Geschäftsführer Markus Runde und seiner Nachfolgerin Christine Jury-Fischer kämpferisch und mit Ausdauer vertritt. 420 Millionen Euro an Lizenzgebühren verlangte die Corint Media für die von ihr vertretenen Medienhäuser als Lizenzgebühren von Google für ein Jahr. Der Konzern bot 3,2 Millionen. Weil Verhandlungen zu keiner Einigung führten, rief die Corint Media im Juli 2022 die Schiedsstelle des Deutschen Patent- und Markenamts (DPMA) an, auf deren Spruch die streitenden Parteien immer noch warten. Einstweilen zahlt Google der Corint Media 3,2 Millionen Euro pro Jahr und verweist darauf, dass es mit vielen Verlagen (darunter auch die F.A.Z.) Einzelverträge über Lizenzen geschlossen habe. Doch nun legt die Corint Media eine neue Rechnung vor. **Stichworte wie „Donald Trump Ukraine“ und „iPhone 16“** Diese beruht auf einer Studie der Verhaltensökonomen des Beratungsunternehmens Fehr Advice & Partners. Dieses hat 1240 repräsentativ ausgewählten Internetnutzern zwei Google-Suchen zur Verfügung gestellt – eine mit journalistischen Angeboten und eine ohne. Untersucht wurde nun das Klickverhalten der Studienteilnehmer, die sich mit Suchbegriffen beschäftigten, die laut „Google Trends“ besonders gefragt waren. Stichworte waren zum Beispiel „Donald Trump Ukraine“ oder auch „iPhone 16“. Danach wurden die Teilnehmer zu ihrem Suchverhalten befragt. 73 Prozent antworteten, sie bevorzugten eine Google-Suche mit journalistischen Inhalten. Fehlten diese, nähmen Nutzer die Suche als deutlich weniger vollständig (minus 66,7 Prozent), aktuell (minus 56,1), orientierend (minus 51,4), vertrauenswürdig (minus 50,6), qualitativ hochwertig (minus 46,9) und unabhängig (minus 40,4) wahr. Für eine Suche mit Medieninhalten, so Fehr Advice, seien Nutzer bereit, rund 24 Prozent mehr zu zahlen. Ohne journalistische Angebote bewerteten sie ihren Sucherfolg um 17,2 Prozent schlechter. Gäbe es die journalistisch aufbereiteten Informationen in der Suche nicht mehr, wollten die Nutzer vermehrt direkt auf die entsprechenden Seiten gehen (plus 48,5 Prozent). **Den US-Medien schuldet Google zehn bis zwölf Milliarden Dollar** 3,2 Milliarden Euro Umsatz mache Google im Zusammenhang mit journalistischen Inhalten. Bei einer „fairen Verteilung dieser Umsätze“, so Fehr Advice, müssten den Medienhäusern rund 1,3 Milliarden Euro für die Nutzung ihrer Inhalte zustehen. Die Untersuchung decke sich mit den Ergebnissen anderer Erhebungen. So sei der Wirtschaftsprofessor Matthew Elliott von der Universität Cambridge 2022 zu dem Resultat gelangt, dass Nachrichteninhalte Plattformen wie Google oder Facebook pro Jahr rund eine Milliarde Pfund an Einnahmen brächten. Das Beratungsunternehmen Brattle Group habe errechnet, dass Google US-Medien zehn bis zwölf Milliarden Dollar schulde. Für Deutschland ermittelte Fehr Advice mit Zahlen des Wirtschaftsverbands Interactive Advertising Bureau (IAB) einen jährlichen Umsatz reiner Suchmaschinenwerbung von rund acht Milliarden Euro. Hinzu kämen bei Google Umsätze durch die Vermittlung von Werbung auf Drittseiten, geschätzt auf etwa 1,2 Milliarden Euro in Deutschland pro Jahr. Mit dem Videodienst Youtube habe Google 2024 in Deutschland geschätzt rund 1,5 Milliarden Euro erwirtschaftet. Das ergebe summa summarum für Google 10,7 Milliarden Euro an Werbeeinnahmen in Deutschland jährlich. Der Wertbeitrag, den journalistische Medieninhalte leisteten, betrage rund zwölf Prozent der gesamten Werbeumsätze. **Die Schiedssstelle des Deutschen Patentamts muss entscheiden** Mit der Studie konterkariert die Corint Media die Behauptung von Google, journalistische Inhalte leisteten gar keinen Beitrag zum Umsatz der Digitalkonzerne. Google hatte Anfang dieses Jahres rund 2,6 Millionen Nutzern in neun Ländern – ungefragt – journalistische Angebote zehn Wochen lang nicht mehr angezeigt. Was aus dem Test, gegen den sich massiver Protest von Verlagen, Journalismusorganisationen und aus der Politik richtete, hervorging, ist unklar. In Frankreich wurde Google vor Gericht dazu gezwungen, den Test abzubrechen. Klar ist jedoch, was Google damit bezweckte und warum die Corint Media nun ihre Rechnung aufmacht: Die Schiedsstelle des Deutschen Patent- und Markenamts muss langsam entscheiden, nach drei Jahren wäre es an der Zeit. Man setze sich seit Jahren für eine „angemessene Beteiligung von Anbietern journalistischer Medien an den Erlösen der Digitalplattformen ein“, sagte die Corint-Media-Geschäftsführerin Christine Jury-Fischer. Dabei kämpfe man auch gegen die „vielfach beklagte Informationsasymmetrie: Nur die Plattformen haben alle Daten zu den Nutzungen von journalistischen Medieninhalten in ihren Ökosystemen, neutrale zertifizierte Messdienstleister haben hier keinen Zugang“. Die neue Studie von Fehr Advice belege „nun zweifelsfrei: Nutzer suchen auch in Google – für viele Menschen einer der Hauptzugangspunkte für Nachrichten – aktuelle, vertrauenswürdige und vollständige Informationen und verlassen die Plattform, wenn diese fehlen“. **„Ein massives Problem für die Finanzierung unserer Medienordnung“** Googles Wertschöpfung beruhe „maßgeblich auf journalistischen Inhalten. Dass die digitalen Plattformen diese mitnähmen, ohne die Inhalte-Anbieter „angemessen zu beteiligen“, stelle ein „massives Problem für die Finanzierung unserer Medienordnung dar. Hieraus müssten „dringend die richtigen Schlüsse für die Anpassung des gesetzlichen Rahmens gezogen werden – auch und vor allem mit Blick auf Herausforderungen durch generative Künstliche Intelligenz. Eine jahrelange Verschleppung der Zahlungen wie bei der Durchsetzung des Presseleistungsschutzrechts darf es hier nicht geben.“ PresseleistungsschutzrechtGoogle speist Corint Media mit 3,2 Millionen Euro ab FAZ+Verbandschef der freien Presse„Politik, wach auf!“ FAZ+Netzwerke auf Facebook3,8 Millionen Konten für Betrug und Propaganda „Journalistische Vielfalt“, ergänzt Ernst Fehr, Wirtschaftsprofessor an der Universität Zürich, der 2010 mit seinem Bruder Gerhard die Firma Fehr Advice gründete, sei „nicht nur wichtig für die individuelle Meinungsbildung, sondern auch für das Funktionieren unserer Demokratie.“ Deshalb sei es wichtig, „dass Plattformen wie Google journalistische Angebote ökonomisch fair entlohnen, weil sonst ein zen­trales Element der demokratischen Infrastruktur gefährdet wird“. Es gehe hier „nicht nur um wirtschaftliche Fairness, sondern um die Zukunft journalistischer Vielfalt und demokratischer Meinungsbildung“. Diese freilich setzt Google durch den Einsatz von KI, die auch mit journalistischen Inhalten gefüttert wurde, noch stärker unter Druck. Michael HanfeldVerantwortlicher Redakteur für das Ressort „Medien“ . Verantwortlicher Redakteur für das Ressort „Medien“ . Verantwortlicher Redakteur für das Ressort „Medien“ . Teilen Verschenken Merken Drucken Anhören Kurse und Finanzdaten zum Artikel: Google Inc.-Aktie Schlagworte: Deutschland Alle Themen Nachdem Google den KI-Modus eingeführt hat, suchen Marken und Medien in aller Welt hängeringend nach einer Strategie, ihre Inhalte in die Welt der Künstlichen Intelligenz zu bringen, um ihre Sichtbarkeit im Web zu erhalten. Unser Playbook zeigt den Weg. Das alte Internet stirbt – nicht langsam, sondern jetzt. Agenten übernehmen die Suche, und der Traffic auf den Websites geht in den Keller. Wer nicht erkannt wird, existiert nicht. Wir zeigen, was Inhalteanbieter jetzt tun können. Auf Netzplattformen finden sich rechtswidrige Inhalte in Massen. Was tun? Europas Digitalgesetz setzt „Trusted Flagger“ ein, die Hinweise geben. Josephine Ballon von der Organisation HateAid erklärt, warum es nicht um Zensur geht. Maybrit Illner Tatort Ferdinand von Schirach Julian Assange Anne Will New York Times Banksy Peter Handke Hart aber Fair GEZ Jan Böhmermann Michel Houellebecq Bushido Richard David Precht Claas Relotius Haruki Murakami Astrid Lindgren Lady Gaga Attila Hildmann Kinderwagen-Test Kühlbox-Test Saugroboter-Test Trinkflaschen-Test Inspirierende Biografien Fernstudiengänge 10 teuerste Städte Deutschlands Italienische Lieder Finanz-Services Wetter Spiele TV-Programm Veranstaltungen Kontakt Datenschutz Nutzungsbedingungen Cookie-Manager Werbefrei lesen Einwilligung widerrufen Utiq verwalten Mediadaten Über die F.A.Z. Abo kündigen Jobs bei der F.A.Z. Presse Redaktion Vertrauen Hilfe Impressum"}