{"id": 786, "name": "KSTP-TV", "domain": "kstp.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://kstp.com/kstp-news/top-news/health-care-providers-weigh-potential-impacts-of-minnesotacare-stripping-adult-undocumented-immigrants-of-coverage/", "title": "Health Care Providers Weigh Potential Impacts Of Minnesotacare Stripping Adult Undocumented Immigrants Of Coverage", "content": "Home Page Top Stories NewsLocal News5 InvestigatesNational & World NewsBusinessHealth & Medical NewsPolitical NewsEntertainment News SportsSports HomeMinnesota VikingsMinnesota TimberwolvesMinnesota WildMinnesota LynxMinnesota UnitedCollege SportsHigh School Sports Featured on 5Featured on 5 LinksSo MinnesotaCommunity EventsInside Your HealthContestsWhy We Give45TV WeatherSeven Day OutlookInteractive RadarSchool Alert & ClosingsWeather AlertsCurrent Conditions VideoKSTP Livestreaming ChannelDigital ExtrasABC News Live VideoAt Issue with Tom Hauser Traffic Twin Cities Live Minnesota Live Contact UsContact 5 Eyewitness NewsNewsletterNews TeamKSTP Mobile AppsSubmit a News TipSubmit Photos and VideosAdvertising & Marketing ServicesViewer FeedbackFrequently Asked QuestionsHubbard Broadcasting Stations KSTP TV Schedules Work With Us **Health care providers weigh potential impacts of adult undocumented immigrants losing coverage** **State budget heading to Governor’s desk, removes adult undocumented immigrants from MinnesotaCare** Undocumented adult immigrants will lose access to state health care in January 2026, after lawmakers voted to amend the policy to only cover children. RELATED:Special session: Undocumented immigrants to be voted off public health insurance, budget passes with hours to spare Republicans argue the change will reduce spending and put Minnesotans first. Democrats believe gutting the benefits will make it more expensive in the long run when immigrants are treated without insurance. The Department of Human Services said as of April 24, at least 15,000 undocumented immigrants, who are adults, are enrolled in MinnesotaCare. “The prospect of them being eligible for this insurance coverage was greeted with a lot of excitement because we now knew there’d be a source of reimbursement for their care,” Steve Knutson, Neighborhood Healthsource executive director, said. Neighborhood Healthsource treats at least 100 immigrants per month. They welcome uninsured patients, but the cost is at least $250 per visit. After December of this year, the clinic will go back to footing the bill. “So what it might mean for us is we have to consider closing a site, reducing our staff, or cutting our costs somehow,” Knutson said. “If you would have looked at this situation four or five years ago, we didn’t have this number of undocumented patients in our midst. Today, we do, and so that’s just more patients whose uncompensated care has to be absorbed in the system.”Knutson said uninsured undocumented immigrants will likely show up to emergency rooms for care in higher numbers, but the cost will still trickle down to Minnesotans. “It means we’ll pay higher prices for commercial patients who are insured commercially, and we’ll have to help subsidize that. That’s the way the system works, like it or not,” Knutson said. Undocumented adult immigrants who are already enrolled in MinnesotaCare will lose coverage after December of this year. 5 EYEWITNESS NEWS reached out to all the major hospital systems in Minnesota, asking how this will impact costs. We’re still waiting on a response. Home Page Top Stories News Sports Featured on 5 Weather Video Traffic Twin Cities Live Minnesota Live Contact Us KSTP TV Schedules Work With Us KSTP-TV FCC Public Inspection File KSTC-TV FCC Public Inspection File KSAX-TV FCC Public Inspection File KRWF-TV FCC Public Inspection File Additional Public Information KSTP-TV, KSTC-TV FCC Applications KSAX-TV FCC Applications KRWF-TV FCC Applications Terms of Use DMCA Notice Contest Rules Hubbard Television Group Privacy Policy About NEXTGEN TV Any person with disabilities who needs help accessing the content of the FCC Public File may contact KSTP via ouronline formor call 651-646-5555 This website is not intended for users located within the European Economic Area.©KSTP-TV, LLCA Hubbard Broadcasting Company KSTP Follow KSTP Follow **KSTP Follow** KSTP Follow **KSTP Follow** **KSTP Follow**"}