{"id": 978, "name": "Longview News-Journal", "domain": "news-journal.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.news-journal.com/users/profile/jgreenlnj", "title": "Www.news Journal.com", "content": "Activate Subscribe My Account Logout Login/Register Subscribe Customer Care My Account Contact us About us Local News Police Elections Education Business Public record Texas Nation & World ET Varsity College/Pro The Zone ETX View At Play Answer Line Calendar Food Health Homework Lifestyle Religion Volunteer Feast and Field Jobs Place an ad Business Directory Newspaper Ads Legal Notices Announcements Columnists Editorials Forum Letters to the Editor Bible Verse My Account e-Edition Newsletters 40 Under Forty Best of East Texas Facebook Twitter Contact Us e-Edition Archives Activate Subscribe My Account Logout Login/Register 68°RainLongview, TX(75601)TodayThunderstorms likely this evening. Then a chance of scattered thunderstorms overnight. Storms may contain strong gusty winds. Low 67F. Winds SE at 5 to 10 mph. Chance of rain 100%..TonightThunderstorms likely this evening. Then a chance of scattered thunderstorms overnight. Storms may contain strong gusty winds. Low 67F. Winds SE at 5 to 10 mph. Chance of rain 100%.Updated: June 11, 2025 @ 4:04 pmFull Forecast Longview, TX(75601)TodayThunderstorms likely this evening. Then a chance of scattered thunderstorms overnight. Storms may contain strong gusty winds. Low 67F. Winds SE at 5 to 10 mph. Chance of rain 100%..TonightThunderstorms likely this evening. Then a chance of scattered thunderstorms overnight. Storms may contain strong gusty winds. Low 67F. Winds SE at 5 to 10 mph. Chance of rain 100%.Updated: June 11, 2025 @ 4:04 pm Thunderstorms likely this evening. Then a chance of scattered thunderstorms overnight. Storms may contain strong gusty winds. Low 67F. Winds SE at 5 to 10 mph. Chance of rain 100%.. Thunderstorms likely this evening. Then a chance of scattered thunderstorms overnight. Storms may contain strong gusty winds. Low 67F. Winds SE at 5 to 10 mph. Chance of rain 100%. Updated: June 11, 2025 @ 4:04 pm Full Forecast Longview, TX(75601)TodayThunderstorms likely this evening. Then a chance of scattered thunderstorms overnight. Storms may contain strong gusty winds. Low 67F. Winds SE at 5 to 10 mph. Chance of rain 100%..TonightThunderstorms likely this evening. Then a chance of scattered thunderstorms overnight. Storms may contain strong gusty winds. Low 67F. Winds SE at 5 to 10 mph. Chance of rain 100%.Updated: June 11, 2025 @ 4:04 pm Thunderstorms likely this evening. Then a chance of scattered thunderstorms overnight. Storms may contain strong gusty winds. Low 67F. Winds SE at 5 to 10 mph. Chance of rain 100%.. Thunderstorms likely this evening. Then a chance of scattered thunderstorms overnight. Storms may contain strong gusty winds. Low 67F. Winds SE at 5 to 10 mph. Chance of rain 100%. Updated: June 11, 2025 @ 4:04 pm Thunderstorms likely this evening. Then a chance of scattered thunderstorms overnight. Storms may contain strong gusty winds. Low 67F. Winds SE at 5 to 10 mph. Chance of rain 100%.. Thunderstorms likely this evening. Then a chance of scattered thunderstorms overnight. Storms may contain strong gusty winds. Low 67F. Winds SE at 5 to 10 mph. Chance of rain 100%. Updated: June 11, 2025 @ 4:04 pm Full Forecast Site searchSearch Site searchSearch Site searchSearch Activate Subscribe My Account Logout Login/Register Sign Up for Newsletters! HomeSubscribeCustomer CareMy AccountContact usAbout us Subscribe Customer Care My Account Contact us About us Subscribe Customer Care My Account Contact us About us NewsLocal NewsPoliceElectionsEducationBusinessPublic recordTexasNation & World Local News Police Elections Education Business Public record Texas Nation & World Local News Police Elections Education Business Public record Texas Nation & World SportsET VarsityCollege/ProThe Zone ET Varsity College/Pro The Zone ET Varsity College/Pro The Zone FeaturesETX ViewAt PlayAnswer LineCalendarFoodHealthHomeworkLifestyleReligionVolunteerFeast and Field ETX View At Play Answer Line Calendar Food Health Homework Lifestyle Religion Volunteer Feast and Field ETX View At Play Answer Line Calendar Food Health Homework Lifestyle Religion Volunteer Feast and Field Obits Classifieds/AdvertisingJobsPlace an adBusiness DirectoryNewspaper AdsLegal Notices Jobs Place an ad Business Directory Newspaper Ads Legal Notices Jobs Place an ad Business Directory Newspaper Ads Legal Notices EventsAnnouncementsanniversariesbirthdaysbirthsengagementssearchweddings Announcementsanniversariesbirthdaysbirthsengagementssearchweddings anniversaries birthdays births engagements search weddings Announcementsanniversariesbirthdaysbirthsengagementssearchweddings anniversaries birthdays births engagements search weddings anniversaries birthdays births engagements search weddings OpinionColumnistsEditorialsForumLetters to the EditorBible Verse Columnists Editorials Forum Letters to the Editor Bible Verse Columnists Editorials Forum Letters to the Editor Bible Verse SubscriberMy Accounte-EditionArchivesNewsletters My Account e-EditionArchives Archives Newsletters My Account e-EditionArchives Archives Archives Newsletters Contests40 Under FortyBest of East Texas 40 Under Forty Best of East Texas 40 Under Forty Best of East Texas ETX View **Weather Alert** **Flood Watch until THU 7:00 PM CDT** **Flood Watch until THU 7:00 PM CDT** **Flash Flood Warning until WED 5:00 PM CDT** **Flash Flood Warning until WED 5:00 PM CDT** **River Flood Warning from WED 8:09 PM CDT until SUN 4:00 AM CDT** **River Flood Warning from WED 8:09 PM CDT until SUN 4:00 AM CDT** **Jordan Green** Author email Author RSS {{description}} Email notifications are only sent once a day, and only if there are new matching items. **About** Howdy! I'm Jordan Green, a Report for America corps member covering underserved communities in East Texas for the Longview News-Journal. I'm a native Okie and have been a newsman since 2017. Email me at jordan.green@news-journal.com or call me at 903-237-7743. Posts **Smashing success: Longtime firefighter training tower at Longview's Stamper Park demolished** 10 hrs ago Mister Rogers would call it a beautiful day in the neighborhood: The city of Longview's longtime firefighter training tower near Stamper Park … **PHOTOS: First day of Hot Air Balloon Championship flights** Jun 10, 2025 Hot air balloons soared through the skies Tuesday morning above Longview during the first day of the Balloon Federation of America's U.S. Nati… **'It was beautiful': Spectators in Longview watch week's first hot air balloon competition flights** UpdatedJun 10, 2025 Longview residents Kelsey Skinner and Megan Reynolds stared at the sky Tuesday morning, watching hot air balloons set sail over the northern p… **'People love to laugh': Longtime Louisiana rodeo clown inducted into Gladewater hall of fame** Updated52 mins ago Rick Young, who had a 70-year career as a rodeo clown and bullfighter, was inducted into the Stockyards Steakhouse Hall of Fame for entertainers. **Heartworm cases in dogs could be rising in East Texas; animal shelter urges prevention** Updated52 mins ago Cases of heartworms in dogs could be on the rise in the Longview area, and the leader of the city’s animal shelter hopes pet owners will take … **How will One Big Beautiful Bill Act affect Medicaid and SNAP? It depends who you ask** Updated5 hrs ago Republicans representing Texas in Congress say proposed reforms to Medicaid and the Supplemental Nutrition Assistance Program are necessary to… **'We want them to be better': Longview Christian counseling service offers low-cost care, seeks to grow** Updated5 hrs ago As the demand for mental healthcare increases, the staffers and volunteers at the nonprofit Pathstones Counseling Center in Longview hope support for the organization will, too. **Great Texas Balloon Race soars back into Longview with classic activities, music and more** UpdatedJun 6, 2025 High-flying fun will soon return to Longview during the annual Great Texas Balloon Race. Hot air balloons will sail through the skies above the city as part of the U.S. Nationals Hot Air Balloon Championship, which is held in conjunction with GTBR and is set 6:30 a.m. June 9 through 15. **East Texas native eager to help students as new Gregg County 4-H, youth development leader** UpdatedJun 9, 2025 After spending some time in community outreach, East Texas native Dameyun Thompson is returning to his roots in education. And as a 4-H and youth development agent in Gregg County, he’ll have a lot of roots to work with. Home News Sports Features Announcements Obituaries Opinion Multimedia Online Features Elections Local Events Promote Your Event Submission Forms Advertise Classifieds Place an Ad Business Directory Calendar Email Alerts Search Weather Contact Us Subscribe Facebook Twitter Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}