{"id": 1672, "name": "We are Anonymous/AnonHQ", "domain": "anonhq.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "very-low", "questionable": null, "url": "https://anonhq.com/the-anonymous-group-of-international-hackers-has-gained-access-to-over-a-million-emails-of-alet-a-russian-customs-broker-that-deals-with-the-exporters-of-petroleum-products-coal-and-liquefied-gas/#respond", "title": "The Anonymous Group Of International Hackers Has Gained Access To Over A Million Emails Of Alet A Russian Customs Broker That Deals With The Exporters Of Petroleum Products Coal And Liquefied Gas", "content": "Home Support us Be Anonymous TWITTER TELEGRAM Ukraine conflict Home Support us Be Anonymous TWITTER TELEGRAM Ukraine conflict Activism Anonymous **Anonymous Hacks Correspondence of Russian Coal, Oil, Gas Exporters** The Cyberwar continues. The Anonymous group of international hackers has gained access to over a million emails of ALET, a Russian customs broker that deals with the exporters of petroleum products, coal, and liquefied gas. That’s according to atweetreleased by the group. https://twitter.com/YourAnonTV/status/1518525076286676993 “#Anonymous hacked nearly 1.1 million emails (1.1 TB ) from ALET, a Russian customs broker for companies in the fuel and energy industries, handling exports and customs declarations for coal, crude oil, liquefied gases and petroleum products,” the tweet reads. ALET has worked with over 400 companies since 2011 to file over 119,000 customs declarations and has recommendations from Gazprom, Gazprom Neft and Bashneft. Approximately 75% of ALET’s business comes from oil products, 10% from oil, and 9% from hydrocarbon products. Earlier, Anonymous hacked 645,000 emails of Enerpred, Russia’s largest producer of hydraulic equipment, specializing in energy, oil and chemical, coal, gas, and construction industries. **Strong Evidence Suggests Ghislaine Maxwell Secretly Ran One Of Most Powerful Reddit Accounts in History** **Forget The Pandemic, This Could Kill 90% Of US Population** **Anonymous: Bill Clinton Pedophile Sex Tape Filmed By Jeffrey Epstein!** **LEAVE A REPLYCancel reply** Save my name, email, and website in this browser for the next time I comment. Downloads The Mask Be Anonymous Jobs ActivismAnonymous Anonymous Anonymous Baltimore Controversial Corruption Crime Cryptocurrency Cyber SecurityHacktivism Hacktivism Hacktivism Environment Featured Finance HealthCoronavirus Coronavirus Coronavirus History Injustice Pedophilia Podcast Police PoliticsEconomyIntelligence Economy Intelligence Economy Intelligence Rights scienceArtificial Intelligence Artificial Intelligence Artificial Intelligence Surveillance Technology Teh Weekly News Ukraine conflict Uncategorized WorldMedia Media Media Privacy Policy"}