{"id": 849, "name": "Little Green Footballs", "domain": "littlegreenfootballs.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://littlegreenfootballs.com/article/54675_Colbert-_Trumps_Birthday_Parade-_Missiles_And_Mules_|_The_War_Against_Los_Angeles_Already_Cost_$134_Million", "title": "54675_colbert _trumps_birthday_parade _missiles_and_mules_|_the_war_against_los_angeles_already_cost_$134_million", "content": "Home LGF PagesThis button leads to the main index of LGF Pages, our user-submitted articles. You can post your own LGF Pages simply by registering a free account with us. This button leads to the main index of LGF Pages, our user-submitted articles. You can post your own LGF Pages simply by registering a free account with us. This button leads to the main index of LGF Pages, our user-submitted articles. You can post your own LGF Pages simply by registering a free account with us. CategoriesArtsBlogosphereBooksBusinessCrimeCultureEducationEntertainmentEnvironmentGreat DealsHealthHistoryHumorImagesImmigrationInternetLawLGFLifestyleMediaMiddle EastMoonbatsMusicOpenOpinionPoliticsPollPrivateReligionScienceSportsTechnologyTerrorismTravelUS NewsVideoWeirdWingnutsWorldWTF Daily Monthly Bluesky Mastodon FunThe Meme MachineThe Trump Bumper Sticker GeneratorLGF Playlist Search About Contact Another Brilliant New Track From Antoine Boyer & Yeore Kim: \"Sous le Ciel de Paris\" (244) Front Page **Colbert: Trump’s Birthday Parade: Missiles And Mules | The War Against Los Angeles Already Cost $134 Million** President Trump claims he’s not throwing himself a birthday parade, he sent Marines to Los Angeles in a major escalation of his attack on the city’s residents, and taxpayers are already on the hook for $134 million to cover the military deployment. down 1 up Jump to top Help support Little Green Footballs! Subscribe now forad-free access!Register and sign into a free LGF account before subscribing, and your ad-free access will be automatically enabled. Loading... Loading... Loading... Loading... Show All Entries Referrers Playlist Unshorten a URL LGF on Bluesky LGF Articles Feed Donate with PayPal © 2025 Little Green FootballsAll Rights ReservedTerms of Use/Privacy Policy"}