{"id": 1420, "name": "Bainbridge Post-Searchlight", "domain": "thepostsearchlight.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://thepostsearchlight.com/2025/05/29/theft-of-bainbridge-city-vehicle-leads-to-foot-pursuit-and-dead-dog-suspect-apprehended/", "title": "Theft Of Bainbridge City Vehicle Leads To Foot Pursuit And Dead Dog Suspect Apprehended", "content": "Home E-Edition News Sports Opinion Obituaries Records Contests Bainbridge Living Special Editions Services Public Notices Home E-Edition News Sports Opinion Obituaries Records Contests Bainbridge Living Special Editions Services Public Notices **Theft of Bainbridge city vehicle leads to foot pursuit and dead dog; suspect apprehended** Published 5:00 pm Thursday, May 29, 2025 ByEthan Reddish UPDATE: Delgado is facing additional charges, including fleeing/attempting to elude a police officer, reckless driving, possession of a firearm or knife while trying to commit crimes, leaving the scene of an accident, obstruction of an officer, and a vicious dog not transferred/sold unless relinquished to a government facility. Both Bainbridge Public Safety and the Decatur County Sheriff’s Office responded to a report of a stolen city vehicle on Thursday afternoon, that ultimately led to a foot pursuit down Highway 84 and into the neighboring community. According to Bainbridge Public Safety Director Frank Green, Alejandro Delgado stole the city vehicle after a brief struggle with the city employee, who attempted to stop the theft. Delgado fled in the vehicle, taking his two dogs along for the ride. State Troopers were able to stop Delgado on the bypass, who then fled on foot down the side of Highway 84, before running into a nearby residential area. **Email newsletter signup** According to Green, one of Delgado’s dogs attacked and bit one of the state officers during the chase, and was subsequently shot and killed. Delgado fled into a garage, where he was caught and apprehended by officers. He has been booked and is currently charged with theft by taking, interference with government property, and robbery. This is an ongoing investigation, the Post-Searchlight will provide updates as they become available. **You Might Like** **Bainbridge Family YMCA renovates pool** **Bainbridge Family YMCA renovates pool** **Climax mayor Kelly resigns, following arrest for child sex crime charges** **Climax mayor Kelly resigns, following arrest for child sex crime charges** **Decatur County Commissioners Meeting Agenda, June 10, 2025** **Decatur County Commissioners Meeting Agenda, June 10, 2025** **The Refinery’s Legacy Continues with New Ownership** **The Refinery’s Legacy Continues with New Ownership** Home News Sports Opinion Obituaries Business Church News Schools Military News Police/Courts Small Business E-Edition Commercial Printing Subscribe Advertise with Us Classified Advertising News Tip Form Birth Announcement Form Engagement Form Wedding Form Submit an Event Letter to the Editor Form Public Notices About Us Our Staff Contact Us"}