{"id": 16, "name": "604 Now", "domain": "604now.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://604now.com/vancouvers-downtown-costco-will-no-longer-allow-non-members-access-to-their-food-court/", "title": "Vancouvers Downtown Costco Will No Longer Allow Non Members Access To Their Food Court", "content": "**Where is your 604?** Vancouver Burnaby Richmond Surrey Langley White Rock North Vancouver Coquitlam Abbotsford Victoria **Vancouver** Based in the west coast, Vancouver is a metropolitan city that’s geographically blessed with a temperate climate. Whether you’re exploring city centre, the west side or the east side, you can be sure to have the North shore mountains present as the picturesque backdrop to your adventures. As a multicultural city, Vancouverites are known for being a laidback, easy-going bunch. Just don’t mention the Canucks. Events Food Things To Do **Burnaby** Neighbouring the borders of East Vancouver, Burnaby is undergoing a modern transformation that’s driving a younger crowd into the city with highrise residential towers being built at a pace that exceeds even that of Vancouver’s. Burnaby occupies a central area that makes it a convenient drive to get to Vancouver, New Westminster or Richmond. It’s close enough to feel like you’re living in Vancouver without facing any of the realities about its housing market. Events Food Things To Do **Richmond** The island city built on top of the Fraser River delta. Contrary to what the locals say, Richmond is not a city that will slide into the ocean when the Big One hits. What may be a more relevant epicentre to consider about this peaceful city is its status as the latter-day predecessor to Vancouver’s historical Chinatown. Seriously, you can’t go wrong with the dim sum here. Events Food Things To Do **Surrey** Not simply the fastest growing city in Metro Vancouver but also in the country, Surrey is a city that ironically gets a bad rap often from Vancouver proper, a city known for its homeless problem. The true Surrey is a story of economic revitalization and a green future. With over 600 parks and greenbelts, it goes without saying. Events Food Things To Do **Langley** The birthplace of British Columbia. Langley’s past stretches back almost 200 hundred years ago, which if you know anything about Canadian history, is practically ancient times. Langley is a pastoral scene with endless berry fields, fishing trips and pony shows to partake in. It’s not the ticket for clubs but there are a ton of wineries. Events Food Things To Do **White Rock** White Rock is a beloved shorefront city. It’s a coastal community that boasts a beach, Canada's longest pier, tons of hidden gems and most important of all: a giant white rock the area was named after. Events Food Things To Do **North Vancouver** North Vancouver is known for hiking and skiing trails in the forested North Shore Mountains, including Grouse Mountain, whose Skyride cable car offers sweeping city views. High suspension bridges straddle popular Capilano Canyon and tranquil Lynn Canyon. Near the Seabus ferry terminal, Lonsdale Quay Market is home to fashion shops and a mix of food vendors serving fish and chips, souvlaki and Asian dishes. Events Food Things To Do **Coquitlam** The Tri-Cities are made up of five communities that include suburban cities such as Port Moody, Coquitlam and Port Coquitlam. With the Evergreen extension of the Millennium Line underway, it’ll be even more straightforward to visit these gorgeous city towns that offer diverse vistas. Burrard Inlet? Eagle Mountain? The waterfront view? It’s all there and more. Events Food Things To Do **Abbotsford** Located in the heart of the Fraser Valley, Abbotsford is the largest municipality that the region has to offer. Adjacent to Vancouver, Abbotsford is the air and road gateway to experiences such as skydiving to hot springs and waterslides. The self-proclaimed “city in the country” is known for sports, religion and its agricultural bounty. Events Food Things To Do **Victoria** Victoria, capital of British Columbia, sits on the southern end of Vancouver Island. With abundant parkland, it’s known for outdoor activities. Events Food Things To Do **Where is your 604?** VancouverExploreVancouverBased in the west coast, Vancouver is a metropolitan city that’s geographically blessed with a temperate climate. Whether you’re exploring city centre, the west side or the east side, you can be sure to have the North shore mountains present as the picturesque backdrop to your adventures. As a multicultural city, Vancouverites are known for being a laidback, easy-going bunch. Just don’t mention the Canucks.EventsRestaurantsThings To DoView More **Vancouver** Based in the west coast, Vancouver is a metropolitan city that’s geographically blessed with a temperate climate. Whether you’re exploring city centre, the west side or the east side, you can be sure to have the North shore mountains present as the picturesque backdrop to your adventures. As a multicultural city, Vancouverites are known for being a laidback, easy-going bunch. Just don’t mention the Canucks. Events Restaurants Things To Do **Vancouver** Based in the west coast, Vancouver is a metropolitan city that’s geographically blessed with a temperate climate. Whether you’re exploring city centre, the west side or the east side, you can be sure to have the North shore mountains present as the picturesque backdrop to your adventures. As a multicultural city, Vancouverites are known for being a laidback, easy-going bunch. Just don’t mention the Canucks. Events Restaurants Things To Do BurnabyExploreBurnabyNeighbouring the borders of East Vancouver, Burnaby is undergoing a modern transformation that’s driving a younger crowd into the city with highrise residential towers being built at a pace that exceeds even that of Vancouver’s. Burnaby occupies a central area that makes it a convenient drive to get to Vancouver, New Westminster or Richmond. It’s close enough to feel like you’re living in Vancouver without facing any of the realities about its housing market.EventsRestaurantsThings To DoView More **Burnaby** Neighbouring the borders of East Vancouver, Burnaby is undergoing a modern transformation that’s driving a younger crowd into the city with highrise residential towers being built at a pace that exceeds even that of Vancouver’s. Burnaby occupies a central area that makes it a convenient drive to get to Vancouver, New Westminster or Richmond. It’s close enough to feel like you’re living in Vancouver without facing any of the realities about its housing market. Events Restaurants Things To Do **Burnaby** Neighbouring the borders of East Vancouver, Burnaby is undergoing a modern transformation that’s driving a younger crowd into the city with highrise residential towers being built at a pace that exceeds even that of Vancouver’s. Burnaby occupies a central area that makes it a convenient drive to get to Vancouver, New Westminster or Richmond. It’s close enough to feel like you’re living in Vancouver without facing any of the realities about its housing market. Events Restaurants Things To Do RichmondExploreRichmondThe island city built on top of the Fraser River delta. Contrary to what the locals say, Richmond is not a city that will slide into the ocean when the Big One hits. What may be a more relevant epicentre to consider about this peaceful city is its status as the latter-day predecessor to Vancouver’s historical Chinatown. Seriously, you can’t go wrong with the dim sum here.EventsRestaurantsThings To DoView More **Richmond** The island city built on top of the Fraser River delta. Contrary to what the locals say, Richmond is not a city that will slide into the ocean when the Big One hits. What may be a more relevant epicentre to consider about this peaceful city is its status as the latter-day predecessor to Vancouver’s historical Chinatown. Seriously, you can’t go wrong with the dim sum here. Events Restaurants Things To Do **Richmond** The island city built on top of the Fraser River delta. Contrary to what the locals say, Richmond is not a city that will slide into the ocean when the Big One hits. What may be a more relevant epicentre to consider about this peaceful city is its status as the latter-day predecessor to Vancouver’s historical Chinatown. Seriously, you can’t go wrong with the dim sum here. Events Restaurants Things To Do SurreyExploreSurreyNot simply the fastest growing city in Metro Vancouver but also in the country, Surrey is a city that ironically gets a bad rap often from Vancouver proper, a city known for its homeless problem. The true Surrey is a story of economic revitalization and a green future. With over 600 parks and greenbelts, it goes without saying.EventsRestaurantsThings To DoView More **Surrey** Not simply the fastest growing city in Metro Vancouver but also in the country, Surrey is a city that ironically gets a bad rap often from Vancouver proper, a city known for its homeless problem. The true Surrey is a story of economic revitalization and a green future. With over 600 parks and greenbelts, it goes without saying. Events Restaurants Things To Do **Surrey** Not simply the fastest growing city in Metro Vancouver but also in the country, Surrey is a city that ironically gets a bad rap often from Vancouver proper, a city known for its homeless problem. The true Surrey is a story of economic revitalization and a green future. With over 600 parks and greenbelts, it goes without saying. Events Restaurants Things To Do LangleyExploreLangleyThe birthplace of British Columbia. Langley’s past stretches back almost 200 hundred years ago, which if you know anything about Canadian history, is practically ancient times. Langley is a pastoral scene with endless berry fields, fishing trips and pony shows to partake in. It’s not the ticket for clubs but there are a ton of wineries.EventsRestaurantsThings To DoView More **Langley** The birthplace of British Columbia. Langley’s past stretches back almost 200 hundred years ago, which if you know anything about Canadian history, is practically ancient times. Langley is a pastoral scene with endless berry fields, fishing trips and pony shows to partake in. It’s not the ticket for clubs but there are a ton of wineries. Events Restaurants Things To Do **Langley** The birthplace of British Columbia. Langley’s past stretches back almost 200 hundred years ago, which if you know anything about Canadian history, is practically ancient times. Langley is a pastoral scene with endless berry fields, fishing trips and pony shows to partake in. It’s not the ticket for clubs but there are a ton of wineries. Events Restaurants Things To Do White RockExploreWhite RockWhite Rock is a beloved shorefront city. It’s a coastal community that boasts a beach, Canada's longest pier, tons of hidden gems and most important of all: a giant white rock the area was named after.EventsRestaurantsThings To DoView More **White Rock** White Rock is a beloved shorefront city. It’s a coastal community that boasts a beach, Canada's longest pier, tons of hidden gems and most important of all: a giant white rock the area was named after. Events Restaurants Things To Do **White Rock** White Rock is a beloved shorefront city. It’s a coastal community that boasts a beach, Canada's longest pier, tons of hidden gems and most important of all: a giant white rock the area was named after. Events Restaurants Things To Do North VancouverExploreNorth VancouverNorth Vancouver is known for hiking and skiing trails in the forested North Shore Mountains, including Grouse Mountain, whose Skyride cable car offers sweeping city views. High suspension bridges straddle popular Capilano Canyon and tranquil Lynn Canyon. Near the Seabus ferry terminal, Lonsdale Quay Market is home to fashion shops and a mix of food vendors serving fish and chips, souvlaki and Asian dishes.EventsRestaurantsThings To DoView More **North Vancouver** North Vancouver is known for hiking and skiing trails in the forested North Shore Mountains, including Grouse Mountain, whose Skyride cable car offers sweeping city views. High suspension bridges straddle popular Capilano Canyon and tranquil Lynn Canyon. Near the Seabus ferry terminal, Lonsdale Quay Market is home to fashion shops and a mix of food vendors serving fish and chips, souvlaki and Asian dishes. Events Restaurants Things To Do **North Vancouver** North Vancouver is known for hiking and skiing trails in the forested North Shore Mountains, including Grouse Mountain, whose Skyride cable car offers sweeping city views. High suspension bridges straddle popular Capilano Canyon and tranquil Lynn Canyon. Near the Seabus ferry terminal, Lonsdale Quay Market is home to fashion shops and a mix of food vendors serving fish and chips, souvlaki and Asian dishes. Events Restaurants Things To Do CoquitlamExploreCoquitlamThe Tri-Cities are made up of five communities that include suburban cities such as Port Moody, Coquitlam and Port Coquitlam. With the Evergreen extension of the Millennium Line underway, it’ll be even more straightforward to visit these gorgeous city towns that offer diverse vistas. Burrard Inlet? Eagle Mountain? The waterfront view? It’s all there and more.EventsRestaurantsThings To DoView More **Coquitlam** The Tri-Cities are made up of five communities that include suburban cities such as Port Moody, Coquitlam and Port Coquitlam. With the Evergreen extension of the Millennium Line underway, it’ll be even more straightforward to visit these gorgeous city towns that offer diverse vistas. Burrard Inlet? Eagle Mountain? The waterfront view? It’s all there and more. Events Restaurants Things To Do **Coquitlam** The Tri-Cities are made up of five communities that include suburban cities such as Port Moody, Coquitlam and Port Coquitlam. With the Evergreen extension of the Millennium Line underway, it’ll be even more straightforward to visit these gorgeous city towns that offer diverse vistas. Burrard Inlet? Eagle Mountain? The waterfront view? It’s all there and more. Events Restaurants Things To Do AbbotsfordExploreAbbotsfordLocated in the heart of the Fraser Valley, Abbotsford is the largest municipality that the region has to offer. Adjacent to Vancouver, Abbotsford is the air and road gateway to experiences such as skydiving to hot springs and waterslides. The self-proclaimed “city in the country” is known for sports, religion and its agricultural bounty.EventsRestaurantsThings To DoView More **Abbotsford** Located in the heart of the Fraser Valley, Abbotsford is the largest municipality that the region has to offer. Adjacent to Vancouver, Abbotsford is the air and road gateway to experiences such as skydiving to hot springs and waterslides. The self-proclaimed “city in the country” is known for sports, religion and its agricultural bounty. Events Restaurants Things To Do **Abbotsford** Located in the heart of the Fraser Valley, Abbotsford is the largest municipality that the region has to offer. Adjacent to Vancouver, Abbotsford is the air and road gateway to experiences such as skydiving to hot springs and waterslides. The self-proclaimed “city in the country” is known for sports, religion and its agricultural bounty. Events Restaurants Things To Do VictoriaExploreVictoriaVictoria, capital of British Columbia, sits on the southern end of Vancouver Island. With abundant parkland, it’s known for outdoor activities.EventsRestaurantsThings To DoView More **Victoria** Victoria, capital of British Columbia, sits on the southern end of Vancouver Island. With abundant parkland, it’s known for outdoor activities. Events Restaurants Things To Do **Victoria** Victoria, capital of British Columbia, sits on the southern end of Vancouver Island. With abundant parkland, it’s known for outdoor activities. Events Restaurants Things To Do **Things to do** Kid FriendlyYou Can Watch These Movies At Cineplex For $3.99 This June Date Night IdeasFREE Outdoor Movies Lineup At Stanley Park Has Been Revealed Kid FriendlyLangley's Amusement Park Inspired Playground has a Massive Zipline Swing **Explore** Events Calendar Attractions Date Night Ideas Night Life Kid Friendly **Food** Mr. Japanese Curry Might Serve The Most Authentic Japanese Curry In All Of Vancouver BoozeHere’s All The Events Happening At Vancouver’s Craft Beer and Wing Festival 2025 Vancouver's Downtown Costco Will No Longer Allow Non-Members Access To Their Food Court **Find** Food Booze Desserts Cafes Food Trucks Hot Spots **Travel & Outdoors** ParksLangley's Amusement Park Inspired Playground has a Massive Zipline Swing Massive 7 Acre Big Splash Water Slide Park Reopening This Summer ParksMaple Ridge Has an Incredible New Playground with Ziplines and Trampolines **Explore** Bucket List Staycations Accommodations Adventures Hikes Parks Lakes Haunted Places **City Life** You Can Watch These Movies At Cineplex For $3.99 This June FREE Outdoor Movies Lineup At Stanley Park Has Been Revealed 8 Vancouver Playgrounds with In-Ground Trampolines Your Kids will Love **Explore** Transportation People Careers Culture Real Estate History **Shopping** Local BusinessesMr. Japanese Curry Might Serve The Most Authentic Japanese Curry In All Of Vancouver DealsHere’s All The Deals The U.S. Is Currently Offering Canadians To Come Visit Again DealsLive Nation Is Selling Vancouver Concert Tickets For Only $30 **Find** Local businesses Shops Services Deals Login Sign Up CitiesVancouverBurnabyRichmondSurreyLangleyNew WestminsterWhite RockNorth VancouverCoquitlamAbbotsfordWhistlerDeltaAll Cities Vancouver Burnaby Richmond Surrey Langley New Westminster White Rock North Vancouver Coquitlam Abbotsford Whistler Delta All Cities Vancouver Burnaby Richmond Surrey Langley New Westminster White Rock North Vancouver Coquitlam Abbotsford Whistler Delta All Cities Things To DoEvents CalendarAttractionsDate Night IdeasNight LifeKid FriendlyView All Events Calendar Attractions Date Night Ideas Night Life Kid Friendly View All Events Calendar Attractions Date Night Ideas Night Life Kid Friendly View All Food & DrinkFoodBoozeDessertsCafesFood TrucksHot SpotsView All Food Booze Desserts Cafes Food Trucks Hot Spots View All Food Booze Desserts Cafes Food Trucks Hot Spots View All Travel & OutdoorsBucket ListStaycationsAccommodationsAdventuresHikesParksLakesHaunted PlacesView All Bucket List Staycations Accommodations Adventures Hikes Parks Lakes Haunted Places View All Bucket List Staycations Accommodations Adventures Hikes Parks Lakes Haunted Places View All City LifeTransportationPeopleCareersCultureReal EstateHistoryView All Transportation People Careers Culture Real Estate History View All Transportation People Careers Culture Real Estate History View All **Vancouver’s Downtown Costco Will No Longer Allow Non-Members Access To Their Food Court** ByAlexa Leung Photo: Google Maps Costco’s iconic$1.50 hotdog and popwill no longer be available foreverybodyin Downtown Vancouver. Oranyof their food menu items, actually. Effective this August, folkswithouta Costco membership cardcan kiss goodbye their cheap bite to eat before a game or concert. **REQUIRED MEMBERSHIP** As a members-only retailer, Costco has long required their customers to own a membership to purchase their products. Still, the food court is afavouritefoodspotformembersandnon-members alike. That $1.50 deal is asiconicas it is agreat price. Photo: [deleted] / RedditMany folks drop into Downtown Vancouver’s Costcobeforeheadingto agame,show, orconcertfor a cheaper snack compared toRogersArenaandBCPlace’sconcessions. Unfortunately, signs have recently been posted up in thefoodcourtto announce that this willnolongerbe the case if you arenota Costco member. The sign reads that onAugust 5, 2025, “anactiveCostcomembershipcard will berequiredto purchase items from ourfoodcourt.” Non-members are then directed to the membership counter for details. **COMMUNITY REACTION** Opinions seem to befairlypositiveregarding Downtown Vancouver Costco’s decision. Many aregladthat wait times will possiblyshortennow that non-members are no longer allowed into the food court. Similarly, some are noting that other Costco locationsalreadyrequirecustomers to have a membership in order to eat at the food court. What doyouthinkabout this decision? You Might Also Like **26 Fun Things To Do in Metro Vancouver This Weekend (June 6-8)** **26 Fun Things To Do in Metro Vancouver This Weekend (June 6-8)** **Iconic Vancouver Restaurant The Boathouse To Close Two Locations** **Iconic Vancouver Restaurant The Boathouse To Close Two Locations** Share Log in or create an account to save content **Become a local insider** **Must Reads** **Find** News Events Deals Restaurants Contact Us Add an Event Advertise About Us Cities Privacy Policy My Account Newsletter 604 Now is dedicated to metro Vancouver, the southwest corner of British Columbia, and the province’s most urban division. Daily, we engage a diverse community and excite our readers to explore the best of their city within the metropolis. Website byGraphem Solutions © 2025 - 604 Now. An Elite CafeMedia Publisher. All rights reserved."}