{"id": 2148, "name": "The New Inquiry", "domain": "thenewinquiry.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://thenewinquiry.com/set-the-terms-of-your-struggle-the-cal-poly-humboldt-commune-speaks/", "title": "Set The Terms Of Your Struggle The Cal Poly Humboldt Commune Speaks", "content": "The New Inquiry modern scholarship Facebook Twitter Tumblr Instagram RSS Subscribe Essays & Reviews Features Blogs Audio Current Issue Past Issues Shop About Search Login Subscribe for $2 **“Set the terms of your struggle:” The Cal Poly Humboldt Commune Speaks** **Cal Poly Humboldt rapidly developed into the militant front of the campus Palestinian liberation movement. After repelling a police assault during their occupation of Siemens Hall—renamed Intifada Hall—the commune claimed much of the campus. We spoke to two participants about their efforts.** This interview was edited for clarity and length and a shorter version originally appeared in the print edition ofThe New York War Crimes. The New York War Crimes: Tell us about the first day of the occupation. Cal Poly Humboldt: The plan was to have a Seder. It was Passover. A number of Jewish students had brought, you know, big buckets of Matzo ball soup. Around 4:30 in the afternoon, we entered Siemens Hall for what we thought would be a pretty calm occupation. Instead, we were immediately met with confrontation from university police. People had their chairs ripped from under them and were shoved to the floor. Others were shoved against the wall. Then those first couple of cops were forced out of the building. Word spread very quickly throughout town, that there was a building occupation happening on campus, and that the cops were showing up with less-lethal weapons, batons and riot gear ready to kick us out. People made the decision that the safest option would be to build barricades to prevent the police from entering. The video that circulated, with the famous bonk, was taken as a mass of police was entering the building, while a larger mass of students and community members had gathered outside. With the support of the crowd outside, people felt empowered to repel the police from the inside. We were saying: The point is to occupy the space. The point is to cause a crisis for this university. Why do you think militancy took hold on your campus in the way that it did? A lot of people came in with a personal ethos of militancy. But there were also a lot of people who just had really strong convictions about, and anger toward, the American empire and the ongoing genocide. The camaraderie that was established in those first hours was what fueled people to act militantly, even if they hadn’t done so before. Seeing that the police were attacking a community that was joined together in an explicit rejection of something very obviously wrong, that was what empowered people to act with incredible strength and conviction. People on this campus don't have it like in New York. It's very easy to start a student organization if you are an NYU student, you can go to The New School and talk to the people that have started the organization on their campus and they'll send a representative over and there's like a very clear, sort of like, methodical way that this happens. There will also always be, like, a group of 50 year old Trotskyites and 35 year old Maoist who are ready to start an organization at your school and put you on the golden path, right? But here, there's absolutely none of that infrastructure. And so, people have to think creatively, people take their cues from other places. Instead of having these counterintuitive, like ways of acting that are proposed, often by student organizations or various sort of like leftist organizations in general, people took cues from one another. What do you have to say to students struggling to embed militancy in their movements? The most important lesson is to act bravely and believe that people will come. For the occupiers, there was one point where they were unwilling to compromise and leave the building. There was this push to defend this space and to believe that in holding strong on that one point that people would support us. That became incredibly true and apparent. What was really important in sustaining the fight against the police at the barricades was this tenderness that existed among the occupiers. When people were holding the barricades, there were other people behind them that were hand-feeding them granola bars and opening tangerines, feeding them sips of water, and it became clear that there was a beautiful energy and camaraderie inside that needed to be protected from the cops. There are a lot of impoverished students at Cal Poly Humboldt. There are students who are homeless. How do you think that those conditions impacted the tenor of your struggle? Well, the school created an environment where people were ready to fuck the school up. There’s a huge housing crisis. There’s mold in a lot of the dorms. Earlier this year, there was a huge eviction of homeless students who were living in their vehicles on campus. There’s an intense feeling of being policed on campus as well. There was a huge controversy on campus over the school’s time, place and manner ordinances, which basically limit student protests to a square on the quad for an hour during the day. Students feel that the administration does not care about them. So when given the opportunity, they put that feeling into action. And because they were able to participate in a successful repelling of the police on night one, they learned that bowing to administration and bowing to the police do not keep us safe, that we have the potential to keep each other safe. So the politics that emerged, at its best, was an embodied, learned politics. There’s also a really strong indigenous community here. There was, from the beginning, a strong awareness of the hypocrisy of the school and of the local police forces as an extension of colonialism, the hypocrisy of them trying to establish who has a right to occupy space here. That was a huge driving force in the militant rejection of the police and the school. You guys rejected the “outside agitator” storyline even before it became the dominant, pernicious narrative it is now. What prompted that? And how did that orientation shape the commune as it grew? The initial group that occupied Siemens Hall were not pretending to be anything other than a collection of students and the friends of students. We set the terms very early on. The people who were feeding us every day were not students, people who were coming in and medics, you know, there were just so many ways in which non-students were showing up and building this world with us together. Yeah, there should be “outside agitators” at every encampment who are highly visible, performing social reproductive roles in the commune itself, and that's one way that people are able to build trust with each other. And then I think beyond that, part of the fact of living in a small town is that everyone sort of knows each other. Of course, that puts us in some precarious situations. But it also means that students are not so isolated on their campus. Many of them live in town and the town is very fucking small. So it's hard to create this inside-outside divide, when everyone is going to the same cafes, everyone is going to the same bars, everyone's hanging out in the same parks anyway. We talked about how it would be inherently against the point of opposition that brought everyone together to isolate the movement to students because inherently the movement that the students are a part of, is not about American students, you know, in a way it is but it's a response to the genocide. Those of us with more experience drew on an understanding of the way “outside agitator” narratives have created insidious divisions within movements. Remember when the Wendy’s was burned in Atlanta? A mob of people on Twitter identified a woman they thought was an outside agitator. She ended up going to prison, and then we learned she was the life partner of Rayshard Brooks, who had just been gunned down by the police. There are ways in which the university as a branch of empire fucks with people's lives here and there are ways in which this movement as a movement against not just the school but against the American empire necessitates other people to care about it. We’re all tied to one another, regardless of our positions in the world, regardless of our attachments to various institutions. We owe it to each other to fight together. You held the largest liberated zone in the country, effectively occupying most of the campus, as opposed to everywhere else, which has been either a quad or maybe one building. How did day-to-day life function in the commune? One of the most beautiful parts of the occupation was the construction of the barricades. There were multi-layered barricades of stray chairs and then pallets, and then overturned trash cans and dumpsters, and then metal picnic tables and metal fencing that had been bolted to the ground. Beyond that, there was a line with “NO COPS PAST THIS POINT” written in chalk. The line would move and grow every night. For people working in the mutual aid kitchen that we established, the task became very clear. For people watching the perimeter, the task was very clear. For those who wanted to build barricades, the task was clear. What would have really strengthened us would be to have programming. Empty space and time allows for continual meetings, which drain people’s energy. If that energy is directed towards creating bonds instead of creating divisions, then you get that same sense we had on the first day—that this is a place to be defended. This is a place where we feel strong together. These are the people I’m fighting with. How did the militancy and commitment to the Palestinian cause emerge in a relatively rural area that people might not typically identify as a hotbed of resistance to empire? Humboldt County is a particular case. There's a long history of movements in this extremely isolated, rural part of California. This is where the 60s became the 70s. People formed 1000s of communes across this landscape. This is where in the 90s and 2000s some of the most radical aspects of the movement in defense of this earth took place. And this is also where in the early 2000s members of this community were able to force military recruiters off of local high school campuses in both Arcata and Eureka. There are legacies in this town and in this county that we're drawing on. At the end of the day, there are creative, beautiful minds all over this country. Can you give us your narration of the events on the last day when the police came and ended the occupation? Because we’re so isolated, it took a long time for the university and the state to amass enough force to end the occupation. What that meant was calling in 500 officers from as far south as Ventura County, which is about 11 hours away. Some of the transportation companies up here that were hired to transport the police began to cave to pressure and stand in solidarity with the occupation as well and refuse to transport the cops so we were able to stave off the assault from police for a couple of days. It's such a small town that shit gets leaked left and right, you know, it's like everyone has some uncle who's a sheriff who's talking at their family dinner, or whatever the fuck it is, we immediately were made aware of what the cops move orders were going to be on the night of the sweep. Yeah. Explicit. It was ridiculous. Students showed up with their own improvised armor, like the trash-can shields, the skating helmets, which reflected the beauty and intensity of their desire to defend the space. Even when the police surrounded the commune, a lot of us were able to escape through the forest, the routes only we know, because of our familiarity with the terrain. We’re proud of everyone for outsmarting the cops, which is easy because the cops are idiots; it’s also beautiful because these kids are really smart. The police, despite outnumbering us, were only able to arrest people who had made the ideological or tactical decision to be arrested. What comes next? There’s this feeling that people have witnessed, they’ve participated in, something they cannot and will not forget. What we heard again and again was that this was the experience in their lives that felt the realest. There’s an intense sense of falsity in participating in normalcy when the conditions of our lives are not normal and the conditions of the empire that we live in are not normal and the world is burning before us. The mythology that the United States puts out there has less of a basis in reality for people. For young Jewish people, it's been a decade of serious shifts in our perspective on Zionism. Almost no young Jewish person I know has the same perspectives on Israel and Zionism as our parents. And we certainly don't have the same sort of attachments or feel spoken for in the same way. Young people everywhere have an intense feeling, an intense desire for action and for reality, and when an avenue is offered, when a few brave people offer a way for that energy to flow, it will go forth. There is a plethora of creativity and energy and anger and desire for something greater and something more tangible. And if you offer them a place they will rush towards it. Simultaneously, do not allow yourselves to be isolated. Draw on the largest participation you possibly can and continue to find avenues to fight because these campuses are just one institution that make up the disgusting war machine that is US Empire. What’s clear is that the administration is terrified of their students. The cops are terrified of them as well. And just like with night one of the occupation, whatever happens next is going to happen on our terms. And we implore members of this student movement to set the terms of their own struggle. **Subscribe$2 per month** Contact Submit Donate About Subscribe Manage Subscription Browse the Archive Terms Of Use Facebook Twitter Tumblr Instagram RSS **Subscribe to Newsletter**"}