{"id": 1986, "name": "Guardian Liberty Voice", "domain": "guardianlv.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://guardianlv.com/2023/04/the-dark-history-of-why-i-am-opposed-to-organized-religion-how-many-christians-shun-the-teachings-of-jesus-christ/", "title": "The Dark History Of Why I Am Opposed To Organized Religion How Many Christians Shun The Teachings Of Jesus Christ", "content": "GLV Team About Us Jobs/Family Services Humor Arts Movies Music Fashion Emancipation Common Sense Contact Us GLV Team About Us Jobs/Family Services Humor Arts Movies Music Fashion Emancipation Common Sense Contact Us **Seapointe College Disrupts the Norms of Education** **Will My Beloved State of Nevada Display Wisdom or Ignorance in November 2024?** World U.S. Business Technology Entertainment Sports Science Health Religion World U.S. Business Technology Entertainment Sports Science Health Religion **The Dark History of Why I am Opposed to Organized Religion: How Many “Christians” Shun the Teachings of Jesus Christ** Home»The Dark History of Why I am Opposed to Organized Religion: How Many “Christians” Shun the Teachings of Jesus Christ April 24, 2023 It is of no importance whether you are a Catholic, a member of Jesus Christ of the Latter Day Saints, a Presbyterian, a Methodist, or any other religion which claims to be Christian, your faith must be based on the New Testament and the teaching of Jesus Christ. **A Puritanical Nation Does Not Align With the Constitution** In 1630 the Puritans set sail for the New World. Unlike the Pilgrims, who left 10 years earlier, they did not break from King George III Anglican Church: they planned to reform it. For Puritans, you were with them or against them. All who denied their beliefs were considered heretics and not sharing their principles was blasphemy. There is a logical and semi-accurate comparison between Puritans andEvangelicalsin the 21st century. Those who committed any of the alleged crimes were severely punished. Capital punishment was therefore administered to those who committed “sins” which involved blasphemy, counterfeiting, or witchcraft. It is fair to state the fact that a Puritanical society was not a free society. This is why our Founding Fathers began the First Amendment with, “Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof…” This protects the rights of every American to practice the religion they choose, or none at all. The Christian Religious Right opposes this precept. They control all Republicans and therefore violate the Constitution daily. The problem with Christianity in America is that most who call themselves “Christians” do not believe in the teachings of Jesus Christ. Instead, they rely on the Old Testament for their beliefs. However, the Old Testament contains many fantasies and fairytales. Today’s fake Christians are judgmental, self-righteous, and consider all other religions and atheists as heretics. **The Principles of America Are in Opposition to the Ideas of Many Religions** For the informed American there is growing concern about the alliance between the Christian Religious Right and right-wing politicians. For example: two political issues would not exist if the demands of the CRR were not a priority in Washington: a woman’s right to an abortion, and same-sex marriage. Today we can add the rights of transsexuals who are under vicious attacks by extremists including Ron DeSantis, Greg Abbott, Bill Lee, Marjorie Taylor Greene and others. **Many Republicans Are Unfit to Serve in Washington Based on Their Rejection of Their Oaths of Office** Here are examples of how some Republicans are attempting to join religion and extreme nationalism. Kari Lake (R), Arizona Gubernatorial Candidate: You can call us extremists. You can call us domestic terrorists. You know who else was called a lot of names his whole life? Jesus. Rep. Marjorie Taylor Greene (R-GA): I’m a Christian, and I say it probably. We should be Christian nationalists. Rep. Lauren Boebert (R-CO): The church is supposed to direct the government. The government is not supposed to direct the church. I would be remiss if I excluded the fascist Governor of the Sunshine State Gov. Ron DeSantis (R-FL): We need people all over the country to be willing to put on that full armor of God, to stand firm against the left’s schemes. Boebert revealed her lack of knowledge about our country and her complete rejection of the First Amendment. Our Founding Fathers were not Christian, with few exceptions. In addition, they were adamantly opposed to the dominance of a single religion. I am not a member of any religion, and this is personal, as it should be. This is my right guaranteed by the Constitution, and this is why I reject any words or actions which might reduce or remove the separation of Church and State. The truth is that history proves that religions are one of the greatest dangers to freedom, equality, and world peace. Op-ed by James Turnage Find my nine novels on Amazon’s Kindle Sources: New England Historical Society:Way More Than the Scarlet Letter: Puritan Punishments PBS NEWSHOUR:Concerns grow over the increasing ties between Christianity and right-wing nationalism Top and featured image courtesy ofGeorge Bakos‘ Unsplash page – Creative Commons License **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook April 24, 2023 America,christianity,religion,spot ByJames Turnage **Share:** **Send Us A Message** Copyright 2024 | We SupportPhalanx Family Services&St Agatha Catholic Church Privacy Policy|Terms & Conditions| Powered byFrackle Media"}