{"id": 1505, "name": "Type Media Center", "domain": "typemediacenter.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://typemediacenter.org/2025/05/08/type-media-center-fellow-matthieu-aikins-wins-pulitzer-prize-in-explanatory-reporting/", "title": "Type Media Center Fellow Matthieu Aikins Wins Pulitzer Prize In Explanatory Reporting", "content": "Bold TypeBooks TypeInvestigations Fellows Ida B. Wells Prizes Search Search Search Search Search Highlights InsideType Special Projects Jobs & Internships About Contact About Contact Type Media Center Bold Type Books Type Investigations Fellows Ida B. Wells Prizes © Type Media Center. All Rights Reserved. **Type Media Center Fellow Matthieu Aikins Wins Pulitzer Prize in Explanatory Reporting** Type Media Center fellow Matthieu Aikins was part of the New York Times team, which included Azam Ahmed and Christina Goldbaum, that won the2025 Pulitzer Prize in Explanatory Reporting.This is his second Pulitzer Prize. Image: Kiana Hayeri Type Media Center fellow Matthieu Aikins was part of the New York Times team, which included Azam Ahmed and Christina Goldbaum, that won the2025 Pulitzer Prize in Explanatory Reportingfor an “authoritative examination of how the United States sowed the seeds of its own failure in Afghanistan, primarily by supporting murderous militia that drove civilians to the Taliban.” Aikins previously won aPulitzer Prize in International Reportingas part of a New York Times team “for courageous and relentless reporting that exposed the vast civilian toll of U.S.-led airstrikes, challenging official accounts of American military engagements in Iraq, Syria and Afghanistan.” Among the winning work is Aikins’profile of Abdul Raziq,a U.S. ally who served as the police chief for the Kandahar Province and was responsible for hundreds of forced disappearances and extrajudicial killings. “Raziq’s story complicates the comforting belief that brutality always backfires and undermines the U.S. military’s claim to have fought according to international law,” writes Aikins in the piece. “Raziq’s violence was effective because it had a logic particular to the kind of civil war that the United States found in Afghanistan, one where the people, and not the terrain, were the battlefield.” Former Type Media Center fellow Anand Gopal, a contributing writer forThe New Yorker, was a finalist for the 2025 Pulitzer Prize in Feature Writing for “a deeply reported narrative of a woman’s life before and after she is imprisoned at an isolated detention camp in eastern Syria, illustrating how love and family intersect with larger geopolitical concerns.” You can readThe New Yorkerfeaturehere. **Related Articles** How Leonard Leo’s Dark Money Network Orchestrated a New Attack on the Voting Rights Act What Should Democrats Do Now That Police Reform Talks Have Broken Down?￼ American Muslims Are in a Painful, Familiar Place This is the summer of discontent – and it’s only just beginning A Democracy Crisis Was Averted. But Gerrymandering Could Still Save the GOP. Civilian Harm: Secret Pentagon Investigation Found No One at Fault in Drone Strike That Killed Woman and 4-Year-Old About Contact Type Media Center Bold Type Books Type Investigations Fellows Ida B. Wells Prizes © Type Media Center. All Rights Reserved. Required View All Lists"}