{"id": 180, "name": "Calmatters", "domain": "calmatters.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://calmatters.org/economy/2025/06/could-california-really-withhold-tax-money-from-the-u-s-if-trump-cuts-federal-funds/", "title": "Could California Really Withhold Tax Money From The U S If Trump Cuts Federal Funds", "content": "About Us Newsletters Donate Politics Justice Environment Economy Health Housing Education Inequality Digital Democracy Technology Commentary Daily Newsletter Explainers Data & Trackers ProgramsCalifornia DivideCalMatters for LearningCollege Journalism NetworkMental Health Reporting InitiativeWhat’s WorkingYouth Journalism California Divide CalMatters for Learning College Journalism Network Mental Health Reporting Initiative What’s Working Youth Journalism California Divide CalMatters for Learning College Journalism Network Mental Health Reporting Initiative What’s Working Youth Journalism Events DonateManage your donation Manage your donation Manage your donation Newsletters About UsImpactNews and AwardsFundingPoliciesSponsorshipOur TeamJobs Impact News and Awards Funding Policies Sponsorship Our Team Jobs Impact News and Awards Funding Policies Sponsorship Our Team Jobs Inside the Newsroom CalMatters en Español Videos Facebook Instagram Twitter LinkedIn YouTube Politics Housing Education Economy Environment California Voices Digital Democracy Events **Could California really withhold tax money from the U.S. if Trump cuts federal funds?** **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Click to share on WhatsApp (Opens in new window)WhatsApp In summary As the Trump administration considers cutting federal funds to California, Gov. Newsom and other officials suggest withholding taxes from the federal government. Welcome to CalMatters, the only nonprofit newsroom devoted solely to covering issues that affect all Californians. Sign up forWhatMattersto receive the latest news and commentary on the most important issues in the Golden State. Gov. Gavin Newsom suggested last week that California may withhold taxes it pays to the United States if President Donald Trump slashes federal funding to the state. It could be another front inthe escalating battlebetween the Trump administration and the Golden State, which are at the moment wrestling over the presidentsummoning the militaryto handleprotests against immigration raidsin Los Angeles. But how it would all work — on both sides — is anyone’s guess. CalMatters asked several tax experts to weigh in on how the state could withhold money from the federal government. Most would not comment about what they called a “vague” threat by state officials. But they pointed out that residents and businesses pay state and federal governments directly when they file their income taxes — making it unclear what tax money California could withhold. Newsom is not suggesting people stop paying their taxes, said Tara Gallegos, a spokesperson for the governor. But she said the state is considering “whether there are potential options that would allow it to retain some of the funding it typically sends the federal government.” **Read Next** **72 hours in LA: Immigration sweeps, protests and a historic National Guard deployment** She would not provide further details and did not answer CalMatters’ question about which of his staff the governor has directed to explore those options. California’s biggest sources of revenue are personal income tax, corporation tax and sales tax, the last of which goes to local and state governments. The state does not handle other excise taxes, such as those from airports, transportation and more, that the federal government receives, according to the Finance Department. Newsom on Friday also floatedon social mediathe idea that California is a “donor” state and contributes tens of billions of dollars more a year to the U.S. than it gets back, something Gallegos reiterated to CalMatters. Just the right amount of news Just the right amount of news Get California’s most essential headlines without feeling overwhelmed. Get California’s most essential headlines without feeling overwhelmed. Δ Astudyby the Rockefeller Institute of Government found that in fiscal year 2021-22, California provided about $83 billion more to the federal government than it received, nearly three times as much as the next state, New Jersey, which provided about $29 billion more than it received from the U.S. In addition, California taxpayers contribute the most of any state to total federal taxes, according to IRS data the state’s Finance Department cited. In fiscal year 2023-24, California’s total federal taxes were $806 billion — nearly twice as much as Texas, which contributed $417 billion, and more than twice the $384 billion New York contributed. State Assembly Speaker Robert Rivas alsoposted on social medialast week that California must look at “every option” including withholding tax dollars, saying that “we’re the nation’s economic engine and the largest donor state, and deserve our fair share.” Rivas, a Salinas Democrat, was not available to answer questions, his staff said. Some people dispute the notion of donor states. “The governor’s long-standing complaint that California is a donor state rings hollow,” said Jared Walczak, vice president of state projects for the Tax Foundation, a Washington, D.C.-based right-leaning think tank. “Unless California politicians are questioning the legitimacy of Medicare, Medicaid, and Social Security, the complaint that California residents pay more in federal taxes than they get back is disingenuous.” “Courts have made it abundantly clear that you can’t be a conscientious objector to paying taxes,” Walczak said. Courts have also made it tough for the White House to cancel funding. White House spokesperson Harrison Fields confirmed in an email to CalMatters this week that the Trump administration is reviewing possible wide-ranging funding cuts to California, as reported last week by different media outlets such asCNNand theWashington Post. But Fields said no decision has been made, and would not specify which programs are being considered for defunding. In the same email, Fields said the answers were on background or off the record, which he and CalMatters did not agree to beforehand. H.D. Palmer, spokesperson for California’s Finance Department, pointed to the Trump administration’s attempt tofreeze hundreds of billions of dollarsin federal grants and loans, through an Office of Management and Budget memo, which it then rescinded in late January after public outcry and court orders. “One salient point from our high school civics lessons: The power of the purse doesn’t lie with the (presidential) administration,” Palmer said. Palmer provided a list of state programs that receive the most federal funding, which the state is counting on in its current budget. The list includes money for health, education, highway planning and construction, disaster recovery, grants for the Supplemental Nutrition Assistance Program and more. The biggest is $100.9 billion for medical assistance programs. He said the White House has yet to provide specifics or answer the following question: “What public policy benefit are you seeking by withholding these federal dollars from California?” **Read More on Trump and California** **‘An endless game of whack-a-mole’: California tariffs lawsuit thrown out, but it’s not over** **Trump trade war has already had huge effect on California ports** Read more from CalMatters Text Get breaking news on your phone. Text Get breaking news on your phone. Download Keep up with the latest via our app. Download Keep up with the latest via our app. Sign up Receive free updates in your inbox. Sign up Receive free updates in your inbox. **Nonpartisan, independent California news for all** We’re CalMatters, your nonprofit and nonpartisan news guide. Our journalists are here to empower you and our mission continues to be essential. We are independent and nonpartisan.Our trustworthy journalism is free from partisan politics, free from corporate influence and actually free for all Californians. We are focused on California issues.From the environment to homelessness, economy and more, we publish the unfettered truth to keep you informed. We hold people in power accountable.We probe and reveal the actions and inactions of powerful people and institutions, and the consequences that follow. But we can’t keep doing this without support from readers like you. Please give what you can today. Every gift helps. **Levi SumagaysayEconomy Reporter** x bluesky Levi Sumagaysay covers the California economy for CalMatters with an eye on accountability and equity. She reports on the insurance market, taxes and anything that affects the state’s residents, labor...More by Levi Sumagaysay **Could California really withhold tax money from the U.S. if Trump cuts federal funds?** We love that you want to share our stories with your readers. Hundreds of publications republish our work on a regular basis. All of the articles at CalMatters are available to republish for free, under the following conditions: Give prominent credit to our journalists:Credit our authors at the top of the article and any other byline areas of your publication. In the byline, we prefer “By Author Name, CalMatters.” If you’re republishing guest commentary (example) from CalMatters, in the byline, use “By Author Name, Special for CalMatters.” Give prominent credit to our journalists:Credit our authors at the top of the article and any other byline areas of your publication. In the byline, we prefer “By Author Name, CalMatters.” If you’re republishing guest commentary (example) from CalMatters, in the byline, use “By Author Name, Special for CalMatters.” Give prominent credit to our journalists:Credit our authors at the top of the article and any other byline areas of your publication. In the byline, we prefer “By Author Name, CalMatters.” If you’re republishing guest commentary (example) from CalMatters, in the byline, use “By Author Name, Special for CalMatters.” Credit CalMatters at the top of the story:At the top of the story’s text, include this copy: “This story was originally published byCalMatters.Sign upfor their newsletters.” If you are republishingcommentary, include this copy instead: “This commentary was originally published byCalMatters.Sign upfor their newsletters.” If you’re republishing in print, omit the second sentence on newsletter signups. Credit CalMatters at the top of the story:At the top of the story’s text, include this copy: “This story was originally published byCalMatters.Sign upfor their newsletters.” If you are republishingcommentary, include this copy instead: “This commentary was originally published byCalMatters.Sign upfor their newsletters.” If you’re republishing in print, omit the second sentence on newsletter signups. Credit CalMatters at the top of the story:At the top of the story’s text, include this copy: “This story was originally published byCalMatters.Sign upfor their newsletters.” If you are republishingcommentary, include this copy instead: “This commentary was originally published byCalMatters.Sign upfor their newsletters.” If you’re republishing in print, omit the second sentence on newsletter signups. Do not edit the article, including the headline,except to reflect relative changes in time, location and editorial style.For example, “yesterday” can be changed to “last week,” and “Alameda County” to “Alameda County, California” or “here.” Do not edit the article, including the headline,except to reflect relative changes in time, location and editorial style.For example, “yesterday” can be changed to “last week,” and “Alameda County” to “Alameda County, California” or “here.” Do not edit the article, including the headline,except to reflect relative changes in time, location and editorial style.For example, “yesterday” can be changed to “last week,” and “Alameda County” to “Alameda County, California” or “here.” If you add reporting that would help localize the article,include this copy in your story: “Additional reporting by [Your Publication]” and let us know atrepublish@calmatters.org. If you add reporting that would help localize the article,include this copy in your story: “Additional reporting by [Your Publication]” and let us know atrepublish@calmatters.org. If you add reporting that would help localize the article,include this copy in your story: “Additional reporting by [Your Publication]” and let us know atrepublish@calmatters.org. If you wish to translate the article, please contact us for approval atrepublish@calmatters.org. If you wish to translate the article, please contact us for approval atrepublish@calmatters.org. If you wish to translate the article, please contact us for approval atrepublish@calmatters.org. Photos and illustrations by CalMatters staff or shown as “for CalMatters”may only be republished alongside the stories in which they originally appeared. For any other uses, please contact us for approval atvisuals@calmatters.org. Photos and illustrations by CalMatters staff or shown as “for CalMatters”may only be republished alongside the stories in which they originally appeared. For any other uses, please contact us for approval atvisuals@calmatters.org. Photos and illustrations by CalMatters staff or shown as “for CalMatters”may only be republished alongside the stories in which they originally appeared. For any other uses, please contact us for approval atvisuals@calmatters.org. Photos and illustrations from wire serviceslike the Associated Press, Reuters, iStock are not free to republish. Photos and illustrations from wire serviceslike the Associated Press, Reuters, iStock are not free to republish. Photos and illustrations from wire serviceslike the Associated Press, Reuters, iStock are not free to republish. Do not sell our stories, and do not sell ads specifically against our stories.Feel free, however, to publish it on a page surrounded by ads you’ve already sold. Do not sell our stories, and do not sell ads specifically against our stories.Feel free, however, to publish it on a page surrounded by ads you’ve already sold. Do not sell our stories, and do not sell ads specifically against our stories.Feel free, however, to publish it on a page surrounded by ads you’ve already sold. Sharing a CalMatters story on social media?Please mention @CalMatters. We’re on X, Facebook, Instagram, TikTok and BlueSky. Sharing a CalMatters story on social media?Please mention @CalMatters. We’re on X, Facebook, Instagram, TikTok and BlueSky. Sharing a CalMatters story on social media?Please mention @CalMatters. We’re on X, Facebook, Instagram, TikTok and BlueSky. If you’d like to regularly republish our stories, we have some other options available. Contact us atrepublish@calmatters.orgif you’re interested. Have other questions or special requests? Or do you have a great story to share about the impact of one of our stories on your audience? We’d love to hear from you. Contact us atrepublish@calmatters.org. **The Latest** Facebook Instagram Twitter LinkedIn YouTube **About** Overview Impact Funding News and Awards Policies Programs Sponsorships Our Team Jobs Contact Us **Topics** Politics Justice Economy Education Environment Housing Health Commentary Inequality **More** Donate Manage donation Newsletters CalMatters en Español Inside the Newsroom Digital Democracy **General Inquiries** info@calmatters.org **Membership Inquiries** membership@calmatters.org Protect your nonprofit state news. Become a CalMatters member with a tax-deductible donation today to stay informed, bolster our journalism and expand how many people we reach across California. Terms & Conditions Privacy Policy Sitemap"}