{"id": 688, "name": "Center for International Policy", "domain": "internationalpolicy.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://internationalpolicy.org/publications/new-foreign-affairs-essay-offers-bold-blueprint-for-u-s-foreign-policy-reform/", "title": "New Foreign Affairs Essay Offers Bold Blueprint For U S Foreign Policy Reform", "content": "ProgramsSecurity Assistance Monitor (SAM)Climate and Militarism Program (CAMP)Women for Weapons Trade Transparency (W2T2) Security Assistance Monitor (SAM) Climate and Militarism Program (CAMP) Women for Weapons Trade Transparency (W2T2) Security Assistance Monitor (SAM) Climate and Militarism Program (CAMP) Women for Weapons Trade Transparency (W2T2) Publications Who We Are Policy Journal MoreOur strategyEventsHow you can help Our strategy Events How you can help Our strategy Events How you can help ProgramsSecurity Assistance Monitor (SAM)This program explores the domestic, foreign, and geopolitical implications of US foreign policy on civilian well-being around the globe.Climate and Militarism Program (CAMP)This program evaluates the intersecting impacts of US energy and climate policies, climate change, and US defense policy on ecosystems and civilian populations worldwide.Women for Weapons Trade Transparency (W2T2)Committed to producing quality research on weapons sales and advocating for transparency of the international weapons trade, global demilitarization, and humane and sustainable policies. Security Assistance Monitor (SAM)This program explores the domestic, foreign, and geopolitical implications of US foreign policy on civilian well-being around the globe. Climate and Militarism Program (CAMP)This program evaluates the intersecting impacts of US energy and climate policies, climate change, and US defense policy on ecosystems and civilian populations worldwide. Women for Weapons Trade Transparency (W2T2)Committed to producing quality research on weapons sales and advocating for transparency of the international weapons trade, global demilitarization, and humane and sustainable policies. Security Assistance Monitor (SAM)This program explores the domestic, foreign, and geopolitical implications of US foreign policy on civilian well-being around the globe. Climate and Militarism Program (CAMP)This program evaluates the intersecting impacts of US energy and climate policies, climate change, and US defense policy on ecosystems and civilian populations worldwide. Women for Weapons Trade Transparency (W2T2)Committed to producing quality research on weapons sales and advocating for transparency of the international weapons trade, global demilitarization, and humane and sustainable policies. Publications Who We Are Policy Journal MoreOur strategyEventsHow you can help Our strategyEventsHow you can help Our strategy Events How you can help Our strategyEventsHow you can help Our strategy Events How you can help Our strategy Events How you can help Publications New Foreign Affairs Essay Offers Bold Blueprint for U.S. Foreign Policy Reform **New Foreign Affairs Essay Offers Bold Blueprint for U.S. Foreign Policy Reform** In a provocative new essay published byForeign Affairs, Nancy Okail, President and CEO of the Center for International Policy, and Matt Duss, the organization’s Executive Vice President, present a sweeping critique of the entrenched U.S. foreign policy orthodoxy and lay out a bold blueprint for reform. The essay, “America Is Cursed by a Foreign Policy of Nostalgia,” challenges decades of militarism and neoliberal economic policies that have prioritized corporate and elite interests over the well-being of most Americans and people worldwide. With the 2024 election confirming the collapse of Washington’s traditional foreign policy consensus, Okail and Duss argue that neither “America First” unilateralism nor liberal internationalism can address the urgent needs of a world grappling with climate change, economic inequality, and political instability. Instead, they call for a transformative foreign policy rooted in shared global challenges, equitable economic reform, and principled international cooperation. “The United States must choose between advancing a genuinely equitable global order or clinging to an undemocratic and unsustainable quest for global primacy,” saidOkail. “Our current trajectory not only fails to meet the needs of working Americans but also alienates nations and peoples worldwide that are calling for a more just and inclusive international system.” Key recommendations in the essay include: Ending Failed Militarism: Shifting from prioritizing global military hegemony at any cost to a foreign policy that prioritizes human security, accountability, conflict prevention, and consistent application of international laws and norms. Breaking from Neoliberal Economics: Ensuring prosperity is more widely shared among US communities, while reducing global inequality and economic precarity through equitable trade, labor, and investment rules, including by reforming global institutions like the World Bank and International Monetary Fund to support low- and middle-income countries, enabling sustainable development and debt relief. Redefining Relations with China: Moving beyond Great Power Competition and zero-sum strategic thinking to focus on collaborative solutions for climate change, public health, technological innovation, and a more inclusive global economic and political system. “Decades of militarized foreign policy and economic systems designed to benefit corporations and the wealthy have left working-class Americans—and communities around the world—paying the price,” addedDuss. “The 2024 election put a decisive stamp on what has long been clear: the Washington foreign policy consensus is not only intellectually bankrupt but also increasingly alienating to the American people. It’s time for a new approach that breaks from the false choice between ‘America First’ unilateralism and ‘America is Back’ nostalgia, focusing instead on the needs of everyday people and a future built on common good, human rights, and shared prosperity.” This essay is a call to action for policymakers, thought leaders, and citizens who recognize that the challenges of the 21st century require a fundamentally new approach to U.S. leadership. The full essay is available inForeign Affairsand can be readhere. ### The Center for International Policy (CIP) is a woman-led, progressive, independent nonprofit center for research, education, and advocacy working to advance a more peaceful, just, and sustainable U.S. approach to foreign policy. **Related resources** June 9, 2025State Needs Reorganization, Rubio’s Plan Isn’t ItCole Donovan is an associate director at the Federation of American Scientists. He previously had international S&T roles in the Biden White… May 30, 2025Growing Consensus on Israel’s Atrocities in GazaTop human rights experts and organizations around the world have identified many of Israel’s actions in Gaza–alongside hostage-taking and other atrocities committed… May 30, 2025MSNBC: Trump’s ‘Golden Dome’ system is an expensive way to make America less safeAt MSNBC, Chief Editor Kelsey D. Atherton walks through how Trump's recent announcement of a \"Golden Dome\" missile defense system is an… **Stay updated** Subscribe for the newsletter. Events Publications Who we are How can I help? Careers Events Publications 1050 Connecticut Avenue,NW, Washington, DC20036 (202) 232-3317 Privacy & Policy Terms of Service Copyright © 2024. All rights reserved. Powered byDesign in DC"}