{"id": 1935, "name": "Cursor", "domain": "cursor.org", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.cursor.org/money/2025/04/05/us-retail-sales-edge-up-0-2-per-cent-as-shoppers-remain-cautious.html", "title": "Us Retail Sales Edge Up 0 2 Per Cent As Shoppers Remain Cautious.html", "content": "Business Politics Home & Garden Money Technology Explore By Business Politics Home & Garden Money Technology More Cursor About Contact Terms Of Service Privacy Policy © 2025 Cursor All rights reserved **China Blasts Trump's 'Golden Dome' Missile Defense Plan** **China Blasts Trump's 'Golden Dome' Missile Defense Plan** **U.S. Retail Sales Edge Up 0.2% As Shoppers Remain Cautious** Retail sales rose 0.2% in February, signaling cautious spending as economic uncertainty, tariffs, and inflation weigh on U.S. consumers. Like Pin 2.1K After a sharp pullback in January, United States retail sales showed only a modest recovery in February, signaling a shift toward more cautious consumer spending amid growing economic uncertainty. The moderate recovery in February, while providing some relief, highlights the ongoing challenges that consumers and retailers alike must navigate in a time of heightened financial uncertainty. **A Modest Uptick In Sales** According to the Commerce Department, retail sales rose just 0.2% in February, following a sharp 1.2% drop in January. The mixed performance reflected gains in some sectors but declines in others; take a look below. Sectors with gains: Grocery stores Home and garden stores Online retailers Sectors with declines: Auto dealerships Restaurants Electronics stores The slight increase suggests that concerns over stock market volatility, trade policy, and government spending cuts are weighing on consumer confidence. This shift in consumer sentiment could have broader implications for the economy as a whole, with businesses potentially facing more challenges in maintaining strong sales growth in the months ahead. A widely watched measure of consumer sentiment fell sharply for the third straight month, now down more than 20% since December. The University of Michigan's survey revealed that policy uncertainty was a leading factor behind this drop. Notably, confidence in the economy's future among Republicans fell 10%, highlighting bipartisan concerns. **A Slowdown In Consumer Spending** Some economists are adjusting their forecasts, expecting consumer spending to grow at just 1% to 1.5% in Q1 — a stark contrast to the 4.2% increase in the final quarter of last year. Stephen Brown, an economist at Capital Economics, said consumer spending is on track to slow sharply this quarter but not as much as previously feared. **Retailers Feel The Pressure** Major retailers have also sounded the alarm on shifting spending patterns: Walmart, the nation's largest retailer, issued a weak outlook, citing tariff-related uncertainty. Macy's, including its upscale chains Bluemercury and Bloomingdale's, reported rising consumer anxiety. Dollar General announced plans to close around 100 stores, citing worsening financial situations for its core customers. Dollar General CEO Todd Vasos said many customers report only having enough money for basic essentials, with some noting that they have had to sacrifice even on necessities. **Changing Consumer Behavior** As economic uncertainty deepens, Americans are adjusting their spending habits: Costco reports a shift toward more affordable grocery items, such as ground beef and poultry, over pricier cuts of meat. American Eagle Outfitters CEO Jay Schottenstein noted heightened anxiety among younger shoppers, attributing it to a mix of inflation, tariffs, and government policy shifts. As the cost of living continues to rise and uncertainty surrounding the future of the economy persists, many consumers appear to be re-evaluating their purchasing behaviors, opting for more essential purchases and scaling back on discretionary spending. **Trouble Beyond Retail: Service Sector Impact** The caution isn't just limited to retail. Airline executives at JP Morgan's airline industry conference noted a decline in bookings. Delta CEO Ed Bastian said there was a noticeable shift in economic sentiment and consumer confidence. While job markets remain stable, with no significant layoffs reported, retailers and analysts warn that continued consumer hesitation could dampen economic growth in the coming months. TRENDING ON Money 5 Basic Money Mistakes the Middle Class Insists on Making **5 Basic Money Mistakes the Middle Class Insists on Making** **5 Basic Money Mistakes the Middle Class Insists on Making** **5 Basic Money Mistakes the Middle Class Insists on Making** The CEO of AllianzGI: Uncertainty is Not Good for Investors **The CEO of AllianzGI: Uncertainty is Not Good for Investors** **The CEO of AllianzGI: Uncertainty is Not Good for Investors** **The CEO of AllianzGI: Uncertainty is Not Good for Investors** 5 Side-Hustle Ideas You Can Try to Make Some Extra Cash **5 Side-Hustle Ideas You Can Try to Make Some Extra Cash** **5 Side-Hustle Ideas You Can Try to Make Some Extra Cash** **5 Side-Hustle Ideas You Can Try to Make Some Extra Cash** Companies That Are Vulnerable To The Wage Hike **Companies That Are Vulnerable To The Wage Hike** **Companies That Are Vulnerable To The Wage Hike** **Companies That Are Vulnerable To The Wage Hike** Key Employees of Google’s Self-Driving Car Project Quit After Being Paid A Huge Amount of Money! **Key Employees of Google’s Self-Driving Car Project Quit After Being Paid A Huge Amount of Money!** **Key Employees of Google’s Self-Driving Car Project Quit After Being Paid A Huge Amount of Money!** **Key Employees of Google’s Self-Driving Car Project Quit After Being Paid A Huge Amount of Money!** London Stock Exchange Bends the Rules to Attract Aramco **London Stock Exchange Bends the Rules to Attract Aramco** **London Stock Exchange Bends the Rules to Attract Aramco** **London Stock Exchange Bends the Rules to Attract Aramco** Most Viewed PoliticsThe 5 Key Differences Between Democrats and Republicans **The 5 Key Differences Between Democrats and Republicans** **The 5 Key Differences Between Democrats and Republicans** **The 5 Key Differences Between Democrats and Republicans** PoliticsUnderstanding the Entire Political Spectrum **Understanding the Entire Political Spectrum** **Understanding the Entire Political Spectrum** **Understanding the Entire Political Spectrum** PoliticsThese Are The States You Need To Register as a Democrat To Vote In The Primaries **These Are The States You Need To Register as a Democrat To Vote In The Primaries** **These Are The States You Need To Register as a Democrat To Vote In The Primaries** **These Are The States You Need To Register as a Democrat To Vote In The Primaries** BusinessAll The Companies That Are Cutting Ties With The Trumps **All The Companies That Are Cutting Ties With The Trumps** **All The Companies That Are Cutting Ties With The Trumps** **All The Companies That Are Cutting Ties With The Trumps** Home & Garden7 Common Household Items That Are Dangerous To Your Pets **7 Common Household Items That Are Dangerous To Your Pets** **7 Common Household Items That Are Dangerous To Your Pets** **7 Common Household Items That Are Dangerous To Your Pets** TechnologyDespite What Apple Said, The iPhone X Is The Most Fragile iPhone Yet **Despite What Apple Said, The iPhone X Is The Most Fragile iPhone Yet** **Despite What Apple Said, The iPhone X Is The Most Fragile iPhone Yet** **Despite What Apple Said, The iPhone X Is The Most Fragile iPhone Yet** RECOMMENDED **Nintendo Switch 2 Debuts With Social, 4K, Mouse Play** **Nintendo Switch 2 Debuts With Social, 4K, Mouse Play** Launching June 5 for $449, Nintendo's Switch 2 adds 4K visuals, GameChat, GameShare, and Joy-Con mouse control in a bold push for social gaming. **Nvidia Stock Falls On $5.5B Hit From Trump Export Rule** **Nvidia Stock Falls On $5.5B Hit From Trump Export Rule** Nvidia shares dropped 5% after a $5.5B charge tied to new Trump export rules, dragging markets down as trade tensions impact AI chip sales to China. **Amazon Unveils Nova Act, An AI Agent For Web Automation** **Amazon Unveils Nova Act, An AI Agent For Web Automation** Amazon introduces Nova Act, an AI model that automates web tasks, competing with OpenAI and Anthropic in the growing AI agent space. **U.S. Faces Debt Crisis As X-Date Looms** **U.S. Faces Debt Crisis As X-Date Looms** The U.S. could hit its debt ceiling by August, risking default unless Congress and the White House reach a deal. **AI Turns Photos Into Ghibli Style, Sparking Ethical Debate** **AI Turns Photos Into Ghibli Style, Sparking Ethical Debate** AI-generated Ghibli-style images delight users but raise ethical concerns about copyright and artist rights, as Miyazaki's past criticism of AI resurfaces. **Lip-Bu Tan Named Intel CEO, Vows To Revitalize Company** **Lip-Bu Tan Named Intel CEO, Vows To Revitalize Company** Lip-Bu Tan takes over as Intel CEO, aiming to revitalize the company, boost competitiveness, and drive innovation amid rising challenges from rivals. WHAT TO READ NEXT **Tariffs On China May Raise U.S. Drug Costs And Shortages** **Tariffs On China May Raise U.S. Drug Costs And Shortages** Trump's tariffs on China may raise U.S. prices on goods, including medication. Experts warn of supply chain risks, shortages, and other issues. Read on! **U.S. Deports Migrants To Panama In Major Policy Shift** **U.S. Deports Migrants To Panama In Major Policy Shift** Under a new agreement, the U.S. is deporting migrants from Africa and Asia to Panama, marking a major shift in immigration policy and diplomatic strategy. **U.S. Faces Power Crisis In AI Race Against China** **U.S. Faces Power Crisis In AI Race Against China** The U.S. faces a power crisis as it races against China in AI, pushing Google to turn to nuclear energy to meet growing data center demands. Discover more here! **Thank you! You have been addedto our daily newsletter.** We just addedto our newsletter list.Keep an eye out for the latest news from cursor in your inbox! About Contact Terms Of Service Privacy Policy Business Politics Home & Garden Money Technology Sign up for the best of Cursor, delivered to your inbox daily. © 2025 Cursor All rights reserved"}