{"id": 788, "name": "KTNA - NPR - Talkeetna", "domain": "ktna.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://ktna.org/2025/06/despite-budget-cuts-denali-arts-councils-upper-susitna-fine-arts-camp-returns-for-third-year-in-a-row/", "title": "Despite Budget Cuts Denali Arts Councils Upper Susitna Fine Arts Camp Returns For Third Year In A Row", "content": "Home About KTNAMission & ValuesStaffBoard of DirectorsCommunity Advisory BoardOn-air VolunteersPublic DocumentsPublic Media Code of Integrity Mission & Values Staff Board of Directors Community Advisory Board On-air Volunteers Public Documents Public Media Code of Integrity Mission & Values Staff Board of Directors Community Advisory Board On-air Volunteers Public Documents Public Media Code of Integrity NewsLocal NewsSu Valley VoiceDenali ReportGraduatesIditarod ReportMemorialsCOVID-19 Local News Su Valley Voice Denali Report Graduates Iditarod Report Memorials COVID-19 Local News Su Valley Voice Denali Report Graduates Iditarod Report Memorials COVID-19 ProgramsOn-air Schedule, Playlists and Archive PlayerRising Readers ShowSusitna Writer’s VoiceNorthern Susitna Valley Parks ReportSound VisionKTNA SpecialsKTNA’s On-air Volunteers On-air Schedule, Playlists and Archive Player Rising Readers Show Susitna Writer’s Voice Northern Susitna Valley Parks Report Sound Vision KTNA Specials KTNA’s On-air Volunteers On-air Schedule, Playlists and Archive Player Rising Readers Show Susitna Writer’s Voice Northern Susitna Valley Parks Report Sound Vision KTNA Specials KTNA’s On-air Volunteers Podcasts & SeriesThe Blue TarpSix Minute ScienceThe DirtLiquid Assets The Blue Tarp Six Minute Science The Dirt Liquid Assets The Blue Tarp Six Minute Science The Dirt Liquid Assets Support KTNABecome a MemberDonateUnderwrite with KTNASponsor ‘The Blue Tarp’Web AdvertisingEnhanced Public Service AnnouncementsSupport KTNA When you ShopKTNA MerchandiseVolunteer Become a Member Donate Underwrite with KTNA Sponsor ‘The Blue Tarp’ Web Advertising Enhanced Public Service Announcements Support KTNA When you Shop KTNA Merchandise Volunteer Become a Member Donate Underwrite with KTNA Sponsor ‘The Blue Tarp’ Web Advertising Enhanced Public Service Announcements Support KTNA When you Shop KTNA Merchandise Volunteer AnnouncementsTodays AnnouncementsDenali EchoesGeneral Policy for Announcements / Classifieds / CalendarSubmit Announcement/Classified/Denali Echo/Calendar Todays Announcements Denali Echoes General Policy for Announcements / Classifieds / Calendar Submit Announcement/Classified/Denali Echo/Calendar Todays Announcements Denali Echoes General Policy for Announcements / Classifieds / Calendar Submit Announcement/Classified/Denali Echo/Calendar Community CalendarSubmit Event Submit Event Submit Event **Despite budget cuts, Denali Arts Council’s Upper Susitna Fine Arts Camp returns for third year in a row** For the last three years, the Denali Arts Council has hosted the Upper Susitna Fine Arts Camp — a week-long program providing kids in the Upper Valley with hands-on experience in various art mediums. In the past, funding from AmeriCorps played a significant role in covering the costs of instructors. However, when federal cuts resulted inAmeriCorps placing the majority of its staff on administrativeleave in mid-April, the Denali Arts Councillost that funding, and it became clear the camp would have to look a little different. Denali Arts Council Executive Director Michelle Crow said a reduced budget for their summer programs is disappointing, but it’s all about moving forward and working with what you have. To cut costs, the Denali Arts Council asked guardians to pack lunches for their children because the camp could not provide lunch for every camper. Additionally, DAC hired one instructor for each art class instead of three as they had in previous years. According to Crow, one of the tougher cuts to the programming was cutting scholarships that helped families afford the camp. “Unfortunately, we had to compensate for that by having fewer scholarships available for our low income students. We were still able to offer scholarships to all of our students in need. It just wasn’t as much as the families are accustomed to,” she said. Even if this year looks a little different, Crow said the Denali Arts Council is committed to providing quality Summer programming for the community. “So we might have our disappointments, and we’re kind of pulling back in different areas. But as long as the kids come, have a great experience, then everybody’s happy,” she said. **KTNA is sponsored by** **KTNA is supported by** Vivian Waite Swiss Alaska Inn LouAnne Carroll-Tysdal Renamary Rauchenstein **Contact** Office:(907) 733-1700News:(907) 733-1900Studio:(907) 733-1200Email:info@ktna.org Physical: 13764 Second StreetMailing: PO Box 300Talkeetna, AK 99676 Link: FCCOnline Public File Public File Assistance: manager@ktna.org Talkeetna Community Radio, Inc. is funded, in part, by our members, underwriters,and the Corporation for Public Broadcasting. **Subscribe to our Newsletter** First Name* Last Name* Email* CAPTCHA"}