{"id": 2102, "name": "Populist Wire", "domain": "populistwire.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://populistwire.com/local-news/chad-pelley-lawsuit-in-shambles-free-speech-win-relieves-bailey-symonds-strips-injunction/", "title": "Chad Pelley Lawsuit In Shambles Free Speech Win Relieves Bailey Symonds Strips Injunction", "content": "Home NewsU.S.PoliticsWorldBusinessCultureCrimeMediaImmigrationTechEducation U.S. Politics World Business Culture Crime Media Immigration Tech Education U.S. Politics World Business Culture Crime Media Immigration Tech Education Videos Digi-Mag Store **Populist Wire** Home NewsU.S.PoliticsWorldBusinessCultureCrimeMediaImmigrationTechEducation U.S. Politics World Business Culture Crime Media Immigration Tech Education U.S. Politics World Business Culture Crime Media Immigration Tech Education Videos Digi-Mag Store **Iowa** **Chad Pelley Lawsuit in Shambles – Free Speech Win Relieves Bailey Symonds, Strips Injunction** Published on By Share Share Tweet Tweet In a pivotal legal ruling issued on May 14, 2025, the Iowa District Court in Linn County struck down nearly all of the speech-restricting injunctions in the high-profile case ofChad Pelley v. Dustin Mazgaj et al.The decision significantly weakens Pelley’s attempt to silence critics through civil court orders—and raises fresh questions about where the case goes from here. Chad Pelley Injunction Dissolved Bailey SymondsbyPopulist Wire **Symonds Cleared, Mazgaj Partially Restricted** At the heart of the ruling is a clear rejection of Pelley’s broad effort to restrict speech. The court fullydissolved the injunctionagainstBailey Symonds, stating that Pelley failed to prove she caused harm or was likely to in the future. As of now,Symonds is under no legal restrictions, restoring her full right to speak about the case, attend public meetings, and post freely online. In the case ofDustin Mazgaj, who operates under the nameButt Crack News Network, the court issued anarrowed injunction: Mazgaj is nowonly prohibitedfrom publicly referring to Chad Pelley as a: “Pedophile” “Drug user” “Drug dealer” All other parts of the injunction—including no-contact orders and broad bans on speech or proximity—weredissolved. **Melissa Duffield Confirmed Unrestricted** The court also clarified thatMelissa Duffield, another named defendant, wasnever placed under an injunctionat any point. Attempts by Pelley’s legal team to restrict her speech in a separate post-trial filing were also rejected, with the judge referencing potential First Amendment concerns. **BCNN Not a Company, Just a Username** In a notable clarification, the court determined thatButt Crack News Networkis not a separate business or legal entity—it’s simply the name of Mazgaj’s YouTube account. As such, any restrictions on BCNN are effectively just extensions of those on Mazgaj personally. **Skylar Price Still in Limbo** One original defendant,Skylar Price, hasnot responded to the lawsuitand wasfound in default. The court did not revisit the injunction as it applies to Price, meaning theoriginal restrictions may still technically be in effect—but without any new legal activity or defense. **Beau Bish and Flex Your Freedoms Not Bound** Though Pelley filed a second motion earlier this year to addBeau Bishand the media groupFlex Your Freedomsto the injunction, the court noted thatthey have not yet been formally served. As a result, they remainunrestricted by the courtat this time. **Where Does Pelley’s Case Go From Here?** The judge’s ruling sends a clear signal:courts will not issue broad gag orders unless the speech in question is proven to be false and harmful—and even then, only in narrowly tailored ways. Pelley may still pursue defamation claims, but without the broad powers of a speech-restricting injunction, he faces a steeper road. The ruling emphasizes the high bar courts place onprior restraint, especially when it involves criticism of someone involved in public matters like real estate development, civic boards, and local politics. As for the remaining claims—libel, false light, and emotional distress—they will now move toward a full trial. But the public gag orders Pelley once used to silence his critics have been largely rolled back, and the spotlight on his case is only getting brighter. Chad Pelley Denied: Free Speech Injunction Hearing to Proceed Friday in Linn County Chad Pelley Denied: Free Speech Injunction Hearing to Proceed Friday in Linn County **Iowa** **Chad Pelley Denied: Free Speech Injunction Hearing to Proceed Friday in Linn County** Published on By **** In a decisive move, an Iowa District Court hasdenied a motion by Chad Pelley to delay a critical hearingrelated to two controversial speech-restricting injunctions. The hearing, originally scheduled forFriday, April 25th at 10:30 AMin theLinn County Courthouse, will proceed as planned. The ruling marks a significant development in what many are calling a key First Amendment test in the state. For nearly three months, multiple individuals have been under strict court orders prohibiting them from discussing Pelley publicly or attending certain public events in the city of Marion. These restrictions stem from injunctions granted in January—issuedwithout prior notice—which plaintiffs claim were necessary to protect against alleged harassment. Critics, however, say the orders amount to anunconstitutional gag on public speech and civic participation. **The Stakes Going Into Friday** The upcoming hearing offers the first real opportunity for those under the injunctions tochallenge their legality. At issue is whether Iowa courts can continue to enforcebroad, preemptive speech restrictionson individuals based solely on allegations—without a full trial or opportunity for defense prior to enforcement. The plaintiffs are also seeking toexpandthe reach of the court orders to include new parties, including the political media outletFlex Your Freedoms (FYF)and its founder,Beau Bish, citing a video confrontation involving a local bank and accusations of financial misconduct. If granted, this would extend court-ordered silence to additional critics and content creators. **Public Access, Private Silence** Despite the public interest, there will beno recording or filmingof the hearing allowed—limiting access to those who attend in person. This lack of transparency, combined with the ongoing silence from elected officials and local media outlets, has intensified public scrutiny of the case. With major news outlets avoiding coverage and city leaders declining to comment, Friday’s hearing has become not just a legal proceeding—but alitmus test for civic accountabilityand the boundaries of protected speech in Iowa. **Iowa** **Chad Pelley’s Lawsuit: Free Speech Under Siege in Iowa** Published on By In Iowa’s Linn County, a significant legal battle over free speech rights is intensifying—yet the broader community remains largely unaware. For nearly four months, several local activists and content creators have been legally prohibited from speaking about Chad Pelley, a private citizen involved in local controversies. Now, this unusual legal maneuver is expanding to include additional voices, further raising concerns over the misuse of civil injunctions to stifle public discourse. Chad Pelley recently filed a motion seeking a 30-day delay in the scheduled hearing, prolonging the injunction’s restrictions to a fourth consecutive month. Bailey Symonds, one of the affected individuals, described this continuation as based on “perjured statements.” Court Restrictions Silencing Local Voices Local activist Bailey Symonds recently confirmed via social media that she and Dustin Mazgaj, associated with the Butt Crack News Network (BCNN), have been under two injunctions since January. These injunctions prevent them from publicly discussing Chad Pelley or attending specific public events and meetings within Marion. Symonds expressed frustration: “I’m under 2 injunctions restricting my speech and barring my attendance at certain public events and meetings in Marion. We’ve been denied the ability to film our upcoming court hearing, making physical attendance the only way the public can witness proceedings.” A hearing originally scheduled for April 25th at the Linn County Courthouse aimed to lift these injunctions, but Pelley’s recent motion to postpone has placed any immediate relief in doubt. Expanding Restrictions The original injunction was granted in January 2025 against five individuals: Dustin Mazgaj, Skylar Price, Bailey Symonds, and BCNN. Chad Pelley accused them of harassment, defamation, and causing emotional distress, leading to the court’s sweeping order that restricted public speech and physical proximity to him and related businesses.Article Section Updated to reflect Melissa Duffield’s Injunction Status: “The injunction wasnot granted against me. I was the only one excluded.“ In late February, Pelley took additional action, requesting the court extend these restrictions to Beau Bish and Flex Your Freedoms (FYF), citing a video confrontation at Community Savings Bank in Dyersville. According to Pelley’s filings, FYF and Bish allegedly continued harassment and defamatory practices associated with BCNN. Constitutional Concerns: A Dangerous Precedent While injunctions are sometimes appropriate to prevent harassment, this case uniquely involves broad restrictions on speech regarding a figure involved in public controversies. These restrictions—especially since imposed without prior notice to those affected—represent what First Amendment advocates describe as one of the most severe forms of censorship: prior restraint. Compounding these constitutional concerns is a troubling silence from key community institutions: Mayor O’Donnell and the Marion City Council refuse to answer questions regarding their knowledge or stance, despite internal emails suggesting support for Chad Pelley. The Gazette, a major regional newspaper, has neglected to cover this significant free speech issue. KCRG, another prominent local news organization, acknowledged complete unawareness of the case. Pelley’s legal representatives, who actively pursue expanded restrictions, declined to publicly comment. Next Steps and Broader Implications With Pelley’s motion to delay proceedings, the court-ordered silence continues without resolution. If Pelley’s new motion succeeds, activists and media organizations could remain silenced until late spring, creating an environment where public debate and accountability suffer. Ultimately, the issue here extends beyond personal disputes. It raises critical questions: Should courts limit speech about public controversies, and who should define the boundaries? In the absence of local government transparency and mainstream media coverage, it’s now up to concerned citizens and independent observers to protect the foundational right of free expression. This issue is no longer merely about Chad Pelley and a handful of critics. The lack of disregard for Iowans and potential the Trump Administration is very troubling. It’s about the fundamental right of a community to openly discuss and debate public matters without fear of legal retaliation. **Iowa** **Chad Pelley’s Lawsuit: Damage Control or Accountability?** Published on By Chad Pelley, a well-known developer in Cedar Rapids, Iowa, has been & is still tied to significant community projects. Despite his public prominence, local media outlets have not reported on his lawsuit filed on July 11, 2024, which alleges defamation, invasion of privacy, and emotional distress. Given Pelley’s role in publicly funded developments and the serious claims raised, this article seeks to provide context and foster transparency around the legal proceedings and the broader issues at play. Chad Pelley, a prominent Cedar Rapids, Iowa developer, has filed a lawsuit alleging defamation, invasion of privacy, and emotional distress against several individuals and an online entity. The defendants, who include local community members, citizen journalists, and a social media news outlet, have accused Pelley of misconduct ranging from criminal behavior to improper dealings in his professional life. As the lawsuit unfolds, questions arise about whether this legal battle is a pursuit of justice or a bid to control public perception. Chad Pelley Lawsuit Cedar R…byPopulist Wire **The Lawsuit: Allegations and Criticism** In his lawsuit, Pelley claims the defendants—Dustin Mazgaj, Skylar Price under the alias Hunter Light, Bailey Symonds, Melissa Duffield, and the online entity Butt Crack News Network (BCNN)—have engaged in a campaign of defamatory statements and harassment. According to court documents, these accusations include serious allegations of pedophilia, drug addiction, and unethical business practices. Pelley also argues that the defendants shared sensitive personal information, such as his social security number, and spread harmful narratives through social media platforms. While these claims are significant, they intersect with a broader narrative. The defendants argue that their statements are based on public records and verifiable facts, including Pelley’s criminal history, which dates back to a 1993 felony sexual abuse charge that was reduced to a misdemeanor. This is not the only blemish on Pelley’s record, as subsequent convictions include: November 8, 1995: Convicted of Criminal Mischief in the 4th Degree (Case 06571 SRCR009504). April 14, 1996: Convicted of Assault Causing Bodily Harm (Case 06571 SRCR011880). January 6, 1998: Convicted of Assault Causing Bodily Injury; a Criminal Mischief 3rd Degree charge in the same case was dismissed (Case 06571 SRCR022716). June 11, 1998: Convicted of Criminal Mischief in the 5th Degree (Case 06571 SMSM019982). December 2, 1998: Convicted of Assault (Case 06571 SMSM021662). Defendants point to public records documenting convictions in the 1990s, combined with Pelley’s ties to publicly funded development projects, as the basis for their skepticism about his reputation. Adding further complexity to the case, an email fromCedar Rapids Mayor Tiffany O’Donnell, responding to questions about the controversy surrounding Pelley. In her email, the mayor described the allegations against Pelley as “ridiculous,” while criticizing Butt Crack News Network (BCNN) for spreading misinformation and profiting from their viral content. She further claimed that members of BCNN had been arrested for trespassing in Marion and expressed concerns about their growing presence in Cedar Rapids. This email highlights the involvement of local officials in Pelley’s defense while underscoring the contentious nature of the allegations. Supporters of Pelley view the mayor’s response as validation of his claims, whereas critics argue it raises further questions about transparency, accountability, and the perceived attempt to stifle public discourse. Further complicating the narrative, articles from theCedar Rapids Gazette—dated February 11, 1993, July 17, 1993, and March 20, 1994—detail the original felony sexual abuse charge against Pelley, which was later reduced to a misdemeanor. These articles provide critical context for understanding the allegations at the center of this lawsuit. According to defendant Melissa Duffield, who addressed the matter during a viral TikTok video and at a Cedar Rapids City Council meeting, these articles were allegedly scrubbed from easily accessible public archives, making them difficult to locate. Duffield’s claims, along with the resurfaced articles, highlight a growing public interest in reconciling Pelley’s legal history with his current public and professional role. The inclusion of these records in the lawsuit underscores the tension between correcting misinformation and restricting public dialogue about a figure with documented criminal and professional controversies. #BUTTCRACKNEWSNETWORK#WAKEUPCR#FIGHTCORRUPTION#STANDFORLIGHT#CITYCORRUPTION@buttcracknewsnetwork @FlexYourFreedoms@Ajai Dittmar @baesym February 11th 1993 July 17th 1993 March 20th 1994 **Is the Lawsuit About Reputation or Truth?** By seeking monetary damages for reputational harm and emotional distress, alongsideinjunctive relieftostop the defendants from speaking about him, Chad Pelley’s lawsuit raises important First Amendment concerns. Courts are generally reluctant to grant injunctions thatrestrict speech, as such orders can be viewed asprior restraint, a violation of free speech protections. Critics argue that Pelley’s legal action appears focused on silencing detractors rather than confronting the substance of their claims. While exaggerated or false statements may warrant legal scrutiny, the lawsuit notably avoids addressing Pelley’sdocumented criminal historyand other verifiable facts that form the foundation of much of the defendants’ commentary. This omission risks framing the case not as an effort to correct misinformation but as a broader attempt to suppress critical speech. If Pelley truly sought justice, critics contend, he would focus on disproving false claims while acknowledging facts rooted in public records, rather than pursuing legal remedies that could chill free discourse. **The Role of Public Interest** As a developer involved in significant community projects and a recipient of public funds, Pelley’s actions are inherently subject to public scrutiny. Over the years, Pelley has been connected to several notable development projects in Cedar Rapids and Marion, many of which have benefited from substantial tax incentives: Fulton Lofts Project: This $10 million, four-story development in Cedar Rapids’ NewBo district includes residential units and commercial spaces. The project applied for Workforce Housing Tax Incentive credits from the Iowa Department of Economic Development, which would require matching funds from the city. “The projectalsoqualifies for incentives under the city’s targeted district reinvestment program based on its location in the NewBo district, Cedar Rapids economic development director Caleb Mason told the council. The city also plans to utilize an “above standard incentive program” for the project, under which the standard city incentive of a 10-year, 100% tax abatement is deemed inadequate to make the project financially feasible..”Corridor Business Green Park Apartment Living: A multi-family residential project in Marion, awarded Workforce Housing Tax Credits from the Iowa Department of Economic Development in October. The development includes a 69-unit building along 10th Avenue and a 78-unit building along 31st Street.Corridor Business TheKingston Landing Developmentin Cedar Rapids is a significant project that has garnered substantial public support through tax incentives. In September 2021, the Cedar Rapids City Council unanimously approved a term sheet for the $71 million mixed-use development, which includes:–Tax Increment Financing (TIF): The project is set to receive an 85% reimbursement of TIF rebates over a 20-year period for each building constructedCorridor Business–Plaza Completion Grant: A one-time grant of $1.5 million will be provided upon the completion of the central plaza area within the development.Khak These incentives are designed to stimulate economic growth and urban revitalization in the Kingston Village area, underscoring the city’s commitment to supporting large-scale developments that enhance community infrastructure and amenities. These projects highlight Pelley’s significant influence on the community’s development landscape and his engagement with public funding mechanisms designed to stimulate economic growth. The allocation of tax incentives to such developments underscores the importance of transparency and accountability, as public resources are utilized to support private ventures. The defendants have pointed to his criminal record and ties to these lucrative city deals as evidence of a pattern that warrants investigation. Public figures, especially those who influence community development, are expected to maintain a standard of transparency, making their character and conduct legitimate matters of public concern. While some of the defendants’ statements—such as those suggesting ongoing criminal behavior or making inflammatory accusations—may cross the line into exaggeration, others appear rooted in verifiable public records. This distinction underscores the importance of separating legitimate criticism from defamatory or malicious intent. Balancing Privacy and Accountability Pelley’s claims of invasion of privacy hold more weight, particularly regarding the dissemination of sensitive personal information, such as his social security number. Sharing such data would be a clear violation of privacy, regardless of the public interest involved. However, many of the defendants’ statements relate to public records, which are legally accessible and commonly used to hold public figures accountable. The court will need to balance Pelley’s right to privacy with the defendants’ First Amendment protections. The outcome will likely hinge on whether the defendants acted with malicious intent or simply exercised their right to critique a public figure. Conclusion Chad Pelley’s lawsuit presents a complex clash between reputation management and public accountability. While he raises valid concerns about potential privacy violations and / or defamatory exaggerations, the broader focus of his case on defamation—without addressing documented facts—leaves room for skepticism about his intentions. The defendants, for their part, argue that their statements are rooted in public records and reflect legitimate concerns about Pelley’s role in the community. As this case progresses, it will serve as a test of how public figures navigate criticism and legal action in the digital age. For Pelley, it is an opportunity to expose any exaggerated claims and legitimate concerns. For the defendants, it underscores the importance of balancing free speech with responsible commentary. Ultimately, the court’s decision will set an important precedent for how public discourse and accountability are managed in an era of instant and widespread communication. This article is part of ongoing series of stories covering this local story and legal developments. If you have insights or additional information, please contact us to improve accuracy. Latest Popular Videos **Chad Pelley Lawsuit in Shambles – Free Speech Win Relieves Bailey Symonds, Strips Injunction** **Chad Pelley Lawsuit in Shambles – Free Speech Win Relieves Bailey Symonds, Strips Injunction** **Chad Pelley Denied: Free Speech Injunction Hearing to Proceed Friday in Linn County** **Chad Pelley Denied: Free Speech Injunction Hearing to Proceed Friday in Linn County** **Chad Pelley’s Lawsuit: Free Speech Under Siege in Iowa** **Chad Pelley’s Lawsuit: Free Speech Under Siege in Iowa** **Chad Pelley’s Lawsuit: Damage Control or Accountability?** **Chad Pelley’s Lawsuit: Damage Control or Accountability?** **President Donald Trump 45 – 47** **President Donald Trump 45 – 47** **Chad Pelley Lawsuit in Shambles – Free Speech Win Relieves Bailey Symonds, Strips Injunction** **Chad Pelley Lawsuit in Shambles – Free Speech Win Relieves Bailey Symonds, Strips Injunction** **Mass Shootings: The Roots pt. 3** **Mass Shootings: The Roots pt. 3** **Truth Unraveled: Florida School Shooting** **Truth Unraveled: Florida School Shooting** **Seemingly Anti-Semitic Comments Made By D.C. Councilmen Forces An Apology** **Seemingly Anti-Semitic Comments Made By D.C. Councilmen Forces An Apology** Home News Videos Digi-Mag Store Copyright © 2018 Populist Wire. All Rights Reserved. **Donate to Populist Wire** Donation Amount* Δ"}