{"id": 1605, "name": "WorkScoop", "domain": "workscoop.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://workscoop.com/2021/06/25/state-officials-say-theyre-expanding-broadband-quicker-better-and-faster-than-feds", "title": "State Officials Say Theyre Expanding Broadband Quicker Better And Faster Than Feds", "content": "FedScoop DefenseScoop CyberScoop StateScoop EdScoop WorkScoop TopicsBackTechPolicyCultureTraining Tech Policy Culture Training Tech Policy Culture Training Events Videos Jobs Advertise FedScoop DefenseScoop CyberScoop StateScoop EdScoop WorkScoop Tech **State officials say they’re expanding broadband ‘quicker, better and faster’ than feds** ByRyan Johnston June 25, 2021 States are rolling out new broadband connectivity programs in their rural communities faster and more efficiently than the federal government, despite a lack of clarity and communication between the two levels, according to a panel of state legislators and broadband officials that met this week at an event hosted by The Pew Charitable Trusts. The $350 billion in state and local stimulus contained in theAmerican Rescue Planenacted in March can be used for broadband, if states choose to do so. The plan also included another$7.1 billion in emergency broadband relief, which the Federal Communications Commission authorized last month. Separately on Thursday, President Joe Biden and a bipartisan group of senators agreed on a framework for an infrastructure spending package, including $65 billion for broadband. But these federal plans often include confusing rules that restrict states from using money how they’d like to, as well as outdated standards, frustrating people like Tamarah Holmes, the director of Virginia’s broadband office. “There’s been a disconnection between federal and state governments,” Holmes wrote StateScoop in an email. “We’ve invested significantly in addressing the digital divide in Virginia, and we’re three times more efficient than the federal programs in terms of our investments and the number of folks we get connected through investments the Commonwealth has made.” Holmes, like her counterparts in other state broadband offices, has led efforts to connect the last mile of fiber to rural homes that were previously wholly unserved by broadband providers. The FCC’s Rural Digital Opportunity Fund auction late last year made some regions of Virginia eligible to be bid on by telecommunications firms, despite the fact that Holmes’ office had already lined up investments, with state money, to provide service in those areas, she said. The RDOF auctionhad other hiccups, but Holmes said the lack of communication has caused headaches for her and the state’s internet service providers. “There was no vehicle for us at the state to go to the FCC and say ‘hey, we’re actually investing money in these areas that you made eligible for RDOF, how can we make sure that they’re removed from eligible locations?’ she said. “And we tried, but now we have providers that have won these locations through RDOF and we’re trying to help them figure out how they can legally forfeit these areas without any penalty.” But the FCC’s standard for what counts as “served” as isn’t good enough either, said Teresa Ferguson, the Colorado director of federal broadband engagement. “The reality is as long as we continue to use a backwards-looking metric of 25 megabits down and 3 megabits up as the definition of broadband, then our federal agencies are going to continue to put us in this bowling-alley lane of where we can put investment and build infrastructure. That’s a problem,” she said. Ferguson echoed Holmes’s claims that states have been better than the federal government in connecting their own residents. “States are doing it quicker, better and faster,” Ferguson said. “We are rolling out fiber-to-the-home or fixed-wireless of significant bandwidth at a half or a third of the cost [of the federal government] in under two years.” Even when the two parties can work in concert, the 25/3 standard “has got to die,” Ferguson said, and it’s the federal government’s job to replace it with a higher standard of connectivity. Ferguson cited rural ranchers and farmers who suffer from a lack of connectivity, while West Virginia State Sen. Robert Plymale said he was hard-pressed to find a region of West Virginia that was adequately served. “[The 25/3 standard led the state being] so woefully underserved that I can’t find an area of West Virginia that is properly served, to be quite honest,” Plymale said. “When you start thinking about 25/3 as the standard they set in 2012, we found through the pandemic that that wasn’t even high enough to do anything.” West Virginia Virginia broadband Colorado Facebook LinkedIn Twitter Copy Link **More Like This** North Carolina launches digital equity and literacy officeByRyan Johnston **North Carolina launches digital equity and literacy office** **North Carolina launches digital equity and literacy office** Bloomberg Philanthropies to fund digital innovation teams in six citiesByRyan Johnston **Bloomberg Philanthropies to fund digital innovation teams in six cities** **Bloomberg Philanthropies to fund digital innovation teams in six cities** West Virginia’s CTO gets new title, more authorityByColin Wood **West Virginia’s CTO gets new title, more authority** **West Virginia’s CTO gets new title, more authority** **More Scoops** **North Carolina House passes ‘historic’ broadband investment** **Collaboration is key for state broadband officials** **State and local officials don’t trust ISPs to close digital divide, poll finds** **Virginia announces $29M broadband expansion** **Delaware targets underserved families with $20 million broadband investment** **Latest Podcasts** **Tech** Texas AI center boosts efficiency, workforce Want to fix unemployment systems? Try the Domino's model Lawmakers look to create cyber training programs at CISA, VA Columbus, Ohio, readies 'Smart Columbus 2.0' **Training** TikTok wants to promote cybersecurity education IBM names recipients of K-12 cybersecurity grants Alabama State U. announces $300K cybersecurity diversity grant New Google program offers digital skills to formerly incarcerated adults **Culture** Bill to create federal rotational program for cyber experts passes to House floor DOD to embed data experts within combatant commands HHS launches $80M public health IT workforce program promoting equity AI-supported ‘superteams’ key to future of federal workforce: Deloitte **Policy** Florida selects data vendor for workforce education push Veteran Justice official who oversaw cybercrime cases to step down Biden cyber nominees Easterly, Inglis describe ransomware as urgent national security threat Biden calls for tech modernization to boost workforce at national security, foreign policy agencies FedScoop DefenseScoop CyberScoop StateScoop EdScoop WorkScoop Newsletters Advertise with us Ad specs (202) 887-8001 hello@workscoop.com fb tw in ig"}