{"id": 536, "name": "Frontiers in Developmental Psychology", "domain": "frontiersin.org/journals/developmental-psychology", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/developmental-psychology/articles/10.3389/fdpys.2025.1554122/full", "title": "Developmental Psychology", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Adolescent Psychological Development Cognitive Development Development in Infancy Social and Emotional Development Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Adolescent Psychological Development Cognitive Development Development in Infancy Social and Emotional Development Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Adolescent Psychological Development Cognitive Development Development in Infancy Social and Emotional Development Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Dev. Psychol., 07 May 2025 Sec. Adolescent Psychological Development Volume 3 - 2025 |https://doi.org/10.3389/fdpys.2025.1554122 This article is part of the Research TopicContemporary Issues in the Study of Adolescent Gender DevelopmentView all articles **Who should I listen to? Gender and age effects in how group norms relate to adolescents' intergroup relations and prejudiced attitudes** 1Department of Human Development and Family Sciences, University of Connecticut, Storrs, CT, United States 2Department of Psychology, Siena College, Colonie, NY, United States Introduction:When thinking about intergroup exclusion, adolescents weigh prosociality and fairness with the influences of their families and peers. However, research has yet to address whether these group norms influence youth similarly across gender and age. The current study addresses this gap in the literature by assessing and interaction between subjective outgroup norms and developmental period on youth's evaluations of exclusion and their justifications for those evaluations, and does so within an understudied dynamic between Jewish American and Arab American adolescents. Methods:This study assessed whether gender and age moderate the influence of parent and peer outgroup attitudes on 241 Jewish American 9thgraders' (MAge9thGrade= 14.18; SD = 0.42) and 12th (MAge12thGrade= 17.21; SD = 0.43) acceptance and reasoning about intergroup exclusion toward Arab American peers. Results:Results revealed that gender was associated with the malleability to influence of 9thgraders' attitudes, whereas their 12thgrade counterparts were unaffected. Furthermore, positive peer groups served as a buffer against the detrimental effects of parents' prejudiced attitudes. Discussion:Age and context play a meaningful role in adolescents' evaluation and justifications of outgroup social exclusion. These findings contribute to the understanding of the development of prosocial reasoning and behaviors in adolescence. **Introduction** “This is the infiltration of the Arabic-Muslim coming in and destroying America. The Muslims are nothing but devil-Satan worshippers” (CNN, 2018). These prejudiced and hateful words can be heard from adults while vandalizing a mosque in Arizona, United States. While this hate crime reached several major news outlets (e.g.,Sidner and Simon, 2018;Abdelaziz, 2018), critics were most vocal about the effect of this incident on the children accompanying the perpetrators. The children in the video could also be heard spouting hurtful comments, like “Mommy, they buy their chicken to rape it” or “They smell like goat,” about the Muslim community, encouraged by their mothers (seeSidner and Simon, 2018). Similar slurs are slung by youth to their peers at markedly increasing rates over the past years, and especially since the October 7thHamas attack on Israel and ongoing violence in Gaza. These events have had a global impact on intergroup relations for youth. Arab American teenagers report having been called a “terrorist” by adults and peers or accused of being responsible for deaths of children in the Middle East (Fugardi et al., 2024); they also report being told Islamic beliefs are “peace-hating” (Tahseen et al., 2019). These stories underscore the importance of understanding the roles of familial and peer norms in prejudiced attitudes and discriminatory behaviors among youth populations (Brenick and Romano, 2016;Miklikowska et al., 2019;Reynolds et al., 2015). Peer- and family-based social groups are of the utmost importance during adolescence (McKeown and Taylor, 2018;Miklikowska et al., 2019). Throughout childhood and adolescence, parents are a source of ingroup norms about victimizing behaviors overall and bias-based social exclusion specifically (Saudi Arabia:Alsamih and Tenenbaum, 2018; Arab American & Jewish American:Brenick and Romano, 2016; Palestinian Citizens of Israel & Jewish-Israeli:Tadmor et al., 2017). Peer groups, however, become increasingly influential in adolescence, and serve as another potential avenue from which youth internalize attitudes, beliefs, and behaviors (Brechwald and Prinstein, 2011;Laursen and Veenstra, 2021). As adolescents come to identify themselves as members of different social groups—a major developmental task in adolescence (Erikson, 1968;Umaña-Taylor et al., 2014;Verkuyten, 2022)—they quickly learn and are socialized to the groups' norms. Group norms define the shared behaviors, attitudes, values, and beliefs that unite group members as a whole (Davies et al., 2013;Donlan et al., 2015;Duffy and Nesdale, 2009;Reynolds et al., 2015). Youth internalize the intergroup expectations and norms of their ingroup, and adolescents' prejudices are molded by the perceived normative attitudes of those around them (Abrams et al., 2009;Davies et al., 2013;Jasinskaja-Lahti et al., 2011;Rivas-Drake et al., 2019). Youths' peer and family contexts may also support the development of prosocial attitudes in youth. For example, youth may reject discrimination when peers' and parents' attitudes about the outgroup are inclusive and prosocial (Brenick and Romano, 2016;Zagrean et al., 2022). In peer settings, such as schools or neighborhoods, youth are more influenced by group norms established by peer counterparts; whereas parents and family members' group norms are more salient in a family home context (Brenick and Romano, 2016). During adolescence, parent influence also decreases, albeit, with cisgirls sustaining greater importance of parent influences than cisboys, who are influenced more by peers (Berger et al., 2011;Berndt, 1979;Collins and Laursen, 2004a,b). Similar findings have been replicated in related bodies of work concerned with peer influence in a variety of anti- and prosocial behaviors (e.g.,McCoy et al., 2019;Walters, 2020;Zagrean et al., 2024a,b); and in literature focused on gender differences in parental influence (e.g.,Barni et al., 2022;Fleming, 2005). However, the gender differences and contextual weight in in/exclusion decisions remains understudied. The current study examined the role of participant age and gender in the patterns of influence of peer and parent outgroup norms on Jewish-American adolescents' prosocial evaluations of intergroup in/exclusion. **Theoretical backings** As a theoretical basis for the current research, the social reasoning developmental perspective (SRDP;Rutland and Killen, 2015) draws on theories of developmental subjective group dynamics (Abrams et al., 2003) and social identity development (Nesdale, 2017;Verkuyten, 2022;Tajfel and Turner, 1986). Developmental subjective group dynamics posits that children differentiate between both ingroup and outgroup members who express deviant attitudes from the ingroup vs. members who express normative ingroup attitudes; and that with age, older children are more oriented toward adhering to group norms and keeping ingroup functioning in mind when making decisions regarding outgroup member inclusion (Abrams and Hogg, 2017;Abrams and Killen, 2014). The complementary social identity development perspective suggests that, with increasing age, children turn to peer groups for self-identity and affiliation and are likely to adopt and propagate the ingroup norms established by the peer group (Juvonen and Galvan, 2008;Nesdale, 2017;Verkuyten, 2022). The desire to be viewed positively by ingroup members, acquire a sense of belonging, and avoid rejection is of utmost importance to youth, particularly adolescents and as a result, older youth are less likely to diverge from ingroup normative attitudes than their younger counterparts (Juvonen and Galvan, 2008;Verkuyten, 2022). In congruence with the progression seen in the developmental subjective group dynamics research, the significance of social group cohesion in identity development increases with age, and intergroup exchanges are colored by perceptions of ingroup functioning (Verkuyten, 2022). In addition, morality is an important factor to consider when examining intergroup behaviors. The SRDP suggests that adolescents weigh the competing concerns of prosociality and fairness, with group identity, norms, and attitudes when evaluating and responding to intergroup social exclusion (Rutland and Killen, 2015). SRDP theoretically and methodologically frames the examination of the influences of moral reasoning and group processes on evaluations of social exclusion in this study. SRDP researchers assert that group identity, social conventions, and norms, as well as moral principles, all influence evaluations of intergroup exclusion (Rutland and Killen, 2015). Additionally, when adolescents justify intergroup exclusion, their reasoning typically appeals to societal concerns (e.g., social-conventions, intergroup stereotypes), often conveyed through group norms (Brenick and Killen, 2014). The SRDP will be utilized as a lens through which to explore the role of social group (parent and peer) norms on adolescents' moral reasoning and social exclusion behaviors. **Social exclusion** Adolescence is a period when social exclusion among peer groups occurs frequently (Laursen and Veenstra, 2021;Waasdorp and Bradshaw, 2015), especially in schools, neighborhoods, and other relevant social contexts. Outgroup members who do not follow norms, or deviate from the ingroup, may be excluded from participating in the group (Laursen and Veenstra, 2021). Ingroup members who challenge the views of their group may also be at risk of exclusion (seeAbrams and Hogg, 2017;Bennett, 2014;Juvonen and Galvan, 2008;Verkuyten, 2022). Situations of social exclusion yield numerous opportunities for adolescents to understand maintenance of group norms, status, and membership. More specifically, youth are also tasked with contemplating their own individual views, expectations of their peer group, and moral concerns of fairness and equality (Grütter et al., 2021;Rutland and Killen, 2015). Considering moral concerns about social exclusion is of value, as exclusion based solely on group membership causes significant individual and social group harm and inequity (seeBrenick and Halgunseth, 2017;Rutland and Killen, 2015). Experiencing social exclusion is associated with several negative outcomes for adolescents, such as diminished school performance, peer relationships, and wellbeing (Hysing et al., 2021;Torres et al., 2020). In some cases, victims of social exclusion may feel a sense of pain similar to experiencing actual physical pain (Eisenberger, 2013). Adolescent transgressors of intergroup exclusion are also at risk into adulthood of developing prejudiced attitudes, discriminatory behaviors, and perpetuating social and economic inequalities (seeRutland and Killen, 2015). Conversely, including an outgroup member (e.g., race, ethnicity, culture)—specifically, engaging in cross-group friendships—is an effective means to reduce prejudice (Berger et al., 2018;Davies et al., 2013;Tropp et al., 2022), and can promote the use of more inclusive and prosocial moral reasoning (Boin et al., 2021;Brenick et al., 2019;Tropp et al., 2022). Children's inclusive peer norms are a strong predictor of motivation to engage in cross-racial friendships, above and beyond exclusion norms within peer groups (Trifiletti et al., 2024;Tropp et al., 2022). Examining the complex process of social reasoning (e.g., negotiations between the competing demands of fairness and ingroup distinction) that adolescents apply when evaluating group-based exclusion, can shed light on ways to reduce the likelihood that group-based exclusion in adolescence will develop into discrimination and prejudice in adulthood. **Jewish American and Arab American adolescent relations** Within this paper, we focus on the Jewish and Arab intergroup relations within the U.S. More specifically, we explore the influential contexts on Jewish American's inclusion and exclusion decisions regarding an Arab American peer. It is important to acknowledge the salience of Jewish and Arab relations on a global scale. Especially in Israel and Palestine, ongoing violence has shaped global perceptions; particularly for American youth (Silver, 2024). Presently, Jewish American and Jewish Israeli youth exist within starkly distinct realities. While these Jewish communities are related, they are largely unique. Our paper focuses on Jewish American adolescents to better understand their social reasoning and exclusion decisions about Arab American peers because of prominent victimization experiences that do occur in the U.S. Arab Americans experience high rates of prejudice and discrimination (Sirin et al., 2021). In the U.S., non-Arab groups are often reluctant to interact with Arab individuals (Jenkins et al., 2012), appealing to anti-Arab stereotypes (Hitti and Killen, 2015). Additionally, negative intergroup interactions between Jewish and Arab groups have been documented in the United States (Brenick and Killen, 2014;Dessel and Ali, 2012;Panagopoulos, 2006). Since the most recent escalation of asymmetrical war in the Middle East starting in October of 2023, hateful and violent incidents toward both Arab and Jewish communities in the U.S. have been rapidly increasing (Anti-Defamation League, 2023;Allison, 2023); and has led to the victimization and deaths of children in the U.S. For example, in the fall of 2023 a Palestinian American boy was fatally stabbed because he was Muslim (Boyette and Allen, 2023). The influence of parent and peer outgroup norms can be especially salient in the Jewish-Arab American context–as youth from these communities may strongly connect with identities steeped in protracted asymmetrical global conflict and history between these two groups. While Jewish Americans can be prejudiced against Arab individuals in a variety of ways, youth may especially engage in discriminatory practices that target their Arab American peers' social standing. For example, Jewish American youth have been shown to endorse exclusion of their Arab American peers from social situations (Brenick and Killen, 2014). Still, how Jewish American youth evaluate the exclusion of Arab American adolescents can vary by the context (e.g., with family, peers) in which exclusion occurs (Brenick and Killen, 2014;Brenick and Romano, 2016). In peer contexts where social inclusion is a norm, Jewish American youth are generally more accepting of Arab American peers–and cite fairness and lack of judgment as justifications for cross-group inclusion (Brenick and Romano, 2016). However, across parent and peer contexts, when negative attitudes about Arab Americans are salient, youths' in/exclusion behaviors reflect that of the contexts' norms and reference disrupted social conventions and ingroup discomfort as reasons to exclude. Antisemitic, anti-Arab, and Islamophobic attitudes and behaviors in the U.S. are reaching historic highs (Arab American Institute, 2024;Kestler-D'Amours, 2024). Understanding how context-dependent patterns of exclusion and justification develop with age or vary by gender is important for understanding individual level variables related to either facilitating or stifling positive intergroup relations between these groups in the U.S. **Group norms on adolescents' exclusion** **Parent outgroup norms** Parents are a fundamental contributor to youth's beliefs and attitudes acquisition. Racial and ethnic socialization literature suggests that parent transmission of identity-related norms, behaviors, expectations is highly influential to youths' own racial-ethnic identity, and that of others (Umaña-Taylor and Hill, 2020), and their prejudiced beliefs (Zagrean et al., 2022). Although the present study focuses primarily on peer group context–as they vary from parent beliefs and norms about groups–the influence of parents in youth's lives as well as the normative attitudes that they uphold should not be minimized.Wenzing et al. (2021)found that both parents and peers provide social and emotional support to youth who experience first-hand discrimination by outgroup members, mediating their overall wellbeing and identity development. Likewise, children and adolescents often look to those in their immediate social networks, including family, when they experience cross-group encounters (Brenick and Romano, 2016;Jasinskaja-Lahti et al., 2011). Information obtained from these sources influence youths' reactions to and assessment of both the outgroup and the encounter itself. Therefore, peer and parent norms relate to youths' interpretations of intergroup encounters, and can bias youths' attitudes concerning an outgroup. **Peer outgroup norms** As individuals age, begin to navigate their social surroundings, and develop their social identities, they will undoubtedly experience intergroup situations in which they are forced to decide whether they subscribe to norms that are perpetuated by their ingroups. For example, adolescents learn what is valued as normative and preferred by their peers, and then act accordingly (seeBrechwald and Prinstein, 2011;Donlan et al., 2015). In this way, peers can influence both positive and negative social behaviors and attitudes in adolescents—particularly younger adolescents (Laursen and Veenstra, 2021;van Hoorn et al., 2016;Steinberg and Monahan, 2007). Corroborating earlier findings,Brenick and Romano (2016)found that context specific inclusion and exclusion-based group norms are of the utmost importance in adolescents' evaluations of engagement in cross-group friendships. Specifically, the authors found adolescents who perceived their peers (other Jewish Americans) to regard an outgroup (Arab Americans) in a positive manner, to be more likely to include these individuals in group-based social interactions with them, based on moral reasoning justifications. Likewise, context non-specific sources of perceived group norms emerged as well, such that the influence of peers proved to have a significant impact on adolescents' willingness to either include or exclude outgroup members in a familial context (e.g., at a family party in their home). These findings may be due to the increasing importance of perceived peer intergroup norms and identity that peak during adolescence (Abrams et al., 2009;Brenick and Killen, 2014;Horn, 2005). Group norms might not only produce ingroup bias—or preference for fellow ingroup members—they may also make group members more inclined to differentiate themselves from outgroups through the implementation of negative attitudes and behaviors (seeNesdale and Brown, 2004). Consequently, adolescents may seek to uphold norms of groups with which they affiliate in an effort to increase their sense of belonging. Deviating from the group norm may also be grounds for one's own exclusion from an ingroup (Abrams and Rutland, 2008).Killen et al. (2013)found that, developmentally, mid-adolescents considered group-specific norms—those pertinent to a smaller, more immediate group, such as a social clique—to be more important than did younger children, and that deviating from social-conventional group-specific norms was considered less acceptable. **Age interactions** Up to the time of middle childhood, parents play the most influential role in the development of children's attitudes and behaviors (Fuligni and Eccles, 1993). As individuals age, they begin to venture out and explore their social surroundings, leading to interactions with others who may hold attitudes and beliefs that differ from those perpetuated in their homes. During early adolescence, there is a heightened importance of peer groups, burgeoning of friendships, and an intensifying process of identity development (Erikson, 1968;Umaña-Taylor et al., 2014). Time spent with peers increases from middle childhood to adolescence (Lam et al., 2014), and an ecological systems perspective suggests that peer contexts facilitate social reasoning via microsystemic forces (Bronfenbrenner, 1989). As stated earlier, both social identity development and SRDP theorize that with age peers begin to serve as a primary group context for which ingroup norms are established and practiced (Abrams and Hogg, 2017;Verkuyten, 2022). These processes may be further complemented by whatLaursen and Veenstra (2021)call deindividuation, or “a process whereby adolescents seek to establish unique identities through behaviors and attitudes that set them apart from parents,” (p. 892). Through deindividuation, adolescents create space between their parents' beliefs and their own; and seek to reduce the ideological distance between themselves and their peers (Laursen and Veenstra, 2021) to derive a sense of identity (Rutland and Killen, 2015). This amalgamation of developmental processes leads to the increased influence of peers (Abrams et al., 2009;Killen et al., 2013). The effects of age are both complex and multifaceted. Some studies demonstrate the general tendency of older children, in contrast to younger children, to adhere to group norms (Abrams and Rutland, 2008;Nesdale, 2007).Nesdale and Brown (2004)illustrated more nuance in their findings, in that older children were more likely prioritize ingroup norms over ingroup membership and thereby accept outgroup members who upheld the same ingroup norms as them in comparison to deviant ingroup members. These findings are of particular importance because youth are influenced by a variety of peer group norms, including those that promote aggressive behavior (Laursen and Veenstra, 2021). Furthermore, children have been known to prefer individuals who express loyalty to both a specific social group and the norms it propagates and have greater aversion toward individuals who do not uphold these norms (Abrams and Hogg, 2017;Abrams and Rutland, 2008;Mulvey and Killen, 2017). Not only can group norms produce ingroup bias as a result, but they can also make group members more inclined to differentiate themselves from outgroups through the implementation of negative attitudes and behaviors (Nesdale et al., 2005).Mulvey et al. (2014)postulate that, at times, negative actions toward an outgroup are an attempt to maintain ingroup solidarity. In SRDP, it is asserted that these inclinations to reinforce in- and out-group boundaries are increasingly informed by an adolescents' peer group (Abrams and Hogg, 2017). Consequently, social norms have an increased effect on outgroup attitudes during adolescence (Brenick and Romano, 2016;Jasinskaja-Lahti et al., 2011;Smith and Minescu, 2021). As a source for deriving an understanding of social norms, exploration and adherence to ethnic and cultural identities have been found to remain stable over the course of the adolescent years (Kiang et al., 2010;Umaña-Taylor et al., 2014). Meanwhile, other assessments have yielded findings that suggest either non-linear (Branje et al., 2021) or decreasing trends in ethnic and cultural identity persist (Huang and Stormshak, 2011). Additional work is warranted to explicate these developmental trends, especially amongst Jewish and Arab American youth. **Gender interactions** The extant literature on the relationship between cross-group friendship decisions and gender is limited and has yielded conflicting findings about its salience. Some assessments suggest girls are less likely to accept outgroup exclusion than their boy counterparts (Brenick and Killen, 2014;Brenick and Romano, 2016;Hitti et al., 2016). This may be associated with the tendency for adolescent girls to develop perspective-taking and empathetic concerns at earlier onsets than boys (Van der Graaff et al., 2014). Further, girls and women have historically been treated as inferior to boys and men within U.S. society, encouraging them to empathize with outgroup members to a greater extent than the latter subgroup. On the other hand, others suggest that while gender is an important variable to consider in cross-group relationship decisions, gender holds secondary importance to the role of group norms in evaluations of outgroup in/exclusion. For example,Killen et al. (2013)assessed how youth respond to deviance from group norms, as an effect of one's gender. Children and adolescents were asked to evaluate peer groups that either maintained conventional norms concerning dress, or moral norms based on the distribution of resources. Findings indicate that gender played a secondary role to the primacy of upholding group norms. Specifically, participants were more inclined to include those who differed in terms of gender but who upheld the norm of the group. Another study byMulvey et al. (2014), found that older children (13–14 years old) were more concerned with their group identities (gender), as well as the overall functioning of the group, than was the case in younger children (9–10 years old). However, when the groups upheld moral (vs. conventional) norms, there were no differences in ingroup preference with regard to gender. Further, when social-conventional norms were utilized, a greater ingroup preference arose in the school intergroup context in comparison to that of the gender intergroup context. Collectively, these assessments suggest that additional work is warranted to discern the exact effects of gender within cross-group evaluation decisions. **The current study** Brenick and Romano (2016)found that both perceived peer and parent outgroup norms were significantly related to youth's ratings and reasoning about intergroup exclusion in their relevant contexts. The authors also agree that future research in this area should assess whether the influence of peer group and parent norms is moderated by age. The current study addresses this gap in the literature by assessing and interaction between subjective outgroup norms and developmental period on youth's evaluations of exclusion and their justifications for those evaluations, and does so within an understudied dynamic between Jewish American and Arab American adolescents. In line with research showing that positive perceived peer outgroup norms are associated with higher rejection of intergroup exclusion (e.g.,Brenick and Romano, 2016) and that peer group norms are more salient for older children compared to younger children (Abrams and Rutland, 2008;Nesdale, 2007), we hypothesized that developmental period would significantly moderate the relationship between perceived peer outgroup norms; a stronger effect of peer outgroup norms would appear for the 12th graders compared to their 9th grade counterparts. As peer influence increases in importance in comparison to parent influence (Laursen and Veenstra, 2021), we hypothesized that that the effect of parent outgroup norms would appear to be stronger for 9th graders compared to 12th graders. Additionally, the current study assessed whether the impact of peer and parent outgroup norms on Jewish American youth's ratings and reasoning about exclusion is different for cisboys and cisgirls. Prior research has shown that adolescent boys are influenced more by peers and females by parents (Berger et al., 2011;Berndt, 1979;Collins and Laursen, 2004a,b;McCoy et al., 2019). Thus, it was hypothesized that the effect of peer outgroup norms would appear to be stronger for cisboys, while the effect of parent outgroup norms would be stronger for cisgirls. **Methods** **Participants** This study included 241 Jewish American mid- (n= 133;Mage= 14.18 years;SD= 0.42) to late- (n= 108;Mage= 17.21 years;SD= 0.43) adolescents (MageTOTAL = 15.70 years;SD= 1.57). Prior to completing this study, we conducted a power analysis with G*Power 3 software (Faul et al., 2007). The results found that a sample of 153 participants was required to achieve 95% power for detecting a significant effect at α = 0.05, indicating that our sample size was sufficiently powered. This sample was evenly divided by gender (120 cisgender girls and 121 cisgender boys). Participants were sampled from three religious-based Jewish day schools in the Mid-Atlantic region of the United States. **Procedure** In the initial stages of this study, the principal investigator reached out to Jewish day schools in the community with whom they had connections but had not previously conducted research studies with. After approval from the school principals, teachers and guardians were informed of the research goals. Using a passive consent structure, guardians were provided with consent forms detailing the study and participation and were asked to return the form if they did not approve their child to participate. No parents reached out to the research team with questions or reservations about the study or their child's participation. On the day of survey administration, a team of trained research assistants visited schools to obtain participant assent and administer a paper-based survey about social attitudes toward intergroup relations. Informed assent was obtained from all participants (only three students chose not to complete the survey). At each school (M= 3 classes per grade, per school), all 9th and 12th graders were invited to participate. The research assistants informed students about the study goals and participation in accordance with IRB guidelines before administering the survey. Students were informed that their answers to the survey would be kept confidential, that their participation was voluntary, and they could stop participating at any time. Students were also encouraged to be honest and told that there were no right or wrong answers. The research team oversaw the survey administration and were available to answer questions and provide assistance if any student experienced distress. There were no instances of student distress during the survey administration. Additionally, all participants were provided with a list of resources in their schools, local communities, and nationwide (e.g., suicide hotline) in the event they experienced distress at a later point in time. After immediate debriefing in the classroom, schools were provided with reports of the findings and, in some cases, presentations were made upon the school's request. **Measures** A cross-sectional survey depicting hypothetical scenarios of social exclusion, was used to assess youth's acceptance/rejection of social exclusion (judgments) and their reasoning about social exclusion (justifications). In line with 40 years of research in the social domain perspective, these scenarios involve what has been shown to be, prototypical experiences of youth in which they would weigh competing domains of social knowledge (i.e., moral, societal, psychological;Smetana, 2013). This approach has been used world-wide across cultures, religions, and other relevant social characteristics (Nucci, 2008), including in the Middle East with Jewish Israeli and Arab participants (e.g.,Alsamih and Tenenbaum, 2018;Brenick et al., 2010;2019;2024;Wainryb, 1995). In addition to developing these scenarios in line with the body of work on social domain theory, the scenarios were pilot tested to assess their ecological validity with the current sample. The hypothetical scenarios depicted a Jewish youth excluding an Arab peer from a social event in two distinct contexts: a peer get-together at the movie theaters (peer) and a family coordinated event at Jewish youth's home that peers could be invited to (home). Finally, participants' cultural identification and perceptions of their parents' and peers' normative beliefs toward Arab community members were assessed in the survey. For each exclusion scenario, participants were asked how good or bad (1 = very bad, 6 = very good: lower values represented more prosocial ratings) it is to exclude the Arab youth from the event when no reason was given (undifferentiated exclusion) as well as when the reason for exclusion was based specifically on the Arab youth's ethnic outgroup membership (group-based exclusion). Conversely, participants were asked how good or bad it would be if the Jewish youth insteadincludedthe Arab peer (inclusion). An additional question asked participants who the Jewish scenario character should include. a Jewish peer or an Arab peer (inclusion decision). Next, participants were asked to provide justifications for their ratings of exclusion, inclusion, and inclusion decisions. Participants provided up to three justifications in the form of open-ended responses. All open-ended response data were coded by the principal investigator and three trained research assistants. The responses were coded as either moral, moral-prejudice, and social-conventional based on the Social Reasoning Developmental Perspective (Rutland et al., 2010). Inter-rater reliability was calculated between each pair of coders on 26% of randomly selected surveys. Any disagreements between coders were discussed until consensus was reached. Cohen's kappas ranged from 0.96 to 0.97, indicating high levels of inter-rater agreement. Once the codes were reliably reported, a value for each of the three justifications was proportioned (e.g., 1 = 33%, 2 = 66%, 3 = 100%) out of the total justifications provided. A measure for cultural identity (using a five-point scale: 1 = strongly agree to 5 = strongly disagree) was created using items from the Multigroup Ethnic Identity Measure (Phinney, 1992) and EIS (Nesdale, 1997). For more information on this process see (Brenick and Romano, 2016). Three cultural identity factors were derived from participants' responses to this measure: commitment (a = 0.90), exploration (a = 0.76), and concern for relationships (a = 0.74). Using a 6-point scale (1 = very negative, to 6 = very positive), participants' perceptions of their peers' and parents' views toward Arab outgroup members were assessed using the question “How would you describe your peers'/parents' attitudes toward Arabs?,” separately for peers and for parents. We intended to capture participants' subjective internalization of their peers' and parents' norms regarding outgroup attitudes as previous research suggests that perception of norms is a powerful indicator of behavioral intent (e.g.,Dumas et al., 2019;Nucci, 2008;Smetana, 2013). **Results** **Plan for analysis I** The first goal of the current study was to understand how perceived parent and peer norms influence Jewish-American adolescents' evaluations of intergroup exclusion across age and gender. To address this, hierarchical regression analyses with each of the four outcome variables (e.g., undifferentiated exclusion, group-based exclusion, outgroup inclusion, & their inclusion decision) were carried out to determine the association between salient social norms, age, and gender, and participants' inclusion/exclusion decisions. For each type of inclusion/exclusion, there was a peer situation and home situation, each with slightly different predictors. There was a total of five models in each regression, and the same predictors were used across the four different outcome variables. The first model included three cultural identity factors as control variables (e.g., commitment, exploration, & concern for social relationships), based on previous research indicating a significant relationship between cultural identity and exclusion evaluations (seeBrenick and Romano, 2016): cultural identity commitment, cultural identity exploration, and cultural identity concern for relationships. The second model included gender (0 = male, 1 = female), grade (0 = 9thgraders, 1 = 12thgraders), and the context specific perceived norm (e.g., perceived peer norm in the peer context). The third model included the secondary source of perceived norms (e.g., perceived parent norm in the peer context). The fourth model included two-way interactions between the context specific perceived norm, grade, and gender. The fifth model included three-way interactions between the context specific perceived norm, grade, and gender. Follow-up analyses for significant effects were carried out using multiple regression analyses for interactions involving continuous variables. Descriptive statistics of participants' cultural identity commitment, cultural identity exploration, cultural identity concern for relationships, parent norms, and peer norms are available inTable 1. Table 1. Descriptive statistics by gender and grade. **Evaluations of undifferentiated exclusion** For undifferentiated exclusion in the peer context, model two was the highest order model of significance,F(3,234)= 4.431,p< 0.01 (seeTable 2for regression coefficients and effect sizes). The significant predictors in the model were cultural identity commitment and perceived peer norm. Jewish-American participants who perceived their peers as having more favorable attitudes toward the Arab outgroup were less accepting, than those who perceived less favorable attitudes, of excluding an Arab adolescent from a movie date with friends. There were no significant interactions between peer norms with grade or gender. Table 2. Multiple regression analysis for exclusion and inclusion evaluations in the peer and home contexts. In the home context, model four was the highest order model of significance in predicting adolescents' attitudes toward undifferentiated exclusion,F(4,229)= 2.38,p< 0.01 (seeTable 2for regression coefficients and effect sizes). The significant predictors in the model were parent norm, gender, and an interaction between parent norm and grade. When no reason for exclusion was specified, females were less supportive than males of undifferentiated exclusion in the home context. Additionally, participants who viewed their parents' attitudes toward the outgroup as more positive, were less supportive of undifferentiated exclusion in the home context. The perceived parent norm effect, however, was qualified by a parent norm-grade interaction. Twelfth graders rejected excluding the Arab adolescent from their family gathering when no reason for exclusion was given, regardless of whether they perceived their parents to hold positive or negative parent norms about the Arab outgroup. However, for the 9thgraders, their acceptance of undifferentiated exclusion varied across levels of perceived parent norms (seeFigure 1). When 9thgraders perceived their parents' norms about the outgroup to be positive, compared to 12thgraders, they were equally rejecting of undifferentiated exclusion of the outgroup member. However, when these participants perceived their parents' norms about the outgroup to be more negative, they were more accepting of excluding the outgroup. Figure 1. Undifferentiated exclusion: Parent norm X grade in the home context. Parent outgroup norms: “How would you describe your parents'/friends' attitudes toward Arabs?” 1 = very negative, 6 = very positive. Undifferentiated exclusion: “How good or bad is it that Leah doesn't invite Sheikha?”1 = very bad, 6 = very good. **Evaluations of group-based exclusion** For group-based exclusion in the peer context, model two was the highest order significant model,F(3,234)= 6.132,p< 0.001 (seeTable 2for regression coefficients and effect sizes). The significant predictors in the model were cultural identity concern for relationships, peer norm, and gender. Participants who perceived their peers' attitudes toward the outgroup as positive were less supportive of exclusion based on the Arab adolescents' background. When the given reason for exclusion was based on outgroup membership, females were less accepting of group-based exclusion than their male counterparts in the peer context. In the home context, the highest order model of significance was model four,F(4,229)= 4.199,p< 0.01 (seeTable 2for regression coefficients and effect sizes). The significant predictors in the model were parent norm, peer norm, an interaction between parent norm and grade, and an interaction between peer norm and parent norm. Attitudes toward group-based exclusion in the home context were less accepting for adolescents who perceived their parents' normative beliefs toward the outgroup as more positive and their peers' normative beliefs as more positive. Furthermore, this association between adolescents' attitudes and their perceived parent norms differed by age. A significant parent-grade interaction, showed that 9thgraders' acceptance of group-based exclusion was much lower in the presence of perceived positive parent norms compared to perceived negative parent norms (seeFigure 2). Whereas for 12thgraders, their acceptance of excluding the Arab adolescent from the family event based on outgroup cultural membership was slightly lower in the presence of perceived positive parent norms compared to perceived negative parent norms. Figure 2. Group-Based exclusion: Parent norm X grade in the home context. Parent outgroup norms: “How would you describe your parents'/friends' attitudes toward Arabs?” 1 = very negative, 6 = very positive. Group-based exclusion: “How good or bad is it that Leah doesn't invite Sheikha [because she's Arab]?”1 = very bad, 6 = very good. Perceived peer norms also moderated the relationship between perceived parent norms and adolescents' attitudes. A significant parent norm-peer norm interaction was found (seeFigure 3). Both adolescents with perceived negative and positive peer norms acceptance of excluding the Arab adolescent based on outgroup cultural orientation, differed across perceived negative and positive parent norms. Adolescents with perceived negative peer norms were more accepting of excluding the Arab adolescent in the presence of perceived positive parent norms, whereas they were less accepting of exclusion in the presence of perceived positive parent norms. For adolescents with perceived positive parent norms, their acceptance of group-based exclusion was lower in the presence of perceived positive parent norms compared to negative parent norms as well, but there was only a slight difference. Figure 3. Group-Based exclusion: Peer norm X Parent norm in the home context. Peer/Parent outgroup norms: “How would you describe your parents'/friends' attitudes toward Arabs?” 1 = very negative, 6 = very positive. Group-based exclusion evaluations: “How good or bad is it that Leah doesn't invite Sheikha [because she's Arab]?”1 = very bad, 6 = very good. **Evaluations of outgroup inclusion** For outgroup inclusion, model two was the highest order model of significance when predicting adolescents' attitudes in the peer context,F(3,234)= 5.76,p< 0.001 (seeTable 2for regression coefficients and effect sizes). The significant predictors in this model were gender and grade. When asked how good or bad it would be to invite the Arab adolescent to an event with their friends, 9thgraders and females were more accepting of including the outgroup member compared to 12thgraders and males. In the home context, the highest order model of significance was the second model,F(3,234)= 10.52,p< 0.001 (seeTable 2for regression coefficients and effect sizes). The significant predictors in model two were gender and grade. Ninth graders adolescents and females were more accepting of outgroup inclusion compared to 12thgraders and males. **Evaluations of adolescents' inclusion decision** The participants of the study were asked whether they should invite a Jewish-American or Arab adolescent to their get-together. Answers to this question were dichotomized (0 = Arab, 1 = Jewish adolescent) and a logistic regression was carried out to predict adolescents' answers to this question using the same predictors as the previous analyses. The peer context analysis for adolescents' inclusion decision did not reveal any significant prediction models (seeTable 3). For the home context, model three was the highest order model of significance,χ(1,240)2= 8.450,p< 0.01 (seeTable 3for regression coefficients and effect sizes). The only significant predictor in this model was perceived peer norms. The effect size of this result is understood through the odds ratio (Rosenthal, 1996). Specifically, the odds for inclusion grow by a factor of 0.61 as perceived peer norms increase. In other words, when asked if they should invite the Arab adolescent or Jewish adolescent to their event, the participants were more likely to invite the Arab adolescent if they perceived their peer norms to be positive toward the outgroup. Table 3. Logistic regression analysis for inclusion decision in the peer and home contexts. **Plan for analysis II** The second purpose of the current study was to understand how Jewish-American adolescents justified their exclusion decisions. Repeated measures analysis of variance was used to assess if the Jewish-American adolescents significantly differed on their decisions for the exclusion/inclusion scenarios, the peer and home contexts, and the justifications used. This ANOVA used a 2 (gender: female, male) × 2 (age: mid-adolescence, late-adolescence) × 2 (context: peer, home) × 2 (reason for exclusion: undifferentiated, group-based) × 3 (justification: moral, moral-prejudice, socio-conventional) model, with repeated measures on the last three variables. Cultural identity commitment, exploration, and concern for societal relations were entered as covariates. Follow-up analyses were carried out by paired samplet-tests to probe significant differences in the use of each justification type by context, reason for exclusion, gender, and grade. Afterwards, regression analyses were carried out to predict Jewish-American adolescents' response rates to their justifications for the undifferentiated and group based exclusion decisions, and their justification for which peer they would invite. The predictors used in these models were the same as the first regression analyses carried out. **Justifications across contexts and exclusion scenarios** For the repeated measures ANOVA, only interactions with justification were interpreted, as the main effects were not of interest to this study. The results indicated that the adolescents differed significantly in their response rates across the justifications they provided,F(2,470)= 18.90,p< 0.00, and the different types of exclusion/inclusion,F(1,235)= 19.85,p< 0.00) (seeTable 3). There were significant two way interactions between justification and scenario,F(2,470)= 9.58,p< 0.00, and justification and question,F(2,470)= 102.23,p< 0.00. The three-way interaction between justification, question, and scenario was not significant. The paired samplet-tests based on the significant two-way interactions showed significant differences in participants' use of the three justification types based on the reason for exclusion. Adolescents' use of all three justification types were significantly different when exclusion was undifferentiated or group-based (seeTable 4). In both the peer and home contexts, the moral, and socio-conventional justifications were used less for the undifferentiated exclusion scenario compared to when exclusion was based on outgroup membership. Conversely, the moral-prejudice justification was used more frequently when exclusion was based on outgroup membership. Table 4. Paired sample t-test on justifications in the undifferentiated and group-based exclusion scenarios. The frequency of use of the moral and moral-prejudice justification types were significantly different when the exclusion scenario was set in the peer or home contexts (seeTable 5). In both the undifferentiated and group-based exclusion scenarios, moral justification was used more frequently in the peer context compared to the parent context while moral-prejudice justification was used less frequently. Conversely, there was no significant difference in adolescents' use of the socio-conventional justification across the peer and home contexts. Table 5. Paired samplet-test on justifications in peer and home contexts. **Evaluations of the social-conventional, moral, and moral-prejudice justifications** The justification regression analysis resulted in no significant models for predicting socio-conventional, moral, and moral-prejudice justifications in the peer context. For the home context, there were no significant prediction models for moral and moral-prejudice. However, models for socio-conventional justifications were significant for the undifferentiated, group-based, and socio-conventional ingroup exclusion/inclusion scenarios. **Undifferentiated exclusion** For the undifferentiated exclusion justification, model four was the highest order model of significanceF(4,229)= 2.65,p< 0.05. The only significant main effects in this model were parent norm and grade, and there was a significant interaction between parent norm and grade. Adolescents who perceived their parent norms as positive provided fewer socio-conventional justifications for excluding the Arab adolescent from their family event when no reason for exclusion was given. Twelfth graders provided fewer socio-conventional justifications than 9thgraders. Additionally, a significant parent-norm-grade interaction was found (seeFigure 4). The influence of parent outgroup norms was greater for 9ththan for 12thgraders. Ninth graders used more societal reasoning to justify undifferentiated exclusion when their parent outgroup norms were negative; this effect did not emerge for 12thgraders. Figure 4. Undifferentiated Exclusion Societal Justifications: Parent norm X Grade in the home context. Parent outgroup norms: “How would you describe your parents'/friends' attitudes toward Arabs?” 1 = very negative, 6 = very positive. Undifferentiated exclusion: “How good or bad is it that Leah doesn't invite Sheikha?”1 = very bad, 6 = very good. **Group-based exclusion** For the group based exclusion scenario justification, four was the highest order model of significance,F(4,229)= 2.613,p< 0.05 (seeTable 6). The significant predictors in this model were parent norm, peer norm, and an interaction between peer norm and parent norm. Both perceived positive parent norms and perceived positive peer norms were related to adolescents' providing less socio-conventional justifications. Table 6. Multiple regression analysis for exclusion and inclusion evaluation societal justifications in the peer and home contexts. In addition, a significant peer norm-parent norm interaction was found (seeFigure 5). Perceiving more negative parent- or peer outgroup norms resulted in more societal reasoning to justify group-based exclusion. However, this effect was stronger for negative peer outgroup norms—even when parent outgroup norms were positive, youth with negative peer outgroup norms were still significantly more likely to appeal to societal justifications for intergroup exclusion. Figure 5. Group-based exclusion societal justifications: parent norm X Peer norm in the home context. Peer/Parent outgroup norms: ‘How would you describe your parents'/friends' attitudes toward Arabs?” 1 = very negative, 6 = very positive. Group-based exclusion evaluations: “How good or bad is it that Leah doesn't invite Sheikha [because she's Arab]?”1 = very bad, 6 = very good. **Social-conventional based inclusion** For the social-conventional based inclusion decision justification, model three was the highest order model of significance (seeTable 6),F(1,233)= 6.73,p< 0.01. Adolescents who perceive their peer norm as more positive, provided fewer socio-conventional justifications for their inclusion decision. **Evaluations of social-conventional-based ingroup inclusion** For social-conventional based ingroup inclusion, model one was the highest significant order model (seeTable 2). The significant predictors in the model were cultural identity commitment and cultural identity concern for relationships. In the home context, model two was the highest order model of significance for socio-conventional based ingroup inclusion,F(3,237)= 2.93,p< 0.05 (seeTable 2). The significant predictors in the model were cultural identity commitment, cultural identity concern for relationships, and parent norm. When a societal justification was given for inviting a Jewish adolescent to their event, adolescents were less supportive of inclusion when they perceived their parents' norms to be more positive. **Discussion** The current study has provided several novel contributions to the field of youth intergroup relations and moral development. First, regarding our research questions, we found that age moderated the influence of parent and peer outgroup norms on adolescents' judgements and justifications for exclusion, while gender did not. Second, we discovered that the influence of outgroup norms and moderating effect of age were qualitatively different according to the context in which exclusion occurs. Third, we found that peer and parent influence conflicted with each other when exclusion was based exclusively on outgroup membership. Our study centers Jewish American youth and the influential sources on outgroup exclusion—the outgroup being Arab American peers. Since data collection, the dynamics between these groups in the context of the U.S. has shifted. Since October 7, 2023, the escalation of asymmetrical violence and ongoing war on Gaza has created a qualitatively different sociocultural political global context. This has altered the lived realities not just of those Palestinian Citizens of Israel, Palestinian, and Jewish Israeli youth but also of Jewish and Arab American youth. In the U.S., increasing identification with the conflict and the communities involved in many ways has further strained Jewish-Arab intergroup relations (Alper, 2024), as well as within-ethnic-group generational tensions (Silver, 2024). Our findings reflect a glimpse of the influential forces on social reasoning for Jewish American youth prior to October 7th, 2023. While our findings do not and cannot tackle the full extent of Jewish-Arab intergroup relations as they currently stand, there is critical work exploring similar issues being carried out with Palestinian, Palestinian Citizens of Israel, and Jewish Israeli youth (seeBrenick et al., 2019;2024;Berger et al., 2018;Halperin, 2008;Shamoa-Nir and Razpurker-Apfeld, 2020;Shamoa-Nir et al., 2022). These separate yet related bodies of work highlight the qualitatively different lived experiences of Arab and Jewish youth in the U.S. vs. Palestine and Israel. The implications of our findings can be used to inform future research on the prioritized sources of group norms for Jewish American youth, though due to the striking contextual differences, it should not be assumed these results generalize to youth living in Palestine and Israel. **Age and gender** The current study revealed significant age differences in adolescents' acceptance of including the Arab adolescent and social conventional reasoning about undifferentiated exclusion. In contrast with previous research showing that older adolescents' appeal more to group norms than their younger counterparts (Abrams and Rutland, 2008;Nesdale, 2007), the older adolescents in our study provided less social conventional reasoning about exclusion. Furthermore, the current study replicates the findings ofBrenick and Romano (2016), which showed that late-adolescents were less accepting of exclusion compared to mid-adolescents. Additionally, our results build upon the understanding of age differences, showing that the impact of parent outgroup norms on judgments and justifications for exclusion, varies by age. In line with SRDP, younger participants appeared to be more accepting of exclusion and provided more social conventional justifications when they perceived their parents to hold negative views toward the outgroup, and less accepting of exclusion and provided less social conventional justifications when they perceived positive parent views toward the outgroup. On the other hand, their 12thgrade counterparts appeared to consistently reject exclusion and provide similar levels of social conventional justifications when they perceived their parents' views toward the outgroup to be both negative and positive. These findings imply that older adolescents are less aligned with parents' beliefs, supporting the idea of age-graded deindividuation put forth byLaursen and Veenstra (2021), and the development of more inclusive group-based beliefs (Zagrean et al., 2024a,b). Even though previous studies (e.g.,Berndt, 1979;Furman and Buhrmester, 1992) showed that peer influence peaks in mid-adolescence; we found that age did not moderate the effect of peer outgroup norms. Compared to these results on age, gender appeared to not moderate the impact of parent and peer outgroup norms on judgements and justifications of exclusion. This was unexpected as some early research (Berger et al., 2011;Berndt, 1979;McCoy et al., 2019) has shown that male adolescents are influenced more by peers, and females by parents. More recent research has suggested mixed effects when it comes to gender (Jugert et al., 2016;Zagrean et al., 2022). This result can potentially be explained, in part, by shifting norms in gender roles over time. However, gender main effects were found for several of our outcomes. Girls, compared to boys, were less accepting of undifferentiated exclusion in the home context, group-based exclusion in the peer context, and they were more accepting of including the Arab classmate in both the peer and home contexts, which is in line with research in other contexts that suggests girls are generally socialized to be more accepting (Zagrean et al., 2022). Although, there were no significant gender differences in the frequency of social conventional reasoning about exclusion. These findings were generally in agreement with prior research showing that girls were less accepting of exclusion compared to boys (Brenick and Romano, 2016), and girls appealed less to societal reasoning for exclusion (Brenick and Killen, 2014;Brenick and Romano, 2016). In terms of SRDP, our findings support the theoretical tenant that group-based identities, such as gender, are powerful in shaping patterns of evaluating social exclusion (Rutland and Killen, 2015). Even though findings from the current study suggest the importance of age for understanding the influence of group norms, future studies should take a more nuanced approach to assessing the impact of age. The current study was cross-sectional, which confounds the effect of age with potential differences between the 9thand 12thgrade groups attributable to other factors. Carrying out a longitudinal study instead would allow researchers to account for personal differences among participants, and better parse out age effects. Additionally, collecting data at three or more time points would better allow researchers to discover trends across adolescence, whereas differences found between two time points may not necessarily be as strong of an indicator of a developmental trend. **Peer context vs. home context** Our results showed that context is an important factor for understanding the influence of parent and peer norms on adolescents' judgements of exclusion and their reasoning about exclusion. Previous studies show that Jewish-American adolescents are less accepting of socially excluding an outgroup member in a peer context than in a home context (Brenick and Killen, 2014;Brenick and Romano, 2016). While we did not test whether judgements for exclusion were significantly different from each other in the peer and home contexts, our findings do suggest that the interactions between age, peer norms, and parent norms, vary according to the context in which exclusion occurs, which extends the propositions of SRDP by including the importance of context in youths' social reasoning. Specifically, we found that age moderated parent norms, and peer norms moderated parent norms, only in the home context. We found no moderating effects in the peer context. Additionally, we assessed whether adolescents' reasoning about exclusion was significantly different according to context. Results showed that while there was no difference in societal reasoning, adolescents provided more moral justifications and less moral-prejudice justifications in the peer context compared to the home context. These findings indicate that adolescents draw upon more prosocial reasoning in situations with peers, rather than with their family, suggesting peers can be a valuable in promoting social acceptance of outgroup members if valued as a group norm (Rutland and Killen, 2015). However, we found that group norms were not significantly associated with outgroup norms for all three justifications in the peer context, suggesting that more work is needed to understand peers as an influential source on youths' reasoning of social exclusion. In the home context, only societal justifications were significantly associated with outgroups norms. These findings extend previous theory and research by highlighting the importance of taking the context in which exclusion occurs into account when evaluating intergroup relations. Implications of these findings can be applied to anti-prejudice and bullying efforts. While many prejudice and bullying interventions target youth in schools, our findings suggest that the family and home are another important target for intervention. For example, interventions should address the differential influence of negative parent norms for mid- and late-adolescents in the home context, in contrast to the peer context. Beyond parents and peers, future research should extend the investigation of context on exclusion and group norms to include other salient contexts (e.g., school, religious, and community). **Peer vs. parent influence** Previous research suggests that while parent influence does not decrease overall in adolescence, it decreases in comparison to peer influence (Killen et al., 2013;Laursen and Collins, 2009;Laursen and Veenstra, 2021). Relatedly, the current study revealed that in situations in which exclusion in the home was based exclusively on outgroup membership, youth weighed the competing influences of peer and parent outgroup norms. When youth perceived their parents to hold negative views toward the outgroup, those who perceived their peers to hold positive views were less accepting of group-based exclusion and provided less societal justifications, compared to their counterparts that perceived negative views from their peers. This finding aligns with developmental trends proposed by SRPD, suggesting that youths' intergroup attitudes are more likely to be consistent with ingroups that are of more importance to them (e.g., peers over parents;Rutland and Killen, 2015). Instead, when youth interpreted their parents' views as positive, they were mainly rejecting of exclusion and provided fewer societal justifications, regardless of whether their peers held negative or positive views. Therefore, positive peer groups appear to serve as a buffer against the detrimental effects of negative parent influence. This finding holds implications for practice in youth anti-prejudice development. Helping youth integrate into prosocial peer groups can serve as way to reduce negative intergroup attitudes for those living in prejudiced families. Accordingly, youth development professionals should provide extra support to reduce the impact of negative parent norms on youth lacking positive peer influences. One way of doing this is by normalizing prosociality as value for peer groups to adopt. Additionally, future research should investigate the processes through which youth weigh conflicting peer and parent influences, and how this shapes their justifications of social exclusion. Such processes can potentially be assessed through qualitative interviews and focus groups with youth, and through naturalistic observations in which youth discuss instances of discrimination and prejudice with peers and parents. In practice, school authorities can model anti-bias based social exclusion and prosocial behaviors by responding quickly and sensitively to exclusion behaviors they witness. **Limitations of the study and areas for future research** There were several limitations that should be taken into consideration when understanding the results of the current study. First, this study utilized surveys depicting hypothetical scenarios in which exclusion occurred, to assess adolescents' attitudes toward exclusion. Responses to such hypothetical scenarios are subject to social desirability bias or presentation of an anticipated ideal response rather than a realistic one. Obtaining detailed accounts of previous experiences with discrimination and exclusion or observing instances of exclusion can present a more accurate measurement of adolescents' attitudes. Second, this study only assessed the attitudes toward exclusion and related moral reasoning of Jewish American adolescents, and the outgroup member in the exclusion scenarios were only Arab. With the relationship between Jewish and Arab communities characterized as a long history of violent protracted conflict, Jewish American youths' views toward exclusion of Arab American adolescents may be more negative than between adolescents of other cultures. Furthermore, these results may not accurately depict intergroup relations between all Jewish and Arab adolescents across the world, especially in Israel and Palestine. Even though negative intergroup interactions between Jewish and Arab groups exist in the United States (Allison, 2023;Brenick and Killen, 2014;Panagopoulos, 2006), the results of the current study underrepresent the negative relationship between these two communities in areas where conflict between them is more prevalent. Our findings cannot and should not be generalized to Jewish-Arab adolescent intergroup relations globally and Palestine and Israel given each presents a unique sociopolitical and historical context that is foundational to Arab-Jewish intergroup relations in said contexts. Future studies should carefully attend to the nuances between Jewish -Arab relations in the U.S. and in the Middle East. In addition, future research could assess the views toward exclusion of adolescents across several ethnicities and cultures, and provide more representative (e.g., gender, minority backgrounds, LGBT+ communities, political affiliations, socioeconomic status) scenarios in which exclusion occurs. Next, the present study does not include an evaluation of ingroup exclusion (e.g., exclusion of a Jewish peer), therefore future research could investigate patterns of Jewish American adolescents' in- and out-group exclusion evaluations in relation to peer and parent norms. Finally, as previously mentioned, the current study assessed the impact of age through a cross-sectional design. To better investigate whether age moderates the influence of peer and parent outgroup norms on adolescents' judgements on exclusion and related justifications, future studies should utilize a longitudinal design gathering data at three or more time points across the adolescent period. Such a design could reveal a more nuanced developmental trajectory in adolescent intergroup relations and moral development. **Implications of the study** Previous research suggests that group norms influence adolescents' acceptance of social exclusion of their peers, and their reasoning about why exclusion was or was not acceptable. Families and peer groups serve as two of the most salient sources of group norms during adolescence. However, little research addresses whether the impact of group norms on judgements and justifications for exclusion is uniform across age and gender. The current study addressed this gap in the literature through surveys depicting scenarios in which an Arab adolescent was excluded in a home and peer context. Our results indicate that while gender was not associated, the impact of group norms differed by age group. Ninth graders, compared to 12thgraders, were more malleable to parent influence in the home context. This finding indicates the need for prejudice prevention programs to provide additional support to younger adolescents from contexts where prejudiced parent attitudes are most salient. Additionally, the current study found that positive peer influence served as a buffer against the harmful effects of negative parent influence. Therefore, transitioning at-risk youth into positive peer groups can be one of many ways to reduce negative intergroup relations. As these novel findings indicate, currently developing anti-prejudice programs can integrate developmental research on adolescents' judgments and justifications for exclusion to promote the development of youth's positive intergroup relations. **Data availability statement** The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. **Ethics statement** The studies involving humans were approved by the University of Connecticut Institutional Review Board. The studies were conducted in accordance with the local legislation and institutional requirements. Written informed consent for participation in this study was provided by the participants' legal guardians/next of kin. **Author contributions** SK: Writing – original draft, Writing – review & editing. AB: Conceptualization, Investigation, Methodology, Supervision, Writing – original draft, Writing – review & editing. MK: Writing – original draft, Writing – review & editing. HM: Writing – review & editing. KS: Writing – review & editing. SA: Writing – review & editing. **Funding** The author(s) declare that no financial support was received for the research and/or publication of this article. **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. The author(s) declared that they were an editorial board member of Frontiers, at the time of submission. This had no impact on the peer review process and the final decision. **Generative AI statement** The author(s) declare that no Gen AI was used in the creation of this manuscript. **Publisher's note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **References** Abdelaziz, R. (2018).2 women who took children to vandalize an Arizona mosque are arrested. Huffington Post. Available online at:https://www.huffingtonpost.com/entry/tempe-women-arrested-mosque-theft_us_5aaaff19e4b0337adf826764(accessed December 20, 2024). Google Scholar Abrams, D., and Hogg, M. A. (2017). Twenty years of group processes and intergroup relations research: a review of past progress and future prospects.Group Process. Intergr. Relat.20, 561–569. doi: 10.1177/1368430217709536 Crossref Full Text|Google Scholar Abrams, D., and Killen, M. (2014). Social exclusion of children: developmental origins of prejudice.J. Soc. Issues70, 1–11. doi: 10.1111/josi.12043 PubMed Abstract|Crossref Full Text|Google Scholar Abrams, D., and Rutland, A. (2008). “The development of subjective group dynamics,” inIntergroup attitudes and relations in childhood through adulthood, eds. S. R. Levy, M. Killen, S. R. Levy, and M. Killen (Oxford: Oxford University Press), 47–65. doi: 10.1093/oso/9780195189742.003.0004 Crossref Full Text|Google Scholar Abrams, D., Rutland, A., and Cameron, L. (2003). The development of subjective group dynamics: children's judgments of normative and deviant in-group and out-group individuals.Child Dev.74, 1840–1856. doi: 10.1046/j.1467-8624.2003.00641.x PubMed Abstract|Crossref Full Text|Google Scholar Abrams, D., Rutland, A., Pelletier, J., and Ferrell, J. M. (2009). Children's group nous: understanding and applying peer exclusion within and between groups.Child Dev.80, 224–243. doi: 10.1111/j.1467-8624.2008.01256.x PubMed Abstract|Crossref Full Text|Google Scholar Allison, I. (2023).CAIR reports sharp increase in complaints, reported bias incidents since 2017. Council on American-Islamic Relations.Available online at:https://www.cair.com/press_releases/cair-reports-sharp-increase-in-complaints-reported-bias-incidents-since-107/(accessed December 20, 2024). Google Scholar Alper, B. A. (2024).How U.S. Jews are experiencing the Israel-Hamas war.Pew Research Center. Available online at:https://www.pewresearch.org/short-reads/2024/04/02/how-us-jews-are-experiencing-the-israel-hamas-war/(accessed March 26, 2025). Google Scholar Alsamih, M., and Tenenbaum, H. R. (2018). Saudi Arabian children's reasoning about religion-based exclusion.Br. J. Dev. Psychol.36, 508–513. doi: 10.1111/bjdp.12238 PubMed Abstract|Crossref Full Text|Google Scholar Anti-Defamation League (2023).ADL records dramatic increase in U.S. antisemitic incidents following Oct. 7 Hamas massacre.Available online at:https://www.adl.org/resources/press-release/adl-records-dramatic-increase-us-antisemitic-incidents-following-oct-7(accessed December 20, 2024). Google Scholar Arab American Institute (2024).AAI statement in the FBI's 2023 hate crime data release: Highest year on record for total hate incidents for third consecutive year.Available online at:https://www.aaiusa.org/library/2023hatecrime(accessed March 26, 2025). Google Scholar Barni, D., Fiorilli, C., Romano, L., Zagrean, I., Alfieri, S., and Russo, C. (2022). Gender prejudice within the family: the relation between parents' sexism and their socialization values.Front. Psychol.13:846016. doi: 10.3389/fpsyg.2022.846016 PubMed Abstract|Crossref Full Text|Google Scholar Bennett, M. (2014). Intergroup social exclusion in childhood: forms, norms, context, and social identity.J. Soc. Issues70, 183–195. doi: 10.1111/josi.12054 Crossref Full Text|Google Scholar Berger, C., Rodkin, P. C., and Dijkstra, J. K. (2011). Antipathetic relationships among adolescents: exploring prevalence, gender differences, and stability in the United States and Chile.Anales Psicol.27, 783–790. Google Scholar Berger, R., Brenick, A., Lawrence, S. E., Coco, L., and Abu-Raiya, H. (2018). Contact in the context of conflict: examining the effectiveness of contact- and skills-based approaches to prejudice reduction in Israeli-Palestinian youth.J. Appl. Dev. Psychol.59, 46–53. doi: 10.1016/j.appdev.2018.04.002 Crossref Full Text|Google Scholar Berndt, T. J. (1979). Developmental changes in conformity to peers and parents.Dev. Psychol.15:608. doi: 10.1037//0012-1649.15.6.608 PubMed Abstract|Crossref Full Text|Google Scholar Boin, J., Rupar, M., Graf, S., Neji, S., Spiegler, O., and Swart, H. (2021). The generalization of intergroup contact effects: emerging research, policy relevance, and future directions.J. Soc. Issues77, 105–131. doi: 10.1111/josi.12419 Crossref Full Text|Google Scholar Boyette, C., and Allen, K. (2023).Palestinian-American boy killed and his mother injured after landlord stabs them because they were Muslim, authorities say.CNN. Available online at:https://www.cnn.com/2023/10/15/us/chicago-landlord-attack-muslim-boy-mother/index.html(accessed March 26, 2025). Google Scholar Branje, S., De Moor, E. L., Spitzer, J., and Becht, A. I. (2021). Dynamics of identity development in adolescence: a decade in review.J. Res. Adoles.31, 908–927. doi: 10.1111/jora.12678 PubMed Abstract|Crossref Full Text|Google Scholar Brechwald, W. A., and Prinstein, M. J. (2011). Beyond homophily: a decade of advances in understanding peer influence processes.J. Res. Adolesc. 21, 166–179. doi: 10.1111/j.1532-7795.2010.00721.x PubMed Abstract|Crossref Full Text|Google Scholar Brenick, A., and Halgunseth, L. C. (2017). Brief note: applying developmental intergroup perspectives to the social ecologies of bullying: lessons from developmental social psychology.J. Adolesc.59, 90–95 doi: 10.1016/j.adolescence.2017.05.018 PubMed Abstract|Crossref Full Text|Google Scholar Brenick, A., and Killen, M. (2014). Moral judgments about Jewish–Arab intergroup exclusion: the role of cultural identity and contact.Dev. Psychol.50, 86–99. doi: 10.1037/a0034702 PubMed Abstract|Crossref Full Text|Google Scholar Brenick, A., Killen, M., Lee-Kim, J., Fox, N. A., Leavitt, L. A., Raviv, A., et al. (2010). Social understanding in young Israeli-Jewish, Israeli-Palestinian, Palestinian, and Jordanian children: moral judgments and stereotypes.Early Educ. Dev.21, 866–911. doi: 10.1080/10409280903236598 PubMed Abstract|Crossref Full Text|Google Scholar Brenick, A., Lawrence, S. E., Carvalheiro, D., and Berger, R. (2019). Teaching tolerance or acting tolerant? Comparing the effectiveness of skills- and contact-based prejudice reduction interventions among Israeli-Palestinian and Israeli-Jewish youth.J. Sch. Psychol.75c, 8–26. doi: 10.1016/j.jsp.2019.07.001 PubMed Abstract|Crossref Full Text|Google Scholar Brenick, A., and Romano, K. (2016). Perceived peer and parent out-group norms, cultural identity, and adolescents' reasoning about peer intergroup exclusion.Child Dev.87, 1392–1408. doi: 10.1111/cdev.12594 PubMed Abstract|Crossref Full Text|Google Scholar Brenick, A., Zureiqi, M., Seraj, M., Wu, R., Kelly, M. C., and Berger, R. (2024). Why step in? Shifting justifications for bystander behaviors through interventions with youth in the Middle East.J. Res. Adolesc.34, 352–365. doi: 10.1111/jora.12941 PubMed Abstract|Crossref Full Text|Google Scholar Bronfenbrenner, U. (1989). Ecological systems theory.Ann. Child Dev.6, 187–249. Google Scholar CNN. (2018).Mom arrested after filming hate-filled tirade at mosque[Video]. YouTube. Available online at:https://www.youtube.com/watch?v=zIXNtX7qwcI(accessed December 20, 2024). Google Scholar Cohen, J. E. (1988).Statistical Power Analysis for the Behavioral Sciences. Hillsdale, NJ: Lawrence Erlbaum Associates, Inc. Google Scholar Collins, W. A., and Laursen, B. (2004a). Changing relationships, changing youth: interpersonal contexts of adolescent development.J. Early Adolesc.24, 55–62. doi: 10.1177/0272431603260882 Crossref Full Text|Google Scholar Collins, W. A., and Laursen, B. (2004b). “Parent-adolescent relationships and influences,” inHandbook of Adolescent Psychology, 331–361. doi: 10.1002/9780471726746.ch11 Crossref Full Text|Google Scholar Davies, K., Wright, S. C., Aron, A., and Comeau, J. (2013). “Intergroup contact through friendship: Intimacy and norms,” inAdvances in Intergroup contact, eds. G. Hodson and M. Hewstone (London: Psychology Press), 200–229. PubMed Abstract|Google Scholar Dessel, A. B., and Ali, N. (2012). Arab/Jewish intergroup dialogue courses: building communication skills, relationships, and social justice.Small Group Res. 43, 559–586. doi: 10.1177/1046496412453773 Crossref Full Text|Google Scholar Donlan, A. E., Doyle, A., and Lerner, R. (2015). “Peer relationships and positive development,” inPromoting healthy development for America's youth: Lessons learned from the 4-H study of positive youth development, eds. E. P. Bowers, G. J. Geldhof, S. K. Johnson, R. M. Hershberg, L. J. Hilliard, J. V. Lerner, and R. M. Lerner (Cham: Springer). Google Scholar Duffy, A. L., and Nesdale, D. (2009). Peer groups, social identity, and children's bullying behavior.Soc. Dev.18, 121–139. doi: 10.1111/j.1467-9507.2008.00484.x Crossref Full Text|Google Scholar Dumas, T. M., Davis, J. P., and Neighbors, C. (2019). How much does your peer group really drink? Examining the relative impact of overestimation, actual group drinking and perceived campus norms on university students' heavy alcohol use.Addict. Behav.90, 409–414. doi: 10.1016/j.addbeh.2018.11.041 PubMed Abstract|Crossref Full Text|Google Scholar Eisenberger, N. I. (2013). “Why rejection hurts: the neuroscience of social pain,” inThe Oxford handbook of social exclusion, ed. C. N. DeWall (Oxford: Oxford University Press), 152–162. doi: 10.1093/oxfordhb/9780195398700.013.0015 Crossref Full Text|Google Scholar Erikson, E. H. (1968).Identity: Youth and Crisis. New York, NY: Norton. Google Scholar Faul, F., Erdfelder, E., Lang, A.-G., and Buchner, A. (2007). G*Power 3: a flexible statistical power analysis program for the social, behavioral, and biomedical sciences.Behav. Res. Methods39, 175–191. doi: 10.3758/BF03193146 PubMed Abstract|Crossref Full Text|Google Scholar Fleming, M. (2005). Adolescent autonomy: desire, achievement and disobeying parents between early and late adolescence.Australian J. Educ. Dev. Psychol.5, 1–16. Google Scholar Fugardi, R., Jones, J., Kieffer, C., and Milwicki, A. (2024).Understanding and countering anti-semitism and islamophobia in schools. Learning For Justice.Available online at:https://www.learningforjustice.org/magazine/understanding-and-countering-antisemitism-and-islamophobia-in-schools(accessed March 26, 2025). Google Scholar Fuligni, A. J., and Eccles, J. S. (1993). Perceived parent-child relationships and early adolescents' orientation toward peers.Dev. Psychol.29:622. doi: 10.1037//0012-1649.29.4.622 Crossref Full Text|Google Scholar Furman, W., and Buhrmester, D. (1992). Age and sex differences in perceptions of networks of personal relationships.Child Dev.63, 103–115. doi: 10.2307/1130905 Crossref Full Text|Google Scholar Grütter, J., Dhakal, S., and Killen, M. (2021). Adolescents' own and parental expectations for cross-group friendship in the context of societal inequalities.J. Soc. Issues, 77, 1188–1212. doi: 10.1111/josi.12484 PubMed Abstract|Crossref Full Text|Google Scholar Halperin, E. (2008). Group-based hatred in intractable conflict in Israel.J. Conflict Resol.52, 713–736. doi: 10.1177/0022002708314665 PubMed Abstract|Crossref Full Text|Google Scholar Hitti, A., and Killen, M. (2015). Expectations about ethnic peer group inclusivity: the role of shared interests, group norms, and stereotypes.Child Dev.86, 1522–1537. doi: 10.1111/cdev.12393 PubMed Abstract|Crossref Full Text|Google Scholar Hitti, A., Mulvey, K. L., and Killen, M. (2016). “Social exclusion in adolescence,” inEncyclopedia of Adolescence, 1–14. doi: 10.1007/978-3-319-32132-5_50-2 Crossref Full Text|Google Scholar Horn, S. S. (2005). “Adolescents' peer interactions: Conflict and coordination among personal expression, social norms, and moral reasoning,” inConflict, contradiction and contrarian elements in moral development and education, ed. L. Nucci (New York: Erlbaum), 113–127. Google Scholar Huang, C. Y., and Stormshak, E. A. (2011). A longitudinal examination of early adolescence ethnic identity trajectories.Cult. Diver. Ethnic Minor. Psychol.17:261. doi: 10.1037/a0023882 PubMed Abstract|Crossref Full Text|Google Scholar Hysing, M., Askeland, K. G., La Greca, A. M., Solberg, M. E., Breivik, K., and Sivertsen, B. (2021). Bullying involvement in adolescence: implications for sleep, mental health, and academic outcomes.J. Interpersonal Violence36, 17–18. doi: 10.1177/0886260519853409 PubMed Abstract|Crossref Full Text|Google Scholar Jasinskaja-Lahti, I., Mähönen, T. A., and Liebkind, K. (2011). Ingroup norms, intergroup contact and intergroup anxiety as predictors of the outgroup attitudes of majority and minority youth.Int. J. Interc. Relat.35, 346–355. doi: 10.1016/j.ijintrel.2010.06.001 Crossref Full Text|Google Scholar Jenkins, W. J., Ruppel, S. E., Kizer, J. B., Yehl, J. L., and Griffin, J. L. (2012). An examination of post 9-11 attitudes towards Arab Americans.N. Am. J. Psychol.14, 77–84. Google Scholar Jugert, P., Eckstein, K., Beelmann, A., and Noack, P. (2016). Parents' influence on the development of their children's ethnic intergroup attitudes: a longitudinal analysis from middle childhood to early adolescence.Eur. J. Dev. Psychol.13, 213–230. doi: 10.1080/17405629.2015.1084923 Crossref Full Text|Google Scholar Juvonen, J., and Galvan, A. (2008). “Peer influence in involuntary social groups,” inUnderstanding peer influence in children and adolescents, eds. M. J. Prinstein and K. A. Dodge (New York: Guilford Press), 225–244. PubMed Abstract|Google Scholar Kestler-D'Amours, J. (2024). ‘Rendered invisible' How a wave of anti-Arab violence tests US hate crime laws. AlJazeera. Available online at:https://www.aljazeera.com/news/longform/2024/3/20/rendered-invisible-a-wave-of-anti-arab-violence-tests-us-hate-crime-laws(accessed March 26, 2025). Google Scholar Kiang, L., Witkow, M. R., Baldelomar, O. A., and Fuligni, A. J. (2010). Change in ethnic identity across the high school years among adolescents with Latin American, Asian, and European backgrounds.J. Youth Adolesc.39, 683–693. doi: 10.1007/s10964-009-9429-5 PubMed Abstract|Crossref Full Text|Google Scholar Killen, M., Rutland, A., Abrams, D., Mulvey, K. L., and Hitti, A. (2013). Development of intra-and intergroup judgments in the context of moral and social-conventional norms.Child Dev.84, 1063–1080. doi: 10.1111/cdev.12011 PubMed Abstract|Crossref Full Text|Google Scholar Lam, C. B., McHale, S. M., and Crouter, A. C. (2014). Time with peers from middle childhood to late adolescence: Developmental course and adjustment correlates.Child Dev.85, 1677–1693. doi: 10.1111/cdev.12235 PubMed Abstract|Crossref Full Text|Google Scholar Laursen, B., and Collins, W. A. (2009). “Parent-child relationships during adolescence,” inHandbook of adolescent psychology: Contextual influences on adolescent development, eds. R. M. Lerner and L. Steinberg (John Wiley and Sons, Inc.), 3–42. doi: 10.1002/9780470479193.adlpsy002002 Crossref Full Text|Google Scholar Laursen, B., and Veenstra, R. (2021). Toward understanding the functions of peer influence: a summary and synthesis of recent empirical research.J. Res. Adolesc.31, 889–907. doi: 10.1111/jora.12606 PubMed Abstract|Crossref Full Text|Google Scholar McCoy, S. S., Dimler, L. M., Samuels, D. V., and Natsuaki, M. N. (2019). Adolescent susceptibility to deviant peer pressure: does gender matter?Adoles. Res. Rev.4, 59–71. doi: 10.1007/s40894-017-0071-2 Crossref Full Text|Google Scholar McKeown, S., and Taylor, L. K. (2018). Perceived peer and school norm effects on youth antisocial and prosocial behaviours through intergroup contact in Northern Ireland.Br. J. Soc. Psychol.57, 652–665. doi: 10.1111/bjso.12257 PubMed Abstract|Crossref Full Text|Google Scholar Miklikowska, M., Bohman, A., and Titzmann, P. F. (2019). Driven by context? The interrelated effects of parents, peers, classrooms on development of prejudice among Swedish majority adolescents.Dev. Psychol.55:2451. doi: 10.1037/dev0000809 PubMed Abstract|Crossref Full Text|Google Scholar Mulvey, K. L., Hitti, A., Rutland, A., Abrams, D., and Killen, M. (2014). Context differences in children's ingroup preferences.Dev. Psychol.50, 1507–1519. doi: 10.1037/a0035593 PubMed Abstract|Crossref Full Text|Google Scholar Mulvey, K. L., and Killen, M. (2017). Children's and adolescents' expectations about challenging unfair group norms.J. Youth Adolesc.46, 2241–2253. doi: 10.1007/s10964-017-0671-y PubMed Abstract|Crossref Full Text|Google Scholar Nesdale, D. (1997).Ethnic Identity Scale. Southport, QLD, Australia: Griffiths University. Google Scholar Nesdale, D. (2007). “The development of ethnic prejudice in early childhood: Theories and research,” inContemporary perspectives on socialization and social development in early childhood education, eds. O. Saracho and B. Spodek (Information Age Publishing). Google Scholar Nesdale, D. (2017). “Children and social groups: a social identity approach,” inThe Wiley Handbook of Group Processes in Children and Adolescents, eds. A. Rutland, D. Nesdale and C. S. Brown (New York: Wiley), 3–22. doi: 10.1002/9781118773123.ch1 Crossref Full Text|Google Scholar Nesdale, D., and Brown, K. (2004). Children's attitudes towards an atypical member of an ethnic in-group.Int. J. Behav. Dev.28, 328–335. doi: 10.1080/01650250444000018 Crossref Full Text|Google Scholar Nesdale, D., Maass, A., Durkin, K., and Griffiths, J. (2005). Group norms, threat, and children's racial prejudice.Child Dev.76, 652–663. doi: 10.1111/j.1467-8624.2005.00869.x PubMed Abstract|Crossref Full Text|Google Scholar Nucci, L. (2008). “Social cognitive domain theory and moral education,” inHandbook of Moral and Character Education, 291–309. doi: 10.4324/9780203931431-24 Crossref Full Text|Google Scholar Panagopoulos, C. (2006). The polls-trends: Arab and Muslim Americans and Islam in the aftermath of 9/11.Int. J. Public Opinion Quart.70, 608–624. doi: 10.1093/poq/nfl029 Crossref Full Text|Google Scholar Phinney, J. S. (1992). The multigroup ethnic identity measure: a new scale for use with diverse groups.J. Adolesc. Res.7, 156–117. doi: 10.1177/074355489272003 PubMed Abstract|Crossref Full Text|Google Scholar Reynolds, K. J., Subašić, E., and Tindall, K. (2015). The problem of behaviour change: From social norms to an ingroup focus.Soc. Person. Psychol. Compass. 9, 45–56. doi: 10.1111/spc3.12155 Crossref Full Text|Google Scholar Rivas-Drake, D., Saleem, M., Schaefer, D. R., Medina, M., and Jagers, R. (2019). Intergroup contact attitudes across peer networks in school: selection, influence, and implications for cross-group friendships.Child Dev.90, 1898–1916. doi: 10.1111/cdev.13061 PubMed Abstract|Crossref Full Text|Google Scholar Rosenthal, J. A. (1996). Qualitative descriptors of strength of association and effect size.J. Soc. Serv. Res.21, 37–59. doi: 10.1300/J079v21n04_02 Crossref Full Text|Google Scholar Rutland, A., and Killen, M. (2015). A developmental science approach to reducing prejudice and social exclusion: Intergroup processes, social-cognitive development, and moral reasoning.Soc. Issues Policy Rev.9, 121–154. doi: 10.1111/sipr.12012 Crossref Full Text|Google Scholar Rutland, A., Killen, M., and Abrams, D. (2010). A new social-cognitive developmental perspective on prejudice: the interplay between morality and group identity.Perspect. Psychol. Sci.5, 279–291. doi: 10.1177/1745691610369468 PubMed Abstract|Crossref Full Text|Google Scholar Selya, A. S., Rose, J. S., Dierker, L. C., Hedeker, D., and Mermelstein, R. J. (2012). A practical guide to calculating Cohen'sf 2, a measure of local effect size, from PROC MIXED.Front. Psychol.3:111. doi: 10.3389/fpsyg.2012.00111 PubMed Abstract|Crossref Full Text|Google Scholar Shamoa-Nir, L., and Razpurker-Apfeld, I. (2020). Religious primes and threat-perceptions as predictors of attitudes toward Muslims in Israel.Integr. Psychol. Behav. Sci.54, 392–415. doi: 10.1007/s12124-019-09509-z PubMed Abstract|Crossref Full Text|Google Scholar Shamoa-Nir, L., Razpurker-Apfeld, I., Dautel, J. B., and Taylor, L. K. (2022). Understanding intergroup conflict: how do children in a divided society perceive group differences?J. Peace Psychol.28:310.? doi: 10.1037/pac0000610 Crossref Full Text|Google Scholar Sidner, S., and Simon, M. (2018).Moms took children to a mosque and live-streamed their hate-filled tirade. CNN. Available online at:https://www.cnn.com/2018/03/16/us/arizona-mosque-hate-~video-arrest/index.html(accessed December 20, 2024). Google Scholar Silver, L. (2024).Younger Americans stand out in their views of the Israel-Hamas war.Pew Research Center. Available online at:https://www.pewresearch.org/short-reads/2024/04/02/younger-americans-stand-out-in-their-views-of-the-israel-hamas-war/(accessed March 26, 2025). Google Scholar Sirin, S. R., Choi, E., and Tugberk, C. (2021). The impact of 9/11 and the war on terror on Arab and Muslim children and families.Curr. Psychiat. Rep.23:47. doi: 10.1007/s11920-021-01264-6 PubMed Abstract|Crossref Full Text|Google Scholar Smetana, J. (2013). “Moral development: the social domain theory view,” inThe Oxford handbook of developmental psychology, vol. 1: Body and mind, eds. P. D. Zelazo (Oxford: Oxford Library of Psychology), 832–864. doi: 10.1093/oxfordhb/9780199958450.013.0029 Crossref Full Text|Google Scholar Smith, E. M., and Minescu, A. (2021). Comparing normative influence from multiple groups: beyond family, religious ingroup norms predict children's prejudice towards refugees.Int. J. Interc. Relat.81, 54–67. doi: 10.1016/j.ijintrel.2020.12.010 Crossref Full Text|Google Scholar Steinberg, L., and Monahan, K. C. (2007). Age differences in resistance to peer influence.Dev. Psychol.43:1531. doi: 10.1037/0012-1649.43.6.1531 PubMed Abstract|Crossref Full Text|Google Scholar Tadmor, C. T., Berger, R., Brenick, A., Abu-Raiya, H., and Benatov, J. (2017). The intergenerational effect of maternal multicultural experience on children's tolerance: an example from Palestinians and Jews in Israel.J. Cross-Cult. Psychol.48, 1342–1348. doi: 10.1177/0022022117721973 Crossref Full Text|Google Scholar Tahseen, M., Ahmed, S. R., and Ahmed, S. (2019). Muslim youth in the face of Islamophobia: Risk and resilience,” inIslamophobia and psychiatry: Recognition, prevention, and treatment, eds. H. S. Moffic, J. Peteet, A, Z. Hankir, and R. Awaad (Cham: Springer), 307–319. doi: 10.1007/978-3-030-00512-2_26 Crossref Full Text|Google Scholar Tajfel, H., and Turner, J. C. (1986). “The social identity theory of intergroup behaviour,” inPsychology of intergroup relations, eds. S. Worchel and W. G. Austin (Nelson-Hall), 7–24. Google Scholar Torres, C. E., D'Alessio, S. J., and Stolzenberg, L. (2020). The effect of social, verbal, physical, and cyberbullying victimization on academic performance.Victims Offenders, 15, 1–21. doi: 10.1080/15564886.2019.1681571 Crossref Full Text|Google Scholar Trifiletti, E., Shamloo, S. E., Burro, R., Vicentini, G., and Raccanello, D. (2024). Positive and negative intergroup contact: evidence of their interactions in a child sample.J. Commun. Appl. Soc. Psychol.34:e2781. doi: 10.1002/casp.2871 Crossref Full Text|Google Scholar Tropp, L. R., White, F., Rucinski, C. L., and Tredoux, C. (2022). Intergroup contact and prejudice reduction: prospects and challenges in changing youth attitudes.Rev. General Psychol.26, 342–360. doi: 10.1177/10892680211046517 Crossref Full Text|Google Scholar Umaña-Taylor, A. J., and Hill, N. E. (2020). Ethnic–racial socialization in the family: a decade's advance on precursors and outcomes.Family Relat.82, 244–271. doi: 10.1111/jomf.12622 Crossref Full Text|Google Scholar Umaña-Taylor, A. J., Quintana, S. M., Lee, R. M., Cross, W. E. Jr., Rivas-Drake, D., Schwartz, S. J., et al. (2014). Ethnic and racial identity during adolescence and into young adulthood: an integrated conceptualization.Child Dev.85, 21–39. doi: 10.1111/cdev.12196 PubMed Abstract|Crossref Full Text|Google Scholar Van der Graaff, J., Branje, S., De Wied, M., Hawk, S., Van Lier, P., and Meeus, W. (2014). Perspective taking and empathic concern in adolescence: Gender differences in developmental changes.Dev. Psychol.50, 881–888. doi: 10.1037/a0034325 PubMed Abstract|Crossref Full Text|Google Scholar van Hoorn, J., van Dijk, E., Meuwese, R., Rieffe, C., and Crone, E. A. (2016). Peer influence on prosocial behavior in adolescence.J. Res. Adolesc.26, 90–100. doi: 10.1111/jora.12173 Crossref Full Text|Google Scholar Verkuyten, M. (2022). Understanding intergroup relations in childhood and adolescence.Rev. General Psychol.26, 282–297. doi: 10.1177/10892680211050016 Crossref Full Text|Google Scholar Waasdorp, T. E., and Bradshaw, C. P. (2015). The overlap between cyberbullying and traditional bullying.J. Adoles. Health5, 483–488. doi: 10.1016/j.jadohealth.2014.12.002 PubMed Abstract|Crossref Full Text|Google Scholar Wainryb, C. (1995). Reasoning about social conflicts in different cultures: druze and Jewish children in Israel.Child Dev.66, 390–401. doi: 10.2307/1131585 Crossref Full Text|Google Scholar Walters, G. D. (2020). Beyond peer influence and selection: a gendered pathways analysis of social environmental predictors of change in child and peer delinquency.Fem. Criminol.15, 3–23. doi: 10.1177/1557085118804349 Crossref Full Text|Google Scholar Wenzing, J. M. C., Gharaei, N., Demir, Z., and Schachner, M. K. (2021). Do parental and peer support protect adjustment in the face of ethnic discrimination?A comparison between refugee youth and youth of immigrant descent. Int. J. Environ. Res. Public Health18:12016. doi: 10.3390/ijerph182212016 Crossref Full Text|Google Scholar Zagrean, I., Barni, D., Russo, C., and Danioni, F. (2022). The family transmission of ethnic prejudice: a systematic review of research articles with adolescents.Soc. Sci.11:236. doi: 10.3390/socsci11060236 PubMed Abstract|Crossref Full Text|Google Scholar Zagrean, I., Miklikowska, M., and Barni, D. (2024a). Essentialism facilitates anti-immigrant prejudice, reduces contact with immigrants, and explains parent-child similarity in anti- immigrant prejudice.J. Child Family Stud.33, 2012–2027. doi: 10.1007/s10826-024-02855-6 Crossref Full Text|Google Scholar Zagrean, I., Rinallo, E., Russo, C., Scopelliti, M., and Barni, D. (2024b). The family transmission of prejudice toward immigrants: the mediating role of adolescents' self-transcendence and conservation values.J. Family Stud.26, 1–21. doi: 10.1080/13229400.2024.2445643 Crossref Full Text|Google Scholar Keywords:intergroup relations, social exclusion, societal reasoning, Jewish American, Arab American, prejudice, age, gender Citation:Klein S, Brenick A, Kelly MC, Mohamed H, Scally K and Andrade S (2025) Who should I listen to? Gender and age effects in how group norms relate to adolescents' intergroup relations and prejudiced attitudes.Front. Dev. Psychol.3:1554122. doi: 10.3389/fdpys.2025.1554122 Received:01 January 2025;Accepted:04 April 2025;Published:07 May 2025. Edited by: Reviewed by: Copyright© 2025 Klein, Brenick, Kelly, Mohamed, Scally and Andrade. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Sydney Klein,c3lkbmV5LmtsZWluQHVjb25uLmVkdQ== †These authors share first authorship Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract Introduction Theoretical backings Social exclusion Jewish American and Arab American adolescent relations Group norms on adolescents' exclusion The current study Methods Results Discussion Data availability statement Ethics statement Author contributions Funding Conflict of interest Generative AI statement Publisher's note References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}