{"id": 349, "name": "Delaware County Daily Times", "domain": "delcotimes.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.delcotimes.com/2025/06/10/piaa-class-3a-boys-lacrosse-early-la-salle-lead-doesnt-deter-springfield-from-appointed-state-date/", "title": "Piaa Class 3a Boys Lacrosse Early La Salle Lead Doesnt Deter Springfield From Appointed State Date", "content": "E-Edition E-Edition NewsNewsLocal NewsCoronavirusCrime and Public SafetyHealthBusinessBest ReviewsNational NewsPennsylvania News News Local News Coronavirus Crime and Public Safety Health Business Best Reviews National News Pennsylvania News News Local News Coronavirus Crime and Public Safety Health Business Best Reviews National News Pennsylvania News SportsSportsHigh School SportsPhiladelphia 76ersPhiladelphia EaglesPhiladelphia FlyersPhiladelphia PhilliesPhiladelphia Union Sports High School Sports Philadelphia 76ers Philadelphia Eagles Philadelphia Flyers Philadelphia Phillies Philadelphia Union Sports High School Sports Philadelphia 76ers Philadelphia Eagles Philadelphia Flyers Philadelphia Phillies Philadelphia Union Things to DoThings to DoEntertainmentRestaurants Food and DrinkMoviesMusic and ConcertsTV ListingsComicsPuzzlesEvents Things to Do Entertainment Restaurants Food and Drink Movies Music and Concerts TV Listings Comics Puzzles Events Things to Do Entertainment Restaurants Food and Drink Movies Music and Concerts TV Listings Comics Puzzles Events Opinion ObituariesObituariesNews Obituaries Obituaries News Obituaries Obituaries News Obituaries ClassifiedsClassifiedsJobsPublic Notices Classifieds Jobs Public Notices Classifieds Jobs Public Notices ToolsContact UsContestsGasbuddy Contact Us Contests Gasbuddy Contact Us Contests Gasbuddy Special Sections Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Subscribe Login Logout Sign up for email newsletters to submit an obituary Deadlines: Monday-Friday 8:30am-4:00pm, Call 610-915-2226 (Proofs will be provided for accuracy only, they will not be styled/formatted like the finished product) Obituaries submitted on Saturday, Sunday and Holidays are accepted from 8:30 a.m. to 3:00 p.m. by email onlyObit@delcotimes.com (No proofs will be furnished. Pricing will not be available until the next business day after 10:00am by calling Dianne at 610-915-2226) Obituaries received after Deadline will not be published in the following edition of the paper. Sending Procedure: Email is the preferable method for receiving Obituaries (and the only method on Saturday, Sunday and Holidays), they can be sent toObit@delcotimes.com(Feel free to call and confirm that we’ve received the email) Formatting: Obituaries will continue to visually look the same as they currently do, but you will no longer be restricted in what you can say (ex. As much Family can be listed as you’d like; Wording like “Went to rest with the Lord” is now permissible) Other: There is a cost for each obituary. Pricing and payments are only available Monday through Friday, 8:30 am to 4:00 pm. All weekend and holiday submissions will be provided a cost the next business day. Exceptions: All New accounts, Out of State Funeral Homes and Private Parties will require prepayment upon approval of the obituary. Weekend and Holiday staff are not authorized to set up a new account or process payments Deadline for the above is before 4:00 PM Mon – Fri. only (Holiday schedules may vary). Prepayment required submissions will be handled on the very first business day following the weekend and/or holiday schedule. A complete name, address and best contact phone number are required upon submittal of your obituary request to set up your account. A proof will then be emailed for review but placed on hold until payment is received. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Subscribe Log in Sign up for email newsletters Subscribe Log in E-Edition E-Edition High School Sports 76ers Eagles Flyers Phillies Union **PIAA Class 3A Boys Lacrosse: Early La Salle lead doesn’t deter Springfield from appointed state date** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X WEST GOSHEN — Tommy Toomey knew what mattered and what didn’t when Springfield huddled after three quarters Tuesday afternoon. He had just been at the center of the Cougars’ three goals in 2:12 to end the frame – the first a feed to AJ Clark, the second a turnover caused by Brian Delaney that eventually led to a Clark goal, the third that the pole Toomey finished off himself. At that juncture of the PIAA Class 3A semifinal, it didn’t much matter to Toomey who was on the other bench at West Chester Henderson High. It certainly didn’t matter how strong its occupants started the game. There was just Springfield, playing the brand of lacrosse it knows best, the opposition just scenery in the Springfield story. The Cougars overcame a three-goal deficit early to win going away from La Salle, 9-5, and book a place in the PIAA final on Saturday. It avenges a loss to the Explorers in this game last year. It sets up a rematch of the District 1 final, which Springfield won over Radnor. The Raptors took the westerly journey to State College, beating Shady Side Academy, 13-8, Tuesday. Springfield (23-1) trailed 3-0 after one quarter. It tied the game three times before taking its first lead on Clark’s goal with 12.5 seconds left in the third at 6-5. Clark’s goal two minutes earlier was set up by Toomey, off a caused turnover by fellow defenseman Talen Varrasse, who led the way in that category with four. His second was a set play off a long possession, Clark popping to the right of the cage to make himself an option as Patrick Flaherty dodged behind. Tommy Rush, who just about stalemated La Salle’s faceoff man Christian Peterman with a 7-for-16 day, won the draw and pushed it to Brad Barber. Barber found a streaking Toomey, who caught it in stride and whipsawed it home to make it 7-5 after three. “That felt awesome,” Toomey said. “All the momentum shifted our way. And it kind of felt like the game was in our hands at that point. It didn’t matter what they were doing. It only mattered what we were doing. And we just kept it rolling.” Two goals created by Springfield’s defense augmented the domination in its usual half of the field. The Cougars conceded only two goals in the final three quarters to the District 12 champion. They allowed just two shot attempts after halftime, goalie Jackson Kennedy not having to add to his first-half save total of four. For Toomey, the challenge was fixing excessive aggression in the first quarter – a little too jumpy on passing lanes, slightly over-pursuing dodgers. La Salle can exploit mistakes. But dare their offensive talents to make plays 1-on-1 against a structured defense, and the Explorers (18-6) don’t quite have the difference-makers. “We know we’re good at pressing and trying to take the ball away,” Toomey said. “But against a good team like that, sometimes going all out trying to get the ball back isn’t the best idea. So we definitely had to reel that in.” Billy Henderson followed Varrasse with three caused turnovers. LSM Brian Delaney and middies Zach Wisely and Luke Valerio caused a turnover each. La Salle punished them early. Attackman Will Trymbiski scored twice in the first half, one set up by brother Jackson Trymbiski, who had a goal. Logan Riggione, the only one of La Salle’s vaunted midfield corps to find the score sheet, scored the final goal of the first quarter, and Will Trymbiski’s goal with 24 seconds left in the first half sent the Explorers into the break leading 4-3. Flaherty (three assists) scored his only goal to tie it at 4, but Will Trymbiski untied it 41 seconds later. Clark got them back on level terms in starting that third-quarter spree. That it’s Clark, one of the Cougars lower on the scouting report, stepping up in big moments with two goals is an indication to Barber the team that they’ve built. “I remember in the offseason, we were getting ready for the year, AJ was such a big factor,” Barber said. “He was having an incredible offseason. We know he was going to make plays like this. It doesn’t surprise anyone, not one player on our team or coaching staff. He’s built for those moments. And it was awesome to see that for him.” Springfield hardly let La Salle get a touch in the fourth quarter. The Explorers responded with frustration in the form of four penalties, the third of which led to Flaherty feeding Evan DiBlasi to make it 8-5. Brad Barber fired his third goal with 3:29 left to set off the celebrations. Even for the offense that powered it, those celebrations came back to the defensive side of the ball, to those whose fingerprints are on everything. “It’s a dream. It’s awesome,” Barber said of playing in front of that unit. “That’s why I think our offense is able to do what we do, because we have the defense to back us up, we have the goalie, we have Tommy Rush. We have all the pieces, and we’ve got one more game, so hoping to get it done.” **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X **RevContent Feed** **Most Popular** Former Springfield Youth Club treasurer pleads to stealing more than $100,000Former Springfield Youth Club treasurer pleads to stealing more than $100,000 **Former Springfield Youth Club treasurer pleads to stealing more than $100,000** **Former Springfield Youth Club treasurer pleads to stealing more than $100,000** [Update] 50-year-old collapses during fight on Ridley Park street and later dies[Update] 50-year-old collapses during fight on Ridley Park street and later dies **[Update] 50-year-old collapses during fight on Ridley Park street and later dies** **[Update] 50-year-old collapses during fight on Ridley Park street and later dies** Newtown Square man charged with getting into Penncrest High School, assaulting stafferNewtown Square man charged with getting into Penncrest High School, assaulting staffer **Newtown Square man charged with getting into Penncrest High School, assaulting staffer** **Newtown Square man charged with getting into Penncrest High School, assaulting staffer** Share Food Program opens new warehouse in Delaware CountyShare Food Program opens new warehouse in Delaware County **Share Food Program opens new warehouse in Delaware County** **Share Food Program opens new warehouse in Delaware County** In Chester, a traffic stop, vehicle pursuit and arrest of man sought in robberyIn Chester, a traffic stop, vehicle pursuit and arrest of man sought in robbery **In Chester, a traffic stop, vehicle pursuit and arrest of man sought in robbery** **In Chester, a traffic stop, vehicle pursuit and arrest of man sought in robbery** Re-arrests made in Fernwood Cemetery fracas and gunfireRe-arrests made in Fernwood Cemetery fracas and gunfire **Re-arrests made in Fernwood Cemetery fracas and gunfire** **Re-arrests made in Fernwood Cemetery fracas and gunfire** PIAA Class 3A Boys Lacrosse: Early La Salle lead doesn’t deter Springfield from appointed state datePIAA Class 3A Boys Lacrosse: Early La Salle lead doesn’t deter Springfield from appointed state date **PIAA Class 3A Boys Lacrosse: Early La Salle lead doesn’t deter Springfield from appointed state date** **PIAA Class 3A Boys Lacrosse: Early La Salle lead doesn’t deter Springfield from appointed state date** Garnet Valley residents taking on 2.5% property tax increaseGarnet Valley residents taking on 2.5% property tax increase **Garnet Valley residents taking on 2.5% property tax increase** **Garnet Valley residents taking on 2.5% property tax increase** In Chester, man shot multiple times on 21st StreetIn Chester, man shot multiple times on 21st Street **In Chester, man shot multiple times on 21st Street** **In Chester, man shot multiple times on 21st Street** PIAA Class 3A Girls Lacrosse: Mia Wainwright’s late goal caps Springfield comeback winPIAA Class 3A Girls Lacrosse: Mia Wainwright’s late goal caps Springfield comeback win **PIAA Class 3A Girls Lacrosse: Mia Wainwright’s late goal caps Springfield comeback win** **PIAA Class 3A Girls Lacrosse: Mia Wainwright’s late goal caps Springfield comeback win** **More in High School Sports** PIAA Class 3A Boys Lacrosse: Radnor handles Shady Side to return to state final **PIAA Class 3A Boys Lacrosse: Radnor handles Shady Side to return to state final** **PIAA Class 3A Boys Lacrosse: Radnor handles Shady Side to return to state final** PIAA Class 3A Girls Lacrosse: Mia Wainwright’s late goal caps Springfield comeback win **PIAA Class 3A Girls Lacrosse: Mia Wainwright’s late goal caps Springfield comeback win** **PIAA Class 3A Girls Lacrosse: Mia Wainwright’s late goal caps Springfield comeback win** PIAA Class 2A Boys Lacrosse: Marple Newtown shrugs off slow start and Twin Valley **PIAA Class 2A Boys Lacrosse: Marple Newtown shrugs off slow start and Twin Valley** **PIAA Class 2A Boys Lacrosse: Marple Newtown shrugs off slow start and Twin Valley** PIAA GIRLS 2A LACROSSE: Strath Haven pummels Abington Heights in semis **PIAA GIRLS 2A LACROSSE: Strath Haven pummels Abington Heights in semis** **PIAA GIRLS 2A LACROSSE: Strath Haven pummels Abington Heights in semis** 2025 June 10 SubscribeSign Up For Newsletterse-EditionSubmit News Sign Up For Newsletters e-Edition Submit News Sign Up For Newsletters e-Edition Submit News Contact UsWork With UsClassifiedsPlace Classified AdPrivacy PolicyAccessibility Work With Us Classifieds Place Classified Ad Privacy Policy Accessibility Work With Us Classifieds Place Classified Ad Privacy Policy Accessibility Advertising InquiryNetwork AdvertisingPublic NoticesJobs Network Advertising Public Notices Jobs Network Advertising Public Notices Jobs Subscriber ServicesAnnouncement FormsiOS AppAndroid AppSitemap Announcement Forms iOS App Android App Sitemap Announcement Forms iOS App Android App Sitemap Media News GroupThe Times HeraldDaily Local NewsThe MercuryPatriot ItemThe ReporterThe Trentonian The Times Herald Daily Local News The Mercury Patriot Item The Reporter The Trentonian The Times Herald Daily Local News The Mercury Patriot Item The Reporter The Trentonian Subscribe Now Terms of Use Cookie Policy Cookie Preferences Do Not Sell/Share My Personal Information Notice of Financial Incentive California Notice at Collection Arbitration MediaNews Group Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}