{"id": 825, "name": "Liberty & Law", "domain": "lawliberty.org", "bias": "right", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://lawliberty.org/forum/democratic-efficacy-and-the-unitary-executive/", "title": "Democratic Efficacy And The Unitary Executive", "content": "About Staff Submissions Contact Part of the Liberty Fund network Home Essays Forum Podcasts Book Reviews Features Classics Subscribe Home Essays Forum Podcasts Book Reviews Features Classics Subscribe About Staff Submissions Contact **Democratic Efficacy and the Unitary Executive** A unitary executive is both constitutionally demanded and conducive to democratic governance. The central normative claim for the unitary executive is an irony. It claims that expanding presidential authority over the entire executive branch enhances rather than diminishes the system of checks and balances established in the US Constitution. While it is possible that some form of “plural executive” would be superior to the Constitution’s unitary executive—a majority of state constitutions adopted forms of the plural executive, after all—the national government’s statutorily-created plural executive manages only to diminish the Constitution’s system of checks and balances by decreasing the authority of a democratically-accountable president over the executive branch. Revivifying the Constitution’s form of unitary executive more broadly offers a remedy to a disturbing trend in today’s polarized electorate as well. While enhancing the president’s authority over the executive branch is often styled to threaten presidential authoritarianism, I suggest that subjecting the executive branch to the oversight of an electorally-accountable president would, in fact, lance the political boil that has led increasing numbers of Americans toexpress doubts about democracyand to favor a “strong leader who is willing to break the rules.” Below I first define a “unitary executive” and distinguish it from “plural” executives. The purpose is not narrowly definitional or historical. Rather, understanding what constitutes a “plural executive” in itself can provide a convenient legal test by which to judge deviations from the Constitution’s unitary executive. Next, I examine the important role the unitary executive plays in the Constitution’s system of electoral accountability and institutional separation of powers. Before turning to this discussion, however, it merits noting that two separate questions often become conflated in discussing the US government’s unitary executive. There is the descriptive question, whether the Constitution establishes a unitary executive, and there is the normative question, whether a unitary executive for the national government is (or remains) an optimal institutional design for the nation in the modern era. It is possible, for example, to believe that the Constitution designed a unitary executive and yet at the same time also believe that the unitary executive is not an optimal institutional design for the national government (or that it is no longer an optimal design for the national government). To tip my hand, I believe that the US Constitution requires a unitary executive, but I am largely agnostic whether a unitary executive necessarily produces the best outcomes in all policy domains. It is possible that adopting aspects of state-level plural executive design might produce superior outcomes for the nation than does the unitary executive. Nonetheless, I argue that compared with the forms of the plural executive that have been statutorily adopted, particularly the immunization of large parts of the executive bureaucracy from electoral accountability, the Constitution’s unitary executive is, on balance, a superior form of executive organization. Distinguishing Unitary and Plural Executives Just what is a “unitary executive”? A starting point is Justice Scalia’s observation in his dissent inMorrison v. Olsonthat in providing that “the executive power shall be vested in a president of the United States” the US Constitution endows the president not only with “some of the executive power, butallof the executive power” (emphasis in original). This means that the president has authority to direct all parts of the executive branch and to fire anyone in the executive branch or, at least, to fire anyone with authority over policy. The doctrine thus asserts presidential authority over statutorily created independent executive agencies and would limit Federal merit protection at most to executive branch employees who exercise no policy influence. In contrast to the lengthy enumeration of legislative powers granted to Congress in Article 1, Section 8 of the Constitution, the Constitution’s basic stipulation of executive power is a model of brevity and generality. To be sure, additional executive powers are listed after the initial statement Scalia quotes inMorrison, for example, that the president is commander-in-chief of the military, has the treaty-making power (with Senate approval), makes appointments, and, significantly for discussion here, takes care “that the Laws be faithfully executed.” Nonetheless, the list is shorter and more general than the list of legislative powers held by Congress. While popular commentary often suggests that the theory of the “unitary executive” is little more than a recent invention of authoritarian-oriented conservative legal scholarship, the topic was extensively canvassed at the Constitutional Convention and formed a critical and central feature of presidential power in the Constitution. Indeed, it is all but identified by name in the commentary of the founding era. Alexander Hamilton, for example, provides an extended consideration of “unity” in the executive branch inFederalist #70. To understand what Hamilton means by “unity” in the executive, it is useful to understand the forms of plural executives with which Hamilton contrasted the unitary executive. In doing so, it’s important to distinguish different forms of the plural executive, not least because Hamilton criticized a very different form of plural executive than the type of plural executive employed in most US state governments today. Hamilton emphasizes both the need for unity in the executive and that the initial protection against executive overreach is democratic accountability. The two types of plural executive Hamilton inveighs against inFederalist #70are institutions in which, first, two or more individuals share the same executive power, and, secondly, executive councils whose “control and cooperation” is necessary for gubernatorial action, even if in the form of council involvement merely as “counselors” to the governor. Of note is that, in contrast to plural executives with two or more individuals concurrently or hierarchically sharing thesameexecutive power, the plural executive that a majority of US state governments have adopted horizontallypartitions separate executive powers or functions among different individuals. The separate officials then hold full or unitary executive power and responsibility within a limited policy or legal domain. These executive officials are elected separately from the governor and are independent of his direction and control. While the US Constitution rejects all forms of the plural executive, the distinction between the hierarchical/concurrent form of plural executive that Hamilton criticizes inFederalist #70and the horizontal form of the plural executive US state governments employ does blunt his criticism as applied to the state governmental form of the plural executive: Hamilton argues that shared or concurrent authority allows blame shifting among the actors sharing executive power and, as a result, confounds the ability of voters to hold executives responsible for administration. Because the respective domains of modern state plural executives are horizontally partitioned rather than vertically stacked, the modern state system doesn’t share this particular disability. Understanding the plural executive as the foil to the unitary executive provides a straightforward test for whether the principle of the unitary executive has been statutorily compromised: Whenever the design of an executive institution shares the characteristics of a plural executive, then it is inconsistent with the unitary executive. That is, if the president’s executive authority is shared concurrently or hierarchically with other officials, or if the president’s executive authority is partitioned to another institution, whether judicial, legislative, or an executive agency not controlled by the president, then the unitary form of the president’s executive power has been compromised. It may also be useful to note what the theory of the unitary executive does not entail. First, the theory asserts that the Constitution extends presidential control over only the executive branch; it does not extend presidential power over legislative or judicial matters. Thus, for example, President Truman’sattempt to assert presidential authority to nationalize the steel industryduring the Korean conflict—an assertion of legislative authority rather than executive authority—is not buttressed by the theory of a unitary executive. Further, attempts by Congresspromiscuously to delegate legislative authority to the executive branchare not endorsed by the theory. Rather, the doctrine seeks to recover the robust separation-of-powers doctrine underlying the US Constitution by reining in congressional attempts to circumvent democratic accountability by immunizing parts of the executive branch from the single elected executive branch official, the president. The justification for constitutionally creating plural executives at the state level, after all, is specifically to create executive offices independent of gubernatorial oversight and control. To be sure, the purpose of doing so is to enhance the performance and accountability of the distinct executive offices and functions; themeansof doing so, however, is to immunize these other offices from gubernatorial direction and control. If, for example, the state attorney general pursues legal policies at variance with the priorities of the governor, or even pursues legal policies for the state directly contrary to the governor’s express preferences or directions, the governor has no power to remove the attorney general. Thus, for example, legally limiting the president’s power to fire a member of the executive branch to “for cause” issues effectively endows the reviewing judge with the oversight authority akin to an executive council and therefore creates a plural executive. (We might note that inFederalist #70, Hamilton explains that the “unity” of the executive is destroyed when even merely a “part” of executive power is made subject “to the control and cooperation of others.”) The Unitary Executive in the Constitution’s System of Democratic Accountability Often overlooked in James Madison’s famous discussion of how the Constitution’s separation-of-powers system protects liberty inFederalist #51is that the institutional checks and balances discussed there are merely an “auxiliary precaution” to the “primary control on the government,” which is the democratic accountability of the different institutions to “the people.” So, too, a central feature of Hamilton’s argument about limitations on the executive branch in theFederalist #70is the president’s democratic accountability. And it is the lack of this democratic accountability of independent executive agencies and merit-protected executive bureaucrats that is a major concern with the statutorily created forms of the plural executive in the US national government. InFederalist #70, Alexander Hamilton famously observes that “energy in the executive is a leading character in the definition of good government.” He then discusses the institutional “ingredients” both for an energetic executive and safety against executive overreach: The ingredients which constitute energy in the executive areunity; duration; an adequate provision for its support; and competent powers. The ingredients which constitute safety in the republican sense are a due dependence on the people, and a due responsibility (emphasis added). Hamilton emphasizes both the need for unity in the executive and that the initial protection against executive overreach is democratic accountability (“a due dependence on the people”). He subsequently develops the connection between the two ingredients throughout the remainder ofFederalist #70. That is, he explains how the unitary executive promotes democratic accountability. This necessary condition for the energetic executive generates its own safeguard. InHumphrey’s Executor v. United States, the Court acknowledged that the removal of executive officials was an “exclusive and illimitable power” held by the president. To take a concrete example, in requesting the resignation of William Humphrey as a commissioner on the Federal Trade Commission in 1933, President Franklin Roosevelt explained, “that the aims and purposes of the Administration with respect to the work of the Commission can be carried out most effectively with personnel of my own selection.” FDR articulated a desire for a unity of purpose in the executive branch, a necessary condition for Hamilton’s constitutionally efficacious “energetic executive.” The alternative adopted by the Court inHumphrey’s Executor v. United Statesin effect created a plural executive design in which one executive official can work at cross purposes with another. This effectively destroys the needed “unity” of the executive as explained by Hamilton. WhileHumphrey’s Executoris widely taken as the Supreme Court’s green light for the constitutionality of independent executive agencies, the Court’s language is substantially more circumspect. In the decision, the Court made much of the claim that the work of the FTC at the time was not executive, but rather was only legislative and judicial work. While the Court danced around the issue, it nonetheless felt compelled to summarize thedictaregarding presidential authority vis-a-vis executive officials inMyers v. United Stateswith a breadth that literally recognizes no limit: The actual decision in the Myers case finds support in the theory that such an officer is merely one of the units in the executive department and, hence, inherently subject to theexclusive and illimitable power of removal by the Chief Executive, whose subordinate and aid he is. Putting asidedicta, which may be followed if sufficiently persuasive but which are not controlling, the necessary reach of the decision goes far enough to include all purely executive officers. It goes no farther; much less does it include an officer who occupies no place in the executive department andwho exercises no part of executive power vestedby the Constitution in the President (emphasis added). Even inHumphrey’s Executor, the Court acknowledged that the removal of executive officials was an “exclusive and illimitable power” held by the president. The Court inHumphrey’s Executoralso emphasized a different aspect of the FTC, that in setting up the FTC Congress designed the Commission to immunize it from presidential influence. That is, Congress designed the FTC to immunize it from democratic accountability. This, of course, is a critical aspect of modern bureaucratic organization in the US and implicates issues centrally related to executive power in the national government. Immunizing the Exercise of Executive Power from Democratic Accountability As noted earlier, Hamilton argues inFederalist #70that a necessary “ingredient” to promoting the safe exercise of executive power under the Constitution is the executive’s “due dependence on the people.” In that paper, Hamilton at length develops the argument that the unitary executive promotes democratic accountability by simplifying the lines of accountability, that is, by reducing the set of individuals whom voters need to hold responsible for the exercise of executive power to a single person, the president. There are two items to note immediately: First, while Hamilton regarded democratic accountability as a virtue, subsequent generations of American politicians and commentators did not, particularly during the Progressive era; the virtue of democratic accountability became the vice of partisan meddling by the president. Far from being an incidental aspect of bureaucratic design, the goal of many Progressive-era bureaucratic reforms was intentionally to immunize significant portions of the national bureaucracy from democratic influence. We might note that in seeking to immunize significant parts of the Federal bureaucracy from democratic accountability, the national government steps even further away from the unitary executive than do even state plural executives. In state design, the constitutionally independent heads of separate departments or divisions are themselves elected and so held democratically accountable. In contrast, the head officials in national-level independent commissions and agencies neither face elections nor are they accountable to elected officials. Needless to say, entire forests have been felled discussing the immunization of significant portions of the national executive bureaucracy from democratic accountability. It is important to underscore that while “democracy” is a god-term in the US, Americans did not design their institutions to channel democratic sentiments without mediation. After all, the theory of the Constitution itself seeks to limit some forms of democratic accountability in order to enhance others. Hamilton famously observed in theFederalist #71: There are some who would be inclined to regard the servile pliancy of the executive to a prevailing current, either in the community or in the legislature, as its best recommendation. … The republican principle demands that the deliberate sense of the community should govern the conduct of those to whom they intrust the management of their affairs; but it does not require an unqualified complaisance to every sudden breeze of passion, or to every transient impulse which the people may receive from the arts of men, who flatter their prejudices to betray their interests. The Court inHumphrey’s Executorsummarized the Congressional debates establishing the FTC in a similar line, albeit one pressed to the limit: The debates in both houses demonstrate that the prevailing view was that the commission was not to be “subject to anybody in the government but … only to the people of the United States”; free from “political domination or control” or the “probability or possibility of such a thing”; to be “separate and apart from any existing department of the government-not subject to the orders of the President” (ellipses in original). It is possible that better policy can be produced by independent agencies headed by Commissions with the sort of partisan balancing and electoral immunization as designed for the FTC and other independent agencies. But a couple of observations. First, belief in the real possibility of “non-partisan” governance was a hallmark of Progressive politics of the era. (Consider Progressive reforms to create non-partisan city governments and even the adoption of “non-partisan” state legislatures in Minnesota in 1913 and in Nebraska in 1934.) Nonetheless, the Court’s claim that the commission becomes “subject … only to the people of the United States” seems a curious one. How, exactly, was the FTC to be subject to the people of the United States without being subject to elected politicians or being subject to their own elections (as are state plural executives)? Secondly, the notion that statutorily splitting representation on the FTC between the two major parties makes an institution “free from political domination or control” is today (if not historically) theoretically suspect. After all, even in the 1930s and before, politicians and commentators intuitively knew that the pivotal or median voter on the FTC could dictate the outcome of a vote. To be sure, the parties were less polarized in the 1930s than they are today. But even a century ago, policymakers knew that whoever appointed the median commissioner could dictate commission policies in an entirely partisan fashion. Finally, whatever the wisdom of independent executive agencies, the most breathtaking aspect in the short quotation from the Court’s decision inHumphrey’s Executoris the Court’s gloss over the glaring constitutional conundrum: Exactly how does a commission that is “separate and apart from any existing department of the government” fit into the existing constitutional design no matter how liberally one wishes to construe the document? Even if we agree with the theory underlying the immunization of the FTC and other independent agencies (as well as merit-protected employees), the move represents a significant constitutional revision, one that we might want to implement via constitutional alteration, but one inconsistent with the Constitution’s theory of executive design. Returning presidential authority over the executive branch—all of it—by revivifying the unitary executive is one means that would increase the electoral responsiveness and democratic accountability of the bureaucracy. While I am open to the possibility that, appropriately amended, a fourth electorally unaccountable branch of the national government could generate better policy outcomes than one in which the entire executive branch (independent agencies as well as currently merit protected employees) is subject to immediate direction and oversight by the president, two considerations lead me to give the nod to the latter. First, the tremendous expansion of the administrative state over the last century would seem normatively to invite the extension of democratic control over the bureaucracy rather than its contraction. While I generally believe James Q. Wilson’s claim in his book,Bureaucracy, that career government bureaucrats are, for the most part, willing to follow the lead of political appointees at the head of their respective agencies, nonetheless there are issues of bureaucratic inertia and culture that presidents are elected to challenge and would do so if empowered with full executive authority. I frankly would expect the vast majority of career bureaucrats to continue from one administration to the next even with a revivified unitary executive. Nonetheless, as FDR explained in his letter to Humphreys, presidents should be able to staff executive agencies with bureaucrats who fully and enthusiastically reflect the president’s aspirations for the executive branch. This is not so much a matter of empowering presidents in themselves, but of empowering elections as the checks and balances they were to be in the constitutional design. At least if Americans are still committed to democratic decision-making. The return of presidential authority over the executive branch—all of it—holds out the additional possibility of stimulating interest in elections. The reason is straightforward: who is elected president would matter more with greater presidential authority to direct the policy outcomes of the executive branch. The implications for American voters, however, are even more far-reaching than that of stimulating their interest in elections. Increasing Presidential Authority Can Decrease the Authoritarian Temptation There’s a further implication of restoring electoral accountability of the national bureaucracy by revivifying the unitary executive: I suspect in something of an ironic twist thatincreasingpresidential authority over the executive branch candecreasethe authoritarian temptation many Americans already report in surveys. One driver of modern populist politics, particularly on the right, is the feeling that vast sections of the national bureaucracy are immune to electoral outcomes. That is, all continues as it was despite what occurs in elections. This has promoted a feeling of political inefficacy among voters, particularly on the right. This, in turn, has increased populist demands for a “strong leader” and increased skepticism of democracy in America. Surveys indicate greater interest among Americans than in peer democratic nations in a strong leader and decreased confidence in democracy. For over ten years now,surveyshave reported that the percentage of support of Americans for a “strong leader” is about a third higher than in democratic peer nations. And the percentage of Americans who believe that democracy is “bad” or “very bad” is about three times higher than in democratic peer nations. (More recent survey results can be readhere.) So, too, according to anIPSOSpoll from late 2023, 40 percent of all Americans (and 56 percent of Republicans) believe that “to fix [the US] we need a strong leader willing to break the rules.” Sixty-six percent of all Americans (and 76 percent of Republicans) believe that “[the US] needs a strong leader to take back the country from the rich and powerful.” And 63 percent of Americans (and 74 percent of Republicans) believe that “experts in this country don’t understand the lives of people like me.” More generally,almost 90 percentof Americans believe that the US political system is broken, with63 percentexpressing little to no confidence in the future of the US political system. I would suggest that a good amount of frustration these surveys report among Americans stems from the inelasticity of the bureaucratic state to electoral change: presidents come and go, but the bureaucracy soldiers on with little change. The exasperation does not result in resignation; rather, the thought of many Americans is that if the election of mainstream Republicans cannot alter the course of the national bureaucracy, then perhaps electing a strong leader “who breaks the rules” can do so. Because the authority of the elected president is limited over the executive branch, and because no alternative electoral mechanism exists to assert control over the national bureaucracy, Americans increasingly feel democratic participation doesn’t matter. This is the concern with the so-called “deep state.” Given that the design of the national bureaucracy is intended effectively to immunize much of it from electoral accountability, many voters, particularly on the right, feel the only option to change things is to elect a strong leader who is a rule breaker. Returning presidential authority over the executive branch—all of it—by revivifying the unitary executive is one means that would increase the electoral responsiveness and democratic accountability of the bureaucracy. This is a first and critical check on executive power, in addition to the checks and balances that nest executive power within a system with distinctly defined (and enforced) legislative and judicial powers. While this change would increase the president’s power over the executive branch, this increased authority nonetheless enhances the checks and balances of the Constitution’s separation-of-power system. Further, expanding the authority of the president over the executive branch, and so expanding the democratic accountability and responsiveness of the national bureaucracy, holds out the promise of addressing an important cause of the disturbing belief, increasing among Americans, that nothing short of a “strong leader willing to break the rules” could change the trajectory of the modern bureaucratic state. A unitary executive is both constitutionally demanded and conducive to democratic governance. **Effective Governance and the Executive** **** **** **The Myth of Victimization** **** **** **What’s Behind the “Woke Right”?** **** **** **Rise of Reform** **** **** **MacIntyre the Mentor** **** **** **A Touch of Aristocracy** **** **** Our newsletters highlight and offer a deeper view of the best that is being thought and said in law, politics and culture. **Effective Governance and the Executive** **** **** **Related** **Inescapable Delusions** **** **** Is the story of WeWork now typical or emblematic of—or even necessitated by—our current economic system? **Today’s Missouri Compromise Is Bad News** **** **** **The Nation is the Heart of the Matter** **** **** The COVID pandemic and Russia's invasion of Ukraine have both reaffirmed the importance of the free nation-state. **Popular** **The Myth of Victimization** **** **** **What’s Behind the “Woke Right”?** **** **** **Rise of Reform** **** **** **MacIntyre the Mentor** **** **** **A Touch of Aristocracy** **** **** Law & Libertyis an online magazine published byLiberty Fundand committed to a society of free and responsible persons living under the rule of law. We publish essays, book reviews, podcasts, and forum debates that elevate discourse on law, policy, political theory, economics, education, and culture, all with an eye to understanding and cultivating a free society. About Staff Submissions Contact Part of the Liberty Fund network © 2025 Liberty Fund, Inc. The opinions expressed on Law & Liberty are solely those of the contributors to the site and do not reflect the opinions of Liberty Fund."}