{"id": 1967, "name": "Fight the New Drug", "domain": "fightthenewdrug.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://fightthenewdrug.org/national-survey-reveals-73-of-teens-have-seen-porn-many-watching-it-at-school/", "title": "National Survey Reveals 73 Of Teens Have Seen Porn Many Watching It At School", "content": "Donate No Porn November 2024 Shop Live Presentations ArticlesGet The FactsRecent Articles Get The Facts Recent Articles Get The Facts Recent Articles VideosDocumentaryShort Videos Documentary Short Videos Documentary Short Videos Shop Donate search Menu **National Survey Reveals 73% Of Teens Have Seen Porn—Many Watching It at School** A National Survey conducted by Common Sense sheds light on the dangerous realities of teens and online pornography. According to the report, three-quarters of teens say they've seen porn by age 17, and the average age of first exposure is just 12 years old. Within seconds, teens can access virtually any type of content from the palm of their hand, including porn. It’s more accessible than ever before. Its normalization has made it part of teen culture. A report titled“Teens and Pornography”1. Robb, M.B., & Mann, S. (2023). Teens and pornography. San Francisco, CA: Common Sense.Copyput together by Common Sense includes data collected from teens 13-17 years old with various backgrounds. Of the teens surveyed, three-quarters said they had seen porn and that this exposure shapes how they view sex and sexual relationships. All participants who reported seeing porn said they were exposed by age 12.1. Robb, M.B., & Mann, S. (2023). Teens and pornography. San Francisco, CA: Common Sense.CopyAnother 15% said they saw it for the first time when they were 10 years old or younger.1. Robb, M.B., & Mann, S. (2023). Teens and pornography. San Francisco, CA: Common Sense.CopyMost teens (73%) reported that they have consumed pornography.1. Robb, M.B., & Mann, S. (2023). Teens and pornography. San Francisco, CA: Common Sense.CopyPornography used to be much more difficult to access. Today teens can access hardcore porn with one click. From the same report, of those who have seen online pornography, 44% of teens reported that they viewed it intentionally. In comparison, 58% said they viewed it accidentally, a majority saying their accidental encounter came from clicking a link, a search engine result, an online ad, or on social media in some way.Whether they want to see it or not, these teens, just 13-17 years old, often have no choice.Porn at schoolWhile these statistics regarding porn consumption are concerning, what’s more alarming is how pornography, for many respondents, is part of the everyday school experience.Overall, 30% of all teens (41% of teens who said they had been exposed to pornography) reported that they had been exposed during the school day, most teens (60%) reported they saw it several times a month, and (40%) said they saw it at school weekly, some from school-issued devices.Related:Teens Watch Porn to Learn About Sex—This Is What Porn Teaches ThemThese survey statistics further show that teens who attend private schools are almost twice as likely to be exposed to porn during school versus those in public schools.Pornography has so profoundly infiltrated teen culture that it’s become just part of the everyday school experience. We know kids are accessing more pornography at school than ever before, but we have yet to scratch the surface of what the consequences of viewing this type of content at school could mean. How is pornography impacting learning, and how is it altering school safety and culture?If you are a parent, educator, or administrator seeking a solution in your circle for this ever-growing issue, we invite you to consider ourage-appropriate live presentation program.Teens mixed feelings toward pornWhile most teens report that they’ve seen porn, responses regarding their overall attitude and feelings surrounding porn conflicted. Most teens said that they feel “OK” about how much porn they watch (67%), but half also reported feeling “guilty or ashamed” after watching porn.As we know, shame is never productive when discussing porn, and it’s apparent in this report it does nothing to dissuade someone from consuming porn.Even more concerning is that 67% of those who reported seeing porn by accident said they feel guilty or ashamed for seeing porn, even though it wasn’t their fault. Often this shame is a result of a lack of healthy conversations surrounding pornography.Related:Oral Before Kissing: Porn Culture Has Changed Teens’ First Sexual EncountersHow porn harmsBesides feeling unhealthy feelings of shame, this report revealed that the top reason teens intentionally consumed porn was that they thought porn could better help them understand their sexual preferences.About half, 45%, of the participants said that pornography gives helpful information about sex, and another 45% said they watch to “find out what arouses and excites them.”Respondents also said they have also learned via porn “how to have sex” (79%), “about human bodies and anatomy” (79%), and the “types of behaviors … likely to feel pleasurable” (73%) and “not pleasurable” (60%) to a partner.That’s concerning—especially considering how toxic and harmful porn can be. One 2021 study, for example, found that at least 1 in 3 and as many as 9 in 10 porn videos show sexual violence oraggression.2. Vera-Gray, F., McGlynn, C., Kureshi, I., & Butterby, K. (2021). Sexual violence as a sexual script in mainstream online pornography. The British Journal of Criminology, doi:10.1093/bjc/azab035Copy3. Fritz, N., Malic, V., Paul, B., & Zhou, Y. (2020). A descriptive analysis of the types, targets, and relative frequency of aggression in mainstream pornography. Archives of Sexual Behavior, 49(8), 3041-3053. doi:10.1007/s10508-020-01773-0Copy4. Bridges, A. J., Wosnitzer, R., Scharrer, E., Sun, C., & Liberman, R. (2010). Aggression and sexual behavior in best-selling pornography videos: a content analysis update. Violence against women, 16(10), 1065–1085. https://doi.org/10.1177/1077801210382866CopyAnd this is where they are learning how to have sex.From the“Teens and Pornography”report, 52% of teens who consume pornography said they’d seen pornography depicting what appears to be rape, choking, or someone in pain. Additionally, just 1 in 3 reported seeing someone ask for consent before engaging in sexual activity.So while teens are turning to porn to learn about sex, instead, they are learning unhealthy, unrealistic toxic views on sex, but there’s more.Respondents also reported viewing racial and ethnic stereotypes in pornography. Over 50% said they encountered pornography depicting Black people in a stereotypical way “often” or “sometimes,” and many reported seeing pornography stereotypes when portraying Latino/a/x people (50%), Asian people (46%), and Middle Eastern people (26%). Additionally, more than 50% report seeing porn that shows stereotypical displays of gender and sexual orientation.In addition to fostering dangerous views on sex and tolerance for discrimination, violence, and racism, we know through years of academic research pornography’s impact on mental health, relationships, and society, including fueling the demand for sex trafficking.Related:Can Watching Porn Negatively Impact Mental Health?Flipping the scriptLess than half of the teens included in this survey said they’ve had a conversation about pornography with a trusted adult. Not great. However, of those who did say they had some form of dialogue, 71% reported that “these talks encouraged them to find other ways to “explore sex and sexuality.”Many teens’ comments suggest that they would like to discuss their experiences with pornography with an adult. Unfortunately, they felt they didn’t know how to start the conversation or who to talk to.At Fight the New Drug, we understand the power of conversation in this movement. We know it can be complex and intimidating. To make it a little easier, we’ve built out educational resources to equip individuals to discuss the topic of pornography in a healthy way.This conversation blueprintprovides direction and insight for individuals, partners, parents, and teens to start the conversation surrounding pornography and how to keep it going.Youth-Focused Presentation ProgramThis engaging, unique, shame-free presentation focuses on providing individuals, especially youth, the opportunity to make informed decisions regarding pornography. Specifically crafted for each audience, we’ve presented to middle schools, junior highs, high schools, colleges, and various community groups worldwide. We have a parent-specific presentation to help educate parents and guardians on the harms of porn and how to talk with their kids. Start the conversation in your school or community with a Fight the New Drug presentation.Teens are more vulnerable to the dangers of pornography than ever before, but there are things we can do. It’s up to us to rise up and spread awareness on the harms of pornography in our own communities.Access the full report“Teens and Pornography”, referred to throughout this article, by Common Sense.The benefits of a youth presentation on pornNow more than ever before, porn has become normalized in our digital world. Because of this, awareness and educationon its well-documented negative impactshas become increasingly important.Research suggests that school staff and administrators see pornography as a serious issue that affects their school’s cultural climate surrounding sexual violence, and that education programs on porn help them feel more confident in addressing the issue and preventing sexual harassment.Maas, M. K., Gal, T., Cary, K. M., & Greer, K. (2022). Popular culture and pornography education to improve the efficacy of secondary school staff response to student sexual harassment., 1-23. doi:10.1080/15546128.2022.2076757CopyWe take a three-dimensional approach to raising awareness on the harmful effects of pornography in society, soin addition to creating tools and resourcesfor our global supporter base to share, we also love getting face-to-face with people in their schools and cities to provideresearch-backed informationon this important issue. Fight the New Drug’sage-appropriate and engaging presentationshighlight research from respected academic institutions that demonstrates the significant impacts of porn consumption on individuals, relationships, and society.Offering presentations customized for each audience, all Fight the New Drug presentations align withour missionasa non-religiousandnon-legislative organizationeducating with science, facts, and personal accounts.We can provide engaging, empowering, and educational presentations for these types of audiences:Middle School/Junior HighHigh SchoolParent/CommunityCollege/UniversityKeynoteConsiderbooking Fight the New Drugfor your next live presentation or youth education event.What are the learning outcomes?Every school, community, parent, or conference presentation will equip attendees with comprehensive, age-appropriate information about:How pornimpacts the brainHow porncan harm relationshipsHow pornaffects societyHealthyconversations about pornFree resources—educationalandrecoveryWe empower audiences to make educated decisions that can better equip them to love themselves, have healthy relationships, and make a positive difference in the world.What are you waiting for? Click here to learn more and book us today. Pornography used to be much more difficult to access. Today teens can access hardcore porn with one click. From the same report, of those who have seen online pornography, 44% of teens reported that they viewed it intentionally. In comparison, 58% said they viewed it accidentally, a majority saying their accidental encounter came from clicking a link, a search engine result, an online ad, or on social media in some way. Whether they want to see it or not, these teens, just 13-17 years old, often have no choice. While these statistics regarding porn consumption are concerning, what’s more alarming is how pornography, for many respondents, is part of the everyday school experience. Overall, 30% of all teens (41% of teens who said they had been exposed to pornography) reported that they had been exposed during the school day, most teens (60%) reported they saw it several times a month, and (40%) said they saw it at school weekly, some from school-issued devices. Related:Teens Watch Porn to Learn About Sex—This Is What Porn Teaches Them These survey statistics further show that teens who attend private schools are almost twice as likely to be exposed to porn during school versus those in public schools. Pornography has so profoundly infiltrated teen culture that it’s become just part of the everyday school experience. We know kids are accessing more pornography at school than ever before, but we have yet to scratch the surface of what the consequences of viewing this type of content at school could mean. How is pornography impacting learning, and how is it altering school safety and culture? If you are a parent, educator, or administrator seeking a solution in your circle for this ever-growing issue, we invite you to consider ourage-appropriate live presentation program. While most teens report that they’ve seen porn, responses regarding their overall attitude and feelings surrounding porn conflicted. Most teens said that they feel “OK” about how much porn they watch (67%), but half also reported feeling “guilty or ashamed” after watching porn. As we know, shame is never productive when discussing porn, and it’s apparent in this report it does nothing to dissuade someone from consuming porn. Even more concerning is that 67% of those who reported seeing porn by accident said they feel guilty or ashamed for seeing porn, even though it wasn’t their fault. Often this shame is a result of a lack of healthy conversations surrounding pornography. Related:Oral Before Kissing: Porn Culture Has Changed Teens’ First Sexual Encounters Besides feeling unhealthy feelings of shame, this report revealed that the top reason teens intentionally consumed porn was that they thought porn could better help them understand their sexual preferences. About half, 45%, of the participants said that pornography gives helpful information about sex, and another 45% said they watch to “find out what arouses and excites them.” Respondents also said they have also learned via porn “how to have sex” (79%), “about human bodies and anatomy” (79%), and the “types of behaviors … likely to feel pleasurable” (73%) and “not pleasurable” (60%) to a partner. That’s concerning—especially considering how toxic and harmful porn can be. One 2021 study, for example, found that at least 1 in 3 and as many as 9 in 10 porn videos show sexual violence oraggression.2. Vera-Gray, F., McGlynn, C., Kureshi, I., & Butterby, K. (2021). Sexual violence as a sexual script in mainstream online pornography. The British Journal of Criminology, doi:10.1093/bjc/azab035Copy3. Fritz, N., Malic, V., Paul, B., & Zhou, Y. (2020). A descriptive analysis of the types, targets, and relative frequency of aggression in mainstream pornography. Archives of Sexual Behavior, 49(8), 3041-3053. doi:10.1007/s10508-020-01773-0Copy4. Bridges, A. J., Wosnitzer, R., Scharrer, E., Sun, C., & Liberman, R. (2010). Aggression and sexual behavior in best-selling pornography videos: a content analysis update. Violence against women, 16(10), 1065–1085. https://doi.org/10.1177/1077801210382866CopyAnd this is where they are learning how to have sex.From the“Teens and Pornography”report, 52% of teens who consume pornography said they’d seen pornography depicting what appears to be rape, choking, or someone in pain. Additionally, just 1 in 3 reported seeing someone ask for consent before engaging in sexual activity.So while teens are turning to porn to learn about sex, instead, they are learning unhealthy, unrealistic toxic views on sex, but there’s more.Respondents also reported viewing racial and ethnic stereotypes in pornography. Over 50% said they encountered pornography depicting Black people in a stereotypical way “often” or “sometimes,” and many reported seeing pornography stereotypes when portraying Latino/a/x people (50%), Asian people (46%), and Middle Eastern people (26%). Additionally, more than 50% report seeing porn that shows stereotypical displays of gender and sexual orientation.In addition to fostering dangerous views on sex and tolerance for discrimination, violence, and racism, we know through years of academic research pornography’s impact on mental health, relationships, and society, including fueling the demand for sex trafficking.Related:Can Watching Porn Negatively Impact Mental Health?Flipping the scriptLess than half of the teens included in this survey said they’ve had a conversation about pornography with a trusted adult. Not great. However, of those who did say they had some form of dialogue, 71% reported that “these talks encouraged them to find other ways to “explore sex and sexuality.”Many teens’ comments suggest that they would like to discuss their experiences with pornography with an adult. Unfortunately, they felt they didn’t know how to start the conversation or who to talk to.At Fight the New Drug, we understand the power of conversation in this movement. We know it can be complex and intimidating. To make it a little easier, we’ve built out educational resources to equip individuals to discuss the topic of pornography in a healthy way.This conversation blueprintprovides direction and insight for individuals, partners, parents, and teens to start the conversation surrounding pornography and how to keep it going.Youth-Focused Presentation ProgramThis engaging, unique, shame-free presentation focuses on providing individuals, especially youth, the opportunity to make informed decisions regarding pornography. Specifically crafted for each audience, we’ve presented to middle schools, junior highs, high schools, colleges, and various community groups worldwide. We have a parent-specific presentation to help educate parents and guardians on the harms of porn and how to talk with their kids. Start the conversation in your school or community with a Fight the New Drug presentation.Teens are more vulnerable to the dangers of pornography than ever before, but there are things we can do. It’s up to us to rise up and spread awareness on the harms of pornography in our own communities.Access the full report“Teens and Pornography”, referred to throughout this article, by Common Sense.The benefits of a youth presentation on pornNow more than ever before, porn has become normalized in our digital world. Because of this, awareness and educationon its well-documented negative impactshas become increasingly important.Research suggests that school staff and administrators see pornography as a serious issue that affects their school’s cultural climate surrounding sexual violence, and that education programs on porn help them feel more confident in addressing the issue and preventing sexual harassment.Maas, M. K., Gal, T., Cary, K. M., & Greer, K. (2022). Popular culture and pornography education to improve the efficacy of secondary school staff response to student sexual harassment., 1-23. doi:10.1080/15546128.2022.2076757CopyWe take a three-dimensional approach to raising awareness on the harmful effects of pornography in society, soin addition to creating tools and resourcesfor our global supporter base to share, we also love getting face-to-face with people in their schools and cities to provideresearch-backed informationon this important issue. Fight the New Drug’sage-appropriate and engaging presentationshighlight research from respected academic institutions that demonstrates the significant impacts of porn consumption on individuals, relationships, and society.Offering presentations customized for each audience, all Fight the New Drug presentations align withour missionasa non-religiousandnon-legislative organizationeducating with science, facts, and personal accounts.We can provide engaging, empowering, and educational presentations for these types of audiences:Middle School/Junior HighHigh SchoolParent/CommunityCollege/UniversityKeynoteConsiderbooking Fight the New Drugfor your next live presentation or youth education event.What are the learning outcomes?Every school, community, parent, or conference presentation will equip attendees with comprehensive, age-appropriate information about:How pornimpacts the brainHow porncan harm relationshipsHow pornaffects societyHealthyconversations about pornFree resources—educationalandrecoveryWe empower audiences to make educated decisions that can better equip them to love themselves, have healthy relationships, and make a positive difference in the world.What are you waiting for? Click here to learn more and book us today. And this is where they are learning how to have sex. From the“Teens and Pornography”report, 52% of teens who consume pornography said they’d seen pornography depicting what appears to be rape, choking, or someone in pain. Additionally, just 1 in 3 reported seeing someone ask for consent before engaging in sexual activity. So while teens are turning to porn to learn about sex, instead, they are learning unhealthy, unrealistic toxic views on sex, but there’s more. Respondents also reported viewing racial and ethnic stereotypes in pornography. Over 50% said they encountered pornography depicting Black people in a stereotypical way “often” or “sometimes,” and many reported seeing pornography stereotypes when portraying Latino/a/x people (50%), Asian people (46%), and Middle Eastern people (26%). Additionally, more than 50% report seeing porn that shows stereotypical displays of gender and sexual orientation. In addition to fostering dangerous views on sex and tolerance for discrimination, violence, and racism, we know through years of academic research pornography’s impact on mental health, relationships, and society, including fueling the demand for sex trafficking. Related:Can Watching Porn Negatively Impact Mental Health? Less than half of the teens included in this survey said they’ve had a conversation about pornography with a trusted adult. Not great. However, of those who did say they had some form of dialogue, 71% reported that “these talks encouraged them to find other ways to “explore sex and sexuality.” Many teens’ comments suggest that they would like to discuss their experiences with pornography with an adult. Unfortunately, they felt they didn’t know how to start the conversation or who to talk to. At Fight the New Drug, we understand the power of conversation in this movement. We know it can be complex and intimidating. To make it a little easier, we’ve built out educational resources to equip individuals to discuss the topic of pornography in a healthy way. This conversation blueprintprovides direction and insight for individuals, partners, parents, and teens to start the conversation surrounding pornography and how to keep it going. This engaging, unique, shame-free presentation focuses on providing individuals, especially youth, the opportunity to make informed decisions regarding pornography. Specifically crafted for each audience, we’ve presented to middle schools, junior highs, high schools, colleges, and various community groups worldwide. We have a parent-specific presentation to help educate parents and guardians on the harms of porn and how to talk with their kids. Start the conversation in your school or community with a Fight the New Drug presentation. Teens are more vulnerable to the dangers of pornography than ever before, but there are things we can do. It’s up to us to rise up and spread awareness on the harms of pornography in our own communities. Access the full report“Teens and Pornography”, referred to throughout this article, by Common Sense. Now more than ever before, porn has become normalized in our digital world. Because of this, awareness and educationon its well-documented negative impactshas become increasingly important. Research suggests that school staff and administrators see pornography as a serious issue that affects their school’s cultural climate surrounding sexual violence, and that education programs on porn help them feel more confident in addressing the issue and preventing sexual harassment.Maas, M. K., Gal, T., Cary, K. M., & Greer, K. (2022). Popular culture and pornography education to improve the efficacy of secondary school staff response to student sexual harassment., 1-23. doi:10.1080/15546128.2022.2076757Copy We take a three-dimensional approach to raising awareness on the harmful effects of pornography in society, soin addition to creating tools and resourcesfor our global supporter base to share, we also love getting face-to-face with people in their schools and cities to provideresearch-backed informationon this important issue. Fight the New Drug’sage-appropriate and engaging presentationshighlight research from respected academic institutions that demonstrates the significant impacts of porn consumption on individuals, relationships, and society. Offering presentations customized for each audience, all Fight the New Drug presentations align withour missionasa non-religiousandnon-legislative organizationeducating with science, facts, and personal accounts. We can provide engaging, empowering, and educational presentations for these types of audiences: Middle School/Junior High High School Parent/Community College/University Keynote Considerbooking Fight the New Drugfor your next live presentation or youth education event. What are the learning outcomes? Every school, community, parent, or conference presentation will equip attendees with comprehensive, age-appropriate information about: How pornimpacts the brain How porncan harm relationships How pornaffects society Healthyconversations about porn Free resources—educationalandrecovery We empower audiences to make educated decisions that can better equip them to love themselves, have healthy relationships, and make a positive difference in the world. Pornography used to be much more difficult to access. Today teens can access hardcore porn with one click. From the same report, of those who have seen online pornography, 44% of teens reported that they viewed it intentionally. In comparison, 58% said they viewed it accidentally, a majority saying their accidental encounter came from clicking a link, a search engine result, an online ad, or on social media in some way. Whether they want to see it or not, these teens, just 13-17 years old, often have no choice. While these statistics regarding porn consumption are concerning, what’s more alarming is how pornography, for many respondents, is part of the everyday school experience. Overall, 30% of all teens (41% of teens who said they had been exposed to pornography) reported that they had been exposed during the school day, most teens (60%) reported they saw it several times a month, and (40%) said they saw it at school weekly, some from school-issued devices. Related:Teens Watch Porn to Learn About Sex—This Is What Porn Teaches Them These survey statistics further show that teens who attend private schools are almost twice as likely to be exposed to porn during school versus those in public schools. Pornography has so profoundly infiltrated teen culture that it’s become just part of the everyday school experience. We know kids are accessing more pornography at school than ever before, but we have yet to scratch the surface of what the consequences of viewing this type of content at school could mean. How is pornography impacting learning, and how is it altering school safety and culture? If you are a parent, educator, or administrator seeking a solution in your circle for this ever-growing issue, we invite you to consider ourage-appropriate live presentation program. While most teens report that they’ve seen porn, responses regarding their overall attitude and feelings surrounding porn conflicted. Most teens said that they feel “OK” about how much porn they watch (67%), but half also reported feeling “guilty or ashamed” after watching porn. As we know, shame is never productive when discussing porn, and it’s apparent in this report it does nothing to dissuade someone from consuming porn. Even more concerning is that 67% of those who reported seeing porn by accident said they feel guilty or ashamed for seeing porn, even though it wasn’t their fault. Often this shame is a result of a lack of healthy conversations surrounding pornography. Related:Oral Before Kissing: Porn Culture Has Changed Teens’ First Sexual Encounters Besides feeling unhealthy feelings of shame, this report revealed that the top reason teens intentionally consumed porn was that they thought porn could better help them understand their sexual preferences. About half, 45%, of the participants said that pornography gives helpful information about sex, and another 45% said they watch to “find out what arouses and excites them.” Respondents also said they have also learned via porn “how to have sex” (79%), “about human bodies and anatomy” (79%), and the “types of behaviors … likely to feel pleasurable” (73%) and “not pleasurable” (60%) to a partner. That’s concerning—especially considering how toxic and harmful porn can be. One 2021 study, for example, found that at least 1 in 3 and as many as 9 in 10 porn videos show sexual violence oraggression.2. Vera-Gray, F., McGlynn, C., Kureshi, I., & Butterby, K. (2021). Sexual violence as a sexual script in mainstream online pornography. The British Journal of Criminology, doi:10.1093/bjc/azab035Copy3. Fritz, N., Malic, V., Paul, B., & Zhou, Y. (2020). A descriptive analysis of the types, targets, and relative frequency of aggression in mainstream pornography. Archives of Sexual Behavior, 49(8), 3041-3053. doi:10.1007/s10508-020-01773-0Copy4. Bridges, A. J., Wosnitzer, R., Scharrer, E., Sun, C., & Liberman, R. (2010). Aggression and sexual behavior in best-selling pornography videos: a content analysis update. Violence against women, 16(10), 1065–1085. https://doi.org/10.1177/1077801210382866CopyAnd this is where they are learning how to have sex.From the“Teens and Pornography”report, 52% of teens who consume pornography said they’d seen pornography depicting what appears to be rape, choking, or someone in pain. Additionally, just 1 in 3 reported seeing someone ask for consent before engaging in sexual activity.So while teens are turning to porn to learn about sex, instead, they are learning unhealthy, unrealistic toxic views on sex, but there’s more.Respondents also reported viewing racial and ethnic stereotypes in pornography. Over 50% said they encountered pornography depicting Black people in a stereotypical way “often” or “sometimes,” and many reported seeing pornography stereotypes when portraying Latino/a/x people (50%), Asian people (46%), and Middle Eastern people (26%). Additionally, more than 50% report seeing porn that shows stereotypical displays of gender and sexual orientation.In addition to fostering dangerous views on sex and tolerance for discrimination, violence, and racism, we know through years of academic research pornography’s impact on mental health, relationships, and society, including fueling the demand for sex trafficking.Related:Can Watching Porn Negatively Impact Mental Health?Flipping the scriptLess than half of the teens included in this survey said they’ve had a conversation about pornography with a trusted adult. Not great. However, of those who did say they had some form of dialogue, 71% reported that “these talks encouraged them to find other ways to “explore sex and sexuality.”Many teens’ comments suggest that they would like to discuss their experiences with pornography with an adult. Unfortunately, they felt they didn’t know how to start the conversation or who to talk to.At Fight the New Drug, we understand the power of conversation in this movement. We know it can be complex and intimidating. To make it a little easier, we’ve built out educational resources to equip individuals to discuss the topic of pornography in a healthy way.This conversation blueprintprovides direction and insight for individuals, partners, parents, and teens to start the conversation surrounding pornography and how to keep it going.Youth-Focused Presentation ProgramThis engaging, unique, shame-free presentation focuses on providing individuals, especially youth, the opportunity to make informed decisions regarding pornography. Specifically crafted for each audience, we’ve presented to middle schools, junior highs, high schools, colleges, and various community groups worldwide. We have a parent-specific presentation to help educate parents and guardians on the harms of porn and how to talk with their kids. Start the conversation in your school or community with a Fight the New Drug presentation.Teens are more vulnerable to the dangers of pornography than ever before, but there are things we can do. It’s up to us to rise up and spread awareness on the harms of pornography in our own communities.Access the full report“Teens and Pornography”, referred to throughout this article, by Common Sense.The benefits of a youth presentation on pornNow more than ever before, porn has become normalized in our digital world. Because of this, awareness and educationon its well-documented negative impactshas become increasingly important.Research suggests that school staff and administrators see pornography as a serious issue that affects their school’s cultural climate surrounding sexual violence, and that education programs on porn help them feel more confident in addressing the issue and preventing sexual harassment.Maas, M. K., Gal, T., Cary, K. M., & Greer, K. (2022). Popular culture and pornography education to improve the efficacy of secondary school staff response to student sexual harassment., 1-23. doi:10.1080/15546128.2022.2076757CopyWe take a three-dimensional approach to raising awareness on the harmful effects of pornography in society, soin addition to creating tools and resourcesfor our global supporter base to share, we also love getting face-to-face with people in their schools and cities to provideresearch-backed informationon this important issue. Fight the New Drug’sage-appropriate and engaging presentationshighlight research from respected academic institutions that demonstrates the significant impacts of porn consumption on individuals, relationships, and society.Offering presentations customized for each audience, all Fight the New Drug presentations align withour missionasa non-religiousandnon-legislative organizationeducating with science, facts, and personal accounts.We can provide engaging, empowering, and educational presentations for these types of audiences:Middle School/Junior HighHigh SchoolParent/CommunityCollege/UniversityKeynoteConsiderbooking Fight the New Drugfor your next live presentation or youth education event.What are the learning outcomes?Every school, community, parent, or conference presentation will equip attendees with comprehensive, age-appropriate information about:How pornimpacts the brainHow porncan harm relationshipsHow pornaffects societyHealthyconversations about pornFree resources—educationalandrecoveryWe empower audiences to make educated decisions that can better equip them to love themselves, have healthy relationships, and make a positive difference in the world.What are you waiting for? Click here to learn more and book us today. And this is where they are learning how to have sex. From the“Teens and Pornography”report, 52% of teens who consume pornography said they’d seen pornography depicting what appears to be rape, choking, or someone in pain. Additionally, just 1 in 3 reported seeing someone ask for consent before engaging in sexual activity. So while teens are turning to porn to learn about sex, instead, they are learning unhealthy, unrealistic toxic views on sex, but there’s more. Respondents also reported viewing racial and ethnic stereotypes in pornography. Over 50% said they encountered pornography depicting Black people in a stereotypical way “often” or “sometimes,” and many reported seeing pornography stereotypes when portraying Latino/a/x people (50%), Asian people (46%), and Middle Eastern people (26%). Additionally, more than 50% report seeing porn that shows stereotypical displays of gender and sexual orientation. In addition to fostering dangerous views on sex and tolerance for discrimination, violence, and racism, we know through years of academic research pornography’s impact on mental health, relationships, and society, including fueling the demand for sex trafficking. Related:Can Watching Porn Negatively Impact Mental Health? Less than half of the teens included in this survey said they’ve had a conversation about pornography with a trusted adult. Not great. However, of those who did say they had some form of dialogue, 71% reported that “these talks encouraged them to find other ways to “explore sex and sexuality.” Many teens’ comments suggest that they would like to discuss their experiences with pornography with an adult. Unfortunately, they felt they didn’t know how to start the conversation or who to talk to. At Fight the New Drug, we understand the power of conversation in this movement. We know it can be complex and intimidating. To make it a little easier, we’ve built out educational resources to equip individuals to discuss the topic of pornography in a healthy way. This conversation blueprintprovides direction and insight for individuals, partners, parents, and teens to start the conversation surrounding pornography and how to keep it going. This engaging, unique, shame-free presentation focuses on providing individuals, especially youth, the opportunity to make informed decisions regarding pornography. Specifically crafted for each audience, we’ve presented to middle schools, junior highs, high schools, colleges, and various community groups worldwide. We have a parent-specific presentation to help educate parents and guardians on the harms of porn and how to talk with their kids. Start the conversation in your school or community with a Fight the New Drug presentation. Teens are more vulnerable to the dangers of pornography than ever before, but there are things we can do. It’s up to us to rise up and spread awareness on the harms of pornography in our own communities. Access the full report“Teens and Pornography”, referred to throughout this article, by Common Sense. Now more than ever before, porn has become normalized in our digital world. Because of this, awareness and educationon its well-documented negative impactshas become increasingly important. Research suggests that school staff and administrators see pornography as a serious issue that affects their school’s cultural climate surrounding sexual violence, and that education programs on porn help them feel more confident in addressing the issue and preventing sexual harassment.Maas, M. K., Gal, T., Cary, K. M., & Greer, K. (2022). Popular culture and pornography education to improve the efficacy of secondary school staff response to student sexual harassment., 1-23. doi:10.1080/15546128.2022.2076757Copy We take a three-dimensional approach to raising awareness on the harmful effects of pornography in society, soin addition to creating tools and resourcesfor our global supporter base to share, we also love getting face-to-face with people in their schools and cities to provideresearch-backed informationon this important issue. Fight the New Drug’sage-appropriate and engaging presentationshighlight research from respected academic institutions that demonstrates the significant impacts of porn consumption on individuals, relationships, and society. Offering presentations customized for each audience, all Fight the New Drug presentations align withour missionasa non-religiousandnon-legislative organizationeducating with science, facts, and personal accounts. We can provide engaging, empowering, and educational presentations for these types of audiences: Middle School/Junior High High School Parent/Community College/University Keynote Considerbooking Fight the New Drugfor your next live presentation or youth education event. What are the learning outcomes? Every school, community, parent, or conference presentation will equip attendees with comprehensive, age-appropriate information about: How pornimpacts the brain How porncan harm relationships How pornaffects society Healthyconversations about porn Free resources—educationalandrecovery We empower audiences to make educated decisions that can better equip them to love themselves, have healthy relationships, and make a positive difference in the world. And this is where they are learning how to have sex. From the“Teens and Pornography”report, 52% of teens who consume pornography said they’d seen pornography depicting what appears to be rape, choking, or someone in pain. Additionally, just 1 in 3 reported seeing someone ask for consent before engaging in sexual activity. So while teens are turning to porn to learn about sex, instead, they are learning unhealthy, unrealistic toxic views on sex, but there’s more. Respondents also reported viewing racial and ethnic stereotypes in pornography. Over 50% said they encountered pornography depicting Black people in a stereotypical way “often” or “sometimes,” and many reported seeing pornography stereotypes when portraying Latino/a/x people (50%), Asian people (46%), and Middle Eastern people (26%). Additionally, more than 50% report seeing porn that shows stereotypical displays of gender and sexual orientation. In addition to fostering dangerous views on sex and tolerance for discrimination, violence, and racism, we know through years of academic research pornography’s impact on mental health, relationships, and society, including fueling the demand for sex trafficking. Related:Can Watching Porn Negatively Impact Mental Health? Less than half of the teens included in this survey said they’ve had a conversation about pornography with a trusted adult. Not great. However, of those who did say they had some form of dialogue, 71% reported that “these talks encouraged them to find other ways to “explore sex and sexuality.” Many teens’ comments suggest that they would like to discuss their experiences with pornography with an adult. Unfortunately, they felt they didn’t know how to start the conversation or who to talk to. At Fight the New Drug, we understand the power of conversation in this movement. We know it can be complex and intimidating. To make it a little easier, we’ve built out educational resources to equip individuals to discuss the topic of pornography in a healthy way. This conversation blueprintprovides direction and insight for individuals, partners, parents, and teens to start the conversation surrounding pornography and how to keep it going. This engaging, unique, shame-free presentation focuses on providing individuals, especially youth, the opportunity to make informed decisions regarding pornography. Specifically crafted for each audience, we’ve presented to middle schools, junior highs, high schools, colleges, and various community groups worldwide. We have a parent-specific presentation to help educate parents and guardians on the harms of porn and how to talk with their kids. Start the conversation in your school or community with a Fight the New Drug presentation. Teens are more vulnerable to the dangers of pornography than ever before, but there are things we can do. It’s up to us to rise up and spread awareness on the harms of pornography in our own communities. Access the full report“Teens and Pornography”, referred to throughout this article, by Common Sense. Now more than ever before, porn has become normalized in our digital world. Because of this, awareness and educationon its well-documented negative impactshas become increasingly important. Research suggests that school staff and administrators see pornography as a serious issue that affects their school’s cultural climate surrounding sexual violence, and that education programs on porn help them feel more confident in addressing the issue and preventing sexual harassment.Maas, M. K., Gal, T., Cary, K. M., & Greer, K. (2022). Popular culture and pornography education to improve the efficacy of secondary school staff response to student sexual harassment., 1-23. doi:10.1080/15546128.2022.2076757Copy We take a three-dimensional approach to raising awareness on the harmful effects of pornography in society, soin addition to creating tools and resourcesfor our global supporter base to share, we also love getting face-to-face with people in their schools and cities to provideresearch-backed informationon this important issue. Fight the New Drug’sage-appropriate and engaging presentationshighlight research from respected academic institutions that demonstrates the significant impacts of porn consumption on individuals, relationships, and society. Offering presentations customized for each audience, all Fight the New Drug presentations align withour missionasa non-religiousandnon-legislative organizationeducating with science, facts, and personal accounts. We can provide engaging, empowering, and educational presentations for these types of audiences: Middle School/Junior High High School Parent/Community College/University Keynote Considerbooking Fight the New Drugfor your next live presentation or youth education event. What are the learning outcomes? Every school, community, parent, or conference presentation will equip attendees with comprehensive, age-appropriate information about: How pornimpacts the brain How porncan harm relationships How pornaffects society Healthyconversations about porn Free resources—educationalandrecovery We empower audiences to make educated decisions that can better equip them to love themselves, have healthy relationships, and make a positive difference in the world. Donate Articles Videos Shop Podcast Resources Research About FTND Contact Us ©Fight the New Drug, Inc. 2025, All rights Reserved. Fight the New Drug is a U.S. 501(c)(3) nonprofit. EIN: 26-3550143 Fight the New Drug, PO Box 522378, Salt Lake City, UT 84152 | Fight the New Drug is a part of thePHASE Alliance™. Donate No Porn November 2024 Shop Live Presentations ArticlesGet The FactsRecent Articles Get The Facts Recent Articles Get The Facts Recent Articles VideosDocumentaryShort Videos Documentary Short Videos Documentary Short Videos Shop Donate How Porn Can Fuel Sex Trafficking ResourcesGet The FactsGet InvolvedGet HelpPorn & Sex Trafficking Get The Facts Get Involved Get Help Porn & Sex Trafficking Get The Facts Get Involved Get Help Porn & Sex Trafficking About FTNDOur MissionOur TeamFAQsContact Us Our Mission Our Team FAQs Contact Us Our Mission Our Team FAQs Contact Us Join Fighter ClubManage Your Membership Manage Your Membership Manage Your Membership Sign Up"}