{"id": 1634, "name": "Gazeta Wyborcza", "domain": "wyborcza.pl", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://wyborcza.pl/centrumpomocygw/7,134956,29793595,ogolne-zasady-udzielania-licencji-na-materialy-redakcyjne-agory.html#s=S.stopka_dol-K.C-B.1-L.3.zw", "title": null, "content": "Wyborcza.pl Prenumerata cyfrowaCzytelnicy indywidualniDla studentówFirmy i instytucje Czytelnicy indywidualni Dla studentów Firmy i instytucje Czytelnicy indywidualni Dla studentów Firmy i instytucje Dzisiejsza Gazeta Wyborcza (e-wydanie) MagazynyAle HistoriaDuży FormatWyborcza TV i VODMagazyn WyborczejMagazyn KsiążkiSłówka. Magazyn o językuWyborcza Classic Ale Historia Duży Format Wyborcza TV i VOD Magazyn Wyborczej Magazyn Książki Słówka. Magazyn o języku Wyborcza Classic Ale Historia Duży Format Wyborcza TV i VOD Magazyn Wyborczej Magazyn Książki Słówka. Magazyn o języku Wyborcza Classic Wyborcza.biz Serwisy lokalneBiałystokBielsko-BiałaBydgoszczCzęstochowaElblągGliwiceGorzów WielkopolskiKaliszKatowiceKielceKoszalinKrakówLublinŁódźOlsztynOpolePłockPoznańRadomRybnikRzeszówSosnowiecSzczecinToruńTrójmiastoWałbrzychWarszawaWrocławZakopaneZielona Góra Białystok Bielsko-Biała Bydgoszcz Częstochowa Elbląg Gliwice Gorzów Wielkopolski Kalisz Katowice Kielce Koszalin Kraków Lublin Łódź Olsztyn Opole Płock Poznań Radom Rybnik Rzeszów Sosnowiec Szczecin Toruń Trójmiasto Wałbrzych Warszawa Wrocław Zakopane Zielona Góra Białystok Bielsko-Biała Bydgoszcz Częstochowa Elbląg Gliwice Gorzów Wielkopolski Kalisz Katowice Kielce Koszalin Kraków Lublin Łódź Olsztyn Opole Płock Poznań Radom Rybnik Rzeszów Sosnowiec Szczecin Toruń Trójmiasto Wałbrzych Warszawa Wrocław Zakopane Zielona Góra Wyborcza.tech Wysokie Obcasy News from Poland Witamy w Polsce BIQdata Magazyn Kuchnia Archiwum TOK FM Gazeta.pl Inne serwisyNextDzieckoZdrowiePogodaSportPodróżeForumAvanti24Radio ZETChilliZETPlanetamelo. Next Dziecko Zdrowie Pogoda Sport Podróże Forum Avanti24 Radio ZET ChilliZET Planeta melo. Next Dziecko Zdrowie Pogoda Sport Podróże Forum Avanti24 Radio ZET ChilliZET Planeta melo. Wyborcza.pl Kontakt z redakcją Pomoc Reklama Licencje **OGÓLNE ZASADY UDZIELANIA LICENCJI NA MATERIAŁY REDAKCYJNE Wyborczej Sp. z o. o.** Zachęcamy Państwa do skorzystania z oferty wykupienia licencji, która m.in. daje możliwość: - publikacji na stronach internetowych, - publikacji w obrębie wewnętrznej sieci intranet, - zamieszczania artykułu lub jego opracowania w wydawanym przez siebie dzienniku lub czasopiśmie, - wykorzystania na potrzeby użytku wewnętrznego swojej jednostki organizacyjnej bez naruszania prawa autorskiego (Ustawa o prawie autorskim i prawach pokrewnych z dnia 4 lutego 1994 r.) obowiązującego na terenie Rzeczypospolitej Polskiej oraz praw majątkowych Spółki Wyborcza Sp. z o. o. W celu wykupienia licencji na artykuł prosimy o kontakt: licencje@agora.pl W celu wykupienia licencji na zdjęcie prosimy o kontakt: agencja@agora.pl Ogólne zasady udzielania licencji https://www.wyborcza.pl/aliasy/pub/regulaminUdzieleniaLicencjiWyborcza"}