{"id": 833, "name": "The Express-Times (Lehigh Valley)", "domain": "lehighvalleylive.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.lehighvalleylive.com/business/2025/06/mummy-pigs-new-baby-girl-has-a-lookalike-toy-at-walmart-heres-where-to-get-her-if-you-cant-wait-for-a-restock.html", "title": "Mummy Pigs New Baby Girl Has A Lookalike Toy At Walmart Heres Where To Get Her If You Cant Wait For A Restock.html", "content": "Business **Mummy Pig’s new baby girl has a lookalike toy at Walmart — here’s where to get her if you can’t wait for a restock** Updated:Jun. 11, 2025, 6:05 a.m. |Published:Jun. 11, 2025, 6:05 a.m. Those who got the Oinks + Snuggles baby Evie doll at Walmart are selling them on eBaby for upwards of $55, but if she's already caused a stir in your house (in the best way, of course), you'll want to grab her now ahead of the June 20 premiere of new episodes.Walmart/Hasbro/Peppa Pig/eBay/Canva Danielle Halibey | NJ Advance Media for NJ.com Evie Pig still hasn’t even celebrated her one-month birthday yet, but since arriving this spring, she’s already amassed a cult following. Hasbro launched a handful oftoys inspired by Peppa’s new family of five, but theWalmart-exclusive playthings, including thefastest-selling Baby Evie doll, have been sold out for weeks. While we haven’t heard anything about a restock at Walmart as of yet,eBay listings for the Peppa Pig Toys Oinks + Snuggles Baby Evie Interactive Baby Dollare stacking up. According to the splash banner onPeppa Pig’s YouTube channel, Baby Evie will finally be appearing on screen in new Peppa Pig Tales that will air beginning on June 20 (on Nick Jr. and YouTube). Now, with no confirmed Walmart restock in sight, parents are turning to eBay to get their hands on what’s shaping up to be one of the most sought-after toys of the summer. At 11 inches tall, Evie is the perfect size for little ones to cuddle, carry, and care for. Her soft body and expressive plastic face — with that heart-shaped birthmark of hers —make her feel like a real baby, while her built-in sound effects bring her to life in a way that’s sweet and totally toddler-approved. She responds to nurturing play with over 20 different sound effects, from giggles and oinks to lullabies and snores. Kiddos can feed her with the included bottle, pop in her pacifier, bounce her up and down, lay her down for a nap, or tune in to the latest Peppa installments alongside the series’ newest star. As they watch Peppa and George adjust to life with a new baby sister, toddlers, preschoolers, and kindergartners can mirror those moments at home, acting out scenes and playing make believe. If you missed thepresale at Walmart, don’t stress but maybe don’t wait too long either. Because once the new episodes drop, the demand for Baby Evie is only going to grow. When in stock, she sold for $25-$30, but eBay listings have herprice point as high as $69. **Just-Launched: The Newest Finds to Add to Your Cart** Drybar just dropped a Dyson Airwrap competitor, but it’s over $300 cheaper Kate Spade’s $398 Loop Large Shoulder Bag is the perfect purse to accessorize with bag charms this summer Step2’s newest grill & go cart is a fire pick for mini pitmasters — get it here with a Father’s Day deal Our journalism needs your support. Please subscribe today toNJ.com. Danielle Halibey can be reached atdhalibey@njadvancemedia.com. Have a tip? Tell us atnj.com/tips. If you purchase a product or register for an account through a link on our site, we may receive compensation.By using this site, you consent to ourUser Agreementand agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with ourPrivacy Policy. **Footer Navigation** About lehighvalleylive.com Jobs at lehighvalleylive.com Contact Us Advertise with us Accessibility Statement lehighvalleylive.com The Express-Times Newsletters Manage your Subscription Place a Vacation Hold Make a Payment View Edition Jobs Autos Real Estate Rentals Classifieds Special Sections Obituaries Local Life News Business Sports High School Sports Entertainment Opinion Easton Bethlehem Allentown Phillipsburg Lehigh County Warren County Nazareth Slate Belt Hunterdon County Northampton County Mobile Apps Tablet Apps Weather News Search Post a job Archives Post a free classified ad Sell your car Sell/rent your home Sponsor Content Facebook Twitter Instagram YouTube RSS Your Privacy Choices Privacy Policy |User Agreement |Ad Choices **Disclaimer** Use of and/or registration on any portion of this site constitutes acceptance of ourUser Agreement, (updated 8/1/2024) and acknowledgement of ourPrivacy Policy,andYour Privacy Choices and Rights(updated 1/1/2025). ©2025Advance Local Media LLC. All rights reserved (About Us).The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Advance Local. Community Rulesapply to all content you upload or otherwise submit to this site. YouTube's privacy policyis availablehereandYouTube's terms of serviceis availablehere. Ad Choices"}