{"id": 246, "name": "The Plain Dealer", "domain": "cleveland.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.cleveland.com/news/2025/06/prosecutor-omalley-calls-potential-agreement-with-cleveland-to-jail-low-level-offenders-12-hours-without-charges-morally-wrong.html", "title": "Prosecutor Omalley Calls Potential Agreement With Cleveland To Jail Low Level Offenders 12 Hours Without Charges Morally Wrong.html", "content": "**Prosecutor O’Malley calls potential agreement with Cleveland to jail low-level offenders 12 hours without charges ‘morally wrong’** Updated:Jun. 11, 2025, 3:46 p.m. |Published:Jun. 11, 2025, 3:40 p.m. Cuyahoga County Prosecutor Michael O'Malley spoke out against a policy in a new potential contract to house Cleveland inmates in the county jail that would allow individuals accused of low-level offenses to be held up to 12 hours without charges. O'Malley called the proposal \"morally wrong.\"Cory Shaffer, cleveland.com Kaitlin Durbin, cleveland.com CLEVELAND, Ohio – Cleveland and Cuyahoga County are close to striking a new contract to end the ongoing dispute over jailing city inmates, but Prosecutor Michael O’Malley, whose office played a role in the negotiations, is already seeking changes, calling it “unacceptable” and “morally wrong.” O’Malley was specifically referring to a policy in the new contract, which has yet to be formally introduced, that allows individuals accused of low-level felonies and misdemeanors to be detained in the county jail for up to 12 hours without charges. If you purchase a product or register for an account through a link on our site, we may receive compensation.By using this site, you consent to ourUser Agreementand agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with ourPrivacy Policy. **Footer Navigation** Advertise with us About Cleveland.com About Advance Ohio Contact Us Career Opportunities Delivery Opportunities Audience FAQ Accessibility Statement cleveland.com The Plain Dealer Newsletters Sun News Make a Payment Manage your Subscription Place a Vacation Hold Delivery Feedback News Sports Entertainment Politics Opinion Living Betting Rentals Obituaries Jobs Deals in Your Area Classifieds Autos Real Estate Mobile Apps Lakewood Beachwood Brunswick Strongsville Parma & Parma Heights More Communities Sponsor Content Sell your car Post a job Sitemap & search Post a classified ad Sell/rent your home Videos Archives Twitter Pinterest Facebook Instagram RSS Your Privacy Choices Privacy Policy |User Agreement |Ad Choices **Disclaimer** Use of and/or registration on any portion of this site constitutes acceptance of ourUser Agreement, (updated 8/1/2024) and acknowledgement of ourPrivacy Policy,andYour Privacy Choices and Rights(updated 1/1/2025). ©2025Advance Local Media LLC. All rights reserved (About Us).The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Advance Local. Community Rulesapply to all content you upload or otherwise submit to this site. YouTube's privacy policyis availablehereandYouTube's terms of serviceis availablehere. Ad Choices"}