{"id": 977, "name": "Willoughby News-Herald", "domain": "news-herald.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.news-herald.com/2025/06/11/carlos-santana-hits-grand-slam-as-guardians-beat-reds-11-2-to-avoid-season-sweep-by-franconas-club/", "title": "Carlos Santana Hits Grand Slam As Guardians Beat Reds 11 2 To Avoid Season Sweep By Franconas Club", "content": "e-Edition e-Edition NewsNewsLocal NewsCrime and Public SafetyBusinessHealthBest ReviewsLake CountyGeauga CountyCuyahoga CountyOhio NewsNational NewsOpioid EpidemicElectionTrafficWorld News News Local News Crime and Public Safety Business Health Best Reviews Lake County Geauga County Cuyahoga County Ohio News National News Opioid Epidemic Election Traffic World News News Local News Crime and Public Safety Business Health Best Reviews Lake County Geauga County Cuyahoga County Ohio News National News Opioid Epidemic Election Traffic World News SportsSportsHigh School SportsCleveland BrownsCleveland CavaliersCleveland GuardiansOhio StateLake County CaptainsMonsters Sports High School Sports Cleveland Browns Cleveland Cavaliers Cleveland Guardians Ohio State Lake County Captains Monsters Sports High School Sports Cleveland Browns Cleveland Cavaliers Cleveland Guardians Ohio State Lake County Captains Monsters Things to DoThings to DoEntertainmentMoviesMusic and ConcertsTheaterRestaurants Food and DrinkRecipesTravelTV ListingsComicsMore PuzzlesJumble and MoreEvents Things to Do Entertainment Movies Music and Concerts Theater Restaurants Food and Drink Recipes Travel TV Listings Comics More Puzzles Jumble and More Events Things to Do Entertainment Movies Music and Concerts Theater Restaurants Food and Drink Recipes Travel TV Listings Comics More Puzzles Jumble and More Events Opinion ObituariesObituariesPlace an Obituary Obituaries Place an Obituary Obituaries Place an Obituary MarketplaceJobsClassifieds Jobs Classifieds Jobs Classifieds ToolsContact UsAdvertiseContestsSubmit AnnouncementsNewsstand LocationsMobile AppsGasBuddyLottery Contact Us Advertise Contests Submit Announcements Newsstand Locations Mobile Apps GasBuddy Lottery Contact Us Advertise Contests Submit Announcements Newsstand Locations Mobile Apps GasBuddy Lottery Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Subscribe Log in Logout Sign up for email newsletters **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Share via SMS (Opens in new window)Share via SMS Subscribe Log in Sign up for email newsletters Subscribe Log in e-Edition e-Edition News Sports Things to Do Opinion Obituaries Classifieds Contests e-Edition **Carlos Santana hits grand slam as Guardians beat Reds, 11-2, to avoid season sweep by Francona’s club** **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Share via SMS (Opens in new window)Share via SMS Carlos Santana slugged his sixth career grand slam and the Guardians beat Cincinnati,11-2, on June 11, snapping the Reds’ five-game win streak and denying manager Terry Francona a season sweep of his former team. Santana’s third-inning slam came on the 15th anniversary of his major league debut. It was his eighth homer this season and made it 5-0, helping Cleveland salvage the finale of this three-game series. Francona’s Reds swept the Guardians in three games at Cincinnati last month. The Guardians had five straight hits to open a four-run sixth for a nine-run lead, including a three-run homer by Lane Thomas. Cleveland’s 11 runs were a season high. Thomas’ homer was his first this season after returning from the injured list this week. He had three hits, drove in three runs and scored twice. José Ramírez hit an RBI double to extend his career-long on-base streak to 37 games, the longest active streak in the majors. He has a hit in 11 straight games. Logan Allen (4-4) went six innings and gave up solo homers to Elly De La Cruz and TJ Friedl. He struck out six. Nick Lodolo (4-5) lasted only 3 1/3 innings, giving up six runs. Cincinnati’s Christian Encarnacion-Strand was hit on the bill of his helmet by a 97 mph pitch from Emmanuel Clase in the ninth but stayed in the game. Angel Martínez and Thomas singled and Ramírez was hit by a pitch to set up Santana’s slam. Ramírez hit his 380th career double, passing Earl Averill for third-most in franchise history. He trails Hall of Famers Tris Speaker (486) and Nap Lajoie (424). Cincinnati’s Nick Martinez (4-6, 3.70 ERA) will pitch against Keider Montero (2-1, 4.30) at Detroit on Friday. Cleveland’s Gavin Williams (5-3, 3.86) will face Luis Castillo (4-4, 3.31) at Seattle on June 13. **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Share via SMS (Opens in new window)Share via SMS **RevContent Feed** **Most Popular** Lake Catholic baseball: Baseball bringing Locker family peace amid father’s cancer diagnosisLake Catholic baseball: Baseball bringing Locker family peace amid father's cancer diagnosis **Lake Catholic baseball: Baseball bringing Locker family peace amid father’s cancer diagnosis** **Lake Catholic baseball: Baseball bringing Locker family peace amid father’s cancer diagnosis** One dead in weekend shooting in PainesvilleOne dead in weekend shooting in Painesville **One dead in weekend shooting in Painesville** **One dead in weekend shooting in Painesville** Black bear spotted in Painesville TownshipBlack bear spotted in Painesville Township **Black bear spotted in Painesville Township** **Black bear spotted in Painesville Township** Eastlake latest city to criminalize short-term rental propertiesEastlake latest city to criminalize short-term rental properties **Eastlake latest city to criminalize short-term rental properties** **Eastlake latest city to criminalize short-term rental properties** Groups offer counseling, call for change after fatal Painesville shootingGroups offer counseling, call for change after fatal Painesville shooting **Groups offer counseling, call for change after fatal Painesville shooting** **Groups offer counseling, call for change after fatal Painesville shooting** Group rescued after water surge in Concord TownshipGroup rescued after water surge in Concord Township **Group rescued after water surge in Concord Township** **Group rescued after water surge in Concord Township** Opinion: End property tax to protect homeownership, restore fairnessOpinion: End property tax to protect homeownership, restore fairness **Opinion: End property tax to protect homeownership, restore fairness** **Opinion: End property tax to protect homeownership, restore fairness** Plans announced for 2025 Kirtland Strawberry Festival, Heritage WeekendPlans announced for 2025 Kirtland Strawberry Festival, Heritage Weekend **Plans announced for 2025 Kirtland Strawberry Festival, Heritage Weekend** **Plans announced for 2025 Kirtland Strawberry Festival, Heritage Weekend** Riverside leads area All-Ohio softball selectionsRiverside leads area All-Ohio softball selections **Riverside leads area All-Ohio softball selections** **Riverside leads area All-Ohio softball selections** Northeast Ohio wineries do well in 2025 Ohio Wine CompetitionNortheast Ohio wineries do well in 2025 Ohio Wine Competition **Northeast Ohio wineries do well in 2025 Ohio Wine Competition** **Northeast Ohio wineries do well in 2025 Ohio Wine Competition** **More in Sports** U.S. Open gets a peaceful day of practice ahead of tough test that awaits at Oakmont **U.S. Open gets a peaceful day of practice ahead of tough test that awaits at Oakmont** **U.S. Open gets a peaceful day of practice ahead of tough test that awaits at Oakmont** PHOTOS: Captains vs. Dragons, June 11, 2025 **PHOTOS: Captains vs. Dragons, June 11, 2025** **PHOTOS: Captains vs. Dragons, June 11, 2025** Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law **Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law** **Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law** University baseball: Infield is the building block of Preppers’ first state-round appearance **University baseball: Infield is the building block of Preppers’ first state-round appearance** **University baseball: Infield is the building block of Preppers’ first state-round appearance** 2025 June 11 Subscriber ServicesSubscribeSign Up For Newsletterse-EditionSubmit AnnouncementsSitemap Subscribe Sign Up For Newsletters e-Edition Submit Announcements Sitemap Subscribe Sign Up For Newsletters e-Edition Submit Announcements Sitemap Contact UsWork With UsiOS AppAndroid AppNews-HeraldPrivacy PolicyAccessibility Work With Us iOS App Android App News-Herald Privacy Policy Accessibility Work With Us iOS App Android App News-Herald Privacy Policy Accessibility ClassifiedsPlace Classified AdAdvertising InquiryJobsNetwork Advertising Place Classified Ad Advertising Inquiry Jobs Network Advertising Place Classified Ad Advertising Inquiry Jobs Network Advertising Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration MediaNews Group Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}