{"id": 1287, "name": "St. Albert Gazette", "domain": "stalbertgazette.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.stalbertgazette.com/the-latest/new-ai-minister-says-canada-wont-over-index-on-ai-regulation-10788060", "title": "New Ai Minister Says Canada Wont Over Index On Ai Regulation 10788060", "content": "2025 Readers' Choice Awards Join Our Newsletters Messages Post a Listing Your Listings Your Profile Your Subscriptions Your Likes Your Business Payment History Sign Out Sign In Register Sign up for Daily Headlines Sign up for Notifications Contact Us Home NewsLocal NewsLocal SportsLocal Arts and CultureLocal EntertainmentLifestyle NewsLocal BusinessLocal OpinionBeyond Local#JasperStrongAlberta NewsAlberta SportsIndigenous AlbertaCOVID-19National NewsNational BusinessNational EntertainmentNational Sports Local News Local Sports Local Arts and Culture Local Entertainment Lifestyle News Local Business Local Opinion Beyond Local #JasperStrong Alberta News Alberta Sports Indigenous Alberta COVID-19 National News National Business National Entertainment National Sports Local News Local Sports Local Arts and Culture Local Entertainment Lifestyle News Local Business Local Opinion Beyond Local #JasperStrong Alberta News Alberta Sports Indigenous Alberta COVID-19 National News National Business National Entertainment National Sports Election2025 Municipal Election 2025 Municipal Election 2025 Municipal Election FeaturesSpotlightContestsLowest Gas PricesDigital Edition, Archives & FeaturesMore Digital ArchiveAdopt A PetDear AbbyHoroscopes2024 Graduation KeepsakeVOTE: Gazette Readers' Choice AwardsSt. Albert Rotary Music FestivalHot Summer Guide Spotlight Contests Lowest Gas Prices Digital Edition, Archives & Features More Digital Archive Adopt A Pet Dear Abby Horoscopes 2024 Graduation Keepsake VOTE: Gazette Readers' Choice Awards St. Albert Rotary Music Festival Hot Summer Guide Spotlight Contests Lowest Gas Prices Digital Edition, Archives & Features More Digital Archive Adopt A Pet Dear Abby Horoscopes 2024 Graduation Keepsake VOTE: Gazette Readers' Choice Awards St. Albert Rotary Music Festival Hot Summer Guide ObitsObituariesIn Memoriam Obituaries In Memoriam Obituaries In Memoriam EventsView Events- Submit an Event- Advertise in Calendar View Events - Submit an Event - Advertise in Calendar View Events - Submit an Event - Advertise in Calendar DiscoverShop Local: Business DirectoryRestaurantsClassifieds All Listings- Post an Ad- My Ads- My AccountGarage Sales Shop Local: Business Directory Restaurants Classifieds All Listings - Post an Ad - My Ads - My Account Garage Sales Shop Local: Business Directory Restaurants Classifieds All Listings - Post an Ad - My Ads - My Account Garage Sales Jobs Public NoticesGeneral NoticesLegal NoticesMunicipal NoticesProvincial Notices General Notices Legal Notices Municipal Notices Provincial Notices General Notices Legal Notices Municipal Notices Provincial Notices Open Houses ConnectAbout UsContact UsSign Up for our FREE NewslettersMake Us Your Home PageSign up for NotificationsFind Us on Social MediaAdvertising & MarketingGreat West Digital Agency About Us Contact Us Sign Up for our FREE Newsletters Make Us Your Home Page Sign up for Notifications Find Us on Social Media Advertising & Marketing Great West Digital Agency About Us Contact Us Sign Up for our FREE Newsletters Make Us Your Home Page Sign up for Notifications Find Us on Social Media Advertising & Marketing Great West Digital Agency Home The Latest **New AI minister says Canada won’t ‘over-index’ on AI regulation** Share by Email Share on Facebook Share on X Share on LinkedIn Print Share via Text Message OTTAWA — Canada's new minister of artificial intelligence says he'll put less emphasis on AI regulation and more on finding ways to harness the technology's economic benefits. Evan Solomon says Canada will move away from \"over-indexing on warnings and regulation\" to make sure the economy benefits from AI. He says getting AI regulation right is critical to Canada’s \"economic destiny.\" In his first speech since becoming Canada’s first-ever AI minister, Solomon outlined four priorities for his ministry. They include scaling up Canada’s AI industry, driving adoption and ensuring Canadians have trust in and sovereignty over the technology. He says his focus with AI regulation will be on data protection and privacy. This report by The Canadian Press was first published June 10, 2025. Anja Karadeglija, The Canadian Press See a typo/mistake? Have a story/tip? **This has been shared0times** 0Shares Share by Email Share on Facebook Share on X Share on LinkedIn Print Share via Text Message **Sign up for our FREE Daily Headlines** **More The Latest** **Current Poll** VoteResults >Archives > NewsLocal NewsLocal SportsLocal Arts and CultureLocal EntertainmentLifestyle NewsLocal BusinessLocal OpinionBeyond Local#JasperStrongAlberta NewsAlberta SportsIndigenous AlbertaCOVID-19National NewsNational BusinessNational EntertainmentNational Sports Local News Local Sports Local Arts and Culture Local Entertainment Lifestyle News Local Business Local Opinion Beyond Local #JasperStrong Alberta News Alberta Sports Indigenous Alberta COVID-19 National News National Business National Entertainment National Sports Local News Local Sports Local Arts and Culture Local Entertainment Lifestyle News Local Business Local Opinion Beyond Local #JasperStrong Alberta News Alberta Sports Indigenous Alberta COVID-19 National News National Business National Entertainment National Sports Election2025 Municipal Election 2025 Municipal Election 2025 Municipal Election FeaturesSpotlightContestsLowest Gas PricesDigital Edition, Archives & FeaturesMore Digital ArchiveAdopt A PetDear AbbyHoroscopes2024 Graduation KeepsakeVOTE: Gazette Readers' Choice AwardsSt. Albert Rotary Music FestivalHot Summer Guide Spotlight Contests Lowest Gas Prices Digital Edition, Archives & Features More Digital Archive Adopt A Pet Dear Abby Horoscopes 2024 Graduation Keepsake VOTE: Gazette Readers' Choice Awards St. Albert Rotary Music Festival Hot Summer Guide Spotlight Contests Lowest Gas Prices Digital Edition, Archives & Features More Digital Archive Adopt A Pet Dear Abby Horoscopes 2024 Graduation Keepsake VOTE: Gazette Readers' Choice Awards St. Albert Rotary Music Festival Hot Summer Guide ObitsObituariesIn Memoriam Obituaries In Memoriam Obituaries In Memoriam EventsView Events- Submit an Event- Advertise in Calendar View Events - Submit an Event - Advertise in Calendar View Events - Submit an Event - Advertise in Calendar DiscoverShop Local: Business DirectoryRestaurantsClassifieds All Listings- Post an Ad- My Ads- My AccountGarage Sales Shop Local: Business Directory Restaurants Classifieds All Listings - Post an Ad - My Ads - My Account Garage Sales Shop Local: Business Directory Restaurants Classifieds All Listings - Post an Ad - My Ads - My Account Garage Sales Jobs Public NoticesGeneral NoticesLegal NoticesMunicipal NoticesProvincial Notices General Notices Legal Notices Municipal Notices Provincial Notices General Notices Legal Notices Municipal Notices Provincial Notices Open Houses ConnectAbout UsContact UsSign Up for our FREE NewslettersMake Us Your Home PageSign up for NotificationsFind Us on Social MediaAdvertising & MarketingGreat West Digital Agency About Us Contact Us Sign Up for our FREE Newsletters Make Us Your Home Page Sign up for Notifications Find Us on Social Media Advertising & Marketing Great West Digital Agency About Us Contact Us Sign Up for our FREE Newsletters Make Us Your Home Page Sign up for Notifications Find Us on Social Media Advertising & Marketing Great West Digital Agency Community Guidelines Privacy Policy Terms of Service Airdrie City View/Rocky View Weekly Cochrane Eagle Jasper Fitzhugh Lakeland Today Mountain View Today Rocky Mountain Outlook St. Albert Gazette Town and Country Today Western Wheel © 2025 St. Albert Gazette"}