{"id": 1514, "name": "United Press International (UPI)", "domain": "upi.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.upi.com/Top_News/World-News/2025/06/11/South-Korea-halts-propaganda-loudspeaker-broadcasts-North-Korea-border/1571749636427/", "title": "South Korea Halts Propaganda Loudspeaker Broadcasts North Korea Border", "content": "Top NewsU.S. NewsWorld NewsFeatured U.S. News World News Featured U.S. News World News Featured Odd News EntertainmentMoviesMusicTV Movies Music TV Movies Music TV Science Health SportsNFLMLBNBASoccer NFL MLB NBA Soccer NFL MLB NBA Soccer Voices PhotosNewsUS NewsWorld NewsEntertainmentSports News US News World News Entertainment Sports News US News World News Entertainment Sports ArchiveAlmanac Almanac Almanac FocusonKorea **South Korea halts anti-Pyongyang loudspeaker broadcasts near border** SEOUL, June 11 (UPI) --South Korea suspended its propaganda loudspeaker broadcasts across the border toNorth Korea, officials said Tuesday, in a bid to reduce tensions with Pyongyang under the administration of newly elected President Lee Jae-Myung.Halting the broadcasts is \"a measure to fulfill the public pledge to restore trust in inter-Korean relations and bring peace to the Korean Peninsula,\" a Joint Chiefs of Staff official said in a text message to reporters.The move came roughly a year after Seoul resumed the broadcasts in response to a series of provocations by North Korea that included floating thousands of trash-filled balloons across the border.The broadcasts included news,K-popmusic, and information about democracy and life in South Korea. The North responded at times by broadcasting bizarre noises such as metallic screeching and animal sounds, disturbing residents in areas near the DMZ.Lee ordered the suspensions, his office confirmed later on Tuesday.Spokeswoman Kang Yoo-jung said in a briefing that Lee \"made this decision as a preemptive measure to ease tensions in a situation where there have been no recent major provocations by North Korea.\"\"This is a measure to ease the military standoff between the South and the North and to open the way to restoring mutual trust.\"It was also meant to \"alleviate the suffering of residents in border areas who have suffered due to North Korea's noise broadcasts,\" she said.Lee, whowon a snap electionon June 3 to replace impeached former President Yoon Suk Yeol, campaigned on improving frayed inter-Korean relations. He vowed to suspend the loudspeaker broadcasts as well as prevent defector groups from floating balloons with anti-Pyongyang leaflets and USB drives containing South Korean media over the border.On Monday, the Unification Ministry in charge of inter-Korean relations called for a stop to the leaflet campaigns after an activist group sent balloons in early June.\"We strongly request that the spreading of leaflets be stopped, as this could create tension in the situation on the Korean Peninsula and endanger the lives and safety of the people in the border areas,\" ministry spokesman Koo Byung-sam said at a press briefing.Koo said the ministry would work with agencies and related organizations to ensure compliance with existing regulations on leaflet distribution.The Unification Ministry will also \"actively cooperate in discussing amendments to the National Assembly's Inter-Korean Relations Development Act,\" Koo said.Defectors and human rights activists have argued that the communications across the border provide a vital source of information about the outside world to North Korean citizens.The new government's stance is a departure from the Yoon administration, which took a hard line against North Korea and saw relations deteriorate amid a series of back-and-forth Cold War-style provocations in border areas.Lee has said he would continue to strengthen military cooperation with the United States but pledged to reopen communications with Seoul's recalcitrant neighbor.\"We will prepare for North Korea's nuclear weapons and military provocations, while opening channels of communication with North Korea and establishing peace on the Korean Peninsula through dialogue and cooperation,\" Leesaidin a speech at his swearing-in ceremony.During his campaign, Lee also vowed to restore an inter-Korean military pact aimed at defusing military tensions and avoiding accidental conflicts along the border. It was signed during a period of detente in 2018 but scrapped by both countries last year.Read MoreLee Jae-myung on track to win South Korean presidential election in a landslideLee Jae-myung takes office as South Korean president, pledges to unify countryChinese national in U.S. pleads guilty to shipping arms to North KoreaTopicsDefenseNorth KoreaNorth KoreaK-popLatest HeadlinesWorld News// 1 hour agoArgentina to move embassy from Tel Aviv to JerusalemJune 11 (UPI) -- Argentina will move its embassy from a Tel Aviv suburb to Jerusalem next year, Argentinian President Javier Milei announced Wednesday night in a speech in his honor in Israel's Knesset.World News// 2 hours agoLima's new airport continues to face passenger complaintsJune 11 (UPI) -- Only two weeks after opening, Lima's new Jorge Chávez International Airport has experienced multiple operational problems, including recurring flight cancellations.World News// 5 hours agoDozens of police officers injured in riots in Northern IrelandJune 11 (UPI) -- The Police Service of Northern Ireland announced Wednesday that things are currently quiet in a County Antrim town after violent attacks on police over a two-night stretch left 17 officers injured.World News// 6 hours agoNew Serbian President Aleksandar Vucic visits Ukraine for first timeJune 11 (UPI) -- Serbian President Aleksandar Vucic will mark his first-ever official visit to Ukraine on Wednesday since he took the presidency nearly eights years ago to take part in a European summit.World News// 6 hours agoDonald Tusk wins confidence vote to remain Poland's prime ministerJune 11 (UPI) -- Polish Prime Minister Donald Tusk Wednesday won a confidence vote 243-210. The result averts early elections while keeping Tusk's pro-EU alliance in place.World News// 7 hours agoPope Leo XIV names new bishop for Archdiocese of Fuzhou, ChinaJune 11 (UPI) -- Pope Leo XIV on Wednesday appointed Bishop Joseph Lin Yuntuan auxiliary Bishop of the Archdiocese of Fuzhou, China.World News// 8 hours agoDeath toll in Austrian school shooting rises to 10; city holds vigilJune 11 (UPI) -- Nine high school students and a teacher are now known to have died in a mass shooting in Graz, Austria's second largest city, apparently at the hands of a former pupil.World News// 8 hours agoCuban Internet price hikes restrict daily lifeJune 11 (UPI) -- Internet price hikes of up to 800% have sparked student protests in Cuba led by the Federation of University Students.World News// 9 hours agoMacron pledges to ban social media for children younger than 15June 11 (UPI) -- French President Emmanuel Macron said he plans to ban social media for children younger than 15.World News// 10 hours ago3 killed, 68 hurt as Russia pummels Ukraine's Kharkiv, Kherson regionsJune 11 (UPI) -- Russia attacked the frontline Ukrainian regions of Kharkiv and Kherson with artillery fire, guided bombs and drones, killing three people and injuring at least 68. SEOUL, June 11 (UPI) --South Korea suspended its propaganda loudspeaker broadcasts across the border toNorth Korea, officials said Tuesday, in a bid to reduce tensions with Pyongyang under the administration of newly elected President Lee Jae-Myung. Halting the broadcasts is \"a measure to fulfill the public pledge to restore trust in inter-Korean relations and bring peace to the Korean Peninsula,\" a Joint Chiefs of Staff official said in a text message to reporters. The move came roughly a year after Seoul resumed the broadcasts in response to a series of provocations by North Korea that included floating thousands of trash-filled balloons across the border. The broadcasts included news,K-popmusic, and information about democracy and life in South Korea. The North responded at times by broadcasting bizarre noises such as metallic screeching and animal sounds, disturbing residents in areas near the DMZ. Lee ordered the suspensions, his office confirmed later on Tuesday. Spokeswoman Kang Yoo-jung said in a briefing that Lee \"made this decision as a preemptive measure to ease tensions in a situation where there have been no recent major provocations by North Korea.\" \"This is a measure to ease the military standoff between the South and the North and to open the way to restoring mutual trust.\" It was also meant to \"alleviate the suffering of residents in border areas who have suffered due to North Korea's noise broadcasts,\" she said. Lee, whowon a snap electionon June 3 to replace impeached former President Yoon Suk Yeol, campaigned on improving frayed inter-Korean relations. He vowed to suspend the loudspeaker broadcasts as well as prevent defector groups from floating balloons with anti-Pyongyang leaflets and USB drives containing South Korean media over the border. On Monday, the Unification Ministry in charge of inter-Korean relations called for a stop to the leaflet campaigns after an activist group sent balloons in early June. \"We strongly request that the spreading of leaflets be stopped, as this could create tension in the situation on the Korean Peninsula and endanger the lives and safety of the people in the border areas,\" ministry spokesman Koo Byung-sam said at a press briefing. Koo said the ministry would work with agencies and related organizations to ensure compliance with existing regulations on leaflet distribution. The Unification Ministry will also \"actively cooperate in discussing amendments to the National Assembly's Inter-Korean Relations Development Act,\" Koo said. Defectors and human rights activists have argued that the communications across the border provide a vital source of information about the outside world to North Korean citizens. The new government's stance is a departure from the Yoon administration, which took a hard line against North Korea and saw relations deteriorate amid a series of back-and-forth Cold War-style provocations in border areas. Lee has said he would continue to strengthen military cooperation with the United States but pledged to reopen communications with Seoul's recalcitrant neighbor. \"We will prepare for North Korea's nuclear weapons and military provocations, while opening channels of communication with North Korea and establishing peace on the Korean Peninsula through dialogue and cooperation,\" Leesaidin a speech at his swearing-in ceremony. During his campaign, Lee also vowed to restore an inter-Korean military pact aimed at defusing military tensions and avoiding accidental conflicts along the border. It was signed during a period of detente in 2018 but scrapped by both countries last year. **Read More** Lee Jae-myung on track to win South Korean presidential election in a landslide Lee Jae-myung takes office as South Korean president, pledges to unify country Chinese national in U.S. pleads guilty to shipping arms to North Korea Topics Defense North Korea North Korea K-pop **Latest Headlines** SEOUL, June 11 (UPI) --South Korea suspended its propaganda loudspeaker broadcasts across the border toNorth Korea, officials said Tuesday, in a bid to reduce tensions with Pyongyang under the administration of newly elected President Lee Jae-Myung. Halting the broadcasts is \"a measure to fulfill the public pledge to restore trust in inter-Korean relations and bring peace to the Korean Peninsula,\" a Joint Chiefs of Staff official said in a text message to reporters. The move came roughly a year after Seoul resumed the broadcasts in response to a series of provocations by North Korea that included floating thousands of trash-filled balloons across the border. The broadcasts included news,K-popmusic, and information about democracy and life in South Korea. The North responded at times by broadcasting bizarre noises such as metallic screeching and animal sounds, disturbing residents in areas near the DMZ. Lee ordered the suspensions, his office confirmed later on Tuesday. Spokeswoman Kang Yoo-jung said in a briefing that Lee \"made this decision as a preemptive measure to ease tensions in a situation where there have been no recent major provocations by North Korea.\" \"This is a measure to ease the military standoff between the South and the North and to open the way to restoring mutual trust.\" It was also meant to \"alleviate the suffering of residents in border areas who have suffered due to North Korea's noise broadcasts,\" she said. Lee, whowon a snap electionon June 3 to replace impeached former President Yoon Suk Yeol, campaigned on improving frayed inter-Korean relations. He vowed to suspend the loudspeaker broadcasts as well as prevent defector groups from floating balloons with anti-Pyongyang leaflets and USB drives containing South Korean media over the border. On Monday, the Unification Ministry in charge of inter-Korean relations called for a stop to the leaflet campaigns after an activist group sent balloons in early June. \"We strongly request that the spreading of leaflets be stopped, as this could create tension in the situation on the Korean Peninsula and endanger the lives and safety of the people in the border areas,\" ministry spokesman Koo Byung-sam said at a press briefing. Koo said the ministry would work with agencies and related organizations to ensure compliance with existing regulations on leaflet distribution. The Unification Ministry will also \"actively cooperate in discussing amendments to the National Assembly's Inter-Korean Relations Development Act,\" Koo said. Defectors and human rights activists have argued that the communications across the border provide a vital source of information about the outside world to North Korean citizens. The new government's stance is a departure from the Yoon administration, which took a hard line against North Korea and saw relations deteriorate amid a series of back-and-forth Cold War-style provocations in border areas. Lee has said he would continue to strengthen military cooperation with the United States but pledged to reopen communications with Seoul's recalcitrant neighbor. \"We will prepare for North Korea's nuclear weapons and military provocations, while opening channels of communication with North Korea and establishing peace on the Korean Peninsula through dialogue and cooperation,\" Leesaidin a speech at his swearing-in ceremony. During his campaign, Lee also vowed to restore an inter-Korean military pact aimed at defusing military tensions and avoiding accidental conflicts along the border. It was signed during a period of detente in 2018 but scrapped by both countries last year. **Read More** Lee Jae-myung on track to win South Korean presidential election in a landslide Lee Jae-myung takes office as South Korean president, pledges to unify country Chinese national in U.S. pleads guilty to shipping arms to North Korea Topics Defense North Korea North Korea K-pop **Latest Headlines** **Trending Stories** **Follow Us**"}