{"id": 2129, "name": "Spiked Magazine", "domain": "spiked-online.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.spiked-online.com/2025/06/11/why-is-the-new-yorker-sucking-up-to-latin-american-tyrants/", "title": "Why Is The New Yorker Sucking Up To Latin American Tyrants", "content": "TopicsFree SpeechIdentity PoliticsCovid-19BrexitPoliticsCultureBooksScience & TechUKUSAWorld Free Speech Identity Politics Covid-19 Brexit Politics Culture Books Science & Tech UK USA World Free Speech Identity Politics Covid-19 Brexit Politics Culture Books Science & Tech UK USA World WritersBrendan O'NeillTom SlaterJoanna WilliamsJulie BurchillMick HumeJoel KotkinSimon EvansElla WhelanRakib EhsanFrank FurediSee more Brendan O'Neill Tom Slater Joanna Williams Julie Burchill Mick Hume Joel Kotkin Simon Evans Ella Whelan Rakib Ehsan Frank Furedi See more Brendan O'Neill Tom Slater Joanna Williams Julie Burchill Mick Hume Joel Kotkin Simon Evans Ella Whelan Rakib Ehsan Frank Furedi See more Videos Podcasts Long-reads Events Newsletters Books Support us **Why is theNew Yorkersucking up to Latin American tyrants?** The US media’s pandering to Alexandre de Moraes is a betrayal of Brazilian democracy. **Eli Vieira** **Eli Vieira** Want to readspikedad-free? Become aspiked supporter. How does a judge ban one of the world’s biggest social-media platforms, nakedly target political opponents and repress reporting on his involvement in the biggest corruption scandal in his country’s history, and still get to be portrayed as a champion of democracy? Only, it seems, if the journalist is working for theNew Yorker. In April,the leading American magazinehailed Alexandre de Moraes as ‘The Brazilian judge taking on the digital far right’. Moraes, whose most notorious achievements to date includebanning Xand drivingpolitical opponents into exile, was presented as the only thing standing between his country and autocracy. According to journalist John Lee Anderson, Moraes is a ‘pugnacious jurist’ who has repeatedly saved his country from ‘digital militias’. The article even described the judge as ‘conspicuously fit’ and praised his ‘sharp cheekbones’. It’s a good thing this terrible article was published in America, rather than Brazil, which remains in a well of authoritarianism that Moraes is in no small part responsible for. For many Brazilians, Moraes’s unprecedented assault on free speech is a fresh and depressing memory. Most Brazilians received their first taste of his authoritarian streak in 2022, the year current presidentLuiz Inácio Lulada Silva defeated Jair Bolsonaro. Many Brazilians took to the streets to protest the result, centering on the capital, Brasilia. While the protests had an uncomfortable whiff of America’s‘January 6’ riotsthe previous year, ordinary voters were right to feel a little aggrieved. ‘Lula’ had servedjust over 18 monthsof a 12-year prison term after he was convicted of corruption, before his charges were overturned by a Supreme Court that now included Moraes, a longstanding political ally. The riots thatoccurred in Brasiliain January 2023 were serious, but hardly the threat to democracy and national security they were made out to be. For example, they occurred on a Sunday, meaning government buildings were largely empty. Critically, Bolsonaro wasn’t even in the country – he was in Florida, where he had been since losing the election. **Enjoyingspiked?** Why not make an instant, one-off donation? We are funded by you. Thank you! Enter your amount None of this lessened the severity of the judicial crackdown, which Moraes was all too happy to spearhead. HairdresserDébora Rodrigues dos Santos, a mother of two, was jailed for 14 years for writing, in lipstick, ‘you lost, fool’ on a statue during the demonstrations. She was only recently granted house arrest after a public outcry, and only then after a humiliating apology. Her case is one of many. Moraes is the embodiment of a phenomenon that has taken over the Brazilian Supreme Court. Most of the judges seem utterly convinced that ‘disinformation’ and ‘hate speech’ must be criminalised and that populist movements like Bolsonaro’s and Trump’s are not part and parcel of democracy, but something to be fought by fair means or foul. **The End of Woke** **The End of Woke** Still, few could have predicted the outright crackdown on dissent the world witnessed in August,when Moraes banned Xfor the country’s more than 20million users. Predictably, he claimed his draconian actions were necessary to combat ‘disinformation’. Depressingly, it seems Moraes was just warming up. In February, he issued a nationwide ban onvideo platform Rumble, once again on the spurious pretext of defending democracy. Critics have pointed out that the Supreme Court’s habit of banning platforms and accounts is a violation ofArticle 19 of theMarco Civil, Brazil’s main internet law. Unsurprisingly, the Supreme Court iscurrently deliberatingwhether Article 19 is ‘unconstitutional’. For the first time since the military dictatorship, which officially ended in 1985, Brazilian political opponents are mainly overseas. There’s podcaster Bruno ‘Monark’ Aiub, who would have been jailed for a year and a half for calling a communist member ofthe Supreme Court a ‘fatty’. JournalistRodrigo Constantinoand former judgeLudmila Lins Griloare others who have had their passports revoked and their bank accounts frozen. To its shame, theNew Yorkertouched on none of this. Instead, the article reads like a press release for an increasingly authoritarian figure. The magazine has betrayed Brazilian democrats. Alexandre de Moraes, who seems to possess almost limitless political power, doesn’t need the help of the foreign press. The people he is silencing do. **Could Rachel Reeves crash the economy?** **Could Rachel Reeves crash the economy?** Eli Vieirais a Brazilian journalist and author. He is the editor ofGazeta do Povo. **Who fundsspiked? You do** We are funded by you. And in this era of cancel culture and advertiser boycotts, we rely on your donations more than ever. Seventy per cent of our revenue comes from our readers’ donations – the vast majority giving just £5 per month. If you make a regular donation – of £5 a month or £50 a year – you can become aand enjoy: –Ad-free reading–Exclusive events–Access to our comments section It’s the best way to keepspikedgoing – and growing. Thank you! **Comments** **Want to join the conversation?** **Onlyspikedsupporters and patrons, who donate regularly to us, can comment on our articles.** **Most popular** **Los Angeles has fallen** **Los Angeles has fallen** **‘Black Lives Matter was irrational’** **‘Black Lives Matter was irrational’** **Simone Biles is betraying her sisters in sport** **Simone Biles is betraying her sisters in sport** **Zack Polanski and the crankish turn of the Greens** **Zack Polanski and the crankish turn of the Greens** **The Democrats are fanning the flames of the LA riots** **The Democrats are fanning the flames of the LA riots** **Recommended** **Can civilisation survive?** **Can civilisation survive?** **Pulp have lost touch with the common people** **Pulp have lost touch with the common people** You've readarticles this month If just 5% of our regular readers donated £5 a month, we could hire a much-needed new team member to deliver even more of what keeps you coming back. Plus, if you donate £5 a month or £50 a year, you can joinspiked supportersand enjoy: – Ad-free reading– Exclusive events– Access to our comments section Already a supporter?Log in hereto not see this again. About Jobs Donate Terms and conditions Privacy notice Cookie policy Politics Culture Brexit Feminism Free Speech USA Brendan O’Neill Tom Slater Joanna Williams Ella Whelan Mick Hume Tim Black c/o Sierra Quebec Bravo7th Floor, 77 Marsh WallLondon E14 9SHUnited Kingdom Email spiked © spiked Ltd 2000 – 2025. All rights reserved. Seeterms of use. spiked is not responsible for the content of any third-party websites. **Regular donors can now become a spiked supporter or a spiked patron and access exclusive perks** Want to supportspiked?Join now. Forgotten your password? **Who fundsspiked? You do** We are funded by you. And in this era of cancel culture and advertiser boycotts, we rely on your donations more than ever. Seventy per cent of our revenue comes from our readers’ donations – the vast majority giving just £5 per month. If you make a regular donation – of £5 a month or £50 a year – you can become aand enjoy: –Ad-free reading–Exclusive events–Access to our comments section It’s the best way to keepspikedgoing – and growing. Thank you!"}