{"id": 1352, "name": "Baton Rouge Advocate", "domain": "theadvocate.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.theadvocate.com/recall-kesia-lemoine-mayor-town-of-elton/pdf_6e2b883e-112a-11ef-9b1b-8f7a09b4caca.html", "title": "Recall Kesia Lemoine Mayor Town Of Elton", "content": "Business Crime/Police Courts Community Education Hurricane Center State Politics Traffic and Weather Betting LSU Saints High School Louisiana Outdoors Scott Rabalais Southern University Pelicans UL Ragin' Cajuns Arts Best of BR 2025 Books Curious Louisiana Faith Festivals Food and Restaurant Forward 64 Games Louisiana Health Home and Garden News Jan Risher Louisiana Inspired Mardi Gras Movies and TV Music Real Estate News Smiley Anders Travel Your Best Life Support Local Clancy DuBos Ron Faucheux Stephanie Grace Walt Handelsman Quin Hillyer Ed Pratt Faimon Roberts Will Sutton Guest Columns Our Columnists Our Views Letters Acts of the Legislature Election Results Election Results - December 1, 2023 Log out Log in Activate Subscribe My account Activate 91° E-Edition Newsletters NewsBusinessCrime/PoliceCourtsCommunityAscension ParishBakerEast Feliciana ParishLivingston and Tangipahoa parishesSt. FrancisvilleSt. Helena ParishWest Feliciana ParishWestsideZacharyEducationHurricane CenterState PoliticsElectionsLegislatureTraffic and Weather Business Crime/Police Courts CommunityAscension ParishBakerEast Feliciana ParishLivingston and Tangipahoa parishesSt. FrancisvilleSt. Helena ParishWest Feliciana ParishWestsideZachary Ascension Parish Baker East Feliciana Parish Livingston and Tangipahoa parishes St. Francisville St. Helena Parish West Feliciana Parish Westside Zachary Education Hurricane Center State PoliticsElectionsLegislature Elections Legislature Traffic and Weather Business Crime/Police Courts CommunityAscension ParishBakerEast Feliciana ParishLivingston and Tangipahoa parishesSt. FrancisvilleSt. Helena ParishWest Feliciana ParishWestsideZachary Ascension Parish Baker East Feliciana Parish Livingston and Tangipahoa parishes St. Francisville St. Helena Parish West Feliciana Parish Westside Zachary Ascension Parish Baker East Feliciana Parish Livingston and Tangipahoa parishes St. Francisville St. Helena Parish West Feliciana Parish Westside Zachary Education Hurricane Center State PoliticsElectionsLegislature Elections Legislature Elections Legislature Traffic and Weather SportsBettingLSUSaintsHigh SchoolLouisiana OutdoorsScott RabalaisSouthern UniversityPelicansUL Ragin' Cajuns Betting LSU Saints High School Louisiana Outdoors Scott Rabalais Southern University Pelicans UL Ragin' Cajuns Betting LSU Saints High School Louisiana Outdoors Scott Rabalais Southern University Pelicans UL Ragin' Cajuns EntertainmentArtsBest of BR 2025BooksCurious LouisianaFaithFestivalsFood and RestaurantForward 64GamesLouisiana HealthHome and Garden NewsJan RisherLouisiana InspiredMardi GrasMovies and TVMusicReal Estate NewsSmiley AndersTravelYour Best LifeSupport Local Arts Best of BR 2025 Books Curious Louisiana Faith Festivals Food and Restaurant Forward 64 Games Louisiana Health Home and Garden News Jan Risher Louisiana Inspired Mardi Gras Movies and TV Music Real Estate News Smiley Anders Travel Your Best Life Support Local Arts Best of BR 2025 Books Curious Louisiana Faith Festivals Food and Restaurant Forward 64 Games Louisiana Health Home and Garden News Jan Risher Louisiana Inspired Mardi Gras Movies and TV Music Real Estate News Smiley Anders Travel Your Best Life Support Local Games OpinionClancy DuBosRon FaucheuxStephanie GraceWalt HandelsmanQuin HillyerEd PrattFaimon RobertsWill SuttonGuest ColumnsOur ColumnistsOur ViewsLetters Clancy DuBos Ron Faucheux Stephanie Grace Walt Handelsman Quin Hillyer Ed Pratt Faimon Roberts Will Sutton Guest Columns Our Columnists Our Views Letters Clancy DuBos Ron Faucheux Stephanie Grace Walt Handelsman Quin Hillyer Ed Pratt Faimon Roberts Will Sutton Guest Columns Our Columnists Our Views Letters Obits Classifieds Jobs Homes Public NoticesActs of the LegislatureElection ResultsElection Results - December 1, 2023 Acts of the Legislature Election Results Election Results - December 1, 2023 Acts of the Legislature Election Results Election Results - December 1, 2023 Store Facebook Twitter WhatsApp SMS Email Print Copy article link Save **Recall Kesia Lemoine, Mayor, Town of Elton** May 13, 2024 May 13, 2024 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Facebook Twitter WhatsApp SMS Email Print Copy article link Save Home News Opinion Sports Entertainment/Life Weather/Traffic Newsletters Games Classifieds Search Subscribe Digital Advertising Help/Contact Us RSS Feeds Media Kit eEdition Careers News in Education Ink Settings Reviewing the Record Obituaries Celebrations Jobs Classifieds Homes Store Archives News Tips:newstips@theadvocate.com Other questions:subscriberservices@theadvocate.com Need help? Report a delivery issue Create a temporary stop Sign up for recurring payments Pay your bill Update your billing info Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}