{"id": 2016, "name": "KABC - 790 AM - Los Angeles", "domain": "kabc.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.kabc.com/news/ex-ufc-champ-luke-rockhold-to-newsmax-calling-on-trump-to-pardon-cain-velasquez/", "title": "Ex Ufc Champ Luke Rockhold To Newsmax Calling On Trump To Pardon Cain Velasquez", "content": "**Ex-UFC Champ Luke Rockhold to Newsmax: Calling on Trump to Pardon Cain Velasquez** By / Former UFC middleweight champion Luke Rockhold issued a plea on Newsmax Friday for President Donald Trump to pardon his friend, former UFC heavyweight champion Cain Velasquez, for shooting at the man accused of molesting his young son. In February 2022, Velasquez reportedly fired a handgun multiple times at a truck carrying three people, including Harry Goularte, 46, who is awaiting trial on felony child molestation charges. Prosecutors say Velasquez followed the truck for 11 miles through San Jose in Northern California. Goularte was unhurt, but his stepfather was injured in the incident. Last August, Velasquez pled no contest to attempted murder, felony assault, and other related gun charges and was sentenced on Monday to five years in prison. He will receive credit for time already served. Read more at Newsmax© 2025 Newsmax. All rights reserved. Get our iPhone App Get our Android App Facebook Twitter X VIP **The Latest on KABC** Protesters Clash With Feds At Bay Area Immigration Court **Protesters Clash With Feds At Bay Area Immigration Court** **Protesters Clash With Feds At Bay Area Immigration Court** Marines Hit The Ground In Los Angeles **Marines Hit The Ground In Los Angeles** **Marines Hit The Ground In Los Angeles** Los Angeles Bracing for More Chaotic Protests Today **Los Angeles Bracing for More Chaotic Protests Today** **Los Angeles Bracing for More Chaotic Protests Today** FOX 11 Catches Masked Group Handing Out Riot Gear **FOX 11 Catches Masked Group Handing Out Riot Gear** **FOX 11 Catches Masked Group Handing Out Riot Gear** President Trump Not Ruling Out Invoking Insurrection Act **President Trump Not Ruling Out Invoking Insurrection Act** **President Trump Not Ruling Out Invoking Insurrection Act** Gov. Newsom Announces Plan To Sue Trump Administration **Gov. Newsom Announces Plan To Sue Trump Administration** **Gov. Newsom Announces Plan To Sue Trump Administration** Protest Arrests In Los Angeles **Protest Arrests In Los Angeles** **Protest Arrests In Los Angeles** Supervisors Unanimously Vote To Start Removal Of Elected Sheriff **Supervisors Unanimously Vote To Start Removal Of Elected Sheriff** **Supervisors Unanimously Vote To Start Removal Of Elected Sheriff** Terms of Service Privacy Policy General Contest Rules Submit PSA’s and Press Releases Interested in advertising on our station? Station Information Employment Opportunities EEO Public File Report FCC Public File FCC Applications Cumulus Media Corporate Copyright © 2025 Cumulus Media / Cumulus Media is an equal opportunity employer / AA Get our iPhone App Get our Android App Facebook Twitter X VIP"}