{"id": 1894, "name": "Bild", "domain": "bild.de", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://sportbild.bild.de/fussball/fc-bayern-muenchen/fc-bayern-sucht-nach-neuen-fluegelstars-lothar-matthaeus-enthuellt-top-kandidaten-684939c6bc77b34b10294c52", "title": "Fc Bayern Muenchen", "content": "Infos zu BILDplus Fanmeile Heute Live Video IconVideos Sport im TV ePaper IconHeft-Abo Suche IconSuche Anmelden Startseite Fussball Handball Basketball Klub-WM 2025 Formel E Mehr Sport Formel 1 Tennis Kampfsport Poker Radsport Fussball im TV Sport Bild Award Tabellen & Ergebnisse Bundesliga 2. Liga 3. Liga DFB-Pokal Champions League Europa League International Nationalmannschaft Tabellen & Ergebnisse Bayern München Bayer Leverkusen Eintracht Frankfurt Borussia Dortmund SC Freiburg 1. FSV Mainz 05 RB Leipzig Werder Bremen VfB Stuttgart Bor. Mönchengladbach VfL Wolfsburg FC Augsburg 1. FC Union Berlin FC St. Pauli 1899 Hoffenheim 1. FC Heidenheim 1.FC Köln Hamburger SV Holstein Kiel VfL Bochum SV 07 Elversberg SC Paderborn 07 1. FC Magdeburg Fortuna Düsseldorf 1. FC Kaiserslautern Karlsruher SC Hannover 96 1. FC Nürnberg Hertha BSC SV Darmstadt 98 SpVgg Greuther Fürth FC Schalke 04 Preußen Münster Eintracht Braunschweig Arminia Bielefeld Dynamo Dresden SPORT BILD Fußball FC Bayern München FC Bayern sucht nach neuen Flügelstars: Lothar Matthäus enthüllt Top-Kandidaten **FC Bayern sucht nach neuen Flügelstars: Lothar Matthäus enthüllt Top-Kandidaten** **FC Bayern sucht nach neuen Flügelstars: Lothar Matthäus enthüllt Top-Kandidaten** **Transfer-Ansage!:Matthäus nennt seine drei Wunsch-Spieler für Bayern** Rekordnationalspieler Lothar Matthäus (64) ChristianFalk Christian Falk Christian Falk Christian Falk MichelSchröer Michel Schröer Michel Schröer Michel Schröer NicoLinner Nico Linner Nico Linner Nico Linner JohannesBerner Johannes Berner Johannes Berner Johannes Berner Bayern auf der Suche nach dem perfekten Flügelstürmer! Nachdem Florian Wirtz (22) abgesagt hat, hält derFC Bayernan seinem Konzept mit zwei klassischen Flügelspielern fest. Der Klub hat jetzt einige heiße Kandidaten im Visier, die für einen Transfer infrage kommen. Ganz oben auf der Liste stehen: der Spanier Nico Williams (22) von Athletic Bilbao, der bis 2027 unter Vertrag steht, der Portugiese Rafael Leao (26) vomAC Mailandmit Vertrag bis 2028 und der Franzose Bradley Barcola (22) vonParis Saint-Germain, der ebenfalls bis 2028 gebunden ist. Die große Frage: Wer passt am besten zu den Bayern? Für die BILD hat Rekordnationalspieler und Sky-Experte Lothar Matthäus (64) seine Top 3 aufgestellt. **Top eins: Rafael Leao** „Leao mag vielleicht nicht die konstanteste Saison beim AC Milan gespielt haben, aber das liegt auch daran, dass er dort nicht das volle Vertrauen seines Trainers genießt. Darum sehe ich gerade bei ihm noch sehr viel Potential nach oben, falls Vincent Kompany auf ihn bauen will. Der Portugiese hat wohl am meisten Speed von allen drei Kandidaten, das hat er auch nach seiner Einwechslung im Finale gegen Spanien gezeigt.“ Matthäus sieht zudem noch einen Vorteil bei Leao: „Er kann auch Mittelstürmer spielen, wäre so auch ein Backup für Harry Kane. Aufgrund dieses Gesamtpakets wäre er meine Wahl Nummer 1 für den FC Bayern.“ Rafael Leao (26) **Top zwei: Nico Williams** „Williams ist auf engem Raum gegenüber Leao der Trickreichere. Sein Vorteil ist zudem, dass aufgrund einer Ausstiegsklausel der Kaufpreis nicht verhandelt werden muss. Er hat zudem bei Bilbao eine gute Saison gespielt.“ Flügelflitzer Nico Williams (22) **Top drei: Bradley Barcola** „Der Franzose bringt auch viel Geschwindigkeit mit. Bei Paris hat im Finale allerdings Doué, den die Bayern bereits vor dieser Saison verpflichten wollten, den Vorzug vor Barcola in der Startelf bekommen. Das zeigt, dass er vielleicht noch nicht ganz so weit ist. Aber auch bei ihm ist viel Potential vorhanden. Im direkten Vergleich sehe ich aktuell dennoch Leao und Williams noch ein wenig weiter.“ Bradley Barcola (22) Bevor die Münchner einen der drei Top-Stars verpflichten können, müssen sie laut Lothar Matthäus noch einige Hausaufgaben erledigen. „Das sind alles drei Hochgeschwindigkeitsspieler, die alle in das Bayern-System passen würden. Aber der FC Bayern sollte bei den Preisen für diese Spieler erstmal verkaufen, bevor sie mit Angeboten konkreten werden“, so Matthäus. Der Experte sieht die Notwendigkeit, im Kader Platz zu schaffen: „Sie haben Olise und Gnabry. Bleiben noch Sané und Coman – einer von beiden wird gehen müssen. Nur bei Coman gäbe es eine Ablöse, bei beiden sparen sie immerhin Gehalt.“ Das kommt überraschend! Lamine Yamal (17) erntet normalerweise viel Lob – doch jetzt gab's ordentlich Kritik. Das kommt überraschend! Lamine Yamal (17) erntet normalerweise viel Lob – doch jetzt gab's ordentlich Kritik. Ein millionenschweres Missverständnis lässt Barça-Boss Deco bis heute nicht los. Ein millionenschweres Missverständnis lässt Barça-Boss Deco bis heute nicht los. Sportlich betrachtet, macht der Umbruch auf den Flügeln für Matthäus Sinn. „Olise hat diese Saison bewiesen, dass es den Bayern guttat, dass wieder frisches Blut in das Offensiv-Spiel kam“, erklärt Matthäus. „Sané ist inzwischen fünf Jahre bei Bayern, Gnabry sieben und Coman ganze zehn Jahre. Eine neue Spielfreude täte da dem Kader gut.“ Die Top3 von Matthäus – Leao, Williams und Barcola – stehen fest. Jetzt liegt es an den Bayern-Bossen, ob sie einen dieser Stars an die Isar holen können. Media AGB Impressum Privacy-Manager Datenschutz Verantwortung Kontakt RSS-Feeds Archiv Widerruf Tracking und Cookies"}