{"id": 300, "name": "Center for Science in the Public Interest", "domain": "cspinet.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.cspinet.org/statement/house-agriculture-committee-chooses-partisan-priorities-over-food-nutrition-and-health", "title": "House Agriculture Committee Chooses Partisan Priorities Over Food Nutrition And Health", "content": "Log In Get email updates DonateOne Time GiftGive MonthlyMore Ways to Give One Time Gift Give Monthly More Ways to Give One Time Gift Give Monthly More Ways to Give Healthy LivingWhat to EatThe BasicsShop SmartRestaurant FoodRecipesStaying HealthyPreventing DiseaseExerciseFact vs. FictionThe Planet & Your HealthAdditives & ContaminantsAvoid Food PoisoningVitamins & SupplementsWeight & HealthFeaturedOur guide to food additive safetyCan home remedies ease cold symptoms?How to pick your food packagingThe Healthy Cook's chickpea tagine What to EatThe BasicsShop SmartRestaurant FoodRecipes The Basics Shop Smart Restaurant Food Recipes Staying HealthyPreventing DiseaseExerciseFact vs. FictionThe Planet & Your HealthAdditives & ContaminantsAvoid Food PoisoningVitamins & SupplementsWeight & Health Preventing Disease Exercise Fact vs. Fiction The Planet & Your Health Additives & Contaminants Avoid Food Poisoning Vitamins & Supplements Weight & Health Our guide to food additive safety Can home remedies ease cold symptoms? How to pick your food packaging The Healthy Cook's chickpea tagine What to EatThe BasicsShop SmartRestaurant FoodRecipes The Basics Shop Smart Restaurant Food Recipes The Basics Shop Smart Restaurant Food Recipes Staying HealthyPreventing DiseaseExerciseFact vs. FictionThe Planet & Your HealthAdditives & ContaminantsAvoid Food PoisoningVitamins & SupplementsWeight & Health Preventing Disease Exercise Fact vs. Fiction The Planet & Your Health Additives & Contaminants Avoid Food Poisoning Vitamins & Supplements Weight & Health Preventing Disease Exercise Fact vs. Fiction The Planet & Your Health Additives & Contaminants Avoid Food Poisoning Vitamins & Supplements Weight & Health Our guide to food additive safety Can home remedies ease cold symptoms? How to pick your food packaging The Healthy Cook's chickpea tagine AdvocacyCampaignsPathogens and food safety: Farm to forkNew York nutrient warning labelsPredatory food marketingFood chemical safety & transparencyDietary GuidelinesFront-of-package nutrition labelingFarm BillThe Straight Shot: Federal vaccine updatesOur ApproachAdvocacy resourcesCSPI Action FundGrassroots activismLitigationLatest NewsBack to school: The easiest, healthiest packed lunchesCentering equity in healthy food purchasing policiesFood safety tips for power outages and floodsAll CSPI News articles CampaignsPathogens and food safety: Farm to forkNew York nutrient warning labelsPredatory food marketingFood chemical safety & transparencyDietary GuidelinesFront-of-package nutrition labelingFarm BillThe Straight Shot: Federal vaccine updates Pathogens and food safety: Farm to fork New York nutrient warning labels Predatory food marketing Food chemical safety & transparency Dietary Guidelines Front-of-package nutrition labeling Farm Bill The Straight Shot: Federal vaccine updates Our ApproachAdvocacy resourcesCSPI Action FundGrassroots activismLitigation Advocacy resources CSPI Action Fund Grassroots activism Litigation Back to school: The easiest, healthiest packed lunches Centering equity in healthy food purchasing policies Food safety tips for power outages and floods All CSPI News articles CampaignsPathogens and food safety: Farm to forkNew York nutrient warning labelsPredatory food marketingFood chemical safety & transparencyDietary GuidelinesFront-of-package nutrition labelingFarm BillThe Straight Shot: Federal vaccine updates Pathogens and food safety: Farm to fork New York nutrient warning labels Predatory food marketing Food chemical safety & transparency Dietary Guidelines Front-of-package nutrition labeling Farm Bill The Straight Shot: Federal vaccine updates Pathogens and food safety: Farm to fork New York nutrient warning labels Predatory food marketing Food chemical safety & transparency Dietary Guidelines Front-of-package nutrition labeling Farm Bill The Straight Shot: Federal vaccine updates Our ApproachAdvocacy resourcesCSPI Action FundGrassroots activismLitigation Advocacy resources CSPI Action Fund Grassroots activism Litigation Advocacy resources CSPI Action Fund Grassroots activism Litigation Back to school: The easiest, healthiest packed lunches Centering equity in healthy food purchasing policies Food safety tips for power outages and floods All CSPI News articles Our IssuesNutritionFood labelingHealthy retailDietary Guidelines for AmericansFood service guidelinesSchool foodsHealthy SNAPFood marketing to kidsRestaurant kids' mealsFood safetyAllergensFoodborne illnessHealthy food bankingFood additivesFood dyesDietary supplementsNew food technologiesFood and environment Nutrition Food labeling Healthy retail Dietary Guidelines for Americans Food service guidelines School foods Healthy SNAP Food marketing to kids Restaurant kids' meals Food safety Allergens Foodborne illness Healthy food banking Food additives Food dyes Dietary supplements New food technologies Food and environment Nutrition Food labeling Healthy retail Dietary Guidelines for Americans Food service guidelines School foods Healthy SNAP Food marketing to kids Restaurant kids' meals Food safety Allergens Foodborne illness Healthy food banking Food additives Food dyes Dietary supplements New food technologies Food and environment Get InvolvedTake ActionDonate NowResource HubMore Ways to GivePartner with UsSubgrant Opportunities Take Action Donate Now Resource Hub More Ways to Give Partner with Us Subgrant Opportunities Take Action Donate Now Resource Hub More Ways to Give Partner with Us Subgrant Opportunities About UsProtecting ScienceOur Victories2025-2030 Strategic PlanPeopleMedia CenterCareersIntern ProgramDiversity, Equity, and InclusionHistoryAccountabilityContact UsStaff publications Protecting Science Our Victories 2025-2030 Strategic Plan People Media Center Careers Intern Program Diversity, Equity, and Inclusion History Accountability Contact Us Staff publications Protecting Science Our Victories 2025-2030 Strategic Plan People Media Center Careers Intern Program Diversity, Equity, and Inclusion History Accountability Contact Us Staff publications Nutrition ActionSubscribe to NutritionActionCurrent IssueArchivesSearchMy Account / RenewCustomer ServiceStore Current Issue Archives Search My Account / Renew Customer Service Store Current Issue Archives Search My Account / Renew Customer Service Store Search Toggle Home Media **House Agriculture Committee chooses partisan priorities over food, nutrition, and health for Americans** SHARE Share with Email PRINT ByJoelle Johnson, MPH Updated: May 13, 2025 Tim Mossholder - unsplash.com. Statement of CSPI Deputy Director for Healthy Food Access Joelle Johnson Today, the House Agriculture Committee is debating its section of the reconciliation bill. On the plate for this debate are drastic changes to critical federal nutrition programs. These so-called state cost-sharing arrangements are cuts that will ultimately leave millions of working families hungry. To meet the partisan goal of extending tax cuts for billionaires, House Republicans will vote on more than $230 billion in drastic changes to how the nation’s most important nutrition program, the Supplemental Nutrition Assistance Program (SNAP), is financed and operates. These changes will directly limit food access for children and families living in households experiencing food and nutrition insecurity. Instead of working to lower rising grocery prices, the House Agriculture Committee is increasing the strain on state governments through new funding requirements. These requirements will force states to pay for parts of SNAP using a sliding scale based on their payment error rates, beginning in Fiscal Year 2028. The hardest hit states will be Alaska, South Carolina, Hawaii, Delaware, and New Jersey. If passed today, this party-line bill will head to the House floor. CSPI hopes that sensible members of Congress will prioritize food access, nutrition, and public health for working families by rejecting these cuts. At a time of economic uncertainty, this bill is also looking to limit access to SNAP through new work requirements for parents of children over age seven, as well as older Americans between the ages of 55 and 65. If those parents and older Americans are unable to navigate these new bureaucratic hurdles, they will be ineligible for SNAP and likely struggle hard to meet their families’ basic needs. Even as the Administration talks about tackling obesity and chronic health, Congress is looking to eliminate the SNAP Nutrition Education Program (SNAP-Ed) entirely. SNAP-Ed is unique in combining education, social marketing, family support, and community outreach in one program. Cutting such a program speaks to their commitment to tax cuts at all costs. Through this bill, House Republicans have made it clear where their priorities lie: padding the pockets of billionaires by stripping food access from those struggling to make ends meet. It is unconscionable to pass such harmful legislation. We strongly urge Congress to reject these proposals. Instead, now is the time to work toward bipartisan solutions that will support food access and improve nutrition for millions of children and working-class families. # # # Tags SNAP School Foods Topics Government Accountability SNAP Healthy Kids Nutrition Action provides honest, unbiased, science-based advice on nutrition and health. facebook threads instagram youtube tiktok bluesky About Us Careers Accountability NutritionActionStore Hungry for change?It starts here. © Copyright 2025, Center for Science in the Public Interest. All rights reserved. Terms of Service Privacy Policy Reprint Requests One Time Gift Give Monthly More Ways to Give Healthy LivingToggle AccordionWhat to EatThe BasicsShop SmartRestaurant FoodRecipesStaying HealthyPreventing DiseaseExerciseFact vs. FictionThe Planet & Your HealthAdditives & ContaminantsAvoid Food PoisoningVitamins & SupplementsWeight & Health What to EatThe BasicsShop SmartRestaurant FoodRecipes The Basics Shop Smart Restaurant Food Recipes Staying HealthyPreventing DiseaseExerciseFact vs. FictionThe Planet & Your HealthAdditives & ContaminantsAvoid Food PoisoningVitamins & SupplementsWeight & Health Preventing Disease Exercise Fact vs. Fiction The Planet & Your Health Additives & Contaminants Avoid Food Poisoning Vitamins & Supplements Weight & Health What to EatThe BasicsShop SmartRestaurant FoodRecipes The Basics Shop Smart Restaurant Food Recipes The Basics Shop Smart Restaurant Food Recipes Staying HealthyPreventing DiseaseExerciseFact vs. FictionThe Planet & Your HealthAdditives & ContaminantsAvoid Food PoisoningVitamins & SupplementsWeight & Health Preventing Disease Exercise Fact vs. Fiction The Planet & Your Health Additives & Contaminants Avoid Food Poisoning Vitamins & Supplements Weight & Health Preventing Disease Exercise Fact vs. Fiction The Planet & Your Health Additives & Contaminants Avoid Food Poisoning Vitamins & Supplements Weight & Health AdvocacyToggle AccordionCampaignsPathogens and food safety: Farm to forkNew York nutrient warning labelsPredatory food marketingFood chemical safety & transparencyDietary GuidelinesFront-of-package nutrition labelingFarm BillThe Straight Shot: Federal vaccine updatesOur ApproachAdvocacy resourcesCSPI Action FundGrassroots activismLitigation CampaignsPathogens and food safety: Farm to forkNew York nutrient warning labelsPredatory food marketingFood chemical safety & transparencyDietary GuidelinesFront-of-package nutrition labelingFarm BillThe Straight Shot: Federal vaccine updates Pathogens and food safety: Farm to fork New York nutrient warning labels Predatory food marketing Food chemical safety & transparency Dietary Guidelines Front-of-package nutrition labeling Farm Bill The Straight Shot: Federal vaccine updates Our ApproachAdvocacy resourcesCSPI Action FundGrassroots activismLitigation Advocacy resources CSPI Action Fund Grassroots activism Litigation CampaignsPathogens and food safety: Farm to forkNew York nutrient warning labelsPredatory food marketingFood chemical safety & transparencyDietary GuidelinesFront-of-package nutrition labelingFarm BillThe Straight Shot: Federal vaccine updates Pathogens and food safety: Farm to fork New York nutrient warning labels Predatory food marketing Food chemical safety & transparency Dietary Guidelines Front-of-package nutrition labeling Farm Bill The Straight Shot: Federal vaccine updates Pathogens and food safety: Farm to fork New York nutrient warning labels Predatory food marketing Food chemical safety & transparency Dietary Guidelines Front-of-package nutrition labeling Farm Bill The Straight Shot: Federal vaccine updates Our ApproachAdvocacy resourcesCSPI Action FundGrassroots activismLitigation Advocacy resources CSPI Action Fund Grassroots activism Litigation Advocacy resources CSPI Action Fund Grassroots activism Litigation Our IssuesToggle AccordionNutritionFood labelingHealthy retailDietary Guidelines for AmericansFood service guidelinesSchool foodsHealthy SNAPFood marketing to kidsRestaurant kids' mealsFood safetyAllergensFoodborne illnessHealthy food bankingFood additivesFood dyesDietary supplementsNew food technologiesFood and environment Nutrition Food labeling Healthy retail Dietary Guidelines for Americans Food service guidelines School foods Healthy SNAP Food marketing to kids Restaurant kids' meals Food safety Allergens Foodborne illness Healthy food banking Food additives Food dyes Dietary supplements New food technologies Food and environment Nutrition Food labeling Healthy retail Dietary Guidelines for Americans Food service guidelines School foods Healthy SNAP Food marketing to kids Restaurant kids' meals Food safety Allergens Foodborne illness Healthy food banking Food additives Food dyes Dietary supplements New food technologies Food and environment Get InvolvedToggle AccordionTake ActionDonate NowResource HubMore Ways to GivePartner with UsSubgrant Opportunities Take Action Donate Now Resource Hub More Ways to Give Partner with Us Subgrant Opportunities Take Action Donate Now Resource Hub More Ways to Give Partner with Us Subgrant Opportunities About UsToggle AccordionProtecting ScienceOur Victories2025-2030 Strategic PlanPeopleMedia CenterCareersIntern ProgramDiversity, Equity, and InclusionHistoryAccountabilityContact UsStaff publications Protecting Science Our Victories 2025-2030 Strategic Plan People Media Center Careers Intern Program Diversity, Equity, and Inclusion History Accountability Contact Us Staff publications Protecting Science Our Victories 2025-2030 Strategic Plan People Media Center Careers Intern Program Diversity, Equity, and Inclusion History Accountability Contact Us Staff publications Nutrition ActionToggle AccordionCurrent IssueArchivesSearchMy Account / RenewCustomer ServiceStoreSubscribe Current Issue Archives Search My Account / Renew Customer Service Store Subscribe Current Issue Archives Search My Account / Renew Customer Service Store Subscribe"}