{"id": 1321, "name": "The Post-Standard (Syracuse)", "domain": "syracuse.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.syracuse.com/shopping/2025/06/kate-spade-adds-its-unique-wordplay-mini-manhattan-tote-to-this-weeks-sale-and-you-wont-believe-how-much-it-costs.html", "title": "Kate Spade Adds Its Unique Wordplay Mini Manhattan Tote To This Weeks Sale And You Wont Believe How Much It Costs.html", "content": "Best Gifts for Kids Gifts for Mom Gifts under $100 Best Stocking Stuffers Shopping **Kate Spade adds its unique Wordplay Mini Manhattan Tote to this week’s sale, and you won’t believe how much it costs** Updated:Jun. 11, 2025, 5:10 p.m. |Published:Jun. 11, 2025, 5:10 p.m. Yzzy Liwanag | YLiwanag@syracuse.com There’s nothing better than scoring a huge deal on an item you’ve been eyeing, and this week, we’ve been eyeing a ton ofKate Spade’sstunning purses. If Kate Spade’s constant bag deals aren’t enough for you, shoppers can score an extra 40% off with codeSALEONSALEuntil Sunday, July 6. One of Kate Spade’s most unique purses is up to 40% off. TheWordplay Mini Manhattan Totewas $328, but is on sale for $158. If you’re looking for a handbag that blends charm, practicality, and a touch of wit, the Wordplay Mini Manhattan Tote from Kate Spade is your perfect match. Inspired by leisurely mornings spent solving crosswords, this tote is a stylish nod to word lovers and city dwellers alike. **Why You’ll Love It:** Spacious Yet Compact: Despite its mini size, this tote is surprisingly roomy—big enough to fit even the largest iPhone, with space to spare. Eye-Catching Design: The “True White Multi” colorway adds a fresh, clean look with playful graphic elements that make it stand out. Premium Craftsmanship: As with all Kate Spade pieces, the quality is top-notch, ensuring durability and elegance in every stitch. Versatile Carry: Whether you’re heading to brunch, the bookstore, or a casual day out, this tote complements any outfit with ease. This tote isn’t just a bag—it’s a conversation starter. Whether you’re gifting it or treating yourself, the Wordplay Mini Manhattan Tote is a fashionable way to show off your love for words and style. Learn more about this producthere. **More Shopping and Deals** Disneyland celebrates Sleeping Beauty’s 70th anniversary with limited edition Aurora doll - Here’s where to get it DSW has a motherlode of Converse Chuck Taylors on sale this week up to 25% off Forget the Ninja SLUSHi, this ‘optimized’ slushie machine is on sale and it’s selling fast Kate Spade Outlet takes 77% off this summer-ready Kenzie Mini Crossbody Walmart is having a deal on the Keurig K-Iced Essentials for only $59, was $80 Generative AI was used to produce an initial draft for this story, based on data provided by Kate Spade. It was reviewed and edited by Syracuse.com. If you purchase a product or register for an account through a link on our site, we may receive compensation.By using this site, you consent to ourUser Agreementand agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with ourPrivacy Policy. **Footer Navigation** About Us Photo and Page Reprints Advertise with us Jobs at Advance Media New York Contact Us Newspaper Archives Frequently Asked Questions Accessibility Statement Submit letter, commentary syracuse.com syracuse.com Orange Sports Insider The Post-Standard Email Newsletters Manage your Subscription Place a Vacation Hold Make a Payment Delivery Feedback News Weather Business Sports High School Sports Betting Entertainment Living Opinion Obituaries Jobs Autos Real Estate Rentals Classifieds Tablet Apps iPhone, Android apps Videos Sitemap Sponsor Content Archives Sell your car Post a job Post a classified ad Sell/rent your home Twitter Instagram Facebook YouTube RSS Your Privacy Choices Privacy Policy |User Agreement |Ad Choices **Disclaimer** Use of and/or registration on any portion of this site constitutes acceptance of ourUser Agreement, (updated 8/1/2024) and acknowledgement of ourPrivacy Policy,andYour Privacy Choices and Rights(updated 1/1/2025). ©2025Advance Local Media LLC. All rights reserved (About Us).The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Advance Local. Community Rulesapply to all content you upload or otherwise submit to this site. YouTube's privacy policyis availablehereandYouTube's terms of serviceis availablehere. Ad Choices"}