{"id": 1949, "name": "Earth.org", "domain": "earth.org", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://earth.org/maintain-momentum-us-research-organizations-call-on-papers-to-keep-national-climate-assessment-alive-amid-trumps-cuts/", "title": "Maintain Momentum Us Research Organizations Call On Papers To Keep National Climate Assessment Alive Amid Trumps Cuts", "content": "Email* NameThis field is for validation purposes and should be left unchanged. Climate Change Energy Pollution Policy & Economics Oceans Biodiversity Conservation Solutions Guides ABOUT SUPPORT Earth.Org NewslettersGet focused newsletters especially designed to be concise and easy to digest Get focused newsletters especially designed to be concise and easy to digest Get focused newsletters especially designed to be concise and easy to digest Subscription Options*ESSENTIAL BRIEFING3 times weeklyTOP STORY ROUNDUPOnce a weekMONTHLY OVERVIEWOnce a month ESSENTIAL BRIEFING3 times weekly TOP STORY ROUNDUPOnce a week MONTHLY OVERVIEWOnce a month ESSENTIAL BRIEFING3 times weekly TOP STORY ROUNDUPOnce a week MONTHLY OVERVIEWOnce a month Enter your email* PhoneThis field is for validation purposes and should be left unchanged. **‘Maintain Momentum’: US Research Organizations to Keep National Climate Assessment Alive Amid Trump’s Cuts** Two research bodies joined forces on collecting peer-reviewed research to support the Congress-mandated US National Climate Assessment days after the Trump administration dismissed its contributors. — Two major US research organizations have stepped up after the Trump administrationdismissedall the scientists working on an assessment of climate change in the US. The American Geophysical Union (AGU), the world’s largest association of Earth and space scientists, and the American Meteorological Society (AMS) called on researchers to submit peer-reviewed studies to inform the upcoming National Climate Assessment (NCA). Required by Congress and published every few years since 2000, the NCA is the most comprehensive source of information about how climate change affects the US. State and local governments, as well as private companies, have been using the report to prepare for the impacts of climate change-related calamities, such as heatwaves, floods, and droughts. But hundreds of volunteer contributors who had been working for almost a year on the sixth edition of the assessment, scheduled for early 2028, were dismissed in late April. An email informed them that the report’s scope was being “re-evaluated” and thanked them for their work. “As plans develop for the assessment, there may be future opportunities to contribute or engage. Thank you for your service,” the email read. In astatementreleased on Friday, AMS and AGU said it was their duty to “maintain momentum” of research supporting the assessment and to ensure Americans are “protected and prepared” for the impacts of a rapidly changing climate. “The National Climate Assessment is a comprehensive, rigorous integration and evaluation of the latest climate science knowledge that decision makers — from government at all levels to private enterprise — need in order to understand the world in which we live,” said AMS President David J. Stensrud. Featured image: Lieut. Commander Mark Moran, NOAA Corps, NMAO/AOC via Flickr. You might also like:100 Days of Trump: How the US Overturned Years of Climate Progress **This story is funded by readers like you** Our non-profit newsroom provides climate coverage free of charge and advertising. Your one-off or monthly donations play a crucial role in supporting our operations, expanding our reach, and maintaining our editorial independence. About EO|Mission Statement|Impact & Reach|Write for us **About the Author** **15 Biggest Environmental Problems of 2025** **15 Biggest Environmental Problems of 2025** **4 Biggest Environmental Issues in the Philippines in 2024** **4 Biggest Environmental Issues in the Philippines in 2024** **Water Shortage: Causes and Effects** **Water Shortage: Causes and Effects** Hand-picked stories weekly or monthly. We promise, no spam! About Us Mission Statement Impact & Reach Data Visualisations Earth.Org for Teachers Earth.Org for Parents Earth.Org for Kids Meet the Team Join the Team Donate Global Ambassadors Terms|Privacy policy|Cookies © Earth.Org Facebook Instagram Linkedin Twitter Youtube Google News Partnering Partnering Partnering Fund Our Mission Fund Our Mission Fund Our Mission Supporters Supporters Supporters Join the EO Movement NGO News Submissions NGO News Submissions NGO News Submissions EO Photographers EO 2024 Photography Competition Conservationists Volunteer Write for us Edit for us Help with Data Science Kids.Earth.Org website Schools Get involved Schools Sign Up +852 2110 4370 Email: contact[at]earth.orgEarth.Org LtdThe Hive on Seven7F Cheung Hing Industrial BuildingKennedy TownHong Kong Earth.Org Ltd The Hive on Seven7F Cheung Hing Industrial BuildingKennedy TownHong Kong Earth.Org Ltd The Hive on Seven7F Cheung Hing Industrial BuildingKennedy TownHong Kong Email* Subscription OPtionsTOP STORY ROUNDUPOnce a weekMONTHLY OVERVIEWOnce a month TOP STORY ROUNDUPOnce a week MONTHLY OVERVIEWOnce a month TOP STORY ROUNDUPOnce a week MONTHLY OVERVIEWOnce a month EmailThis field is for validation purposes and should be left unchanged. Boost this articleBy donating us $100, $50 or subscribe to Boosting $10/month – we can get this article and others in front of tens of thousands of specially targeted readers. This targeted Boosting –helps us to reach wider audiences– aiming to convince the unconvinced, to inform the uninformed, to enlighten the dogmatic. donate"}