{"id": 1644, "name": "Yellow Hammer News", "domain": "yellowhammernews.com", "bias": "right", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://yellowhammernews.com/longshore-and-mcknight-200th-episode-troy-baseball-left-out-of-ncaa-tournament-ongoing-college-football-reform-nba-playoffs-and-more/", "title": "Longshore And Mcknight 200th Episode Troy Baseball Left Out Of Ncaa Tournament Ongoing College Football Reform Nba Playoffs And More", "content": "Politics Business Faith & Culture Sports Radio Radio Menu Menu × **Sections** Politics Business Faith & Culture Sports **About** About Us Team Events Radio Network Video **Longshore and McKnight: 200th episode! Troy Baseball left out of NCAA tournament, ongoing college football reform, NBA playoffs, and more…** — Today marks the 200th episode ofLongshore and McKnight! John and Barry celebrated the milestone show with a blend of sports analysis, nostalgia, and listener interaction. They reflected on the show’s growth and consistency, joking about early missteps while thanking the audience for making the run possible. “We didn’t think we’d get past ten,” John Longshore joked. They jumped into the frustration lingering over Troy baseball’s exclusion from the NCAA Tournament despite a strong RPI and weekend series record, with Barry and John pointing to growing postseason bias in favor of power conference teams. That conversation flowed into broader speculation about the future of college football, with the duo debating whether the SEC and Big Ten might break away entirely for their own playoff system. “If they do that,” John warned, “you’re going to lose a lot of what makes college football matter to people outside that bubble.” Catch live episodes of Longshore and McKnight daily on YouTube, Spotify, and on Yellowhammer News🎙️🔊 The show also shifted to the NBA Playoffs, where the hosts weighed in on star power, TV ratings, and whether the league can sustain excitement past the opening rounds. They highlighted a few standout performances and questioned if the drama measures up to college football’s intensity—particularly around the growing divide between major programs and the rest of the field. **Recent in Video** **Longshore and McKnight: U.S. Open at Oakmont preview, college football preseason rankings, declining fan engagement, NBA Finals, and more…** Yellowhammer News—1 hour ago **President Donald Trump is correct, the riots are an insurrection, and he should act accordingly** Dale Jackson—4 hours ago **Related** **7 Things: Big win for Trump on LA riots; Alabama senators slam rioters; congresswoman facing jail; and more …** Dale Jackson—9 hours ago **Smokable hemp is banned in Alabama as of July 1st – hopefully, the law will be stringently enforced** Dale Jackson—Yesterday **7 Things: L.A. riots rage on as Trump sends more troops; Newsom attacks Tuberville; Alabama Republicans and Democrats react; and more …** Dale Jackson—Yesterday **Alabama’s Democrats are absolutely silent on the violence taking place in Los Angeles right now** Dale Jackson—2 days ago **Longshore and McKnight: CFB’s evolving postseason format, bowl games realignment, NCAA baseball postseason, and more…** Yellowhammer News—2 days ago **7 Things: Trump fights illegal immigrant insurrection in California; ICE and Homeland Security target Alabama illegals; and more…** Dale Jackson—2 days ago Next Post **Will the NCAA v. House settlement impact fans? Paul Finebaum says ‘it means very little’** Yellowhammer News is Alabama’s preeminent outlet for news, analysis and much more. We are committed to delivering the news in a manner that reflects the state of Alabama, its people and their values. Instagram Facebook LinkedIn X Privacy Policy Corrections Policy Fact Checking Policy Ownership Contact Editors Advertising © 2025 Yellowhammer News"}