{"id": 988, "name": "St. Clair News-Aegis", "domain": "newsaegis.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://newsaegis.com/2025/06/02/steering-committee-releases-boe-finalist-list-public-interviews-scheduled-june-16-18/", "title": "Steering Committee Releases Boe Finalist List Public Interviews Scheduled June 16 18", "content": "Home Subscriptions Newsletter signup E-Edition News Obituaries OpinionEditorialsColumns Editorials Columns Editorials Columns Classifieds Public Notices ServicesContact UsAbout Us Contact Us About Us Contact Us About Us Home News Obituaries Opinion Classifieds Public Notices E-Edition **Steering Committee releases BOE finalist list; Public interviews scheduled June 16-18** Published 8:07 pm Monday, June 2, 2025 By Special to The News-Aegis On May 23, the Pell City Board of Education Steering Committee announced a list of 18 finalists who have been invited to interview for a seat on the Pell City Board of Education. More information on these finalists can be found atpell-city.com/boe-finalists. The Steering Committee’s review process has involved a comprehensive evaluation of all 47 applicants seeking appointment to the Board of Education. Under its stated goal to recommend the most qualified candidates to the City Council, the Committee’s seven volunteer members carefully reviewed the submitted material before releasing their list of interview candidates. “The overwhelming response of immensely qualified and talented applicants made this process extremely difficult — a very good difficult,” said Committee Chair Kelly Furgerson. “What an amazing problem to have — so many really good people who want to be involved with the decision making of our school system. “We are so grateful for each and every individual who applied, offering their time and talents to serve. We sincerely hope that all applicants and the rest of our community continue to be passionate about our City and the Pell City Board of Education. Your dedication makes a difference.” Invited to participate in public interviews are, in alphabetical order: — Ryan Abernathy— Joseph Brascho— Shannon Cochran— Austin Brian Ellard— James Epperson— Cecil Fomby— Phaith Frazier— Tim Hawkins— Jesse P. Hooks— Jarrett Jacobs— Brian Jennings— Robert Kreitlein— Gary London Sr.— Kandie Magargee— Matt Moon— Tammy Stewart— Mara Walls— Eddie WilsonPublic interviews for the finalists are scheduled for June 16-18, from 5 p.m. to 7:30 p.m. daily. These interviews will take place at the Center for Education and Performing Arts (CEPA) auditorium. Six finalists will be interviewed each day, with each interview lasting no more than 20 minutes. The public is invited to attend these interviews, and all interviews will be filmed and released to the public. The Steering Committee is responsible for reviewing applicants, naming finalists, and recommending finalists for appointment. By State law, at least two residents who live in the St. Clair County portion of the Pell City Attendance Zone and Tax District will be appointed to the Board of Education in 2025. Members appointed by the City Council will begin their terms in November. “I want to express my deepest gratitude to every member of the Steering Committee for their tireless work and dedication throughout this important process,” Furgerson said. “We’ve poured our hearts into finding the best possible candidates for our school board, and we truly believe in this list. We genuinely encourage everyone in the community to come out to the upcoming interviews at CEPA and get to know these incredible finalists who are ready to serve our students and schools.” **You Might Like** **(Column) Republican legislature posts conservative agenda** **(Column) Republican legislature posts conservative agenda** **4-H members bring home ribbons from State contests** **4-H members bring home ribbons from State contests** News Obituaries Opinion Newsletter signup e-Edition Subscriptions Classifieds About Us Contact Us"}