{"id": 872, "name": "The Marietta Times", "domain": "mariettatimes.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.mariettatimes.com/news/business/2025/06/government-moves-to-drop-sheetz-race-case-after-trump-halts-use-of-key-civil-rights-tool/", "title": "Government Moves To Drop Sheetz Race Case After Trump Halts Use Of Key Civil Rights Tool", "content": "NewsLocal NewsNeighborhood NewsBusinessEntertainmentOhio NewsWest Virginia NewsNational NewsInternational NewsReligionNews of Record Local News Neighborhood News Business Entertainment Ohio News West Virginia News National News International News Religion News of Record Local News Neighborhood News Business Entertainment Ohio News West Virginia News National News International News Religion News of Record SportsLocal SportsSports ColumnsOhio SportsWest Virginia SportsNational Sports Local Sports Sports Columns Ohio Sports West Virginia Sports National Sports Local Sports Sports Columns Ohio Sports West Virginia Sports National Sports OpinionLocal ColumnsEditorialsLetters to the Editor Local Columns Editorials Letters to the Editor Local Columns Editorials Letters to the Editor LifeEngagementsAnniversariesFeaturesLocal ColumnsWeddings Engagements Anniversaries Features Local Columns Weddings Engagements Anniversaries Features Local Columns Weddings Obituaries Jobs Homes Classifieds Garage Sales Contact InformationContact UsSubmit NewsSubscribeAdvertiseStatement of ValuesTerms of Service Contact Us Submit News Subscribe Advertise Statement of Values Terms of Service Contact Us Submit News Subscribe Advertise Statement of Values Terms of Service Public NoticesBrowse noticesPlace a notice Browse notices Place a notice Browse notices Place a notice Facebook Twitter News Sports Opinion Life Obituaries Jobs Homes Classifieds Place Notice SUBSCRIBE SUBSCRIBE June 11, 2025 | Today's Paper | Submit News | Subscribe Today Today's Paper | Subscribe Today **Government moves to drop Sheetz race case after Trump halts use of key civil rights tool** **** Jun 7, 2025 FILE - The exterior of a Sheetz store in Altoona, Pa., is shown Friday, Feb. 23, 2007. (J.D. Cavrich/Altoona Mirror via AP,File) (AP) — Federal authorities moved Friday to drop a racial discrimination lawsuit against the Sheetz convenience store chain, part of a broader effort by President Donald Trump’s administration to halt the use of a key tool for enforcing the country’s civil rights laws. The Equal Employment Opportunity Commission, the top federal agency for enforcing workers rights, filed a motion in a Pennsylvania federal court to dismiss the Sheetz lawsuit, citing Trump’s executive order directing federal agencies to deprioritize the use of “disparate impact liability” in civil rights enforcement. Disparate impact liability holds that policies that are neutral on their face can violate civil rights laws if they impose artificial barriers that disadvantage different demographic groups. The concept has been used to root out practices that close off minorities, women, people with disabilities, older adults or other groups from certain jobs, or keep them from accessing credit or equal pay. Trump’s executive order is part of his campaign to upend civil rights enforcement through firings and other steps that have consolidated his power over quasi-independent agencies like the EEOC, redirecting them to implement his priorities, including stamping out diversity and inclusion practices and eroding the rights of transgender people. In the Sheetz case, filed in April 2024 under the Biden administration, the EEOC had claimed that the company’s policy of refusing to hire anyone who failed its criminal background checks discriminated against Black, Native American and multiracial job applicants. The lawsuit could survive even if the EEOC drops it: A Black worker who was let go from his Sheetz job in Pennsylvania filed a motion in federal court Thursday evening to intervene and pursue his own class action lawsuit. In its motion Friday, the EEOC asked the court to delay its dismissal of the lawsuit for 60 days to allow potential claimants to intervene. What is disparate impact? The Supreme Court recognized the concept of disparate impact in a landmark 1971 case, which held that a North Carolina power plant discriminated against Black employees by requiring high school diplomas and an intelligence test for certain higher paying roles, even though the requirements were irrelevant to the jobs. In 1991, bipartisan majorities in Congress voted to codify disparate impact in Title VII of the 1964 Civil Rights Act, which prohibits workplace discrimination on the basis of race, color, religion, sex or national origin. The concept holds that it is illegal to impose barriers to employment if such practices have a discriminatory effect and have no relevance to the requirements of the job. What does Trump’s executive order say? The April 23 order declared that it is “the policy of the United States to eliminate the use of disparate-impact liability in all contexts to the maximum degree possible.” The order argued that disparate impact has become a “key tool” of a “pernicious movement” that threatens meritocracy in favor of “racial balancing” in the workforce. Craig Leen, a former top official at the Labor Department under the first Trump administration, said while the executive order take a more aggressive approach, it reflects long-standing conservative concerns that disparate impact liability encourages the assumption that any racial imbalance in the workforce is a result of discrimination. Harmeet K. Dhillon, assistant U.S. attorney general for civil rights, said the Trump administration would rightfully “focus on individual discrimination cases,” which she said are “more factually sound, less susceptible to manipulation, and more closely hews to the original intent” of civil rights law. What is happening with the Sheetz case? The EEOC filed the original Sheetz lawsuit after an eight-year investigation that arose from complaints filed by two job applicants. But following Trump’s disparate impact order, the EEOC filed a motion District Court for the Western District of Pennsylvania to dismiss the lawsuit. The EEOC had sent letters to potential claimants notifying them of its intention to drop the case and urging them to act quickly if they wished to intervene. U.S. workers can pursue federal discrimination lawsuits on their own if the EEOC declines to take up their complaints but often don’t because of the resources required. The EEOC declined to comment further on the case. One of the potential claimants, Kenni Miller, filed a motion to intervene late Thursday. Miller, 32, was hired as a shift supervisor at a Sheetz in Altoona, Pennsylvania, in 2020, according to the motion filed by the law firm Outten & Golden, which represents workers in employment disputes, and the Public Interest Law Center. After working there for a month, Miller was told he failed the background check because of a felony drug conviction and was let go, according to the motion. According to the EEOC’s lawsuit, Sheetz’ policy of denying jobs who anyone who failed a background check resulted in 14.5% Black job applicants being denied employment, compared to 8% of white applicants. For Native American applicants, the rate was 13%, and for multiracial applicants, it was 13.5%. In court filings, Sheetz denied the allegations. Attorneys for the company, which is being represented by the law firm Littler, declined to comment further. The EEOC has not said how many potential claimants have been identified but Outten & Golden estimates the number to likely be in the thousands. Sheetz has more than 20,000 employees and operate at least 700 brand-store locations in Maryland, North Carolina, Ohio, Pennsylvania, Virginia, and West Virginia, according to court documents. What other cases have leveraged disparate impact liability? The Sheetz case echoes a 2018 lawsuit against Target claiming that the retailer’s hiring process, which automatically rejected people with criminal backgrounds, disproportionately kept Black and Hispanic applicants from getting entry level jobs. Target agreed to pay more than $3.7 million to settle the lawsuit, and revised its policy so fewer applicants with criminal records would be disqualified. In 2020, Walmart agreed to pay $20 million and discontinue a preemployment strength test that the EEOC had claimed in a lawsuit unfairly excluded women from jobs at grocery distribution centers. And in one of the biggest sex discrimination cases in recent years, Sterling Jewelers, the parent company of Jared and Kay Jewelers, agreed in 2022 to pay $175 million to settle a long-fought lawsuit alleging that some 68,000 women had been subjected for years to unfair pay and promotion practices. What’s the potential fallout of scrapping disparate impact? The Justice Department, EEOC and other federal agencies have moved quickly to quash the use of disparate impact liability. The Justice Department’s Civil Rights Division, for example, has moved to dismiss several Biden-era lawsuits against police departments in Kentucky and Minnesota, saying the cases claimed patterns of unconstitutional policing practices “by wrongly equating statistical disparities with intentional discrimination.” In a May memo to employers, EEOC Acting Chief Andrea Lucas said the agency would deprioritize disparate impact cases. She also warned companies against using demographic data, which large companies are required gather and submit annually to the EEOC, to justify policies that favor any employees based on race or sex, something Lucas has long argued many well-intentioned DEI policies do in violation of Title VII. A Supreme Court ruling Thursday could help open the door for more complaints against DEI policies that Lucas has said will be her priority. Jenny Yang, a former EEOC chair now with Outten & Golden, said the pullback on federal enforcement of disparate impact risks dissuading companies from proactively examining hiring and other practices to ensure they do not discriminate. At the same time, Yang and nine other former Democratic EEOC commissioners and counsels have released a letter to employers emphasizing that the Trump’s order does not change the law. “Employers should not expect that they will have a free pass on disparate impact liability simply because the President has instructed federal agencies not to pursue enforcement of the law,” wrote the former EEOC officials. **Newsletter** **Business** **Business** **Government moves to drop Sheetz race case after Trump halts use of key civil rights tool** **Government moves to drop Sheetz race case after Trump halts use of key civil rights tool** **Southern California air regulators weigh a plan to phase out gas furnaces and water heaters** **Southern California air regulators weigh a plan to phase out gas furnaces and water heaters** **Stock market today: Wall Street gains ground after solid jobs report** **Stock market today: Wall Street gains ground after solid jobs report** **Midea recalling 1.7 million of its popular air conditioners due to mold concern** **Midea recalling 1.7 million of its popular air conditioners due to mold concern** (AP) — Midea is voluntarily recalling about 1.7 million of its popular U and U+ Smart air conditioners because ... **Two people join OhioSE Business Development** **Two people join OhioSE Business Development** **U.S., Chinese officials to meet in London next week for new round of trade talks** **U.S., Chinese officials to meet in London next week for new round of trade talks** WASHINGTON (AP) — Senior U.S. administration officials will meet with a Chinese delegation on Monday in London ... MOST READ **Belpre City Council discusses changing time of future meetings** **Belpre City Council discusses changing time of future meetings** **Disney to pay almost $439 million to take full control of streaming service Hulu** **Disney to pay almost $439 million to take full control of streaming service Hulu** **Trump’s deployment: What to know about the positioning of Marines, National Guard to protests** **Trump’s deployment: What to know about the positioning of Marines, National Guard to protests** **Judge dismisses Justin Baldoni’s $400M lawsuit against ‘It Ends With Us’ costar Blake Lively** **Judge dismisses Justin Baldoni’s $400M lawsuit against ‘It Ends With Us’ costar Blake Lively** **St. Marys’ Masters selected to Class AA first team** **St. Marys’ Masters selected to Class AA first team** **Silicon Valley city makes homeless people eligible for arrest if they refuse 3 offers of shelter** **Silicon Valley city makes homeless people eligible for arrest if they refuse 3 offers of shelter** **Newsletter** **Starting at $2.99/week.** **Subscribe Today** **Subscribe Today** NewsLocal NewsObituariesBusinessWest Virginia News Local News Obituaries Business West Virginia News Local News Obituaries Business West Virginia News SportsLocal SportsLocal Sports ColumnsWest Virginia SportsOhio Sports Local Sports Local Sports Columns West Virginia Sports Ohio Sports Local Sports Local Sports Columns West Virginia Sports Ohio Sports OpinionLocal ColumnsEditorialsLetters to the Editor Local Columns Editorials Letters to the Editor Local Columns Editorials Letters to the Editor LifeLocal ColumnsFeaturesEngagementsWeddings Local Columns Features Engagements Weddings Local Columns Features Engagements Weddings ContactSubmit NewsAdvertiseContact Us Submit News Advertise Contact Us Submit News Advertise Contact Us Copyright © 2025 Eastern Ohio Newspapers, Inc. | https://www.mariettatimes.com | 740-373-2121"}