{"id": 23, "name": "American Academy of Pediatrics", "domain": "aap.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://shop.aap.org/professional-education/self-assessments/", "title": "Professional Education", "content": "Internet Explorer Alert It appears you are using Internet Explorer as your web browser. Please note, Internet Explorer is no longer up-to-date and can cause problems in how this website functionsThis site functions best using the latest versions of any of the following browsers:Edge, Firefox, Chrome, Opera, or Safari.You can find the latest versions of these browsers athttps://browsehappy.com Publications shopAAP PediaLink HealthyChildren.org **Shopping cart** Order Subtotal Your cart is empty. Looks like you haven't added anything to your cart. Loading AAP HomeNewsMembershipCareer ResourcesResearchPhilanthropyAbout the AAP News Membership Career Resources Research Philanthropy About the AAP News Membership Career Resources Research Philanthropy About the AAP PolicyPostnatal Cord Blood SamplingYour Baby's Umbilical Cord: 5 Surprising Facts for New & Expectant ParentsCord Blood Sampling Should Be First Choice for Infants Who Need Phlebotomy At, Shortly After deliveryEl Cordón Umbilical de Su Bebé: 5 Datos Sorprendentes para Madres y PadresNews ReleasesPolicy Collections Postnatal Cord Blood Sampling Your Baby's Umbilical Cord: 5 Surprising Facts for New & Expectant Parents Cord Blood Sampling Should Be First Choice for Infants Who Need Phlebotomy At, Shortly After delivery El Cordón Umbilical de Su Bebé: 5 Datos Sorprendentes para Madres y Padres News Releases Policy Collections Postnatal Cord Blood Sampling Your Baby's Umbilical Cord: 5 Surprising Facts for New & Expectant Parents Cord Blood Sampling Should Be First Choice for Infants Who Need Phlebotomy At, Shortly After delivery El Cordón Umbilical de Su Bebé: 5 Datos Sorprendentes para Madres y Padres News Releases Policy Collections AdvocacyThe State of Children in 2020Healthy ChildrenSecure FamiliesStrong CommunitiesA Leading Nation for YouthTransition Plan: Advancing Child Health in the Biden-Harris AdministrationHealth Care Access & CoverageImmigrant Child HealthGun Violence PreventionTobacco & E-CigarettesVaccinesChild NutritionAssault Weapons BansChildhood ImmunizationsE-Cigarette and Tobacco ProductsChildren’s Health Care Coverage Fact SheetsOpioid Fact SheetsAdvocacy Training ModulesSubspecialty Advocacy ReportAAP Washington Office Internship The State of Children in 2020 Healthy Children Secure Families Strong Communities A Leading Nation for Youth Transition Plan: Advancing Child Health in the Biden-Harris Administration Health Care Access & Coverage Immigrant Child Health Gun Violence Prevention Tobacco & E-Cigarettes Vaccines Child Nutrition Assault Weapons Bans Childhood Immunizations E-Cigarette and Tobacco Products Children’s Health Care Coverage Fact Sheets Opioid Fact Sheets Advocacy Training Modules Subspecialty Advocacy Report AAP Washington Office Internship The State of Children in 2020 Healthy Children Secure Families Strong Communities A Leading Nation for Youth Transition Plan: Advancing Child Health in the Biden-Harris Administration Health Care Access & Coverage Immigrant Child Health Gun Violence Prevention Tobacco & E-Cigarettes Vaccines Child Nutrition Assault Weapons Bans Childhood Immunizations E-Cigarette and Tobacco Products Children’s Health Care Coverage Fact Sheets Opioid Fact Sheets Advocacy Training Modules Subspecialty Advocacy Report AAP Washington Office Internship PediaLinkOnline CoursesLive and Virtual ActivitiesNational Conference and ExhibitionPrep®- Pediatric Review and Education ProgramsJournals and PublicationsNRPNRP LMS Login Online Courses Live and Virtual Activities National Conference and Exhibition Prep®- Pediatric Review and Education Programs Journals and Publications NRP NRP LMS Login Online Courses Live and Virtual Activities National Conference and Exhibition Prep®- Pediatric Review and Education Programs Journals and Publications NRP NRP LMS Login Patient Care Practice Management CommunityAAP CommitteesAAP CouncilsAAP SectionsVolunteer NetworkJoin a ChapterChapter WebsitesChapter Executive DirectorsDistrict Map AAP Committees AAP Councils AAP Sections Volunteer Network Join a Chapter Chapter Websites Chapter Executive Directors District Map AAP Committees AAP Councils AAP Sections Volunteer Network Join a Chapter Chapter Websites Chapter Executive Directors District Map Healthy Children shopAAP AAP HomeNewsMembershipCareer ResourcesResearchPhilanthropyAbout the AAP News Membership Career Resources Research Philanthropy About the AAP News Membership Career Resources Research Philanthropy About the AAP PolicyPostnatal Cord Blood SamplingYour Baby's Umbilical Cord: 5 Surprising Facts for New & Expectant ParentsCord Blood Sampling Should Be First Choice for Infants Who Need Phlebotomy At, Shortly After deliveryEl Cordón Umbilical de Su Bebé: 5 Datos Sorprendentes para Madres y PadresNews ReleasesPolicy Collections Postnatal Cord Blood Sampling Your Baby's Umbilical Cord: 5 Surprising Facts for New & Expectant Parents Cord Blood Sampling Should Be First Choice for Infants Who Need Phlebotomy At, Shortly After delivery El Cordón Umbilical de Su Bebé: 5 Datos Sorprendentes para Madres y Padres News Releases Policy Collections Postnatal Cord Blood Sampling Your Baby's Umbilical Cord: 5 Surprising Facts for New & Expectant Parents Cord Blood Sampling Should Be First Choice for Infants Who Need Phlebotomy At, Shortly After delivery El Cordón Umbilical de Su Bebé: 5 Datos Sorprendentes para Madres y Padres News Releases Policy Collections AdvocacyThe State of Children in 2020Healthy ChildrenSecure FamiliesStrong CommunitiesA Leading Nation for YouthTransition Plan: Advancing Child Health in the Biden-Harris AdministrationHealth Care Access & CoverageImmigrant Child HealthGun Violence PreventionTobacco & E-CigarettesVaccinesChild NutritionAssault Weapons BansChildhood ImmunizationsE-Cigarette and Tobacco ProductsChildren’s Health Care Coverage Fact SheetsOpioid Fact SheetsAdvocacy Training ModulesSubspecialty Advocacy ReportAAP Washington Office Internship The State of Children in 2020 Healthy Children Secure Families Strong Communities A Leading Nation for Youth Transition Plan: Advancing Child Health in the Biden-Harris Administration Health Care Access & Coverage Immigrant Child Health Gun Violence Prevention Tobacco & E-Cigarettes Vaccines Child Nutrition Assault Weapons Bans Childhood Immunizations E-Cigarette and Tobacco Products Children’s Health Care Coverage Fact Sheets Opioid Fact Sheets Advocacy Training Modules Subspecialty Advocacy Report AAP Washington Office Internship The State of Children in 2020 Healthy Children Secure Families Strong Communities A Leading Nation for Youth Transition Plan: Advancing Child Health in the Biden-Harris Administration Health Care Access & Coverage Immigrant Child Health Gun Violence Prevention Tobacco & E-Cigarettes Vaccines Child Nutrition Assault Weapons Bans Childhood Immunizations E-Cigarette and Tobacco Products Children’s Health Care Coverage Fact Sheets Opioid Fact Sheets Advocacy Training Modules Subspecialty Advocacy Report AAP Washington Office Internship PediaLinkOnline CoursesLive and Virtual ActivitiesNational Conference and ExhibitionPrep®- Pediatric Review and Education ProgramsJournals and PublicationsNRPNRP LMS Login Online Courses Live and Virtual Activities National Conference and Exhibition Prep®- Pediatric Review and Education Programs Journals and Publications NRP NRP LMS Login Online Courses Live and Virtual Activities National Conference and Exhibition Prep®- Pediatric Review and Education Programs Journals and Publications NRP NRP LMS Login Patient Care Practice Management CommunityAAP CommitteesAAP CouncilsAAP SectionsVolunteer NetworkJoin a ChapterChapter WebsitesChapter Executive DirectorsDistrict Map AAP Committees AAP Councils AAP Sections Volunteer Network Join a Chapter Chapter Websites Chapter Executive Directors District Map AAP Committees AAP Councils AAP Sections Volunteer Network Join a Chapter Chapter Websites Chapter Executive Directors District Map Healthy Children shopAAP shopAAP Shopping cartGo to CartCheckoutClear CartPrint Items in CartOrder SubtotalYour cart is empty.Looks like you haven't added anything to your cart.View Saved ItemsGo ShoppingLoading **Shopping cart** Order Subtotal Your cart is empty. Looks like you haven't added anything to your cart. Loading **Shopping cart** Order Subtotal Your cart is empty. Looks like you haven't added anything to your cart. Loading Create Account Login Publications shopAAP PediaLink HealthyChildren.org Shop By ProductShop By ProductBrowse AAP product collections by type and learning format.Shop By ProductBooksInstitutional LicensingJournalsLive & Virtual EducationNational Conference & ExhibitionParenting ResourcesPatient EducationPediaLink® & EQIPP CoursesPREP® Self AssessmentsSolutions & Toolkits Books Institutional Licensing Journals Live & Virtual Education National Conference & Exhibition Parenting Resources Patient Education PediaLink® & EQIPP Courses PREP® Self Assessments Solutions & Toolkits Books Institutional Licensing Journals Live & Virtual Education National Conference & Exhibition Parenting Resources Patient Education PediaLink® & EQIPP Courses PREP® Self Assessments Solutions & Toolkits Shop By TopicShop By TopicBrowse AAP product collections by pediatrics-focused topic.Shop By TopicBright FuturesCodingHospital MedicineInfectious Disease ResourcesMental HealthNeonatal-PerinatalNeonatal Resuscitation Program® (NRP®)NutritionPediatric CollectionsSchool Health and Child Care Bright Futures Coding Hospital Medicine Infectious Disease Resources Mental Health Neonatal-Perinatal Neonatal Resuscitation Program® (NRP®) Nutrition Pediatric Collections School Health and Child Care Bright Futures Coding Hospital Medicine Infectious Disease Resources Mental Health Neonatal-Perinatal Neonatal Resuscitation Program® (NRP®) Nutrition Pediatric Collections School Health and Child Care Browse All Products Special Offers MembershipMembershipThere’s a place for you in the Academy no matter where you are in your career. Learn more about all our membership categories.MembershipBe a Part of the AAPJoin the AAPJoin the AAP – Enterprise MembershipExclusive for MembersMembership FAQsAAP Membership DirectoryMember Advantage ProgramsRed Book Member BenefitMy MembershipJoin a CouncilJoin a SectionJoin a ChapterNational Election Center Join the AAP Join the AAP – Enterprise Membership Exclusive for Members Membership FAQs AAP Membership Directory Member Advantage Programs Red Book Member Benefit My Membership Join a Council Join a Section Join a Chapter National Election Center Join the AAP Join the AAP – Enterprise Membership Exclusive for Members Membership FAQs AAP Membership Directory Member Advantage Programs Red Book Member Benefit My Membership Join a Council Join a Section Join a Chapter National Election Center My AccountMy AccountLog in and access your online content, manage your learning activities, review your membership and your subscriptions, and much more.My AccountAccount HubAccess Your LibraryOrder HistoryEducation Activities & Credit ManagementMy MembershipProduct Activation CenterEdit Profile, Address and Contact InformationView & Renew Your SubscriptionsReturn & Report Missing Items Account Hub Access Your Library Order History Education Activities & Credit Management My Membership Product Activation Center Edit Profile, Address and Contact Information View & Renew Your Subscriptions Return & Report Missing Items Account Hub Access Your Library Order History Education Activities & Credit Management My Membership Product Activation Center Edit Profile, Address and Contact Information View & Renew Your Subscriptions Return & Report Missing Items HelpHelpInstructions to help you find answers to commonly-asked questions.Support CentershopAAP FAQSupport CenterMy Account FAQMembership FAQNeonatal Resuscitation Program (NRP) FAQ shopAAP FAQ Support Center My Account FAQ Membership FAQ Neonatal Resuscitation Program (NRP) FAQ shopAAP FAQ Support Center My Account FAQ Membership FAQ Neonatal Resuscitation Program (NRP) FAQ ContactContactReach out to Member and Customer Care when you need assistance.Contact UsMember and Customer Care866-843-2271 Toll Free US & Canada630-626-6000 Outside US & CanadaHours of Operation7:30AM-5:00PM CT Monday thru FridayVisit the AAP Support Center Member and Customer Care866-843-2271 Toll Free US & Canada630-626-6000 Outside US & Canada Hours of Operation7:30AM-5:00PM CT Monday thru Friday Visit the AAP Support Center Member and Customer Care866-843-2271 Toll Free US & Canada630-626-6000 Outside US & Canada Hours of Operation7:30AM-5:00PM CT Monday thru Friday Visit the AAP Support Center Shop By Product Shop By Topic Browse All Products Special Offers Membership My Account Help Contact **PREP Self-Assessments** **Save 25% on 2024 and 2023PREP Self-Assessmentsincluding PREP Subspecialties.** **Use promo codeREADYTOSAVE25at checkout.** Special offer does not apply to 2025 products, existing subscriptions or renewal invoices, or any online, virtual or live course. Cannot be combined with any other offer or promotion. All pricing and specifications are subject to change without notice. Offer good through June 30, 2025. **2025 PREP E-Med** Get immediate access to 72 questions based on relevant pediatric emergency medicine cases. Subscribe now. **2025 PREP E-Med** Get immediate access to 72 questions based on relevant pediatric emergency medicine cases. Subscribe now. **2025 PREP The Curriculum** Get this comprehensive review package for general pediatrics. Subscribe today! **2025 PREP The Curriculum** Get this comprehensive review package for general pediatrics. Subscribe today! **2025 PREP The Cram Virtual Course** An intensive review and preparation for the American Board of Pediatrics (ABP) primary general pediatrics board examination. Course content is guided by the ABP Specifications Outline. **2025 PREP The Cram Virtual Course** An intensive review and preparation for the American Board of Pediatrics (ABP) primary general pediatrics board examination. Course content is guided by the ABP Specifications Outline. **PREP The Curriculum** ONLINE AND PRINT MOC ONLINE ONLY MOC ONLINE AND PRINT MOC ONLINE ONLY MOC ONLINE AND PRINT MOC ONLINE ONLY MOC **PREP Self-Assessments** ONLINE AND PRINT MOC ONLINE ONLY MOC ONLINE AND PRINT MOC ONLINE ONLY MOC ONLINE AND PRINT MOC ONLINE ONLY MOC **Browse the 2025 PREP Catalog** Find the PREP Self-Assessment that meets your continuing education needs. **Browse the 2025 PREP Catalog** Find the PREP Self-Assessment that meets your continuing education needs. **PREP Group Rates Available** Save by subscribing with your colleagues. Ask about discounted rates. **PREP Group Rates Available** Save by subscribing with your colleagues. Ask about discounted rates. **PREP Member Benefit for Fellowship Trainees** Learn about this complimentary PREP Subspecialties subscription program. **PREP Member Benefit for Fellowship Trainees** Learn about this complimentary PREP Subspecialties subscription program. **PREP Adolescent Medicine** ONLINE ONLY MOC ONLINE ONLY MOC ONLINE ONLY MOC **PREP Cardiology** ONLINE ONLY MOC ONLINE ONLY MOC ONLINE ONLY MOC **PREP DBPeds** ONLINE ONLY MOC ONLINE ONLY MOC ONLINE ONLY MOC **PREP E-Med** ONLINE ONLY MOC ONLINE ONLY MOC ONLINE ONLY MOC **PREP Endocrinology** ONLINE ONLY MOC ONLINE ONLY MOC ONLINE ONLY MOC **PREP GI** ONLINE ONLY MOC ONLINE ONLY MOC ONLINE ONLY MOC **PREP Hematology-Oncology** ONLINE ONLY MOC ONLINE ONLY MOC ONLINE ONLY MOC **PREP Hospital Medicine** ONLINE ONLY MOC ONLINE ONLY MOC ONLINE ONLY MOC **PREP ICU** ONLINE ONLY MOC ONLINE ONLY MOC ONLINE ONLY MOC **PREP Infectious Diseases** ONLINE ONLY MOC ONLINE ONLY MOC ONLINE ONLY MOC **PREP Nephrology** ONLINE ONLY MOC ONLINE ONLY MOC ONLINE ONLY MOC **NeoReviewsPlus** ONLINE ONLY MOC ONLINE ONLY MOC ONLINE ONLY MOC **PREP Pulmonology** ONLINE ONLY MOC ONLINE ONLY MOC ONLINE ONLY MOC **PREP Rheumatology** ONLINE ONLY MOC ONLINE ONLY MOC ONLINE ONLY MOC **PREP On-Demand Self-Assessments** ONLINE COURSE MOC Available: 05/30/2025-05/29/2028 ONLINE COURSE MOC Available: 04/25/2025-04/24/2028 ONLINE COURSE Available: 04/10/2025-04/09/2028 ONLINE COURSE MOC Available: 05/01/2024-04/30/2027 ONLINE COURSE MOC Available: 09/10/2024-09/09/2027 AAP Home Policy Advocacy PediaLink Practice Management Patient Care Community Healthy Children shopAAP Privacy Statement Terms of Use Auto-Renew Terms Support Center Contact Us Code of Conduct © Copyright 2025 American Academy of Pediatrics. All rights reserved."}