{"id": 784, "name": "KSHB - Kansas City News", "domain": "kshb.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kshb.com/news/local-news/dont-be-afraid-to-just-follow-your-dreams-blue-springs-girl-sells-lemonade-to-fund-space-camp-dream-sets-sights-on-becoming-first-woman-on-mars", "title": "Dont Be Afraid To Just Follow Your Dreams Blue Springs Girl Sells Lemonade To Fund Space Camp Dream Sets Sights On Becoming First Woman On Mars", "content": "Menu Home Weather10 Day ForecastHourly ForecastWeather CamsWeather RadarStorm TrackerWeather AlertsSchool Closings and DelaysWeather BlogSchool Day at the K 10 Day Forecast Hourly Forecast Weather Cams Weather Radar Storm Tracker Weather Alerts School Closings and Delays Weather Blog School Day at the K 10 Day Forecast Hourly Forecast Weather Cams Weather Radar Storm Tracker Weather Alerts School Closings and Delays Weather Blog School Day at the K KSHB TrafficGas Prices Gas Prices Gas Prices NewsLocal NewsVideoStateHomicide TrackerPanasonic in De SotoNationalWorld NewsKansas City Public SafetyPoliticalInvestigatorsYour Health MattersEducation Local News Video State Homicide Tracker Panasonic in De Soto National World News Kansas City Public Safety Political Investigators Your Health Matters Education Local News Video State Homicide Tracker Panasonic in De Soto National World News Kansas City Public Safety Political Investigators Your Health Matters Education I-Team Going 360 Featured Coverage9:29Joplin - 10 Years LaterBlack History MonthHispanic Heritage MonthWomen's History Month 2025Safe KCThe Rebound KCWe're HiringWe're Open KCWe See You KC 9:29 Joplin - 10 Years Later Black History Month Hispanic Heritage Month Women's History Month 2025 Safe KC The Rebound KC We're Hiring We're Open KC We See You KC 9:29 Joplin - 10 Years Later Black History Month Hispanic Heritage Month Women's History Month 2025 Safe KC The Rebound KC We're Hiring We're Open KC We See You KC One Tank Trips Faith in KC MoneyShopSmartBusinessDon't Waste Your MoneyFinancial Fitness ShopSmart Business Don't Waste Your Money Financial Fitness ShopSmart Business Don't Waste Your Money Financial Fitness SportsChiefsRoyalsSporting KCKC CurrentKC MavericksCollege SportsKansas Jayhawks SportsHigh School Chiefs Royals Sporting KC KC Current KC Mavericks College Sports Kansas Jayhawks Sports High School Chiefs Royals Sporting KC KC Current KC Mavericks College Sports Kansas Jayhawks Sports High School EntertainmentCelebrityMoviesTV ListingsBounce TV Celebrity Movies TV Listings Bounce TV Celebrity Movies TV Listings Bounce TV LifestyleHolidaysFoodPetsTaste & See KCOutdoorsCommunity CalendarMove for Good KC Holidays Food Pets Taste & See KC Outdoors Community Calendar Move for Good KC Holidays Food Pets Taste & See KC Outdoors Community Calendar Move for Good KC VideoWatch KSHB 41 News LiveNews VideoYouTube Channel Watch KSHB 41 News Live News Video YouTube Channel Watch KSHB 41 News Live News Video YouTube Channel About UsContact UsMobile and video appsContestsMeet the TeamJobs at KSHBJournalism Career ProgramAdvertise with UsSupportFacebookInstagramTwitterYouTubeFill the Fridge Contact Us Mobile and video apps Contests Meet the Team Jobs at KSHB Journalism Career Program Advertise with Us Support Facebook Instagram Twitter YouTube Fill the Fridge Contact Us Mobile and video apps Contests Meet the Team Jobs at KSHB Journalism Career Program Advertise with Us Support Facebook Instagram Twitter YouTube Fill the Fridge Advertise with KSHB/KMCI MarketplaceGuide to Summer FunIn Your NeighborhoodBetter Business Bureau PartnersKC Home Improvement SpecialistsBrand Spotlight Guide to Summer Fun In Your Neighborhood Better Business Bureau Partners KC Home Improvement Specialists Brand Spotlight Guide to Summer Fun In Your Neighborhood Better Business Bureau Partners KC Home Improvement Specialists Brand Spotlight TV Listings Senior Spotlight Podcasts 38 The Spot KC Spotlight Community for Everyone Sign In Newsletters Sign Out Manage Emails Apps Careers Search Weather Local News Chiefs Royals Sports Voice for Everyone Panasonic in De Soto I-Team Links TV Listings Contests **Actions** Facebook Tweet Email **'Don't be afraid to just follow your dreams': Blue Springs girl sells lemonade to fund space camp dream** KSHB 41 reporter Claire Bradshaw covers eastern Jackson County, including Blue Springs and Independence.Share your story idea with Claire. — An 11-year-old Blue Springs girl is turning lemons into rocket fuel as she prepares for the adventure of a lifetime at NASA's Space Camp. Ezri Henry has spent the past year running a lemonade stand on Gingerbread Lane, raising money to attendspace camp at the U.S. Space & Rocket Centerin Huntsville, Alabama. \"We found an astronaut on Instagram,” Ezri said. “My mom commented that I want to be an astronaut when I grow up, and she said to start at space camp.” The young entrepreneur has already sold $1,800 worth of lemonade, even switching to hot chocolate during the winter months to keep her business going. \"I've always really liked the stars,\" Ezri said. “I’ve always wanted to know if aliens are real, so I just wanna know.” Her family and her mother, Cidne Henry, have supported the venture while teaching valuable life lessons along the way — from building the lemonade stand from the ground up to learning about the cost to run a business. \"I like to give my kids a business mindset of ... we earn what we get, and I feel like if she earns it, that she's gonna take it more seriously,\" Cidne said. The space camp experience will give Ezri the opportunity to train like an astronaut, experience zero gravity, participate in space simulations and more. \"I think that my goal as a mother for her, with this whole experience, would not be to teach her that she has to be an astronaut, but to show her that if she wanted to be, she could,\" Cidne said. With just 13 days until departure, Ezri has already reached her financial goal. Any additional funds she raises will go toward souvenirs and a space suit. The community response has been overwhelming, according to her mother. \"We had more people come to visit her than I could even imagine,\" Cidne said. As for Ezri's ultimate ambition? \"I just have a life goal to be the first woman on Mars,\" she said. Cidne said to keep an eye out for updates on the Blue Springs Community Facebook page, where the Henrys will post if Ezri has her stand set up on the corner of SE Picadilly Street and SE Gingerbread Lane. — Report a typo **Sign up for theBreaking News Newsletterand receive up to date information.** **now signed up to receive theBreaking News Newsletter.** **Let's Talk!** **Let's Talk!** Weather KSHB Traffic News Money Sports Entertainment Life Video Apps Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers 1.0 Host Exhibit KSHB FCC Public Files KMCI FCC Public Files FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact kshb41 kshb41 kshb41"}