{"id": 530, "name": "Frontiers in Computer Science", "domain": "frontiersin.org/journals/computer-science", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/computer-science/articles/10.3389/fcomp.2025.1520930/full", "title": "Computer Science", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Computer Graphics and Visualization Computer Security Computer Vision Digital Education Human-Media Interaction Mobile and Ubiquitous Computing Networks and Communications Software Theoretical Computer Science Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Computer Graphics and Visualization Computer Security Computer Vision Digital Education Human-Media Interaction Mobile and Ubiquitous Computing Networks and Communications Software Theoretical Computer Science Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Computer Graphics and Visualization Computer Security Computer Vision Digital Education Human-Media Interaction Mobile and Ubiquitous Computing Networks and Communications Software Theoretical Computer Science Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office PERSPECTIVE article Front. Comput. Sci. Sec. Human-Media Interaction Volume 7 - 2025 |doi: 10.3389/fcomp.2025.1520930 **How Math Shapes the World of Life Science Animation** 1Laboratory of Cellular Communication, Oswaldo Cruz Foundation (Fiocruz), Rio de Janeiro, Brazil 2Laboratory for Innovation in Therapies, Education and Bioproducts, Oswaldo Cruz Foundation, Rio de Janeiro, Rio de Janeiro, Brazil 3Faculty of Technological Education of the State of rio de Janeiro (FAETERJ), Rio de Janeiro, Brazil 4Oswaldo Cruz Foundation (Fiocruz), Rio de Janeiro, Brazil 5veiga de almeida university, Rio de Janeiro, Brazil 6Laboratory on Thymus Research, Oswaldo Cruz Institute, Oswaldo Cruz Foundation, Rio de Janeiro, Rio de Janeiro, Brazil 7Laboratory of Cellular Communication, Oswaldo Cruz Institute, Oswaldo Cruz Foundation (Fiocruz), Rio de Janeiro, Paraná, Brazil The final, formatted version of the article will be published soon. Select one of your emails You have multiple emails registered with Frontiers: Notify me on publication Please enter your email address: If you already have an account, pleaselogin You don't have a Frontiers account ? You canregister here With the advances in technology, it is noticeable the educational potential of animation in the field of cell biology, physiology and other basic life science disciplines, revolutionizing the learning process in science. This paper elucidates the role of matrix manipulation in animating figures on screens, elucidates the distinctions between Scalable Vector Graphics (SVG), bitmap and raster images, and unveils the inner workings of the Bresenham algorithm in the context of rendering lines on screens. Furthermore, the article offers a practical dimension to this theoretical understanding by providing a comprehensive example of code written in JavaScript for generating an animation, also using HTML and CSS. This code example is designed to be easy to comprehend, even to those with limited programming experience, fostering the integration of animations into life science education. We synthesized findings from various studies to underscore the proven advantages of this new teaching tool, and by reviewing them, we reaffirm that animations have a demonstrable impact on improving the learning experience, making complex physiological processes more comprehensible and engaging. This highlights the critical role of animations as a pedagogical tool in science classrooms, and emphasizes the importance of understanding the mathematical and computational principles that support their creation. By bridging this knowledge gap, educators and students can make more effective and informed use of existing animation tools. Keywords:animation, Biology, math, Secondary and undergraduate, programming Received:31 Oct 2024;Accepted:10 Jun 2025. Copyright:© 2025Oliveira, Araujo Dias, Santos, Cotta-de-Almeida, Coelho Neto and Alves. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) or licensor are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. * Correspondence:Luiz Anastácio Alves, Laboratory of Cellular Communication, Oswaldo Cruz Institute, Oswaldo Cruz Foundation (Fiocruz), Rio de Janeiro, 21040-900, Paraná, Brazil Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Share on Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}