{"id": 1971, "name": "Fox Business", "domain": "foxbusiness.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.foxbusiness.com/lifestyle/mayor-quits-after-facing-harassment-threats-texts-show-her-calling-buc-ees-project-opponents-terrorists", "title": "Mayor Quits After Facing Harassment Threats Texts Show Her Calling Buc Ees Project Opponents Terrorists", "content": "Personal FinanceMortgagesStudent LoansCredit CardsPersonal LoansSavingsInsurance401kRetirementTax Planning Mortgages Student Loans Credit Cards Personal Loans Savings Insurance 401k Retirement Tax Planning Mortgages Student Loans Credit Cards Personal Loans Savings Insurance 401k Retirement Tax Planning EconomyGovernment SpendingMoney & PolicySmall Business Government Spending Money & Policy Small Business Government Spending Money & Policy Small Business MarketsStocksUS MarketsCryptocurrencyFutures & CommoditiesBondsETFsBusiness LeadersIndustriesRetailPre-MarketsMutual Funds Stocks US Markets Cryptocurrency Futures & Commodities Bonds ETFs Business Leaders Industries Retail Pre-Markets Mutual Funds Stocks US Markets Cryptocurrency Futures & Commodities Bonds ETFs Business Leaders Industries Retail Pre-Markets Mutual Funds Watchlist LifestyleEntertainmentRich & FamousTravelCarsAirplanesFood & DrinksArts Entertainment Rich & Famous Travel Cars Airplanes Food & Drinks Arts Entertainment Rich & Famous Travel Cars Airplanes Food & Drinks Arts Real EstatePersonal Real EstateCommercial Real EstateLuxury Properties Personal Real Estate Commercial Real Estate Luxury Properties Personal Real Estate Commercial Real Estate Luxury Properties TechDigitalSocial MediaGadgetsBusiness TechHealthcare TechFuture TechAISpace Digital Social Media Gadgets Business Tech Healthcare Tech Future Tech AI Space Digital Social Media Gadgets Business Tech Healthcare Tech Future Tech AI Space Video Podcasts More NFL NBA MLB NASCAR Boxing Soccer Golf Tennis Fox Business Shows Programming Schedule On Air Personalities Full Episodes Show Clips News Clips Channel Finder Jobs Terms of Use Updated Privacy Policy FAQ Media Relations Corporate Information Closed Captioning Policy Accessibility Statement Fox News Fox Nation Fox Business Go Apps & Products Facebook Twitter Instagram YouTube Flipboard LinkedIn RSS Newsletter Spotify iHeartRadio Updated Terms of Use New Privacy Policy Your Privacy Choices Help Closed Captioning Policy Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided byFactset. Powered and implemented byFactSet Digital Solutions.Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX News Network, LLC. All rights reserved.FAQ-New Privacy Policy **Recommended Videos** Fox Business Briefs 6/10 Disneyland 70th anniversary offers new entertainment options Florida Panthers CEO on going from ice cold to red hot: We've become 'a pillar in the community' Nintendo Switch 2 hits store shelves Tomi Lahren urges young people to 'come back to reality' amid American dream skepticism The Sphere at the Las Vegas Venetian has been an 'absolute game changer,' CEO says Omaha Steaks CEO makes major prediction for the beef industry Fox Business Briefs 6/2 Transportation secretary urges travelers to be ‘patient’ amid air travel delays and cancellations Trump is fixing Biden's housing crisis by turning around Fannie Mae, Freddie Mac: Bill Pulte Gen Z turns to adulting classes to learn basic life skills Ingredion CEO details how 'MAHA' agenda is helping improve food texture, catering to consumers Disney debuts 2 new family-friendly shows Passenger attempts to open plane door mid-flight while experiencing in medical crisis Celebrity chef believes government should 'completely get out of our diets altogether' Supersonic flight ban is one of the 'stupidest regulations ever,' CEO says Chaos at Newark airport is a 'proxy for what's going on everywhere around the world': Real SLX founder Universal Epic Universe sous chef discusses creating Isle of Berk menu Universal Epic Universe takes attractions to a whole new level Freedom Farms is in the 'golden age' of American agriculture, owner says **Mayor quits after facing harassment, threats as texts show her calling Buc-ee's project opponents 'terrorists'** **Glant Havenar says she resigned to prevent further community conflict after facing 10 months of harassment** Facebook Twitter Comments Print Email **FOX Business Flash top headlines for June 6** Check out what's clicking on FoxBusiness.com. The former mayor ofPalmer Lake, Colorado,called people who were against land annexation for a Buc-ee’s store and other measures \"terrorists\" and \"losers,\" according to local media reports and text messages included in a lawsuit. Glant Havenar, who resigned from serving as the town’s mayor mid-week, used the insults when talking about people opposed to the project in text exchanges with a friend,9News reportedThursday, citing court documents. Integrity Matters and other entities included the messages in a recent court filing for a lawsuit against the town in connection to the Buc-ee’s, according to the outlet andKRDO13. Before that, they had been shared in a Signal group chat by Havenar’s former friend. The Texas-based convenience store and gas stop, Buc-ee's has become the world's largest convenience store with over 100 gas pumps and a 75,000 square feet store in Luling, Texas.(Brandon Bell / Getty Images) GET FOX BUSINESS ON THE GO BY CLICKING HERE The filingcontaining the messages alleged that Havenar tried to sway public opinion by setting up social media accounts under different names to engage with people online, according to 9News. She is also facing accusations from Integrity Matters that she violated regulations about open meetings and talked about executive sessions inappropriately, with the non-profit pointing to messages as purported evidence of that, the outlet reported. An entrance to the Buc-ee's convenience store.(Getty Images) Contentions about the Buc-ee’s have been brewing in the area for quite some time. Aneffort to recalla few members of the town’s board of trustees was launched earlier in the year related to how a meeting late last year about the Buc-ee’s annexation was handled, according to local reports. Havenar told KRDO13 that harassment she has been experiencing from others in connection to the Buc-ee’s annexation played a major role in her decision to resign. WILDLY POPULAR GAS STATION BUC-EE'S TO OPEN FIRST-EVER LOCATIONS IN NEW STATES THIS SUMMER She also wanted to stave off additional conflict in the community that could arise if opponents pursued a recall of her as mayor, according to the outlet. \"I didn’t want petitioners outside all summer long trying to get signatures for me with their posters and their banners and their signs disruptingthe peaceof Palmer Lake,\" Havenar said. Contentions about the Buc-ee’s project in the Colorado town have been brewing for quite some time.(Andrew Wevers / Getty Images) Asked about the text messages, she said she had been \"harassed for 10 months\" and said \"there’s not anybody on this planet that’s not going to say unkind things about people that are harassing them,\" according to the outlet. She said that releasing private text messages \"was not the right thing to do\" and that \"not all of them were true.\" FOX Business reached out to Town Administrator Dawn Collins and the Palmer Lake town office. CLICK HERE TO READ MORE ON FOX BUSINESS The site where the Buc-ee’s could potentially go in the area is located near Interstate 25, according to 9News. Buc-ee’s had over 50 locations across the country as of late May. **U.S. Stock Market Quotes** Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Mortgages Student Loans Credit Cards Personal Loans Savings Insurance 401k Retirement Tax Planning Government Spending Money & Policy Small Business Stocks US Markets Cryptocurrency Futures & Commodities Bonds ETFs Business Leaders Industries Retail Pre-Markets Mutual Funds Entertainment Rich & Famous Travel Cars Airplanes Food & Drinks Arts Personal Commercial Luxury Properties Digital Social Media Gadgets Business Tech Healthcare Tech Future Tech AI Space NFL NBA MLB NASCAR Boxing Soccer Golf Tennis Channel Finder Jobs Terms of Use Updated Privacy Policy FAQ Media Relations Corporate Information Closed Captioning Policy Accessibility Statement Fox News Fox Nation Fox Business Go Apps & Products Facebook Twitter Instagram YouTube Flipboard LinkedIn RSS Newsletter Spotify iHeartRadio Updated Terms of Use New Privacy Policy Your Privacy Choices Help Closed Captioning Policy Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided byFactset. Powered and implemented byFactSet Digital Solutions.Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX News Network, LLC. All rights reserved.FAQ-New Privacy Policy"}