{"id": 1253, "name": "Shelby County Reporter", "domain": "shelbycountyreporter.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.shelbycountyreporter.com/2025/06/10/korey-cunningham-memorial-football-camp-reunites-late-montevallo-legends-teammates-to-teach-next-generation/", "title": "Korey Cunningham Memorial Football Camp Reunites Late Montevallo Legends Teammates To Teach Next Generation", "content": "Home NewsSchoolsAlabaster ReporterCaleraChelseaColumbianaColumbiana FacebookHarpersvilleHelenaHelena MagazineHomewood Life MagazineHooverIndian SpringsLeeds Living MagazineMontevalloMoody Living MagazineMountain Brook MagazineNorth ShelbyPelham ReporterShelby Living MagazineTrussville Living MagazineVestavia Hills MagazineVincentWestoverWilsonvilleWilton Schools Alabaster Reporter Calera Chelsea Columbiana Columbiana Facebook Harpersville Helena Helena Magazine Homewood Life Magazine Hoover Indian Springs Leeds Living Magazine Montevallo Moody Living Magazine Mountain Brook Magazine North Shelby Pelham Reporter Shelby Living Magazine Trussville Living Magazine Vestavia Hills Magazine Vincent Westover Wilsonville Wilton Schools Alabaster Reporter Calera Chelsea Columbiana Columbiana Facebook Harpersville Helena Helena Magazine Homewood Life Magazine Hoover Indian Springs Leeds Living Magazine Montevallo Moody Living Magazine Mountain Brook Magazine North Shelby Pelham Reporter Shelby Living Magazine Trussville Living Magazine Vestavia Hills Magazine Vincent Westover Wilsonville Wilton Sports Opinion ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary Health Calendar Records Classifieds ServicesAbout UsPoliciesBirth AnnouncementBirthday AnnouncementEngagement AnnouncementWedding AnnouncementAnniversary AnnouncementSubmit a Letter to the EditorSubmit a News TipSubmit a PhotoSubmit a Classified Advertisement About Us Policies Birth Announcement Birthday Announcement Engagement Announcement Wedding Announcement Anniversary Announcement Submit a Letter to the Editor Submit a News Tip Submit a Photo Submit a Classified Advertisement About Us Policies Birth Announcement Birthday Announcement Engagement Announcement Wedding Announcement Anniversary Announcement Submit a Letter to the Editor Submit a News Tip Submit a Photo Submit a Classified Advertisement Photos Public Notices E-Edition **Korey Cunningham Memorial Football Camp reunites late Montevallo legend’s teammates to teach next generation** Published 3:24 pm Tuesday, June 10, 2025 ByAndrew Simonson Korey Cunningham’s family and former teammates gathered to teach the next generation and celebrate his legacy at the first Korey Cunningham Memorial Football Camp since his passing. (Reporter Photos/Andrew Simonson) By ANDREW SIMONSON | Sports Editor MONTEVALLO –For longtime Montevallo residents, Saturday, June 7 brought all the sights and sounds of one of the city’s routine summer events: the sound of whistles from former college and pro players cutting through the air, the sight of kids launching themselves at tackling dummies and catching junior-sized footballs after running a route. It had all the signs of another successful Korey Cunningham Football Camp at Theron Fisher Stadium. Only one thing was missing. Cunningham himself. The 2025 edition of the camp was the first since Cunningham’s tragic death in May 2024. While the former All-County star and NFL offensive lineman was not teaching skills to his hometown like in years past, his friends and family banded together to keep his legacy alive through one of his favorite traditions. “Today is very special because this is something our son Korey would have loved to carry on himself, and we just want to carry on his legacy,” Cunningham’s mother Kathy Cunningham said. “We just feel like he’s there smiling down on us today, and just to see all these kids and parents come out and be so supportive, this just means the world to us.” During the three-hour event, kids from ages 5-18 rotated between a series of stations where they learned skills like tackling, catching, route-running and more. Cunningham’s former college teammates at Cincinnati led the stations, bringing their experience from the college and pro levels to the kids in Montevallo while Cunningham’s family and Montevallo head football coach Garrett Langer facilitated the camp. Many of Cunningham’s former teammates flew in from out-of-state and reunited for the first time in years just to run the one-night camp in a small town in Alabama, including Deyshawn Bond, a former offensive lineman with the University of Cincinnati and Indianapolis Colts. “It’s a blessing,” Bond said. “All grace to God. He’s given us the heart, given his family the strength to continue his legacy through this camp. So we just are thankful, and bringing all the guys here is like a reunion for the offensive linemen, so it’s awesome to do that for him.” For another one of his Cincinnati teammates, Garrett Campbell, it was an incredible moment to see his football family once again. He said that Cunningham always had a way of bringing people together, and that spirit continued even in his absence. “It’s surreal,” Campbell said. “Some of these guys I haven’t seen for a really long time. And, even though Korey’s not here, he still has the ability to kind of bring us together, and that’s kind of how he always was. He was the glue guy. He was the lover. He was the best friend. And I think that shows out in a lot of us, and all of us making it down here and how many of us made it down here, I think it’s a true embodiment of who he was as a person.” To Bond, Cunningham was a man of deep faith who loved and supported others as a reflection of his love for God. He is honored to have been impacted by Cunningham during his lifetime and feels blessed to pay that forward to others. “Amazing man. A God-fearing man,” Bond said of Cunningham. “Definitely brought me back to faith. Just with everything he did, he always praised God. And we’re thankful for that here on earth because this gives us something to live forward for and gives us hope that God is really blessing us to be able to continue his legacy.” Much of the process of getting the players on board was through Kathy, who reached out to her son’s agent and his former teammates. Some of his teammates who are still in the NFL couldn’t make it due to mandatory minicamp and offseason team activities (OTAs), but many of his Cincinnati teammates were more than willing to come down. “Everybody’s just been wonderful,” Kathy said. “I call them up, text them, and they’re like, ‘Oh, yeah, tell us when, where, we’ll clear our schedule and we’ll be there.’ And they have shown up.” Them showing up makes Kathy feel grateful for their love and support even after Cunningham’s death. She believes that them making the time and effort to come to Montevallo shows that they truly loved her son. “It shows that when they said that they loved him, they loved him,” Kathy said. “Love is what it does, and they have shown that today through their actions, through their words, through their continued support.” Campbell said it was an easy decision to come down to Montevallo to continue to support the Cunningham family the same way they have supported him for years. He feels a deep bond with the Cunninghams that his other teammates echoed as well. “Extremely important,” Campbell said of coming for the camp. “We are second family to his family. That’s my second mom, second sister, second dad, second brother, etc., and I know a lot of the guys around here feel the same way, and we stay in contact with Korey’s family. So, it means a lot to them, I know, but it also means a lot to us for them to invite us down here. It’s a privilege to be down here, it really is, and to have known Korey.” While players like Campbell and Bond aren’t from Montevallo, they can see a lot of Cunningham’s characteristics in its residents. Now, they are entrusted to teach the game of football in hopes of helping more Montevallo residents achieve the same success Cunningham did in his collegiate career at Cincinnati and five-season NFL career with the Cardinals, Patriots and Giants. “It explains a lot of Korey,” Campbell said. “We come from a lot of different places and a lot of different backgrounds and being here kind of helps us understand Korey a little better, even though he’s not here. And being able to give back in his stead, we know that he’s just looking down, smiling, seeing us do it in purpose of him because I know he would be here and this is kind of something that he really cherished doing, and so to be able to continue that for him means a great deal to us.” Bond agreed with Campbell and said he felt blessed to have the chance to teach football to kids in the area. “It feels good,” Bond said. “You never know where you’re going to end up and helping kids learn football. So here in Montevallo, Alabama, who knew we would be here to help these kids? And by the grace of God, we’re here through Korey and through God as our strength. So, this is a blessing.” Cunningham was the first player from Montevallo to make it to the NFL but remains the lone resident to make it to the big stage. The hope is that camps like this can inspire more residents to follow his example and achieve great things. However, Kathy hopes her son’s legacy is more than his on-field achievements. She hopes the campers see the heart that made him beloved throughout the town as “Big Country,” a man who truly loved Montevallo and wanted to see it improve. “Because I think the younger guys, they see that putting it in hard work, and that you can be remembered for that and having a big heart that you can be remembered and some people would just like to carry that on,” Kathy said about the importance of the camp. At the end of the day, that’s why the kids are still working and the coaches are still teaching at the Korey Cunningham Memorial Football Camp–to be the earthly hands and feet of Cunningham’s continued influence and impact. “I just feel like our son has a life that goes beyond him leaving us and that it still shows that his love for his community and his friends and family carries on,” Kathy said. **Lord Wedgwood Charity donates lifesaving Automated External Defibrillators to American Village** **Montevallo City Council approves new sign for fire station** **Swinging for the fences: 2025 All-County Team spotlights softball’s stars** **Montevallo continues growing soccer at second-annual youth camp** PollsWhat would make you consider a digital subscription to Shelby County Reporter?Low subscription costUnlimited content accessExclusive news/event informationView ResultsLoading ... **Polls** What would make you consider a digital subscription to Shelby County Reporter? Low subscription cost Unlimited content access Exclusive news/event information View Results **Polls** What would make you consider a digital subscription to Shelby County Reporter? Low subscription cost Unlimited content access Exclusive news/event information View Results Home News Sports Opinion Lifestyles Obituaries Business Faith Health Special Sections Calendar Small Business About Us Subscriptions Policies Submit a News Tip Submit a Photo Birth Announcement Birthday Announcement Engagement Announcement Wedding Announcement Anniversary Announcement Submit a Classified Advertisement Sign up for Newsletter Classifieds Photo Gallery © 2025, Shelby County Reporter"}