{"id": 996, "name": "Newsguard", "domain": "newsguardtech.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.newsguardtech.com/special-reports/german-elections-misinformation-tracking-center", "title": "German Elections Misinformation Tracking Center", "content": "SolutionsNews Reliability RatingsMisinformation FingerprintsAI Safety SuiteFAILSafe for AINewsGuard for AdvertisingRisk BriefingsTV/CTV Reliability RatingsPodcast Reliability RatingsMedia Intelligence DashboardHealthGuard News Reliability Ratings Misinformation Fingerprints AI Safety Suite FAILSafe for AI NewsGuard for Advertising Risk Briefings TV/CTV Reliability Ratings Podcast Reliability Ratings Media Intelligence Dashboard HealthGuard News Reliability Ratings Misinformation Fingerprints AI Safety Suite FAILSafe for AI NewsGuard for Advertising Risk Briefings TV/CTV Reliability Ratings Podcast Reliability Ratings Media Intelligence Dashboard HealthGuard IndustriesAll IndustriesArtificial IntelligenceDigital PlatformsAdvertising IndustryReputation ManagementSecurity and DefenseNews AggregatorsResearchersMedia Literacy All Industries Artificial Intelligence Digital Platforms Advertising Industry Reputation Management Security and Defense News Aggregators Researchers Media Literacy All Industries Artificial Intelligence Digital Platforms Advertising Industry Reputation Management Security and Defense News Aggregators Researchers Media Literacy ReportsReality Check NewsletterSpecial ReportsGerman Elections Misinformation TrackerAI Misinformation MonitorIsrael-Hamas Misinformation TrackerRussia-Ukraine Disinformation TrackerAI Tracking CenterInsights Reality Check Newsletter Special Reports German Elections Misinformation Tracker AI Misinformation Monitor Israel-Hamas Misinformation Tracker Russia-Ukraine Disinformation Tracker AI Tracking Center Insights Reality Check Newsletter Special Reports German Elections Misinformation Tracker AI Misinformation Monitor Israel-Hamas Misinformation Tracker Russia-Ukraine Disinformation Tracker AI Tracking Center Insights ProcessWebsite Rating Process and CriteriaMisinformation Fingerprints ProcessTV Rating Process and CriteriaPodcast Rating Process and CriteriaCorrections PolicyWhy Should You Trust Us?See Feedback from PublishersNewsGuard FAQ Website Rating Process and Criteria Misinformation Fingerprints Process TV Rating Process and Criteria Podcast Rating Process and Criteria Corrections Policy Why Should You Trust Us? See Feedback from Publishers NewsGuard FAQ Website Rating Process and Criteria Misinformation Fingerprints Process TV Rating Process and Criteria Podcast Rating Process and Criteria Corrections Policy Why Should You Trust Us? See Feedback from Publishers NewsGuard FAQ PressAll PressPress ReleasesNewsGuard in the Media All Press Press Releases NewsGuard in the Media All Press Press Releases NewsGuard in the Media AboutAbout NewsGuardOur StoryOur TeamOur Board of DirectorsOur InvestorsCareersContact About NewsGuard Our Story Our Team Our Board of Directors Our Investors Careers Contact About NewsGuard Our Story Our Team Our Board of Directors Our Investors Careers Contact EnglishEnglishDeutschFrançaisItaliano English Deutsch Français Italiano English Deutsch Français Italiano SolutionsNews Reliability RatingsMisinformation FingerprintsAI Safety SuiteFAILSafe for AINewsGuard for AdvertisingRisk BriefingsTV/CTV Reliability RatingsPodcast Reliability RatingsMedia Intelligence DashboardHealthGuard News Reliability Ratings Misinformation Fingerprints AI Safety Suite FAILSafe for AI NewsGuard for Advertising Risk Briefings TV/CTV Reliability Ratings Podcast Reliability Ratings Media Intelligence Dashboard HealthGuard News Reliability Ratings Misinformation Fingerprints AI Safety Suite FAILSafe for AI NewsGuard for Advertising Risk Briefings TV/CTV Reliability Ratings Podcast Reliability Ratings Media Intelligence Dashboard HealthGuard IndustriesAll IndustriesArtificial IntelligenceDigital PlatformsAdvertising IndustryReputation ManagementSecurity and DefenseNews AggregatorsResearchersMedia Literacy All Industries Artificial Intelligence Digital Platforms Advertising Industry Reputation Management Security and Defense News Aggregators Researchers Media Literacy All Industries Artificial Intelligence Digital Platforms Advertising Industry Reputation Management Security and Defense News Aggregators Researchers Media Literacy ReportsReality Check NewsletterSpecial ReportsGerman Elections Misinformation TrackerAI Misinformation MonitorIsrael-Hamas Misinformation TrackerRussia-Ukraine Disinformation TrackerAI Tracking CenterInsights Reality Check Newsletter Special Reports German Elections Misinformation Tracker AI Misinformation Monitor Israel-Hamas Misinformation Tracker Russia-Ukraine Disinformation Tracker AI Tracking Center Insights Reality Check Newsletter Special Reports German Elections Misinformation Tracker AI Misinformation Monitor Israel-Hamas Misinformation Tracker Russia-Ukraine Disinformation Tracker AI Tracking Center Insights ProcessWebsite Rating Process and CriteriaMisinformation Fingerprints ProcessTV Rating Process and CriteriaPodcast Rating Process and CriteriaCorrections PolicyWhy Should You Trust Us?See Feedback from PublishersNewsGuard FAQ Website Rating Process and Criteria Misinformation Fingerprints Process TV Rating Process and Criteria Podcast Rating Process and Criteria Corrections Policy Why Should You Trust Us? See Feedback from Publishers NewsGuard FAQ Website Rating Process and Criteria Misinformation Fingerprints Process TV Rating Process and Criteria Podcast Rating Process and Criteria Corrections Policy Why Should You Trust Us? See Feedback from Publishers NewsGuard FAQ PressAll PressPress ReleasesNewsGuard in the Media All Press Press Releases NewsGuard in the Media All Press Press Releases NewsGuard in the Media AboutAbout NewsGuardOur StoryOur TeamOur Board of DirectorsOur InvestorsCareersContact About NewsGuard Our Story Our Team Our Board of Directors Our Investors Careers Contact About NewsGuard Our Story Our Team Our Board of Directors Our Investors Careers Contact EnglishEnglishDeutschFrançaisItaliano English Deutsch Français Italiano English Deutsch Français Italiano Photo byNorbert BraunonUnsplash **German Elections Misinformation Tracking Center** ByRoberta Schmid|Last updated on Feb. 24, 2025 In the run–up to Germany’s snap elections on Feb. 23, 2025, NewsGuard has identified 22false claims related to the vote,including disinformation by Russian actors targeting mainstream political parties that support NATO and Ukraine.They areaimed at boosting the far-right partyAlternative für Deutschland(AfD). The false claims also could undermineoveralltrust in government institutions and in the electoral process itself. NewsGuard has found that bad actors are increasingly employing AI tools, including deepfake technology, to generate convincing false narratives with fabricated testimonies and manipulated videos. (Read moreabout NewsGuard’s recent report on a Russian disinformation networkthat exemplifies how AI has become a force-multiplier.) Russian disinformation operative John Mark Dougan is responsible for launching and operating 102 websites designed to appear to be independent local news sites in Germany, with names such as “Berliner Tageblatt” and “Hamburger Anzeiger.” Read more about his effortshere. This page includes summaries and debunks of some of the top myths related to the German election identified by NewsGuard’s team of journalists and drawn from our proprietary database of false claims, known as Misinformation Fingerprints. NewsGuard will continue to track false and misleading information targeting Germany, including after the vote. Pleasecontact usif you would like complete access to our database of Misinformation Fingerprints. **A sample of the false claims targeting the German elections debunked by NewsGuard:** **FALSE CLAIM: Germany plans to import 1.9 million Kenyan workers** FALSE CLAIM: Germany plans to import 1.9 million Kenyan workers FALSE CLAIM: Germany plans to import 1.9 million Kenyan workers THE FACTS:There is no evidence that Kenya and Germany signed an agreement allowing 1.9 million migrants from Kenya to enter Germany to address labor shortages. The false narrative misrepresents a bilateral labor agreement signed in September 2024 between German Chancellor Olaf Scholz and Kenyan President William Ruto.The agreement allows skilled workers from Kenya to work in Germany, but it does not specify a number or quota. According to German and Kenyan officials, applicants must meet strict criteria under Germany’s Skilled Immigration Act, and no number is set for workers to enter. The claim appears to haveoriginatedfrom a Dec. 17, 2024, article on the Kenyan site Tuko.co.ke, and is linked to Russian disinformation efforts, according toreportsfrom The Gnida Project and Microsoft’stracking of what it calls theRussian Storm-1516disinformationoperation.The false claim spread quickly across social media platforms, includingX,Facebook, andTelegram, garnering millions of views, and was further advanced by pro-Kremlin websites such asVTForeignPolicy.com. The story gained traction in several languages, including English, French, German, and Chinese.(NewsGuard clients can read the full Misinformation Fingerprint and access other false claimshere.)ByMcKenzie Sadeghi THE FACTS:There is no evidence that Kenya and Germany signed an agreement allowing 1.9 million migrants from Kenya to enter Germany to address labor shortages. The false narrative misrepresents a bilateral labor agreement signed in September 2024 between German Chancellor Olaf Scholz and Kenyan President William Ruto. The agreement allows skilled workers from Kenya to work in Germany, but it does not specify a number or quota. According to German and Kenyan officials, applicants must meet strict criteria under Germany’s Skilled Immigration Act, and no number is set for workers to enter. The claim appears to haveoriginatedfrom a Dec. 17, 2024, article on the Kenyan site Tuko.co.ke, and is linked to Russian disinformation efforts, according toreportsfrom The Gnida Project and Microsoft’stracking of what it calls theRussian Storm-1516disinformationoperation. The false claim spread quickly across social media platforms, includingX,Facebook, andTelegram, garnering millions of views, and was further advanced by pro-Kremlin websites such asVTForeignPolicy.com. The story gained traction in several languages, including English, French, German, and Chinese. (NewsGuard clients can read the full Misinformation Fingerprint and access other false claimshere.) ByMcKenzie Sadeghi THE FACTS:There is no evidence that Kenya and Germany signed an agreement allowing 1.9 million migrants from Kenya to enter Germany to address labor shortages. The false narrative misrepresents a bilateral labor agreement signed in September 2024 between German Chancellor Olaf Scholz and Kenyan President William Ruto. The agreement allows skilled workers from Kenya to work in Germany, but it does not specify a number or quota. According to German and Kenyan officials, applicants must meet strict criteria under Germany’s Skilled Immigration Act, and no number is set for workers to enter. The claim appears to haveoriginatedfrom a Dec. 17, 2024, article on the Kenyan site Tuko.co.ke, and is linked to Russian disinformation efforts, according toreportsfrom The Gnida Project and Microsoft’stracking of what it calls theRussian Storm-1516disinformationoperation. The false claim spread quickly across social media platforms, includingX,Facebook, andTelegram, garnering millions of views, and was further advanced by pro-Kremlin websites such asVTForeignPolicy.com. The story gained traction in several languages, including English, French, German, and Chinese. (NewsGuard clients can read the full Misinformation Fingerprint and access other false claimshere.) ByMcKenzie Sadeghi **FALSE CLAIM:A woman named Milina Graz was sexually abused by German Green Party candidate Habeck** FALSE CLAIM:A woman named Milina Graz was sexually abused by German Green Party candidate Habeck FALSE CLAIM:A woman named Milina Graz was sexually abused by German Green Party candidate Habeck THE FACTS:Abaselessclaimiscirculating online that Robert Habeck, Germany’s Green Party chancellor candidate, sexually abused a woman named Milina Graz. The narrative, part of a Russian disinformation campaign,originatedfrom a Dec. 5, 2024, article on a site masquerading as a German news outlet called “Echo der Zeit.” The article included a video featuring a woman claiming that Habeck assaulted her in 2017 when he was Schleswig-Holstein’s environment minister.However, the video is an AI-generated creation, manipulated apparently using face-swap technology,according to the AI detection tool TrueMedia and the Austrian fact-checking siteMimikama.The woman in the video seemingly resembles Russian gymnast Julia Lipnitskaja, but it appears that face swap technology was used to superimpose the face and the audio of a fabricated persona onto footage of Lipnitskaja. The video contains multiple signs of inauthenticity, including unnatural and inconsistent movements, disproportionate facial features, and the supposedly German woman’s Russian accent.“Echo der Zeit” was anonymously registered as a website on Nov. 19, 2024, and is part ofthelarger Russian influence operationinvolving Dougan, Storm-1516,which frequently launchesdisinformation campaignsusing fabricated first-person testimonies.(NewsGuard clients can read the full Misinformation Fingerprint and access other false claimshere.)ByMcKenzie Sadeghi THE FACTS:Abaselessclaimiscirculating online that Robert Habeck, Germany’s Green Party chancellor candidate, sexually abused a woman named Milina Graz. The narrative, part of a Russian disinformation campaign,originatedfrom a Dec. 5, 2024, article on a site masquerading as a German news outlet called “Echo der Zeit.” The article included a video featuring a woman claiming that Habeck assaulted her in 2017 when he was Schleswig-Holstein’s environment minister. However, the video is an AI-generated creation, manipulated apparently using face-swap technology,according to the AI detection tool TrueMedia and the Austrian fact-checking siteMimikama.The woman in the video seemingly resembles Russian gymnast Julia Lipnitskaja, but it appears that face swap technology was used to superimpose the face and the audio of a fabricated persona onto footage of Lipnitskaja. The video contains multiple signs of inauthenticity, including unnatural and inconsistent movements, disproportionate facial features, and the supposedly German woman’s Russian accent. “Echo der Zeit” was anonymously registered as a website on Nov. 19, 2024, and is part ofthelarger Russian influence operationinvolving Dougan, Storm-1516,which frequently launchesdisinformation campaignsusing fabricated first-person testimonies. (NewsGuard clients can read the full Misinformation Fingerprint and access other false claimshere.) ByMcKenzie Sadeghi THE FACTS:Abaselessclaimiscirculating online that Robert Habeck, Germany’s Green Party chancellor candidate, sexually abused a woman named Milina Graz. The narrative, part of a Russian disinformation campaign,originatedfrom a Dec. 5, 2024, article on a site masquerading as a German news outlet called “Echo der Zeit.” The article included a video featuring a woman claiming that Habeck assaulted her in 2017 when he was Schleswig-Holstein’s environment minister. However, the video is an AI-generated creation, manipulated apparently using face-swap technology,according to the AI detection tool TrueMedia and the Austrian fact-checking siteMimikama.The woman in the video seemingly resembles Russian gymnast Julia Lipnitskaja, but it appears that face swap technology was used to superimpose the face and the audio of a fabricated persona onto footage of Lipnitskaja. The video contains multiple signs of inauthenticity, including unnatural and inconsistent movements, disproportionate facial features, and the supposedly German woman’s Russian accent. “Echo der Zeit” was anonymously registered as a website on Nov. 19, 2024, and is part ofthelarger Russian influence operationinvolving Dougan, Storm-1516,which frequently launchesdisinformation campaignsusing fabricated first-person testimonies. (NewsGuard clients can read the full Misinformation Fingerprint and access other false claimshere.) ByMcKenzie Sadeghi **FALSE CLAIM:A Russianfoundation’s investigation provedthe German governmentplans to harass and kill far-right politicians and activists** FALSE CLAIM:A Russianfoundation’s investigation provedthe German governmentplans to harass and kill far-right politicians and activists FALSE CLAIM:A Russianfoundation’s investigation provedthe German governmentplans to harass and kill far-right politicians and activists THE FACTS:Contrary to claims made by the Russian-controlled Foundation to Battle Injustice, there is no evidence that the German government plans to silence far-right figures through media smear campaigns, physical assaults, assassinations, and other attacks. The narrative, presented in a baselessreport, alleges that the German government seeks to eliminate far-right participation in the February 2025 federal elections, including a plot to murder Björn Höcke, the AfD Alternative for Germany leader in the central German state of Thuringia, and the arrest and murder of Lutz Bachmann, the leader of anti-Islam organization Patriotic Europeans Against the Islamisation of the West (PEGIDA).The so-called investigation said that the German government plans to “completely cleanse the ‘German political landscape’ of the right and far-right by the summer of 2025toavoid the participation of the most popular right-wing politicians in the federal elections scheduled for next fall.” The report relies entirely on the testimony of two unnamed sources —identified only as anex-lawmaker and an investigative journalist — who provided no verifiable evidence.(NewsGuard clients can read the full Misinformation Fingerprint and access other false claimshere.)ByLeonie Pfaller THE FACTS:Contrary to claims made by the Russian-controlled Foundation to Battle Injustice, there is no evidence that the German government plans to silence far-right figures through media smear campaigns, physical assaults, assassinations, and other attacks. The narrative, presented in a baselessreport, alleges that the German government seeks to eliminate far-right participation in the February 2025 federal elections, including a plot to murder Björn Höcke, the AfD Alternative for Germany leader in the central German state of Thuringia, and the arrest and murder of Lutz Bachmann, the leader of anti-Islam organization Patriotic Europeans Against the Islamisation of the West (PEGIDA). The so-called investigation said that the German government plans to “completely cleanse the ‘German political landscape’ of the right and far-right by the summer of 2025toavoid the participation of the most popular right-wing politicians in the federal elections scheduled for next fall.” The report relies entirely on the testimony of two unnamed sources —identified only as anex-lawmaker and an investigative journalist — who provided no verifiable evidence. (NewsGuard clients can read the full Misinformation Fingerprint and access other false claimshere.) ByLeonie Pfaller THE FACTS:Contrary to claims made by the Russian-controlled Foundation to Battle Injustice, there is no evidence that the German government plans to silence far-right figures through media smear campaigns, physical assaults, assassinations, and other attacks. The narrative, presented in a baselessreport, alleges that the German government seeks to eliminate far-right participation in the February 2025 federal elections, including a plot to murder Björn Höcke, the AfD Alternative for Germany leader in the central German state of Thuringia, and the arrest and murder of Lutz Bachmann, the leader of anti-Islam organization Patriotic Europeans Against the Islamisation of the West (PEGIDA). The so-called investigation said that the German government plans to “completely cleanse the ‘German political landscape’ of the right and far-right by the summer of 2025toavoid the participation of the most popular right-wing politicians in the federal elections scheduled for next fall.” The report relies entirely on the testimony of two unnamed sources —identified only as anex-lawmaker and an investigative journalist — who provided no verifiable evidence. (NewsGuard clients can read the full Misinformation Fingerprint and access other false claimshere.) ByLeonie Pfaller **FALSE CLAIM:German Chancellor Olaf Scholz owned a villa in Los Angeles that burned during the 2025 California fires** FALSE CLAIM:German Chancellor Olaf Scholz owned a villa in Los Angeles that burned during the 2025 California fires FALSE CLAIM:German Chancellor Olaf Scholz owned a villa in Los Angeles that burned during the 2025 California fires THE FACTS:Contrary tosocialmediaclaims, German Chancellor Olaf Scholz does not own a 90 million euro ($94.6 million) villa in Los Angeles that burned in the 2025 California fires. The false claimfirst appearedon TikTok on Jan.10, 2025, and was based on misrepresented footage of two unrelated buildings: the Los Angeles Police Academy and a Beverly Hills villa, neither of which belong to Scholz.Moreover, both buildings are outside the areas affected by the fires, and there is no evidence that either was damaged. Scholz’s spokesperson has stated that Scholz does not own any real estate in California or elsewhere.(NewsGuard clients can read the full Misinformation Fingerprint and access other false claimshere.)ByElena Bernard THE FACTS:Contrary tosocialmediaclaims, German Chancellor Olaf Scholz does not own a 90 million euro ($94.6 million) villa in Los Angeles that burned in the 2025 California fires. The false claimfirst appearedon TikTok on Jan.10, 2025, and was based on misrepresented footage of two unrelated buildings: the Los Angeles Police Academy and a Beverly Hills villa, neither of which belong to Scholz. Moreover, both buildings are outside the areas affected by the fires, and there is no evidence that either was damaged. Scholz’s spokesperson has stated that Scholz does not own any real estate in California or elsewhere. (NewsGuard clients can read the full Misinformation Fingerprint and access other false claimshere.) ByElena Bernard THE FACTS:Contrary tosocialmediaclaims, German Chancellor Olaf Scholz does not own a 90 million euro ($94.6 million) villa in Los Angeles that burned in the 2025 California fires. The false claimfirst appearedon TikTok on Jan.10, 2025, and was based on misrepresented footage of two unrelated buildings: the Los Angeles Police Academy and a Beverly Hills villa, neither of which belong to Scholz. Moreover, both buildings are outside the areas affected by the fires, and there is no evidence that either was damaged. Scholz’s spokesperson has stated that Scholz does not own any real estate in California or elsewhere. (NewsGuard clients can read the full Misinformation Fingerprint and access other false claimshere.) ByElena Bernard **FALSE CLAIM:The European Union canceled Romania’s 2024 elections and might do the same in Germany** FALSE CLAIM:The European Union canceled Romania’s 2024 elections and might do the same in Germany FALSE CLAIM:The European Union canceled Romania’s 2024 elections and might do the same in Germany THE FACTS:Contrary to claims circulating online, former European Commissioner Thierry Breton did not claim that the European Union canceled Romania’s presidential election or could do the same in Germany if the far-right AfD wins. The false claim, whichfirst appearedon X on Jan. 9, 2025, and was spread byElon Muskand anti-EU figures, misrepresents Breton’sinterviewon French Radio, In fact, Romania’s Constitutional Court — not the EU — annulled the first round of its election due to alleged Russian interference in favor of pro-Kremlin candidate Calin Georgescu.The EU has no authority to cancel national elections. Thedecisions are the responsibility of individual member states, a European Commission spokesperson confirmed. During the interview, Breton referred to the EU’s work fighting online disinformation and election interference, and said: “For now, let’s keep our cool and enforce our laws in Europe when they risk being circumvented, or when they may, if we don’t enforce them, lead to interference. We did it in Romania, and of course, if necessary, we’ll have to do it in Germany.”At no point in the interview did Breton say that the EU had canceled the 2024 Romanian election. Bretondeniedthe claim in a Jan. 11, 2025, response to an X post by Elon Musk that amplified the claim.“No @elonmusk: the EU has NO mechanism to nullify any election anywhere in EU,” Breton said in an English-language X post.(NewsGuard clients can read the full Misinformation Fingerprint and access other false claimshere.)ByNatalie Huet THE FACTS:Contrary to claims circulating online, former European Commissioner Thierry Breton did not claim that the European Union canceled Romania’s presidential election or could do the same in Germany if the far-right AfD wins. The false claim, whichfirst appearedon X on Jan. 9, 2025, and was spread byElon Muskand anti-EU figures, misrepresents Breton’sinterviewon French Radio, In fact, Romania’s Constitutional Court — not the EU — annulled the first round of its election due to alleged Russian interference in favor of pro-Kremlin candidate Calin Georgescu. The EU has no authority to cancel national elections. Thedecisions are the responsibility of individual member states, a European Commission spokesperson confirmed. During the interview, Breton referred to the EU’s work fighting online disinformation and election interference, and said: “For now, let’s keep our cool and enforce our laws in Europe when they risk being circumvented, or when they may, if we don’t enforce them, lead to interference. We did it in Romania, and of course, if necessary, we’ll have to do it in Germany.” At no point in the interview did Breton say that the EU had canceled the 2024 Romanian election. Bretondeniedthe claim in a Jan. 11, 2025, response to an X post by Elon Musk that amplified the claim.“No @elonmusk: the EU has NO mechanism to nullify any election anywhere in EU,” Breton said in an English-language X post. (NewsGuard clients can read the full Misinformation Fingerprint and access other false claimshere.) ByNatalie Huet THE FACTS:Contrary to claims circulating online, former European Commissioner Thierry Breton did not claim that the European Union canceled Romania’s presidential election or could do the same in Germany if the far-right AfD wins. The false claim, whichfirst appearedon X on Jan. 9, 2025, and was spread byElon Muskand anti-EU figures, misrepresents Breton’sinterviewon French Radio, In fact, Romania’s Constitutional Court — not the EU — annulled the first round of its election due to alleged Russian interference in favor of pro-Kremlin candidate Calin Georgescu. The EU has no authority to cancel national elections. Thedecisions are the responsibility of individual member states, a European Commission spokesperson confirmed. During the interview, Breton referred to the EU’s work fighting online disinformation and election interference, and said: “For now, let’s keep our cool and enforce our laws in Europe when they risk being circumvented, or when they may, if we don’t enforce them, lead to interference. We did it in Romania, and of course, if necessary, we’ll have to do it in Germany.” At no point in the interview did Breton say that the EU had canceled the 2024 Romanian election. Bretondeniedthe claim in a Jan. 11, 2025, response to an X post by Elon Musk that amplified the claim.“No @elonmusk: the EU has NO mechanism to nullify any election anywhere in EU,” Breton said in an English-language X post. (NewsGuard clients can read the full Misinformation Fingerprint and access other false claimshere.) ByNatalie Huet Other false narratives debunked by NewsGuard in ourMisinformation Fingerprints: Adolf Hitler was a communist. The German supermarket chain EDEKA endorsed the right-wing party Alternative für Deutschland (AfD) in a new ad. A video shows a German protestor admitting to getting paid 60 euros an hour by the state toprotestthe far-right AfD party. Marcus Faber, a member of parliament for the German Liberal Democratic Party (FDP), works as an agent for Russia. Germany decriminalized the possession of images of child sexual abuse. Volodymyr Zelensky spent 14.2 million euros in Western military aid to buy the Eagle’s Nest retreat previously owned by Hitler. Ballots in Leipzig, Germany, are missing a column to vote for the far-right Alternative for Germany party (AfD). The EU announced an initiative that would allow the EU to cancel elections in its member states. Paper ballots with punched holes or cut corners invalidate German mail-in votes. The suspect in a December 2024 car attack on a German Christmas market shouted ‘Allahu akbar’ during his arrest. A majority of German students voted for the far-right Alternative for Germany party (AfD) in a nationwide mock youth election. German diplomat Christoph Heusgen broke down over JD Vance’s remarks criticizing the EU. German conservative opposition leader Friedrich Merz was hospitalized in 2017 for attempted suicide. The German Green Party helped Ukraine steal 100 million euros worth of paintings from a Berlin museum. Ballots in Germany must be signed by voters to be counted. German President Frank-Walter Steinmeier threatened to nullify the 2025 German federal election. A video shows someone destroying mail-in ballots with votes for the far-right Alternative for Germany party (AfD). If you come across a story about the German election that you believe to be false,please report it here. Ratings Careers Press Privacy Policy Get NewsGuard Terms of Service Contact Cookie Notice Support About Bluesky X Facebook LinkedIn"}