{"id": 633, "name": "Heavy", "domain": "heavy.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://heavy.com/sports/nfl/washington-commanders/commanders-wr-terry-mclaurins-head-scratching-holdout-appears-on-the-panic-meter/", "title": "Commanders Wr Terry Mclaurins Head Scratching Holdout Appears On The Panic Meter", "content": "Heavy Sports Heavy on NFL Heavy on Commanders **Commanders WR Terry McLaurin’s ‘Head-Scratching Holdout’ Appears on the ‘Panic Meter’** **Unlock the latest Washington Commanders news — direct to your inbox.** 587Views 3Shares ByDerek Tate UpdatedJun 11, 2025 at 8:01am Contract negotiations between theWashington Commandersand star WR Terry McLaurin have taken center stage at this point of the offseason for a team with Super Bowl aspirations. The current state of these negotiations has one NFL writer trying to gauge exactly where this holdout ranks on the panic meter in the middle of June. **Where is the Holdout Panic Meter for Washington Commanders WR Terry McLaurin Entering Minicamp?** Tyler Sullivan of CBS Sports believes three NFL stars currently land on the panic meter while seeking a new contract entering the 2025 NFL season. Pittsburgh Steelers EDGE T.J. Watt, Cincinnati Bengals DE Trey Hendrickson, and Washington Commanders WR Terry McLaurin. Fortunately for Washington fans, McLaurin had the lowest panic meter rating of the three star players. Sullivan wrote, “This might be the most head-scratching holdout of the bunch. McLaurin has been one of the faces of the Commanders organization through some trying times and has been a highly productive player despite lackluster play at quarterback. When McLaurin and the Commanders finally secured an elite, young quarterback inJayden Daniels, the veteran wideout put together arguably the best season of his career. His 13 touchdowns and 70.1% catch rate were the highest of his career, and he was a key cog in Washington reaching the NFC Championship in 2024. So, why are the Commanders fussing around with the contract, especially when they have the cap space and a quarterback playing on his rookie deal?” Sullivan poses a fair question when you take into consideration some of the high priced veterans the Commanders acquired this offseason by trading for LT Laremy Tunsil and WR Deebo Samuel. The franchise also spent a pretty penny in free agency by signing DT Javon Kinlaw. If the organization spending money on other veterans wasn’t enough to get McLaurin’s attention, then some of the other deals veteran receivers signed this offseason likely gave the Ohio State product enough reason to validate why he is looking for a new deal. Sullivan added, “The wide receiver market has ballooned to where the elite pass catchers — like McLaurin — are in the $30 million-per-year range, with Ja’Marr Chase at the top of the list with a $40.25 million in AAV. McLaurin, while older, could be looking at a deal similar toDK Metcalf, who inked an extension with the Steelers this offseason that pays him about $33 million annually. That’s a hefty price, but the Commanders have broken open into aSuper Bowlwindow with Daniels, and they’d be wise to pay his go-to target.” **Could Terry McLaurin Actually Miss Regular Season Games in 2025?** Another potential reason Commander shouldn’t be in full blown panic mode quite yet is McLaurin’s past contract negotiations having some similarities a few years back, which led to the two sides figuring out a long-term deal. Sullivan concluded, “It’s worth pointing out that McLaurin also skipped OTAs and minicamp during the 2022 offseason before signing his three-year, $71 million contract extension, so there is precedent for this situation and everyone landing on their feet.” The moves the Commanders made this offseason send message that Washington wants to give quarterback Jayden Daniels the best possibility to elevate this franchise to the next level by surrounding him with talent. Failing to get a contract extension done with his go-to receiver would feel very counterproductive to everything they have achieved this offseason by improving the roster. It is hard to envision McLaurin missing any regular season games when the action starts this September, but this situation is certainly worth monitoring throughout the next few months. Derek Tatecovered the Tampa Bay Buccaneers for Heavy.com from 2022 to 2023. His bylines include Pro Football Network, The Athletic, Dr. Roto, Fantasy Focused and NewsNet.More about Derek Tate **Now Test Your Knowledge** **Watch Commanders News & Highlights** **More Heavy on Commanders** **Comments** **Commanders WR Terry McLaurin’s ‘Head-Scratching Holdout’ Appears on the ‘Panic Meter’** Home NFLExpand sub-menuArizona CardinalsAtlanta FalconsBaltimore RavensBuffalo BillsCarolina PanthersCincinnati BengalsCleveland BrownsChicago BearsDallas CowboysDenver BroncosDetroit LionsGreen Bay PackersHouston TexansIndianapolis ColtsJacksonville JaguarsKansas City ChiefsLos Angeles ChargersLos Angeles RamsLas Vegas RaidersMiami DolphinsMinnesota VikingsNew England PatriotsNew Orleans SaintsNew York GiantsNew York JetsPhiladelphia EaglesPittsburgh SteelersSan Francisco 49ersSeattle SeahawksTampa Bay BuccaneersTennessee TitansWashington Commanders Arizona Cardinals Atlanta Falcons Baltimore Ravens Buffalo Bills Carolina Panthers Cincinnati Bengals Cleveland Browns Chicago Bears Dallas Cowboys Denver Broncos Detroit Lions Green Bay Packers Houston Texans Indianapolis Colts Jacksonville Jaguars Kansas City Chiefs Los Angeles Chargers Los Angeles Rams Las Vegas Raiders Miami Dolphins Minnesota Vikings New England Patriots New Orleans Saints New York Giants New York Jets Philadelphia Eagles Pittsburgh Steelers San Francisco 49ers Seattle Seahawks Tampa Bay Buccaneers Tennessee Titans Washington Commanders Arizona Cardinals Atlanta Falcons Baltimore Ravens Buffalo Bills Carolina Panthers Cincinnati Bengals Cleveland Browns Chicago Bears Dallas Cowboys Denver Broncos Detroit Lions Green Bay Packers Houston Texans Indianapolis Colts Jacksonville Jaguars Kansas City Chiefs Los Angeles Chargers Los Angeles Rams Las Vegas Raiders Miami Dolphins Minnesota Vikings New England Patriots New Orleans Saints New York Giants New York Jets Philadelphia Eagles Pittsburgh Steelers San Francisco 49ers Seattle Seahawks Tampa Bay Buccaneers Tennessee Titans Washington Commanders NBAExpand sub-menuAtlanta HawksBoston CelticsBrooklyn NetsCharlotte HornetsChicago BullsCleveland CavaliersDallas MavericksDenver NuggetsDetroit PistonsGolden State WarriorsHouston RocketsIndiana PacersLos Angeles ClippersLos Angeles LakersMemphis GrizzliesMiami HeatMilwaukee BucksMinnesota TimberwolvesNew Orleans PelicansNew York KnicksOklahoma City ThunderOrlando MagicPhiladelphia 76ersPhoenix SunsPortland Trail BlazersSacramento KingsSan Antonio SpursToronto RaptorsUtah JazzWashington Wizards Atlanta Hawks Boston Celtics Brooklyn Nets Charlotte Hornets Chicago Bulls Cleveland Cavaliers Dallas Mavericks Denver Nuggets Detroit Pistons Golden State Warriors Houston Rockets Indiana Pacers Los Angeles Clippers Los Angeles Lakers Memphis Grizzlies Miami Heat Milwaukee Bucks Minnesota Timberwolves New Orleans Pelicans New York Knicks Oklahoma City Thunder Orlando Magic Philadelphia 76ers Phoenix Suns Portland Trail Blazers Sacramento Kings San Antonio Spurs Toronto Raptors Utah Jazz Washington Wizards Atlanta Hawks Boston Celtics Brooklyn Nets Charlotte Hornets Chicago Bulls Cleveland Cavaliers Dallas Mavericks Denver Nuggets Detroit Pistons Golden State Warriors Houston Rockets Indiana Pacers Los Angeles Clippers Los Angeles Lakers Memphis Grizzlies Miami Heat Milwaukee Bucks Minnesota Timberwolves New Orleans Pelicans New York Knicks Oklahoma City Thunder Orlando Magic Philadelphia 76ers Phoenix Suns Portland Trail Blazers Sacramento Kings San Antonio Spurs Toronto Raptors Utah Jazz Washington Wizards MLBExpand sub-menuArizona DiamondbacksAthleticsAtlanta BravesBaltimore OriolesBoston Red SoxChicago CubsChicago White SoxCincinnati RedsCleveland GuardiansColorado RockiesDetroit TigersHouston AstrosKansas City RoyalsLos Angeles AngelsLos Angeles DodgersMiami MarlinsMilwaukee BrewersMinnesota TwinsNew York MetsNew York YankeesPhiladelphia PhilliesPittsburgh PiratesSan Diego PadresSan Francisco GiantsSeattle MarinersSt. Louis CardinalsTampa Bay RaysTexas RangersToronto Blue JaysWashington Nationals Arizona Diamondbacks Athletics Atlanta Braves Baltimore Orioles Boston Red Sox Chicago Cubs Chicago White Sox Cincinnati Reds Cleveland Guardians Colorado Rockies Detroit Tigers Houston Astros Kansas City Royals Los Angeles Angels Los Angeles Dodgers Miami Marlins Milwaukee Brewers Minnesota Twins New York Mets New York Yankees Philadelphia Phillies Pittsburgh Pirates San Diego Padres San Francisco Giants Seattle Mariners St. Louis Cardinals Tampa Bay Rays Texas Rangers Toronto Blue Jays Washington Nationals Arizona Diamondbacks Athletics Atlanta Braves Baltimore Orioles Boston Red Sox Chicago Cubs Chicago White Sox Cincinnati Reds Cleveland Guardians Colorado Rockies Detroit Tigers Houston Astros Kansas City Royals Los Angeles Angels Los Angeles Dodgers Miami Marlins Milwaukee Brewers Minnesota Twins New York Mets New York Yankees Philadelphia Phillies Pittsburgh Pirates San Diego Padres San Francisco Giants Seattle Mariners St. Louis Cardinals Tampa Bay Rays Texas Rangers Toronto Blue Jays Washington Nationals NHLExpand sub-menuBoston BruinsDetroit Red WingsNew York RangersToronto Maple Leafs Boston Bruins Detroit Red Wings New York Rangers Toronto Maple Leafs Boston Bruins Detroit Red Wings New York Rangers Toronto Maple Leafs More SportsExpand sub-menuBoxingGolfNASCARNCAAFNCAAMNCAAWOlympicsUFCWNBA Boxing Golf NASCAR NCAAF NCAAM NCAAW Olympics UFC WNBA Boxing Golf NASCAR NCAAF NCAAM NCAAW Olympics UFC WNBA About Heavy.com Contact Us Editorial Guidelines Opportunities Privacy Policy Privacy Rights Terms of Service Sitemap Stay Connected"}