{"id": 128, "name": "Berliner Zeitung", "domain": "berliner-zeitung.de", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.berliner-zeitung.de/politik-gesellschaft/geopolitik/trump-schimpft-ueber-elon-musk-ich-bin-sehr-enttaeuscht-li.2331128", "title": "Trump Schimpft Ueber Elon Musk Ich Bin Sehr Enttaeuscht Li.2331128", "content": "Bezirke News Berlin 80 Jahre Berliner Zeitung Ostdeutschland 1. FC Union Internationales Politik Wirtschaft Kultur Panorama Stil Sport Gesundheit Technologie Bürgerrechte **Musk vs. Trump: Epstein-Vorwurf erschüttert Präsidenten – Tesla-Aktie stürzt ab** Nach Donald Trumps Seitenhieb beim Treffen mit Friedrich Merz schlägt Elon Musk zurück – und bringt den Präsidenten mit dem Epstein-Skandal in Verbindung. Ein Angriff mit Sprengkraft. Was mit gegenseitigen Vorwürfen über ein umstrittenes Steuergesetz begann, ist nun zu einem politischen Flächenbrand geworden:Elon Muskhat in einem explosiven Post auf X (vormals Twitter) behauptet,Donald Trumpsei in den Fall um den SexualstraftäterJeffrey Epsteinverwickelt – und das sei der wahre Grund, warum die betreffenden Unterlagen bislang nicht veröffentlicht wurden.„Zeit, die ganz große Bombe platzen zu lassen“, schrieb Musk und richtete sich direkt an den Präsidenten: „@realDonaldTrump ist in den Epstein-Akten. Das ist der wahre Grund, warum sie nicht veröffentlicht wurden. Schönen Tag noch, DJT!“. Kurze Zeit später fügte der Tech-Milliardär nach: „Merke dir diesen Beitrag für die Zukunft. Die Wahrheit wird ans Licht kommen“. **Mit einem Abo weiterlesen** Zugriff auf alle B+ Inhalte Statt 9,99 € für 2,00 € je Monat lesen Jederzeit kündbar Sie haben bereits ein B-Plus?Melden Sie sich an Doch lieber Print? Hier geht's zumAbo Shop **Lesen Sie mehr zum Thema**"}