{"id": 1607, "name": "WPTV - West Palm Beach News", "domain": "wptv.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wptv.com/news/treasure-coast/region-indian-river-county/2-known-auto-burglars-caught-in-indian-river-county-after-fleeing-driving-through-fec-railroad-fence", "title": "2 Known Auto Burglars Caught In Indian River County After Fleeing Driving Through Fec Railroad Fence", "content": "Menu WeatherInteractive RadarDaily ForecastHurricane Survival GuideHourly ForecastLive Interactive VIPIR Hurricane MapWeather Cams Interactive Radar Daily Forecast Hurricane Survival Guide Hourly Forecast Live Interactive VIPIR Hurricane Map Weather Cams Interactive Radar Daily Forecast Hurricane Survival Guide Hourly Forecast Live Interactive VIPIR Hurricane Map Weather Cams NewsLocal NewsWPTV InvestigatesReal Estate NewsPoliticsStateNational NewsWorld NewsCrimeEducationProtecting ParadiseYour Health Matters Local News WPTV Investigates Real Estate News Politics State National News World News Crime Education Protecting Paradise Your Health Matters Local News WPTV Investigates Real Estate News Politics State National News World News Crime Education Protecting Paradise Your Health Matters TrafficGas PricesGas AvailabilityAirports Gas Prices Gas Availability Airports Gas Prices Gas Availability Airports EntertainmentTV ListingsMovies TV Listings Movies TV Listings Movies LifeFinding FloridaShining A LightUnderdogPetsFamilyFood News Finding Florida Shining A Light Underdog Pets Family Food News Finding Florida Shining A Light Underdog Pets Family Food News SportsCognizant ClassicDolphinsPanthersCollege SportsFAUGatorsHurricanesSeminolesFootballBaseballBasketballSurfing BlogRecreation Sports Cognizant Classic Dolphins Panthers College Sports FAU Gators Hurricanes Seminoles Football Baseball Basketball Surfing Blog Recreation Sports Cognizant Classic Dolphins Panthers College Sports FAU Gators Hurricanes Seminoles Football Baseball Basketball Surfing Blog Recreation Sports MoneyMoney HeadlinesDont Waste Your MoneyRecalls Money Headlines Dont Waste Your Money Recalls Money Headlines Dont Waste Your Money Recalls MarketplaceSunshine SpotlightHome ExpertsIn the Know Sunshine Spotlight Home Experts In the Know Sunshine Spotlight Home Experts In the Know VideosWPTV Livestream PlayerWPTV on Youtube WPTV Livestream Player WPTV on Youtube WPTV Livestream Player WPTV on Youtube About UsAdvertiseContact UsContestsSeen On 5JobsStaff BiosWHDT, South Florida's 9How to Watch WPTV 24/7Support Advertise Contact Us Contests Seen On 5 Jobs Staff Bios WHDT, South Florida's 9 How to Watch WPTV 24/7 Support Advertise Contact Us Contests Seen On 5 Jobs Staff Bios WHDT, South Florida's 9 How to Watch WPTV 24/7 Support Sign In Newsletters Sign Out Manage Emails Apps Careers Search Treasure Coast Okeechobee Indian River St. Lucie Martin Palm Beach County North PBC Central PBC South PBC The Glades Broward Miami-Dade **Actions** Facebook Tweet Email **2 'known auto burglars' in custody after stolen car chase ends in Gifford** INDIAN RIVER COUNTY, Fla. — There was a stolen car, a police chase, and now a full-scale investigation in the Gifford area after deputies say multiple suspects fled a crashed vehicle early Tuesday morning. According to Indian River County Sheriff Eric Flowers, deputies attempted to stop a vehicle driving erratically just after sunrise. The driver refused to stop, leading deputies on a short pursuit that ended on 42nd Street. WATCH: 2 in custody after early-morning chase Indian River County Sheriff's Office (IRCSO) deputies arrested two individuals Tuesday morning after they had stolen a vehicle from a neighboring county. IRCSO deputies say they saw a vehicle driving recklessly in a residential area before fleeing from deputies down a dead-end road. The car then drove through a Florida East Coast (FEC) Railway fence. Two individuals were quickly taken into custody. One of them is a juvenile, the other was identified as 19-year-old Javonte Chambliss. “That guy is a known-history burglar,” Sheriff Flowers said. WATCH: IRCSO body-cam footage of chase The vehicle was confirmed to be stolen from St. Lucie County with a stolen Indian River County tag. IRCSO said that this is not the first time these suspects have stolen a vehicle. Sheriff Flowers believes more suspects may have been inside the vehicle and says detectives are processing it for fingerprints and DNA. “At least two fled out of the vehicle. There may have been a third one,” Flowers said. “We’ll process the vehicle and find out who else was in it.” The sheriff says his deputies may have stopped the group before they could commit additional crimes in the area. The investigation remains active. **Sign up for theSouth Florida Sports Headlines Newsletterand receive up to date information.** **now signed up to receive theSouth Florida Sports Headlines Newsletter.** **At WPTV, It Starts with Listening** **At WPTV, It Starts with Listening** Weather Traffic News Money Sports Entertainment Life Marketplace Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact WPTV5 wptv WPTV5/ WPTV"}