{"id": 428, "name": "Exposing the Truth", "domain": "exposingtruth.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.exposingtruth.com/scientists-say-giant-asteroid-hit-earth-next-week-causing-mass-destruction/", "title": "Scientists Say Giant Asteroid Hit Earth Next Week Causing Mass Destruction", "content": "**** ActivismCampaignsOccupyProtestsTurkey Campaigns Occupy ProtestsTurkey Turkey Campaigns Occupy ProtestsTurkey Turkey Turkey HealthAgent OrangeCancerCannabisDecriminalizationFoodGMOsFluorideMental HealthVaccines Agent Orange Cancer CannabisDecriminalization Decriminalization FoodGMOs GMOs Fluoride Mental Health Vaccines Agent Orange Cancer CannabisDecriminalization Decriminalization Decriminalization FoodGMOs GMOs GMOs Fluoride Mental Health Vaccines Human RightsCensorshipEducationEqualityDisabilityGender EqualityRacismFreedom of SpeechPrivacyDronesGCHQNSAPrismSafetyHuman Trafficking Censorship Education EqualityDisabilityGender EqualityRacism Disability Gender Equality Racism Freedom of Speech PrivacyDronesGCHQNSAPrism Drones GCHQ NSAPrism Prism SafetyHuman Trafficking Human Trafficking Censorship Education EqualityDisabilityGender EqualityRacism Disability Gender Equality Racism Disability Gender Equality Racism Freedom of Speech PrivacyDronesGCHQNSAPrism Drones GCHQ NSAPrism Prism Drones GCHQ NSAPrism Prism Prism SafetyHuman Trafficking Human Trafficking Human Trafficking MediaCopyrightInternetFile SharingPropagandaWhistleblowersBradley ManningEdward SnowdenWikileaksJulian Assange Copyright InternetFile Sharing File Sharing Propaganda WhistleblowersBradley ManningEdward SnowdenWikileaksJulian Assange Bradley Manning Edward Snowden WikileaksJulian Assange Julian Assange Copyright InternetFile Sharing File Sharing File Sharing Propaganda WhistleblowersBradley ManningEdward SnowdenWikileaksJulian Assange Bradley Manning Edward Snowden WikileaksJulian Assange Julian Assange Bradley Manning Edward Snowden WikileaksJulian Assange Julian Assange Julian Assange ScienceBiologyDNAEugenicsPhysicsPlane TrailsTeslaPsychologySustainability BiologyDNAEugenics DNA Eugenics PhysicsPlane TrailsTesla Plane Trails Tesla Psychology Sustainability BiologyDNAEugenics DNA Eugenics DNA Eugenics PhysicsPlane TrailsTesla Plane Trails Tesla Plane Trails Tesla Psychology Sustainability War & Politics9/11AfghanistanBelizeCanadaChinaEgyptEuropean UnionGermanyIranIraqIsraelLibyaMalaysiaPalestinePhilippinesRussiaSwedenSyriaTurkeyUnited KingdomUnited StatesVatican 9/11 Afghanistan Belize Canada China Egypt European Union Germany Iran Iraq Israel Libya Malaysia Palestine Philippines Russia Sweden Syria Turkey United Kingdom United States Vatican 9/11 Afghanistan Belize Canada China Egypt European Union Germany Iran Iraq Israel Libya Malaysia Palestine Philippines Russia Sweden Syria Turkey United Kingdom United States Vatican MoreCorporatismCorruptionChild ServicesPedophile RingsEconomicsCorporate TaxHomesteadingSelf Improvement Corporatism CorruptionChild ServicesPedophile Rings Child Services Pedophile Rings EconomicsCorporate Tax Corporate Tax Homesteading Self Improvement Corporatism CorruptionChild ServicesPedophile Rings Child Services Pedophile Rings Child Services Pedophile Rings EconomicsCorporate Tax Corporate Tax Corporate Tax Homesteading Self Improvement **Scientists say giant asteroid could hit earth next week, causing mass destruction** Scientists have discovered a massive asteroid that is on course to hit the Earth next week, and are scrambling to find a way to divert the object. The asteroid has been named2016-FIand measures approximately 1 km across. If it strikes a populated area is could wipe out entire cities and potentially devastate an entire continent or … nah. I’m totally messing with you. There’s no asteroid (at least not about to strike next week). But there isa new study by computer scientists at Columbia University and the French National Institutethat has found that 59 percent of links shared on social media have never actually been clicked, meaning that most people who share news on social media aren’t actually reading it first, and that’ll probably apply to this article as well. For the study, Arnaud Legout and co-authors collected two data sets: the first, on all tweets containing Bit.ly-shortened links to five major news sources during a one-month period last summer; the second, on all of the clicks attached to that set of shortened links, as logged by Bit.ly, during the same period. After cleaning and collating that data, the researchers basically found themselves with a map to how news goes viral on Twitter. The map showed “viral” news is widely shared but not necessarily read. According to the Washington Post, one thing study authors say is concerning about this is that it shapes the way we see the world. Legout said in a statement: “People are more willing to share an article than read it. This is typical of modern information consumption. People form an opinion based on a summary, or a summary of summaries, without making the effort to go deeper.” This probably won’t shock most people. We see it all the time in comments sections – people making loud proclamations about stories they clearly haven’t read. Entire discussions are chaired by those who didn’t actually read the article. It’s maddening. What can you do about it? Read the article, of course, and don’t share things you haven’t read. Being informed is being responsible. So, have you made it this far or are you busy building a makeshift shelter in your basement? If you read it and want to comment, work a colour – red, blue, yellow, pink, whatever – into your comment, would you? But don’t ruin the headline for everyone else, OK? Thanks. You’re the best. Credit:Yackler magazine Tweet Share on Tumblr **Related** Popular Posts Recent Posts Homosexuality Is NaturalbyAaron Jackson Homosexuality Is Natural Homosexuality Is Natural Marijuana’s Long Term Effects On The Brain Finally RevealedbyMichael Thomas Marijuana’s Long Term Effects On The Brain Finally Revealed Marijuana’s Long Term Effects On The Brain Finally Revealed Scientists say giant asteroid could hit earth next week, causing mass destructionbyAaron Jackson Scientists say giant asteroid could hit earth next week, causing mass destruction Scientists say giant asteroid could hit earth next week, causing mass destruction Why GMOs Are Not Your EnemybyMichael Thomas Why GMOs Are Not Your Enemy Why GMOs Are Not Your Enemy Contrails – Countering the fear-porn of ChemtrailsbyAsura Contrails – Countering the fear-porn of Chemtrails Contrails – Countering the fear-porn of Chemtrails Looking at the “Evidence” in the Steven Avery casebyMichael Thomas Looking at the “Evidence” in the Steven Avery case Looking at the “Evidence” in the Steven Avery case The Truth about GMOsbyMichael Thomas The Truth about GMOs The Truth about GMOs Goldendoodle Puppies: The Ultimate Guide for New OwnersbyJennifer Barns Goldendoodle Puppies: The Ultimate Guide for New Owners Goldendoodle Puppies: The Ultimate Guide for New Owners 4 Ways Learning an Instrument Can Improve Your LifebyJennifer Barns 4 Ways Learning an Instrument Can Improve Your Life 4 Ways Learning an Instrument Can Improve Your Life 3 Handy Tips for Learning Legal JargonbyJennifer Barns 3 Handy Tips for Learning Legal Jargon 3 Handy Tips for Learning Legal Jargon 3 Things To Do When Witnessing Road RagebyJennifer Barns 3 Things To Do When Witnessing Road Rage 3 Things To Do When Witnessing Road Rage 3 Tips For Staying Safe When Driving Through Construction ZonesbyJennifer Barns 3 Tips For Staying Safe When Driving Through Construction Zones 3 Tips For Staying Safe When Driving Through Construction Zones 4 Preparations to Make As We Potentially Enter World War IIIbyJennifer Barns 4 Preparations to Make As We Potentially Enter World War III 4 Preparations to Make As We Potentially Enter World War III Procrastination: 3 Links to Your Mental HealthbyJennifer Barns Procrastination: 3 Links to Your Mental Health Procrastination: 3 Links to Your Mental Health **Copyright Info** Exposing The Truth (ETT) believes that information should be freely available to all, but we also believe that sources should be properly credited and that intellectual property rights should be respected. ETT and its content is protected by international copyright law. In accessing and using exposingtruth.com and related sites, you agree that you may not download content except for personal, non-commercial reference. **Pages** About Us Privacy Policy & Disclaimer **Email Mailing List** Facebook Google+ RSS Twitter YouTube **Recent Posts** Goldendoodle Puppies: The Ultimate Guide for New Owners 4 Ways Learning an Instrument Can Improve Your Life 3 Handy Tips for Learning Legal Jargon 3 Things To Do When Witnessing Road Rage 3 Tips For Staying Safe When Driving Through Construction Zones 4 Preparations to Make As We Potentially Enter World War III Procrastination: 3 Links to Your Mental Health 3 Things to Do When You Suspect A Company of Being Shady **** **** ****"}