{"id": 1512, "name": "Milledgeville Union-Recorder", "domain": "unionrecorder.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://unionrecorder.com/2025/05/31/new-pathway-to-lpn-licensure-for-military-medical-personnel-approved-at-cgtc/", "title": "New Pathway To Lpn Licensure For Military Medical Personnel Approved At Cgtc", "content": "Home E-Edition NewsLifestylesBusinessCrime DigestSubmit a News Item Lifestyles Business Crime DigestSubmit a News Item Submit a News Item Lifestyles Business Crime DigestSubmit a News Item Submit a News Item Submit a News Item Election 2024 Obituaries SportsLocal SportsNational Sports Local Sports National Sports Local Sports National Sports OpinionColumnsEditorialsLetters to the Editor Columns Editorials Letters to the Editor Columns Editorials Letters to the Editor 2025 Readers’ Choice ServicesContact UsPurchase photos Contact Us Purchase photos Contact Us Purchase photos Classifieds Public NoticesGeorgia Notices Georgia Notices Georgia Notices Home News Obituaries Opinion Sports E-Edition Contact Us Scene 2025 Readers’ Choice **New pathway to LPN licensure for military medical personnel approved at CGTC** Published 7:00 am Saturday, May 31, 2025 By Special to The U-R In May, the Georgia Board of Nursing (GBON) officially approved the implementation of the Military Medical Personnel to Licensed Practical Nurse (LPN) Transition Program for Central Georgia Technical College (CGTC), which is set to launch in fall semester 2025. This decision follows the passage of Senate Bill 449 during the 2024 Georgia Legislative Session, which amended the Official Code of Georgia to introduce new, streamlined licensure pathways for qualified military medics, medical technicians, and corpsmen. The new program at CGTC is designed to recognize the service and extensive healthcare experience of military medical personnel by offering a bridge between military and civilian healthcare careers. With GBON’s guidance, and collaboration with the Department of Veterans Services, this initiative builds on military medical training and allows for career growth after re-entering the civilian sector. **Email newsletter signup** The program provides the additional education required to prepare participants for the responsibilities and scope of practice of a Licensed Practical Nurse in Georgia. Home News Opinion Sports Newsletter Signup e-Edition Subscriptions Purchase Photos Classifieds Public Notices Georgia Public Notices About Us Contact Us"}