{"id": 1212, "name": "San Diego Union Tribune", "domain": "sandiegouniontribune.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.sandiegouniontribune.com/2025/06/10/council-passes-san-diego-budget-that-restores-library-hours-fire-rings-and-more-but-at-a-cost-to-some-city-workers/", "title": "Council Passes San Diego Budget That Restores Library Hours Fire Rings And More But At A Cost To Some City Workers", "content": "e-Edition e-Edition About UsAbout UsOur JournalismCommunity Advisory BoardContact the Newsroom About Us Our Journalism Community Advisory Board Contact the Newsroom About Us Our Journalism Community Advisory Board Contact the Newsroom eNewspaperThe San Diego Union-TribuneCarmel Valley NewsDel Mar TimesEncinitas AdvocateLa Jolla LightPB MonthlyPoint Loma OB MonthlyPoway News ChieftainRamona SentinelRancho Bernardo NewsRancho Santa Fe ReviewSolana Beach Sun The San Diego Union-Tribune Carmel Valley News Del Mar Times Encinitas Advocate La Jolla Light PB Monthly Point Loma OB Monthly Poway News Chieftain Ramona Sentinel Rancho Bernardo News Rancho Santa Fe Review Solana Beach Sun The San Diego Union-Tribune Carmel Valley News Del Mar Times Encinitas Advocate La Jolla Light PB Monthly Point Loma OB Monthly Poway News Chieftain Ramona Sentinel Rancho Bernardo News Rancho Santa Fe Review Solana Beach Sun ColumnistsNick CanepaLisa DeaderickTom KrasovicBryce MillerMichael Smolens Nick Canepa Lisa Deaderick Tom Krasovic Bryce Miller Michael Smolens Nick Canepa Lisa Deaderick Tom Krasovic Bryce Miller Michael Smolens NewsLocal NewsBorder & Baja CaliforniaCrime and Public SafetyCourtsEducationEnvironmentHealthImmigrationLocal PoliticsMilitaryNational PoliticsNational NewsPoliticsScienceTransportationWatchdogWorld News Local News Border & Baja California Crime and Public Safety Courts Education Environment Health Immigration Local Politics Military National Politics National News Politics Science Transportation Watchdog World News Local News Border & Baja California Crime and Public Safety Courts Education Environment Health Immigration Local Politics Military National Politics National News Politics Science Transportation Watchdog World News Local NewsSan Diego CountySan DiegoNorth CountyEast CountySouth County San Diego County San Diego North County East County South County San Diego County San Diego North County East County South County BusinessBusinessBiotechGrowth & DevelopmentEconomyEnergyReal EstateRestaurants, Food and DrinkTechnologyTourismBest Reviews Business Biotech Growth & Development Economy Energy Real Estate Restaurants, Food and Drink Technology Tourism Best Reviews Business Biotech Growth & Development Economy Energy Real Estate Restaurants, Food and Drink Technology Tourism Best Reviews OpinionOpinionCommunity VoicesCommentaryEditorialsLetters to the EditorEditorial Board Opinion Community Voices Commentary Editorials Letters to the Editor Editorial Board Opinion Community Voices Commentary Editorials Letters to the Editor Editorial Board SportsSportsSDSU AztecsSan Diego PadresSan Diego FCSan Diego Wave FCHigh School SportsChargers/RamsTorerosSan Diego GullsGolfFantasy Sports Sports SDSU Aztecs San Diego Padres San Diego FC San Diego Wave FC High School Sports Chargers/Rams Toreros San Diego Gulls Golf Fantasy Sports Sports SDSU Aztecs San Diego Padres San Diego FC San Diego Wave FC High School Sports Chargers/Rams Toreros San Diego Gulls Golf Fantasy Sports Things to doThings to doAmusement ParksArtsBooksCasinosRecipesHome and GardenMoviesMusic and ConcertsRestaurants, Food and DrinkTheaterTravelTV and StreamingUT Store Things to do Amusement Parks Arts Books Casinos Recipes Home and Garden Movies Music and Concerts Restaurants, Food and Drink Theater Travel TV and Streaming UT Store Things to do Amusement Parks Arts Books Casinos Recipes Home and Garden Movies Music and Concerts Restaurants, Food and Drink Theater Travel TV and Streaming UT Store Weather U-T En Español Del Mar Times Encinitas Advocate La Jolla Light Pacific San Diego PB Monthly Point Loma OB Monthly Pomerado News Rancho Santa Fe Review Ramona Sentinel U-T Community PressDel Mar TimesEncinitas AdvocateLa Jolla LightPB MonthlyPoint Loma OB MonthlyPomerado NewsRamona SentinelRancho Santa Fe Review Del Mar Times Encinitas Advocate La Jolla Light PB Monthly Point Loma OB Monthly Pomerado News Ramona Sentinel Rancho Santa Fe Review Del Mar Times Encinitas Advocate La Jolla Light PB Monthly Point Loma OB Monthly Pomerado News Ramona Sentinel Rancho Santa Fe Review Pacific San Diego Together San Diego ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary Comics and Games Subscriber ServicesManage SubscriptionEZ PayVacation StopDelivery Issue Manage Subscription EZ Pay Vacation Stop Delivery Issue Manage Subscription EZ Pay Vacation Stop Delivery Issue Sponsored Content Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint The T.E.A. Advertise with Us Get the latest news in your inbox! **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email Click to share on Reddit (Opens in new window)Reddit Subscribe Login Get the latest news in your inbox! Subscribe Login e-Edition e-Edition News Trending: 🍔 Father's Day options ♻️ San Diego OKs trash fee 📚 Newest Barnes & Noble 🎡 2025 San Diego County Fair 🎶 State of music: 5 years after COVID **Council passes San Diego budget that restores library hours, fire rings and more — but at a cost to some city workers** **Mayor Todd Gloria said all the new spending makes him unsure if he'll sign it or try to make changes.** **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email Click to share on Reddit (Opens in new window)Reddit The San Diego City Council approved a budget Tuesday that reversed the mayor’s proposed cuts to libraries, recreation centers and reservoir activities by boosting city revenues and eliminating several middle-management jobs. The council voted 7-2 for a compromise budget that also adds crucial funding forbrush managementto prevent wildfires, asafe parking lot for homeless familiesat the former Central Elementary and a backlog of neededflood channel clearing. The new $2.15 billion general fund budget, which covers the fiscal year that starts July 1, also restores money for many public restrooms in city parks anduses county money to restore funding for beach fire rings. The city’s independent budget analyst expressed concern about all the funding restorations and new spending, warning council members that many of the new revenues are uncertain and based on optimism. The analyst, Charles Modica, said the budget makes San Diego particularly vulnerable to an economic recession, which would shrink tax revenues and force immediate cuts or significantly deplete the city’s roughly $200 million in remaining reserves. Mayor Todd Gloria said Tuesday night that all the new spending and related moves by the council make him unsure whether he’ll sign the budget or try to make changes. The mayor can usehis line-item veto powerto eliminate new spending and make other changes. But the council can override such vetoes with votes from six members — one member fewer than approved the budget Tuesday. The primary sources of the new revenue, which total about $10 million, would be plans to startcharging for parking in Balboa Park and at the San Diego Zoosooner than expected, charging credit card fees at city parking meters and allowing digital billboards in the city. The budget restorations also rely on $2.7 million in cuts to management positions, including two communications officials and program coordinators and deputy directors in several other departments. The management cuts aggressively target the mayor’s office, including a confidential secretary position budgeted at $133,000 and two deputy chief operating officer jobs budgeted at $400,000 each in total pay. Deputy City Attorney Leslie Fitzgerald said it’s unclear whether the council has the power to be so precise about job cuts. “Under the city charter, the council has the authority to set the budget, including funding or defunding certain positions,” she said. “However, the charter does not give the council the authority to direct the mayor to fill positions or fire employees in those positions. That authority rests solely with the mayor.” Tuesday’s budget vote culminates months of debate and public protest prompted mostly by Gloria’s proposals to shut down all city libraries on Sundays and Mondays and to significantly reduce recreation center hours. The budget approved Tuesday leaves the Sunday library closures in place but restores Monday hours fully at 16 of the city’s 37 branches, many of them in low-income neighborhoods. The budget completely restores all proposed cuts to recreation centers. It also fully restores funding for boating and other activities at all city reservoirs, including Lake Murray and Lake Miramar. The main architects of the compromise budget — Councilmembers Henry Foster, Sean Elo-Rivera, Joe LaCava and Kent Lee — said at a Tuesday afternoon news conference the last-minute changes help prevent damage to low-income areas. “We’re restructuring management, responsibly generating revenue, and as a result we’re restoring parks, libraries and lakes,” Lee said. “These changes are targeted, tactical and tailored to help San Diego families who rely on the city the most.” Elo-Rivera said the efforts to boost revenue are crucial and timely. “This budget is not only responsible, but it meets the needs of our community at an incredibly trying time,” he said. “We are asking visitors to this city to chip in when they are visiting a treasure like Balboa Park, to no longer treat our city like a free playground. While we’re not restoring everything we’d like to restore, this is a giant step forward.” Councilmember Jennifer Campbell, who was joined in opposition by Councilmember Vivian Moreno, said she has major concerns about the reliability of the new revenues proposed Tuesday by her colleagues. “I am not convinced that entire list of things can be paid for in this particular budget,” Campbell said. “I don’t want us to get into a situation where we are spending much more than we have.” Moreno said she supports most of Tuesday’s changes but voted “no” because the budget doesn’t includeadequate money to plan future stormwater channel clearingto prevent floods. Modica, the budget analyst, expressed similar concerns to Campbell. “I’ve highlighted the potential risks associated with these revenues,” he said. “They may come to fruition. If they do not, I do want to be clear that we will be forced to tap into reserves or have cuts in the middle of the year.” Modica also talked about a possible recession. “This risk of an economic downturn, or even a full recession, is heightened,” he said. “There is very little buffer built into the budget to be able to absorb continued declines (in revenue).” Modicahas also expressed concernsabout budget projections he says are questionable, such as estimates that police and fire overtime pay will be $20 million lower in the new fiscal year than in the ongoing fiscal year. A spokesperson for the mayor, Rachel Laing, said in a news release that the mayor is also concerned about the budget the council adopted Tuesday. “The council added tens of millions of dollars in new spending and changes, many of which raised concerns from both the independent budget analyst and the City Attorney’s Office,” Laing said. The mayor has five days either to sign the budget or to issue line-item vetoes. “Over the next several days, the mayor and his team will closely review the council’s amendments to ensure the final budget meets the level of fiscal responsibility this moment demands, especially given the current economic uncertainty and global instability,” Laing said. The budget angst this spring is the result of San Diego facing itslargest projected deficit in more than a decade— a $258 million gap that increased to $350 million as revenues declined this spring. The deficit has been blamed on a series of pay raises totaling about 23% that were given to most employees in 2023 and to voters’ November rejection of a one-cent sales tax hike that would have raised $400 million a year. Gloria closed the gap with $100 million in cuts, with between $150 million and $200 million in new revenues from parking and other fees and by canceling $64 million in scheduled reserve contributions. The 16 library branches slated for full Monday service under the budget approved Tuesday are Allied Gardens, downtown, Carmel Valley, Logan Heights, Oak Park, City Heights, Rolando, Linda Vista, Mira Mesa, Point Loma, Rancho Bernardo, San Ysidro, Skyline, Valencia Park, North Park and University Heights. **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email Click to share on Reddit (Opens in new window)Reddit **RevContent Feed** **Most Popular** Need a homeless shelter bed? There’s now an app for that.Need a homeless shelter bed? There’s now an app for that. **Need a homeless shelter bed? There’s now an app for that.** **Need a homeless shelter bed? There’s now an app for that.** Council passes San Diego budget that restores library hours, fire rings and more — but at a cost to some city workersCouncil passes San Diego budget that restores library hours, fire rings and more — but at a cost to some city workers **Council passes San Diego budget that restores library hours, fire rings and more — but at a cost to some city workers** **Council passes San Diego budget that restores library hours, fire rings and more — but at a cost to some city workers** Divided San Diego City Council OKs $44-a-month trash pickup fee, city’s first everDivided San Diego City Council OKs $44-a-month trash pickup fee, city’s first ever **Divided San Diego City Council OKs $44-a-month trash pickup fee, city’s first ever** **Divided San Diego City Council OKs $44-a-month trash pickup fee, city’s first ever** Story raises crucial questions about future of La Jolla CoveStory raises crucial questions about future of La Jolla Cove **Story raises crucial questions about future of La Jolla Cove** **Story raises crucial questions about future of La Jolla Cove** ‘Mayday, mayday’: Pilot reported problem before plane crashed off San Diego coast‘Mayday, mayday’: Pilot reported problem before plane crashed off San Diego coast **‘Mayday, mayday’: Pilot reported problem before plane crashed off San Diego coast** **‘Mayday, mayday’: Pilot reported problem before plane crashed off San Diego coast** San Diego’s newest Barnes & Noble opening near a college campus, public transit and movie theaterSan Diego’s newest Barnes & Noble opening near a college campus, public transit and movie theater **San Diego’s newest Barnes & Noble opening near a college campus, public transit and movie theater** **San Diego’s newest Barnes & Noble opening near a college campus, public transit and movie theater** Dylan Cease, offense give bullpen a rest as Padres rout Dodgers, even seriesDylan Cease, offense give bullpen a rest as Padres rout Dodgers, even series **Dylan Cease, offense give bullpen a rest as Padres rout Dodgers, even series** **Dylan Cease, offense give bullpen a rest as Padres rout Dodgers, even series** Noted Scripps researcher considering move after federal grant is canceledNoted Scripps researcher considering move after federal grant is canceled **Noted Scripps researcher considering move after federal grant is canceled** **Noted Scripps researcher considering move after federal grant is canceled** Former El Cajon official fails to appear for 8-day jail termFormer El Cajon official fails to appear for 8-day jail term **Former El Cajon official fails to appear for 8-day jail term** **Former El Cajon official fails to appear for 8-day jail term** Jon Wilner: Media rights, expansion next for Pac-12 after House settlementJon Wilner: Media rights, expansion next for Pac-12 after House settlement **Jon Wilner: Media rights, expansion next for Pac-12 after House settlement** **Jon Wilner: Media rights, expansion next for Pac-12 after House settlement** **More in Politics** Kennedy names 8 vaccine committee replacements, including COVID shot critic **Kennedy names 8 vaccine committee replacements, including COVID shot critic** **Kennedy names 8 vaccine committee replacements, including COVID shot critic** Judge says government must release Columbia University protester Mahmoud Khalil **Judge says government must release Columbia University protester Mahmoud Khalil** **Judge says government must release Columbia University protester Mahmoud Khalil** Hundreds of laid-off CDC employees are being reinstated **Hundreds of laid-off CDC employees are being reinstated** **Hundreds of laid-off CDC employees are being reinstated** Members of the Fulbright scholarship board resign, accusing Trump of meddling **Members of the Fulbright scholarship board resign, accusing Trump of meddling** **Members of the Fulbright scholarship board resign, accusing Trump of meddling** **Events** 2025 June 10 SubscribeSign Up For NewslettersE-EditionBreaking News Sign Up For Newsletters E-Edition Breaking News Sign Up For Newsletters E-Edition Breaking News MarketplaceClassifiedsObituariesLegalsLocal Job Board Classifieds Obituaries Legals Local Job Board Classifieds Obituaries Legals Local Job Board About The San Diego Union-TribuneAbout Southern California News GroupMediaNews GroupWork with usPrivacy PolicyAccessibilityNews Archive About Southern California News Group MediaNews Group Work with us Privacy Policy Accessibility News Archive About Southern California News Group MediaNews Group Work with us Privacy Policy Accessibility News Archive Advertising SolutionsGet in Touch with a Marketing Strategist Get in Touch with a Marketing Strategist Get in Touch with a Marketing Strategist PartnersSponsor a Student Sponsor a Student Sponsor a Student Contact UsCorrectionsContact NewsroomPhoto reprintsSDUT StoreReader rewardsSponsored Access Corrections Contact Newsroom Photo reprints SDUT Store Reader rewards Sponsored Access Corrections Contact Newsroom Photo reprints SDUT Store Reader rewards Sponsored Access Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}