{"id": 1123, "name": "Pottstown Mercury", "domain": "pottsmerc.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.pottsmerc.com/2025/06/10/piaa-4a-baseball-pope-john-paul-ii-derailed-by-five-run-fifth-inning-in-season-ending-loss-to-montoursville-in-state-semis/", "title": "Piaa 4a Baseball Pope John Paul Ii Derailed By Five Run Fifth Inning In Season Ending Loss To Montoursville In State Semis", "content": "E-Edition E-Edition NewsNewsLocal NewsCoronavirusNational NewsHealthElectionBusinessBest Reviews News Local News Coronavirus National News Health Election Business Best Reviews News Local News Coronavirus National News Health Election Business Best Reviews SportsSportsHigh School SportsPhiladelphia 76ersPhiladelphia EaglesPhiladelphia FlyersPhiladelphia PhilliesPhiladelphia Union Sports High School Sports Philadelphia 76ers Philadelphia Eagles Philadelphia Flyers Philadelphia Phillies Philadelphia Union Sports High School Sports Philadelphia 76ers Philadelphia Eagles Philadelphia Flyers Philadelphia Phillies Philadelphia Union Things to DoThings to DoEntertainmentRestaurants Food and DrinkMoviesMusic and ConcertsTV ListingsComicsPuzzlesEvents Things to Do Entertainment Restaurants Food and Drink Movies Music and Concerts TV Listings Comics Puzzles Events Things to Do Entertainment Restaurants Food and Drink Movies Music and Concerts TV Listings Comics Puzzles Events Opinion ObituariesObituariesNews Obituaries Obituaries News Obituaries Obituaries News Obituaries ClassifiedsClassifiedsJobsPublic Notices Classifieds Jobs Public Notices Classifieds Jobs Public Notices Special Sections Contests Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Subscribe Log In Logout Sign up for email newsletters to submit an obituary To place an obituary Monday through Friday, 8:30am to 4:00pm, please email obits@pottsmerc.com or call us at 610-235-2690 for further information. Saturday & Sunday, please contact obits@pottsmerc.com **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Subscribe Log in Sign up for email newsletters Subscribe Log in E-Edition E-Edition High School Sports 76ers Eagles Flyers Phillies Union TRENDING: Montco primary election results Volleyball will be the star at 33rd annual Pottstown Rumble **PIAA-4A BASEBALL: Pope John Paul II derailed by five-run fifth inning in season-ending loss to Montoursville in state semis** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Before the bottom suddenly and completely dropped out of Pope John Paul II’s baseball season, there were subtler signs that a trip to the state championship game later this week was not in the cards. There was the throwing error by starting pitcher Carson Glose in the second inning on a pickoff attempt that moved two runners up a base, allowing the game’s first run to score shortly after on a sacrifice fly. There was also the hard-hit ball with the bases loaded in the bottom of the second from PJP second baseman Luca Dimaio that turned into a 4-6-3 double play. There were fly balls to the warning track and a missed tag by an umpire that extended the opponent’s big inning that would come later. Then, as the little things started to pile up into one big thing, it started to become clear that the usually-reliable Golden Panthers were not going to survive this inopportunely bad day. “It was 1-0 going into the top of the fifth inning,” said PJP head coach Charles Deluzio by phone Monday night, “then the wheels fell off the bus.” The bus to the PIAA-4A semifinals took the Golden Panthers to North Schuylkill High School in Ashland on Monday to battle District 4 champion Montoursville. Red-hot PJP, which claimed the 4A district title and had won its first two games of the state tournament with relative ease, had hoped to ride its latest win streak to its first PIAA championship game appearance since 2014. But a five-run Montoursville fifth inning derailed that dream on Monday, as Warriors starting pitcher Logan Kirby kept the powerful PJP lineup off balance all day, firing a six-hit, complete-game shutout in a 6-0 Montoursville victory. The Warriors (20-4) will take on either District 3’s East Pennsboro or District 7’s Indiana in Friday’s state title game at Penn State University. Two walks and the failed pickoff in the second slightly knocked Glose off his feet, but through four innings he had only allowed a total of one run, two walks and two hits. It was a ballgame, even if PJP (19-5) loaded the bases and coming away empty-handed in the second inning was not a harbinger of good things to come. After lashing double-digit hits in their previous three games, the Golden Panthers managed just six hits from three players. Everybody else was playing the guessing game against Kirby, who only struck out four but kept hitters off balance with crafty finesse. “Kirby was very good for them,” Deluzio said. “Mid-80s fastball with a great slider and offspeed stuff that kept us off balance. We hit some balls hard, but they were more in the air than line drives. We played the right guys in our lineup – they just shut us down. Sometimes a good pitcher does that, and today was that day.” With Kirby locked in and dealing, Montoursville dealt the fatal blow in the fifth inning. Brayden McCourt doubled to lead off the inning and got to third base on a bunt single from Michael Reeder. Royce Bowes’ RBI single to right made it 2-0. A sacrifice bunt, intentional walk and fly out loaded the bases with two outs, but three consecutive RBI singles courtesy of Jimmy Mussina, Zack Neill and Jonah Heddings made it 6-0 Warriors before Glose could fully extinguish the blaze. “They grind out at-bats very well,” Deluzio said. “They put it in play, bunted well, moved runners – that’s a good baseball team. Carson had his slider over but they sat on his fastball and the next thing you know it’s 5, 6-0. We hit some balls hard but didn’t get the key hit when we needed it. All I can say is we were knocking on the door but couldn’t kick it in. They were the better team today; we were loose and ready to play, but it just didn’t materialize.” PJP will sustain heavy losses to graduation in the form of nine seniors, though the exodus of left fielder Luke Terlesky, shortstop AJ Diaddezio, third baseman Chase Frantz, catcher Nik Deforge and second baseman Dimaio will be felt the most. Terlesky and Frantz accounted for five of the team’s six hits on Monday and are PJP’s strongest power hitters. Diaddezio went hitless but pitched two scoreless innings after Montoursville chased Glose from the game and is the team’s leadoff hitter, starting shortstop and heartbeat. Dimaio is a strong defender at second base who vastly improved as a hitter this season, and Deforge was the starting catcher for a strong pitching staff. This senior core helped PJP log two district titles in 2023 and 2025 and advanced farther into the state tournament than any other baseball team at the school has in a decade. “Those guys all played three or four years and turned the program around to where it’s at,” said Deluzio, who also praised assistants Jon Wowak and Zach Smiley for a job well done. “Replacing AJ, Luke and Chase’s bats will be tough, and I love this senior class – they’ve been with me forever and play the game the right way. Those guys are some of my favorites ever.” The return of juniors-to-be Glose and Tyler Tindall as the team’s top two starting pitchers will help speed the re-acclimation project up, and both of those players also hit at the top or in the middle of the lineup. Blaise Desanto, Hunter Mishock and Sam Buckley all took steps forward this season and will be back, leaving Deluzio to believe that PJP has another strong two-year window of contention ahead of it. “We’re ready to make a run again with Glose and Tindall and a couple of others who will step up,” Deluzio said. “We have a good core coming back. I’m ready to go again and can’t wait to get started in January.” Montoursville 6, Pope John Paul II 0 Montoursville 0 1 0 0 5 0 0 – 6 9 0 Pope John Paul II 0 0 0 0 0 0 0 – 0 6 1 WP: Logan Kirby 7IP, 6H, 0R, BB, 4K LP: Carson Glose 5IP, 8H, 6ER, 3BB, K 2B: MV- Brayden McCourt; PJP- Chase Frantz **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X **Most Popular** Limerick man convicted of stalking, harassing girl he met in high schoolLimerick man convicted of stalking, harassing girl he met in high school **Limerick man convicted of stalking, harassing girl he met in high school** **Limerick man convicted of stalking, harassing girl he met in high school** Montgomery County Coroner releases identity of Schuylkill River drowning victimMontgomery County Coroner releases identity of Schuylkill River drowning victim **Montgomery County Coroner releases identity of Schuylkill River drowning victim** **Montgomery County Coroner releases identity of Schuylkill River drowning victim** Hebert chosen from among six for Pottsgrove School Board vacancyHebert chosen from among six for Pottsgrove School Board vacancy **Hebert chosen from among six for Pottsgrove School Board vacancy** **Hebert chosen from among six for Pottsgrove School Board vacancy** Wawa to open newest Montgomery County storeWawa to open newest Montgomery County store **Wawa to open newest Montgomery County store** **Wawa to open newest Montgomery County store** Pottstown Juneteenth celebration Saturday has ‘family reunion’ themePottstown Juneteenth celebration Saturday has ‘family reunion’ theme **Pottstown Juneteenth celebration Saturday has ‘family reunion’ theme** **Pottstown Juneteenth celebration Saturday has ‘family reunion’ theme** PIAA-6A SOFTBALL: Perkiomen Valley’s 24-win season ends with 2-0 setback to Central Dauphin in state semifinalsPIAA-6A SOFTBALL: Perkiomen Valley’s 24-win season ends with 2-0 setback to Central Dauphin in state semifinals **PIAA-6A SOFTBALL: Perkiomen Valley’s 24-win season ends with 2-0 setback to Central Dauphin in state semifinals** **PIAA-6A SOFTBALL: Perkiomen Valley’s 24-win season ends with 2-0 setback to Central Dauphin in state semifinals** Montgomery County food safety inspections found damaged floors and pooling waterMontgomery County food safety inspections found damaged floors and pooling water **Montgomery County food safety inspections found damaged floors and pooling water** **Montgomery County food safety inspections found damaged floors and pooling water** PIAA-4A BASEBALL: Pope John Paul II derailed by five-run fifth inning in season-ending loss to Montoursville in state semisPIAA-4A BASEBALL: Pope John Paul II derailed by five-run fifth inning in season-ending loss to Montoursville in state semis **PIAA-4A BASEBALL: Pope John Paul II derailed by five-run fifth inning in season-ending loss to Montoursville in state semis** **PIAA-4A BASEBALL: Pope John Paul II derailed by five-run fifth inning in season-ending loss to Montoursville in state semis** Norristown High School graduation honors immigration as opportunity through sacrifice [Photos]Norristown High School graduation honors immigration as opportunity through sacrifice [Photos] **Norristown High School graduation honors immigration as opportunity through sacrifice [Photos]** **Norristown High School graduation honors immigration as opportunity through sacrifice [Photos]** Owen J. Roberts High School graduates 450Owen J. Roberts High School graduates 450 **Owen J. Roberts High School graduates 450** **Owen J. Roberts High School graduates 450** **More in High School Sports** Defense powers Shanahan past Manheim Twp. and into state final **Defense powers Shanahan past Manheim Twp. and into state final** **Defense powers Shanahan past Manheim Twp. and into state final** PIAA 2A girls lacrosse: Villa Maria tops Wyomissing to earn first state final berth in six years **PIAA 2A girls lacrosse: Villa Maria tops Wyomissing to earn first state final berth in six years** **PIAA 2A girls lacrosse: Villa Maria tops Wyomissing to earn first state final berth in six years** PIAA-5A BASEBALL: Upper Dublin meets Shaler in state championship game **PIAA-5A BASEBALL: Upper Dublin meets Shaler in state championship game** **PIAA-5A BASEBALL: Upper Dublin meets Shaler in state championship game** PIAA-6A SOFTBALL: Perkiomen Valley’s 24-win season ends with 2-0 setback to Central Dauphin in state semifinals **PIAA-6A SOFTBALL: Perkiomen Valley’s 24-win season ends with 2-0 setback to Central Dauphin in state semifinals** **PIAA-6A SOFTBALL: Perkiomen Valley’s 24-win season ends with 2-0 setback to Central Dauphin in state semifinals** 2025 June 10 MediaNews GroupThe MercuryDaily Local NewsThe Times HeraldThe ReporterThe TrentonianReading EagleDelaware Co Daily Times The Mercury Daily Local News The Times Herald The Reporter The Trentonian Reading Eagle Delaware Co Daily Times The Mercury Daily Local News The Times Herald The Reporter The Trentonian Reading Eagle Delaware Co Daily Times Subscriber ServicesSign Up For Newsletterse-EditionSubmit Letter to the EditorSubmit Announcements Sign Up For Newsletters e-Edition Submit Letter to the Editor Submit Announcements Sign Up For Newsletters e-Edition Submit Letter to the Editor Submit Announcements About UsContact UsWork With UsPrivacy PolicyAccessibilitySitemap Contact Us Work With Us Privacy Policy Accessibility Sitemap Contact Us Work With Us Privacy Policy Accessibility Sitemap ClassifiedsJobsPublic NoticesNetwork AdvertisingPlace Classified AdAdvertising Inquiry Jobs Public Notices Network Advertising Place Classified Ad Advertising Inquiry Jobs Public Notices Network Advertising Place Classified Ad Advertising Inquiry Subscribe Now Terms of Use Cookie Policy Cookie Preferences Do Not Sell/Share My Personal Information Notice of Financial Incentive California Notice at Collection Arbitration MediaNews Group Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}