{"id": 908, "name": "Middlesboro Daily News", "domain": "middlesboronews.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://middlesboronews.com/2025/06/11/skctc-and-lindsey-wilson-college-expand-counseling-degree-partnership-to-middlesboro/", "title": "Skctc And Lindsey Wilson College Expand Counseling Degree Partnership To Middlesboro", "content": "Home E-Edition News Sports Opinion Obituaries Features Classifieds Public Notices Contests Services Calendar Home News Sports Opinion Obituaries Features Classifieds Public Notices Contests Calendar ServicesAbout UsPoliciesNews TipSubmit PhotoEngagement AnnouncementWedding AnnouncementAnniversary AnnouncementLetter to EditorSubmit an Obituary About Us Policies News Tip Submit Photo Engagement Announcement Wedding Announcement Anniversary Announcement Letter to Editor Submit an Obituary About Us Policies News Tip Submit Photo Engagement Announcement Wedding Announcement Anniversary Announcement Letter to Editor Submit an Obituary E-Edition **SKCTC and Lindsey Wilson College expand counseling degree partnership to Middlesboro** Published 10:25 am Wednesday, June 11, 2025 BySpecial to The Middlesboro News Building on a decades-long partnership, Southeast Kentucky Community & Technical College and Lindsey Wilson College have expanded their agreement to offer a new hybrid human services and counseling degree program on the Middlesboro campus. The initiative provides a flexible weekend-format bachelor’s degree program tailored for adult learners. The announcement reflected a shared commitment to serving students who prefer face-to-face learning environments and are seeking careers in mental health and addiction recovery. “This is an amazing opportunity to bring higher education partners together in a way that truly supports adult learners,” said Dr. Patsy Jackson, interim president of SKCTC. “Many students want the support of a cohort and the in-person classroom experience, and this program delivers exactly that.” **Email newsletter signup** The Middlesboro site joined the long-established LWC program at SKCTC’s Cumberland campus. Leaders from both institutions emphasized that the new cohort represents an expansion, not a relocation. Dr. Tommie Ann Saragas, assistant vice president of educational outreach for online and graduate programs at Lindsey Wilson College, called the launch “deeply personal,” noting that she and Regional Academic Director Dr. Kimberly Brown were among the first adult learners to graduate from the Cumberland site. “We know how powerful this program can be—it changed our lives,” Sexton said. The hybrid format includes in-person weekend classes with continued online support. Jason Weaver, who currently leads enrollment for LWC’s Cumberland cohort, will serve in the same role at Middlesboro. A licensed counselor with experience in addiction recovery, Weaver will assist students with applications, financial aid, and academic support. “This partnership helps meet a critical need in our region,” said Dr. Lee Harrison, incoming president of SKCTC. “It aligns with our mission to serve the whole student and to be part of regional solutions—especially in mental health and recovery services.” The program builds on a 23-year transfer agreement between LWC and SKCTC institutions, offering students a seamless path from an associate degree to a bachelor’s or master’s degree in counseling. Fall enrollment is now open. For more information, contact Jason Weaver, LWC coordinator, at weaverj@lindsey.edu or call 606.589.3075. **You Might Like** **Lawson sentenced to 20 years after pleading to guilty to murder in Baby Elena case** **Lawson sentenced to 20 years after pleading to guilty to murder in Baby Elena case** **BSCD looking to identify hit and run individual/vehicle** **BSCD looking to identify hit and run individual/vehicle** **Bell Board approves tentative budget, no plans to consolidate** **Bell Board approves tentative budget, no plans to consolidate** **Bell County certified as Recovery Ready Community** **Bell County certified as Recovery Ready Community** Home News Sports Obituaries Opinion Contests Classifieds Small Business E-Edition Subscribe News Tip Submit Photo Submit Sports Story Letter to Editor Public Notices About Us Terms of Use"}