{"id": 1385, "name": "The Intercept", "domain": "theintercept.com", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://theintercept.com/2025/06/08/trump-national-guard-ice-immigration-protests-los-angeles/", "title": "Trump National Guard Ice Immigration Protests Los Angeles", "content": "Politics Justice War on Gaza Technology Immigration Chilling Dissent Special Investigations Voices Podcasts Videos Documents About Contact Us More Ways to Donate Impact & Reports Join Newsletter Jobs Become a Source © THE INTERCEPT ALL RIGHTS RESERVED Politics Justice War on Gaza Technology Immigration Chilling Dissent About Support Us **Trump’s Dangerous Decision to Suppress Anti-ICE Protests With Troops** The National Guard’s response to civilian protests has a deadly history made infamous by the Kent State massacre. Copy link Share on Facebook Share on Bluesky Share on X Share on LinkedIn Share on WhatsApp To suppress protestsagainst his deportation agenda, President Donald Trump took an extraordinary action on Saturday by calling up 2,000 National Guard troops to tamp down demonstrations in California. In doing so, he exercised rarely used federal powers, bypassed the authority of the state’s governor, Gavin Newsom, and set the stage for violent confrontation. Newsom, a Democrat,saidthe soldiers were unneeded and would only “escalate tensions.” Trump’s order came after protests broke out on Friday and continued through Saturday as federal agents searched Los Angeles’s garment district and other neighborhoods for undocumented immigrant workers. More protests are planned for Sunday afternoon. Any demonstration impeding immigration law enforcement would be considered a “form of rebellion,”according to Trump. “If Governor Gavin Newscum, of California, and Mayor Karen Bass, of Los Angeles, can’t do their jobs, which everyone knows they can’t, then the Federal Government will step in and solve the problem, RIOTS & LOOTERS, the way it should be solved!!!” Trumppostedto his Truth Social account, using his childish moniker for Newsom. The Trump administration’s move to further insert the military into domestic political and law enforcement activities carries immense risk. Militarizing an already tense situation increases the likelihood of civilian harm, threatens to chill civil liberties, and could irreparably damage civil–military relations. The White House did not respond to questions about the potential for escalating tensions, worries about violence, or whether Trump would take personal responsibility for any resulting casualties. **Most Read** The National Guardhas, at times, been tapped to stifle dissent. In 2020, Trump requested that the governors of multiple states deploy their National Guard troops to Washington, D.C., to suppress protests afterMinneapolis police killed George Floyd. Many governors agreed, and thousands of troops from 11 states were deployed to D.C. In 1992, President George H.W. Bush sent National Guard troops to Los Angeles to quell riots after police officers wereacquitted in the beating of Rodney King. That deployment was requested by California’s then-Gov. Pete Wilson. The Guard was federalized during the New York postal strike in 1970, following the assassination of Martin Luther King Jr. in 1968, and during the 1967 Detroit uprising. Presidents Dwight Eisenhower, John F. Kennedy, and Lyndon Johnson used the National Guard to help enforce civil rights during the 1950s and 1960s. But it is the 1970 deployment of the National Guard to crack down on anti-war protests in Kent, Ohio, that best illustrates the danger of involving the military in civilian law enforcement. “At times, their response has degenerated into uncontrolled violence.” That April, President Richard M. Nixon expanded the Vietnam War byinvading neighboring Cambodia, supercharging the anti-war movement. In Kent, protests in response led to vandalism and prompted Republican Gov. James Rhodes to deploy the Ohio National Guard. On May 4, Guardsmen opened fire on antiwar protesters at Kent State University, firing 67 rounds over a period of just 13 seconds, killing four students — Allison Krause, Jeffrey Miller, Sandra Scheuer, and William Knox Schroeder — and wounding nine others. The unrest that followed was unprecedented in American history. A national student strike involving more than1 million studentsat 450 colleges and universities followed. Close to 90 percent of campuses saw protests in the month after the Kent State killings, with4 millionparticipating. This included atJackson State College(now University) in Mississippi, where city and state police opened fire on student protesters and passersby on May 15, wounding 12 and killing law student Phillip Lafayette Gibbs and 17-year-old high school student James Earl Green. Nixon’s own Commission on Campus Unrest, established in the wake of the killings at Kent State and Jackson State, found that student discontent was fueled by the Vietnam War and exacerbated by officials. “Actions and inactions of government at all levels have contributed to campus unrest. The words of some political leaders have helped to inflame it. Law enforcement officers have too often reacted ineptly or overreacted,” according to the report. “At times, their response has degenerated into uncontrolled violence.” Trump’s activation of the California National Guard is the first time a president has done so without a request from a state’s governor since 1965, when President Lyndon B. Johnson sent troops to Alabama to protect civil rights demonstrators. **Related** **Federal Agents at Protests Renew Calls to Dismantle Homeland Security** **Related** **Federal Agents at Protests Renew Calls to Dismantle Homeland Security** During his first term in office, Trumpsuggested shooting protesters to quell dissent, according to his former secretary of defense, Mark Esper. “The president was enraged,” Esper recalled, amid the strife following George Floyd’s murder in 2020. “He thought that the protests made the country look weak, made us look weak and ‘us’ meant him.” Esper said that Trump looked to the chair of the Joint Chiefs of Staff General Mark Milley and said, “’Can’t you just shoot them, just shoot them in the legs or something?’” Esper characterized it as “a suggestion and a formal question.” During the last presidential campaign, Trump promised he would crack down on protests with troops. “You’re supposed to not be involved in that, you just have to be asked by the governor or the mayor to come in — the next time, I’m not waiting,”he said. **We’re independent of corporate interests — and powered by members. Join us.** **Join Our NewsletterThank You For Joining!** Original reporting. Fearless journalism. Delivered to you.Will you take the next step to support our independent journalism by becoming a member of The Intercept? By signing up, I agree to receive emails from The Intercept and to thePrivacy PolicyandTerms of Use. **Join Our Newsletter** **Original reporting. Fearless journalism. Delivered to you.** **Join Our Newsletter** **Original reporting. Fearless journalism. Delivered to you.** On Saturday, Trumporderedat least 2,000 National Guard members to Los Angeles County after protests flared in downtown Los Angeles; Paramount, a small city south of LA; and other neighborhoods. Some activists blocked traffic and confronted federal agents. Others slashed tires and defaced buildings, according to theDepartment of Homeland Security. Many carried signs, shouted in protest and kept their distance from federal officers. Law enforcement responded by hurling tear gas canisters and flash-bang grenades, and firingrubber bulletsat demonstrators. “They threw rocks at the officers,” said Bill Essayli, the interim U.S. attorney for the Central District of California. “We had Molotov cocktails thrown. We had all kinds of assaults on agents. The state has an obligation to maintain order and maintain public safety, and they’re unable to do that right now in Los Angeles. So the federal government will send in resources to regain order.” California’s attorney general, Rob Bonta, said local law enforcement did not require federal assistance. “There is no emergency and the President’s order calling in the National Guard is unnecessary and counterproductive,” hepostedon X. At least 20 people were arrested on Saturday, mostly in Paramount, in addition to the more than 100 people arrested at the protests on Friday, according to Essayli. As a third day of protests loomed, Trump issued asocial media rantthat took aim at Newsom, “Radical Left protests,” and mask-wearing demonstrators. He thanked the “National Guard for a job well done!” It was unclear what job the troops, who had not yet been seen on the streets, had done when Trump posted the comments on Sunday at 2:41 a.m. The White House did not respond to a request for clarification. White House spokesperson Karoline Leavitt said in astatementon Saturday night that Trump was deploying the National Guard in response to “violent mobs.” The 2,000 troops would “address the lawlessness that has been allowed to fester,”she said. Newsom rebuked the president’s order. “That move is purposefully inflammatory and will only escalate tensions,”he said, adding that “this is the wrong mission and will erode public trust.” Copy link Share on Facebook Share on Bluesky Share on X Share on LinkedIn Share on WhatsApp IT’S EVEN WORSE THAN WE THOUGHT. What we’re seeing right now from Donald Trump is a full-on authoritarian takeover of the U.S. government. This is not hyperbole. Court orders are being ignored. MAGA loyalists have been put in charge of the military and federal law enforcement agencies. The Department of Government Efficiency has stripped Congress of its power of the purse. News outlets that challenge Trump have been banished or put under investigation. Yet far too many are still covering Trump’s assault on democracy like politics as usual, with flattering headlines describing Trump as “unconventional,” “testing the boundaries,” and “aggressively flexing power.” The Intercept has long covered authoritarian governments, billionaire oligarchs, and backsliding democracies around the world. We understand the challenge we face in Trump and the vital importance of press freedom in defending democracy. **We’re independent of corporate interests. Will you help us?** **Contact the author:** **Related** **Trump Is Prosecuting a Congressional Democrat for Doing Her Job. The Media’s Response: No Big Deal.** **Trump Is Prosecuting a Congressional Democrat for Doing Her Job. The Media’s Response: No Big Deal.** **Trump Is Building a Global Gulag for Immigrants Captured by ICE** **Trump Is Building a Global Gulag for Immigrants Captured by ICE** **CECOT Is What the Bukele Regime Wants You to See** **CECOT Is What the Bukele Regime Wants You to See** **If Protesting Tesla Is Domestic Terrorism, Then What Demonstration Against Musk Isn’t** **If Protesting Tesla Is Domestic Terrorism, Then What Demonstration Against Musk Isn’t** **Latest Stories** Chilling Dissent **As 75 Democrats Vote to Praise ICE, Ilhan Omar Wants to Hold Police Accountable for Protest Abuses** Akela Lacy Trying to pass laws to defend protesters’ rights is a lonely battle on Capitol Hill. Chilling Dissent **As 75 Democrats Vote to Praise ICE, Ilhan Omar Wants to Hold Police Accountable for Protest Abuses** Akela Lacy Trying to pass laws to defend protesters’ rights is a lonely battle on Capitol Hill. **Feds Seek “Unprecedented” Sentence Boost for CIA Leaker, Leaning on His Use of Signal** Matt Sledge, Nikita Mazurov Asif William Rahman’s lawyers thought they had a deal. Now Trump’s prosecutors are asking for a super harsh sentence. **Feds Seek “Unprecedented” Sentence Boost for CIA Leaker, Leaning on His Use of Signal** Matt Sledge, Nikita Mazurov Asif William Rahman’s lawyers thought they had a deal. Now Trump’s prosecutors are asking for a super harsh sentence. Chilling Dissent **LAPD Won’t Do Immigration Enforcement — But Will Shoot You With Rubber Bullets for Protesting ICE** Jonah Valdez LA’s sanctuary laws ban cops from helping ICE in most cases. But the LAPD was out in full force repressing protests against the raids. Chilling Dissent **LAPD Won’t Do Immigration Enforcement — But Will Shoot You With Rubber Bullets for Protesting ICE** Jonah Valdez LA’s sanctuary laws ban cops from helping ICE in most cases. But the LAPD was out in full force repressing protests against the raids. About Support Us Join Newsletter Jobs Contact Us Policies Terms of Use Privacy © The Intercept. All rights reserved **Enter your email to keep reading for free.** This is not a paywall. By signing up, I agree to receive emails from The Intercept and to thePrivacy PolicyandTerms of Use. **Welcome! Will you take the next step to support The Intercept’s independent journalism by becoming a member?** **Thank you for joining! Will you take the next step to support The Intercept’s independent journalism by becoming a member?** **We’re independent of corporate interests. Will you join us?**"}