{"id": 2048, "name": "Daily Mirror", "domain": "mirror.co.uk", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.mirror.co.uk/sport/football/transfer-news/wrexham-ryan-reynolds-transfer-championship-35376289", "title": "Transfer News", "content": "**** **** News Celebs Football Lifestyle More Daily Mirror Icon Sport Football Ryan Reynolds **Ryan Reynolds urged to splash out and hand bumper contract to £3.5m Premier League star** **Wrexham's Hollywood owners, Ryan Reynolds and Rob McElhenney, are being encouraged to bolster their squad with a Premier League talent after securing a third consecutive promotion** Wrexham's owners have been urged to splash their Hollywood cash on a £3.5million-ratedPremier Leaguestar this summer.Ryan ReynoldsandRob McElhenneyare currently celebrating after their club achieved athird successive promotionin April, lifting them fromLeague Oneinto theChampionship. The two actors have been tipped to spend big during the transfer window as they look to provide managerPhil Parkinsonwith the backing to improve his squad.Wrexhamhave already been linked with several top flight stars, includingLeicester's Jamie VardyandWest HamduoAaron Cresswell and Danny Ings. The North Wales team are now being encouraged to make a bid forNottingham Forestmidfielder Lewis O'Brien, who impressed on loan atSwansea Cityin the second tier during the latter half of last season. The Swans are said to be interested in signing the 28-year-old permanently after he started 16 games for the club after arriving in January. However, O'Brien still has one year left on his contract and finances are said to be a major barrier preventing him from joining. Wrexham have also been the subject of reports connecting them with a move for O'Brien, and ex-Red Dragons and Swansea aceLee Trundlethinks he would make a big impact at the Racecourse Ground. Speaking on theFearless in Devotionpodcast, he said: \"Lewis wants to play further up the field and go and drive at players and make things happen. I think he would be a great addition. The only thing I would say about Lewis is he's still contracted to Forest, and he would be on a very good contract. \"It's whether the wages could get matched, because I know that was a stumbling point at Swansea. That's the other problem when you move into the Championship, because we're not only talking about the quality of the players, but the wages as well. \"It is a big chance to take on people if you give them a three year contract on so much [money]. That can also hurt you in a way, but I don't think the owners think like that. I do think that they just look forward and everything that they've said, they've been true to their word.\" Next season will mark the first time Wrexham have played in the second tier for 43 years. Some pundits have expressed scepticism over whether they will be able to push for an unprecedented fourth successive promotion. But Trundle said he would not rule out the possibility of Wrexham reaching the Premier League, despite cautioning them over the difficulty of competing in the Championship. He also called on the club's fans to stay united if results don't go their way initially. Welcome to Wrexham is back on Disney+ for a fourth season. Fans can watch the series with a£4.99 monthly plan, or get12 months for the price of 10by paying for a year upfront. \"I don't think it's unrealistic to think that way [about promotion], Trundle said. \"I went to a Bristol City side which had just been promoted out of League One, and we ended up getting to the Championship play-off final that year, where we got beaten by Hull. \"I wouldn't say it's out of reach, especially with the way Wrexham are doing as well. When you're used to winning and you've got a winning mentality, I think that goes a long way.But I would say that there could be some heavy defeats and you're not going to get everything the same way that you've had it for the last couple of years.\" He added: \"The most important thing now is for the fans to realise how far the club has come in that short space of time, and all stick together. You're going to need to strengthen going into the Championship. But I think fans around British football would love to be a Wrexham fan and in the position that the club is in.\" Join our new WhatsApp communityand receive your daily dose of Mirror Football content. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don't like our community, you can check out any time you like. If you're curious, you can read ourPrivacy Notice. **Sign up to our newsletter! Wrexham is the Game is great new way to get top-class coverage** Wrexham AFC is the arguably the fastest-growing club in the world at the moment thanks to a certain Ryan Reynolds and Rob McElhenney. The Dragons have achieved two consecutive promotions and are cheered on by crowds from not only North Wales but also from all over the globe, thanks to the success of the Disney+ documentary 'Welcome to Wrexham'. But does it have a dedicated, quality source of information piped through to your inbox each week, free of ads but packed with informed opinion, analysis and even a little bit of fun each week? That's where Wrexham is the Game steps in... Available every Wednesday, it provides all the insights you need to be a top red. And for a limited time, a subscription to 'Wrexham is the Game' will cost fans just £15 for the first year. Sign up forWrexham is the Game here Facebook X (Twitter) TikTok Instagram Snapchat News Politics Football TV Showbiz Weird News Family Sport Travel Life & Style Money Fashion Tech Mums Motoring Film **Follow Daily Mirror on socials:** Marketplace Find a job Shop InYourArea mynewsassistant Find a local business Style Store Beauty Box Subscription Mirror Bingo Yimbly Shop Online Games Crossword Solitaire Sudoku Mahjong Betting Free Bets Partner Stories About Us Contact Us Work for us Follow Us Sell Your Story Syndication & Licensing How to Complain Corrections & Clarifications Privacy Notice AI Notice Cookie Notice Terms and Conditions Notifications and alerts help Subscribe to Daily Mirror and Sunday Mirror newspapers Subscribe to tablet edition Newsletters preference centre Community Standards Irish Mirror **© 2025 a Reach plc subsidiary** AtReach and across our entitieswe and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the sale or sharing of your data, at any time clicking the \"Do Not Sell or Share my Data\" button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in ourPrivacy NoticeandCookie Notice."}