{"id": 1035, "name": "NPR", "domain": "npr.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.npr.org/2025/06/11/nx-s1-5429818/protests-grow-across-the-u-s-as-people-push-against-trumps-mass-deportation-policies", "title": "Protests Grow Across The U S As People Push Against Trumps Mass Deportation Policies", "content": "Skip to main content Keyboard shortcuts for audio player Open Navigation Menu Newsletters NPR Shop Home NewsExpand/collapse submenu for NewsNationalWorldPoliticsBusinessHealthScienceClimateRace National World Politics Business Health Science Climate Race National World Politics Business Health Science Climate Race CultureExpand/collapse submenu for CultureBooksMoviesTelevisionPop CultureFoodArt & DesignPerforming ArtsLife KitGaming Books Movies Television Pop Culture Food Art & Design Performing Arts Life Kit Gaming Books Movies Television Pop Culture Food Art & Design Performing Arts Life Kit Gaming MusicExpand/collapse submenu for MusicAll Songs ConsideredTiny DeskNew Music FridayMusic FeaturesLive Sessions All Songs Considered Tiny Desk New Music Friday Music Features Live Sessions All Songs Considered Tiny Desk New Music Friday Music Features Live Sessions Podcasts & ShowsExpand/collapse submenu for Podcasts & ShowsDailyMorning EditionWeekend Edition SaturdayWeekend Edition SundayAll Things ConsideredFresh AirUp FirstFeaturedEmbeddedThe NPR Politics PodcastThroughlineTrump's TermsMore Podcasts & Shows Morning Edition Weekend Edition Saturday Weekend Edition Sunday All Things Considered Fresh Air Up First Embedded The NPR Politics Podcast Throughline Trump's Terms More Podcasts & Shows Morning Edition Weekend Edition Saturday Weekend Edition Sunday All Things Considered Fresh Air Up First Embedded The NPR Politics Podcast Throughline Trump's Terms More Podcasts & Shows Search Newsletters NPR Shop All Songs Considered Tiny Desk New Music Friday Music Features Live Sessions About NPR Diversity Support Careers Press Ethics **National** **Protests grow across the U.S. as people push against Trump's mass deportation policies** By Sergio Martínez-Beltrán , Jasmine Garsd Download EmbedEmbed<iframe src=\"https://www.npr.org/player/embed/nx-s1-5429818/nx-s1-5490169-1\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\"> Transcript Thousands of people marched throughout the streets of Manhattan Tuesday night as part of a series of nationwide rallies against President Trump's immigration sweeps and the deployment of the U.S. military in California.Sergio Martínez-Beltrán/NPRhide caption NEW YORK — \"ICE out of New York!\" Those were the words thousands of people chanted near the city's Immigration and Customs Enforcement (ICE) field office, and throughout the streets of Manhattan Tuesday night as part of a series of nationwide rallies against President Trump's immigration sweeps and the deployment of the U.S. military in California. \"There are many voices in my community that can't be here today out of fear of what the administration is doing, so I want to be here for them,\" 19-year-old Jeanet told NPR as she joined hundreds of other protesters in lower Manhattan Tuesday night. She asked for her last name to not be included for fear of her safety. She said she wants to join the military, and that also played a role in her going to the protest. \"I feel like it's more important for me, as somebody who is going to be part of the government, to voice my opinion and show that there can be people that are for the U.S., but still against what this administration is doing today,\" Jeanete said. Across the country, protesters also took to the streets inChicago, San Francisco, andSeattle, Dallas and half a dozen other cities. The Trump administrationhas vowed to arrest 3,000 migrants a day. To accomplish that goal, the Department of Homeland Security has conducted raids all across the country — from a parking lot in aLos Angeles Home Depot, to aDominican neighborhood in Puerto Rico, toa meatpacking plant in Nebraska. In New York City, the protest was peaceful. That's a contrast with those in Los Angeles,where police and protesters clashedin some parts of townover the weekend sparked by immigration raids conducted by federal immigration agents. The New York Police Department did not immediately reply to questions about how many arrests were made, but NPR reporters saw at least half a dozen people placed in handcuffs. Paula Lopez, 66, said what's happening is giving her flashbacks of when she was arrested by immigration agents in a New York factory in 1980. \"It hurts me to see families being separated, because I lived that,\" Lopez, who came to the protest with her sister, told NPR in Spanish. \"We come here to work … to progress — it's not fair.\" Arfraz, a 43-year-old man from Queens, also remembers when decades ago ICE took away a family member. It was traumatizing, he said. So, joining Tuesday's protest felt important to him, especially for those he knows are scared. \"They can't necessarily show up to rallies because they might get picked up by ICE, so I think we have to stand up,\" said Arfraz, who asked NPR to not use his last name out of fear for his safety. \"And those who are able to stand up have a higher and urgent responsibility to do it today.\" US Immigration Donald Trump immigrant detention mass deportation Facebook Flipboard Email Home News Culture Music Podcasts & Shows Newsletters Facebook Instagram Press Public Editor Corrections Transcripts Contact & Help Overview Diversity NPR Network Accessibility Ethics Finances Support Public Radio Sponsor NPR NPR Careers NPR Shop NPR Events NPR Extra Terms of Use Privacy Your Privacy Choices Text Only Sponsor Message Become an NPR sponsor"}