{"id": 1032, "name": "Novinky.cz", "domain": "novinky.cz", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.novinky.cz/clanek/kultura-vychazi-novy-salon-husakovy-deti-v-case-globalni-zmeny-nova-kniha-edouarda-louise-i-rozhovor-s-claire-kilroyovou-40525293", "title": "Kultura Vychazi Novy Salon Husakovy Deti V Case Globalni Zmeny Nova Kniha Edouarda Louise I Rozhovor S Claire Kilroyovou 40525293", "content": "Hlavní stránka Moje sledované Stalo se Domácí VolbyKomunální volbyVolby do SenátuParlamentní volbyKrajské volbyPrezidentské volbyEurovolbyVolby USA Komunální volby Volby do Senátu Parlamentní volby Krajské volby Prezidentské volby Eurovolby Volby USA Komunální volby Volby do Senátu Parlamentní volby Krajské volby Prezidentské volby Eurovolby Volby USA ZahraničníEvropaBlízký a Střední východAmerikaSvět Evropa Blízký a Střední východ Amerika Svět Evropa Blízký a Střední východ Amerika Svět Válka na Ukrajině Komentáře Krimi KulturaFilmHudbaTV a streamingKnihyDivadlo Film Hudba TV a streaming Knihy Divadlo Film Hudba TV a streaming Knihy Divadlo Ekonomika LifestyleDítě a rodinaZdravíSex a vztahyMóda a kosmetikaOsobnostiGastroReceptyBydleníZahradaJak na to Dítě a rodina Zdraví Sex a vztahy Móda a kosmetika Osobnosti Gastro Recepty Bydlení Zahrada Jak na to Dítě a rodina Zdraví Sex a vztahy Móda a kosmetika Osobnosti Gastro Recepty Bydlení Zahrada Jak na to Koktejl Internet a PCHardwareSoftwareTestyHry a herní systémyMobilBezpečnostAI Hardware Software Testy Hry a herní systémy Mobil Bezpečnost AI Hardware Software Testy Hry a herní systémy Mobil Bezpečnost AI AutoMotoTestyRallye DakarAutosalon ŽenevaAutosalon FrankfurtTuningSauto.cz »Smoto.cz » Testy Rallye Dakar Autosalon Ženeva Autosalon Frankfurt Tuning Sauto.cz » Smoto.cz » Testy Rallye Dakar Autosalon Ženeva Autosalon Frankfurt Tuning Sauto.cz » Smoto.cz » Věda a školyVzdělávání Vzdělávání Vzdělávání CestováníTipy na výletySdovolená.cz »Tipy na výlety na Mapy.cz » Tipy na výlety Sdovolená.cz » Tipy na výlety na Mapy.cz » Tipy na výlety Sdovolená.cz » Tipy na výlety na Mapy.cz » Historie17. listopad 17. listopad 17. listopad Podcasty a pořadyZbytečná válkaSlepá mapaDobojovánoOčima Saši MitrofanovaV českém zněníPo mateřských stopáchPoliTalkHistorieNeklepatZloději životůPod svícnemHlas na pouštiŘetězákVygenerováno AIExpress Zbytečná válka Slepá mapa Dobojováno Očima Saši Mitrofanova V českém znění Po mateřských stopách PoliTalk Historie Neklepat Zloději životů Pod svícnem Hlas na poušti Řetězák Vygenerováno AI Express Zbytečná válka Slepá mapa Dobojováno Očima Saši Mitrofanova V českém znění Po mateřských stopách PoliTalk Historie Neklepat Zloději životů Pod svícnem Hlas na poušti Řetězák Vygenerováno AI Express Sport Kvízy SpeciályDokumenty Dokumenty Dokumenty Počasí TV program Denní tiskZprávyEkonomikaInternet a PCAutoMotoŽenaBulvárSportBydleníCestováníOstatní Zprávy Ekonomika Internet a PC AutoMoto Žena Bulvár Sport Bydlení Cestování Ostatní Zprávy Ekonomika Internet a PC AutoMoto Žena Bulvár Sport Bydlení Cestování Ostatní Tiráž **Vychází nový Salon: Husákovy děti v čase globální změny, nová kniha Édouarda Louise i rozhovor s Claire Kilroyovou** Poslechněte si tento článek Co všechno najdete ve čtvrteční příloze deníku Právo Salon? Salon z 12. června 2025 • EsejPavly Horákové o Husákových dětech v čase globální změny; jak se silná generace dnešních padesátníků vyrovnává sezánikem Západu coby svého celoživotního ideálu, proč dnešní svět řídí„vzpoura starých mužů“a proč stávající„polykrize“může být išancí pro budoucnost? • RecenziApoleny Rychlíkovéna knihu francouzské literární superstarÉdouarda Louise; proč se ve své nové autofikční prózeMonique na útěkudostává autor dopasti mezi patosem a obsesí– a proč se jeden z nejzajímavějších spisovatelů současnosti začíná cyklit vpředvídatelných klišé na hranici sebedojímání? • Rozhovor s irskou spisovatelkouClaire Kilroyovou, která v květnu naSvětě knihypředstavila svůj románPozor! Pohov!; proč se irským spisovatelkám v posledních letech tak daří, jak se v Irskuproměňuje vliv katolické církvea proč tamější společnost dokáže odolávat svodůmpopulismu a politického extremismu? Claire Kilroyová • SloupekŠtěpána Kučery ke Dni otců; jak se v nočnímpozorování pavouka třesavkyna stěně koupelny může zrcadlitvztah mezi otci a syny– a proč bychom měli být vnímaví i kezvířecím obyvatelům našich bytů? • Pozvánku na vzpomínkový večer věnovaný zakladateli SalonuZdenku Pavelkovi, který proběhne v pondělí16. červnana palubě(A)VOID Floating Gallery. • Krátkou glosu o básnické sbírceJaromíra TypltaPouzdří. **RECENZE: Náš svět byli Husák, Bajo i plynové masky** **RECENZE: Náš svět byli Husák, Bajo i plynové masky** **RECENZE: Eddy je Édouardem. Intimní zpověď člověka, který chce uniknout předurčenému životu** **RECENZE: Eddy je Édouardem. Intimní zpověď člověka, který chce uniknout předurčenému životu** **Související články** **Vychází nový Salon: Vzpomínání na zakladatele Salonu Zdenka Pavelku** Co všechno najdete ve čtvrteční příloze deníku Právo Salon? **Vychází nový Salon: Maxim Osipov o svém „rozvodu“ s Ruskem a David Klimeš o tom, jak české školství ničí dětem životy** Co všechno najdete ve čtvrteční příloze deníku Právo Salon? **Vychází nový Salon: S Janem Šíchou o Češích, Němcích a řece Labi i literární reportáž o básníkovi a trampovi Gézu Včeličkovi** Co všechno najdete ve čtvrteční příloze deníku Právo Salon? Reklama Reklama **Výběr článků** **** **** **** **** **** **** **** **** **Pavel naznačil, že nejmenuje jakoukoli vládu. Popudil Konečnou** **Zemřel Brian Wilson z Beach Boys** **Mladá žena spáchala sebevraždu. Celý příběh odkryla až historie jejího vyhledávání** **Puma na Sokolovsku stále na útěku. Trefa uspávací střelou nepomohla** Reklama **Volby 2025** Volby do parlamentu ČR Termín voleb Výsledky voleb Volební účast Volby v Polsku Volby Rumunsku **Parlamentní volby** Termín a další info Volební průzkumy Kandidáti do voleb Voličský průkaz Systém voleb Kandidáti voleb **Zdraví** Bolest v krku Angína bez antibiotik Jak poznat chřipku Barva hlenu Jak léčit nachlazení Zdroje vitaminu C **Sport** Roland Garros 2025 Program UFC a Oktagon NHL 2024/2025 Fotbal ME 21let 2025 Kvalifikace MS fotbal MS v hokeji 2026 **Vodáctví** Sjíždění Vltavy Na vodu na Sázavu Sjíždění Lužnice Na vodu na Otavu Sjíždění Berounky Vodácké trasy na Jizeře **Auto Moto** Řidičské průkazy Cena nafty Otázky v autoškole EGR ventil Autem na hory Platnost STK **Aktuální témata** Mapy.com Výlety s dětmi Jednodenní výlety Jak vybrat SŠ? Samosběr jahod Hudební festivaly Recepty z třešní **Z druhé ruky** Karavan Střešní box Přebalovací pult Kotec pro psa Starožitnosti Přívěsný vozík PS 5 Kolo Favorit **Populární na Zboží.cz** Mobilní telefony Televizory Dámské parfémy Chytré hodinky Krmivo pro psy Letní pneu Stavebnice LEGO Lednice Facebook| Twitter| Reklama| Kariéra| Tiráž| Ochrana údajů| Odvolat souhlas| Nastavení personalizace"}