{"id": 860, "name": "Lowndes Signal", "domain": "lowndessignal.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.lowndessignal.com/2025/06/04/budget-bill-would-hammer-struggling-alabama-families/", "title": "Budget Bill Would Hammer Struggling Alabama Families", "content": "Home News Sports Opinion Obits Records Contests About Us SubmitSubmit a PhotoSubmit a news tipSubmit a Letter to the EditorSubmit an engagement announcementSubmit a wedding announcementSubmit an anniversary announcement Submit a Photo Submit a news tip Submit a Letter to the Editor Submit an engagement announcement Submit a wedding announcement Submit an anniversary announcement Submit a Photo Submit a news tip Submit a Letter to the Editor Submit an engagement announcement Submit a wedding announcement Submit an anniversary announcement E-Edition **Budget bill would hammer struggling Alabama families** Published 3:00 pm Wednesday, June 4, 2025 ByStaff Reports By Chris Sanders Special to The Greenville Advocate The U.S. Housevoted 215-214Thursday, May 22, for a budget bill that would make basic needs like food and health care more expensive for millions of families through severe cuts to food assistance, Medicaid and other human services. These funding cuts would finance effortsto renew or expand tax cuts for wealthy people and highly profitable corporations. **Email newsletter signup** Alabama Arise executive director Robyn Hyden issued the following statement Friday in response: “It’s wrong to hurt people who are struggling to help people who are already doing well. But the U.S. House just voted for a budget bill that would do exactly that. “This cruel budget plan would take away food assistance, health coverage and other vital services from hundreds of thousands of Alabamians who struggle to afford basic needs. And it would make those cuts in service of slashing taxes for billionaires and highly profitable corporations. The bill’s $1.1 trillion of cuts to food assistance and health care over the next decade would be equal to the amount of tax breaks it would providefor the wealthiest 2% of households. “Alabama likely would feel the worst effects from cuts to the Supplemental Nutrition Assistance Program. SNAP benefits have been fully federally funded for decades, but this bill would change that. As a result ofthis cost shift to states, Alabama would be on the hook to pay nearly $300 million a year in direct benefits and additional administrative costs. “There is real reason to worry that the Legislature can’t or wouldn’t provide this additional funding. In that case, Alabama would be forced to cut SNAP benefits significantly – or even eliminate the program altogether for nearly 800,000 participants statewide. These cuts would send hunger soaring and devastate the economy in local communities across Alabama. “The House bill also would make health care inaccessible or less affordable for hundreds of thousands of Alabamians. It would allow enhanced Affordable Care Act subsidies to expire, increasing premium costs for marketplace plans. It also would take away the additional federal incentives for the first two years of Medicaid expansion that Alabama left on the table, increasing the chances that hundreds of thousands of our neighbors will remain stuck in the health coverage gap with no options to afford life-saving care. “The Senate should put the future and well-being of all of us ahead of tax cuts for the wealthy and well-connected. That means rejecting the House bill’s harmful service cuts for working people and tax giveaways to wealthy households. Our senators should focus instead on building an economy that works for everyone in Alabama and across our country.” Chris Sanders is Communications Director for Alabama Arise. **Shemeka Robinson graduates UWA** **Community coverage earns APA awards** **Mickle awarded over $1 million in scholarships** **Jericho: The lowest city on earth** Calendar of Events **Calendar of Events** **Calendar of Events** Home News Sports Opinion Small Business About Us Subscribe Contact Us © 2025, Lowndes Signal"}