{"id": 2029, "name": "Leading Britain's Conversation (LBC)", "domain": "lbc.co.uk", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.lbc.co.uk/politics/uk-politics/uk-agrees-post-brexit-deal-with-spain-and-eu-on-gibraltar", "title": "Uk Agrees Post Brexit Deal With Spain And Eu On Gibraltar", "content": "LBC Home News Politics World Crime Opinion Business & Money Radio Science & Technology Weather Royals Join the conversation Ben Kentish10pm - 1am **On Air Now** Politics UK Politics **Now Discussing** Ben Kentish is Leading Britain's Conversation. Use the LBC app to listen to live radio for LBC & LBC News Listen **UK agrees to 'fluid border' between Gibraltar and Spain as Labour finalises post-Brexit deal** 11 June 2025, 16:12 | Updated: 11 June 2025, 16:32 By Henry Moore Britain has agreed a post-Brexit deal to hand control of Gibraltar's borders to Europe following drawn-out negotiations. The deal means Brits arriving to The Rock will be forced to show their passports to Spanish or EU border guards when crossing the border or landing at the airport. Currently, Gibraltar residents can cross using their residence cards without needing to have their passports stamped. Spanish citizens can cross using a government ID card. With this new change, Brits will face \"Eurostar\" style passport checks when arriving on the island. Gibraltar was ceded to the UK by Spain in 1713, and the population is heavily in favour of remaining a British overseas territory. Read more: Starmer refuses to rule out further tax rises amid winter fuel U-turn and £300bn spending pledge The last time it voted on a proposal to share sovereignty with Spain, in 2002, almost 99% of Gibraltarians rejected the move. Foreign Secretary David Lammy and Europe Minister Stephen Doughty travelled to Gibraltar on Tuesday ahead of talks to secure a potential deal with Spain. Meeting with Gibraltar's chief minister Fabian Picardo and wider cabinet, Wednesday's talks will be followed by discussions with EU and Spanish ministers in Brussels. Announcing the deal, the Government said: \"Immigration and law and order in Gibraltar will remain the exclusive responsibility of Gibraltar's authorities. \"Spanish officials will be responsible for ensuring the integrity of the Schengen Area, in a model similar to French police operating in London's St Pancras station.\" Mr Lammy added: \"This government inherited a situation from the last government which put Gibraltar's economy and way of life under threat. Today's breakthrough delivers a practical solution after years of uncertainty. \"Alongside the government of Gibraltar, we have a reached an agreement which protects British sovereignty, supports Gibraltar's economy and allows businesses to plan for the long-term once again. \"I thank the chief minister and his government for their tireless dedication throughout the negotiations. The UK's commitment to Gibraltar remains as solid as the Rock itself.\" **Latest Donald Trump News** **Greenland PM brands Usha Vance and US delegation's visit a 'provocation' as anti-Trumpprotestors swarm streets** **Greenland PM brands Usha Vance and US delegation's visit a 'provocation' as anti-Trumpprotestors swarm streets** **'It's a lot of stuff' - Trump releases 80,000 classified pages relating to JFKassassination, honouring campaign promise** **'It's a lot of stuff' - Trump releases 80,000 classified pages relating to JFKassassination, honouring campaign promise** **Trump says 25% tariffs on Canada and Mexico 'will go forward' in March after month-longdelay** **Trump says 25% tariffs on Canada and Mexico 'will go forward' in March after month-longdelay** **'Two shooters' involved in JFK assassination, claims task force head - as FBI revealsthousands of secret files** **'Two shooters' involved in JFK assassination, claims task force head - as FBI revealsthousands of secret files** **Trump to host Netanyahu in Washington marking first foreign leader visit since USinauguration** **Trump to host Netanyahu in Washington marking first foreign leader visit since USinauguration** **El Salvador offers to accept US deportees and criminals in 'unprecedented' migrant deal** **El Salvador offers to accept US deportees and criminals in 'unprecedented' migrant deal** **China announces retaliatory tariffs on US as Trump's levies take effect - but Canadaand Mexico's are paused** **China announces retaliatory tariffs on US as Trump's levies take effect - but Canadaand Mexico's are paused** **Trump pauses 25% tariffs on Canada for 30 days as President says call with Trudeau went'very well'** **Trump pauses 25% tariffs on Canada for 30 days as President says call with Trudeau went'very well'** **Britain will not choose between EU and US, says Starmer following Trump's tariff threats** **Britain will not choose between EU and US, says Starmer following Trump's tariff threats** **US trade tariffs on Mexico paused for a month after border deal** **US trade tariffs on Mexico paused for a month after border deal** **Latest Politics News** **First Labour MP calls for abolition of 'two-tier' Sentencing Council as justice row erupts** **First Labour MP calls for abolition of 'two-tier' Sentencing Council as justice row erupts** **Farage claims Trump could make Putin a 'winner' - as he distances himself from USPresident over stance on Russia** **Farage claims Trump could make Putin a 'winner' - as he distances himself from USPresident over stance on Russia** **Judges reject Government's request to change 'corrosive' sentencing rules as 'two-tierjustice' row erupts** **Judges reject Government's request to change 'corrosive' sentencing rules as 'two-tierjustice' row erupts** **Northern England will no longer be 'held to ransom' by poor transport systems, saysStarmer** **Northern England will no longer be 'held to ransom' by poor transport systems, saysStarmer** **Australia to hold federal election in May as housing and inflation among key issues** **Australia to hold federal election in May as housing and inflation among key issues** **Donald Trump pushes for near-total control of Ukraine’s minerals and energy in hugeincrease on earlier demands** **Donald Trump pushes for near-total control of Ukraine’s minerals and energy in hugeincrease on earlier demands** **Reform deputy says mental health is modern equivalent of ‘back pain’ - and disabledpeople are ‘swinging the lead’** **Reform deputy says mental health is modern equivalent of ‘back pain’ - and disabledpeople are ‘swinging the lead’** **I look forward to a statement that hits people like me, rather than those who can’tafford to eat, writes Andrew Marr** **I look forward to a statement that hits people like me, rather than those who can’tafford to eat, writes Andrew Marr** **Labour's worker's rights reforms to have 'net negative' impact on the economy, says OBR** **Labour's worker's rights reforms to have 'net negative' impact on the economy, says OBR** **Online Islamophobic abuse targeting Sadiq Khan more than doubled last year, figuressuggest** **Online Islamophobic abuse targeting Sadiq Khan more than doubled last year, figuressuggest** **Also on LBC** The News Explained Royals Showbiz News ULEZ Strikes Crime King Charles Rishi Sunak About LBC Jeremy Hunt Podcasts War in Ukraine Listen to Global Player LBC Views Schools Labour Conservatives Liberal Democrats Climate Green Party Cladding Crisis Scotland NHS Health Housing Police Sadiq Khan LBC Presenters Boris Johnson Political Parties Keir Starmer Latest Weather Updates Travel News Topics Watch LBC Videos Dashcam Videos London News **Useful Links** Contact Us Help How To Listen Company Details Cookies Public File Privacy Terms & Conditions Advertise Global Jobs **Download the app** **Follow Us**"}