{"id": 1220, "name": "Science Feedback", "domain": "science.feedback.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://science.feedback.org/review/antarctica-recently-gained-some-ice-that-doesnt-mark-end-ice-loss-global-warming-sea-level-rise-contrary-viral-claims/", "title": "Antarctica Recently Gained Some Ice That Doesnt Mark End Ice Loss Global Warming Sea Level Rise Contrary Viral Claims", "content": "Climate Health Energy Reviews Insights Climate Health Energy Reviews Insights About Method Contact us Apply to become a reviewer Get email news updates Follow-us: Facebook LinkedIn WhatsApp Bluesky Topics: Climate Health Climate **Antarctica recently gained some ice; that doesn’t mark the end of ice loss, global warming or sea-level rise, contrary to viral claims** Posted on:2025-05-15 **Key takeaways** Antarctica gained ice from 2021 to 2023 due to a high amount of snowfall, which offset the ice it lost to the ocean. Overall, Antarctica has been losing ice for two decades, which has contributed to sea-level rise. The recent paper published inScience China Earth Sciencesdoes not suggest that there is a sustained‘reversal or overturning’ of the long-term trend of ice loss in Antarctica. Global temperature records indicate that Earth has been warming for decades and continues to do so. Decades of data show that sea levels have been rising and continue to do so. Although global warming contributes to ice loss around the world, it can help offset ice loss in Antarctica through increased snowfall, because as our atmosphere warms it is able to hold more water and increase precipitation in some regions. Climate scientists were already well aware of this prior to the recent paper. **Review** A new paper was published inScience China Earth Sciencesjournal on 19 March 2025, showing that Antarctica gained ice from 2021 to 2023 due to significant snowfall. Shortly after this paper was published, social media users cited this paper to post claims like ‘global warming is over’, ‘Antarctica’sice loss trend has reversed’ or‘sea-level rise is a lie’. One suchpostalready has over 3 million views on X/Twitter, andanotherhas 8 million views. But with overtwo decades of recorded ice lossin Antarctica, and decades of data showing that the planet is warming[1]and that sea levels are rising[2], what doscientiststhink about a few years of ice gain in Antarctica? To find out, Science Feedback contacted several climate scientists with relevant expertise – from sea-level rise to glaciology – and asked them for context about the recent paper and claims. We will share their insights below. To understand ice loss in Antarctica, let’s first put its ice sheet into perspective. Antarctica is a continent with a surface arealargerthan the continental United States. Like other continents, its foundation is made of rocky terrain, but it is mostly covered with ice that is about 0.6 kilometers (1 mile) thick on average. This ice hasaccumulated over millions of yearsand, in total, holdsroughly 60% of Earth’s freshwater. Why is that perspective important? Gains and losses of ice on a continental scale – like in Antarctica – aren’t simple like a heat lamp melting an ice cube, or snow piling up then melting in your yard. There are more complex processes involved as the atmosphere, land, and ocean interact with each other. For this reason, looking solely at short-term ice gains and losses misses key parts of the story of Antarctica’s ice – one which showsover two decades of ice loss(Figure 1). To learn more about what drives these ice changes and if the recent gains indicate a ‘reversal’ of Antarctica’s ice-loss trend, Science Feedback contacted Dr. Peter Neff, Assistant Professor at the University of Minnesota, who has conducted research on how snow accumulates and sea ice varies in Antarctica. Neff explained: Peter Neff Assistant Professor, University of Minnesota “No it [the paper] does not indicate a likelysustainedreversal of the overall ice loss in Antarctica. Just like you can walk and chew gum at the same time, multiple processes can affect any system and lead to short or long-term change. The “mass balance” of the Antarctic ice sheet is controlled by how much snow falls in (depositing into the bank), then flows to the ocean at low elevations and melts as it comes into contact with the ocean and then also calves off icebergs from the floating glacier extensions called ice shelves (withdrawing from the bank). There is very little surface melting in Antarctica caused by the atmosphere (compared to a lot of this in Greenland).” Above, Neff highlights that ice loss in Antarctica is not just the difference between the amount of ice that accumulates and melts on the same surface (like ice in a driveway melting down and building back up). Instead, it is mostly the balance of how much snow/ice accumulates in one place, and how much melts or breaks away in the ocean after it flows downhill to the coast (Figure 2). In the recentScience China Earth Sciencespaper, the authors note that “anomalously high” precipitation/snowfall over the Antarctic ice sheet in 2021 to 2022 led to the recent ice-mass gain[3]. So why is it important to understand how these gains and losses occur? Looking only at short-term ice-mass changes ignores long-term changes (like ice thinning, which occurs when ocean water melts floating ice sheets from below) that can make it difficult for ice sheets to recover or can even lead to ice-sheet collapse. To track mass ice-mass changes across Antarctica, scientists use satellites to measure gravitational changes caused by ice-mass changes below. More mass means more gravity, which creates different measurable ‘tugs’ on the satellites as they orbit over Antarctica. As Neff Explains: Peter Neff Assistant Professor, University of Minnesota “The paper reports on data from the GRACE [Gravity Recovery and Climate Experiment] and GRACE-FO satellites which measure gravity as they (pairs of satellites, with ‘FO’ indicating that is a Follow On mission to the first pair of GRACE satellites) chase each other in orbit and measure how the distance between each satellite changes slightly as they pass over more or less dense material on earth (affecting gravitational pull). These are NASA and ESA satellites, with publicly available [data] being analyzed by this team of Chinese scientists.” Pairing this understanding of ice-mass changes with other studies of Antarctica’s ice sheets, scientists have developed a more detailed understanding of long-term changes. As Neff explains: Peter Neff Assistant Professor, University of Minnesota “In West Antarctica and particularly the Pacific Ocean-facing coastline there we are seeing persistent ice mass loss where the ice there flows into the ocean.It is well understood that relatively warm ocean water there is melting floating ice shelves from below[4].As ice shelves are melted, they thin and can lose their hold on where they rest on bedrock. Losing that strength can lead to runaway retreat that is hard to see reversing, hence we’re worried about the long-term “collapse” of the West Antarctic ice sheet.This West Antarctic ice loss continues, although it can speed up or slow down due to a number of factors but we don’t see a way that it will stop outright.GRACE-FO data show that mass loss in coastal West Antarctica continues (Figure 3).We’ve known that the trend in ice mass loss has changed now for a few years, as seen in this2023 time series and animationof the same data reported in the Chinese analysis” Climate scientists have determined unequivocally that Earth is warming[1,5]. Despite robust evidence that our planet is still warming, recent posts online claimed ‘global warming is over’ based on recent ice gains in Antarctica. The underlying suggestion of this claim is that ‘global warming and short-term ice gains are incompatible’. Not only is that incorrect – as we will explain below – but it is also misleading as it suggests that three years of ice observations for one continent can somehow overturn decades of global temperature data which shows that Earth is warming[1]. In other words, scientists do not determine if the planet is warming using a few years of ice observations for one continent – they use decades of temperature data from around the world. Although ice loss is an important indicator of climate change, it is only one among many – including sea-level rise, ocean temperatures, drought, and others – and it is certainly not a better way to measure global temperature change than actual temperature measurements. Looking only at Antarctica’s ice loss to measure global warming is like checking your body temperature by laying on a block of ice to see how fast it melts, rather than using a thermometer. The underlying suggestion of this claim is also incorrect because global warming can, in fact,contributeto short-term ice gains in Antarctica through increased precipitation. While this may sound counterintuitive, it’s a well-known fact to climate scientists. As Neff explained to Science Feedback: Peter Neff Assistant Professor, University of Minnesota “With a warmer atmosphere, one change we expect is that warmer air which physically can hold more moisture, likely would add to the mass of Antarctica by slightly more snowfall.Other analyses have seen this, like Medley and Thomas, 2019 using another approach separate from GRACE[6]. Nobody online got worked up about that one!” Science Feedback also contacted Dr. Aimée Slangen, Research Leader at the Royal Netherlands Institute for Sea Research (NIOZ), who shared similar insights: Aimée Slangen Researcher, Royal Netherlands Institute for Sea Research (NIOZ) “Mass changes on Antarctica (and thus its sea-level contribution) are a balance of several processes. One of those is snowfall which leads to mass gain. As warmer temperatures lead to air being able to hold more moisture (following Clausius-Clapeyron*), there is a potential for more snowfall on Antarctica due to global warming. There are many scientific papers on this.” *Note: TheClausius-Clapeyron relationshipthat Slangen references above is a well-established physical law whichshowsthat the water-holding capacity of our atmosphere increases by roughly 7% for every 1 degree celsius (°C) in atmospheric temperature rise. However, Neff explains that these short-term gains through increased snowfall are not something that ‘fixes’ the processes causing ice loss in Antarctica: Peter Neff Assistant Professor, University of Minnesota “What has happened here is like slapping a new coat of paint (increased snowfall across the vast area of East Antarctica, in part connected to unprecedented heat waves as in March 2022) on a used car that is dripping oil (the structural instability of West Antarctic ice shelves and outlet glaciers, particularlyThwaites Glacier).” What Neff points out above is that if you look only at ice gained or lost, you miss the important point of ‘why’ that occurred and the fact that different things are happening from region to region. In East Antarctica, there was increased snowfall, but this does not ‘fix’ the structural instability in the ice shelves of West Antarctica, for example. But coming to this understanding requires a more detailed approach of learning what’s happening in Antarctica, rather than jumping to conclusions and making unsupported claims, as Neff explains: Peter Neff Assistant Professor, University of Minnesota “The moral of the story is that online commentators tend to refuse to engage with the actual detailed understanding of these things, and find any shiny object/result to point to and say ‘see we told you so, alarmists.’We’ve seen this time and time again and it’s all that folks have left, those who are unwilling to approach the unfortunate challenge of getting a hold on our activities that are warming the planet.” Other social media users also cited the recent paper toclaimthat ‘sea-level rise is a lie’. But what is stated in the paper itself? In the paper, the authors explain thatAntarctica(not every continent) negatively contributed to sea-level rise (because it gained more ice than it lost) from 2021 to 2023[3]. You can think of this like ‘accounting’ for water. If Antarctica gains more ice (through snowfall/precipitation) than it loses (primarily by flowing to the ocean and melting), then Antarctica’s ice sheet is effectively removing/storing water (as ice) that otherwise would have ended up in Earth’s oceans and contributed to sea-level rise. So in the period of 2021 to 2023, Antarctica ‘took in’ more water (and stored it as ice) than it lost through melting (and other means). But what happens if you extend your ‘water accounting’ period to include our more extensive record of ice-mass changes in Antarctica? Based on findings in the paper, when the 2021-2023 period is included in the overall record (2002-2023), Antarctica still added to sea-level rise, despite short-term ice gains. Nowhere in the paper do its authors state that sea levels aren’t rising – on the contrary, they explain exactly how the recent ice gain affected sea-level rise. According to the paper, Antarctica contributed 5.10 millimeters (mm) to sea-level rise from April 2002 to December 2023[3]. Antarctica’s peak sea-level rise contribution was 5.99 mm, which occurred from 2002 to 2020. However, following the short-term ice gains from 2021-2023, this total dropped to 5.10 millimeters, which is 0.89 mm less than the peak but still a ‘positive’ contribution, meaning it added to sea-level rise in the long term. Science Feedback asked climate scientists if the paper supports the claim that ‘sea-level rise is not happening’. Below are their responses: Peter Neff Assistant Professor, University of Minnesota “No, of course it doesn’t support the claim or make any attempt to support the claim that ‘sea-level rise is not happening.’ Sea level rise is caused by a number of factors and is generally 50% caused by volume expansion of water as it warms (steric sea level rise) and 50% from ice melt. The ice melt is coming first and most from melting mountain glaciers (these smaller ice masses respond most quickly to atmospheric warming), then Greenland (again, smaller than Antarctica and in a warmer geographic location with different melt processes at play than Antarctica), then Antarctica. NASA last yearshowedthat sea level continues to rise at rates greater than expected (Figure 3).” Aimée Slangen Researcher, Royal Netherlands Institute for Sea Research (NIOZ) “No, the paper does not support this claim. It is also a very strange claim. If one contributor (temporarily) does not contribute to sea-level rise, this does not mean that sea-level rise is not happening. There are many other contributors to sea-level rise, all of which have continued to contribute to sea-level rise in the recent period. Antarctica is currently a relatively small contributor, of about 10% over 2006-2018 (according to IPCC AR6 working group 1, chapter 9, table 9.5), and even if that contribution goes down for a specific year, that does not stop the other contributors. What this paper says in the abstract is that there was mass loss from 2002 to 2020, followed a three year period of some mass gain in some regions, but that as a whole over 2002-2023 there was mass loss from Antarctica – i.e. Antarctica contributed to sea-level rise over 2002-2023.” On a final note, Neff explained: Peter Neff Assistant Professor, University of Minnesota “We in cryospheric science (ice science) will continue to study how increased snowfall in a warmer Earth system might reduce the overall amount of sea level rise caused by continued ice-ocean-atmosphere caused ice loss in West Antarctica.We will be diligent about it, with help from leading satellite platforms supported by NASA and European Space Agency publicly-funded investment in results that are open to anyone on earth to analyze and interpret” Despite viral claims, the recent paper published inScience China Earth Sciencesdoes not support claims that ‘global warming is over’, ‘sea-level rise is a lie’, or ‘Antarctica’s ice loss has been reversed/overturned’. Regarding global warming and sea-level rise, decades of data show that these still persist today; a few years of ice gain in Antarctica does not overturn these findings. Recent claims cite findings in the paper which show that Antarctica gained ice from 2021-2023; however, they miss important details about this event. Climate scientists explained to Science Feedback that Antarctica’s long-term ice loss cannot be evaluated solely on a few years of ice-mass changes, but should be looked at holistically and over longer periods (decades or more). The short-term ice gain in Antarctica was a result of increased snowfall/precipitation; looking at that event alone ignores the long-term processes contributing to ongoing ice loss there. Antarctica’s ice sheet has been losing ice for over two decades and has been undergoing other processes – such as ice-sheet thinning – which in the long term can lead to major ice loss through things like ice-sheet collapse. **Scientists’ feedback** Questions from Science Feedback:Does thispapersupport the claims that: 1. ‘sea-level rise is not happening’? The paper indicates that Antarctica contributed negatively to sea-level rise from 2021-2023 due to its ice gain – did global mean sea-level rise ‘stop’ at all during that period? 2. ‘Antarctica’s recent ice gains indicate a reversal of the overall trend of ice loss in Antarctica’? If not, what trend do climate scientists anticipate for Antarctica’s ice mass in the future? 3. ‘Global warming is over’? If not, why was Antarctica able to gain ice from 2021-2023 despite global warming? Peter Neff Assistant Professor, University of Minnesota 1. No, of course it doesn’t support the claim or make any attempt to support the claim that ‘sea-level rise is not happening.’ Sea level rise is caused by a number of factors and is generally 50% caused by volume expansion of water as it warms (steric sea level rise) and 50% from ice melt. The ice melt is coming first and most from melting mountain glaciers (these smaller ice masses respond most quickly to atmospheric warming), then Greenland (again, smaller than Antarctica and in a warmer geographic location with different melt processes at play than Antarctica), then Antarctica. NASA last yearshowedthat sea level continues to rise at rates greater than expected. The paper reports on data from the GRACE and GRACE-FO satellites which measure gravity as they (pairs of satellites, with ‘FO’ indicating that is a Follow On mission to the first pair of GRACE satellites) chase each other in orbit and measure how the distance between each satellite changes slightly as they pass over more or less dense material on earth (affecting gravitational pull). These are NASA and ESA satellites, with publicly available [data] being analyzed by this team of Chinese scientists. They solve just for the mass change over Antarctica. Note that there are a range of independent satellite observations of sea level rise which indicate it continues unabated: TOPEX/Poseidon and now the Sentinel-6 Michael Freilich (again see the linked NASA article). 2.No it does not indicate a likelysustainedreversal of the overall ice loss in Antarctica. Just like you can walk and chew gum at the same time, multiple processes can affect any system and lead to short or long-term change. The ‘mass balance’ of the Antarctic ice sheet is controlled by how much snow falls in (depositing into the bank), then flows to the ocean at low elevations and melts as it comes into contact with the ocean and then also calves off icebergs from the floating glacier extensions called ice shelves (withdrawing from the bank). There is very little surface melting in Antarctica caused by the atmosphere (compared to a lot of this in Greenland). In West Antarctica and particularly the Pacific Ocean-facing coastline there we are seeing persistent ice mass loss where the ice there flows into the ocean.It is well understood that relatively warm ocean water there is melting floating ice shelves from below[4].As ice shelves are melted, they thin and can lose their hold on where they rest on bedrock. Losing that strength can lead to runaway retreat that is hard to see reversing, hence we’re worried about the long-term ‘collapse’ of the West Antarctic ice sheet.This West Antarctic ice loss continues, although it can speed up or slow down due to a number of factors but we don’t see a way that it will stop outright.GRACE-FO data show that mass loss in coastal West Antarctica continues.We’ve known that the trend in ice mass loss has changed now for a few years, as seen inthis 2023 time series and animationof the same data reported in the Chinese analysis. What has changed, is that in the 2020s there have been a few large, warm snowfall events that have deposited excess snow (ice mass) across East Antarcticain somewhat surprising and unexpected ways. We wrote two papers about the 2022 heat wave and snowfall event that caused some of this[7,8]. East Antarctica is such a large area, so vast, that possibly unprecedented penetrations inland by warm marine air masses and atmospheric rivers can deposit gigatons of snow that does offset some ice-flow and ocean-caused ice loss in West Antarctica. The heat-wave that is linked to the March 2022 snowfall event was one of the most extreme ever observed on earth… not exactly what I’d call a process that is going to ‘save’ Antarctica. With a warmer atmosphere, one change we expect is that warmer air which physically can hold more moisture, likely would add to the mass of Antarctica by slightly more snowfall.Other analyses have seen this, like Medley and Thomas, 2019 using another approach separate from GRACE[6]. Nobody online got worked up about that one! 3.Of course not. Look atglobal average temperature observations. What has happened here is like slapping a new coat of paint (increased snowfall across the vast area of East Antarctica, in part connected to unprecedented heat waves as in March 2022) on a used car that is dripping oil (the structural instability of West Antarctic ice shelves and outlet glaciers, particularly Thwaites Glacier).Increased snowfall could indeed increasingly mitigate some of the ice loss that is being caused by ice shelf melt as those features interact with changing ocean temperatures (which relate to ocean circulation and wind changes, and only to a hard-to-quantify extent any human-caused effects–but we expect those human effects to continue to emerge as we continue warming the world with our emissions of heat-trapping greenhouse gases).But ‘marine ice sheet instability’ as it’s been called since the 1970s[9]remains a persistent driver of focused mass loss that the GRACE satellites continue to see. The moral of the story is that online commentators tend to refuse to engage with the actual detailed understanding of these things, and find any shiny object/result to point to and say ‘see we told you so, alarmists.’We’ve seen this time and time again and it’s all that folks have left, those who are unwilling to approach the unfortunate challenge of getting a hold on our activities that are warming the planet. Those who agree that human caused warming is a problem aren’t calling for a wholesale destruction of the global economy and for instantaneous removal of fossil fuel as an energy source… the same Intergovernmental Panel on Climate Change that presents our understanding of the problem in volume one of each of their ‘Assessment Reports’ also publishes a volume two and three on ‘Impacts, Adaptation, and Vulnerability’ (all with an eye to preventing losses including economic/financial ones) and ‘Mitigation of Climate Change,’ aka making the problem less bad (also with an eye toward economic and energy pathways to continued prosperity and economic growth). We in cryospheric science (ice science) will continue to study how increased snowfall in a warmer Earth system might reduce the overall amount of sea level rise caused by continued ice-ocean-atmosphere caused ice loss in West Antarctica.We will be diligent about it, with help from leading satellite platforms supported by NASA and European Space Agency publicly-funded investment in results that are open to anyone on earth to analyze and interpret (as this analysis published in a Chinese journal). We will all continue to have the responsibility to genuinely engage with each other both online, in other forms of communication, and in person as we understand the impacts of our observations of the changing Earth system. Our US federal research investments have contributed a large part of our global understanding of the causes of the observed warming of the planet. But as the study demonstrates, the complex earth system and its diverse responses to our warming must continue to be observed, monitored, and understood with an eye to the future to reduce risk to people, property, and global prosperity.We know it is ‘unequivocal’ (in IPCC language) that human activities are the major cause. We know that emissions of heat-trapping greenhouse gases (carbon dioxide, methane) largely from burning fossil fuels as an energy source is the major cause. This is very very powerful information, and a much better situation to be in than a globe of lobsters in a warming pot wondering what is going on. Warming is here. It’s caused by us. It’s causing serious harm. We know how to avoid the harm getting worse, and there’s no time to waste getting on with it. Aimée Slangen Researcher, Royal Netherlands Institute for Sea Research (NIOZ) 1.No, the paper does not support this claim. It is also a very strange claim. If one contributor (temporarily) does not contribute to sea-level rise, this does not mean that sea-level rise is not happening. There are many other contributors to sea-level rise, all of which have continued to contribute to sea-level rise in the recent period. Antarctica is currently a relatively small contributor, of about 10% over 2006-2018 (according to IPCC AR6 working group 1, chapter 9, table 9.5), and even if that contribution goes down for a specific year, that does not stop the other contributors. What this paper says in the abstract is that there was mass loss from 2002 to 2020, followed a three year period of some mass gain in some regions, but that as a whole over 2002-2023 there was mass loss from Antarctica – i.e. Antarctica contributed to sea-level rise over 2002-2023. Mass changes on Antarctica (and thus its sea-level contribution) are a balance of several processes. One of those is snowfall which leads to mass gain. As warmer temperatures lead to air being able to hold more moisture (following Clausius-Clapeyron), there is a potential for more snowfall on Antarctica due to global warming. There are many scientific papers on this. At the same time Antarctica loses mass, mostly at the edges due to (primarily) ocean-driven melt, which is also driven by global warming. At the moment, for any given year, the balance in Antarctica could tip in the favour of the mass loss or in the favour of the mass gain, and in particular the amount of snowfall is very much something that can change from year to year due to climate variability. Over this particular period of three years, the authors find that the mass gain ‘won’ over the mass loss in some regions, but they do not claim that this is a permanent or long-lasting effect, and they also show that it is not the case across the entire ice sheet. 2.No, the paper does not support this. In fact, the paper finds an increase in mass loss over 2011-2020 compared to 2002-2010, ‘with expanded areas of mass loss spreading inland’. They do say that there was a mass gain period in specific regions from 2020-2023, but the authors do not claim that this is a permanent or long-lasting effect. 3.No, definitely not, as I explained above. Eric Rignot Professor, University of California Irvine & Jet Propulsion Laboratory 1.This happens all the time, up and down with the mass loss. One cannot focus on a couple of years when the record extends 40 years. 2.No that cannot be the conclusion of the paper. It would be false to conclude on the state of mass balance of a continent based on 2 years of data out of a 20 year record.” 3.There have been similar ‘bumps’ in the past record. It is a non event. I am not surprised however that social media goes viral with this. **References:** 1 – IPCC (2021)Sixth Assessment Report. 2 – IPCC (2019)Special Report on the Ocean and Cryosphere in a Changing Climate. 3 – Wang et al. (2025)Spatiotemporal mass change rate analysis from 2002 to 2023 over the Antarctic Ice Sheet and four glacier basins in Wilkes-Queen Mary Land. Science China Earth Sciences. 4 – Pritchard et al. (2012)Antarctic ice-sheet loss driven by basal melting of ice shelves. Nature. 5 – IPCC (2023)Climate Change 2023: Synthesis Report. 6 – Medley and Thomas (2019)Increased snowfall over the Antarctic Ice Sheet mitigated twentieth-century sea-level rise. Nature Climate Change. 7 – Wille et al. (2024)The Extraordinary March 2022 East Antarctica “Heat” Wave. Part I: Observations and Meteorological Drivers. Journal of Climate. 8 – Wille et al. (2024)The Extraordinary March 2022 East Antarctica “Heat” Wave. Part II: Impacts on the Antarctic Ice Sheet. Journal of Climate. 9 – Mercer (1978)West Antarctic ice sheet and CO2 greenhouse effect: a threat of disaster. Nature. Science Feedback is a non-partisan, non-profit organization dedicated to science education. Our reviews are crowdsourced directly from a community of scientists with relevant expertise. We strive to explain whether and why information is or is not consistent with the science and to help readers know which news to trust.Please get in touch if you have any comment or think there is an important claim or article that would need to be reviewed. Get in touch **Tags:** Published on: Editor: Darrik Burns **Share** Facebook WhatsApp Paratger par e-mail **Reviewers** Eric Rignot Professor, University of California Irvine & Jet Propulsion Laboratory Aimée Slangen Researcher, Royal Netherlands Institute for Sea Research (NIOZ) Peter Neff Assistant Professor, University of Minnesota **Editor** Darrik Burns Climate editor, Science Feedback **Newsletter subscription** Get scientists’ reviews delivered directly to your inbox **Support our work** We depend on your support to operate. Help us create a more trustworthy Internet! Donate **Related Articles** IncorrectEnergyClimatePosted on:2025-05-07There’s no doubt on CO2’s role in climate change, despite Jordan Peterson and Joe Rogan’s claimsClaim:Whether all that additional carbon dioxide is a function of human activity, that’s still debatable.Source:Joe Rogan Experience,Jordan Peterson,Joe Rogan, 2025-04-22 Energy Climate **There’s no doubt on CO2’s role in climate change, despite Jordan Peterson and Joe Rogan’s claims** Claim: Whether all that additional carbon dioxide is a function of human activity, that’s still debatable. Energy Climate **There’s no doubt on CO2’s role in climate change, despite Jordan Peterson and Joe Rogan’s claims** Claim: Whether all that additional carbon dioxide is a function of human activity, that’s still debatable. Lacks contextClimatePosted on:2025-05-0284% of the world’s reefs recently experienced bleaching-level heat stress, but not all were ‘completely bleached’Claim:More than 80% of the world’s reefs hit by bleaching.Source:CBS,The Guardian, 2025-04-23 Climate **84% of the world’s reefs recently experienced bleaching-level heat stress, but not all were ‘completely bleached’** Claim: More than 80% of the world’s reefs hit by bleaching. Climate **84% of the world’s reefs recently experienced bleaching-level heat stress, but not all were ‘completely bleached’** Claim: More than 80% of the world’s reefs hit by bleaching. ClimatePosted on:2025-03-28If sea levels are rising, why is the Maldives still above water?If you want to see the front lines of climate change, you might think to look at the Maldives. Most… Climate **If sea levels are rising, why is the Maldives still above water?** If you want to see the front lines of climate change, you might think to look at the Maldives. Most… Climate **If sea levels are rising, why is the Maldives still above water?** If you want to see the front lines of climate change, you might think to look at the Maldives. Most… **Community** Team Methodology Editorial Independence **Organization** About Funding Legal notice **Stay in touch** Contact us Support our work Facebook LinkedIn WhatsApp Bluesky Science Feedback – This work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License (CC BY-NC-SA 4.0)"}