{"id": 2126, "name": "Skwawkbox", "domain": "skwawkbox.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://skwawkbox.org/2025/06/09/filmmakers-make-their-films-about-palestine-available-for-free-in-response-to-israels-gaza-flotilla-abduction/", "title": "Filmmakers Make Their Films About Palestine Available For Free In Response To Israels Gaza Flotilla Abduction", "content": "SKWAWKBOX News, politics, insights, inside information from the left About the SKWAWKBOX Why to support the SKWAWKBOX 0 **Filmmakers make their films about Palestine available for free in response to Israel’s Gaza flotilla abduction** **The world can now watch an array of documentaries for free as Israel’s arrogance and violence – and the collusion of the UK and other western govts backfire** In response to Israel’s genocide in Gaza and its illegalchemical weapons assault on and seizure of theMadleenGaza Freedom Flotilla humanitarian vessel and its crew in the early hours of this morning, the current events in Palestine, dozens of filmmakers have made their films about Palestine available online for everyone to watch, free of charge. Israel’s attempt to prevent the Madleen from reaching Gaza and raising awareness of Israel’s genocide, starvation blockaded and other crimes has quickly backfired. A list of the films and links to them A collection of documentaries published by Al Jazeera Documentary:https://bit.ly/3yp2nBIhttps://bit.ly/2SSpMeChttps://bit.ly/3f0KK3P “Keeper of Memory” documentary:https://youtu.be/eywuYeflWzg “Empty Seat” documentary:https://youtu.be/an4hRFWOSQQ “Resistance Pilot” documentary:https://youtu.be/wqSmdZy-Xcg “Jenin” documentary:https://vimeo.com/499672067 “The Olive Tree” documentary:https://vimeo.com/432062498 “Scenes from the Occupation in Gaza” (1973) documentary:https://youtu.be/1JlIwmnYnlE “Gaza Fights For Freedom” documentary:https://youtu.be/HnZSaKYmP2s “Arna’s Children” documentary:https://youtu.be/cQZiHgbBBcI Short Film “Strawberry”:https://vimeo.com/209189656/e5510a6064 Short Film “The Place”:https://youtu.be/fgcIVhNvsII “The Mayor” documentary:https://youtu.be/aDvOnhssTcc “The Creation and the Nakba 1948” documentary:https://youtu.be/Bwy-Rf15UIs “Occupation 101” documentary:https://youtu.be/C56QcWOGSKk “The Shadow of Absence” documentary:https://vimeo.com/220119035 “The Don’t Exist” documentary:https://youtu.be/2WZ_7Z6vbsg “As The Poet Said” documentary:https://vimeo.com/220116068 “Five Broken Cameras” documentary:https://youtu.be/TZU9hYIgXZw “Paradise Now” feature film:https://vimeo.com/510883804 “Abnadam” short film:https://youtu.be/I–r85cOoXM “Wedding of Galilee” feature film:https://youtu.be/dYMQw7hQI1U “Keffiyeh” feature film:https://vimeo.com/780695653 “Slingshot Hip Hop” documentary:https://youtu.be/hHFlWE3N9Ik “Tall al-Zaatar” documentary:https://youtu.be/Ma8H3sEbqtI “Tall al-Zaatar – The Secrets of the Battle” documentary:https://youtu.be/Ma8H3sEbqtI “In the Grip of the Resistance” documentary:https://youtu.be/htJ10ACWQJM “Swings” documentary:https://youtu.be/gMk-Zi9vTGs “Naji al-Ali: An Artist with Vision” documentary:https://youtu.be/Y31yUi4WVsU “The Upper Gate” documentary:https://vimeo.com/433362585 “In Search of Palestine” documentary:https://vimeo.com/184213685?1 “Salt of this Sea” feature film:https://bit.ly/3c10G3Z “Speak, Bird” documentary:https://youtu.be/wdkoxBjKM1Q “The Palestinian Exodus” series:https://bit.ly/3bXNAVp “I Am Jerusalem” series:https://bit.ly/3hG8sDV Keir Starmer remains silent, despite the Madleen being registered as a UK vessel, which obliges the UK to protect it under international law – and bans Israel fromanyattack on it unless it is engaged in piracy, which it self-evidently is not: Vessels are free to navigate the High Seas within the laws of their Flag State, and only a warship of their own nation has the right to intercept them unless they are committing an international crime such as piracy. However, a Downing Street spokesperson has just put out the following, weasel-worded statement that does nothing to intervene and comes days too late: The government wants Israel to resolve the situation around the ship heading for Gaza safely, with restraint, in line with international law. Israel has already breached international law. Starmer is useless for the UK and the world and collaborating with a hostile, terrorist state again. Please remember to support Skwawkbox if you can, to help ensure it can keep running. The site is provided free of charge but depends on the support of its readers to be viable. If you’d like to help it keep revealing the news as it is and not what the Establishment wants you to hear – and can afford to without hardship – pleaseclick hereto arrange a one-off or modest monthly donation via PayPal orhereto set up a monthly donation via GoCardless (Skwawkbox will contact you to confirm the GoCardless amount as it has to be entered by us). Alternatively, if you prefer to make a one-off or recurring donation by simple card payment, please use the form below: Choose an amount Or enter a custom amount Your support is hugely appreciated. Your support is hugely appreciated. Your support is hugely appreciated. Thanks for your solidarity so Skwawkbox can keep doing its job of inconveniencing the right and helping to build the left! If you wish to republish this post for non-commercial use, you are welcome to do so, but please include the donor information above – seeherefor more. **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on WhatsApp (Opens in new window)WhatsApp Click to email a link to a friend (Opens in new window)Email Click to share on Tumblr (Opens in new window)Tumblr **Like this:** **Related** **4 comments** The Toffeesays:09/06/2025 at 1:12 pmI wonder…does the mossad have compromising photos of keef? 😙🎶Loading...Replyexiledinardmhacasays:10/06/2025 at 7:22 amYeah they might well do.These shenanigans with the 3 Ukrainian ‘male models’ alleged to have fire bombed Sir Keirs former properties and car also adds fuel to the fire. Trial not on until April 2026. You what? Yeah apparently the police say the offences are for terrorist offences. Why the delay? If it is terrorist related surely they’d be up in court sooner? Only asking.Loading...Replywinteringhamsays:10/06/2025 at 7:35 amIt’s certainly a bizarre situation where an attack or boarding of a ship in the Red Sea is actually treated as an act of piracy that requires the Royal Navy to intervene. ands to escort British-flagged ships so that they are not boarded, and have a force out near the Horn of Africa to stop the locals boarding ships and holding them to ransom, BUT … a British flagged peaceful boat in international waters with threats against it being publicised in the world’s media, and forecast within a 24-hour timescale to be “dealt with” and an obvious act of piracy, sees our verbose politicians losing use of their tongues and our much vaunted Royal Navy looking the other way. Something smacks of personal interest in not upholding British interests.Loading...Reply I wonder…does the mossad have compromising photos of keef? 😙🎶 exiledinardmhacasays:10/06/2025 at 7:22 amYeah they might well do.These shenanigans with the 3 Ukrainian ‘male models’ alleged to have fire bombed Sir Keirs former properties and car also adds fuel to the fire. Trial not on until April 2026. You what? Yeah apparently the police say the offences are for terrorist offences. Why the delay? If it is terrorist related surely they’d be up in court sooner? Only asking.Loading...Reply Yeah they might well do.These shenanigans with the 3 Ukrainian ‘male models’ alleged to have fire bombed Sir Keirs former properties and car also adds fuel to the fire. Trial not on until April 2026. You what? Yeah apparently the police say the offences are for terrorist offences. Why the delay? If it is terrorist related surely they’d be up in court sooner? Only asking. winteringhamsays:10/06/2025 at 7:35 amIt’s certainly a bizarre situation where an attack or boarding of a ship in the Red Sea is actually treated as an act of piracy that requires the Royal Navy to intervene. ands to escort British-flagged ships so that they are not boarded, and have a force out near the Horn of Africa to stop the locals boarding ships and holding them to ransom, BUT … a British flagged peaceful boat in international waters with threats against it being publicised in the world’s media, and forecast within a 24-hour timescale to be “dealt with” and an obvious act of piracy, sees our verbose politicians losing use of their tongues and our much vaunted Royal Navy looking the other way. Something smacks of personal interest in not upholding British interests.Loading...Reply It’s certainly a bizarre situation where an attack or boarding of a ship in the Red Sea is actually treated as an act of piracy that requires the Royal Navy to intervene. ands to escort British-flagged ships so that they are not boarded, and have a force out near the Horn of Africa to stop the locals boarding ships and holding them to ransom, BUT … a British flagged peaceful boat in international waters with threats against it being publicised in the world’s media, and forecast within a 24-hour timescale to be “dealt with” and an obvious act of piracy, sees our verbose politicians losing use of their tongues and our much vaunted Royal Navy looking the other way. Something smacks of personal interest in not upholding British interests. I wonder…does the mossad have compromising photos of keef? 😙🎶 exiledinardmhacasays:10/06/2025 at 7:22 amYeah they might well do.These shenanigans with the 3 Ukrainian ‘male models’ alleged to have fire bombed Sir Keirs former properties and car also adds fuel to the fire. Trial not on until April 2026. You what? Yeah apparently the police say the offences are for terrorist offences. Why the delay? If it is terrorist related surely they’d be up in court sooner? Only asking.Loading...Reply Yeah they might well do.These shenanigans with the 3 Ukrainian ‘male models’ alleged to have fire bombed Sir Keirs former properties and car also adds fuel to the fire. Trial not on until April 2026. You what? Yeah apparently the police say the offences are for terrorist offences. Why the delay? If it is terrorist related surely they’d be up in court sooner? Only asking. Yeah they might well do.These shenanigans with the 3 Ukrainian ‘male models’ alleged to have fire bombed Sir Keirs former properties and car also adds fuel to the fire. Trial not on until April 2026. You what? Yeah apparently the police say the offences are for terrorist offences. Why the delay? If it is terrorist related surely they’d be up in court sooner? Only asking. winteringhamsays:10/06/2025 at 7:35 amIt’s certainly a bizarre situation where an attack or boarding of a ship in the Red Sea is actually treated as an act of piracy that requires the Royal Navy to intervene. ands to escort British-flagged ships so that they are not boarded, and have a force out near the Horn of Africa to stop the locals boarding ships and holding them to ransom, BUT … a British flagged peaceful boat in international waters with threats against it being publicised in the world’s media, and forecast within a 24-hour timescale to be “dealt with” and an obvious act of piracy, sees our verbose politicians losing use of their tongues and our much vaunted Royal Navy looking the other way. Something smacks of personal interest in not upholding British interests.Loading...Reply It’s certainly a bizarre situation where an attack or boarding of a ship in the Red Sea is actually treated as an act of piracy that requires the Royal Navy to intervene. ands to escort British-flagged ships so that they are not boarded, and have a force out near the Horn of Africa to stop the locals boarding ships and holding them to ransom, BUT … a British flagged peaceful boat in international waters with threats against it being publicised in the world’s media, and forecast within a 24-hour timescale to be “dealt with” and an obvious act of piracy, sees our verbose politicians losing use of their tongues and our much vaunted Royal Navy looking the other way. Something smacks of personal interest in not upholding British interests. It’s certainly a bizarre situation where an attack or boarding of a ship in the Red Sea is actually treated as an act of piracy that requires the Royal Navy to intervene. ands to escort British-flagged ships so that they are not boarded, and have a force out near the Horn of Africa to stop the locals boarding ships and holding them to ransom, BUT … a British flagged peaceful boat in international waters with threats against it being publicised in the world’s media, and forecast within a 24-hour timescale to be “dealt with” and an obvious act of piracy, sees our verbose politicians losing use of their tongues and our much vaunted Royal Navy looking the other way. Something smacks of personal interest in not upholding British interests. winteringhamsays:09/06/2025 at 1:13 pmThe man is utterly hopeless, clearly out of his depth even on his much-bragged-about legal qualifications.Loading...Reply The man is utterly hopeless, clearly out of his depth even on his much-bragged-about legal qualifications. The man is utterly hopeless, clearly out of his depth even on his much-bragged-about legal qualifications. **Leave a ReplyCancel reply** **Support the SKWAWKBOX via PayPal** **Support SKWAWKBOX via GoCardless** **SKWAWKBOX store** To support the SKWAWKBOX and raise awareness of the independent Left media,visit our storefor T-shirts, hoodies and more. **Recent articles** Israel abuses Madleen flotilla hostages, including hunger striker and French MEP Global March to Gaza starts tomorrow – here are its aims and where to follow it Skwawkbox runs on your support and nothing else. Here’s how to chip in if you can afford to Global March to Gaza starts tomorrow – here are its aims and where to follow it Flotilla volunteer on hunger strike as abducted crew fights for release **Click to be notified of new articles** Enter your email address to receive notifications of new posts by email. Email Address Subscribe **Follow SKWAWKBOX on Twitter** SKWAWKBOX privacy policy and GDPR information **Post navigation** SKWAWKBOX News, politics, insights, inside information from the left **Search this site** **Discover more from SKWAWKBOX** Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading **** **** ****"}