{"id": 5, "name": "12 News KPNX", "domain": "12news.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.12news.com/article/life/books/reading-arizona/new-york-times-bestselling-author-stop-in-phoenix-arizona-book-tour-for-new-graphic-novel-changing-hands-event-we-could-be-magic/75-be697aa6-b97e-4a1c-b0d9-092b398eb1c6", "title": "New York Times Bestselling Author Stop In Phoenix Arizona Book Tour For New Graphic Novel Changing Hands Event We Could Be Magic", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalValleyArizonaCrimeNation WorldNear MePoliticsI-Team12News en EspañolFeaturesLatest News StoriesSon of police officer sentenced to prison for hit-and-run crash in New RiverPolice officer's son sentenced to prison for manslaughter in Maricopa CountyDriver sentenced to prison for fatally hitting jogger in New RiverLIVE UPDATES: State rests, Lori Vallow Daybell not taking the stand in latest trial Back Local Valley Arizona Crime Nation World Near Me Politics I-Team 12News en Español Features Son of police officer sentenced to prison for hit-and-run crash in New RiverPolice officer's son sentenced to prison for manslaughter in Maricopa CountyDriver sentenced to prison for fatally hitting jogger in New River LIVE UPDATES: State rests, Lori Vallow Daybell not taking the stand in latest trial Back Local Valley Arizona Crime Nation World Near Me Politics I-Team 12News en Español Features Son of police officer sentenced to prison for hit-and-run crash in New RiverPolice officer's son sentenced to prison for manslaughter in Maricopa CountyDriver sentenced to prison for fatally hitting jogger in New River LIVE UPDATES: State rests, Lori Vallow Daybell not taking the stand in latest trial WeatherBackForecastRadar10-DayHourlyMapsTrafficHeatMonsoonSkyCamsLatest Weather StoriesExtreme Heat Watch issued for the lower deserts this weekendLe mostramos una comparación sorprendente entre el calor extremo de Phoenix y el de otras ciudades grandes de Estados Unidos Back Forecast Radar 10-Day Hourly Maps Traffic Heat Monsoon SkyCams Extreme Heat Watch issued for the lower deserts this weekend Le mostramos una comparación sorprendente entre el calor extremo de Phoenix y el de otras ciudades grandes de Estados Unidos Back Forecast Radar 10-Day Hourly Maps Traffic Heat Monsoon SkyCams Extreme Heat Watch issued for the lower deserts this weekend Le mostramos una comparación sorprendente entre el calor extremo de Phoenix y el de otras ciudades grandes de Estados Unidos SportsBackHigh School SportsCardinalsDiamondbacksSunsCoyotesMercuryASULocked On Podcast NetworkLatest StoriesThe Suns introduced new head coach Jordan Ott. Here's what he had to say.Diamondbacks' 5-run 6th inning leads to 10-3 win over Mariners Back High School Sports Cardinals Diamondbacks Suns Coyotes Mercury ASU Locked On Podcast Network The Suns introduced new head coach Jordan Ott. Here's what he had to say. Diamondbacks' 5-run 6th inning leads to 10-3 win over Mariners Back High School Sports Cardinals Diamondbacks Suns Coyotes Mercury ASU Locked On Podcast Network The Suns introduced new head coach Jordan Ott. Here's what he had to say. Diamondbacks' 5-run 6th inning leads to 10-3 win over Mariners SearchSearch:Search Advertise With Us Meet the Team Forecast 12 News en Español Arizona Midday TV Listings Contests Water Watch 12News on YouTube Things to Do Gas prices Today in AZ Those Who Serve Download Our App **New York Times bestselling author to stop in Arizona on book tour for new graphic novel** PHOENIX — It's always a good time for a graphic novel! New York Times bestselling author Marissa Meyer's latest book,We Could Be Magic, is a young adult graphic novel set in a theme park that comes out just in time for summer reading. Meyer is stopping in Arizona on her book tour and spoke with 12News all about her book and what she hopes readers love about this \"sparkly summer romance.\" Tabitha Laurie, the graphic novel's main character, lands her dream job at beloved theme park Sommerland's prestigious summer program. All she wants to do is land a coveted princess role and make magical memories for other kids, just like she has made at Sommerland. But she's got one problem: Tabi doesn't look like the other heroes and heroines at the theme park. What follows is Tabi's quest to find a happily ever after, filled with friends, her not-so-regal position at a nacho stand, and even a new crush. \"The theme for this book is very much don't let anyone tell you what you can and can't be,\" Meyer said. \"That's what I hope really comes across and a message I really think is important.\" Meyer said she wrote the book for curvy girls everywhere—including herself. As a child, she experienced similar challenges to Tabi. She, too, loved drama and auditioned for a role in a production ofLittle Womenas a teenager. Before she could read the part she practiced for—aspiring writer Jo March—the teacher casting the show told her she didn't fit the look for the sisters, and asked her to read for Aunt March instead. \"It crushed me,\" Meyer said. \"I was so upset and disappointed that this teacher looked at me and did not see my talent, did not see how excited I was, she just saw what my body looked like.\" That's why she said it was important to her to write a story featuring a curvy girl: because she was and is the girl you see on the page. \"I wanted to write a story for teen Marissa, and all of the girls out there who are being told because you don't look a certain way, you can't get what you want, or don't deserve love, or happy endings, whatever this thing is that you're dreaming about,\" Meyer said. \"That was the biggest inspiration for this book.\" This isn't Meyers' first graphic novel, but it's the first one she's worked on since 2018. She is an avid reader and grew up loving to read graphic novels, comics, and manga. \"When this story just kind of popped into my head and started to solidify as I was starting to figure out what I really wanted to say, I just saw it, I saw it in illustrated form,\" Meyer said. \"Probably it had something to do with writing a girl who is larger and curvier, and I didn't want there to be any question... I wanted you to see her and I wanted you to know.\" And while much of her process of writing graphic novels is the same as writing prose, Meyer said the work for graphic novels is slower at first, compared to her prose novels. \"I am the writer that likes to get it out as quickly as I can—don't overthink it, don't edit it—just write the story and then worry about revising it and making it better later; that's generally how I work with my prose novels,\" Meyer said. \"With the graphic novel, I find that a lot harder to do, because it's not just getting the story out. You have to pause at every single beat and ask, 'What does this moment look like?'\" Each moment is then described to the illustrator, who works on the panels and blends the author's words and vision with their art. While this makes for a longer first draft process, Meyer says revision is much faster because of it. \"This is the joy of writing graphic novels,\" Meyer said. \"...It is so much fun for me to be able to send a script off to the illustrator, in this case, the fabulously talented Joelle Murray, and then months later I start getting the sketches and the colored illustrations, and it kind of feels like I'm reading something for the first time... I love that part of the process.\" Meyer said she is excited to be on a book tour and is especially looking forward to meeting Murray in person. It's something Meyer said she thinks many readers don't know: that the author and illustrator may not have known one another prior to the project, or even get to meet in person while working together. \"We have spoken to each other once via Zoom, but we've never met in person,\" Meyer explained. \"I can't wait to actually be there to talk with her, because I have questions for her too... I can't wait to talk to her and hear some of her thoughts about behind the scenes and the steps that I wasn't aware of.\" Meyer will be stopping in the Valley as her second stop. She will be at Changing Hands in Phoenix at 6:30 p.m. on June 3. To buy tickets and for more information, visit theChanging Hands events page. \"I hope that I do meet young Marissa out there in the crowd, someone who is going through some of the things that I went through and experiencing it,\" Meyer said. \"I hope I meet someone who tells me 'This is the book I needed right now,' because this is the book that I needed back then.\" **Related Articles** Indie Bookstore Day is almost here! Where you can shop, support independent bookstores across State 48 The Valley's 'Bookmobile' brings reading to everyone. But they need your help. Valley author's newest rom-com set to hit shelves, ready for reading poolside **Watch 12News+ for free** You can now watch 12News content anytime, anywhere, thanks to the 12News+ app! The free 12News+ app from 12News lets users stream live events — including daily newscasts like \"Today in AZ\" and \"12 News\" and our daily lifestyle program, \"Arizona Midday\"—onRokuandAmazon Fire TV. 12News+ showcases live video throughout the day for breaking news, local news, weather and even an occasional moment of Zen showcasing breathtaking sights from across Arizona. Users can also watch on-demand videos of top stories, local politics, I-Team investigations, Arizona-specific features and vintage videos from the 12News archives. Roku:Add the channel from the Roku storeor by searching for \"12 News KPNX.\" Amazon Fire TV: Search for \"12 News KPNX\" tofind the free 12News+ app to add to your account, or have the 12News+ app delivered directly to your Amazon Fire TV through Amazon.com or the Amazon app. **Reading Arizona** Go beyond the TV broadcast and learn more about all things books in State 48 on the 12News app and YouTube channel. Subscribe for more digital-exclusive content! **** To stream 12News on your phone, you need the 12News app. **** **Download the 12News app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video In Other News **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}