{"id": 1343, "name": "That's Nonsense", "domain": "thatsnonsense.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thatsnonsense.com/an-hour-on-x-reveals-a-platform-riddled-with-spammers-and-misfiring-algorithms/", "title": "An Hour On X Reveals A Platform Riddled With Spammers And Misfiring Algorithms", "content": "NEWS ONLINE SAFETY FACT CHECK PROTECT YOUR DEVICEExpandEditor’s Choice Security Software Editor’s Choice Security Software Editor’s Choice Security Software VPNsExpandWhat is a VPN?Editor’s Choice VPNs What is a VPN? Editor’s Choice VPNs What is a VPN? Editor’s Choice VPNs **An hour on X reveals a platform riddled with spammers and misfiring algorithms** These days we don’t use X (Twitter) too much because of the high volume of spammers. Of course we copy and paste most of our articles to the platform so our comparatively smaller number of followers can see them, but usually that’s about it. But we do from time to time check in for an hour or so to see how the platform is faring and to see if they’ve made much progress. And today was one of those days. Well, oh dear. Logging in and the first thing we noticed is some bizarre trending hashtags in the “What’s Happening” section that is supposed to keep up with trending topics. The hashtag “#TT_WhatsApp_ОО966О54О6288З4” was featured, which seems an odd “topic”, and needless to say, when clicking on it to see what posts were using this hashtag, is soon became clear that it was being used almost exclusively by spammers to get engagement for their posts which were largely a mixture of random videos and poorly curated memes. There was no obvious reason why “#TT_WhatsApp_ОО966О54О6288З4” was specifically trending (for the better part of a day). It’s worth mentioning that the “What’s Happening” section (previously calledTrendingorExplore) used to be curated by humans, but this was replaced by AI during Elon Musk’s reign as X boss. Sponsored Content. Continued below… Also trending this hour was the #RefugeesWelcome hashtag, which seems like a far more normal topic that you’d expect to see on social media. Until, that is, you clicked on it. When clicking on a trending hashtag topic, you’re taken to the “top” tweets (xeets?) centred around that topic, which is the tweets that X’s algorithms have deemed both popular and relevant enough to appear as “top tweets”. However in this case, out of the top 10 “top” tweets, 6 were pornographic images and another showing a graphic injury. None related to the hashtag. Finally, in the hour we spent on X, take a look at the comments on our post highlighting the problem. Overrun by “account recovery” spammers. (More information on these scams inour post here.) All of these issues we experienced in only a handful of minutes using the platform, and are a reflection on how other users are reporting finding X. It’s all indicative of a platform that is increasingly overrun by spammers that are exploiting the algorithms that are becoming gradually worse at detecting and promoting good content in lieu of spam content. A platform that has become overly reliant on automation and has progressively balked at human moderation (a potential consequence on Muskcutting the X workforce by up to 80%). With reports suggesting the valuation of X is still at least 70% lower since Musk’s takeover, it will be interesting to see if this decline in moderation will have an adverse effect on actual engagement and active user figures. Continued below... Thanks for reading, we hope this article helped, but before you leave us for greener pastures, please help us out. We're hoping to be totally ad-free by 2025 - after all, no one likes online adverts, and all they do is get in the way and slow everything down. But of course we still have fees and costs to pay, so please, please consider becoming a Facebook supporter! It costs only 0.99p (~$1.30) a month (you can stop at any time) and ensures we can still keep posting Cybersecurity themed content to help keep our communities safe and scam-free. You cansubscribe here Remember, we're active on social media - so follow us onFacebook,Bluesky,InstagramandX Editor's Choice Security Software 2023 Beware “Podcast Invite” Scam Emails and MessagesJune 2, 2025 Beware Jobseeker “Add me on WhatsApp” ScamMay 28, 2025 Beware “Part Of Me Left You” Facebook ScamsMay 22, 2025 Did Simpsons predict Trump Death on April 12th 2025 – Fact CheckApril 7, 2025 An hour on X reveals a platform riddled with spammers and misfiring algorithmsFebruary 12, 2025 NEWS ONLINE SAFETY FACT CHECK PROTECT YOUR DEVICE VPNs © 2025 ThatsNonsense.com NEWS ONLINE SAFETY FACT CHECK PROTECT YOUR DEVICEToggle child menuExpandEditor’s Choice Security Software Editor’s Choice Security Software Editor’s Choice Security Software VPNsToggle child menuExpandWhat is a VPN?Editor’s Choice VPNs What is a VPN? Editor’s Choice VPNs What is a VPN? Editor’s Choice VPNs"}