{"id": 1608, "name": "WQAD - Moline News", "domain": "wqad.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wqad.com/article/news/politics/iowa-politics/2025-iowa-legislative-session-bills-kim-reynolds-eminent-domain-paid-parental-leave-state-budget-cellphone-ban-hands-free-driving/524-81e07c05-e70d-40b2-ba1c-f20c5ca53a38", "title": "2025 Iowa Legislative Session Bills Kim Reynolds Eminent Domain Paid Parental Leave State Budget Cellphone Ban Hands Free Driving", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalContests & DealsNear MeCrimeEntertainmentGMQCHard Work & DeterminationLifeNation WorldPodcastsPoliticsSchool ZoneLatest News Stories2 Clinton firefighters injured while responding to garage fireGarage fire response leaves 2 Clinton firefighters injured32 dogs rescued from neglect case in eastern IowaOfficials rescue 32 dogs from neglect case in eastern Iowa Back Local Contests & Deals Near Me Crime Entertainment GMQC Hard Work & Determination Life Nation World Podcasts Politics School Zone 2 Clinton firefighters injured while responding to garage fireGarage fire response leaves 2 Clinton firefighters injured 32 dogs rescued from neglect case in eastern IowaOfficials rescue 32 dogs from neglect case in eastern Iowa Back Local Contests & Deals Near Me Crime Entertainment GMQC Hard Work & Determination Life Nation World Podcasts Politics School Zone 2 Clinton firefighters injured while responding to garage fireGarage fire response leaves 2 Clinton firefighters injured 32 dogs rescued from neglect case in eastern IowaOfficials rescue 32 dogs from neglect case in eastern Iowa WeatherBackForecastBridges & TrafficClosings & DelaysMapsWeather KidsThree Degree GuaranteeLive CamsStormTrack 8 UniversityAsk AndrewSolar EclipseLatest Weather StoriesTopping 90 degrees today as humidity slowly climbsDoppler radar's secret weapon: How this product helps meteorologists spot tornadoes in real-time Back Forecast Bridges & Traffic Closings & Delays Maps Weather Kids Three Degree Guarantee Live Cams StormTrack 8 University Ask Andrew Solar Eclipse Topping 90 degrees today as humidity slowly climbs Doppler radar's secret weapon: How this product helps meteorologists spot tornadoes in real-time Back Forecast Bridges & Traffic Closings & Delays Maps Weather Kids Three Degree Guarantee Live Cams StormTrack 8 University Ask Andrew Solar Eclipse Topping 90 degrees today as humidity slowly climbs Doppler radar's secret weapon: How this product helps meteorologists spot tornadoes in real-time SportsBackThe ScoreLocked On Podcast NetworkLatest StoriesRickie Fowler will tee off in the 2025 John Deere ClassicScore Sunday: Talking with the Assumption girls' soccer team following state win Back The Score Locked On Podcast Network Rickie Fowler will tee off in the 2025 John Deere Classic Score Sunday: Talking with the Assumption girls' soccer team following state win Back The Score Locked On Podcast Network Rickie Fowler will tee off in the 2025 John Deere Classic Score Sunday: Talking with the Assumption girls' soccer team following state win SearchSearch:Search Advertise With Us News 8+ Stream Schedule As Seen On TV TV Listings JDC 2025 Preview Meet the Team Contact Us The Current Radars Contests Sports Ask Andrew Gas Prices Pay It Forward Download News 8+ Submit Animal Photos Deals BREWED The Score Beyond the Badge My Favorite Teacher **What notable bills passed the Iowa Legislature this session?** **** To stream News 8 on your phone, you need the News 8 app. **** **Download the News 8 app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video DES MOINES, Iowa — Iowa lawmakers worked through Wednesday and into Thursday morning toend the 2025 legislative session. It was a longer-than-normal session. Lawmakers worked for two weeks without pay, because they couldn't get appropriations and budget bills done before their May 2 deadline for this year. But now with the session done, let's take a look at some of the notable bills the Iowa Legislature passed in 2025. Last month, Republican Gov. Kim Reynolds signed a law to set a statewide policy aimed at curbingcellphone usein the classroom after many school districts showed promise with their own restrictions. School districts will now be able to impose a stricter policy based on the state’s minimum proposal. Phones were a big talker this session. Reynolds also signed a law to prohibit drivers from using their phones while driving, unless it's in a \"hands-free\" mode. Drivers will be limited to a single touch or have to use “verbal commands” to turn your device on or off, or to complete “a function” like calling someone. Iowans will only be able to fully use their phones while at a complete stop — off the roadway. Here’s how law enforcement said they’dcheck for distracted drivers. “We’re going to have some common sense with this,\" explained Prairie City Police Chief Kevin Gott. \"There’s going to have to be something that leads up to that. Like the swerving in-and-out, not paying attention, staying a long time at a stop sign. There’s gotta be some reason to think that driver is being distracted.” Lawmakers also passed the governor’s priority to offerpaid parental leavefor state employees. Currently, state employees get no time off for the birth of a child. Now, state workers will receive four weeks of paid maternity leave and one week of paid paternity leave. Four weeks of paid leave will also be given to state employees who adopt a child. Part of the reason the Iowa Legislature went so far into overtime this session was because Senate Republicans disagreed on property owners’ rights. Earlier this month,12 Republican state senatorssurprised many after they signed a letter to oppose any state budget bills until legislation passed to restrict the use of eminent domain for carbon pipeline projects. The legislature passed its bill — putting theSummit Carbon Solutions' pipeline projectin tough odds. Now, the bill is available for Reynolds to sign, but it's unclear whether she will. **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}