{"id": 1719, "name": "FaithPanda", "domain": "faithpanda.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://faithpanda.com/robert-de-niro-shares-heartfelt-parenting-rule-after-daughter-comes-out-as-transgender/", "title": "Robert De Niro Shares Heartfelt Parenting Rule After Daughter Comes Out As Transgender", "content": "Menu Search for News Family Celebrity Music Animals Humor Wellness **Robert De Niro shares heartfelt parenting rule after daughter comes out as transgender** **The Oscar-winning actor opens up about love, acceptance, and fatherhood across generations** At 81, Robert De Niro says parenting still comes down to one simple thing: always support your children. That message has taken on new meaning after his daughter, Airyn, recently came out as transgender. In a recent interview withEntertainment Tonight, De Niro reflected on his evolving journey as a father. With children ranging from 57 years old to just 2, he says one rule remains constant. “The main thing is to support your kids,” he said. “As long as they’re not hurting themselves or doing anything destructive, you have to support them, period.” His words came soon after his 29-year-old daughter, Airyn De Niro, publicly came out as transgender in an interview withThemmagazine. **Airyn’s brave step into the spotlight** For most of her life, Airyn stayed out of the public eye. That changed when a media outlet outed her without her consent, misgendering her and calling her a “nepo baby.” In response, Airyn decided to tell her own story. “I feel like I’m meant to be doing this,” she said about living openly. While she was nervous about how her famous family might react, her father’s love gave her confidence. “I love and support Airyn as my daughter,” De Niro shared. “I don’t know what the big deal is. I love all my children.” Airyn also expressed gratitude for how her parents protected her privacy as a child. “They wanted me to have as normal a childhood as possible,” she said. De Niro’s youngest daughter, Gia, recently turned two. He shares her with his girlfriend, Tiffany Chen, whom he met on the set ofThe Internin 2015. Speaking about little Gia, De Niro said, “She’s just pure joy.” He added that, while parenting changes as kids grow up, the love remains the same. De Niro and Chen began dating in 2021 and welcomed Gia quietly in 2023, making her his seventh child. Despite his fame and decades-long career, De Niro seems to find his deepest purpose in being a dad. From dealing with Hollywood fame to navigating personal milestones, De Niro’s parenting style stays rooted in love and acceptance. In a world where public figures are often criticized or put on pedestals, his message is refreshingly simple: support your children, no matter what. His story is not just about being a famous actor—it’s about being a present and caring father. “They have to know that you support them. Always,” he said. That message may be the most important role he’s ever played. **Related Articles** **Michael Jackson’s son makes a rare public appearance, and fans can’t believe how much he looks like his dad** **From $150 a month to farm life— actor’s journey with famous wife stuns fans** **Clint Eastwood’s longtime partner Christina Sandera’s cause of death revealed** **Geico Caveman actor finally revealed—here’s what he looks like now** **What Melania Trump really thinks about Elon Musk** **JD Vance had surgery just before becoming vice president** FamilySon begins to vomit and turns blue after thanksgiving dessert—mom later discovers deadly mistakeMay 23, 2023 CelebrityTop GOP strategist raises alarm over Trump’s health— ‘He may not finish his term’6 days ago NewsMother of slain sisters blames Amber Alert failure – “The system let my children down”6 days ago Privacy Terms Contact DMCA Cookie Policy (EU) Facebook X YouTube Instagram Facebook X YouTube Instagram **Adblock Detected** **Help Support Our Website**"}