{"id": 460, "name": "KSTU - Salt Lake City News", "domain": "fox13now.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.fox13now.com/news/local-news/northern-utah/man-arrested-after-allegedly-fighting-cops-and-failing-to-steal-a-car-with-manual-transmission", "title": "Man Arrested After Allegedly Fighting Cops And Failing To Steal A Car With Manual Transmission", "content": "Menu NewsLocal NewsNational NewsSaving SmarterGreat Salt Lake CollaborativePositively UtahUniquely UtahHealthPoliticsSports Local News National News Saving Smarter Great Salt Lake Collaborative Positively Utah Uniquely Utah Health Politics Sports Local News National News Saving Smarter Great Salt Lake Collaborative Positively Utah Uniquely Utah Health Politics Sports Weather Traffic FOX 13 Investigates AirView Good Day Utah The PlaceBe a Guest on The PLACERecipes Be a Guest on The PLACE Recipes Be a Guest on The PLACE Recipes CommunityErase School Lunch DebtCool SchoolsRecipesSuper SeniorsLifetime AdventuresZero Hunger HeroGive a Child a BookDream Team Erase School Lunch Debt Cool Schools Recipes Super Seniors Lifetime Adventures Zero Hunger Hero Give a Child a Book Dream Team Erase School Lunch Debt Cool Schools Recipes Super Seniors Lifetime Adventures Zero Hunger Hero Give a Child a Book Dream Team Your Voice Recipes Contests Utah Mammoth Wellness Wednesday UTAH 16 Healthier Together About UsNews TeamContact UsTV ListingsSeen on FOX 13 NewsJobs at FOX 13Moving Forward News Team Contact Us TV Listings Seen on FOX 13 News Jobs at FOX 13 Moving Forward News Team Contact Us TV Listings Seen on FOX 13 News Jobs at FOX 13 Moving Forward Advertise with Us Sign In Newsletters Sign Out Manage Emails Apps Careers Search Weather Local News Community FOX 13 Investigates Good Day Utah The PLACE Utah Mammoth Saving Smarter Dream Team Utah 16 Scripps News Contests AirView VIP Newsletter **Actions** Facebook Tweet Email **Man arrested after allegedly fighting cops and failing to steal a car with manual transmission** SALT LAKE CITY — A Utah man is in custody and being held without bail after police say he stole one vehicle, attempted to steal another, and fought with a Salt Lake City police officer. Bentley Estelivin Scow, 46, was arrested on Tuesday. According to court documents, police were called to search for a suspect who had attempted to steal a woman's car at a 7-Eleven on 2100 South. The victim told officers that the suspect, identified as Bentley Scow, had been chased off to the south. An officer was able to locate Scow near a UTA rail line at 600 South. The officer announced his presence and ordered Scow to stop, which he failed to do. Scow was followed and eventually stopped, and he fought with the officer before being taken into custody. Detectives reviewed video footage from the 7-Eleven showing Scow follow the owner of the vehicle into the store before going back outside and attempting to leave with it. However, the vehicle had a manual transmission, which hindered his attempt. Investigators took Scow into custody and say that once in jail found drugs inside his front pocket. When officers attempted to ask Scow for his name, he refused to be ID'd. However, another police officer was able to ID Scow by recognizing him from previous charges. That charge was when police say they found Scow getting out of another stolen vehicle at 1810 West 900 North behind Escalante Elementary. When Scow saw police at that scene, he was able to jump on a bicycle and flee. Inside the vehicle, officers found two baggies they claim contained meth. The victim told police that their credit cards, laptop, phone, and gold earrings were missing from the vehicle. Detectives say Scow admitted to the theft when police officers explained the charges to him. Bentley Estelivin Scow now faces charges of assault on a peace officer, failure to stop at the command of law enforcement, failure to disclose identity, two charges of theft of a motor vehicle, unlawful possession of a financial card, and possession of a controlled substance. Recent Northern Utah Stories Bridal Veil Falls centerpiece of proposed land swapJeff Tavss **Bridal Veil Falls centerpiece of proposed land swap** Jeff Tavss **Bridal Veil Falls centerpiece of proposed land swap** Jeff Tavss **Bridal Veil Falls centerpiece of proposed land swap** Jeff Tavss Intersection reopens following crash that seriously injured motorcyclistMichael Martin **Intersection reopens following crash that seriously injured motorcyclist** Michael Martin **Intersection reopens following crash that seriously injured motorcyclist** Michael Martin **Intersection reopens following crash that seriously injured motorcyclist** Michael Martin Young black bear euthanized after losing 'fear of people'Mythili Gubbi **Young black bear euthanized after losing 'fear of people'** Mythili Gubbi **Young black bear euthanized after losing 'fear of people'** Mythili Gubbi **Young black bear euthanized after losing 'fear of people'** Mythili Gubbi Orem boy suffers third-degree burns attempting social media trendJulia Sandor **Orem boy suffers third-degree burns attempting social media trend** Julia Sandor **Orem boy suffers third-degree burns attempting social media trend** Julia Sandor **Orem boy suffers third-degree burns attempting social media trend** Julia Sandor **Sign up for theBreaking News Newsletterand receive up to date information.** **now signed up to receive theBreaking NewsNewsletter.** About Us **Watch FOX 13 News on your favorite streaming device anytime, anywhere** About Us **Watch FOX 13 News on your favorite streaming device anytime, anywhere** News Traffic Weather Community Support Sitemap Advertise with Us Do Not Sell My Info Privacy Policy Privacy Center Terms of Use EEO FCC Public Files FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact Careers fox13newsutah fox13now fox13"}