{"id": 1013, "name": "National Institutes of Health (NIH)", "domain": "nih.gov", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.niaaa.nih.gov/publications/brochures-and-fact-sheets/talk-with-your-high-school-grads-about-celebrating-safely", "title": "Talk With Your High School Grads About Celebrating Safely", "content": "Due to HHS and NIH restructuring, as of March 2025, this website will be maintained, but no new content will be added. An official website of the United States government Here’s how you know Official websites use .govA.govwebsite belongs to an official government organization in the United States. Secure .gov websites use HTTPSAlock(LockLocked padlock icon) orhttps://means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites. Alcohol's Effects on HealthAlcohol's Effects on HealthAlcohol TopicsGetting HelpAlcohol Facts and StatisticsNIAAA Short Takes Video Series​​​​​​​Alcohol Interventions for Young Adults Alcohol's Effects on Health Alcohol Topics Getting Help Alcohol Facts and Statistics NIAAA Short Takes Video Series ​​​​​​​Alcohol Interventions for Young Adults Alcohol's Effects on Health Alcohol Topics Getting Help Alcohol Facts and Statistics NIAAA Short Takes Video Series ​​​​​​​Alcohol Interventions for Young Adults Health Professionals & CommunitiesHealth Professionals & CommunitiesNative Communities: Alcohol Intervention Review (NativeAIR)The Healthcare Professional's Core Resource on AlcoholResources from the NIAAA College Task ForceAlcohol Interventions for Young AdultsAlcohol Screening & Brief Intervention for YouthSurveillance ReportsAdditional Reports and Resources Health Professionals & Communities Native Communities: Alcohol Intervention Review (NativeAIR) The Healthcare Professional's Core Resource on Alcohol Resources from the NIAAA College Task Force Alcohol Interventions for Young Adults Alcohol Screening & Brief Intervention for Youth Surveillance Reports Additional Reports and Resources Health Professionals & Communities Native Communities: Alcohol Intervention Review (NativeAIR) The Healthcare Professional's Core Resource on Alcohol Resources from the NIAAA College Task Force Alcohol Interventions for Young Adults Alcohol Screening & Brief Intervention for Youth Surveillance Reports Additional Reports and Resources ResearchResearchMajor Research InitiativesExtramural Research ProgramIntramural Research ProgramAlcohol Research Resource (R24) AwardsNIAAA SBIR/ STTR ProgramData Archive and Resources Research Major Research Initiatives Extramural Research Program Intramural Research Program Alcohol Research Resource (R24) Awards NIAAA SBIR/ STTR Program Data Archive and Resources Research Major Research Initiatives Extramural Research Program Intramural Research Program Alcohol Research Resource (R24) Awards NIAAA SBIR/ STTR Program Data Archive and Resources Research TrainingResearch TrainingTraining Grants by EligibilityTraining Grants by MechanismResearch Training ResourcesCenters and Training Working Group Roster Research Training Training Grants by Eligibility Training Grants by Mechanism Research Training Resources Centers and Training Working Group Roster Research Training Training Grants by Eligibility Training Grants by Mechanism Research Training Resources Centers and Training Working Group Roster Grants & FundingGrants & FundingNIAAA Statement on Research Priorities and ProceduresFunding OpportunitiesPrepare Your Application and ApplyAfter You ApplyManage Your Award Grants & Funding NIAAA Statement on Research Priorities and Procedures Funding Opportunities Prepare Your Application and Apply After You Apply Manage Your Award Grants & Funding NIAAA Statement on Research Priorities and Procedures Funding Opportunities Prepare Your Application and Apply After You Apply Manage Your Award News & EventsNews & EventsNewsEventsPress RoomSocial MediaVideosSpectrum News & Events News Events Press Room Social Media Videos Spectrum News & Events News Events Press Room Social Media Videos Spectrum About NIAAAAbout NIAAANIAAA Advisory CouncilStrategic Plan: Fiscal Years 2024–2028Our WorkOur FundingOur StaffCareers & TrainingContact UsHistory About NIAAA NIAAA Advisory Council Strategic Plan: Fiscal Years 2024–2028 Our Work Our Funding Our Staff Careers & Training Contact Us History About NIAAA NIAAA Advisory Council Strategic Plan: Fiscal Years 2024–2028 Our Work Our Funding Our Staff Careers & Training Contact Us History Join a Clinical Study Getting Help Donate Alcohol's Effects on Health Research-based information on drinking and its impact. **Breadcrumb** Home Alcohol's Effects on Health Parents—Talk With Your High School Grads About Celebrating Safely **Parents—Talk With Your High School Grads About Celebrating Safely** **Graduation** Before your high school graduate celebrates, talk with them about keeping events alcohol free. It may save a life! No amount of underage drinking is safe. And we know that underage drinking can lead to consuming too much alcohol, which may result in poor decisions, injuries, alcohol overdose, and possibly death. **It’s About Your Teen** A teenager’s brain is still developing, and it is very sensitive to alcohol’s effects on judgment and decision-making. Tragedies can—and do—happen, so underage drinking should not be a part of any end-of-year celebration. **The Effects of Alcohol Can Be Deceptive** If you are asked to explain the reasons behind your rules, you can describe the effects of alcohol on the human body. When people drink alcohol, they may temporarily feel elated and happy, but they should not be fooled. As blood alcohol level rises, the effects on the body—and the potential risks—multiply. For example: Inhibitions and memory become affected, so people may say and do things that they will regret later and possibly not remember doing at all. Decision-making skills are affected, so people may be at greater risk for driving under the influence—and risking an alcohol-related traffic crash—or making unsafe decisions about sex. Aggression can increase, potentially leading to everything from verbal abuse to physical fights. Coordination and physical control are also impacted. When drinking leads to loss of balance, slurred speech, and blurred vision, even normal activities can become more dangerous. Consuming a dangerously high amount of alcohol can also lead to alcohol overdose and death. When people drink too much, they may eventually pass out (lose consciousness). Reflexes like gagging and breathing can be suppressed. That means people who have had too much alcohol could vomit and choke, or just stop breathing completely. The risk of an overdose can increase if alcohol is consumed while taking opioids or sedative hypnotics, such as sleep and anti-anxiety medications. Combining these medications with alcohol can be dangerous and life-threatening. **Think About It!** Drinking to celebrate graduation can result in vandalism, arrests, sexual assaults, injuries and trips to the emergency room, alcohol-related traffic crashes, and worse. Drinking by teens can put them—and their friends—in real danger. Ask them to consider this question: Is that any way to celebrate? **Talk With Your Graduate** It is critical to talk with your graduate because research shows that parents do make a difference. By serving as a positive role model, talking with other parents and your teens, supervising parties to make sure no alcohol is served, and supporting alcohol-free school celebrations, you can help prevent a life-changing mistake. **Remember …** Tell your graduate to play it safe and party right—and alcohol-free—at graduation, because a well-deserved celebration shouldn’t end in tragedy. **A Word About Alcohol Overdose** Thousands of students are transported to the emergency department each year for alcohol overdose, which occurs when high levels of alcohol suppress the nervous and respiratory systems. Signs of this dangerous condition can include: Slow or irregular breathing Slow or irregular breathing Slow or irregular breathing Vomiting Vomiting Vomiting Mental confusion, stupor, loss of consciousness, or coma Mental confusion, stupor, loss of consciousness, or coma Mental confusion, stupor, loss of consciousness, or coma Hypothermia or low body temperature, bluish or pale skin Hypothermia or low body temperature, bluish or pale skin Hypothermia or low body temperature, bluish or pale skin An alcohol overdose can lead to permanent brain damage or death, so a person showing any of these signs requires immediate medical attention. If you or your graduate notices any of these signs, don’t wait. Call 911 if you suspect an alcohol overdose. **For more information, please visit:collegedrinkingprevention.gov** Print Updated:September 2024 Site Map Contact Us Disclaimer Alcohol Policy Information System Alcohol Research: Current Reviews (ARCR) Alcohol Treatment Navigator College Drinking Prevention NIAAA Facts About Teen Drinking NIAAA Spectrum Rethinking Drinking niaaa.nih.gov An official website of theNational Institutes of Healthand theNational Institute on Alcohol Abuse and Alcoholism About NIAAA Accessibility FOIA Privacy Policy Vulnerability Disclosure"}