{"id": 48, "name": "Adweek", "domain": "adweek.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.adweek.com/agencies/the-outsider-candidates-the-ad-industry-thinks-could-replace-mark-read/", "title": "The Outsider Candidates The Ad Industry Thinks Could Replace Mark Read", "content": "Agencies Brands Creativity Media TV Commerce Tech Creators **Leadership & Talent** **The Outsider Candidates the Ad Industry Thinks Could Replace Mark Read** **Industry insiders believe WPP's next leader will not be an internal promotion** As soon as news broke of Mark Read’s decisionto step down from the helm of WPPat the end of the year without a successor, the adland rumor mill went into overdrive trying to identify who might be WPP’s next leader. A source with direct knowledge of the matter told ADWEEK no decision had been made on who would fill the chief executive (CEO) role. WPP’s board is currently conducting a full search and interviewing both external and internal applicants. That hasn’t stopped the publication of reports hedging bets on which current WPP execs might replace Read. Names in the mix include WPP Media CEO Brian Lesser; Ogilvy CEO Devika Bulchandani; VML CEO Jon Cook; and Johnny Hornby, CEO of WPP’s communications agency division, who was recently appointed to the executive committee. However, multiple industry heavyweights told ADWEEK they believe the next leader of WPP will likely come from outside the company, or perhaps even the agency world altogether. Beyond finding an industry veteran with experience running a public company, the most difficult task for WPP’s board will be finding someone with an appetite for a major turnaround job. “The fact that WPP announced the news without a succession plan says just how bad [the board] thinks things are,” one senior ad industry leader told ADWEEK anonymously. Amid AI’s encroachment into the ad industry, which the WPPhas been investing in to get ahead of, the same exec likened the mandate to “rearranging deck chairs on the Titanic.” “It’s pretty much impossible to think that WPP will return to growth; whoever it puts in there is in a complex and challenging position,” the source added. The same source pitched Hornby and WPP’s chief technology officer, Stephan Pretorius, as the best internal bets—but noted that it could bring in fresh talent to address its problems. Below, we highlight some outsider candidates that industry leaders believe could take the reins of WPP following Read’s departure in December 2025. Philip Jansen is technically an outsider, albeit a very close one. The former British Telecommunications (BT) CEO has had his eye on Read’s exit since he was named chairman of WPP’s board in September of 2024. According toa report in The Guardian, the two executives had a good working relationship. However, Jansen had reportedly been maneuvering to make changes to WPP’s leadership before he officially started in the role. Jansen has not only the public company experience for the job, but also the willingness to be ruthless in the name of transforming a legacy business. While leading BT in 2018, he enacted a plan to cut 55,000 jobs by 2030 while trimming costs by $3.7 billion by 2025. But why would Jansen want to take on the role that currently reports into him? Sources say he might be eager to get back into the CEO seat. The executive chair of Nielsen stepped back from his position as CEO nearly two years ago after five years on the job. His diverse resume includes running Digitas as CEO for 10 years and leading IBM Watson and Cognitive Solutions as SVP, giving him a unique mix of agency and tech expertise. From his time at Nielsen, Kenny not only has experience as a public company leader, but also as the leader of a large, legacy firm in transformation. Kenny’s tenure was marked by massive changes in the measurement space and its fight to maintain relevance with new products like NielsenOne. But would Kenny want to take on another transformation job, or is he happy to continue to preside over Nielsen’s own turnaround? Two sources told ADWEEK they could see Clark as a potential candidate for Read’s job. She would bring deep industry expertise fromher tenure as global CEO of DentsuInternational, where she led a sweeping transformation of the Japanese-headquartered agency network, integrating operations across 145 global markets for 45,000 staff. Dentsu retained its biggest U.S. clients during this period, with 95% staying on the roster during Clark’s transition. This sticking power shows her potential to radically evolve WPP without shedding big business. In 2024, Clark joined global advisory and investment platform Consello, where she is now president. With previous leadership roles at Coca-Cola (a big WPP client) and AT&T, Clark also has plenty of brand experience under her belt. This could prove more than useful under WPP Media’s plan to provide clients with bespoke cross-agency teams. As former CEO of Google EMEA, London-based Matt Brittin spent nearly two decades rising through the ranks of the tech giant’s European market. During his tenure, he grew Google from a market valuation of about $215 billion to $2 trillion. He also helped bring its tech business closer together with the marketing and sales division. Brittin’s experience inside a tech giant would be valuable at WPP, as it aims to become a tech-enabled business with AI at its core. While at Google’s helm, Brittin was sometimes in the line of fire after controversies such as the company’s U.K. tax deal in 2016, which some critics saw as too lenient. He’s got the leadership chops to make tough or unpopular decisions and guide a business through choppy waters. Would WPP’s dilemmas dissuade him from the job, after years of weathering public scrutiny and Google’s big challenges? Some other outlier names floated during ADWEEK’s conversations with industry veterans and insiders included Charlie Collier, president at Roku Media, and BT chair Adam Crozier, who oversees the board of Jansen’s previous employer. While industry luminary David Droga, founder of Droga5, whorecently announced plans to step down as CEO of Accenture Song, has been referenced in some reports, two non-WPP sources ADWEEK spoke with quashed that speculation. One former WPP exec said whoever is chosen for the CEO role, however brilliant they are, will have to do something “radical” to return WPP to its former glory and “signify that it is genuinely transforming” amid low morale and a slumping share price. Whoever WPP selects to succeed Read won’t just inherit a title, but also the monumental task of redefining what the company stands for and charting its next moves in an era of consolidation, AI, and client cutbacks. Rebecca is Adweek's Europe brand editor. Brittaney is Adweek's creative editor based in London. Alison Weissbrot is executive editor at ADWEEK, overseeing agency, brand and creative news coverage. She was previously editor in chief of Campaign US and spent nearly five years at AdExchanger covering agencies and convergent TV. She is based in New York. **The Latest** **Agencies** Greenspoon steps in for interim CEO Wayne Levings Greenspoon steps in for interim CEO Wayne Levings She takes on the global role while continuing as CEO of FCB New York She takes on the global role while continuing as CEO of FCB New York About Us Contact Us Media Kit Editorial Calendar Event Calendar Marketing Vanguard Sponsor Content Industry Job Openings Subscription Options FAQs Newsletters Customer Service ADWEEK Connect ADWEEK Events Awards On-Demand Webinars Trophies / Awards / Seals Webinars ADWEEK Podcast Network Back Issues Buy Vintage Ads Reprints / E-Prints RSS Do not sell my personal information Terms of Use Privacy Policy"}