{"id": 2073, "name": "National Republican Senatorial Committee", "domain": "nrsc.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.nrsc.org/press-releases/nrsc-on-jon-ossoffs-silence-on-the-antisemitic-terror-attack-in-colorado-unacceptable-2025-06-02/", "title": "Nrsc On Jon Ossoffs Silence On The Antisemitic Terror Attack In Colorado Unacceptable 2025 06 02", "content": "CONTRIBUTE UPDATES ACTION CENTER STATES ABOUT USCONTACT US CONTACT US CONTACT US **NRSC on Jon Ossoff’s Silence on the Antisemitic Terror Attack in Colorado: ‘Unacceptable’** WASHINGTON, D.C. —Senator Jon Ossoff has remained silent on the antisemitic terrorist attack in Colorado yesterday. Reporting earlier this year indicated Ossoff haslost supportfrom Georgia’s Jewish community for his appeasement of the pro-Hamas radicals in the Democrat Party. “Jon Ossoff is so desperate to appease the far-left, pro-Hamas radicals in his Party that he can’t condemn an illegal alien that lit pro-Israel protesters on fire while screaming ‘Free Palestine,'”said NRSC Communications Director Joanna Rodriguez. “It’s unacceptable and Georgia deserves better.” **Help us take back the Senate** Email* Cell Phone Text Opt inYes, I would like to receive text messagesBy providing your phone number and checking the box, you are consenting to receive marketing texts, including autodialed and automated texts, to that number with campaign notifications from the NRSC (55404). NRSC is happy to help at (202) 675-6000. Reply HELP for help, STOP to end. Msg&DataRatesMayApply. Message frequency may vary. SMS opt-in will not be sold, rented, or shared. Messages may include requests for donation. Terms and Conditionshttp://bit.ly/2Xax3XL.Privacy Policyhttps://www.nrsc.org/privacy-policy Yes, I would like to receive text messages By providing your phone number and checking the box, you are consenting to receive marketing texts, including autodialed and automated texts, to that number with campaign notifications from the NRSC (55404). NRSC is happy to help at (202) 675-6000. Reply HELP for help, STOP to end. Msg&DataRatesMayApply. Message frequency may vary. SMS opt-in will not be sold, rented, or shared. Messages may include requests for donation. Terms and Conditionshttp://bit.ly/2Xax3XL.Privacy Policyhttps://www.nrsc.org/privacy-policy Yes, I would like to receive text messages By providing your phone number and checking the box, you are consenting to receive marketing texts, including autodialed and automated texts, to that number with campaign notifications from the NRSC (55404). NRSC is happy to help at (202) 675-6000. Reply HELP for help, STOP to end. Msg&DataRatesMayApply. Message frequency may vary. SMS opt-in will not be sold, rented, or shared. Messages may include requests for donation. Terms and Conditionshttp://bit.ly/2Xax3XL.Privacy Policyhttps://www.nrsc.org/privacy-policy GFI Tracking: Basic DataOrigin URLPage TitleSource URLQuery StringDateTime GFI Tracking: UTM DataUTM SourceUTM MediumUTM Campaign By providing your phone number, you are joining a recurring text messaging program for the NRSC AboutAbout UsContact Us About Us Contact Us About Us Contact Us NewsUpdates Updates Updates ActionAction CenterStates Action Center States Action Center States Text WIN to 55404 to receive mobile alerts.By providing your phone number and checking the box, you are consenting to receive marketing texts, including autodialed and automated texts, to that number with campaign notifications from the NRSC (55404). NRSC is happy to help at (202) 675-6000. Reply HELP for help, STOP to end.Msg&DataRatesMayApply. Message frequency may vary. SMS opt-in will not be sold, rented, or shared. Messages may include requests for donation.Terms and Conditionshttp://bit.ly/2Xax3XL.Privacy Policyhttps://www.nrsc.org/privacy-policy© 2025 NRSCTerms & Conditions|Privacy Policy Paid for by NRSC. Not authorized by any candidate or candidate's committee. NRSC.org"}