{"id": 314, "name": "Daily Camera", "domain": "dailycamera.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.dailycamera.com/2025/06/11/letters-to-the-editor-adams-doesnt-represent-me-do-not-conflate-antisemitism-and-anti-zionism-alexander-hamilton-calls-for-impeachment/", "title": "Letters To The Editor Adams Doesnt Represent Me Do Not Conflate Antisemitism And Anti Zionism Alexander Hamilton Calls For Impeachment", "content": "e-Edition e-Edition NewsNewsBoulder Area NewsCU NewsCrime & Public SafetyEducationHealthBusinessBest ReviewsBusiness SpotlightPoliticsScience & Environment NewsWeatherWorld NewsElection News Boulder Area News CU News Crime & Public Safety Education Health Business Best Reviews Business Spotlight Politics Science & Environment News Weather World News Election News Boulder Area News CU News Crime & Public Safety Education Health Business Best Reviews Business Spotlight Politics Science & Environment News Weather World News Election BuffzoneCollege: FootballCollege: BasketballCollege: LacrosseCollege: SoccerCollege: Other SportsCollege: VolleyballBuffzone: Photos and VideosCollege: Cross Country / TrackBuffzone.com PodcastsCollege: GolfCollege: Opponent previewCollege: SkiingCollege: Sport SchedulesCollege: Men’s BasketballCollege: Women’s Basketball College: Football College: Basketball College: Lacrosse College: Soccer College: Other Sports College: Volleyball Buffzone: Photos and Videos College: Cross Country / Track Buffzone.com Podcasts College: Golf College: Opponent preview College: Skiing College: Sport Schedules College: Men’s Basketball College: Women’s Basketball College: Football College: Basketball College: Lacrosse College: Soccer College: Other Sports College: Volleyball Buffzone: Photos and Videos College: Cross Country / Track Buffzone.com Podcasts College: Golf College: Opponent preview College: Skiing College: Sport Schedules College: Men’s Basketball College: Women’s Basketball High School SportsPreps: Cross CountryPreps: FootballPreps: Boys GolfPreps: GymnasticsPreps: Boys SoccerPreps: SoftballPreps: Boys TennisPreps: VolleyballPrep Sports: All SportsPreps: Boys BasketballPreps: Girls BasketballPreps: Ice hockeyPreps: SkiingPreps: WrestlingPreps: Girls SwimmingPreps: BaseballPreps: Girls GolfPreps: LacrossePreps: Girls SoccerPreps: Boys SwimmingPreps: Girls TennisPreps: Track and FieldPreps: Boys Track and FieldPreps: Girls Track and FieldPreps: Photos and VideosPreps: Alumni CornerBoulder Valley School DistrictSt. Vrain Valley School DistrictWinter SportsFall SportsSpring Sports Preps: Cross Country Preps: Football Preps: Boys Golf Preps: Gymnastics Preps: Boys Soccer Preps: Softball Preps: Boys Tennis Preps: Volleyball Prep Sports: All Sports Preps: Boys Basketball Preps: Girls Basketball Preps: Ice hockey Preps: Skiing Preps: Wrestling Preps: Girls Swimming Preps: Baseball Preps: Girls Golf Preps: Lacrosse Preps: Girls Soccer Preps: Boys Swimming Preps: Girls Tennis Preps: Track and Field Preps: Boys Track and Field Preps: Girls Track and Field Preps: Photos and Videos Preps: Alumni Corner Boulder Valley School District St. Vrain Valley School District Winter Sports Fall Sports Spring Sports Preps: Cross Country Preps: Football Preps: Boys Golf Preps: Gymnastics Preps: Boys Soccer Preps: Softball Preps: Boys Tennis Preps: Volleyball Prep Sports: All Sports Preps: Boys Basketball Preps: Girls Basketball Preps: Ice hockey Preps: Skiing Preps: Wrestling Preps: Girls Swimming Preps: Baseball Preps: Girls Golf Preps: Lacrosse Preps: Girls Soccer Preps: Boys Swimming Preps: Girls Tennis Preps: Track and Field Preps: Boys Track and Field Preps: Girls Track and Field Preps: Photos and Videos Preps: Alumni Corner Boulder Valley School District St. Vrain Valley School District Winter Sports Fall Sports Spring Sports SportsSportsCollege SportsCU Sports/BuffzoneHigh School SportsRunningCyclingBroncosRockiesAvalancheNuggets Sports College Sports CU Sports/Buffzone High School Sports Running Cycling Broncos Rockies Avalanche Nuggets Sports College Sports CU Sports/Buffzone High School Sports Running Cycling Broncos Rockies Avalanche Nuggets Local NewsLongmontSuperiorLouisvilleBoulderLafayetteErieBroomfield Longmont Superior Louisville Boulder Lafayette Erie Broomfield Longmont Superior Louisville Boulder Lafayette Erie Broomfield Things to DoEntertainmentEvents CalendarLifestylesRecreationFood & DrinkScreensMusicTheater & ArtBooksHealth & FitnessHome & Garden Entertainment Events Calendar Lifestyles Recreation Food & Drink Screens Music Theater & Art Books Health & Fitness Home & Garden Entertainment Events Calendar Lifestyles Recreation Food & Drink Screens Music Theater & Art Books Health & Fitness Home & Garden OpinionOpinionEditorialsOpinion ColumnistsLetters to the EditorGuest Opinion Opinion Editorials Opinion Columnists Letters to the Editor Guest Opinion Opinion Editorials Opinion Columnists Letters to the Editor Guest Opinion ObituariesObituariesNews ObituariesSubmit an Obituary Obituaries News Obituaries Submit an Obituary Obituaries News Obituaries Submit an Obituary MarketplaceClassifiedsReal EstateJobsRaised in the RockiesSpecial SectionsBusiness DirectoryToday’s AdsCouponsAdvertise With UsSubmitSponsored ContentPublic Notices Classifieds Real Estate Jobs Raised in the Rockies Special Sections Business Directory Today’s Ads Coupons Advertise With Us Submit Sponsored Content Public Notices Classifieds Real Estate Jobs Raised in the Rockies Special Sections Business Directory Today’s Ads Coupons Advertise With Us Submit Sponsored Content Public Notices atHome ColoradoatHome ColoradoatHome Real EstateatHome RentalsatHome New Home CommunitiesatHome Home & GardenNew Home MapOpen HomesatHome RentalsatHome Featured AgentatHome Real Estate TransactionsFind HomesAdvertise/Contact Us atHome Colorado atHome Real Estate atHome Rentals atHome New Home Communities atHome Home & Garden New Home Map Open Homes atHome Rentals atHome Featured Agent atHome Real Estate Transactions Find Homes Advertise/Contact Us atHome Colorado atHome Real Estate atHome Rentals atHome New Home Communities atHome Home & Garden New Home Map Open Homes atHome Rentals atHome Featured Agent atHome Real Estate Transactions Find Homes Advertise/Contact Us Advice Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint E-Edition Subscribe Log In Logout Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Reddit (Opens in new window)Reddit Click to share on X (Opens in new window)X Subscribe Log In Sign up for email newsletters Subscribe Log In e-Edition e-Edition Editorials Opinion Columnists Letters Guest Opinion Trending: CU classroom incident Boulder sanctuary city discussion After attack: ‘Not going to stop walking’ Summer music guide 🎵 Pride in Colorado 🏳️‍🌈 **Letters to the editor: Adams doesn’t represent me; do not conflate antisemitism and anti-zionism; Alexander Hamilton calls for impeachment** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Reddit (Opens in new window)Reddit Click to share on X (Opens in new window)X I’m still trying to process that Taishya Adams put her own personal politics in front of her compassion and support for our community. We experienced an awful, horrendous act of terrorism recently — an illegal alien literally threw Molotov bombs, burning our citizens, some of whom were in their 80s. What a nightmare! Our city council tried to come together to denounce this despicable act and to express support and love and compassion to our community. Our City Council members are representatives of the HEARTS and minds of our citizens. But, apparently, not Taishya Adams! She does not represent who we are as a city. When our city has experienced tragedies, we come together as a community. We show our love and compassion and support, firstly to the families affected by the tragedy, and then to the community as a whole. Instead, Taishya Adams went petty, trying to wordsmith a City Council statement denouncing the attack and refused to sign. She does not represent me, and I don’t think she represents the majority of citizens of Boulder. Paul Perlmutter, Boulder As a Jewish resident of Boulder who is appalled by what Netanyahu and Israel are doing in Gaza, I would like to acknowledge Taisha Adams for her insistence on maintaining the critical distinction between antisemitism and anti-zionism. While the perpetrator of the Pearl Street mall attack may well qualify for either or both descriptors, and while I might disagree with some of Ms. Adams’ other positions, it is absolutely crucial that we, the American public, do not conflate antisemitism and anti-zionism. It is also crucial that those of us concerned about the situation in Gaza find ways to build bridges when we encounter points of agreement. Elyse Morgan, Boulder A while back, a friend sent me this quote from Alexander Hamilton, one of the founding fathers of the United States: “When a man unprincipled in private life, desperate in his fortune, bold in his temper … despotic in his ordinary demeanour — known to have scoffed in private at the principles of liberty — when such a man is seen to mount the hobby horse of popularity — to join in the cry of danger to liberty — to take every opportunity of embarrassing the General Government & bringing it under suspicion — to flatter and fall in with all the non sense of the zealots of the day — It may justly be suspected that his object is to throw things into confusion that he may ‘ride the storm and direct the whirlwind.’” Hamilton made this statement in support of having a provision for impeachment in the U.S. Constitution. Does this description call anyone to mind? Rep. Adam Schiff also quoted this passage at the second impeachment trial of Donald Trump, after the Jan. 6, 2021, insurrection at the Capitol. It’s interesting that Elon Musk is now criticizing Trump’s “big, beautiful bill” and calling for Trump’s impeachment. Trump was the first president to be impeached twice; could it happen a third time? We can only hope. Cherry Sokoloski, Loveland The Camera has several positions open on the Community Editorial Board and is inviting local writers to apply. The CEB members are volunteers who write every other week on topics of local interest that are selected by the Camera Editorial Board. Applicants may send a resume of writing and/or general educational and work experience, a cover letter about why they are interested in joining the CEB and writing samples. Writing samples can include letters to the editor or guest opinions that have been published in any paper, or a 300- to 400-word essay on a recent CEB topic or a local issue. Applicants must live in Boulder and should not be members of groups that are politically active in Boulder or Boulder County. Applicants should include a telephone number, and finalists will be contacted to take part in brief interviews. Send applications to openforum@dailycamera.com. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Reddit (Opens in new window)Reddit Click to share on X (Opens in new window)X **RevContent Feed** **Most Popular** 1 dead, 4 injured in Denver crash on I-25 involving wrong-way driver1 dead, 4 injured in Denver crash on I-25 involving wrong-way driver **1 dead, 4 injured in Denver crash on I-25 involving wrong-way driver** **1 dead, 4 injured in Denver crash on I-25 involving wrong-way driver** CU Buffs’ Coach Prime away from Boulder, dealing with unspecified health issueCU Buffs' Coach Prime away from Boulder, dealing with unspecified health issue **CU Buffs’ Coach Prime away from Boulder, dealing with unspecified health issue** **CU Buffs’ Coach Prime away from Boulder, dealing with unspecified health issue** From Trader Joe’s to Children’s Hospital, these are the Colorado locations where you could have been exposed to measlesFrom Trader Joe’s to Children’s Hospital, these are the Colorado locations where you could have been exposed to measles **From Trader Joe’s to Children’s Hospital, these are the Colorado locations where you could have been exposed to measles** **From Trader Joe’s to Children’s Hospital, these are the Colorado locations where you could have been exposed to measles** CU Buffs plan to go all-in, embrace new age of college athleticsCU Buffs plan to go all-in, embrace new age of college athletics **CU Buffs plan to go all-in, embrace new age of college athletics** **CU Buffs plan to go all-in, embrace new age of college athletics** No charges filed in April incident where pro-Palestinian protesters were thrown out of CU Boulder classroomNo charges filed in April incident where pro-Palestinian protesters were thrown out of CU Boulder classroom **No charges filed in April incident where pro-Palestinian protesters were thrown out of CU Boulder classroom** **No charges filed in April incident where pro-Palestinian protesters were thrown out of CU Boulder classroom** Boulder’s sanctuary status to be discussed in council meetingBoulder's sanctuary status to be discussed in council meeting **Boulder’s sanctuary status to be discussed in council meeting** **Boulder’s sanctuary status to be discussed in council meeting** CU Buffs’ Coach Prime grateful for well wishes amid health challengeCU Buffs' Coach Prime grateful for well wishes amid health challenge **CU Buffs’ Coach Prime grateful for well wishes amid health challenge** **CU Buffs’ Coach Prime grateful for well wishes amid health challenge** Week after Boulder attack, group hosts antisemitism summit in cityWeek after Boulder attack, group hosts antisemitism summit in city **Week after Boulder attack, group hosts antisemitism summit in city** **Week after Boulder attack, group hosts antisemitism summit in city** Safeway workers in Colorado could soon strike; still no King Soopers contractSafeway workers in Colorado could soon strike; still no King Soopers contract **Safeway workers in Colorado could soon strike; still no King Soopers contract** **Safeway workers in Colorado could soon strike; still no King Soopers contract** Men’s basketball: Tad Boyle focuses on finalizing CU Buffs’ rosterMen's basketball: Tad Boyle focuses on finalizing CU Buffs' roster **Men’s basketball: Tad Boyle focuses on finalizing CU Buffs’ roster** **Men’s basketball: Tad Boyle focuses on finalizing CU Buffs’ roster** **Events** **More in Letters to the Editor** Letters to the editor: We need leaders who can help us find a path forward; ‘life is full of blessings we take for granted’ **Letters to the editor: We need leaders who can help us find a path forward; ‘life is full of blessings we take for granted’** **Letters to the editor: We need leaders who can help us find a path forward; ‘life is full of blessings we take for granted’** Letters to the editor: Trump has 43 more months to destroy democracy; strengthen the ESA; what one damns, damns us back **Letters to the editor: Trump has 43 more months to destroy democracy; strengthen the ESA; what one damns, damns us back** **Letters to the editor: Trump has 43 more months to destroy democracy; strengthen the ESA; what one damns, damns us back** Letters to the editor: The If we don’t resist now, we may very well not have another chance **Letters to the editor: The If we don’t resist now, we may very well not have another chance** **Letters to the editor: The If we don’t resist now, we may very well not have another chance** Letters to the editor: Prioritizing tribal fealty over prolonging people’s lives **Letters to the editor: Prioritizing tribal fealty over prolonging people’s lives** **Letters to the editor: Prioritizing tribal fealty over prolonging people’s lives** 2025 June 11 Prairie Mountain MediaSpecial SectionsBuffzone.comBocoPreps.comGreeley TribuneBroomfield EnterpriseColorado Hometown WeeklyMy Town ColoradoColorado Box OfficeRaised in the Rockies Special Sections Buffzone.com BocoPreps.com Greeley Tribune Broomfield Enterprise Colorado Hometown Weekly My Town Colorado Colorado Box Office Raised in the Rockies Special Sections Buffzone.com BocoPreps.com Greeley Tribune Broomfield Enterprise Colorado Hometown Weekly My Town Colorado Colorado Box Office Raised in the Rockies Contact UsAbout UsArchivesWork With UsAccessibilitySitemap About Us Archives Work With Us Accessibility Sitemap About Us Archives Work With Us Accessibility Sitemap SubscribeSign Up for Newsletterse-EditionSubmit Sign Up for Newsletters e-Edition Submit Sign Up for Newsletters e-Edition Submit Customer CarePurchase PhotosNewspaper in EducationAudio HeadlinesMobile AppsPublic Notices Purchase Photos Newspaper in Education Audio Headlines Mobile Apps Public Notices Purchase Photos Newspaper in Education Audio Headlines Mobile Apps Public Notices Advertise With UsPrairie Mountain Media AdvertisingNetwork AdvertisingAdtaxi Solutions Prairie Mountain Media Advertising Network Advertising Adtaxi Solutions Prairie Mountain Media Advertising Network Advertising Adtaxi Solutions Business DirectoryReal EstateJobsCouponsClassifiedsToday’s Ads Real Estate Jobs Coupons Classifieds Today’s Ads Real Estate Jobs Coupons Classifieds Today’s Ads Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration MediaNews Group Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}