{"id": 148, "name": "BMC Oral Health", "domain": "bmcoralhealth.biomedcentral.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://bmcoralhealth.biomedcentral.com/submission-guidelines/preparing-your-manuscript", "title": "Preparing Your Manuscript", "content": "Advertisement Explore journals Get published About BMC My account Home About Articles Submission Guidelines Join the board Collections **Submission Guidelines** Aims and scope Fees and funding Language editing services Copyright Preparing your manuscriptResearch articleDatabase articleSoftware articleCase reportStudy protocolReviewMatters ArisingCommentSystematic Review Research article Database article Software article Case report Study protocol Review Matters Arising Comment Systematic Review Research article Database article Software article Case report Study protocol Review Matters Arising Comment Systematic Review Prepare supporting information Conditions of publication Editorial policies Peer-review policy Manuscript transfers Promoting your publication **Preparing your manuscript** This section provides general style and formatting information only. Formatting guidelines for specific article types can be found below. Research articleDatabase articleSoftware articleCase reportStudy protocolReviewMatters ArisingCommentSystematic Review Research article Database article Software article Case report Study protocol Review Matters Arising Comment Systematic Review Research article Database article Software article Case report Study protocol Review Matters Arising Comment Systematic Review **General formatting guidelines** Preparing main manuscript text Preparing illustrations and figures Preparing tables​​​​​​​ Preparing additional files **Preparing figures** When preparing figures, please follow the formatting instructions below. Figures should be numbered in the order they are first mentioned in the text, and uploaded in this order. Multi-panel figures (those with parts a, b, c, d etc.) should be submitted as a single composite file that contains all parts of the figure. Figures should be uploaded in the correct orientation. Figure titles (max 15 words) and legends (max 300 words) should be provided in the main manuscript, not in the graphic file. Figure keys should be incorporated into the graphic, not into the legend of the figure. Each figure should be closely cropped to minimize the amount of white space surrounding the illustration. Cropping figures improves accuracy when placing the figure in combination with other elements when the accepted manuscript is prepared for publication on our site. For more information on individual figure file formats, see our detailed instructions. Individual figure files should not exceed 10 MB. If a suitable format is chosen, this file size is adequate for extremely high quality figures. Please note that it is the responsibility of the author(s) to obtain permission from the copyright holder to reproduce figures (or tables) that have previously been published elsewhere.In order for all figures to be open access, authors must have permission from the rights holder if they wish to include images that have been published elsewhere in non open access journals. Permission should be indicated in the figure legend, and the original source included in the reference list. **Figure file types** We accept the following file formats for figures: EPS (suitable for diagrams and/or images) PDF (suitable for diagrams and/or images) Microsoft Word (suitable for diagrams and/or images, figures must be a single page) PowerPoint (suitable for diagrams and/or images, figures must be a single page) TIFF (suitable for images) JPEG (suitable for photographic images, less suitable for graphical images) PNG (suitable for images) BMP (suitable for images) CDX (ChemDraw - suitable for molecular structures) For information and suggestions of suitable file formats for specific figure types, please see ourauthor academy. **Figure size and resolution** Figures are resized during publication of the final full text and PDF versions to conform to the BioMed Central standard dimensions, which are detailed below. Figures on the web: width of 600 pixels (standard), 1200 pixels (high resolution). Figures in the final PDF version: width of 85 mm for half page width figure width of 170 mm for full page width figure maximum height of 225 mm for figure and legend image resolution of approximately 300 dpi (dots per inch) at the final size Figures should be designed such that all information, including text, is legible at these dimensions. All lines should be wider than 0.25 pt when constrained to standard figure widths. All fonts must be embedded. Vector figures should if possible be submitted as PDF files, which are usually more compact than EPS files. TIFF files should be saved with LZW compression, which is lossless (decreases file size without decreasing quality) in order to minimize upload time. JPEG files should be saved at maximum quality. Conversion of images between file types (especially lossy formats such as JPEG) should be kept to a minimum to avoid degradation of quality. If you have any questions or are experiencing a problem with figures, please contact the customer service team atinfo@biomedcentral.com. **Preparing main manuscript text** Quick points: Use double line spacing Include line and page numbering Use SI units: Please ensure that all special characters used are embedded in the text, otherwise they will be lost during conversion to PDF Do not use page breaks in your manuscript **File formats** The following word processor file formats are acceptable for the main manuscript document: Microsoft word (DOC, DOCX) Rich text format (RTF) TeX/LaTeX Please note:editable files are required for processing in production. If your manuscript contains any non-editable files (such as PDFs) you will be required to re-submit an editable file when you submit your revised manuscript, or after editorial acceptance in case no revision is necessary. **Additional information for TeX/LaTeX users** You are encouraged to use theSpringer Nature LaTeX templatewhen preparing a submission. A PDF of your manuscript files will be compiled during submission using pdfLaTeX and TexLive 2021.All relevant editable source files must be uploaded during the submission process. Failing to submit these source files will cause unnecessary delays in the production process. **Style and language** Presenting your work in well-written English gives it its best chance for editors and reviewers to understand it and evaluate it fairly. We have some editing services that can help you to get your writing ready for submission. You can upload your manuscript and get a free language check from our partner AJE. The software uses AI to make suggestions that can improve writing quality. Trained on 300,000+ research manuscripts from more than 400+ areas of study and over 2000 field-specific topics the tool will deliver fast, highly accurate English language improvements. Your paper will be digitally edited and returned to you within approximately 10 minutes. Try the tool for free now Let one of our experts assist you with getting your manuscript and language into shape - our services cover: English language improvement scientific in-depth editing and strategic advice figure and tables formatting manuscript formatting to match your target journal specialist academic translation to English from Spanish, Portuguese, Japanese, or simplified Chinese Get started and save 15% Please note that using these tools, or any other service, is not a requirement for publication, nor does it imply or guarantee that editors will accept the article, or even select it for peer review. 您怎么做才有助于改进您的稿件以便顺利发表？ 如果在结构精巧的稿件中用精心组织的英语展示您的作品，就能最大限度地让编辑和审稿人理解并公正评估您的作品。许多研究人员发现，获得一些独立支持有助于他们以尽可能美好的方式展示他们的成果。Springer Nature Author Services 的专家可帮助您准备稿件，具体包括润色英语表述、添加有见地的注释、为稿件排版、设计图表、翻译等。 开始使用即可节省 15% 的费用 您还可以使用我们的免费语法检查工具来评估您的作品。 请注意，使用这些工具或任何其他服务不是发表前必须满足的要求，也不暗示或保证相关文章定会被编辑接受（甚至未必会被选送同行评审）。 発表に備えて、論文を改善するにはどうすればよいでしょうか？ 内容が適切に組み立てられ、質の高い英語で書かれた論文を投稿すれば、編集者や査読者が論文を理解し、公正に評価するための最善の機会となります。多くの研究者は、個別のサポートを受けることで、研究結果を可能な限り最高の形で発表できると思っています。Springer Nature Author Servicesのエキスパートが、英文の編集、建設的な提言、論文の書式、図の調整、翻訳など、論文の作成をサポートいたします。 今なら15％割引でご利用いただけます 原稿の評価に、無料の文法チェックツールもご利用いただけます。 これらのツールや他のサービスをご利用いただくことは、論文を掲載するための要件ではありません。また、編集者が論文を受理したり、査読に選定したりすることを示唆または保証するものではないことにご注意ください。 게재를 위해 원고를 개선하려면 어떻게 해야 할까요? 여러분의 작품을 체계적인 원고로 발표하는 것은 편집자와 심사자가 여러분의 연구를 이해하고 공정하게 평가할 수 있는 최선의 기회를 제공합니다. 많은 연구자들은 어느 정도 독립적인 지원을 받는 것이 가능한 한 최선의 방법으로 자신의 결과를 발표하는 데 도움이 된다고 합니다. Springer Nature Author Services 전문가들은영어 편집, 발전적인 논평, 원고 서식 지정, 그림 준비, 번역등과 같은 원고 준비를 도와드릴 수 있습니다. 지금 시작하면 15% 할인됩니다 또한 당사의무료 문법검사 도구를 사용하여 여러분의 연구를 평가할 수 있습니다. 이러한 도구 또는 기타 서비스를 사용하는 것은 게재를 위한 필수 요구사항이 아니며, 편집자가 해당 논문을 수락하거나 피어 리뷰에 해당 논문을 선택한다는 것을 암시하거나 보장하지는 않습니다. ¿Cómo puede ayudar a mejorar el artículo para su publicación? Si presenta su trabajo en un artículo bien estructurado y en inglés bien escrito, los editores y revisores podrán comprenderlo mejor y evaluarlo de forma justa. Muchos investigadores piensan que un poco de apoyo independiente les ayuda a presentar los resultados de la mejor forma posible. Los expertos de Springer Nature Author Services pueden ayudarle a preparar el artículocon la edición en inglés, comentarios para su elaboración, el formato del artículo, la preparación de figuras, la traduccióny mucho más. Empiece ahora y ahorre un 15% También puede usar nuestra herramienta gratuitaGrammar Checkpara evaluar su trabajo. Tenga en cuenta que utilizar estas herramientas, así como cualquier otro servicio, no es un requisito para publicación, y tampoco implica ni garantiza que los editores acepten el artículo, ni siquiera que lo seleccionen para revisión científica externa. Como pode ajudar a melhorar o seu manuscrito para publicação? Apresentar o seu trabalho num manuscrito bem estruturado e em inglês bem escrito confere-lhe a melhor probabilidade de os editores e revisores o compreenderem e avaliarem de forma justa. Muitos investigadores verificam que obter algum apoio independente os ajuda a apresentar os seus resultados da melhor forma possível. Os especialistas da Springer Nature Author Services podem ajudá-lo na preparação do manuscrito, incluindoedição de língua inglesa, comentários de desenvolvimento, formatação do manuscrito, preparação de figuras, traduçãoe muito mais. Comece agora e poupe 15% Também pode utilizar a nossa ferramenta gratuita deverificação de gramáticapara efetuar uma avaliação do seu trabalho. Tenha em conta que a utilização destas ferramentas, ou de qualquer outro serviço, não constitui um requisito para publicação, nem implica nem garante que os editores aceitem o artigo ou o selecionem para revisão por pares. **Data and materials** For all journals, BioMed Central strongly encourages all datasets on which the conclusions of the manuscript rely to be either deposited in publicly available repositories (where available and appropriate) or presented in the main paper or additional supporting files, in machine-readable format (such as spread sheets rather than PDFs) whenever possible. Please see the list ofrecommended repositoriesin our editorial policies. For some journals, deposition of the data on which the conclusions of the manuscript rely is an absolute requirement. Please check the Instructions for Authors for the relevant journal and article type for journal specific policies. For all manuscripts, information about data availability should be detailed in an ‘Availability of data and materials’ section. For more information on the content of this section, please see the Declarations section of the relevant journal’s Instruction for Authors. For more information on BioMed Centrals policies on data availability, please see oureditorial policies. The following format for the 'Availability of data and materials section of your manuscript should be used: \"The dataset(s) supporting the conclusions of this article is(are) available in the [repository name] repository, [unique persistent identifier and hyperlink to dataset(s) in http:// format].\" The following format is required when data are included as additional files: \"The dataset(s) supporting the conclusions of this article is(are) included within the article (and its additional file(s)).\" BioMed Central endorses the Force 11 Data Citation Principles and requires that all publicly available datasets be fully referenced in the reference list with an accession number or unique identifier such as a DOI. For databases, this section should state the web/ftp address at which the database is available and any restrictions to its use by non-academics. For software, this section should include: Project name: e.g. My bioinformatics project Project home page: e.g. http://sourceforge.net/projects/mged Archived version: DOI or unique identifier of archived software or code in repository (e.g. enodo) Operating system(s): e.g. Platform independent Programming language: e.g. Java Other requirements: e.g. Java 1.3.1 or higher, Tomcat 4.0 or higher License: e.g. GNU GPL, FreeBSD etc. Any restrictions to use by non-academics: e.g. licence needed Information on available repositories for other types of scientific data, including clinical data, can be found in oureditorial policies. **References** See oureditorial policiesfor author guidance on good citation practice. Please check the submission guidelines for the relevant journal and article type. Only articles, clinical trial registration records and abstracts that have been published or are in press, or are available through public e-print/preprint servers, may be cited. Unpublished abstracts, unpublished data and personal communications should not be included in the reference list, but may be included in the text and referred to as \"unpublished observations\" or \"personal communications\" giving the names of the involved researchers. Obtaining permission to quote personal communications and unpublished data from the cited colleagues is the responsibility of the author. Only footnotes are permitted. Journal abbreviations follow Index Medicus/MEDLINE. Any in press articles cited within the references and necessary for the reviewers' assessment of the manuscript should be made available if requested by the editorial office. **How to format your references** Please check the Instructions for Authors for the relevant journal and article type for examples of the relevant reference style. Web links and URLs:All web links and URLs, including links to the authors' own websites, should be given a reference number and included in the reference list rather than within the text of the manuscript. They should be provided in full, including both the title of the site and the URL, as well as the date the site was accessed, in the following format: The Mouse Tumor Biology Database.http://tumor.informatics.jax.org/mtbwi/index.do. Accessed 20 May 2013. If an author or group of authors can clearly be associated with a web link, such as for weblogs, then they should be included in the reference. Authors may wish to make use of reference management software to ensure that reference lists are correctly formatted. **Preparing tables** When preparing tables, please follow the formatting instructions below. Tables should be numbered and cited in the text in sequence using Arabic numerals (i.e. Table 1, Table 2 etc.). Tables less than one A4 or Letter page in length can be placed in the appropriate location within the manuscript. Tables larger than one A4 or Letter page in length can be placed at the end of the document text file. Please cite and indicate where the table should appear at the relevant location in the text file so that the table can be added in the correct place during production. Larger datasets, or tables too wide for A4 or Letter landscape page can be uploaded as additional files. Please see [below] for more information. Tabular data provided as additional files can be uploaded as an Excel spreadsheet (.xls ) or comma separated values (.csv). Please use the standard file extensions. Table titles (max 15 words) should be included above the table, and legends (max 300 words) should be included underneath the table. Tables should not be embedded as figures or spreadsheet files, but should be formatted using ‘Table object’ function in your word processing program. Color and shading may not be used. Parts of the table can be highlighted using superscript, numbering, lettering, symbols or bold text, the meaning of which should be explained in a table legend. Commas should not be used to indicate numerical values. If you have any questions or are experiencing a problem with tables, please contact the customer service team atinfo@biomedcentral.com. **Preparing additional files** As the length and quantity of data is not restricted for many article types, authors can provide datasets, tables, movies, or other information as additional files. All Additional files will be published along with the accepted article. Do not include files such as patient consent forms, certificates of language editing, or revised versions of the main manuscript document with tracked changes. Such files, if requested, should be sent by email to the journal’s editorial email address, quoting the manuscript reference number. Please do not send completed patient consent forms unless requested. Results that would otherwise be indicated as \"data not shown\" should be included as additional files. Since many web links and URLs rapidly become broken, BioMed Central requires that supporting data are included as additional files, or deposited in a recognized repository. Please do not link to data on a personal/departmental website. Do not include any individual participant details. The maximum file size for additional files is 20 MB each, and files will be virus-scanned on submission. Each additional file should be cited in sequence within the main body of text. If additional material is provided, please list the following information in a separate section of the manuscript text: File name (e.g. Additional file 1) File format including the correct file extension for example .pdf, .xls, .txt, .pptx (including name and a URL of an appropriate viewer if format is unusual) Title of data Description of data Additional files should be named \"Additional file 1\" and so on and should be referenced explicitly by file name within the body of the article, e.g. 'An additional movie file shows this in more detail [see Additional file 1]'. For further guidance on how to use Additional files or recommendations on how to present particular types of data or information, please seeHow to use additional files. Important informationEditorial boardFor authorsFor editorial board membersFor reviewers **Important information** Editorial board For authors For editorial board members For reviewers **Important information** Editorial board For authors For editorial board members For reviewers Manuscript editing services Contact Us **Annual Journal Metrics** Citation ImpactJournal Impact Factor: 2.6 (2023)5-year Journal Impact Factor: 3.2 (2023)Source Normalized Impact per Paper (SNIP): 1.359 (2024)SCImago Journal Rank (SJR): 0.843 (2024)SpeedSubmission to first editorial decision (median days): 15Submission to acceptance (median days): 118Usage 2024Downloads: 5,105,312Altmetric mentions: 794 Citation ImpactJournal Impact Factor: 2.6 (2023)5-year Journal Impact Factor: 3.2 (2023)Source Normalized Impact per Paper (SNIP): 1.359 (2024)SCImago Journal Rank (SJR): 0.843 (2024)SpeedSubmission to first editorial decision (median days): 15Submission to acceptance (median days): 118Usage 2024Downloads: 5,105,312Altmetric mentions: 794 Citation ImpactJournal Impact Factor: 2.6 (2023)5-year Journal Impact Factor: 3.2 (2023)Source Normalized Impact per Paper (SNIP): 1.359 (2024)SCImago Journal Rank (SJR): 0.843 (2024)SpeedSubmission to first editorial decision (median days): 15Submission to acceptance (median days): 118Usage 2024Downloads: 5,105,312Altmetric mentions: 794 More about our metrics **Peer-review Terminology** The following summary describes the peer review process for this journal:Identity transparency:Single anonymizedReviewer interacts with:EditorReview information published:Review reports. Reviewer Identities reviewer opt in. Author/reviewer communicationMore information is available here The following summary describes the peer review process for this journal: Identity transparency:Single anonymized Reviewer interacts with:Editor Review information published:Review reports. Reviewer Identities reviewer opt in. Author/reviewer communication More information is available here The following summary describes the peer review process for this journal: Identity transparency:Single anonymized Reviewer interacts with:Editor Review information published:Review reports. Reviewer Identities reviewer opt in. Author/reviewer communication More information is available here **Follow** Follow us on Twitter Advertisement ISSN: 1472-6831 General enquiries:journalsubmissions@springernature.com Read more on our blogs Receive BMC newsletters Manage article alerts Language editing for authors Scientific editing for authors Policies Accessibility Press center Support and Contact Leave feedback Careers **Follow BMC** BMC Twitter page BMC Facebook page BMC Weibo page By using this website, you agree to ourTerms and Conditions,Your US state privacy rights,Privacy statementandCookiespolicy.Your privacy choices/Manage cookieswe use in the preference centre. © 2025 BioMed Central Ltd unless otherwise stated. Part ofSpringer Nature."}