{"id": 1317, "name": "ECU Center for Survey Research", "domain": "surveyresearch.ecu.edu", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://surveyresearch.ecu.edu/life-liberty-happiness-survey/", "title": "Life Liberty Happiness Survey", "content": "Skip To Main Content Report an Accessibility Barrier The Department for Disability Support Services | Resources Email Canvas Banner PiratePort PirateID IT Help Videoconferencing The Pirate Experience Work Request Directory Maps Virtual Tour A-Z Index Academic Calendar Event Calendar Catalog Facebook Twitter Instagram YouTube LinkedIn Center for Survey Research Center for Survey Research About PeopleFaculty and StaffAdvisory Board Faculty and Staff Advisory Board Faculty and Staff Advisory Board Polls and ProjectsThe ECU PollLife, Liberty, and Happiness SurveyECU Covid-19 Impact SurveyData AnalyticsClient Projects The ECU Poll Life, Liberty, and Happiness Survey ECU Covid-19 Impact Survey Data Analytics Client Projects The ECU Poll Life, Liberty, and Happiness Survey ECU Covid-19 Impact Survey Data Analytics Client Projects In the News Give THCAS **The Life, Liberty, and Happiness Project** **Survey Results** The Life, Liberty, and Happiness project involves a unique national survey of more than 1,000 Americans, led by a team of researchers at ECU in the Departments of Public Health, Political Science, Psychology, and Sociology. The project will offer new insights into American public attitudes and behaviors on topics related to the nation’s founding principles: **Life** Examines questions related to opioid use, firearm safety, and social behaviors. **Liberty** Involves questions concerning attitudes on issues related to free speech, religion, the press, gun laws, taxation, and personal freedom. **Happiness** Explores topics like financial security and opportunity, optimism for the future, self-esteem, and satisfaction with life. **Download the Reports** The Life, Liberty, and Happiness Project American Public Opinion Divided on Several National Security IssuesJuly 22, 2021 Download The Life, Liberty, and Happiness Project The Past and Present of COVID-19 Mandates and Vaccines: Divided Republicans, Unified DemocratsJune 30, 2021 Download Let’s be Blunt Public Opinion on the Legalization of Marijuana in the United StatesDec, 2019 Download More than Money Happiness in the United States 243 Years After IndependenceJuly, 2019 Download Unlocked and Loaded Guns in the Home and Safety Practices in AmericaDecember, 2018 Download After Murphy v. National Collegiate Athletic Association The State of Public Opinion on the Legalization of Professional Sports GamblingOctober, 2018 Download The Value of Labor and Valuing Labor The Association of Employment on Personal Well-Being and Unions on Economic Well-BeingSeptember, 2018 Download The Life, Liberty, and Happiness Project The State of the Nation, 242 Years After IndependenceJuly, 2018 Download View the 2018 codebook for the Life, Liberty, and Happiness Project View the 2019 codebook for the Life, Liberty, and Happiness Project Transparency Initiative Checklist **Director** Peter L. Francia, Ph.Dfranciap@ecu.edu252-328-6126 **Media Contact** ECU News Services252-328-6481 East Carolina UniversityCenter for Survey Research © 2025|Terms of Use|AccessibilityReport a Barrier/Website Issue"}