{"id": 1973, "name": "WTUC - 1400 AM - Tucson", "domain": "freedom1400.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.freedom1400.com/news/bone-thugs-n-harmony-and-three-6-mafia-announce-2025-north-american-thuggish-ruggish-mafia-tour/", "title": "Bone Thugs N Harmony And Three 6 Mafia Announce 2025 North American Thuggish Ruggish Mafia Tour", "content": "ShowsFox Across America – Jimmy Failla – Sunday EncoreBrian Kilmeade – Sunday EncoreBrett BaierBest of Chris Plante ShowRed Eye RadioGuy Benson ShowFox Across America with Jimmy FaillaChris Plante ShowThe Vince Show Fox Across America – Jimmy Failla – Sunday Encore Brian Kilmeade – Sunday Encore Brett Baier Best of Chris Plante Show Red Eye Radio Guy Benson Show Fox Across America with Jimmy Failla Chris Plante Show The Vince Show Fox Across America – Jimmy Failla – Sunday Encore Brian Kilmeade – Sunday Encore Brett Baier Best of Chris Plante Show Red Eye Radio Guy Benson Show Fox Across America with Jimmy Failla Chris Plante Show The Vince Show Calendar Contests NewsNational Top Stories National Top Stories National Top Stories Sweet Deals Advertising Listen Live to Freedom 1400 **Bone Thugs-N-Harmony And Three 6 Mafia Announce 2025 North American ‘Thuggish-Ruggish-Mafia Tour’** On Monday (June 9), Bone Thugs-N-Harmony and Three 6 Mafia announced the dates and details of their joint 2025 Thuggish-Ruggish-Mafia Tour of North America. The 24-date run will hit amphitheaters throughout the U.S. and Canada this summer and fall, and will feature special guest opening acts Tech N9ne and DJ Quik. The tour starts on… On Monday (June 9), Bone Thugs-N-Harmony and Three 6 Mafia announced the dates and details of their joint 2025 Thuggish-Ruggish-Mafia Tour of North America. The 24-date run will hit amphitheaters throughout the U.S. and Canada this summer and fall, and will feature special guest opening acts Tech N9ne and DJ Quik. The tour starts on… On Monday (June 9),Bone Thugs-N-HarmonyandThree 6 Mafiaannounced the dates and detailsof their joint 2025Thuggish-Ruggish-Mafia Tourof North America. The 24-date run will hit amphitheaters throughout the U.S. and Canada this summer and fall, and will feature special guest opening actsTech N9neandDJ Quik. The tour starts on August 21 in Rogers, Arkansas, stopping in cities including St. Louis, New York, Nashville, Dallas, and Houston, before concluding in Concord, California on October 4. All five members of Bone Thugs-N-Harmony –Bizzy Bone, Wish Bone, Layzie Bone, Krayzie Bone,andFlesh-n-Bone– will take part in the tour, which celebrates the 30th anniversary of the rap group’s landmark 1995 album,E. 1999 Eternal. “We couldn’t have made it without YOU — so this tour is a celebration for ALL of us! 🎉,” the Cleveland hip-hop crew wrote on Instagram. Bone Thugs-N-Harmony announced their reunion with a comeback single, “Aww Sh*t,” in April, marking their first full collaboration since 2010. (Billboard) **Headlines** **Free Apps** Privacy Policy Terms of Service General Contest Rules Advertise With Us Employment Opportunities Cumulus Media Corporate Station Information & How To Contact Us FCC Public File FCC Applications EEO Report Copyright 2020 Cumulus Media / Cumulus Media is an equal opportunity employer / AA View Full Site"}