{"id": 1636, "name": "KGWN - Wyoming News Now", "domain": "wyomingnewsnow.tv", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wyomingnewsnow.tv/users/profile/valeria-fugate", "title": "Valeria Fugate", "content": "Sign Up Log In Dashboard Logout My AccountMy AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Facebook Twitter Community Calendar Casper Cheyenne Scottsbluff Crime Economy Education Energy Entertainment Environment International National Regional Science State Technology Closings Newsletter Radar Alerts Forecast Weather Cameras Closings Scoreboard Athlete Of The Week Digital Marketing Search Search Search Open user controlsLog In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Site searchSearch Site searchSearch Site searchSearch Casper Cheyenne Scottsbluff Riverton/Lander News Casper Cheyenne Scottsbluff WeatherWeather Cameras Weather Cameras Weather Cameras Sports Livestream **Valeria Fugate** Author facebook Author twitter Author email Author RSS {{description}} Email notifications are only sent once a day, and only if there are new matching items. **About** Valeria Fugate graduated from the University of Colorado with a degree in Broadcast Journalism. She loves politics and history. An avid music lover, when she's not consuming more news, you'll find her planning her next travel adventure abroad. **Location focus** Cheyenne, WY. **Topic focus** Politics, Legislature **Languages spoken** Spanish, English, French **Accomplishments** WAB- Best Anchor 2023 **Memberships** NAHJ Posts **The Summer event season is here!** UpdatedJun 6, 2025 The Summer event season is here! **The Summer event season is here!** UpdatedJun 6, 2025 The Summer event season is here! **Screen on the Green Re-scheduled** UpdatedJun 5, 2025 Screen on the Green Re-scheduled **Screen on the Green Re-scheduled** UpdatedJun 5, 2025 Screen on the Green Re-scheduled **New City code gives small businesses a boost** UpdatedMay 30, 2025 New City code gives small businesses a boost **New City code gives small businesses a boost** UpdatedMay 30, 2025 New City code gives small businesses a boost **Tip a Cop event at the Texas Roadhouse supports the Special Olympics** UpdatedMay 29, 2025 Tip a Cop event at the Texas Roadhouse supports the Special Olympics **Tip a Cop event at the Texas Roadhouse supports the Special Olympics** UpdatedMay 29, 2025 Tip a Cop event at the Texas Roadhouse supports the Special Olympics **The Scottsbluff Fire Department responds to a structure fire on 400 block of W. Overland** UpdatedMay 25, 2025 Scottsbluff Fire Department respond to structure fire on 400 block of W. Overland Home News Weather Sports Politics Community Calendar Submit Photos and Videos Livestream Multimedia Online Features Privacy Policy Terms of Service Advertising Digital Marketing Closed Captioning/Audio Description KGWN EEO Statement KCWY EEO Statement KGWN FCC Public File KCWY FCC Public File KNEP FCC Public File KSTF FCC Public File Email Alerts Search Facebook Twitter Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}