{"id": 1402, "name": "The Local (Sweden)", "domain": "thelocal.se", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thelocal.se/20250527/its-a-brain-drain-doctor-ordered-to-leave-sweden-over-mix-up-with-migration-agency/#article-comments", "title": "Its A Brain Drain Doctor Ordered To Leave Sweden Over Mix Up With Migration Agency", "content": "**Advertisement** **Advertisement** NewsLatest newsPoliticsImmigrationCost of livingTravel newsEconomyStockholmMalmöGothenburg Latest news Politics Immigration Cost of living Travel news Economy Stockholm Malmö Gothenburg Latest news Politics Immigration Cost of living Travel news Economy Stockholm Malmö Gothenburg Podcast EssentialsLiving in SwedenWork permitsMoving to SwedenResidency permitsStudy in SwedenLiving CostsVisasCitizenshipTaxesPensionsReader questions Living in Sweden Work permits Moving to Sweden Residency permits Study in Sweden Living Costs Visas Citizenship Taxes Pensions Reader questions Living in Sweden Work permits Moving to Sweden Residency permits Study in Sweden Living Costs Visas Citizenship Taxes Pensions Reader questions Learn about SwedenSweden ExplainedDiscover SwedenSwedish TraditionsSwedish HistorySwedish HabitsFood and Drink Sweden Explained Discover Sweden Swedish Traditions Swedish History Swedish Habits Food and Drink Sweden Explained Discover Sweden Swedish Traditions Swedish History Swedish Habits Food and Drink LanguageLearning SwedishSwedish Word of the Day Learning Swedish Swedish Word of the Day Learning Swedish Swedish Word of the Day HomesPropertyRentingFind Rentals Property Renting Find Rentals Property Renting Find Rentals JobsWorking in SwedenFind jobs in Sweden Working in Sweden Find jobs in Sweden Working in Sweden Find jobs in Sweden NewsLatest newsPoliticsImmigrationCost of livingTravel newsEconomyStockholmMalmöGothenburg Latest news Politics Immigration Cost of living Travel news Economy Stockholm Malmö Gothenburg Latest news Politics Immigration Cost of living Travel news Economy Stockholm Malmö Gothenburg Podcast EssentialsLiving in SwedenWork permitsMoving to SwedenResidency permitsStudy in SwedenLiving CostsVisasCitizenshipTaxesPensionsReader questions Living in Sweden Work permits Moving to Sweden Residency permits Study in Sweden Living Costs Visas Citizenship Taxes Pensions Reader questions Living in Sweden Work permits Moving to Sweden Residency permits Study in Sweden Living Costs Visas Citizenship Taxes Pensions Reader questions Learn about SwedenSweden ExplainedDiscover SwedenSwedish TraditionsSwedish HistorySwedish HabitsFood and Drink Sweden Explained Discover Sweden Swedish Traditions Swedish History Swedish Habits Food and Drink Sweden Explained Discover Sweden Swedish Traditions Swedish History Swedish Habits Food and Drink LanguageLearning SwedishSwedish Word of the Day Learning Swedish Swedish Word of the Day Learning Swedish Swedish Word of the Day HomesPropertyRentingFind Rentals Property Renting Find Rentals Property Renting Find Rentals JobsWorking in SwedenFind jobs in Sweden Working in Sweden Find jobs in Sweden Working in Sweden Find jobs in Sweden swedenAll EditionsAustriaDenmarkFranceGermanyItalyNorwaySpainSwedenSwitzerland All Editions Austria Denmark France Germany Italy Norway Spain Sweden Switzerland All Editions Austria Denmark France Germany Italy Norway Spain Sweden Switzerland Become a member Newsletters Help Centre Gift Vouchers Educational Access Corporate Access About Us Contact Us News Archive Search articles All topics Advertise with us Post a job ad The Local Europe ABVästmannagatan 43113 25 StockholmSweden **'It's a brain drain': Doctor ordered to leave Sweden over mix-up with Migration Agency** 21 comments Sasan Kazemian, originally from Iran, has been in Sweden since 2021, speaks fluent Swedish, and currently works as a medical resident at Karolinska University Hospital after passing a test 90 percent of applicants fail. He’s also been issued with an order to leave the country. **Advertisement** Kazemian already had a medical degree when he arrived in Sweden in 2021. This doesn't mean that he was able to start practising as a doctor straight away – as his degree is from a non-EU country, he had to go through a rigorous process to qualify in Sweden. He didn't let this put him off, and worked his way through the multi-step process. \"There are several steps to qualify. One of them is a medical test, a knowledge test for medical doctors, with two steps, and then you have to learn Swedish to level C1, you have to pass a course about laws and how they work in the healthcare system, and you have to work for six months in healthcare, in what is calledpraktiktjänstgöring,\" Kazemian tells The Local. After this process, which takes around four years, you can finally get a medical licence to work in Sweden. The process of actually arriving in Sweden wasn't easy either – there is no special permit for highly-qualified people or those working in industries with a labour shortage (like doctors) to move to Sweden, such as Denmark'sPositive List, for example. \"I thought 'OK, I'll find another way'. So the way I found was to apply for a course in Swedish, which gives you a diploma in Swedish at an advanced level.\" This way, Kazemian could tick two things off his list at once – move to Sweden on a study permit, while also making sure his Swedish was good enough to practise medicine. He got into a Swedish as a Foreign Language course at Lund University which let him qualify for a study permit, paying for the course entirely out of his own pocket. He was also granted a study permit lasting around a year, from January 2021 to January 2022. \"I paid completely for my course, it wasn't cheap at around 110,000 kronor. I paid for it myself with the money I saved in my country. So I came to Sweden and this course took me one year. It wasn't easy. Swedish is not a really easy language.\" **Advertisement** After he finished his Swedish course, he applied for another permit as a jobseeker while he started preparing for the medical knowledge test – a test whichonly one in ten applicantspass. Once he passed, he signed up straight away for the practical test, although it took a while before he was offered a chance to take it. While he waited, he took a clinical internship, changing his application for a job-seeking permit to a work permit in September 2022. The Migration Agency does not allow applicants to have two permits pending at once, so this meant that his application for a job-seeking permit was withdrawn when he applied for a work permit. \"I started working [in a clinical internship] in September 2022 and completed it in March 2023. During this period, I was waiting, applying for this exam every time. After a year, I finally got a chance, I took the practical exam and finished it and was accepted to this part too.\" He finally received his medical licence in the autumn of 2023, and started working as a doctor in August that year, with a work permit – the one he originally applied for in September 2022 – granted for August 1st, 2023 to December 31st, 2023. **Advertisement** His issues with the Migration Agency started at the end of 2023, when his employer offered him a permanent position on a medical residency programme with a planned start date of February 2024. By this time, his permit allowing him to work in Sweden was about to run out. \"I accepted it gladly, and she sent all my documents to the Migration Agency. They didn't say anything – usually they send an acceptance letter or an email saying they got your application, but we didn't get anything, so I was a bit suspicious.\" A few days before his old permit was set to expire, Kazemian took time off work to submit his application in person to the Migration Agency's offices in Sundbyberg, after a friend told him he needed to also submit an application for a residence permit. \"I went and left it there, which was not a good idea because it was lunch time. There were a lot of things happening there, it was a little bit chaotic. Immediately after that I sent them a message asking 'did you get all of my documents, was there anything missing' and they said simply, 'we have received your work permit'.\" The agency denies this, saying that they were only confirming the fact that they had received his job contract. **Advertisement** Kazemian didn't hear anything else from the agency over the next two weeks and decided to contact them again to make sure there weren't any issues. At this point he received a message saying that his residence permit had expired and that he needed to leave Sweden. \"It was like a catastrophe for me,\" he said. \"All the time I spent learning Swedish, studying for this exam, working, paying tax, everything. It was like 'wow'. I lost two and a half years of my life.\" He hired legal help and appealed the decision, providing evidence that he had applied before his old permit expired and that he therefore had the right to stay in Sweden and work while he waited for his next permit to be granted. The Migration Agency argues that his application to extend his permit never arrived, meaning he had no right to work in Sweden. They confirmed that they received two job contracts in December and January, but argue that since they have no record of an application or evidence that he paid an application fee, no formal application was submitted. According to the agency, his work permit application was submitted on February 21st, 2024, after they contacted him to inform him that his work permit had run out and that he should reapply if he wished to stay in Sweden. Because of this, they argue that his first permit expired at the end of 2023, and the application to extend is instead equivalent to a new work permit application. This means, the agency argues, that he did not have the right to work after his old permit expired, and that he therefore has been working in Sweden illegally since then. **Advertisement** Kazemian's lawyer, who wishes to remain anonymous, criticised the Migration Agency for its lack of proportionality. \"This concerns an individual who has completed the entire validation process through the National Board of Health and Welfare, reached C1 level in Swedish, completed clinical service, obtained a medical licence and paid taxes – and yet is treated as an expendable administrative error. It's not just inhumane. It's economically indefensible,\" she said in a written comment to The Local. Kazemian has now appealed the decision again, sending it to the Migration Court. \"Now we are waiting. When I waited for the jobseeker permit I was stuck in Sweden for 17 months, and now I'm stuck again,\" he said. During the time he's been stuck in Sweden – both now and while waiting for previous permits to be concluded – he has not taken any proper holidays or travelled abroad. \"I took one day of sick leave because I was really sick, but otherwise I've been working because I have respect for my patients and my colleagues. I don't want to put any pressure on them. But it's really difficult not to see your family – I came here alone – not to see your friends or those you love and care about.\" He said the whole situation has left him \"really disappointed\". \"I came to Sweden because I heard they wanted highly-educated people, they provide special opportunities for them, but this is what's happened to me.\" **Advertisement** Kazemian is also the co-chair of the International Doctors' Association, and has been in contact with a number of other foreign doctors in the same situation as him. \"Since I went public with my story, I've had so many messages from other colleagues saying they've faced the same problem. They are struggling with immigration changes, the complicated bureaucratic process, and now they have to leave the country. Some of them have already left for another European country, the US, Australia, Germany, Denmark, Norway, got a permit straight away and are already working there.\" He's also had a lot of positive feedback from colleagues since an article about his situation was published in medical newspaperLäkartidningen. \"Many have reached out to ask how they can support me, and several expressed their sympathy, saying things like 'I'm sorry to hear this' and even calling it a scandal. It has truly filled my heart with hope to see that I have colleagues who care about me,\" he said. Despite his own situation, Kazemian is not tempted by moving abroad to work elsewhere. \"I am genuinely committed to continuing my career in Sweden,\" he said, adding that he hopes he can contribute meaningfully to patient care, the clinic, and society at large. \"Particularly within primary care, which is currently experiencing one of the most significant shortages of physicians.\" He would still choose Sweden even if he'd known at the time he moved over what he knows now. \"Now I know the process, how it works, I could help other colleagues too. But I have lost hope a little bit.\" **Advertisement** If he could change Swedish migration law to make it easier for people in his situation, he would change therules for the EU blue card, a type of permit allowing high-earners to settle in the country and eventually apply for permanent residency after two years. \"The qualification for that is so high. It's 50,000 kronor. I don't know how many first jobs can provide that kind of salary. Even for a doctor, who has a high income. So I would say change the blue card rules, and make exceptions for some jobs that are extremely in need, like healthcare workers, highly educated workers who are needed in Sweden. Make it easier for people who are needed in society.\" Kazemian's lawyer pointed out that the lack of a specific rule for foreign doctors increases the risk of applicants making mistakes. \"There is no migration route for someone who wants to become a licensed doctor in Sweden. There is no permit category for competence validation or practical medical training. Instead, individuals must find loopholes – such as applying to language courses – which increases the risk of technical errors and bureaucratic missteps,\" she said. Kazemian is not only sad about the situation on a personal level, but thinks it's bad for Sweden as a whole. \"It's a brain drain. They're losing doctors, which are highly expensive to train, and there's a huge need for doctors. I was working in the emergency department two or three months ago, and literally every week, almost every day, I got messages from the hospital asking me to come in and work extra.\" Kazemian is frustrated about the fact that Sweden is throwing away the opportunity to import highly-educated workers and save the country money. \"I understand their point of view, that they want to filter people that are most useful for society, but who is more useful than a highly educated worker that you spend zero kronor to educate? For a person like me, a medical doctor, it takes millions of kronor in taxpayer money to educate us and more than seven and a half years. It's time consuming, resource-consuming, and then they say 'no, bye'. They treat me like trash –hejdå.\" He also feels that the process is set up in a way where you can be punished for making a tiny mistake. \"They make this really complicated bureaucratic process you have to go through, and you have to struggle with the National Board of Health and Welfare, study the language, find a job, and then the Migration Agency. And if anything goes even slightly wrong there, it's a huge catastrophe.\" Colleagues in a similar situation have suggested that he leave Sweden and reapply from outside. Kazemian is reluctant to try this and risk potentially being issued with a ban on reentering Sweden. \"Several HR professionals and friends have said I should leave Sweden and reapply from abroad, saying that if I did that everything would be fine. But doing that means risking everything. What if the next supervisor doesn't approve my application, is there any guarantee?\" \"I know so many people who did that, sent their request and had it rejected immediately. I've worked here for around three years now, paid really high tax, I bought a house, and now I have to leave everything. What if I get a 'no'? What should I do?\" The situation has also taken its toll on Kazemian, who has been prescribed antidepressants to cope. \"It's affected me drastically, both physically and mentally. I lost weight. I can't sleep. I have tremors in my hands. I need medication to keep me functioning, and it's all because of one person.\" \"It all depends on who is answering your request. Do they like you? Do they think that you're a nice person? Then it will be easy. But if they don't like you, they can do whatever they want.\" This, his lawyer says, is also a recurring theme. \"What keeps recurring in these cases – and what Mr Kazemian himself articulates – is the sense that the outcome depends on who handles the case, rather than what is right,\" she said. \"When legal certainty gives way to randomness, arbitrariness takes hold and undermines trust in the entire Swedish legal system.\" She added that his case is far from unique. \"It illustrates a growing system failure when it comes to Swedish migration law,\" she said. \"We see time and time again how highly-educated people who have followed every rule, invested time, money and talent in Sweden still have their futures destroyed because of processing mistakes, administrative whims or missing confirmation from the Migration Agency.\" \"In Sasan's case, the unjust handling has extra serious consequences, as it has occurred despite the fact that he is contributing to an area with an acute lack of staff: Swedish healthcare.\" \"These are no longer isolated cases. They have become a pattern, and the pattern means that Sweden is losing people we can't afford to lose – morally, economically or socially.\" **More** **Comments (21)** Join the conversation in our comments section below.Share your own views and experience and if you have a question or suggestion for our journalists then email us atnews@thelocal.se.Please keep comments civil, constructive and on topic – and make sure to read ourterms of usebefore getting involved. Please log inhereto leave a comment. **See Also** **Advertisement** The Local Europe ABVästmannagatan 43113 25 StockholmSweden By signing up you agree to ourTerms of UseandPrivacy Policy.We will use your email address to send you newsletters as well as information and offers related to your account. 2025 The Local, All Rights Reserved."}