{"id": 454, "name": "Fortnightly Review", "domain": "fortnightlyreview.co.uk", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://fortnightlyreview.co.uk/2024/12/the-heart-repetitious-dancer-uncollected-poems-elaine-randell/", "title": "The Heart Repetitious Dancer Uncollected Poems Elaine Randell", "content": "**** **** Home•Chronicle & Notices **‘The heart is a repetitious dancer’: Three Uncollected Poems from Elaine Randell** By ELAINE RANDELL. ◊ On finding your copy ofThe Observers Book of Geology1960 for Barry MacSweeney Fallingopen at Fools Goldthe stone that would create sparks when struck against.Struck against, railed against butit’s still tender, sore,The heart in flames again seeingSeeing your name on the frontispiecewith all that hope in the marginsknowing nowhow it would unravel, pan out.Still the margins carry the weight.How still are the margins against which we shuffle. France, 1989 iAt the hospital, Hotel Dieu, Hautfautthe small strips of faded cloth – patterned in parts,flowers, dots, carefully sewn, hemmed in hope, markthe lives of mothers without choice,in despair. Outsideyou skip, say that your tooth has fallen out,we wrap it carefully. iiIn the Church of Baudefois D’Ansthe priest lines the village children onslim fine wooden benches, wears his beretand Monoprix shoes. Tells them,Jésus avec l’amour dans son cœur,his small feet crossed at the ankles. Outsideyou ask whyI didn’t stop the seesaw from hurting you. Hôtel Dieu had a vocation to “care for poor people.” The hotel / hospital / church has asmall wooden “tower,” a cupboard with a revolving door to make it possible for poor parentsto abandon their children into the care of the religious order under the cover of anonymity.The alternative was to leave the babies to perish on the mountains. Between 1790 and 1847 the revolving door was used 1,947 times. Parents were asked to affixa little cloth ribbon to the infant’s clothes so that, if they had second thoughts within the first24 hours after the abandonment, they could identify and reclaim their child and bringanother part of the fabric with them. These coloured strips were also attached to the baby’sentry in the town’s records. There is no evidence of how many of the babies were reunitedwith their families. It is also not known how many arrived too late to reclaim their babies orlost the tiny piece of fabric. ◊ Five English Spring Poems for Lee Harwood, 29th March 1984 1. At first the skies are so clearyou would be forgiven thinking“summer oh summer.”bird dart make bidsPicking up all manner of downy silksto line sweet beds. Pushing throughBreaking voluptuous phallic buds.Surprise! O Lupus you haveStolen the purseFrom the rabbitsQuick ear. Dark these woods at night clamour withhooting pheasants, fox wails, waitingsoft muscle to tear open.Look it is here, insidethe poemall of this,all of this,the cat sniffs at the blade of grassthenwalks on.Navy blue evening skies sink down behind thetall English oak trees. 2. In the barnyoung lambsorphaned by morningbleat out. Looking out, smelling for milk, bleat outnuzzling against rock, bleat outwhile others suckle freely never leaving nor left.Watercress streams under sparkling bridges.Nothing relieves the ache of being left. 3. Thin wrists of primrosestartle the mist.Trumpet daffodils battered by 48 hours of rain.All the geese huddle and grumble they just hiss at the wind. 4. Metallic black StarlingSturnes Vulgaris) The glossy purple glintsdip in and outbrown tail feathersbody of white wing feathersroosting in the old English Oak again.Untidy nests, grass, wool, moss, wood shavings from our door. Listening for wormsThe sharp little headsTilt forwardThen sideways again. 5. The wheat is three inches high.St Luke’s little summer has come and goneit is wrought of a sunlight far too light to come from just sun alone.Can it be that which the woods are tangling with,along with the Ivy?Or is it the necklet of tiny stars above us as the wood smokecurls up in tongues?The heart is a repetitious dancer whose feet trip and blunderdespite all this practise.Yet still we sit together while sweet wallflowers are budding in the gardenall of it so young and alone. ♦ ELAINE RANDELLwas born in 1951 in south London. She has lived in Romney Marshfor many years now, keeping Soay sheep, chickens and English Setter dogs on a smallholding and a large historic garden with her husband, Ian Rose, and their threedaughters. She startedAmazing Gracepoetry magazine and subsequentlySecret Books,publishing over many years work by James Kirkup, Jeremy Reed, Jeff Nuttall,Nicholas Moore, Michael Horovitz, Tom Raworth, Allen Fisher, Tony Lopez, PaulMatthews, and Barry MacSweeney – to the last of whom she was married from 1973-1979. Her first publication,Song of Hesperus, appeared in 1972 and fourteen otherbooks have come out since. The three texts published here are drawn from theUncollected Poems section ofCollected Poems & Prose(Shearsman Books, 2024). **Post a Comment** Δ Winter–Spring 2024 Special Issue:The Fortnightly Review ContinuesInto Summer · Poetry & Prose·2024 Winter–Spring 2024 Special Issue:The Fortnightly Review Continues Into Summer · Poetry & Prose·2024 Winter–Spring 2024 Special Issue:The Fortnightly Review Continues Into Summer · Poetry & Prose·2024 Search for: Between the Dog & the Wolfand four more poemsJane SatterfieldIntercontinentaland two more poemsClive WatkinsThe CrossableJohn Taylor with paintings by Marc FeldABCand four more poemsLinda BlackHoly Ghostsand four more poemsMarc VincenzCocoonand two more poemsKitty HawkinsBashshaytMichelene WandorTwo SonnetsRichard BerengartenSelections from Baudelairetranslated by Will StoneAnd more…Five Tanka Manipulating FormLucian Staiano-Daniels Between the Dog & the Wolfand four more poemsJane Satterfield Intercontinentaland two more poemsClive Watkins The CrossableJohn Taylor with paintings by Marc Feld ABCand four more poemsLinda Black Holy Ghostsand four more poemsMarc Vincenz Cocoonand two more poemsKitty Hawkins BashshaytMichelene Wandor Two SonnetsRichard Berengarten Selections from Baudelairetranslated by Will Stone And more… Five Tanka Manipulating FormLucian Staiano-Daniels Between the Dog & the Wolfand four more poemsJane Satterfield Intercontinentaland two more poemsClive Watkins The CrossableJohn Taylor with paintings by Marc Feld ABCand four more poemsLinda Black Holy Ghostsand four more poemsMarc Vincenz Cocoonand two more poemsKitty Hawkins BashshaytMichelene Wandor Two SonnetsRichard Berengarten Selections from Baudelairetranslated by Will Stone And more… Five Tanka Manipulating FormLucian Staiano-Daniels John Wilkinson’sAdages for Poetry StudentsChris Miller reviewsChaos and the Clean Lineby Stephen RomerAND Two Essaysby Alan Wall·Ego Scriptor·Was Jesus a Humourist?See alsoGarin Cycholl’s new review of Vladimir Sorokin’sBlue Lard John Wilkinson’sAdages for Poetry Students Chris Miller reviewsChaos and the Clean Lineby Stephen Romer AND Two Essaysby Alan Wall ·Ego Scriptor ·Was Jesus a Humourist? See alsoGarin Cycholl’s new review of Vladimir Sorokin’sBlue Lard John Wilkinson’sAdages for Poetry Students Chris Miller reviewsChaos and the Clean Lineby Stephen Romer AND Two Essaysby Alan Wall ·Ego Scriptor ·Was Jesus a Humourist? See alsoGarin Cycholl’s new review of Vladimir Sorokin’sBlue Lard fromThe RuniadAnthony HowellfromWhite IvoryAlan Walland much morebelow this column. fromThe RuniadAnthony Howell fromWhite IvoryAlan Wall and much morebelow this column. fromThe RuniadAnthony Howell fromWhite IvoryAlan Wall and much morebelow this column. DepartmentsDepartmentsSelect CategoryAfrica DiaryAlan Macfarlane’s ChaptersAlan Wall EssaysAmerican politicsAnthropology and SociologyArchived contentArt & ArchitectureArt NotesAudio ArchiveBiography, Memoir and Autobiographical ProseBooks & PublishingBrexit DiaryBritish politicsBroadcastingBusinessCanadian EccentricitiesChronicle & NoticesClues & LabyrinthsCommentary on Art and LiteratureCopy-edited copyCreative non-fictionCurrente CalamoDance & PerformanceDialectic and Aesthetics: Adorno on Modern MusicDossier: ‘The Manager” by Richard BerengartenDossier: A Bonnefoy MemorialDossier: Eric MottramDossier: Ferdinand BrunetièreDossier: Literary RejectionsDossier: Rabindranath TagoreDossier: Reflections on Walter BenjaminDossier: Remy de GourmontDossier: Shakespeare in The FortnightlyDossier: Yves BonnefoyDownplayed IncidentsDramaDrohobych diptychEconomics and FinanceEventsExcerpts & PassagesFilm commentaryFilm, Television, Video & TheatreFortnightly NoticesHistory & TravelHolocaustIn MemoriamLetter from VeniceLiterary & Art Magazine ArchiveLives in PoetryMuseums & CollectionsMusic and PhotographyNigel Wheale: RapturesNoted elsewhereNotes & CommentOcc. NotesOdd VolumesPanoptikonPoetry & FictionPoetry and prose in translationPoetry NotesPolitics & CulturePortfolio: André du BouchetPortfolio: Tintoretto and VenicePortfoliosPrincipal ArticlesPsychology, Philosophy & EducationPub TalkPuzzle-FictionQuod videQVDReference ArchiveScience, Medicine & TechnologySerial: After the Snowbird Comes the WhaleSerial: Reflections on my first thirty yearsSerial: The RuniadSerial: To Kill an IntellectualSerial: White IvoryShelf LifeSix-way MirrorSport & FashionSpring-Summer Serial 2012Survival ManualThe 2013 SerialThe American NoteThe Fortnightly Review of BooksThe Fortnightly Review of Films and VideoThe Fortnightly Review of MusicThe pressThe SerialThe Sette of Odd VolumesThe Trollope PrizeTheatre in New YorkThen & NowTheologyTranslationsUna Visione EstesaVarieties of Secular BeliefVenice portfolioVerisimilitudesWall on Shakespeare **Departments** **Departments** Contact the Editorshere. Contact the Editorshere. Contact the Editorshere. Audio archive:Two poems, with an audio track, fromHeart MonologuesbyJasmina Bolfek-Radovani|Daragh Breen’sAural Triptych|Hayden CarruthreadsContra Mortem and Journey to a Known Place|Anthony Howellreads three new poems|James LaughlinreadsEaster in Pittsburgh and five more|Peter RobinsonreadsManifestos for a lost cause, Dreamt Affections, Blind Summits and Oblique LightsPrevious Serials2011:Golden-beakin eight parts. By George Basset (H. R. Haxton).2012:The Invention of the Modern Worldin 18 parts. By Alan Macfarlane.2013:Helenin three long parts. By Oswald Valentine Sickert.2016:The Survival Manualby Alan Macfarlane. In eight parts.2018:After the Snowbird, Comes the Whale, by Tom Lowenstein.Thoughts on constitutional monarchs.Artificial intelligence? Just asking.Shouts of terror on 43rd Street.J’accuse…injustement.We need to talk about Vladimir.LONDONReadings in The Room: 33 Holcombe Road, Tottenham Hale, London N17 9AS – £5 entry plus donation for refreshments. All enquiries: 0208 801 8577Poetry London: Current listingshere.Shearsman readings: 7:30pm at Swedenborg Hall, 20/21 Bloomsbury Way, London WC1. Further detailshere.NEW YORK10reliable poetry venuesin NYC.The world we live in.Alan Jenkins at sea.Each lexicon a labyrinth.On the small stuff.Baddiel’s divine desire.Gangsters and Politicians.Ugo and the waves.Holiday? What holiday?What’s my number?Welcome to the New World Order.·The funeral of Isaac Albéniz·Coleridge, poetry and the ‘rage for disorder’·Otto Rank·Patrons and toadying·Rejection before slips·Cut with a dull blade·Into the woods, everybody.·Thought Leaders and Ted Talks·How Mary Oliver ‘found love in a breathing machine.’AND read here:· Hugh Chisholm· Elliott Coleman· Robert Coover· Ethel Dilke· Anthony Howell· Ann Lauterbach· Lawrence Markert· Myra Sklarew· Martin Sorrell· William Stafford· James Thomson[B.V.]· Paul Verlaine· Michelene Wandor· Stephen WiestA dilemma for educators:Philosophy and the public impact..Michelene Wandor on Derek Walcott and the T.S. Eliot Prize..Nick Lowe: the true-blue Basher shows up for a friend.More daily inAnthony Howell: The new libertine in exile.Kate Hoyland: Inventing Asia, with Joseph Conrad and a Bible for tourists.Who is Bruce Springsteen? by Peter Knobler.Martin Sorrell on John Ashbery’s illumination of Arthur Rimbaud.The beauty of Quantitative Easing.Prohibition’s ‘original Progressives’.European populism? Audio archive:Two poems, with an audio track, fromHeart MonologuesbyJasmina Bolfek-Radovani|Daragh Breen’sAural Triptych|Hayden CarruthreadsContra Mortem and Journey to a Known Place|Anthony Howellreads three new poems|James LaughlinreadsEaster in Pittsburgh and five more|Peter RobinsonreadsManifestos for a lost cause, Dreamt Affections, Blind Summits and Oblique Lights Previous Serials2011:Golden-beakin eight parts. By George Basset (H. R. Haxton).2012:The Invention of the Modern Worldin 18 parts. By Alan Macfarlane.2013:Helenin three long parts. By Oswald Valentine Sickert.2016:The Survival Manualby Alan Macfarlane. In eight parts.2018:After the Snowbird, Comes the Whale, by Tom Lowenstein. LONDON Readings in The Room: 33 Holcombe Road, Tottenham Hale, London N17 9AS – £5 entry plus donation for refreshments. All enquiries: 0208 801 8577 Poetry London: Current listingshere.Shearsman readings: 7:30pm at Swedenborg Hall, 20/21 Bloomsbury Way, London WC1. Further detailshere. NEW YORK 10reliable poetry venuesin NYC. ·The funeral of Isaac Albéniz·Coleridge, poetry and the ‘rage for disorder’·Otto Rank ·Patrons and toadying·Rejection before slips·Cut with a dull blade ·Into the woods, everybody.·Thought Leaders and Ted Talks·How Mary Oliver ‘found love in a breathing machine.’ AND read here: · Hugh Chisholm · Elliott Coleman · Robert Coover · Ethel Dilke · Anthony Howell · Ann Lauterbach · Lawrence Markert · Myra Sklarew · Martin Sorrell · William Stafford · James Thomson[B.V.] · Paul Verlaine · Michelene Wandor · Stephen Wiest A dilemma for educators:Philosophy and the public impact..Michelene Wandor on Derek Walcott and the T.S. Eliot Prize.. Nick Lowe: the true-blue Basher shows up for a friend. More daily in Anthony Howell: The new libertine in exile. Kate Hoyland: Inventing Asia, with Joseph Conrad and a Bible for tourists. Who is Bruce Springsteen? by Peter Knobler. Martin Sorrell on John Ashbery’s illumination of Arthur Rimbaud. The beauty of Quantitative Easing. Prohibition’s ‘original Progressives’. European populism? Audio archive:Two poems, with an audio track, fromHeart MonologuesbyJasmina Bolfek-Radovani|Daragh Breen’sAural Triptych|Hayden CarruthreadsContra Mortem and Journey to a Known Place|Anthony Howellreads three new poems|James LaughlinreadsEaster in Pittsburgh and five more|Peter RobinsonreadsManifestos for a lost cause, Dreamt Affections, Blind Summits and Oblique Lights Previous Serials2011:Golden-beakin eight parts. By George Basset (H. R. Haxton).2012:The Invention of the Modern Worldin 18 parts. By Alan Macfarlane.2013:Helenin three long parts. By Oswald Valentine Sickert.2016:The Survival Manualby Alan Macfarlane. In eight parts.2018:After the Snowbird, Comes the Whale, by Tom Lowenstein. LONDON Readings in The Room: 33 Holcombe Road, Tottenham Hale, London N17 9AS – £5 entry plus donation for refreshments. All enquiries: 0208 801 8577 Poetry London: Current listingshere.Shearsman readings: 7:30pm at Swedenborg Hall, 20/21 Bloomsbury Way, London WC1. Further detailshere. NEW YORK 10reliable poetry venuesin NYC. ·The funeral of Isaac Albéniz·Coleridge, poetry and the ‘rage for disorder’·Otto Rank ·Patrons and toadying·Rejection before slips·Cut with a dull blade ·Into the woods, everybody.·Thought Leaders and Ted Talks·How Mary Oliver ‘found love in a breathing machine.’ AND read here: · Hugh Chisholm · Elliott Coleman · Robert Coover · Ethel Dilke · Anthony Howell · Ann Lauterbach · Lawrence Markert · Myra Sklarew · Martin Sorrell · William Stafford · James Thomson[B.V.] · Paul Verlaine · Michelene Wandor · Stephen Wiest A dilemma for educators:Philosophy and the public impact..Michelene Wandor on Derek Walcott and the T.S. Eliot Prize.. Nick Lowe: the true-blue Basher shows up for a friend. More daily in Anthony Howell: The new libertine in exile. Kate Hoyland: Inventing Asia, with Joseph Conrad and a Bible for tourists. Who is Bruce Springsteen? by Peter Knobler. Martin Sorrell on John Ashbery’s illumination of Arthur Rimbaud. The beauty of Quantitative Easing. Prohibition’s ‘original Progressives’. European populism? Plugins Wordpress Themes Wordpress Documents Wordpress"}