{"id": 2146, "name": "The Mirror US", "domain": "themirror.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.themirror.com/entertainment/celebrity-news/harvey-weinstein-jury-deliberations-unusual-1203012", "title": "Harvey Weinstein Jury Deliberations Unusual 1203012", "content": "**** **** News Sports Entertainment Lifestyle More Entertainment Celebrity News Harvey Weinstein **'Bizarre' Harvey Weinstein deliberations leave attorney saying 'I don’t think I’ve ever seen that'** **Harvey Weinstein's criminal trial reached a type of ending, but there are some last decisions that need to be made. The jury's operations are a bit peculiar** Harvey Weinsteinwasfound guilty, but there was a catch. After five days of deliberations in theraperetrial, thejuryreturned a guilty verdict on one of the three counts with a second receiving an acquittal. However, the third count, which is an accusation from Jessica Mann, was left undecided as Judge Curtis Farber instructed the jury to return tomorrow for further consideration. Criminal defense attorneyEric Faddis, founding partner of Colorado-basedVarner Faddis, told the Mirror US, “Theentire deliberations process has been extraordinaryin this case. It’s kind of bizarre that the court was willing to accept this partial verdict and ask jurors to go back and continue deliberating on the third count. I don’t think I’ve ever seen that.\" Before a decision even hit the courtroom, there appeared to be trouble brewing. Previously,a juror came forward to Judge Curtis Farber, asking to be dismissed. They cited in-fighting among jury members, who allegedly were caught gossiping in elevators. “The experience I’ve had in the day-and-a-half here, in good conscience, I don’t think this is fair and just,” he said. Ultimately, the judge reminded the juror, who described the issues as \"playground stuff,\" of his duty and stressed that the trial would fall about if he was let go. Similarly, the foreperson came forward with concerns about the jury deliberations. He asked to speak privately with the judge about issues in the conversations. The foreperson then asked the judge to speak “about a situation that isn’t very good,\" including \"something going on in the jury room.\" The conversation occurred behind closed doors with the judge, foreperson, and attorneys.Weinsteindeclined to participate. Additional details about the issue weren't immediately made available to the public. The jury drama bled into the morning of Wednesday when the foreperson was further questioned in private about what was happening. “He said words to the effect of ‘I can’t go back in there with the other jurors,’” the judge later said. The foreperson was then sent to a separate room. Faddis wagered that the judge was motivated to wrap the trial quickly, especially as it is a retrial on the issue. \"This is a highly publicized case that the world is following, and the first trial ended in a reversal and everyone had to go back to the drawing board. So it seems like the court was seeking some finality in this case of high public importance rather than allowing another mistrial,\" he said. The possibility of a mistrial hasn't yet been ruled out, either. In a situation where a jury is deadlocked after a few days, they'd typically call is a mistrial. However, as a retrial would mark a third go at court in New York, the judge sent them back to consider longer. It's not an easy fix. Faddis explained, \"There's a risk the jurors could be coerced into reaching a conclusion they don't want to reach, in part because they simply want to be done with the trial. And by requiring the jury to keep deliberating, it could cause an appellate court to determine the judge erred in that decision and could cause yet another reversal. “A mistrial could still be declared on that remaining count — it remains to be seen.” **Sign up to our FREE newsletter and get the top stories to your inbox** DAILY NEWSLETTER:Sign up hereto get the latest news and updates from the Mirror US straight to your inbox with our FREE newsletter. Facebook X (Twitter) Instagram US News World News Politics Royals Celebrity News Sport TV Money Lifestyle Tech Science Movies Travel Weird news Weather NFL **Follow The Mirror US on socials:** How to Complain Notifications and Alerts help mynewsassistant Corrections and Clarifications About Us Work For Us Contact Us Mirror UK Irish Mirror Syndication & Licencing Privacy Notice AI Notice Cookie Notice Terms and Conditions Community Standards **© 2025 a Reach plc subsidiary** AtReach and across our entitieswe and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the sale or sharing of your data, at any time clicking the \"Do Not Sell or Share my Data\" button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in ourPrivacy NoticeandCookie Notice."}