{"id": 719, "name": "Joint Center for Political and Economic Studies", "domain": "jointcenter.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://jointcenter.org/the-implications-of-section-230-for-black-communities-black-communities-and-the-immunity-of-platforms-regarding-third-party-content/", "title": "The Implications Of Section 230 For Black Communities Black Communities And The Immunity Of Platforms Regarding Third Party Content", "content": "IssuesWorkforce PolicyTax and Wealth PolicyTech PolicyHill DiversityData for Black America Workforce Policy Tax and Wealth Policy Tech Policy Hill Diversity Data for Black America Workforce Policy Tax and Wealth Policy Tech Policy Hill Diversity Data for Black America Data & ResearchBriefsReports Briefs Reports Briefs Reports EventsAll EventsThe Wealth Agenda: Seizing the Moment for Black Economic AdvancementJoint Center Presented Former President Spencer Overton with Louis E. Martin Great American Award All Events The Wealth Agenda: Seizing the Moment for Black Economic Advancement Joint Center Presented Former President Spencer Overton with Louis E. Martin Great American Award All Events The Wealth Agenda: Seizing the Moment for Black Economic Advancement Joint Center Presented Former President Spencer Overton with Louis E. Martin Great American Award AboutMission StatementHistoryAnnual ReportsBoard of GovernorsStaffCareersSubscribe to Our Mailing ListContact Us Mission Statement History Annual Reports Board of Governors Staff Careers Subscribe to Our Mailing List Contact Us Mission Statement History Annual Reports Board of Governors Staff Careers Subscribe to Our Mailing List Contact Us MediaPressOp-EdsPress ReleasesMeet Our ExpertsRoundupsNewslettersTestimoniesFOCUS Magazine Archive Press Op-Eds Press Releases Meet Our Experts Roundups Newsletters Testimonies FOCUS Magazine Archive Press Op-Eds Press Releases Meet Our Experts Roundups Newsletters Testimonies FOCUS Magazine Archive DonateSupporters Supporters Supporters IssuesWorkforce PolicyTax and Wealth PolicyTech PolicyHill DiversityData for Black America Workforce Policy Tax and Wealth Policy Tech Policy Hill Diversity Data for Black America Workforce Policy Tax and Wealth Policy Tech Policy Hill Diversity Data for Black America Data & ResearchBriefsReports Briefs Reports Briefs Reports EventsAll EventsThe Wealth Agenda: Seizing the Moment for Black Economic AdvancementJoint Center Presented Former President Spencer Overton with Louis E. Martin Great American Award All Events The Wealth Agenda: Seizing the Moment for Black Economic Advancement Joint Center Presented Former President Spencer Overton with Louis E. Martin Great American Award All Events The Wealth Agenda: Seizing the Moment for Black Economic Advancement Joint Center Presented Former President Spencer Overton with Louis E. Martin Great American Award AboutMission StatementHistoryAnnual ReportsBoard of GovernorsStaffCareersSubscribe to Our Mailing ListContact Us Mission Statement History Annual Reports Board of Governors Staff Careers Subscribe to Our Mailing List Contact Us Mission Statement History Annual Reports Board of Governors Staff Careers Subscribe to Our Mailing List Contact Us MediaPressOp-EdsPress ReleasesMeet Our ExpertsRoundupsNewslettersTestimoniesFOCUS Magazine Archive Press Op-Eds Press Releases Meet Our Experts Roundups Newsletters Testimonies FOCUS Magazine Archive Press Op-Eds Press Releases Meet Our Experts Roundups Newsletters Testimonies FOCUS Magazine Archive DonateSupporters Supporters Supporters Tax and Wealth Policy Workforce Policy Hill Diversity Tech Policy **The Implications of Section 230 for Black Communities** This series of three issue briefs provides a summary of the law review article, “The Implications of Section 230 for Black Communities,” that examines Section 230 of the Communications Decency Act, which grants online platforms immunity from liability for user-generated content. The first brief highlights how this immunity from liability for third-party content empowers Black communities by enabling free expression and fostering innovation, while also examining how the same immunity allows harmful practices to persist. The second brief examines the nuances and legal implications of the statute, specifically how it affects platform moderation practices, including potential biases in content moderation that often disproportionately impact Black users. The third brief explores the implications of various Section 230 reform proposals with a focus on their unique impact on Black communities. Danielle A. Davis, Esq., is the director of Technology Policy at the Joint Center for Political and Economic Studies, where she leads the organization's Technology Policy program. Her primary areas of focus encompass broadband adoption and access, content moderation, and privacy issues. She brings a wealth of experience to her role as a highly accomplished attorney specializing in technology and telecommunications law, policy development, and civil rights advocacy. Before assuming her current position, Danielle held the role of assistant general counsel at the Universal Service Administrative Company. In this capacity, she provided legal counsel related to the administration of the Affordable Connectivity Program and the USF Lifeline Program. Additionally, she served as a Tech and Telecom Policy counsel at the Multicultural Media, Telecom, and Internet Council. Here, she offered guidance on tech and telecom matters to leadership, managed the fellowship program, reviewed outgoing communications, and drafted and edited comments submitted to the FCC and NTIA. Danielle's impressive academic background includes a Juris Doctor degree from Barry University, Dwayne O. Andreas School of Law, as well as a Bachelor of Science in General Economics and a Bachelor of Arts in Political Science from Florida Atlantic University, where she graduated cum laude. She is an active member of the Florida Bar, the Federal Communications Bar Association (FCBA), and the International Association of Privacy Professionals (IAPP). Danielle also serves as a co-chair on the FCBA's Privacy and Data Security Committee. These issue briefs stem from the original research co-authored bySpencer Overton, Patricia Roberts Harris Research Professor of Law at the George Washington University Law School and former Joint Center president, andCatherine Powell, Eunice Hunton Carter Distinguished Research Scholar, Professor of Law titled, “The Implications of Section 230 for Black Communities.” This research, sponsored by the Joint Center, is the first time Section 230 has been explored solely from a Black perspective. Read the full press release here. **Quick Links** ABOUT Issues Data & Research Events Media Donate **Newsletter** Stay informed about the Joint Center ©Joint Center for Political and Economic Studies 633 Pennsylvania Avenue NW, Washington, DC 20004 Email is the easiest and fastest way to reach us. 202-789-3500|info@jointcenter.org **Share on Mastodon**"}