{"id": 1230, "name": "Scroll.in", "domain": "scroll.in", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://scroll.in/article/1083411/election-conduct-rules-amended-at-lightning-speed-despite-objection-by-law-officers-documents-show", "title": "Election Conduct Rules Amended At Lightning Speed Despite Objection By Law Officers Documents Show", "content": "Newsletters Gift Membership Home Common Ground The India Fix Eco India The Latest The Reel Magazine Video TrendingA new self-help book shows how Stoic philosophy can be the key to navigating our modern worldInterview: Now ‘everyone is afraid’ of speaking about the Great Nicobar project, says ornithologistArunachal Pradesh: Scientists, researchers call for suspending Siang Valley dam constructionElection conduct rules amended at lightning speed despite objection by law officers, documents showRomance: Aanya is ready for a fresh start in India, and she is captivated by a handsome young manWhy the National Testing Agency continues to fail students in IndiaAsbestos in talcum, testing on prisoners: An account of Johnson & Johnson’s dangerous practicesReading Frederick Forsyth, whose thrillers that we grew up with predicted the future uncannilyWhen US media feared ‘another Cuba’ in the Himalayas and Indian Ocean‘I have seen time / Gathering in a contained space’: Gulzar writes to Rumi, Pancham, and friendsHow Airbnb scams endanger the lives of usersHarsh Mander: The assault of four Muslims and the two sides of India’s meat economy A new self-help book shows how Stoic philosophy can be the key to navigating our modern world Interview: Now ‘everyone is afraid’ of speaking about the Great Nicobar project, says ornithologist Arunachal Pradesh: Scientists, researchers call for suspending Siang Valley dam construction Election conduct rules amended at lightning speed despite objection by law officers, documents show Romance: Aanya is ready for a fresh start in India, and she is captivated by a handsome young man Why the National Testing Agency continues to fail students in India Asbestos in talcum, testing on prisoners: An account of Johnson & Johnson’s dangerous practices Reading Frederick Forsyth, whose thrillers that we grew up with predicted the future uncannily When US media feared ‘another Cuba’ in the Himalayas and Indian Ocean ‘I have seen time / Gathering in a contained space’: Gulzar writes to Rumi, Pancham, and friends How Airbnb scams endanger the lives of users Harsh Mander: The assault of four Muslims and the two sides of India’s meat economy A new self-help book shows how Stoic philosophy can be the key to navigating our modern world Interview: Now ‘everyone is afraid’ of speaking about the Great Nicobar project, says ornithologist Arunachal Pradesh: Scientists, researchers call for suspending Siang Valley dam construction Election conduct rules amended at lightning speed despite objection by law officers, documents show Romance: Aanya is ready for a fresh start in India, and she is captivated by a handsome young man Why the National Testing Agency continues to fail students in India Asbestos in talcum, testing on prisoners: An account of Johnson & Johnson’s dangerous practices Reading Frederick Forsyth, whose thrillers that we grew up with predicted the future uncannily When US media feared ‘another Cuba’ in the Himalayas and Indian Ocean ‘I have seen time / Gathering in a contained space’: Gulzar writes to Rumi, Pancham, and friends How Airbnb scams endanger the lives of users Harsh Mander: The assault of four Muslims and the two sides of India’s meat economy SectionsPoliticsCultureIndiaWorldFilm and TVMusicBooks and IdeasBusiness and EconomyScience and TechnologyIn PicturesAnnouncementsBookshopThe FieldPulseElections 2024 Politics Culture India World Film and TV Music Books and Ideas Business and Economy Science and Technology In Pictures Announcements Bookshop The Field Pulse Elections 2024 Politics Culture India World Film and TV Music Books and Ideas Business and Economy Science and Technology In Pictures Announcements Bookshop The Field Pulse Elections 2024 **Reading** 1A new self-help book shows how Stoic philosophy can be the key to navigating our modern world A new self-help book shows how Stoic philosophy can be the key to navigating our modern world A new self-help book shows how Stoic philosophy can be the key to navigating our modern world A new self-help book shows how Stoic philosophy can be the key to navigating our modern world 2Interview: Now ‘everyone is afraid’ of speaking about the Great Nicobar project, says ornithologist Interview: Now ‘everyone is afraid’ of speaking about the Great Nicobar project, says ornithologist Interview: Now ‘everyone is afraid’ of speaking about the Great Nicobar project, says ornithologist Interview: Now ‘everyone is afraid’ of speaking about the Great Nicobar project, says ornithologist 3Arunachal Pradesh: Scientists, researchers call for suspending Siang Valley dam construction Arunachal Pradesh: Scientists, researchers call for suspending Siang Valley dam construction Arunachal Pradesh: Scientists, researchers call for suspending Siang Valley dam construction Arunachal Pradesh: Scientists, researchers call for suspending Siang Valley dam construction 4Election conduct rules amended at lightning speed despite objection by law officers, documents show Election conduct rules amended at lightning speed despite objection by law officers, documents show Election conduct rules amended at lightning speed despite objection by law officers, documents show Election conduct rules amended at lightning speed despite objection by law officers, documents show 5Romance: Aanya is ready for a fresh start in India, and she is captivated by a handsome young man Romance: Aanya is ready for a fresh start in India, and she is captivated by a handsome young man Romance: Aanya is ready for a fresh start in India, and she is captivated by a handsome young man Romance: Aanya is ready for a fresh start in India, and she is captivated by a handsome young man 6Why the National Testing Agency continues to fail students in India Why the National Testing Agency continues to fail students in India Why the National Testing Agency continues to fail students in India Why the National Testing Agency continues to fail students in India 7Asbestos in talcum, testing on prisoners: An account of Johnson & Johnson’s dangerous practices Asbestos in talcum, testing on prisoners: An account of Johnson & Johnson’s dangerous practices Asbestos in talcum, testing on prisoners: An account of Johnson & Johnson’s dangerous practices Asbestos in talcum, testing on prisoners: An account of Johnson & Johnson’s dangerous practices 8Reading Frederick Forsyth, whose thrillers that we grew up with predicted the future uncannily Reading Frederick Forsyth, whose thrillers that we grew up with predicted the future uncannily Reading Frederick Forsyth, whose thrillers that we grew up with predicted the future uncannily Reading Frederick Forsyth, whose thrillers that we grew up with predicted the future uncannily 9When US media feared ‘another Cuba’ in the Himalayas and Indian Ocean When US media feared ‘another Cuba’ in the Himalayas and Indian Ocean When US media feared ‘another Cuba’ in the Himalayas and Indian Ocean When US media feared ‘another Cuba’ in the Himalayas and Indian Ocean 10‘I have seen time / Gathering in a contained space’: Gulzar writes to Rumi, Pancham, and friends ‘I have seen time / Gathering in a contained space’: Gulzar writes to Rumi, Pancham, and friends ‘I have seen time / Gathering in a contained space’: Gulzar writes to Rumi, Pancham, and friends ‘I have seen time / Gathering in a contained space’: Gulzar writes to Rumi, Pancham, and friends **Election conduct rules amended at lightning speed despite objection by law officers, documents show** **The amendment that limits public access to election-related documents and recordings was cleared and notified in two days.** On December 21,Scrollwas the first to report thatthe Conduct of Election Ruleshad been amended to deny public access to election-related papers – a move that the Opposition said would reduce transparency in the electoral process. Documents accessed byScrollnow reveal that this amendment was made at lightning speed – despite the law officers of the Union Law Ministry objecting to the original draft proposed by the Election Commission. The Election Commission wrote to the Ministry of Law on December 17, proposing an amendment to the Conduct of Election Rules, 1961. The letter was received by the ministry on December 19. The very next day, December 20, officers of the law ministry and the Election Commission discussed the proposed amendment, made changes to the draft, which was cleared by the law secretary and the Union law minister and sent back to the poll panel. That day itself, the Election Commission responded to the Law Ministry, accepting the draft copy of the amendment, and requesting that “the same may be notified at the earliest”. The amendment was notified at 10.23 pm on December 20. A week before the Election Commission had initiated the amendment process, on December 9, the Punjab and Haryana High Court had directed the Election Commission to provide video recordings and copies of documents related to polling in the Haryana assembly elections to advocate Mehmood Pracha. The amendment ensured the Election Commission would not have to make these disclosures. **Disagreement between law ministry and ECI** The amendment was cleared and notified in less than two days despite law officers objecting to the language used in the original draft. The Election Commission wanted to amend Rule 93 of the Conduct of Election Rules, 1961. At that time, Rule 93 of the Conduct of Election Rules allowed public inspection of “all other papers relating to the election” except electronic voting machines, used and unused ballot papers, a marked copy of the electoral roll, and Form 17A, which is a register of voters who have cast their votes in an election. This meant anyone could inspect electronic recordings like CCTV footage of polling booths and Form 17C, a document that records the total number of votes cast at a polling station for each candidate. Advocate Mehmood Pracha had sought access to Form 17 C and CCTV footage from polling booths in Haryana citing this rule, and the Punjab and Haryana High Court had upheld his plea. Within days of the court order, the Election Commission wrote to the law ministry, proposing Rule 93 be amended to limit public access to election-related papers and electronic recordings. Specifically, it proposed that sub-rule (2A) of Rule 93 be amended to add the word “statutory” before “papers”. At that time, the sub-rule said: “all other papers relating to the election shall be open to public inspection”. In its letter, the poll panel argued: “Providing non-statutory papers and electronic recordings necessitates involvement of substantial manpower, which is impractical post-election, as administrative resources are significantly reduced.” It added that since “the office of the Returning Officer ceases to exist” after an election is over, “assigning them additional workload of supplying non-statutory documents post elections, at such a large scale, will overburden and cripple the administrative functioning in the field”. The Election Commission also argued that providing public access to “all other papers” related to elections may “create confusion”. “Further, the term ‘all other papers’ is a wide term and can be interpreted to include all kinds of materials related to election, which may create confusion and unnecessary administrative burden, serving no legal purpose,” it wrote in its letter to the law ministry. Correspondence between the poll panel and the law ministry accessed byScrollreveals that the law officers objected to the proposed amendment. The officers told the poll body that sub rules (1) and (1A) of Rule 93 of Conduct of Elections Rules provide a list of election records that cannot be accessed by public, and adding “statutory” in sub-rule (2) of Rule 93 would “impose further restrictions on the inspection of papers” which may not be the intention of Conduct of Elections Rules which have been in place for last 63 years. “Putting the word ‘statutory’ before the word ‘papers’ will impose further restrictions on the inspection of papers which may not be the intention of sub-rule (2) of Conduct of Elections Rules,” law ministry officials wrote. The officials further argued that “the word ‘statutory’ is not defined and inference of its meaning may not be ascertained from the construction of the language of the rules. This will lead to ambiguity to the provisions thereof.” Documents accessed byScrollshow that at the insistence of law officers, the Election Commission agreed to replace “statutory papers” with “all other papers specified in these rules” in the proposed amendment to the Conduct of Elections Rules. While the original amendment proposed by the Election Commission would have given it greater discretion to deny access to any document not defined or explicitly stated in the rules, the changed provision appears to leave room for the inspection of records that have not been explicitly denied to the public. Election Commission of India Form 17C Conduct of Election Rules **Related** **Trending** A new self-help book shows how Stoic philosophy can be the key to navigating our modern world Interview: Now ‘everyone is afraid’ of speaking about the Great Nicobar project, says ornithologist Arunachal Pradesh: Scientists, researchers call for suspending Siang Valley dam construction Election conduct rules amended at lightning speed despite objection by law officers, documents show Romance: Aanya is ready for a fresh start in India, and she is captivated by a handsome young man"}