{"id": 1183, "name": "Republic Report", "domain": "republicreport.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.republicreport.org/2025/he-gave-1-million-to-elect-trump-the-justice-dept-just-took-his-for-profit-college-to-trial-for-fraud-and-lost/", "title": "He Gave 1 Million To Elect Trump The Justice Dept Just Took His For Profit College To Trial For Fraud And Lost", "content": "INVESTIGATING HOW MONEY CORRUPTS DEMOCRACY About Archives Contact **He Gave $1 Million to Elect Trump. The Justice Dept Just Took His For-Profit College To Trial for Fraud (And Lost).** Former for-profit college owner Carl Barney donated more than a million dollars to political committees working to elect Donald Trump in 2024. Yet while the transactional Trump has spent much of his first 100 days taking actions, including through the justice system, that benefit big donors, cronies, and other supporters, the U.S. Justice Department this month proceeded to trial in a long-running fraud case against Barney’s now-shuttered schools. Today, however, after a federal judge had eliminated most of the claims against Barney’s schools from the case, a Utah jury ruled in favor of the schools. The Justice Department has the right to appeal, but it’s unclear if it will do so. Amid a torrent of donations to Republican committees last fall totaling over $1.6 million,Barneygave $924,600 to the Trump 47 Committee, $74,500 to the Trump-supporting Make America Great Again PAC, and $247,800 to the Republican National Committee, according to federal records. In a Septemberposton his personal website, Barney explained that he liked that Trump “wants to work with Elon Musk to reduce spending, regulations, waste, and fraud in the federal government.” I take Barney at this word that his donation really did relate in part to concerns about government waste and fraud. But the irony is apparent: His school operation has been rightly accused by multiple law enforcement and oversight bodies of itself engaging in blatant fraud or other misconduct with taxpayer dollars. In reality, the Trump-Musk DOGE project since January has done little to target actual real waste, fraud, and abuse. Instead it appears to have focused mostly on weakening or eliminating either (1) agencies that work on priorities — such as equal opportunity for Americans or alleviation of poverty or disease overseas — that Trump or Musk dislike; or (2) agencies that have been investigating Musk businesses, or businesses of other top Trump donors. But apparently Barney’s $1 million, whatever his motivations for giving, did not elevate him into the class of supporters Trump wanted to reward. Instead, the Justice Department, now under the control of loyal Trump lieutenant Attorney General Pam Bondi, in this instance did its job: It went to trial on the claim that Barney’s school had engaged in fraud. Carl Barney owned a school chain that included the CollegeAmerica, Stevens-Henager, and Independence University brands. In 2012, hesold the operationto the Center for Excellence Higher Education, a non-profit organization he had recently taken over, in atroubling deal. Barney loaned CEHE $431 million to finance the sale, based on a puzzling $419 million valuation of the schools’ “intangible assets,” such as its reputation. CEHE was then obligated to repay its debt to Barney, along with millions in rent he charged for the schools to use his buildings. The schools ultimately took in more than a billion in taxpayer dollars, and much of that money went straight into Barney’s wallet. The case that concluded today began back in 2013, whenKatie Brooks and Nannette Wride, two former recruiters at a Utah campus of Stevens-Henager, sued CEHE under the federal False Claims Act. The two whistleblowers alleged the the school had engaged in a range of illegal and deceptive practices that defrauded U.S. taxpayers, who funded student grants and loans obtained by the school. The next year, the Justice Department, having reviewed the evidence, agreed to join the lawsuit as to some, but not all, of the claims made by Brooks and Wride. With DoJ now in charge, the case proceeded slowly through pre-trial discovery andmotionsfor more than a decade. It was transferred by the federal court in Idaho to the one in Salt Lake City, and eventually the presiding judge, Jill Parrish, on her own initiative, barred the whistleblowers’ lawyers from pursuing some of the claims. She also dismissed some of the government’s claims until the case wasnarrowed downto a single matter: Stevens-Henager College had a policy and practice of basing compensation for its recruiters in part on the number of students who completed at least one year of their programs. Judge Parrish determined that this approach violated the Department of Education’s “incentive compensation ban” (ICB), which bars compensation tied to student enrollments. Theissues for the jury at trialwere whether Stevens-Henager knowingly made a false promise to the Department of Education to comply with the incentive compensation ban — whether, as Judge Parrish put it, the school “knew that [its policy] violated the ICB yet continued to award bonuses under it anyway” — and whether that Department relied on CEHE”s promise to obey the law in maintaining the school’s eligibility for federal aid. On Friday April 18, with the long-delayed trial set to start the next Monday, CEHE sought to defer the date again, telling the court in an “Emergency Motion” that one of its witnesses was unavailable for trial due to a serious medical issue that required tests. The Justice Department opposed the motion, noting that CEHE already had designated the witness’s pre-trial deposition for possible use at trial, and that the witness also could testify remotely. Judge Parrish held a hearing that day via Zoom and denied CEHE’s motion. CEHE’s lead lawyer for the trial was Northern Virginia lawyerSteve Gombos, who has represented CEHE in numerous matters related to its predatory practices. A person who attended the trial characterized Gombos’s opening statement as “too much righteous indignation too soon, with big words and an accusatory tone” that seemed to clash with the be-nice Utah ethos. (Gombosdidn’t seem all that nicethe one time he and I spoke.) But at trial Judge Parrish herself seemed to take a suspicious view of one of the whistleblowers, accusing her of perjury because in her testimony she denied she had a financial interest in the case. The whistleblower knew that, if the government prevailed, she stood to share in the recovery, as the False Claims Act provides in order to encourage people to expose fraud. She seemed to be testifying that justice, rather than money, was her main motivation, rather than trying to hide the reality that she might benefit financially. But the judge gave the jury an instruction that targeted the accuracy of her testimony. The Troubling Record of Carl Barney’s Colleges Like Donald Trump, who in 2016 paid $25 million to settle civil charges by New York’s attorney general that his unaccredited real estate school, Trump University, defrauded its students, Carl Barney saw his schools shut down after law enforcement agencies and former students went to court over claims of deceptive practices. The CEHE schools, which operated both on campus and online, repeatedly engaged in deceptive and predatory recruiting and lending for its high-priced and often poor-quality programs. In August 2020, following an extensive trial, a Colorado state court sided with that state’s attorney general and found CEHE, CollegeAmerica, Barney, and CEHE CEO Eric Juhlinliable for deceptive practicesand awarded a $3 million judgment. The Colorado court found that Barney’s schools used a detailed playbook to manipulate vulnerable students into enrolling in high-priced, low-quality programs; that the schools directed admissions representatives to “enroll every student,” regardless of whether the student would likely graduate; that the schools’ recruiters and advertisements greatly overstated starting salaries that graduates could earn; and that the schools falsely inflated graduation rates. (CEHE and the Colorado attorney general’s office wereback in the state trial courtin Denver last fall, after high-priced lawyers for Barney pursued an appeal to the Colorado Supreme Court that resulted in an order requiring the trial judge to make some additional findings.) In April 2021, Independence’s accreditor, ACCSC,ended its approval of the school, which by then was CEHE’s main school, effectively repealing its eligibility for federal student grants and loans. Soon after, the U.S. Department of Education restricted the flow of such aid. In the wake of those developments,CEHE shut down classes and laid off most staff. Although its schools were shuttered, CEHE still faced additional legal challenges. In addition to the Justice Department’s False Claims lawsuit, the federal Consumer Financial Protection Bureau pursued a separateinvestigationinto CEHE’s private loan practices. (The new Trump administration has gutted the CFPB, presumably killing that probe.) CEHE, despite the probes, bad publicity, and collapse of its schools, hascontinued trying to collect the high-interest private loan debtit created for its brokeformer students. CEHE has portrayed itself as a victim of a political conspiracy against it, with ongoingvitriolonTwitterfrom former CEOEric Juhlin, whom the Department of Education took the rare step ofsuspending from federal contracting. More attacks on CEHE critics,and the Colorado attorney general officeand court, have come from Barney. Barney haschargedon hisgrievance-heavy blogthat the case brought by the Colorado AG against his schools is a “horror story of government corruption,” and “a multi-agency collusion to put schools out of business” — a supposed plot that involved not only a senior assistant Colorado attorney general, but also the executive director of accreditor ACCSC, officials of the U.S. Department of Eduction, and “the cabal of progressive haters of private colleges (David Halperin, Robert Shireman, entities funded by Arnold Ventures, Sen. Elizabeth Warren, and Sen. Richard Durbin).” In December 2022,CEHEtook its grievance campaign to a new low bysuing the United States government for $500 millionin the U.S. Court of Claims, asserting, as a press release statement by Juhlin contended, that the Department of Education “in coordination with ideological confederates… has been on a campaign to cripple and close as many private career colleges as possible” and that CEHE’s schools were “a victim of this campaign.” During President Biden’s last week in office, the Department of Education granted $1.15 billion in automatic debt cancellation to 73,600 borrowers who attended CEHE schools between 2006 and the school chain’s collapse in 2021. The Department said in a statement that its decision was “based on findings that CEHE engaged in widespread and pervasive misrepresentations related to salaries, employment prospects, and its private loan product.” **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Republic Report is dedicated to rooting out the corruption that is so corrosive to American values. We investigate and uncover the buying and selling of politicians and of institutions entrusted with upholding the public interest. We expose how big money distorts major policy decisions – harming our economy and our people."}