{"id": 678, "name": "Institute for New Economic Thinking", "domain": "ineteconomics.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ineteconomics.org/get-updates", "title": "Get Updates", "content": "Our Purpose Leadership & Staff History INET in the News Contact Us Working Papers Global Commission on Economic Transformation Books with Cambridge University Press Programs Partnerships Experts Grants The Pandemic and the Economic Crisis: A Global Agenda for Urgent Action Addressing COVID-19 in Africa: Challenges and Leadership in a Context of Global Economic Transformation Plenaries Upcoming Past Collections Agriculture Business & Industry Complexity Economics Culture Development Economic Geography Economics Profession Education Energy Environment Finance Gender Government & Politics Health History Human Behavior Imperfect Knowledge Industrial Policy Inequality & Distribution Labor Laws Macroeconomics Math & Statistics Microeconomics Philosophy & Ethics Private Debt Race Technology & Innovation Trade **More** Login NEWSLETTER DONATE Facebook Twitter YouTube Email **About** We are economists and thinkers from a range of disciplines who challenge conventional wisdom and advance ideas to better serve society. Our Purpose Leadership & Staff History INET in the News Contact Us **Research** We develop research that challenges economic orthodoxy and serves society. Working Papers Global Commission on Economic Transformation Books with Cambridge University Press Programs Partnerships Experts Grants The Pandemic and the Economic Crisis: A Global Agenda for Urgent Action Addressing COVID-19 in Africa: Challenges and Leadership in a Context of Global Economic Transformation **Articles** Commentary, analysis, interviews, and research summaries by INET-affiliated writers. **Video** Interviews, presentations and video series with provocative economic thinkers, public figures and students. **Podcast** Economics and Beyond with Rob Johnson, a podcast featuring interviews with some of the world’s most important thinkers, artists, and activists about the pressing issues of our time. The podcast is also available on all major podcasting platforms, such as Apple, Spotify, Google, and Podbean. **Education** Video series and courses for students and educators interested in exploring new economic thinking. **Events** To foster new economic thinking, we host convenings that gather together a diverse community of thinkers from different fields, countries, and schools of thought. Plenaries Upcoming Past **YSI** Through the Young Scholars Initiative (YSI), INET provides support to students, young professionals, or others who embrace new and critical ways of thinking about the economy. YSI fosters conversation among those who wish to engage with new economic thinking and connects young scholars to the Institute’s vast network of economists. **Topics** Browse all INET content organized by topic Collections Agriculture Business & Industry Complexity Economics Culture Development Economic Geography Economics Profession Education Energy Environment Finance Gender Government & Politics Health History Human Behavior Imperfect Knowledge Industrial Policy Inequality & Distribution Labor Laws Macroeconomics Math & Statistics Microeconomics Philosophy & Ethics Private Debt Race Technology & Innovation Trade **Receive Newsletter and Communiqués** Sign up below to receive the weekly INET newsletter, featuring insider perspectives on the key economic issues of today, video interviews with leading thinkers, new economic research, and special access to invite-only Institute events.Young Scholars Initiative (YSI) email list members will receive frequent community updates.In accordance with INET policy, your contact information will never be sold, given away, or made public without your permission. Thanks for subscribing to our newsletter. We could not subscribe you to our newsletter at this moment. Please try again later. Our e-mail newsletter shares new events, courses, articles, and will keep you updated on our initiatives. Thanks for subscribing to our newsletter. We could not subscribe you to our newsletter at this moment. Please try again later. FacebookTwitterYouTube Institute for New Economic Thinking 60 E 42nd St, Ste 450 New York, NY 10165 (646) 751-4900 ©2025 Institute for New Economic Thinking. All Rights Reserved **Featured work onEnvironment** European Natural Gas through the 2020s: the Decade of Extremes, Contradictions and Continuing UncertaintiesPaperWorking PaperByYaroslav Melekh,James Dixon,Katrina Salmon, andMichael GrubbMay 2025 **European Natural Gas through the 2020s: the Decade of Extremes, Contradictions and Continuing Uncertainties** PaperWorking PaperByYaroslav Melekh,James Dixon,Katrina Salmon, andMichael Grubb May 2025 **European Natural Gas through the 2020s: the Decade of Extremes, Contradictions and Continuing Uncertainties** PaperWorking PaperByYaroslav Melekh,James Dixon,Katrina Salmon, andMichael Grubb May 2025 Europe’s Gas Roller CoasterArticleByYaroslav MelekhandMichael GrubbMay 13, 2025 **Europe’s Gas Roller Coaster** ArticleByYaroslav MelekhandMichael Grubb May 13, 2025 **Europe’s Gas Roller Coaster** ArticleByYaroslav MelekhandMichael Grubb May 13, 2025 How Climate Denial is Fueling a U.S. Homeowners Insurance Crisis and Risking a 2008-Style Financial MeltdownArticleByLynn ParramoreFeb 13, 2025 **How Climate Denial is Fueling a U.S. Homeowners Insurance Crisis and Risking a 2008-Style Financial Meltdown** ArticleByLynn Parramore Feb 13, 2025 **How Climate Denial is Fueling a U.S. Homeowners Insurance Crisis and Risking a 2008-Style Financial Meltdown** ArticleByLynn Parramore Feb 13, 2025 View more from this topic **All topics** Agriculture Business & Industry Complexity Economics Culture Development Economic Geography Economics Profession Education Energy Environment Finance Gender Government & Politics Health History Human Behavior Imperfect Knowledge Industrial Policy Inequality & Distribution Labor Laws Macroeconomics Math & Statistics Microeconomics Philosophy & Ethics Private Debt Race Technology & Innovation Trade **Featured expertsView all** Rob JohnsonPresidentPresident, Institute for New Economic Thinking Rob Johnson President President, Institute for New Economic Thinking Rob Johnson President President, Institute for New Economic Thinking Beyond IndustrialismVideoFeaturingFred BlockandRob JohnsonMar 5, 2025 **Beyond Industrialism** VideoFeaturingFred BlockandRob Johnson Mar 5, 2025 **Beyond Industrialism** VideoFeaturingFred BlockandRob Johnson Mar 5, 2025 America’s BurningVideoFeaturingDavid M. SmickandRob JohnsonJul 31, 2024 **America’s Burning** VideoFeaturingDavid M. SmickandRob Johnson Jul 31, 2024 **America’s Burning** VideoFeaturingDavid M. SmickandRob Johnson Jul 31, 2024 View more from this expert View all experts **Featured work inSouth Asia** The Right to Energy & Carbon Tax: A Game Changer in IndiaArticleByRohit AzadandShouvik ChakrabortyJun 10, 2019 **The Right to Energy & Carbon Tax: A Game Changer in India** ArticleByRohit AzadandShouvik Chakraborty Jun 10, 2019 **The Right to Energy & Carbon Tax: A Game Changer in India** ArticleByRohit AzadandShouvik Chakraborty Jun 10, 2019 The Bogus Paper that Gutted Workers’ RightsArticleByServaas StormFeb 6, 2019 **The Bogus Paper that Gutted Workers’ Rights** ArticleByServaas Storm Feb 6, 2019 **The Bogus Paper that Gutted Workers’ Rights** ArticleByServaas Storm Feb 6, 2019 Unstable Capital Flows Threaten Emerging EconomiesArticleByTerry McKinleyandFrancis CrippsAug 24, 2018 **Unstable Capital Flows Threaten Emerging Economies** ArticleByTerry McKinleyandFrancis Cripps Aug 24, 2018 **Unstable Capital Flows Threaten Emerging Economies** ArticleByTerry McKinleyandFrancis Cripps Aug 24, 2018 View more from this region **All regions** Africa AsiaChinaHong KongJapan China Hong Kong Japan China Hong Kong Japan Australia EuropeAustriaDenmarkEnglandFranceGermanyGreeceHungaryIrelandItalyPortugalUKUkraine Austria Denmark England France Germany Greece Hungary Ireland Italy Portugal UK Ukraine Austria Denmark England France Germany Greece Hungary Ireland Italy Portugal UK Ukraine Middle East North AmericaCanadaUnited States Canada United States Canada United States South AmericaBrazilChile Brazil Chile Brazil Chile South Asia India Russia Poland"}