{"id": 81, "name": "Andalusia Star News", "domain": "andalusiastarnews.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.andalusiastarnews.com/2025/06/04/covington-county-chapter-of-alabama-alumni-will-host-25th-annual-scholarship-golf-tournament-june-10/", "title": "Covington County Chapter Of Alabama Alumni Will Host 25th Annual Scholarship Golf Tournament June 10", "content": "Home News Schools Sports Opinion Lifestyles Obituaries Classifieds Records Contests ServicesAbout UsPolicies About Us Policies About Us Policies Public Notices E-Edition **Covington County chapter of Alabama alumni will host 25th annual scholarship golf tournament June 10** Published 9:15 am Wednesday, June 4, 2025 ByZack Maio The Covington County Chapter of the University of Alabama National Alumni Association will host its 25th Annual Alabama Alumni Scholarship Golf Tournament on Tuesday, June 10, at the Andalusia Country Club. Registration begins at 11 a.m., followed by lunch at 11:45 a.m. The tournament will tee off with a shotgun start at 1 p.m. The event follows a two-person scramble format, open to teams of men, women, or mixed participants. Teams will be pre-flighted based on average handicaps. Individual golfers will be matched with a partner by the tournament committee. First held in 1997 under then-chapter president Riley Powell, the golf tournament was established to support local scholarships. “At the time, we only had two endowed scholarships: the Susan Jeaneace Kirkland Memorial and the F. Murland Smith Memorial,” Tournament Organizer Keron Kyzar said. The chapter now awards 13 endowed scholarships annually, benefitting incoming freshmen, LBW Community College transfer students, and upperclassmen from Covington County. The scholarship fund’s total corpus balance stands at $686,000. This year, the chapter awarded approximately $30,000 in scholarships. Two additional scholarships are currently being endowed, which will bring the total to 15. “We modeled our tournament after other chapters that were hosting golf events to raise money. It made sense; there were a lot of local Alabama fans who played golf,” Kyzar added. Over 24 years, the tournament has generated over $107,000 for scholarships. The $4,100 raised in 2024, along with this year’s proceeds, will benefit two funds: the Kathy W. Jones Endowed Scholarship and the Molly Grimes White Memorial Endowed Scholarship. “The funds we raise, which are mostly from hole sponsorships and donations, go directly into the scholarship corpus,” Chapter Treasurer Kathy Jones said. A $25,000 hole-in-one prize will be offered on Hole #9. Additional prizes sponsored by The Citizens Bank will be awarded to participants who make a hole-in-one on #3, #5, and #16. Proceeds from this year’s tournament will help grow two meaningful scholarship funds. The Kathy W. Jones Endowed Scholarship, honoring Jones’ 40-plus years of service to the chapter, will support a Covington County upperclassman majoring in accounting once fully endowed at $25,000. The Molly Grimes White Memorial Endowed Scholarship honors Molly White, an Opp High School graduate, UA cheerleader, and university recruiter in the Covington and Wiregrass areas. It will be awarded to an Opp High School graduate who demonstrates leadership and strong character. The event has drawn notable guests over the years, including Big Al, Mal Moore, Mike Dubose, Barry Krauss, John Hannah, Scott Cochran, Brodie Croyle, and Jeremiah Castille. Following a tornado in Tuscaloosa in 2011, Tripp Bass and his band entertained participants after the tournament and showcased the community spirit the event fosters. “We’re grateful for our alumni, sponsors, and volunteers. The community continues to step up year after year,” Jones said. Sponsorships are open through Thursday, June 5. Golfers can register to play until noon on Monday, June 9. A Championship Sponsor is $400 and includes team entry for two players, hole sponsorship with signage, name in printed materials, and public recognition. A Tournament Sponsor is $100 and includes hole sponsorship with signage. Proceeds benefit the White or Jones scholarship funds unless otherwise designated. A team entry only option is also available for $300 and includes tournament play for two, mulligans, ladies’ tee advance on Hole #13, and lunch. For more information, call Keron Kyzar at 334-488-6090 or Jeff Sellers at 334-343-5565. **Boswell seeks re-election for city’s Dist. 4** **Firefighters respond to Opp residential fire** **GALLERY: Carnley, Hammett address key issues at AACC’s Legislative Luncheon** **Andalusia Municipal Court moves to new facility** Real Estate Preview **Real Estate Preview** **Real Estate Preview** PollsWhat is your ideal summer vacation?BeachesMountainsBig CityTheme ParkInternational TravelStay at HomeView ResultsLoading ... **Polls** What is your ideal summer vacation? Beaches Mountains Big City Theme Park International Travel Stay at Home View Results **Polls** What is your ideal summer vacation? Beaches Mountains Big City Theme Park International Travel Stay at Home View Results Absolutely Andalusia **Absolutely Andalusia** **Absolutely Andalusia** Home News Sports Opinion Lifestyles Obituaries Small Business About Us Subscriptions Policies © 2025, The Andalusia Star-News"}