{"id": 153, "name": "North Bay Bohemian", "domain": "bohemian.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://bohemian.com/lords-work-with-sister-sparkle-plenty-of-the-sisters-of-perpetual-indulgence/", "title": "Lords Work With Sister Sparkle Plenty Of The Sisters Of Perpetual Indulgence", "content": "NewsFeaturesLocal News Features Local News Features Local News A&EArtsBooks & LiteratureCultureFictionGiftsMoviesMusicSpotlightTheater Arts Books & Literature Culture Fiction Gifts Movies Music Spotlight Theater Arts Books & Literature Culture Fiction Gifts Movies Music Spotlight Theater Columns & OpinionAstrologyLetters to the EditorLocalsNotedOpinion Astrology Letters to the Editor Locals Noted Opinion Astrology Letters to the Editor Locals Noted Opinion Food & DrinkBrewpubsDiningRestaurantsSmall BitesStaycationSwirl Brewpubs Dining Restaurants Small Bites Staycation Swirl Brewpubs Dining Restaurants Small Bites Staycation Swirl Best OfReaders’ Picks 2025Writers’ Picks 2025Best of Arts and CultureBest of Beer, Wine and SpiritsBest of CannabisBest of RestaurantsBest of ServicesBest of Family and PetsBest of Health and BeautyBest of ShoppingBest of Home ImprovementBest of RecreationBest of Romance Readers’ Picks 2025 Writers’ Picks 2025 Best of Arts and Culture Best of Beer, Wine and Spirits Best of Cannabis Best of Restaurants Best of Services Best of Family and Pets Best of Health and Beauty Best of Shopping Best of Home Improvement Best of Recreation Best of Romance Readers’ Picks 2025 Writers’ Picks 2025 Best of Arts and Culture Best of Beer, Wine and Spirits Best of Cannabis Best of Restaurants Best of Services Best of Family and Pets Best of Health and Beauty Best of Shopping Best of Home Improvement Best of Recreation Best of Romance Magazines50upProfilesBohemeExplore 50up Profiles Boheme Explore 50up Profiles Boheme Explore PeopleAbout UsProfilesObituariesSubmit an ObituaryWhat to Include in Your North Bay Obituary About Us Profiles Obituaries Submit an Obituary What to Include in Your North Bay Obituary About Us Profiles Obituaries Submit an Obituary What to Include in Your North Bay Obituary CalendarUpcoming EventsSubmit an EventPromote Your Event Upcoming Events Submit an Event Promote Your Event Upcoming Events Submit an Event Promote Your Event NewsFeaturesLocal NewsLATEST ARTICLESSonoma Developer Arrested in...May 23, 2025Summertime and the Living...May 20, 2025 FeaturesLocal NewsLATEST ARTICLESSonoma Developer Arrested in...May 23, 2025Summertime and the Living...May 20, 2025 **LATEST ARTICLES** **Sonoma Developer Arrested in...** **Summertime and the Living...** FeaturesLocal NewsLATEST ARTICLESSonoma Developer Arrested in...May 23, 2025Summertime and the Living...May 20, 2025 **LATEST ARTICLES** **Sonoma Developer Arrested in...** **Summertime and the Living...** **LATEST ARTICLES** **Sonoma Developer Arrested in...** **Summertime and the Living...** A&EArtsBooks & LiteratureCultureFictionGiftsMoviesMusicSpotlightTheaterLATEST ARTICLESAxe Man Cometh, Albert...Jun 3, 2025A ‘Pirates’ Treasure, Gilbert...Jun 3, 2025 ArtsBooks & LiteratureCultureFictionGiftsMoviesMusicSpotlightTheaterLATEST ARTICLESAxe Man Cometh, Albert...Jun 3, 2025A ‘Pirates’ Treasure, Gilbert...Jun 3, 2025 **LATEST ARTICLES** **Axe Man Cometh, Albert...** **A ‘Pirates’ Treasure, Gilbert...** ArtsBooks & LiteratureCultureFictionGiftsMoviesMusicSpotlightTheaterLATEST ARTICLESAxe Man Cometh, Albert...Jun 3, 2025A ‘Pirates’ Treasure, Gilbert...Jun 3, 2025 **LATEST ARTICLES** **Axe Man Cometh, Albert...** **A ‘Pirates’ Treasure, Gilbert...** **LATEST ARTICLES** **Axe Man Cometh, Albert...** **A ‘Pirates’ Treasure, Gilbert...** Columns & OpinionAstrologyLetters to the EditorLocalsNotedOpinionLATEST ARTICLESLord’s Work with Sister...May 27, 2025Your Letters, May 28May 27, 2025 AstrologyLetters to the EditorLocalsNotedOpinionLATEST ARTICLESLord’s Work with Sister...May 27, 2025Your Letters, May 28May 27, 2025 **LATEST ARTICLES** **Lord’s Work with Sister...** **Your Letters, May 28** AstrologyLetters to the EditorLocalsNotedOpinionLATEST ARTICLESLord’s Work with Sister...May 27, 2025Your Letters, May 28May 27, 2025 **LATEST ARTICLES** **Lord’s Work with Sister...** **Your Letters, May 28** **LATEST ARTICLES** **Lord’s Work with Sister...** **Your Letters, May 28** Food & DrinkBrewpubsDiningRestaurantsSmall BitesStaycationSwirlLATEST ARTICLESBig Names, Big Yum:...May 6, 2025Close Up, Aperture Cellars...Apr 22, 2025 BrewpubsDiningRestaurantsSmall BitesStaycationSwirlLATEST ARTICLESBig Names, Big Yum:...May 6, 2025Close Up, Aperture Cellars...Apr 22, 2025 **LATEST ARTICLES** **Big Names, Big Yum:...** **Close Up, Aperture Cellars...** BrewpubsDiningRestaurantsSmall BitesStaycationSwirlLATEST ARTICLESBig Names, Big Yum:...May 6, 2025Close Up, Aperture Cellars...Apr 22, 2025 **LATEST ARTICLES** **Big Names, Big Yum:...** **Close Up, Aperture Cellars...** **LATEST ARTICLES** **Big Names, Big Yum:...** **Close Up, Aperture Cellars...** Best OfReaders’ Picks 2025Writers’ Picks 2025Best of Arts and CultureBest of Beer, Wine and SpiritsBest of CannabisBest of RestaurantsBest of ServicesBest of Family and PetsBest of Health and BeautyBest of ShoppingBest of Home ImprovementBest of RecreationBest of Romance Readers’ Picks 2025 Writers’ Picks 2025 Best of Arts and Culture Best of Beer, Wine and Spirits Best of Cannabis Best of Restaurants Best of Services Best of Family and Pets Best of Health and Beauty Best of Shopping Best of Home Improvement Best of Recreation Best of Romance Readers’ Picks 2025 Writers’ Picks 2025 Best of Arts and Culture Best of Beer, Wine and Spirits Best of Cannabis Best of Restaurants Best of Services Best of Family and Pets Best of Health and Beauty Best of Shopping Best of Home Improvement Best of Recreation Best of Romance Magazines50upProfilesBohemeExplore 50up Profiles Boheme Explore 50up Profiles Boheme Explore PeopleAbout UsProfilesObituariesSubmit an ObituaryWhat to Include in Your North Bay Obituary About Us Profiles Obituaries Submit an Obituary What to Include in Your North Bay Obituary About Us Profiles Obituaries Submit an Obituary What to Include in Your North Bay Obituary CalendarUpcoming EventsSubmit an EventPromote Your Event Upcoming Events Submit an Event Promote Your Event Upcoming Events Submit an Event Promote Your Event **Axe Man Cometh, Albert Lee to Perform at HopMonk** **Get Signed: The Happys, Best-Marketed Band in the North Bay** **A ‘Pirates’ Treasure, Gilbert & Sullivan Classic at 6th Street Playhouse** **Story Time: ‘The Sound Inside’ at Left Edge in Santa Rosa** **Loud and Proud, Pride Month Events Abound in North Bay** **.Lord’s Work with Sister Sparkle Plenty of The Sisters of Perpetual Indulgence** For the “expiation of stigmatic guilt”—these solemn words, spoken as a vow, are repeated each time a sister of Perpetual Indulgence dons her veil. Their clicking heels and pancake makeup and profuse glitter masks a deep purpose. “Perpetual indulgence” can mean “endless debauchery.” But within a liturgical or church context, “indulgence” means the forgiveness of sins. The Sisters are an order dedicated to endless forgiveness and compassion—for the guilty and innocent alike. There is much guilt and shame to expiate. Notwithstanding the succession of two “liberal popes,” the modern Catholic church still regards homosexuality and transsexuality as a sins. Sins kindred to fraud, violence, usury and the sexual abuse of children. The world Catholic communion stands at 1.5 billion members. Around the world, many hundreds of millions of LGBTQ + folk are persecuted, prosecuted, shamed and closeted for their love. They are persecuted and closeted here in America. Now with a renewed and emboldened bigotry. The Sisters of Perpetual Indulgence first formed in the 1980s out of spontaneous drag counterprotests to traveling preachers (of all denominations) who had come to preach fire and damnation on the streets of the Castro District—the modern “Sodom.” The local River Sisters chapter formed in Guerneville in 2001. I caught co-founder Sister Sparkle Plenty outside one of our local chapters’ locally famous charity Bingo nights. Sisters keep the gaming action hot by layering multi-card Bingo with rounds of scratchers, raffles, random giveaways and sharp-tongued comic crowd work with the many regulars. At each monthly Bingo event, a different local nonprofit or cause-of-the-moment is supported. This month was Boy Scout uniforms. The Sisters’ ministry has expanded from the protection of their community to the support of all vulnerable communities. Such is their abundant love. Cincinnatus Hibbard: Sister Sparkle, could you share with us the full vow that binds your order? Sister Sparkle Plenty: It would be my pleasure … “I hereby promise, cross my heart and hope to die, that I will forever uphold the love and spirit of The Sisters of Perpetual Indulgence. I will dedicate myself to the promulgation of universal joy and the expiation of stigmatic guilt. I will be considerate of how my words and actions affect others. I will strive diligently to have a sense of humor and to never ever take myself so seriously that I forget to have fun. Amen, a women and everybody else.” It must be beautiful to recite your purpose so beautifully every day. I would invite our readers to do the same. Sister … I noticed there wasn’t a vow of chastity in that. … No. (archly) It is suspiciously lacking isn’t it? … (Laughs)Speaking of the “promulgation of universal joy,” I understand that you now count over 100 independent chapters all over the world. Some call it global domination. (laughs) We’ve grown quite a bit—especially in the last 10 years. Growth has been surprisingly strong in the South. A lot of guilt and shame to expiate there. And a lot of fun to be had. Although it isn’t in the oath, there is an implied vow of poverty because The Sisters give away every penny that you fundraise—nothing for overhead. 100%. We are all volunteers. … we are from time to time showered with personal gifts from our many admirers … which we never refuse, (winks) (Laughs nervously)How much have you raised as an independent chapter? Over $4 million for over 200 local charities and causes. Lordy. Learn more: A full calendar of events is available atrrsisters.org. **LEAVE A REPLYCancel reply** Save my name, email, and website in this browser for the next time I comment. FOLLOW US Copyright ©Weeklys All rights reserved. OUR PUBLICATIONSAlt WeekliesEast Bay ExpressGood Times Santa CruzMetro Silicon ValleyNorth Bay BohemianPacific Sun Community WeekliesGilroy DispatchHealdsburg TribuneHollister Free LanceKing City RustlerLos GatanMorgan Hill TimesPress Banner(Scotts Valley)Salinas Valley TribuneThe Pajaronian(Watsonville)Tri-City Voice(Fremont) Magazines50upBay Area ParentBohèmeCannabis ChronicleEast BaySouth Valley ADVERTISINGAdvertiseObituariesWriting an ObituarySubmit an Obituary COMPANY INFOJob OpportunitiesPrivacy PolicyTerms of Service **Axe Man Cometh, Albert Lee to Perform at HopMonk** **Get Signed: The Happys, Best-Marketed Band in the North Bay** **A ‘Pirates’ Treasure, Gilbert & Sullivan Classic at 6th Street Playhouse**"}