{"id": 1663, "name": "American Intelligence Media", "domain": "aim4truth.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "very-low", "questionable": null, "url": "https://aim4truth.org/2025/05/01/expose-supreme-court-scandal-unleashes-a-diabolical-plot-to-crush-american-innovation-and-surrender-sovereignty-to-british-elitists/", "title": "Expose Supreme Court Scandal Unleashes A Diabolical Plot To Crush American Innovation And Surrender Sovereignty To British Elitists", "content": "Home About Us Truth History Audios & Videos MySQIF™ Privacy App™ Contact Us Search **EXPOSÉ: Supreme Court Scandal Unleashes a Diabolical Plot to Crush American Innovation and Surrender Sovereignty to British Elitists** By Anonymous Patriots, May 1, 2025 In the hallowed halls of the United States Supreme Court, where justice should reign supreme, a sinister conspiracy festers, threatening to obliterate the American dream! At the heart of this treachery isJane Sullivan Roberts, wife ofChief Justice John G. Roberts Jr., whose shadowy dealings as a legal recruiter have spun a web of corruption that ensnares the nation’s highest court. But the betrayal runs deeper—a chilling scheme to plunder a revolutionary American invention, the social networking technology invented by Leader Technologies in Columbus, Ohio, and repurpose the stolen property for global surveillance, propaganda, and obscene profits. This gripping exposé unveils a sinister coalition of corrupt judges, shadowy government entities, and elite groups. The groups include the Highlands Forum (Five Eyes [Britain], DoD, DARPA) and the British Pilgrims Society, all determined to undermine American sovereignty while enriching a select few. From the Supreme Court to the Pentagon, from the Patent Office to the core of Silicon Valley, it reveals how justice was subverted and innovation turned into a weapon against the American public. The U.S. Supreme Court, once a beacon of justice, now a fortress of betrayal. **Jane Sullivan Roberts: The Puppet Master Behind the Gavel** Jane Sullivan Robertsisn’t just the spouseof a Chief Justice—she’s a power broker orchestrating a multimillion-dollar empire that taints the very core of judicial integrity. As managing partner at Macrae’s Washington, D.C., office, she’s raked in over $10.3 million in commissions from 2007 to 2014, placing high-flying attorneys at Big Law giants like WilmerHale, Gibson Dunn, Cooley Godward, Hogan Lovells, Davis Polk, and Robins KaplanJane Roberts’ Commissions. These firms, dripping with influence, routinely argue blockbuster cases before the Supreme Court, placing Jane’s financial empire has a direct conflict of interest with her husband’s sacred duties. Take the 2019 caseDutra Group v. Batterton—WilmerHale, represented by legal thug Seth P. Waxman, swaggered into court, and Chief Justice Roberts, ignoring his wife’s $350,000 commission from placing Ken Salazar at the firm in 2013, joined the 6-3 majority favoring their clientDutra Group v. Batterton. Waxman, who’s argued over 80 cases before the Court, thrives in a world where Jane’s deals fuel his firm’s dominanceSeth P. Waxman. Gibson Dunn, Hogan Lovells, Davis Polk, and others on Jane’s client list also fill many cases on the Court’s docket, yet Roberts refuses to recuse himself, flouting the Code of Conduct for United States Judges, which demands judges avoid even theappearanceof impropriety Code of Conduct. Consider Leader Technologies’ 2012 Writ of Certiorari inLeader v. Facebookat the Supreme Court. Chief Justice John Roberts mentored Facebook’s appellate attorney, Thomas G. Hungar of Gibson Dunn. Hungar’s firm representedJane Sullivan’s client, as did Cooley Godward (Facebook’s trial counsel), Facebook itself, and Fenwick & West (one of Leader’s attorneys). Roberts held substantial stock in Microsoft, Fidelity, Vanguard, and BlackRock—entities that profited significantly from Facebook’s IPO and continue to benefit. Newly uncovered ties to the British Pilgrims Society and the Knights of Malta, English Priory, suggest that any judge adhering to the Code of Judicial Conduct should avoid affiliations with firms or companies linked to such groups, including those with Rhodes Scholars. John Roberts’ actions indicate a disregard for this code. Jane’s financial disclosures, labeling her millions as mere “salary” instead of commissions, are a blatant dodge, slammed by legal ethics expert Bennett Gershman as “legally incorrect”Jane Roberts Ethics Red Flags. This deception spits in the face of Canon 2’s call for transparency, eroding public trust in a Court already teetering on the brink Chief Justice Roberts’ Wife Ethics Concerns.The rot spreads beyond Roberts—Justices Neil Gorsuch, Brett Kavanaugh, Amy Coney Barrett, Elena Kagan, Sonia Sotomayor, and Ketanji BrownJacksonare entangled in elitist networks that dance to the tune of these large corporations, threatening the very soul of justiceJane Roberts’ Business Ties.Seethe photos following of the membership of these justices in the American Academy of Achievement – relationships totally undisclosed as conflicts of interest with the Academy membership. Jane Sullivan Roberts, the shadowy dealmaker profiting from the Supreme Court’s conflicts. **The Heist of the Century: Leader Technologies’ Stolen Social Networking Invention** In the heartland of Columbus, Ohio, visionary Michael McKibben and his company, Leader Technologies, poured $30 million and 175,000 man-hours into a groundbreaking social networking technology, patented in 2006 as U.S. Patent No. 7,139,761Leader Technologies. This platform, born from McKibben’s Christian music ministry past, promised to revolutionize digital collaboration. But this American dream was stolen by a cabal of greedy insiders led by James P. Chandler III, Leader’s trusted patent attorney and a George Washington University law professor who failed to disclose his tentacles in Britain and the intelligence community. Chandler, a Highlands Forum mastermind and architect of the Economic Espionage Act of 1996, betrayed Leader by funneling their technology to the NSA, IBM, and other corporate vultures. This wasn’t just theft—it was a calculated heist orchestrated through the Pentagon’s Highlands Forum, a shadowy network of tech moguls, government spooks, venture capitalists, and academics plotting to weaponize innovation for global control Highlands Forum. Chandler’s treachery handed Leader’s invention to Silicon Valley, with James W. Breyer, Facebook’s financier and chairman, playing a pivotal role through Accel Partners and the National Venture Capital Association (NVCA). Breyer, a self-styled venture capital titan, chaired the NVCA alongside CIA-asset Gilman Louie, ensuring the stolen technology was distributed via the IBM Eclipse Foundation, a front formed in 2001 to shower Silicon Valley, banks, and government agencies with McKibben’s invention. Companies like Facebook, Google, Apple, HP, Microsoft, and IBM—many tied to Jane Sullivan Roberts’ clients—reaped billions, while Leader was left in ruins. This brazen theft wasn’t just about profit—it was about building a surveillance, merchant-banking, and propaganda empire to enslave the world. Michael McKibben, robbed of his revolutionary invention by elitist moral barbarians. Fig. 1 diagram of social networking inU.S. Patent No. 7,139,761, Dynamic Association Of Electronically Stored Information With Iterative Workflow Changes. Inventors: McKibben et al. **Judicial Betrayal: TheLeader v. FacebookSham** Leader Technologies fought back, suing Facebook in 2008 for patent infringement inLeader Technologies, Inc. v. Facebook, Inc. in Delaware’s U.S. District Court Case Summary. They won the highly important Markman Hearing, but Facebook’s legal sorcery turned the tide. The jury admitted Facebook’s infringement but invalidated Leader’s patent under the “on-sale bar,” claiming the technology was sold too early—a flimsy excuse backed by zero evidenceLeader v. Facebook Verdict. Facebook’s eleventh-hour shift, acknowledging the technology’s novelty while claiming an early sale, was a desperate tactic. Leader was denied discovery under established Pfaff and Group One precedents, with Judge Leonard P. Stark undermining due process. Stark’s misuse of these standards was anomalous—allegations of an “on sale bar” require concrete evidence, not speculation or hearsay, showing the invention was disclosed to a third party without an NDA. Leader’s secrecy was notoriously known to everyone—they protected their secrets meticulously. The Federal Circuit appeal was a sham: Judges Alan D. Lourie, Kimberly A. Moore, and Evan J. Wallach, holding stock in Facebook insiders, concealed their conflicts. Clerk Jan Horbaly, unlicensed in D.C., covertly managed motions to obscure the judges’ ties to Facebook’s counsel (Cooley Godward, Gibson Dunn, and others). Critical evidence, including 28 of Mark Zuckerberg’s 2003–2004 hard drives, was suppressed, hiding proof of theft. The Supreme Court’s refusal to hear the case cemented Leader’s defeat, prompting McKibben to denounce a “constitutional crisis” that defrauded his investors and the nation. The courts, corrupted by greed, crushed Leader’s fight for justice. **The Highlands Forum and Pentagon’s Dark Agenda** This wasn’t a lone act of greed—it was a master plan hatched in the Pentagon’s Highlands Forum, founded in 1994 by Navy Captain Dick O’Neill. This clandestine network, backed by the Office of Net Assessment under Andrew Marshall, a Senior Executive Service (SES) stalwart, united tech giants (Intel, Google, HP, Microsoft, IBM) with NSA and DoD operatives to weaponize Leader’s technology for mass surveillance and propaganda. Chandler, a Forum linchpin (undisclosed to McKibben), collaborated with Marshall to integrate Leader’s platform into NSA’s global spying programs, linked to Britain’s “Five Eyes” networkOffice of Net Assessment. Investigative journalist Tim Shorrock exposed the Forum’s role in birthing surveillance monstrosities, turning McKibben’s dream into a nightmare. “David Ronfeldtcreated many of the early thematic arcs for Highlands since 1994” Euphemism for how to steal and weaponized more technologies to rape, pillage, murder, and destroy in the name of “national security.” Enough! We’re done with this demonic activity. The Highlands Forum, plotting to turn American innovation into a spy machine!Highlands Group Highlights. **The USPTO’s Dirty Game: Rigging the Patent System** The United States Patent and Trademark Office (USPTO) played a complicit role. It undermined Leader’s patent through procedural maneuvers embedded in the administrative patent courts, which could invalidate any claim, no matter how strong, when necessary. The “on-sale bar” ruling was a farce, crafted to strip Leader of its rights and transfer the technology to corporate and government allies. Leader’s 2017 Miller Act Notice, updated in 2019, seeks compensation for the government’s seizure and unauthorized use of their invention, claiming a Fifth Amendment violation for enabling surveillance, propaganda, and profit. Submitted to President Trump through Ohio Rep. Jim Jordan—a representative of some of Leader’s shareholders, it charges the USPTO with betraying American innovators to favor self-appointed global elites. The USPTO, a pawn in the elitist’s game to crush American inventors; has processed many millions of U.S. patent applications subcontracted to British Crown Company SERCO Group. **The British Pilgrims Society: A Century-Old Plot to Annex America** The conspiracy stretches across the Atlantic, masterminded by the British Pilgrims Society, founded in 1902 to bind America to British rule Pilgrims Society. American journalist Lillian Scott Troy’s 1912 exposé revealed their 24-point strategy to subvert U.S. institutions, with steps 2 and 3 targeting the Supreme Court to install judges favorable to British interests24-Point Strategy. This chilling plan, republished in 1940 by Congressman Jacob Thorkelson in the Congressional Record, exposes a blueprint to control the judiciary and undermine American sovereignty. The American Academy of Achievement, a glittering front for Pilgrims’ influence, lures Supreme Court Justices into its leftist orbit, favoring radicals over conservativesAcademy of Achievement. Justices like Sonia Sotomayor (2012), Brett Kavanaugh (2019), Amy Coney Barrett (2022), and Ketanji Brown Jackson (2022) have mingled with British elites like Lord Jacob Rothschild, who is on the Academy Council and presented awards at the 2017 London Summit. This transatlantic networking aligns with the Pilgrims’ goal of cultivating American elites for British dominance, as seen in historical acts like FDR’s 1942 Patents At Work Pilgrims scheme (FDR was a prominent Pilgrim), which handed 50,000 Axis patents to U.S. corporations tied to Pilgrims networksUK-USA Agreement(founded on March 5, 1946 and totally secret until 2010). The Pilgrims Society, pulling the strings to reclaim America for the British Empire (2003). **James W. Breyer: The Puppet Master of Tech Theft** James W. Breyer, Facebook’s initial venture capitalist alongside Peter Thiel and CIA-linked Gilman Louie, masterminded the theft of Leader Technologies’ social networking innovation through his roles at Accel Partners and the National Venture Capital Association (NVCA). As NVCA leader, Breyer, with Louie, channeled Leader’s technology to the IBM Eclipse Foundation, established on November 29, 2001, to distribute it to Silicon Valley giants like Facebook, Google, Yahoo!, Apple, and IBM—many were Jane Sullivan Roberts’ clients. A director of the American Academy of Achievement, Breyer networked with Justices like Anthony Kennedy, who awarded him the Academy’s 2014 Golden Plate Award. The Academy is a glittering collection of American leftists across the board. Pilgrims Society members are its leaders: Breyer, Henry Kissinger, Lord Rothschild, Roberts, Breyer’s connections to Chinese elites via his late wife, Angela Chao (sister of Elaine Chao, married to Senator Mitch McConnell), deepen the intrigue. Angela’s 2024 death in a Tesla crash on their Texas ranch sparks suspicion, mirroring the mysterious 2015 death of Facebook COO Sheryl Sandberg’s husband, Dave Goldberg, in a Mexican hotel gym—not even the hotel where he and Sandberg were staying. These ties place Breyer within a global power web, with the American Academy of Achievement acting as a recruiting ground for leftist elites like Pete Buttigieg and Cesar Conde. Justice Anthony Kennedy, James W. Breyer, Accel Partners, Facebook, Accel-China Breyer: “Super Bullish on China.”Forbes, Nov. 3, 2011 James W. Breyer, the mastermind behind the theft of America’s social networking future. U.S. Supreme Court Justice Anthony Kennedy presentsGolden Plate Award 2014to technology investor James Breyer. **Elitist Networks: The American Academy of Achievement’s Leftist Haven** The American Academy of Achievement, founded in 1961, masquerades as a beacon of inspiration but serves as a leftist stronghold, grooming Supreme Court Justices and global elitists for the Pilgrims Society’s agendaAmerican Academy of Achievement. Its International Achievement Summits are a who’s-who of liberal luminaries—Bill Clinton, Barack Obama, Hillary Clinton, Lord Rothschild, and Anthony Fauci—while conservatives are conspicuously absent. The 2007 Summit saw Obama, then a senator, preaching “social justice,” alongside CIA Director Michael Hayden and Defense Secretary Robert GatesAcademy of Achievement 2007. The Academy’s table of Supreme Court Justices’ involvement reveals their deep entanglement with this elitist network, interlocking with the American and British Inns of Court and the Pilgrims Society’s plot to control the judiciary. Below is the evidence of these unholy alliances: This table, rooted in Lillian Scott Troy’s 1908 discovery of the Pilgrims Society’s plan to dominate the Supreme Court, exposes how Justices are drawn into a web of Anglo-American elitism, with the Academy and Inns of Court serving as grooming grounds for British influence24-Point Strategy, The San Francisco Leader. Justice Anthony Kennedy Justice Ketanji Brown Jackson Justice Amy Coney Barrett Awards Council members Justice Anthony Kennedy and Justice Amy Coney Barrett present the Golden Plate Award to Justice Ketanji Brown Jackson at the 2022 Banquet of the Golden Plate awards ceremonies in Washington, D.C. American Academy of Achievement. Supreme Court Justices, seduced by the American Academy’s leftist elite. Justice Neil Gorsuch Justice Anthony M. Kennedy Justices of the Supreme Court of the United States: Anthony M. Kennedy presents the Academy of Achievement’s Golden Plate Award to Neil Gorsuch during the 2017 International Achievement Summit at Claridge’s in London. Justice Anthony Kennedy Justice Ruth Ginsburg Justice Sonia Sotomayor Academy members Justices Anthony Kennedy and Ruth Ginsburg present the Gold Medal of the Academy of Achievement to Justice Sonia Sotomayor at the 2012International Achievement Summit in Washington, D.C. Lord Jacob Rothschild, member and patron of the British Pilgrims Society Dr. Jennifer A. Doudna, CRISPR Gene Editor Awards Council member Lord Jacob Rothschild,leading member of the British Pilgrims Society, his great-uncle Lord Walter Rothschild (Balfour Declaration on Israel) was a founder of the Pilgrims.Giving a Golden Plate Award 2017 to Dr. Jennifer A. Doudna, co-developer of the CRISPR gene editing technology, in a ceremony at Claridge’s in London. 2017 International Achievement Summit. Larry Fink, BlackRock, Vanguard, controlling interest in most Fortune 1000 companies, including Microsoft, Apple, Oracle, AT&T, Facebook, Boeing, JPMorgan, etc. David Rubenstein, The Carlyle Group, founder of Crown Company,British QinetiQ, along with currentVirginia Governor Glenn Youngkin SeeGlenn Youngkin’s leadership inThe Carlyle Groupand his founding directorship in theCrown company QinetiQ Group Plc. Awards Council member David Rubenstein, the Co-founder of The Carlyle Group, funder and co-founder of British QinetiQ, presents the Golden Plate Award to Laurence D. Fink, the CEO of BlackRock, Inc., during the International Achievement Summit 2017 in Washington, D.C. Larry Fink and BlackRock own a controlling stake in most of the large companies in the world along with Vanguard, State Street, and Goldman Sachs (also a Academy Executive Committee member). General David H. Petraeus Lord Jacob Rothschild,Rothschild & Sons Catherine B. Reynolds Ehud Barack, former prime minister of Israel Catherine B. Reynolds with Academy members Lord Jacob Rothschild, General David H. Petraeus, USA, and Ehud Barak (Israeli Prime Minister) in the White Drawing Room at Waddesdon Manor. Lord Jacob Rothschild, a distinguished philanthropist and arts patron, hosted Academy members and spouses to an intimate luncheon in the White Drawing Room, one of Waddesdon’s dining rooms, which houses a collection of 18th-century French furniture and British portraits. After the luncheon, Lord Rothschild gave a private tour of the wine cellars with historic wines dating back to 1868. Anthony Fauci,HIV purveyor, COVID Pandemic Jimmy Page, Led Zeppelin September 9, 2022: Academy members Dr. Anthony Fauci and guitarist and Led Zeppelin founder Jimmy Page at a Catherine B. Reynolds Foundation dinner in the Members Room in the Library of Congress in Washington, D.C. On August 2, 2007, effluent discharge atMerial Animal Health’s site at the Pirbright Institute (UK)caused a foot-and-mouth disease outbreak. Subsequently, Merial Animal Health relocated from the Pirbright Institute (UK) toNanjing, China,on October 12, 2009, and was renamedMerial Animal Health Co. (China). Nanjing is a two-hour train ride fromWuhan, Chinaa distance short enough to transport engineered COVID pathogens undetected. Led Zepplin (Jimmy Page) fromMonsters of the Mist: Message to Fauci: “Tearing flesh where the weak ones fall. No quarter, no mercy shown” Sir Henry Kissinger, Vice President, Pilgrims Society on the U.S. Andres Pastrane Arango, President of Columbia Dr. Henry Kissinger, former United States Secretary of State and National Security Advisor, with fellow honoree Andrés Pastrana Arango, the President of Columbia, during the 2002 International Achievement Summit in Dublin. Kissinger was a vice president of the Pilgrims Society (2002-2023) (see below);Golden Plate Awards 2002. Rule, Brittania! Annex America! This IRS Tax Form from the Pilgrims Society clearly proves its leadership of the Academy. **A Republic in Peril: The Fight for Justice** This scandal isn’t just about stolen patents or judicial conflicts—it’s a full-scale assault on American sovereignty! The Supreme Court, meant to uphold the Constitution, is a puppet of global elitists, with Jane Sullivan Roberts’ millions and the Pilgrims Society’s machinations pulling the strings. Leader Technologies’ technology, now a tool of surveillance and propaganda, fuels a dystopian nightmare, enriching Facebook, Google, Apple, Yahoo!, and IBM—clients of Jane’s Big Law empire. **Require Miller Act Compliance and Supreme Court Full Disclosures and Ethics Rules** The American people must rise! Demand a mandatory Supreme Court ethics code, full disclosure of financial ties evaluated by non-attorneys, and forced recusals for conflicts. Congress must probe the USPTO, Highlands Forum, and Office of Net Assessment, while Leader’s Miller Act Notice offers a path to justice, funding a free press to combat propaganda Miller Act Notice. This is a battle for the soul of America—will we let British elitists and their judicial pawns steal our future? America’s sovereignty hangs by a thread—fight for justice now! **The Truth Will Set Us Free** From Jane Sullivan Roberts’ corrupt commissions to James W. Breyer’s tech theft, from the Highlands Forum’s surveillance schemes to the Pilgrims Society’s century-old plot to annex America, this exposé unveils a conspiracy to crush American innovation and enslave the nation. The Supreme Court, once a guardian of liberty, is a den of elitist betrayal. Leader Technologies’ fight is our fight—a clarion call to reclaim justice, protect inventors, and defy the globalists who would sell America to the highest bidder. The evidence is undeniable, the stakes are apocalyptic—America must act now! Postscript:Selected Academy photos we edited from this essay for length: How many of your daily activities does the U.S. Constitution specifically protect? Patents and Copyrights are covered, yet the Supreme Court prioritizes its secret paymasters over American citizens. The genius of Leader Technologies invention of social network can be seen here on Fig. 9 ofU.S. Patent No. 7,139,761, Dynamic Association Of Electronically Stored Information With Iterative Workflow Changes, i.e., what came to be called “social media” and “social networking.” The hundreds of investors in this groundbreaking work have never received a dime in reward. **Citations** Jane Roberts’ Commissions: Made $10.3 Million(paywalled atForbes, Business Insider, New York Times) Dutra Group v. Batterton: Supreme Court Case Seth P. Waxman: WilmerHale Attorney Profile Code of Conduct for United States Judges Chief Justice Roberts’ Wife Ethics Concerns Supreme Court Spouse Ethics: Not a Big Deal Jane Roberts Ethics Red Flags Jane Roberts’ Business Ties: Supreme Court Ethics Leader Technologies: Official Website Michael McKibben Background: Leader Technologies Highlands Forum: Wikispooks Overview Highlands Forum Participants: Official List James P. Chandler III Exposed: AIM Truth Bits Office of Net Assessment: Wikipedia Overview Whistleblower Exposes Warlords: Patriots for Truth Highlands Forum Surveillance: Wall of Controversy Leader v. Facebook: Casetext Case Summary Leader v. Facebook Verdict: Reuters Report Leader v. Facebook Judicial Misconduct: Americans for Innovation DC Bar Misconduct: Americans for Innovation Leader v. Facebook Certiorari: Americans for Innovation Leader Press Releases: Official Statements Pilgrims Society: Wikipedia Overview 24-Point Strategy: Pilgrims Society Plan Academy of Achievement 2017: London Summit UK-USA Agreement: Intelligence Sharing Miller Act Notice: 2017 Filing Miller Act Update: AIM Report Free Press Fund: Americans for Innovation [Miller Act Notice: 2019 Amended Filing](https://www.fbcoverup.com **Call to Action** Please send this brief note to your Senators and Members of Congress: Dear Senator/Congressman/Congresswoman NAME: It is a clear and present danger that social media had been taken over by people who are undermining our fundamental rights as Americans. They have also stolen enormous assets from us, especially the true inventors of social media. These violations must be corrected. I urge you to support the enforcement of the Miller Act to compensate Michael McKibben and his team for their invention of social networking. America’s leaders must continue to support patent rights, which are the foundation of property rights guaranteed by the U.S. Constitution, and protect Americans from social media abuses. To find your senators and Congress members’ contact information, go to: https://www.senate.gov/senators/senators-contact.htm https://www.house.gov/representatives/find-your-representative **5Comments** 1Connie Sponheimon May 1, 2025 at 2:54 pmHow do the people end the reign of these criminals? Shall i just draft emails to my Congress members? I’m frustrated beyond words that these traitors are UNtouchable? How do the people end the reign of these criminals? Shall i just draft emails to my Congress members? I’m frustrated beyond words that these traitors are UNtouchable? How do the people end the reign of these criminals? Shall i just draft emails to my Congress members? I’m frustrated beyond words that these traitors are UNtouchable? 2Mick the Mineron May 1, 2025 at 4:52 pmPlant Seeds: Use this link and the PDF to send it out to decision influencers broadly. Educating the public is needed to create a groundswell. It takes time. I is our jobs to plant these seeds of truth. As Jesus said, some seed will fall on rocky soil, some in the weeds, and some on good soil. Many times you cannot tell ahead of time whether a seed will germinate or not, but that is God’s job, not ours. Then, pray for a fruitful harvest! Plant Seeds: Use this link and the PDF to send it out to decision influencers broadly. Educating the public is needed to create a groundswell. It takes time. I is our jobs to plant these seeds of truth. As Jesus said, some seed will fall on rocky soil, some in the weeds, and some on good soil. Many times you cannot tell ahead of time whether a seed will germinate or not, but that is God’s job, not ours. Then, pray for a fruitful harvest! Plant Seeds: Use this link and the PDF to send it out to decision influencers broadly. Educating the public is needed to create a groundswell. It takes time. I is our jobs to plant these seeds of truth. As Jesus said, some seed will fall on rocky soil, some in the weeds, and some on good soil. Many times you cannot tell ahead of time whether a seed will germinate or not, but that is God’s job, not ours. Then, pray for a fruitful harvest! 3Sylvia L Hillon May 1, 2025 at 5:27 pmAbsolutely despicable!! I am so glad they have been exposed and I’m hoping they have been/ will be disposed! They are nothing less than greedy thieves (many of which are depraved) and traitors in my opinion. Readers, please share this far and wide as I am doing! We, Americans, need to continue to wake up and activate!! Absolutely despicable!! I am so glad they have been exposed and I’m hoping they have been/ will be disposed! They are nothing less than greedy thieves (many of which are depraved) and traitors in my opinion. Readers, please share this far and wide as I am doing! We, Americans, need to continue to wake up and activate!! Absolutely despicable!! I am so glad they have been exposed and I’m hoping they have been/ will be disposed! They are nothing less than greedy thieves (many of which are depraved) and traitors in my opinion. Readers, please share this far and wide as I am doing! We, Americans, need to continue to wake up and activate!! 4TF Baileyon May 2, 2025 at 12:34 amThe many true Americans suffer under the corrupt few with any response censored by the greatest evil, a bought-out media.The One will judge. As He suffered, so must we His disciples. The wheat will overcome the tares.We are not to condone evil but to expose it to all we encounter. Ephesians 5:11 The many true Americans suffer under the corrupt few with any response censored by the greatest evil, a bought-out media.The One will judge. As He suffered, so must we His disciples. The wheat will overcome the tares.We are not to condone evil but to expose it to all we encounter. Ephesians 5:11 The many true Americans suffer under the corrupt few with any response censored by the greatest evil, a bought-out media.The One will judge. As He suffered, so must we His disciples. The wheat will overcome the tares.We are not to condone evil but to expose it to all we encounter. Ephesians 5:11 5Moderatoron May 2, 2025 at 10:14 amComment from the previous post: This dialog about the Miller Act Notice, in respone to a Facebook attorney pseudonym “John Miller,” is instructional and funny. “Miller” is arguing for the government!!! Sound similar to the current deportation bans? Same scumbag attorneys? Surely. They are trolling for their demonic masters. “John Miller” has been stalking Leader Technologies and Michael McKibben for over a decade. The reader-academic smacks him down, obviously before having her morning coffee. LOL.Here is “John Miller’s” comment and then the AIM reader-academic’s response:“JOHN MILLER:” This is not how the Miller act works. It only applies to physical construction projects and you have to bring a claim within a year of the claim arising. That was roughly 20 years ago so it’s massively time barred. You also have to file a suit in federal court in order to enforce a Miller act claim, so sending anything to the president is completely pointless and incorrect.RESPONSE BY AIM READER:Oh, you absolute dumpster fire of an attorney-criminal, you slimy, law-warping degenerate who gets a sick thrill from mangling justice for your own pathetic ego trip. You’re a bloviating narcissist who’d rather listen to your own voice than a choir of angels. Shame. You wouldn’t know it if it slapped your smug face. The Miller Act Notice exists to throw a bone to citizens whose property your thieving government overlords snatched without so much as a thank-you note. It’s like a lien, you brain-dead hack, except you can’t slap one on the federal crooks who pilfered Leader Technologies’ property. Intellectual property in the Constitution is holier than your precious little construction scams, you clueless troglodyte. You revel in our misery, don’t you, you sadistic moron, cackling as we chase justice in your cesspool of a courtroom circus. Bet you’ve heard of adverse domination—yeah, that thing that pauses the clock on your shady statutes of limitation. We’re done with you, you vile, probably demon-possessed legal vultures and your equally rotten judge cronies. Crawl back to whatever swamp you oozed out of. GET BEHIND ME SATAN. Comment from the previous post: This dialog about the Miller Act Notice, in respone to a Facebook attorney pseudonym “John Miller,” is instructional and funny. “Miller” is arguing for the government!!! Sound similar to the current deportation bans? Same scumbag attorneys? Surely. They are trolling for their demonic masters. “John Miller” has been stalking Leader Technologies and Michael McKibben for over a decade. The reader-academic smacks him down, obviously before having her morning coffee. LOL. Here is “John Miller’s” comment and then the AIM reader-academic’s response: “JOHN MILLER:” This is not how the Miller act works. It only applies to physical construction projects and you have to bring a claim within a year of the claim arising. That was roughly 20 years ago so it’s massively time barred. You also have to file a suit in federal court in order to enforce a Miller act claim, so sending anything to the president is completely pointless and incorrect. RESPONSE BY AIM READER: Oh, you absolute dumpster fire of an attorney-criminal, you slimy, law-warping degenerate who gets a sick thrill from mangling justice for your own pathetic ego trip. You’re a bloviating narcissist who’d rather listen to your own voice than a choir of angels. Shame. You wouldn’t know it if it slapped your smug face. The Miller Act Notice exists to throw a bone to citizens whose property your thieving government overlords snatched without so much as a thank-you note. It’s like a lien, you brain-dead hack, except you can’t slap one on the federal crooks who pilfered Leader Technologies’ property. Intellectual property in the Constitution is holier than your precious little construction scams, you clueless troglodyte. You revel in our misery, don’t you, you sadistic moron, cackling as we chase justice in your cesspool of a courtroom circus. Bet you’ve heard of adverse domination—yeah, that thing that pauses the clock on your shady statutes of limitation. We’re done with you, you vile, probably demon-possessed legal vultures and your equally rotten judge cronies. Crawl back to whatever swamp you oozed out of. GET BEHIND ME SATAN. Comment from the previous post: This dialog about the Miller Act Notice, in respone to a Facebook attorney pseudonym “John Miller,” is instructional and funny. “Miller” is arguing for the government!!! Sound similar to the current deportation bans? Same scumbag attorneys? Surely. They are trolling for their demonic masters. “John Miller” has been stalking Leader Technologies and Michael McKibben for over a decade. The reader-academic smacks him down, obviously before having her morning coffee. LOL. Here is “John Miller’s” comment and then the AIM reader-academic’s response: “JOHN MILLER:” This is not how the Miller act works. It only applies to physical construction projects and you have to bring a claim within a year of the claim arising. That was roughly 20 years ago so it’s massively time barred. You also have to file a suit in federal court in order to enforce a Miller act claim, so sending anything to the president is completely pointless and incorrect. RESPONSE BY AIM READER: Oh, you absolute dumpster fire of an attorney-criminal, you slimy, law-warping degenerate who gets a sick thrill from mangling justice for your own pathetic ego trip. You’re a bloviating narcissist who’d rather listen to your own voice than a choir of angels. Shame. You wouldn’t know it if it slapped your smug face. The Miller Act Notice exists to throw a bone to citizens whose property your thieving government overlords snatched without so much as a thank-you note. It’s like a lien, you brain-dead hack, except you can’t slap one on the federal crooks who pilfered Leader Technologies’ property. Intellectual property in the Constitution is holier than your precious little construction scams, you clueless troglodyte. You revel in our misery, don’t you, you sadistic moron, cackling as we chase justice in your cesspool of a courtroom circus. Bet you’ve heard of adverse domination—yeah, that thing that pauses the clock on your shady statutes of limitation. We’re done with you, you vile, probably demon-possessed legal vultures and your equally rotten judge cronies. Crawl back to whatever swamp you oozed out of. GET BEHIND ME SATAN. ·Comments are closed. Enter your email address to follow this blog and receive notifications of new posts by email. Note that Gmail, Yahoo, and AOL will block most emails to you. OPINION & FAIR USE: This blog may contain opinion. As with all opinion, it should not be relied upon without independent verification. Think for yourself. No claims are made to the properties of third parties. Reproductions are for educational purposes only. Fair Use is relied upon. Email Address Follow Begin typing your search above and press return to search. Press Esc to cancel. **** **** ****"}