{"id": 1554, "name": "WBIR-Knoxville News", "domain": "wbir.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wbir.com/article/news/crime/10investigates-da-asks-tbi-to-gather-info-as-he-probes-death-of-74-year-old-monroe-county-man-held-in-jail-restraint-chair-while-hooded/51-b917958c-ce39-47a6-a074-a313dff548a9", "title": "10investigates Da Asks Tbi To Gather Info As He Probes Death Of 74 Year Old Monroe County Man Held In Jail Restraint Chair While Hooded", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalNear MeEntertainmentHealthMoneyNation WorldPoliticsInvestigationsShowsFeatures10 Rising HeartsLatest News StoriesMother offers gratitude to crews, community after her missing son's body was found in Douglas LakeCocke Co. leaders look to improve EMA response after Helene Back Local Near Me Entertainment Health Money Nation World Politics Investigations Shows Features 10 Rising Hearts Mother offers gratitude to crews, community after her missing son's body was found in Douglas Lake Cocke Co. leaders look to improve EMA response after Helene Back Local Near Me Entertainment Health Money Nation World Politics Investigations Shows Features 10 Rising Hearts Mother offers gratitude to crews, community after her missing son's body was found in Douglas Lake Cocke Co. leaders look to improve EMA response after Helene WeatherBackForecastRadar10-DayHourlyMapsClosings/DelaysTrafficLatest Weather StoriesNC's Chimney Rock State Park to reopen with limited routes, reservations requiredMore sunshine with highs in the middle 80s Back Forecast Radar 10-Day Hourly Maps Closings/Delays Traffic NC's Chimney Rock State Park to reopen with limited routes, reservations required More sunshine with highs in the middle 80s Back Forecast Radar 10-Day Hourly Maps Closings/Delays Traffic NC's Chimney Rock State Park to reopen with limited routes, reservations required More sunshine with highs in the middle 80s SportsBackHigh School SportsVolsBig Orange LockerClad in Big OrangeKnoxville MarathonLocked On Podcast NetworkLatest StoriesTennessee lands star pitcher, former ETSU ace Brady Frederick from the portalESPN reveals game times for Tennessee's 2025 football season Back High School Sports Vols Big Orange Locker Clad in Big Orange Knoxville Marathon Locked On Podcast Network Tennessee lands star pitcher, former ETSU ace Brady Frederick from the portal ESPN reveals game times for Tennessee's 2025 football season Back High School Sports Vols Big Orange Locker Clad in Big Orange Knoxville Marathon Locked On Podcast Network Tennessee lands star pitcher, former ETSU ace Brady Frederick from the portal ESPN reveals game times for Tennessee's 2025 football season SearchSearch:Search Advertise With Us Contact Us TV Listings 10About Town 10News Today Tennessee Vols Educator of the Week Mini Meteorologist Inside Tennessee Service & Sacrifice 10 Listens Hometown Spotlight Appalachian Unsolved **10Investigates: DA asks TBI to gather info as he probes death of 74-year-old Monroe County man held in jail restraint chair while hooded** **** To stream WBIR on your phone, you need the WBIR app. **** **Download the WBIR app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video MADISONVILLE, Tenn. — Monroe County's top prosecutor said Wednesday he's taking a closer look into the death of a 74-year-old man who was restrained and hooded by jail personnel for more than nine hours in the Monroe County Justice Center. 10th Judicial District Attorney General Stephen Hatchett told 10News he's asked the Tennessee Bureau of Investigation to gather information about a 2024 DUI arrest of Elijah Lester Isbill by the Monroe County Sheriff's Office becauseit could be relevant to his February 2025 death. That information would include any bodycam, paperwork or other pertinent video when law enforcement personnel engaged with Isbill. Hatchett said he learned about the 2024 incident Tuesday night. \"We're looking at everything we can look at,\" the DA said. WBIR is investigating what happened to the ailing Isbill in February and why Monroe County authorities elected to keep him in the restraint chair with a hood on for hours on Feb. 6, 2025, until he stopped moving and breathing. As WBIR reported Tuesday, family attorney Tyler Weiss is pursuing a potential civil lawsuit about the way Isbill was treated that afternoon and night. Hatchett said his office will pursue any and every angle to fully understand Isbill's contact with Monroe County Sheriff's personnel. He asked the TBI on Wednesday to help him gather facts and report back what they find. On May 19, 2024, which was Isbill's 74th birthday, he pulled over to the side of Fairview Road because he felt ill, his family told WBIR. He ended up being arrested and charged with DUI by a deputy. The warrant by Cpl. Ashley Chambers states Isbill failed a couple standard tests for sobriety. He couldn't maintain balance and coordination, Chambers wrote, indicating intoxication. Isbill was taken to the Justice Center for booking. It's unclear how long he was held. Weiss said it's his understanding from the family that Isbill was stripped while held in custody. Two months later, however, the state couldn't present enough evidence to keep the case going, records show. On July 23, 2024, a judge dismissed the DUI and assessed costs to the state of Tennessee with this notation: \"Facts insufficient to (establish) probable cause.\" Isbill's daughter Windy Duncan told WBIR her father didn't drink but did have heart and balance problems and was showing initial signs of dementia. Hatchett said he needs to know more about what happened with the DUI case and what Isbill's encounters were with Monroe County personnel in the field and in the Justice Center. Windy Duncan told WBIR that after the 2024 incident her father was afraid of the Justice Center and of Monroe County deputies. He didn't want to go back there, she said. Duncan said her father had pulled over to the side of the road in May 2024 because he'd recently had a pacemaker installed and wasn't feeling right. He used a cane because he couldn't walk with full confidence on his own, she said. HOURS IN THE CHAIR In the early afternoon of Feb. 6, 2025, a Thursday, Isbill went to a Madisonville financial office to pay a bill. He became ill. An employee called 911 out of concern. EMS and a Madisonville police officer responded. Over the course of an hour at the scene, Weiss said, Isbill became increasingly agitated and disoriented. Responders found that the former pastor's blood pressure was high and his blood-oxygen levels were low, Weiss said. He said he didn't want to get medical help. The officer decided to charge him with disorderly conduct, and he was taken to the Justice Center. That proved to be a fatal move for Isbill, Weiss said. After deputies put him in a cell, security video shows, he tottered around the small room, raising his hands up and down as if beseeching someone. Without his cane, he pitched forward, struck his head on concrete and then ended up lying face up on the floor, jail video shows. Sheriff's personnel then came in and put him in a restraint chair, securing his feet, hands and neck, Weiss said. They ended up putting a spit hood over his head after he spit at one of them, jail records state. Once the hood was applied, video shows one of the male Sheriff's personnel appearing to flip off the security camera. Through the afternoon and late into the evening, Isbill remained in the chair alone in the cell, rolling his head, shouting and speaking incoherently. He'd stopped moving by 11:15 p.m. and when Sheriff's Office personnel stepped in to check on him, they found he had no pulse. Weiss said he was dead. Responders were able to reestablish a pulse, records state. Isbill was pronounced dead hours later after being transported to Blount Memorial Hospital in Maryville. Before this week, the TBI had already looked into Isbill's death, which is standard for in-custody deaths. But an agency spokeswoman told WBIR on Tuesday that the agency had closed the case. Such records are not public so it's unknown what they determined. The TBI spokeswoman referred WBIR to Isbill's autopsy, which determined he had heart problems and that his death was \"natural\". Hatchett said he's pursuing answers to numerous questions including why Isbill wasn't taken to the hospital rather than to jail. The district attorney said he also wants to understand why Isbill wasn't transported to the hospital after he fell and hit his head in the justice center cell. He wants to know if any of the same sheriff's personnel who interacted with Isbill in 2024 also interacted with him in February of this year. The prosecutor termed the case \"complicated\" and said he's made no predetermination about what might have happened. \"This case has got so much stuff, every time you turn around there's something else coming out,\" he noted. When contacted Tuesday by WBIR, a Monroe County Sheriff's Office spokesman said Sheriff Tommy Jones would be releasing a statement. \"The Monroe County sheriff will release a statement structured on facts that shows the public the incident from the beginning to the end. Sheriff Jones wants transparency and believes the best way to do so is for the public to have the availability to all video footage of the interactions with Mr. Isbill and law enforcement.\" **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}