{"id": 780, "name": "Krytyka Polityczna", "domain": "krytykapolityczna.pl", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://krytykapolityczna.pl/kultura/czytaj-dalej/kinga-dunin-czyta/kon-na-wojnie-czyli-mroczna-meska-tajemnica-o-nullu-szczepana-twardocha/", "title": "Kon Na Wojnie Czyli Mroczna Meska Tajemnica O Nullu Szczepana Twardocha", "content": "**Koń na wojnie, czyli Mroczna Męska Tajemnica [o „Nullu” Szczepana Twardocha]** Przypomnijmy, o co naprawdę chodzi w „Iliadzie”, z której Twardoch zaczerpnął motto, bo przecież nie o Helenę, która gdzieś się snuje po Troi, ani o brankę, którą odebrał Achillesowi Agamemnon. Jej kluczowym motywem jest miłość Achillesa do Patroklosa. Szczepan Twardoch,Null, Marginesy 2024 – Nam pizda – mówi Szczur. Patrzy w niebo przez szczeliny w zamaskowanym śmieciami i darnią wejściu do waszej jamy. Jama znajduje się na Chersońszczyźnie, po tej drugiej, niewłaściwej stronie Dniepru, na terenach prawie zajętych przez Rosjan, na pozycjach utrzymywanych właściwie nie wiadomo po co. Zaczyna się to tak, jakby to była jakaś klasyczna powieść pacyfistyczna o bezsensie wojny, ale czasy naiwnego pacyfizmu się skończyły. Wojna to zabijanie, okrucieństwo, błoto, nuda, „wasza jest krew, a ich jest nafta”, i nie polega tylko na działaniach szlachetnych, odważnych i honorowych, czasem mogą to być też zbrodnie wojenne – wszystko to wiemy, ale cóż z tego? Pewno jeszcze lepiej od nas wiedzą o tym ci, którzy walczą, ale i tak chcą walczyć dalej. Inni przede wszystkim pragną tę wojną przetrwać: nie są ochotnikami, niektórzy dezerterują, emigrują, udaje im się uniknąć poboru. I wszyscy wiedzą, że dziś nie ma scenariusza, który zapewniałby Ukrainie osiągnięcie jej celu i odzyskanie utraconych terytoriów. PowieśćTwardocha, choć ze zrozumieniem mówi o wszystkich, sercem jest, jak się domyślacie, po stronie tych pierwszych, gotowych walczyć do końca, którym zapewne będzie śmierć. Jednak bez „mobików”, tych z poboru, często prostych, czasem nienadających się do walki, „mięsnych” z piechoty nie dałoby się prowadzić tej wojny, Koń to wie. A w końcu i oni niespodziewanie mogą okazać się bohaterami. Naga prawda [o „Nieocalonym”, biografii Tadeusza Borowskiego] **Naga prawda [o „Nieocalonym”, biografii Tadeusza Borowskiego]** Koń (poznajemy go tylko z przezwiska), główny bohater tej powieści, umarł już przedtem, tyle że symbolicznie. Jak wszyscy bohaterowie Twardocha nosi w sobie Mroczną Męską Tajemnicę. Coś wydarzyło się w jego dawnym życiu takiego, że myśli, że śmierć jest mu obojętna. (Oczywiście okaże się, że nie jest i jak każdy chce jednak przeżyć). Nie wiadomo, co zrobił – synowi, rodzinie? – i musi za to odpokutować. A co wiadomo? Jego dziadek był Ukraińcem, jako młokos wstąpił do SS-Galizien, a potem był w UPA (ale nie był na Wołyniu). Przesiedlony w ramach akcji „Wisła” naZiemie Zachodniedostał spore gospodarstwo, ożenił się z Niemką. Jego syn, ojciec Konia, czuł się Polakiem i Europejczykiem, odciął się od korzeni, a Koń trochę do nich wraca. Tym razem nie ma w powieści problemów ze śląską tożsamością, ale schemat jest ten sam, więc możemy go przećwiczyć na polskości/ukraińskości. Koń skończył historię, potem pracował na różnych uniwersytetach i w korporacjach i jak na absolwenta historii radził sobie nieźle. Wypasione mieszkanie, barek pełen najdroższych alkoholi, samochody, oszczędności i jeszcze miał glocka schowanego w sejfie. Po co, nie wiadomo. Po rozpoczęciu pełnoskalowej wojny zaczął jeździć do Ukrainy z pomocą i tam zaobserwował, że wschód kraju był zsowietyzowany, a zachód mniej. Że duże miasta są europejskie, a wieś zacofana. Armia, w zasadzie ludowa, walczy, bo ma pomoc z Zachodu oraz opiera się na zrzutkach, darach i prywatnych zakupach. Czyli stworzył bohatera, który z jednej strony jest wykształconym humanistą (będzie mógł przywoływać różne książki i mieć ogólne refleksje), a z drugiej umie strzelać (nadaje się na wojnę). Oraz upakował tu listę podstawowych tematów „w temacie Ukrainy”. Niezbyt subtelnie. Jeździł, jeździł, aż zdecydował się zostać i wstąpić do legionu cudzoziemskiego – sami dziwacy, awanturnicy i nieudacznicy. On taki nie był, więc trochę nielegalnie znalazł się w oddziałach ukraińskich i został operatorem dronów, bardzo ważnych w tej wojnie – zabijał z daleka i oglądał to sobie na monitorze laptopa. Littell: Płynna pamięć [rozmowa] **Littell: Płynna pamięć [rozmowa]** Nie obędzie się też bez wątku miłosnego – Koń zakochuje się w pięknej Ukraince, ale nie w takiej zwykłej, bo te zwykłe są trochę zacofane i za bardzo zrobione. Jego ukochana zna wiele języków, mieszkała w Berlinie i też nosi w sobie jakiś mrok i tajemnicę. Na pewno nie zgadniecie – była zgwałcona w Donbasie. I jest mądra, ale inaczej niż on. Takie są kobiety – lepsze od mężczyzn i mądre inaczej. Ale to też wiemy z poprzednich książek. Mimo to decyzja, żeby była to fikcja literacka, a nie eseje będące plonem całkiem realnych i godnych podziwu wyjazdów autora z pomocą dla Ukrainy, ostatecznie wydaje mi się słuszna. I przyniosła też dobre rezultaty. Fikcja daje jednak inny, emocjonalny dostęp do prawdy, o ile to, co czytamy, uznamy za wiarygodne. A wNulluobraz wojny złożony z mniejszych obrazów, portretów ludzi, którzy są w nią uwikłani, w dużej części do mnie przemawiał. Może ktoś, kto lepiej zna sytuację, miałby jakieś zastrzeżenia, ale wiarygodność to nie to samo co prawdziwość. I te części naprawdę robią wrażenie, pozwalają przenieść się do tego innego świata. Bo świat wojny jest inny niż ten polskiego inteligenta, i to na wielu poziomach. Najpierw – bo można zginać i trzeba zabijać. Koń, który przedtem zabijał granatami zrzuconymi z dronów, trafia do piechoty i musi zabijać bardziej z bliska. A to jest różnica. (Dlaczego tam trafił, to już mniej oczywisty fabularnie koncept i dość przerażający). To wojna w Ukrainie, więc jakoś trzeba oddać jej język. Autor sięga w dialogach, ale nie tylko, po coś w rodzaju ukraińsko-polskiego surżyka. Także ze wstawkami pisanymi cyrylicą, co mnie nie przeszkadza, a poza tym przeważnie jest tłumaczone. Mnie się to podoba. Ale ta zmiana języka, a więc zmiana świata, nie dotyczy tylko ukraińskiego. To język brutalny, pełen wulgaryzmów. Muszą pojawić się w nim oczywiście terminy związane z uzbrojeniem i innym sprzętem wojskowym. Jak wiadomo, Twardocha takie zabawki naprawdę fascynują, więc jest tego bardzo dużo, ale jakoś tym razem mniej mi to przeszkadzało. Koń musi też pozbyć się dawnej wrażliwości i innych inteligenckich nawyków, uwewnętrznionej politycznej poprawności. Przyzwyczaić się do seksizmu i homofobii. Faszystowskie czy banderowskie naszywki na mundurach? To tylko symbole, za którymi nie muszą kryć się poglądy albo jakieś pamiątki. Jedynie jacyś antyfaszyści z Polski mogą się tym przejmować, w Ukrainie walczą wspólnie wszyscy (na przykład jest batalion queerów, ale tych Koń nie spotkał). Nas też to przecież nie dziwi, bo czy nie tak manifestuje się męskość w męskim stadzie, nie tylko na wojnie? (Kobiety w zasadzie na wojnę się nie nadają, ale niektóre to lubią, bo seks na wojnie jest najlepszy). Wojny zawsze były i będą, to, przynajmniej zdaniem Konia, część ludzkiej kondycji i niektórzy – chyba jednak mężczyźni – mają wojnę we krwi. On ma i fantazjuje, że to spadek po odległym przodku, scytyjskim wojowniku, który pił krew, gwałcił i mordował (bardzo to romantyczne!). Gdzie mieszka Król w Żółci? **Gdzie mieszka Król w Żółci?** Najbardziej archetypiczną wojną, ojcem wszystkich wojen, jest ta trojańska. Podobno chodziło w niej o jakąś kobietę. Twardoch motto powieści zaczerpnął zIliadyHomera: o tym, że Achilles miał wybór między spokojnym życiem a wojenną sławą. Wiadomo, co wybrał. Bo walczy się też dla sławy, tworzy ona nieformalną hierarchę w ukraińskiej armii. Koń oczywiście będzie się przyjaźnił z tymi sławnymi. Epizod wojny opisany wIliadziezaczyna się jednak od gniewu – „Gniew (gr.mēnin) Achilla, bogini, głos obfity w szkody…”. Gniew w wypadku wojny w Ukrainie jest oczywistą emocją i motywem działania, jednak Twardoch, Koń, w swoich rozważaniach sięga po inny homerycki termin o szerszym spektrum znaczeniowym. Słowo „θυμός” (thymós) pochodzi z języka starogreckiego i poza gniewem mieści w sobie też odwagę, ogólnie siłę psychiczną, pasję, potęgę wewnętrznego ducha. To ona pcha mężczyznę do działania, także na innych polach, i do walki. Nigdy tak dobrze jak wówczas nie pojąłem, jak mozolna jest śmierć człowieka **Nigdy tak dobrze jak wówczas nie pojąłem, jak mozolna jest śmierć człowieka** Ale może przypomnijmy, o co naprawdę chodzi wIliadzie, bo przecież nie o Helenę, która gdzieś się snuje po Troi, ani o brankę, którą odebrał Achillesowi Agamemnon, wywołując jego „gniew obfity w szkody”. Jej kluczowym motywem jest miłość Achillesa do Patroklosa. Żałoba, rozdzierająca rozpacz i płacz po jego śmierci, hekatomby, bezczeszczenie ciała Hektora, zabójcy ukochanego – po żadnej kobiecie Achilles by tak nie rozpaczał. Spali ze sobą czy nie, tego zIliadysię nie dowiemy, ale miłość to miłość, choć ta oczywiście splotła się z gniewem. Koń też kocha niektórych swoich towarzyszy broni, choć nie opisuje tego w taki homerycki sposób. Może więc niektórzy mężczyźni idą na wojnę (ci, którzy mają ją we krwi) także po to, żeby móc kochać z pasją innych mężczyzn? I o tym najmniej się mówi, albo wręcz ukrywa, wypiera się. Czyż nie dlatego o rosyjskich żołnierzach zawsze mówi się „pidary”, pedały? Pewno nie pomyślałabym o tym, gdyby sam autor nie podrzucił mi tego tropu. Okrutnie się w tejIliadziezabijają, ale i okrutnie kochają, a wszystko dlatego, że jakaś banda na górze (Olimp) toczy ze sobą różne spory i gry o wpływy. __Przeczytany do końca tekst jest bezcenny. Ale nie powstaje za darmo. Niezależność Krytyki Politycznej jest możliwa tylko dzięki stałej hojności osób takich jak Ty. Potrzebujemy Twojej energii. Wesprzyj nas teraz. **Złota Kopuła – kiedy złoty sedes już nie wystarczy** **Pomerantsev: Zachód musi prowadzić własną wojnę hybrydową z Rosją** **Eurowizja – ta przyjemność naprawdę zrobiła się „guilty”** **Markiewka: Na końcu przychodzi faszyzm, czyli wzniosła retoryka apokalipsy** **Warto być Polką [o „Pani od polskiego”]** **Kogo naprawdę chroni ban na OnlyFans w Szwecji?** **Vibe, rolnictwo i antropologia drugiej dekady [o książkach Latronico i Erdrich]** **Dlaczego tak trudno oderwać się od seriali Nathana Fieldera?** **Przypadek jedynej gminy, gdzie wygrał Mentzen, czyli bezpieczeństwo znowu nie dowiozło** Dziennik Kraj Świat Kultura Gospodarka Podcasty Tematy Klimat Lewica Feminizm Uchodźcy Unia Europejska Piszą dla nas Kaja Puto Michał Sutowski Agnieszka Wiśniewska Sławomir Sierakowski Jakub Majmurek Krytyka Polityczna O nas Wydawnictwo KP Warszawa / Jasna 10 Świetlica w Cieszynie Instytut Kontakt Pisz do nas! Pracuj z nami Polityka prywatności Regulamin serwisu Deklaracja dostępności Regulaminy wewnętrzne About us © 2022 Krytyka Polityczna. Wszystkie prawa zastrzeżone | Partner technologiczny:Meverywhere.pl Szukaj Kraj Świat Kultura Podcasty Wojna w Ukrainie Księgarnia Jasna 10 Newsletter O nasKontaktO Krytyce PolitycznejJesteśmy stowarzyszeniemAbout usŚwietlica w CieszynieJasna 10 Świetlica w WarszawieInstytutDeklaracja dostępnościPolityka ochrony dzieci Kontakt O Krytyce Politycznej Jesteśmy stowarzyszeniem About us Świetlica w Cieszynie Jasna 10 Świetlica w Warszawie Instytut Deklaracja dostępności Polityka ochrony dzieci Kontakt O Krytyce Politycznej Jesteśmy stowarzyszeniem About us Świetlica w Cieszynie Jasna 10 Świetlica w Warszawie Instytut Deklaracja dostępności Polityka ochrony dzieci Kraj Świat Kultura Gospodarka Lewica Unia Europejska Wojna w Ukrainie Klimat Feminizm O nas Jesteśmy stowarzyszeniem Wydawnictwo Kontakt About us Świetlica w Cieszynie Jasna 10, Warszawa Instytut Pracuj z nami"}