{"id": 1990, "name": "Heritage Foundation", "domain": "heritage.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.heritage.org/budget-and-spending/report/americas-retirees-comfort-or-crisis-current-retirees-are-doing-better", "title": "Americas Retirees Comfort Or Crisis Current Retirees Are Doing Better", "content": "Frequently Searched Critical Race Theory Life Index of Economic Freedom China The Kevin Roberts Show Budget and Spending **Secondary Navigation** About Heritage Events Renew Press Contact Top Issues China Election Integrity Border Security Life Big Tech **Secondary Navigation** About Heritage Events Renew Press Contact Political Thought American History Conservatism Progressivism Domestic Policy Big Tech Education Government Regulation Health Care Reform Welfare National Security Border Security Cybersecurity Defense Government Spending Budget and Spending Debt Taxes International China Europe Global Politics Middle East Energy and Climate Climate Energy Environment Legal and Judicial Courts Crime and Justice Election Integrity Gun Rights The Constitution Culture Gender Life Marriage and Family Parental Rights Religious Liberty Economy International Economies Markets and Finance Trade **America’s Retirees: Comfort or Crisis? Current Retirees Are Doing Better Than Ever, but Threats Loom for Younger Generations** **America’s Retirees: Comfort or Crisis? Current Retirees Are Doing Better Than Ever, but Threats Loom for Younger Generations** Summary **Key Takeaways** Today’s retirees are doing better financially than any generation before them, including the lowest-income retirees having the highest income replacement rates. Social Security’s near-term insolvency, underfunded union and public pensions, and the unsustainable federal budget threaten everyone from Gen X to Gen Beta. Whereas government- and union-run retirements have failed to provide lasting security, policymakers should prioritize fiscal sanity and personal incomes and savings. Select a Section1/0 More than ever before, the degree to which Americans enjoy either financial comfort or crisis in retirement may depend on the generation into which they were born. Despite headlines suggesting a baby-boomer retirement crisis is already underway, older Americans are doing better—as a whole and within all income groups—than any generation before them. These gains are largely the result of greater access to personal retirement savings accounts and improved work capacity, as well as government policies that have increasingly transferred incomes from younger to older Americans. While current retirees are doing incredibly well by historical standards, very large and impending shortfalls in Social Security and many defined benefit pension plans threaten the financial security of current and future retirees. These retirement shortfalls will likely come to a head around the same time that the federal government’s borrowing capacity breaks down, threatening younger generations with the highest tax burden in U.S. history. Policymakers can help improve Americans’ retirement security and overall financial well-being by restoring government spending to sustainable levels, making it easier for all Americans to save and build wealth, eliminating Social Security’s penalty on work, and reforming Social Security and defined benefit pension plans. **Older Americans’ Income Has Been Rising** Despite some overblown claims to the contrary,REFolder Americans’ financial well-being has been improving. Over the past three decades, older Americans’ incomes have been steadily rising. According to the Federal Reserve’s triannual Survey of Consumer Finances, the real (inflation-adjusted 2022 dollars) median household income of Americans ages 65–74 increased by 67.6 percent over the past three decades, from $36,100 in 1992 to $60,500 in 2022. The real median household income of Americans ages 75 and older increased by 77.9 percent, from $27,600 in 1992 to $49,100 in 2022. While the incomes of Americans across all age groups have grown, older Americans have experienced the largest income gains. This means that people who are retired today have significantly higher incomes than prior generations experienced in retirement. **Access to Retirement Savings** The first step to savings for retirement is having a retirement account in which to save. The growth in defined contribution retirement accounts—such as individual retirement accounts (IRAs) and employer-sponsored 401(k)s—as well as the technology to access those accounts on mobile devices—have helped increase access to retirement savings across all income and age groups. The biggest factor affecting individuals’ probability of having retirement savings is their age. This is because both income and saving opportunities tend to rise with age. According to Federal Reserve survey data, 43 percent of individuals ages 18–29 report having no retirement savings compared to 28 percent among 30–44-year-olds, 19 percent among 45–59-year-olds, and only 12 percent among individuals ages 60 and older.REF Across all non-retired individuals in 2022, more than half—54 percent—reported having a defined contribution retirement account, 47 percent reported having retirement savings outside formal retirement accounts, 20 percent reported having a defined benefit pension, and 28 percent reported having no retirement savings.REFEach of these statistics represents an improvement from 2013 (the first year of the survey), in which 44 percent of respondents reported having a defined contribution retirement account, 23 percent reported having retirement savings in a non-retirement account, 18 percent reported having a defined benefit pension, and 31 percent reported having no retirement savings.REF A 2017 study by Brady and Bass using tax data indicated that nearly 90 percent of workers entering into retirement had retirement savings.REFThe study found that among individuals newly claiming Social Security benefits, 81 percent (through either themselves or their spouses) had income from employer-sponsored retirement plans, annuities, or IRAs, and another 8 percent indicated retirement account or IRA ownership.REF **All Income Groups Are Maintaining Their Standards of Living in Retirement** The main financial goal for retirement is to maintain a standard of living similar to that enjoyed during one’s working years. However, spending during retirement tends to naturally drop. This can be due to a number of factors, such as spending less on work-related expenses such as clothes and commutes, eating out less, and potentially having paid off a mortgage. Thus, financial advisors commonly recommend a target replacement rate of 70 percent to 80 percent of pre-retirement income for retirement years. Some suggest that most Americans either already cannot or will not be able to maintain such standards of living in retirement. For example, economist Teresa Ghilarducci said in a 2024 hearing before the U.S. Senate that “50 percent [of Americans] will not be able to meet their retirement standards and most of them won’t be able to meet poverty standard.”REFSuch claims are based on flawed and misleading metrics. Gold-standard administrative data, on the other hand, show that older Americans across all income levels are meeting or exceeding recommended income replacement rates in retirement. Moreover, some groups—specifically lower-income earners—are experiencing increased standards of living in retirement. In their analysis “When I’m 64 (or Thereabouts): Changes in Income from Middle Age to Old Age,” Peter J. Brady and Steven Bass used administrative tax data to follow more than 100,000 individuals from the 1945 birth-year cohort between the ages of 55 and 72, corresponding to the years 2000–2017.REFThe study examined the amounts and sources of income beginning well before study participants could collect early Social Security benefits (age 62) until after they were eligible for the maximum Social Security benefit (age 70) and also generally had to begin taking distributions from personal retirement accounts. The study found that the average individual maintained more than 90 percent of age 55–59 spendable income through age 72. The study’s measure of “spendable income” equals inflation-adjusted income after federal taxes and retirement contributions. Income maintenance was not uniform across households and instead displayed a progressive distribution, with lower-income households maintaining higher percentages of their incomes at older ages. As shown in Chart 4, the after-tax, inflation-adjusted spendable incomes of the lowest earners actually increased in retirement, equaling 129 percent of pre-retirement income at age 72.REFMiddle-income groups maintained more than the recommended replacement rate, with the median individual maintaining 93 percent of pre-retirement income at age 72. High-income groups experienced a sizable decline in spendable income during retirement, with the highest earners replacing 77 percent of their incomes, which is still a highly sufficient replacement rate considering higher earners’ lifetime spending and savings patterns. Not only are Americans maintaining adequate replacement rates in retirement, but older Americans today are better off than generations before them. According to the Bureau of Labor Statistics’ Consumer Expenditure Survey, the real pre-tax household income of workers ages 65 and older—including Social Security, private, and government retirement savings—has increased 38 percent after inflation since 1988.REFThis survey-based measure of household income likely understates actual income gains due to surveys’ undercounting of non–Social Security income. The total amount of retirement savings is also historically high. As of the second quarter of 2024, U.S. households held $45.5 trillion in retirement assets.REFEven after adjusting for inflation and the increase in population, this is more than a 400 percent increase since 1982 (when that dataset begins). **Poverty and Overall Well-Being** Minimizing poverty is a goal for all age groups, but it is especially important in old age, when it becomes harder for people to work to earn a living. That is why it is troubling to hear claims of an alleged 23 percent poverty rate among elderly Americans, as Ghilarducci claimed, or that the United States ranks lower than Kazakhstan in its pension system and elderly poverty, as she also alleged.REF When talking about poverty, definitions matter. The World Bank definesextreme povertyas living on less than $2.15 per person per day and sets a more standard poverty metric as living on less than $6.85 per person per day.REFAt this metric, which equals $2,500 per year per person, the World Bank estimates that 44 percent of the global population lives in poverty.REF Ghilarducci’s claims are based on an irrelevant metric of “relative poverty,” which Ghilarducci explains in a footnote is “defined as having an income below half the national median equivalized household disposable income.”REFIn other words, this metric ignores absolute quantity or quality of resources such as food and shelter and instead focuses only on individuals’ resources relative to others. By that metric, the entire nation of Kazakhstan could be living at near-starvation levels, but so long as everyone is relatively equally impoverished, then Ghilarducci’s statement that “Kazakhstan does better than us” on elderly poverty would hold true.REF The U.S. government’s official poverty metric considers households’ cash income in comparison to a threshold that, at least based on an outdated measure, is necessary to maintain a basic standard of living.REFCurrently, a single individual living on less than $15,650 per year or a couple living on less than $21,150 are considered to be in poverty in the United States.REF Although this poverty measurement overstates true poverty rates in the United States—because it does not include non-cash welfare benefits—older Americans (ages 65 and up) today are experiencing lower poverty rates than in the past, as well as lower poverty rates than the rest of the population. This was not always the case. Prior to the early 1990s, older Americans experienced higher rates of poverty than did working-age Americans (ages 18–64), but since 1993, older Americans have experienced poverty rates equal to or lower than the poverty rates experienced by working-age Americans in every year except one. Moreover, the poverty rate among older Americans has averaged half of the poverty rate among children since 1993. The poverty rate among older Americans was 9.7 percent in 2023, which compares to 10.0 percent among working-age adults and 15.3 percent among children.REFCurrent poverty rates among older Americans—in terms of both historical comparisons and relative to the rest of the population—do not indicate a retirement crisis. Of course, differences in costs of living across the United States can significantly impact individuals’ financial well-being, and the poverty metric is deeply flawed in that it does not take into account non-cash welfare benefits such as food stamps, health care, and housing subsidies.REFWhile these benefits aim to reduce poverty, they are doomed to fail in their measured impact because they are excluded from poverty rate calculations. Thus, other metrics are also helpful in revealing Americans’ financial well-being. The Federal Reserve’s triannual Survey of Household Economics and Decisionmaking, for example, asks respondents, “How well are you managing financially?” Older Americans report significant improvement in their financial well-being over the past 10 years. The percentage of respondents ages 65 and older who say they are “finding it hard to get by” or “just getting by” fell by half from 34.7 percent in 2013 to 17.6 percent in 2022.REFMeanwhile, the percentage of respondents saying they are “doing okay” or “living comfortably” increased by 18 percentage points from 64.5 percent in 2013 to 82.5 percent in 2022.REF Financial well-being improves across every single age group, with the oldest Americans reporting the greatest financial well-being and the least financial insecurity. Considering that addressing shortfalls in retirement income almost certainly requires imposing increased burdens on younger generations through higher savings, higher taxes, or increased debt, forced redistribution of money from generations with lower financial well-being to those with higher financial well-being is harmful and unfair. **Expanded Work Capacity and Work Options at Older Ages** Part of the explanation for older Americans’ improved well-being comes from an increase in their labor force participation. Over the past 40 years, the labor force participation rate of individuals ages 55–64 increased by 12.8 percentage points, from 53.8 percent in February 1985 to 66.6 percent in February 2025. Over the same period, the labor force participation rate of individual ages 65 and older increased by 8.3 percentage points, from 10.6 percent to 18.9 percent. While women’s increased labor force participation explains part of this rise—and older women’s labor force participation did rise by more than older men’s over the past four decades—both have nonetheless increased significantly. Since 1985, the labor force participation rate rose by 19.7 percentage points among women ages 55–64 (from 41.7 percent to 61.4 percent) and by 8.8 percentage points among women ages 65 and older (from 7.2 percent to 16.0 percent). Meanwhile, the labor force participation rate rose by 4.6 percentage points among men ages 55–64 (from 67.5 percent to 72.1 percent) and by 7.0 percentage points among men ages 65 and older (from 15.4 to 22.4 percent). Older Americans’ increased labor force participation is largely a result of improved health—including medical advancements—and less physically demanding jobs.REFAn economic analysis that compared health and mortality data for Americans ages 55–69 in 1977 and 2010 estimated that older Americans in 2010 could have been working an additional 2.7–4.2 years if they were to work at the same rates as their similarly situated counterparts from 1977.REFSince then, older Americans have increased their labor force participation, though not by as much as the study’s estimates.REF More recently, many older workers have been able to gradually transition from work to retirement, often giving up their traditional 9–5 jobs while performing contract, independent, or freelance work that gives them significant flexibility over how much and from where they work. According to the Freelance Forward 2023 report, “26% of Boomer professionals, and 38% of Silent Generation professionals” performed freelance work in 2023.REF Not only does older Americans’ work provide additional income, but economic studies show that continued engagement in work—including part-time—can have positive impacts on mental and physical health, including delaying cognitive decline, increasing social interactions, and maintaining a sense of purpose.REFFor example, a 2006 study found, “Retiring at a later age may lessen or postpone poor health outcomes for older adults, raise well-being, and reduce the utilization of health care services, particularly acute care.”REFThe benefits of continued work at older ages indicate that government policy should not penalize older Americans who want and are able to continue working. **Some Types of Retirement Savings Are More Secure Than Others** While American’s retirement incomes are faring well, there is a crisis among government-run and union-run defined benefit pensions. Social Security can provide only 75 percent of its scheduled benefits, multiemployer pensions set aside enough to pay only 40 percent of promised benefits, and state and local government pensions are only about 35 percent to 40 percent funded. This means that workers and retirees who disproportionately rely on those underfunded retirement savings face less secure financial futures than do those who also have personally owned retirement savings. Single-employer pensions must abide by strict funding rules, and owners of those companies have the incentive to adequately fund their pension plans because they will suffer the consequences if their pensions—and therefore their companies—fail. Consequently, single-employer pensions are generally well-funded and provide a secure vehicle for retirement income. Multiemployer or union pensions and government pensions face lax or no funding rules and perverse economic interests. Union leaders and politicians can benefit from delivering higher pension benefits without requiring higher contributions to fund those benefits, and they suffer no personal consequences for making broken promises. Instead, the liabilities fall on taxpayers, workers, and retirees. Social Security Is Slated for 21 Percent Cuts in 2033.Despite Social Security’s original purpose of protecting against poverty in old age and providing a secure retirement, Social Security is not secure. Excessive benefit increases coupled with rising life expectancies contributed to the program amassing $22.6 trillion in unfunded obligations, which equals $172,000 for every household in America.REFThe problem is fully structural, as what was primarily meant to be a pre-funded national retirement system was instead used to continually increase Social Security benefits even as Americans continued to live longer and collect benefits for longer. Moreover, the federal government’s use of Social Security’s trust fund to finance annual budget deficits masked the true cost of growing government spending. Since 2011, Social Security has been paying out more in benefits to retirees than it collects in payroll taxes from workers, and by 2033, Social Security’s trust fund will be exhausted and all retiree benefits will be cut by 21 percent across the board.REFOn average, that will mean a $5,000 annual cut for a typical retiree, and cuts will grow over time, eventually reaching about $7,500 (or 31 percent) per year over the next 75 years. In contrast, if workers were allowed to put their Social Security taxes into personal accounts that they owned and could pass on to their families, the average worker would have three times as much income in retirement as Social Security can provide, and even low-wage workers would have 40 percent more income.REF Preventing benefit cuts through tax increases alone would require Social Security’s current 12.4 percent tax rate to immediately rise to between 15.7 percent (the Social Security Actuaries’ estimateREF) and 16.7 percent (the Congressional Budget Office’s [CBO’s] estimateREF). For the median household with an income of about $81,000, that would amount to an additional $2,700 to $3,500 in taxes per year and between $12,700 and $13,500 in total annual Social Security taxes.REFSuch high taxes are counter to one of Social Security’s original goals—to protect younger generations from the financial burden of having to provide for older generations—and they would make it increasingly difficult for younger generations to buy homes, start businesses, raise families, and save for their own retirement.REF Private Union Pensions Set Aside Less Than Half of Promised Benefits.Multiemployer pensions are union-managed pension plans (with employer representation) that provide pensions to workers representing multiple employers within a particular industry. Because unions made the case that having multiple employers within one plan would provide its own level of insurance, multiemployer plans were granted lax rules and regulations compared to single-employer pension plans. These lax funding rules and reckless mismanagement of union pension funds have jeopardized the economic security of approximately 11 million unionized workers and retirees.REF As of 2020, the multiemployer pension system as a whole had an estimated $823 billion in unfunded liabilities and was on track to pay retirees only 41 cents for every dollar in promised pension benefits.REFThe failure of multiemployer pension plans is systemic, with 77 percent of all multiemployer pension participants in plans that were less than 50 percent funded in 2020 and 96 percent of all participants in plans that were less than 60 percent funded.REFA mere 0.5 percent—one out of every 200 workers—was in a plan with 90 percent or higher funding. While Congress passed a partisan and unprecedented taxpayer bailout of roughly 15 percent of insolvent union pension plans in 2021, the nearly 1,200 plans that did not receive bailouts remain in decline. Economist Joshua Rauh testified in 2018 that 83 percent of multiemployer pension plans were digging themselves deeper into debt each year, and that percentage has almost certainly grown over time and with the incentive of future bailouts.REF Nearly every multiemployer pension plan that did not receive a bailout is on track to become insolvent. Moreover, the CBO has said that even the plans receiving taxpayer bailouts are still likely to become insolvent shortly after their bailout funds run out in 2051.REF State and Local Pensions Have Promised Nearly $7 Trillion in Unfunded Liabilities.According to the American Legislative Exchange Council, state and local pension plans have promised an estimated $6.96 trillion in unfunded pension liabilities.REFThat is the equivalent of $21,000 per U.S. resident. Some states are in vastly worse shape than others, with Alaska having the highest unfunded pension liabilities at just over $46,000 per capita, while Tennessee is in the best shape with unfunded pension liabilities of about $7,700 per capita. Taxpayers will be on the hook for most of these unfunded liabilities, because state and local employees generally have a legal right to the pension benefits stipulated in their plans. In some states, such as Illinois, policymakers cannot even prospectively alter workers’ pension plans after they have been hired: For example, they cannot increase worker contribution rates in the future nor can they raise future retirement ages. The presumptive tax increases associated with unfunded pension liabilities have begun to affect people’s decisions on where to live. One study from 2021, for example, found that “one dollar of pension underfunding reduces house prices near state borders by approximately two dollars.”REF States that have shifted to defined contribution plans have significantly reduced their unfunded pension liabilities, simultaneously protecting taxpayers and providing workers and retirees with personal ownership, portability, and potentially higher rates of return.REF **Washington Is Running Out of Fiscal Space** The federal debt as a percentage of the economy is as high today as its peak in 1946 in the aftermath of World War II, and nearly every action taken by Congress in recent decades has exacerbated the unsustainable fiscal outlook.REFAmericans are spending more today on interest payments on the federal debt than on national defense. The federal government is running out of fiscal space, which is essentially a government’s credit limit, and absent a significant course correction, the nation faces an inevitable debt spiral. Paul Winfree, president and CEO of the Economic Policy Innovation Center, estimates that because the federal debt is now growing faster than the economy, a disastrous debt spiral will begin between 2032 and 2035, depending on Congress’s actions on taxes and spending.REFWith Social Security on track to run out of funds to pay full benefits in 2033 and some multiemployer and state and local pensions potentially running dry around the same time, the enormity of these simultaneous shortfalls make it unlikely that these underfunded retirement systems will be bailed out by federal taxpayers. If policymakers continue racking up the federal debt to prevent retirement benefit cuts, high and rising interest rates could make doing so extremely difficult, if not impossible. Raising taxes would also be extremely difficult, as it would require large and economically damaging tax hikes on all Americans. As mentioned above, preventing currently scheduled 21 percent across-the-board benefit cuts to Social Security starting in 2033 would require an extra $2,700 to $3,500 per year in Social Security taxes for a median household. Some suggest limiting tax increases to the rich to pay for it all, but this is mathematically impossible.REFBrian Riedl of the Manhattan Institute noted that “even 100% tax rates on million-dollar earners would not come close to balancing the budget, and seizing all $4.5 trillion of billionaire wealth—every home, car, business, and investment—would merely fund the federal government one time for nine months.”REF A fiscal reckoning is inevitable, and it can be addressed either preemptively and thoughtfully through significant fiscal reforms enacted by Congress or chaotically and destructively through a fiscal crisis resulting in forced austerity. Whatever course is taken, Congress can help minimize the pain associated with a fiscal reckoning by restoring federal spending to an appropriate level now.REF **History Supports Personally Owned Retirement Savings** Defined benefit pensions are based on the notion that employers and politicians are better equipped to control individual workers’ retirement plans than workers themselves are. But history shows that inherent conflicts of interest plague many defined benefit pensions. Meanwhile, it has arguably never been easier for individuals to own and control their own retirement plans. The incentive for individual savers to set aside what they will need in retirement is straightforward: If they do not save enough, it is their own financial future—and potentially their children’s—that is on the line. In contrast, officials and politicians responsible for managing union-run and public pension plans are usually long gone before the consequences of their actions are fully realized. Thus, they have an incentive to put their own shortsighted interests above the long-term interests of pension beneficiaries. They can gain votes or entrench union leadership and compensation by making unfunded pension promises, playing politics with pension investments, and leaving beneficiaries and taxpayers to deal with the consequences. Moreover, around the time employer pensions were created, technology was at a point that telephone lines had just been installed on the floor of the New York Stock Exchange.REFObtaining investment information was not simple, open-ended mutual funds barely existed, diversified indexing had not been invented, and investment transactions were difficult. The average saver therefore lacked the resources and information necessary to maximize and personalize his or her retirement savings, so it made some sense for employers to use their competitive advantage, through pooled resources, to set up pension plans for their employees. That is not the case today. Most workers have their own smartphones, complete with any number of financial and investment apps that provide a wealth of information and the ability to purchase stocks, bonds, mutual funds, and various other investments from almost anywhere in the world with the tap of a finger. This has transformed the ability of everyday Americans to manage their own retirement savings. Even setting aside the endemic conflicts of interest and political manipulation of most defined benefit retirement plans,REFemployers and governments rarely manage other people’s money more prudently than the people who earned it themselves do. Multitrillion-dollar shortfalls in defined benefit systems across the United States are evidence of this. **Policy Solutions to Improve Current and Future Retirement Well-Being** While older Americans today are faring well compared to past generations, many working Americans find it harder to save for retirement, and shortfalls in Social Security and defined benefit pensions could result in significantly lower-than-expected incomes for many in the coming generations of retirees. To help increase financial security in retirement and throughout Americans’ lifetimes, policymakers should: Enact Universal Savings Accounts.While saving for retirement is important, Americans need to save for all types of planned and unplanned events that occur throughout their lifetimes. Those events could include college, known or unexpected health care costs, buying a home, having a baby, and paying for childcare. They could also include unplanned events such as a major car repair, a broken hot water heater, or a death in the family. The current, disjointed savings accounts structure in the United States makes it harder for Americans to save. And the penalties applied on early withdrawals often prevent lower-income workers from saving out of fear that their money will be locked up or that they will have to pay penalties if they need to take their funds out early. Policymakers should enact universal savings accounts, which would allow workers to save in simple savings accounts that they could withdraw from without penalty for any expected or unexpected event throughout their lifetimes. A current bill introduced by Senator Ted Cruz (R–TX) and Representative Diana Harshbarger (R–TN), the Universal Savings Account Act of 2025, would allow an individual to save $10,000 per year (rising to $25,000 over 30 years) in a Roth-style USA account with tax-free growth and no penalties for withdrawals for any reason.REFUniversal savings accounts have been successful at increasing savings—particularly among lower-income earners—in Canada, South Africa, and the U.K.REF Enable Portable Retirement Savings Accounts.Absent a universal savings account, the easiest and most economical way to save for retirement is through an employer-sponsored 401(k)-style account. As more Americans change jobs and pursue independent work, policymakers should allow universal access to “association-style” retirement savings plans, which would allow workers to save in the same retirement accounts throughout their lifetimes and employment situations. This would be particularly helpful to independent workers, who often face lower limits on retirement contributions through IRAs. Large private investment companies could offer these accounts, which would have the same tax treatment and contribution limits as employer-provided 401(k) accounts with similarly low fees and wide investment options. Reform Unfunded Government and Union Pension Plans.Social Security, multiemployer or private union pensions, and state and local pensions face massive unfunded liabilities that threaten the financial security of workers and retirees in those plans, as well as taxpayers who may be forced to bail them out. Federal lawmakers must confront Social Security’s insolvency before the program’s trust fund is exhausted in 2033. Considering the current fiscal trajectory of the federal government, a potential fiscal crisis may preclude additional borrowing or tax increases to prevent benefit cuts. Similarly for multiemployer pensions, the fiscal trajectory reduces the probability of a subsequent bailout for the remaining unfunded union pension plans. In a 2018 report, this author proposed 12 multiemployer pension reforms to protect pensioners and taxpayers, including prohibiting unions and employers from promising more in pension benefits than they set aside to pay, protecting taxpayers from future bailouts, and minimizing pension losses—particularly for the most vulnerable.REFLastly, state and local governments should address the insolvency of their own pension plans, ideally including by shifting to defined contribution retirement accounts. Eliminate Social Security’s Retirement Earnings Test.This test functions like an additional 50 percent tax on certain earnings of workers between the ages of 62 and 66.REFBecause it results in marginal tax rates as high as 84 percent, the test suppresses the work and earnings of older Americans. While that was the intent of the original, Depression-era earnings test—to push older people out of the labor force to free up jobs for younger workers—the modern economy would benefit from the continued labor force participation of older Americans. This author estimates that removing Social Security’s retirement earnings test could increase the U.S. labor force by up to 1 million workers. The additional full-time and part-time work of older Americans would increase older Americans’ incomes, modestly reduce elderly poverty, potentially improve physical and mental health, help to fill labor shortages, contribute to economic output, increase government revenues by up to $18 billion per year, and modestly improve the solvency of the Social Security and Medicare programs.REF **Conclusion** Older Americans today are doing better financially than any generation before them, and they are also faring better than younger generations behind them. Even as a small fraction of Americans struggle financially in old age, America does not face a baby-boomer retirement crisis. Participation in retirement savings and the amount of those savings have grown substantially, older Americans have significantly improved work capacity, and all income groups are maintaining adequate—if not generous—standards of living in retirement. However, the future may not be so bright for upcoming retirees of other generations, beginning with Generation X and younger. What were supposed to be some of the most surefire forms of retirement security—Social Security, union pensions, and state and local pensions—are on track to pay only a fraction of what they promised. Not only do these underfunded programs threaten Americans’ retirement security, but the United States’ unsustainable federal debt could result in large tax hikes that further limit ordinary Americans’ ability to pursue their goals, provide for their families, and save for the future. Policymakers should restore a responsible level of federal spending, including curbing explosive growth in federal entitlement spending. For Social Security, policymakers should focus on protecting those most in need and enacting commonsense reforms to improve Social Security for current workers and future generations. To minimize multiemployer pension losses and prevent additional taxpayer bailouts, policymakers should reform the multiemployer system and make it illegal for private pension plans—whether managed by a single employer or a union—to promise pension benefits while failing to set aside enough money to make good on those promises. And state and local lawmakers should confront their unfunded pension obligations. To help increase personal savings, policymakers should enact universal savings accounts so that any American can save in one simple and portable account that could be used for expected and unexpected events across all ages and stages of life. Lastly, to reduce disincentives to work at older ages and to improve personal and societal financial well-being, policymakers should eliminate Social Security’s retirement earnings test. Rachel Greszleris Senior Research Fellow for Workforce and Public Finance in the Thomas A. Roe Institute for Economic Policy Studies at The Heritage Foundation. **Authors** Senior Research Fellow, Roe Institute **Heritage Offers** By activating your membership you'll become part of a committed group of fellow patriots who stand for America's Founding principles. Receive a clause-by-clause analysis of the Constitution with input from more than 100 scholars and legal experts. Read biographical essays about our Founding Fathers like George Washington, Benjamin Franklin, and John Adams along with insightful analysis of primary sources. **Budget and Spending** **Budget and Spending** COMMENTARY4 min read COMMENTARY3 min read COMMENTARY4 min read **Secondary Navigation** About Heritage Events Renew Press Contact Subscribe to email updates Follow us © 2025, The Heritage Foundation We use cookies on our website. By using our website, you consent to cookies.Learn More."}