{"id": 706, "name": "The Jamestown Foundation", "domain": "jamestown.org", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://jamestown.org/program/some-russians-claim-fsb-failed-to-block-ukrainian-drone-attacks-due-to-focus-on-lgbt-repression/", "title": "Some Russians Claim Fsb Failed To Block Ukrainian Drone Attacks Due To Focus On Lgbt Repression", "content": "About UsBoard MembersContact UsEmploymentSenior FellowsStaffSubscribe to our mailing list Board Members Contact Us Employment Senior Fellows Staff Subscribe to our mailing list Board Members Contact Us Employment Senior Fellows Staff Subscribe to our mailing list PublicationsIssue BriefsChina BriefEurasia Daily MonitorTerrorism MonitorMilitant Leadership MonitorJamestown PerspectivesMost Popular Issue Briefs China Brief Eurasia Daily Monitor Terrorism Monitor Militant Leadership Monitor Jamestown Perspectives Most Popular Issue Briefs China Brief Eurasia Daily Monitor Terrorism Monitor Militant Leadership Monitor Jamestown Perspectives Most Popular Special ProjectsPromethean Liberation: Russia’s Emerging National and Regional MovementsBlack Sea Battleground: Risks and Challenges in Europe’s Threatened FrontierCCP Stealth War NewsletterCommentariesGuardians of the Belt and RoadNew Versus Old Cold War: Assessing the Current US-China ConfrontationRussia’s Path to the High-Tech BattlespaceRussia in DeclineRussia in the Middle EastThe Growing Importance of Belarus on NATO’s Eastern FlankWar by Other Means Promethean Liberation: Russia’s Emerging National and Regional Movements Black Sea Battleground: Risks and Challenges in Europe’s Threatened Frontier CCP Stealth War Newsletter Commentaries Guardians of the Belt and Road New Versus Old Cold War: Assessing the Current US-China Confrontation Russia’s Path to the High-Tech Battlespace Russia in Decline Russia in the Middle East The Growing Importance of Belarus on NATO’s Eastern Flank War by Other Means Promethean Liberation: Russia’s Emerging National and Regional Movements Black Sea Battleground: Risks and Challenges in Europe’s Threatened Frontier CCP Stealth War Newsletter Commentaries Guardians of the Belt and Road New Versus Old Cold War: Assessing the Current US-China Confrontation Russia’s Path to the High-Tech Battlespace Russia in Decline Russia in the Middle East The Growing Importance of Belarus on NATO’s Eastern Flank War by Other Means RegionsAfricaCentral AsiaChina and the Asia-PacificEuropeLatin AmericaMiddle EastSouth AsiaThe CaucasusRussiaTurkey Africa Central Asia China and the Asia-Pacific Europe Latin America Middle East South Asia The Caucasus Russia Turkey Africa Central Asia China and the Asia-Pacific Europe Latin America Middle East South Asia The Caucasus Russia Turkey Press/MultimediaEventsMedia AppearancePress ReleasesNewslettersMultimediaAnalystsCopyright Events Media Appearance Press Releases Newsletters Multimedia Analysts Copyright Events Media Appearance Press Releases Newsletters Multimedia Analysts Copyright Store Archives Donate About UsBoard MembersContact UsEmploymentSenior FellowsStaffSubscribe to our mailing list Board Members Contact Us Employment Senior Fellows Staff Subscribe to our mailing list Board Members Contact Us Employment Senior Fellows Staff Subscribe to our mailing list PublicationsIssue BriefsChina BriefEurasia Daily MonitorTerrorism MonitorMilitant Leadership MonitorJamestown PerspectivesMost Popular Issue Briefs China Brief Eurasia Daily Monitor Terrorism Monitor Militant Leadership Monitor Jamestown Perspectives Most Popular Issue Briefs China Brief Eurasia Daily Monitor Terrorism Monitor Militant Leadership Monitor Jamestown Perspectives Most Popular Special ProjectsPromethean Liberation: Russia’s Emerging National and Regional MovementsBlack Sea Battleground: Risks and Challenges in Europe’s Threatened FrontierCCP Stealth War NewsletterCommentariesGuardians of the Belt and RoadNew Versus Old Cold War: Assessing the Current US-China ConfrontationRussia’s Path to the High-Tech BattlespaceRussia in DeclineRussia in the Middle EastThe Growing Importance of Belarus on NATO’s Eastern FlankWar by Other Means Promethean Liberation: Russia’s Emerging National and Regional Movements Black Sea Battleground: Risks and Challenges in Europe’s Threatened Frontier CCP Stealth War Newsletter Commentaries Guardians of the Belt and Road New Versus Old Cold War: Assessing the Current US-China Confrontation Russia’s Path to the High-Tech Battlespace Russia in Decline Russia in the Middle East The Growing Importance of Belarus on NATO’s Eastern Flank War by Other Means Promethean Liberation: Russia’s Emerging National and Regional Movements Black Sea Battleground: Risks and Challenges in Europe’s Threatened Frontier CCP Stealth War Newsletter Commentaries Guardians of the Belt and Road New Versus Old Cold War: Assessing the Current US-China Confrontation Russia’s Path to the High-Tech Battlespace Russia in Decline Russia in the Middle East The Growing Importance of Belarus on NATO’s Eastern Flank War by Other Means RegionsAfricaCentral AsiaChina and the Asia-PacificEuropeLatin AmericaMiddle EastSouth AsiaThe CaucasusRussiaTurkey Africa Central Asia China and the Asia-Pacific Europe Latin America Middle East South Asia The Caucasus Russia Turkey Africa Central Asia China and the Asia-Pacific Europe Latin America Middle East South Asia The Caucasus Russia Turkey Press/MultimediaEventsMedia AppearancePress ReleasesNewslettersMultimediaAnalystsCopyright Events Media Appearance Press Releases Newsletters Multimedia Analysts Copyright Events Media Appearance Press Releases Newsletters Multimedia Analysts Copyright Store Archives Donate **Some Russians Claim FSB Failed to Block Ukrainian Drone Attacks Due to Focus on LGBT+ Repression** **Publication: Eurasia Daily Monitor Volume: 22 Issue:** **By:Paul Goble** June 10, 2025 03:12 PMAge: 1 day Executive Summary: Some Russians are claiming on social networks that the Russian Federal Security Service (FSB) failed to anticipate and block Ukraine’s Operation Spider’s Web attacks because it is preoccupied with suppressing LGBT+ groups and individuals instead of working to neutralize military threats. This criticism suggests that Russian President Vladimir Putin’s promotion of “traditional” Russian values is not resonating with some Russians or distracting from the impacts of his war against Ukraine, especially when it takes time and resources from security concerns. Attacks such as Operation Spider’s Web indicate that an increasing number of Russians want the war over as soon as possible and expect the Kremlin to devote all its efforts to achieving that end. The NeMoskva news website, which reports on developments in the Russian Federation outside of Moscow, reported that the Russian Federal Security Service (FSB) accused university teachers from four Russian regions of spreading “LGBT+ propaganda” while working with the Oxford Russia Fund, which the Kremlin designated as “undesirable” in 2021. Russians criticized the move online, with at least one asserting that the FSB failed to prevent Ukraine’s Operation Spider’s Web drone attack on Russian strategic airfields because its “officers were occupied instead with the struggle against LGBT+ people” (Govorit Nemoskva, June 5). In the view of some Russians, the FSB was busy rounding up 15 Russian university scholars while they should have been defending against drone attacks. The scholars are accused of “propagandizing support of sexual minorities and LGBT+ values,” an illegal act that the authorities claim threatens Russian national security (Govorit Nemoskva, June 5). Such criticism suggests that Russian President Vladimir Putin’s promotion of “traditional” Russian values is not as popular as many believe. Polls indicate that hostility toward LGBT+ people, while rising given Kremlin propaganda in recent years, is not nearly as widespread or deeply held as Russian government media suggest or many Westerners assume (Levada Center, November 18, 2024). Some Russians argue that Putin’s repression of LGBT+ people plays to his base, which is hostile to LGBT+ people and supportive of their repression, rather than to Russian society as a whole, which is not broadly hostile toward LGBT+ individuals (Window in Eurasia, April 24, 2020;Kasparov.ru, June 13, 2023;Telegram/@Anatoly_nesmiyan, October 1, 2024). Attacking the LGBT+ community is therefore not popular enough to serve as a widely effective distraction from the negative impacts of Putin’s full-scale invasion of Ukraine. Putin hopes to both establish the war as a new normal and impose his personal values on Russia as a whole, but the dual pursuit of these goals may cost Russian lives, as demonstrated by some Russians arguing that LGBT+ repression distracts from Russia’s domestic defense (AVA, May 18). Perhaps even more important, these comments also show that an increasing number of Russians want Putin’s war against Ukraine to end as soon as possible, and expect the Kremlin to devote all its efforts to achieving that end (EXO, March 22). The Russian desire for an end to the Kremlin’s war against Ukraine means that many Russians may accept outcomes including permanent Russian occupation of seized Ukrainian territory and further expansion into Ukraine. The history of Moscow’s approach to homosexuals reflects ongoing contradictions. In tsarist times, homosexuality was a crime punishable by exile, but this law, like many in Russia, was honored more in the breach than in reality. Following the Bolshevik revolution in 1917, the Soviet regime allowed gay people almost complete freedom. In 1933, however, Stalin began to attack LGBT+ people because he became convinced that the Soviet Union was threatened by a conspiracy of homosexuals. His attacks led to the expulsion of many LGBT+ people from government posts, and the arrest and dispatch to the Gulag of many more (Window on Eurasia, October 8, 2023). After Stalin’s death, laws against homosexuality remained on the books, but repression against them generally eased. When the Soviet Union disintegrated, the government dropped laws against homosexuality. LGBT+ people experienced more legal rights than ever before, despite continuing attacks from the Russian Orthodox Church and Russian nationalist groups. With the rise of Putin and his masculine, traditionalist image, the situation changed, but with a twist. The Kremlin did not make homosexual acts between consenting adults illegal again. Instead, Putin pushed through a series of ever more severe laws against “propagandizing” homosexuality and restricted Russians’ access to gender-affirming care (Vedomosti, October 15, 2020;Kasparov, June 13, 2023;The Insider, June 19, 2024). Support among Russians for the LGBT+ community remained high until 2022, with nearly half declaring support for homosexual rights in 2019 (The Moscow Times, May 23, 2019). With the launch of his expanded invasion of Ukraine, however, Putin radically increased attacks on “gay propaganda” and thus on the LGBT+ community, “weaponizing misogyny and homophobia” to garner support for his war against Ukraine (Riddle, November 2, 2022). Many LGBT+ Russians emigrated or said they felt they would soon need to leave (Ideal Realii, July 4, 2022;Window on Eurasia, July 24, 2022). The LGBT+ community felt increasingly unsafe in Russia because of Kremlin actions—including labeling a non-existent international homosexual alliance a terrorist organization and launching sweeping arrests of many LGBT+ activists—and because Kremlin rhetoric prompted its allies in the nationalist community to engage in open violence against LGBT+ people (Meduza, November 30, 2023;The Moscow Times, February 19). A survey of 6,400 LGBT+ people in Russia conducted in 2024 by the Sphere Foundation found that almost half—47.5 percent—faced violence or the threat of violence in 2024, vastly higher than in the pre-war years (Sphere Foundation, 2024). Some victims died or were permanently injured as a result of these attacks. Others polled said they had lost their jobs or otherwise suffered economically because of LGBT+ discrimination (Sphere Foundation, 2024). While these attacks have been severe, the Putin regime ignores that a narrow segment of the population perpetrated them.Many other Russians continue to have a positive attitude toward LGBT+ people and a negative attitude toward their repression (Riddle, August 21, 2020). Large swaths of Russians do not agree with Putin’s anti-LGBT+ approach, helping to explain why some Russians criticize anti-LGBT+ actions for distracting the FSB from protecting Russians from attack, its primary role (Levada Tsentr, November 18, 2024). NeMoskva does not specify how many Russians suggested that the FSB’s focus on LGBT+ repression prevented Moscow from preventing the Ukrainian attack on Russian air force bases (Govorit Nemoskva, June 5). It is impossible to say exactly how many Russians share that view, but they are almost certainly far more numerous than those who have been brave enough to actually post the position, as such actions risk retribution from the government. People who feel that LGBT+ issues are distracting the FSB from the war are found at both ends of the spectrum of opinion: those who want peace now, regardless of the cost, and those who want victory soon, again, regardless of the cost. Whatever the balance between these two groups may be, it is clear that Putin hopes to make war the new normal, and promote the “traditional” Russian attitude against LGBT+ people is failing, a trend that suggests his support among Russians will decline the longer his war against Ukraine continues. **Support Jamestown** **Publications** **Follow Jamestown** **Recent Special Projects** **Events** Russia’s full-scale invasion of Ukraine in February 2022 turned Moscow’s...MORE **Media Appearances** Jamestown Senior Fellow Janusz Bugajski has just edited and published Free Nations, New States: The End Stage of Russian Colonialism, an anthology of insights, experience, and prescriptions...MORE **Books and Reports** The May 2016 of Militant Leadership Monitor includes briefs on Khalifa al-Ghaweil and Ismail Muhammad al-Salabi – two influential actors in eastern Libya. The first profile is of Muslim al-Shishani, a Georgian-born militant fighting in Syria. The second profile is of Naeem Bokhari, the recently arrested military mastermind of...MORE About UsBoard MembersContact UsEmploymentSenior FellowsStaffDonate Board Members Contact Us Employment Senior Fellows Staff Donate Board Members Contact Us Employment Senior Fellows Staff Donate PublicationsIssue BriefsChina BriefEurasia Daily MonitorTerrorism MonitorMilitant Leadership MonitorJamestown Perspectives Issue Briefs China Brief Eurasia Daily Monitor Terrorism Monitor Militant Leadership Monitor Jamestown Perspectives Issue Briefs China Brief Eurasia Daily Monitor Terrorism Monitor Militant Leadership Monitor Jamestown Perspectives Special ProjectsPromethean Liberation: Russia’s Emerging National and Regional MovementsBlack Sea Battleground: Risks and Challenges in Europe’s Threatened FrontierCCP Stealth War NewsletterCommentariesNew Versus Old Cold War: Assessing the Current US-China ConfrontationRussia in DeclineRussia in the Middle EastRussia’s Path to the High-Tech BattlespaceThe Growing Importance of Belarus on NATO’s Eastern FlankWar by Other Means Promethean Liberation: Russia’s Emerging National and Regional Movements Black Sea Battleground: Risks and Challenges in Europe’s Threatened Frontier CCP Stealth War Newsletter Commentaries New Versus Old Cold War: Assessing the Current US-China Confrontation Russia in Decline Russia in the Middle East Russia’s Path to the High-Tech Battlespace The Growing Importance of Belarus on NATO’s Eastern Flank War by Other Means Promethean Liberation: Russia’s Emerging National and Regional Movements Black Sea Battleground: Risks and Challenges in Europe’s Threatened Frontier CCP Stealth War Newsletter Commentaries New Versus Old Cold War: Assessing the Current US-China Confrontation Russia in Decline Russia in the Middle East Russia’s Path to the High-Tech Battlespace The Growing Importance of Belarus on NATO’s Eastern Flank War by Other Means RegionsAfricaCentral AsiaChina and the Asia-PacificEuropeLatin AmericaMiddle EastSouth AsiaThe Caucasus Africa Central Asia China and the Asia-Pacific Europe Latin America Middle East South Asia The Caucasus Africa Central Asia China and the Asia-Pacific Europe Latin America Middle East South Asia The Caucasus Press/MultimediaConferences & EventsAnalystsMedia AppearancesNewslettersMultimedia News Conferences & Events Analysts Media Appearances Newsletters Multimedia News Conferences & Events Analysts Media Appearances Newsletters Multimedia News StoreAllBooksDVDsReports All Books DVDs Reports All Books DVDs Reports 1310 L St. NW, Suite 810Washington DC, 20005 PHONE:202.483.8888FAX: 202.483.8337E-MAIL:pubs@jamestown.org"}