{"id": 14, "name": "404 Media", "domain": "404media.co", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.404media.co/404-media-now-has-a-full-text-rss-feed/", "title": "404 Media Now Has A Full Text Rss Feed", "content": "Log in Subscribe Home About RSS Support/FAQ Podcast FOIA Forum Archive Merch Advertise Referral Program Thanks Privacy About RSS Support/FAQ Podcast FOIA Forum Archive Merch Advertise Referral Program Thanks Privacy **404 Media Now Has a Full Text RSS Feed** Since we launched 404 Media in August, the most common request we’ve gotten from our subscribers is for an RSS feed that contains the full text of all of our articles. We are proud and excited to announce that today, we have finally figured out how to make this available to all of our paid subscribers. If you’re already a subscriber,you can find your feed here. If you want to become a subscriber,you can subscribe here. Creating this feed was logistically quite complicated. We are thankful to Maxime Valette ofFeedPress, who helped us make the feed, and to Ryan Singel ofOutpost, who helped us sync the paid feeds with our Ghost member list. We’re also thankful to our paid subscribers, who have made it possible for us to pay for the development work needed to offer this and have also been very patient with us as we’ve worked behind the scenes to develop this feature. We feel strongly that offering full text RSS is the right thing to do, and that offering RSS in this way can help small, journalist-owned publications like ours better connect with our subscribers and can offer another path forward as we attempt to reach our reader directly, without having to rely exclusively on Google’s declining search engine or fractured social media algorithms that consistently devalue outbound links. We believe that this is the first time that custom, paid full-text RSS feeds have been offered on a site using the Ghost CMS. This is the CMS we use, and we are proud that our site is leading the way for other Ghost-based publishers to now also offer RSS feeds if they wish. With the hard development work now done, FeedPress and Outpost can now offer the feeds as a service to more Ghost sites. **Why RSS?** Our friends Anil Dash and Ernie Smith have recently written passionately and persuasively about the importance of RSS to the open web, and about how a technology that turns 25 years old this month remains both subversive and quite versatile. RSS-based distribution underpins a podcasting ecosystem that has allowed for shows to be distributed not just on Apple Podcasts but on Spotify, Google Podcasts, Pocket Casts, Overcast, and whatever other podcast player you might want to listen on. “Being able to say, ‘wherever you get your podcasts’ is a radical statement,”Dash wrote. “Because what it represents is the triumph of exactly the kind of technology that's supposed to be impossible: open, empowering tech that's not owned by any one company, that can't be controlled by any one company, and that allows people to have ownership over their work and their relationship with their audience.” Crucially, a few different companies have figured out how to offer custom RSS for premium (paid) podcast feeds. This means any given show can have a normal, ad-supported feed for the general public, but can also have a feed that features ad-free content, bonus episodes, and bonus segments using a separate RSS feed for paid subscribers. Actually, the premium RSS feeds for podcasts aren’t usually just a single RSS feed for all of a show’s subscribers. They are individualized, custom RSS feeds that have identical content but have a unique URL for each individual paid subscriber. If a show has five paid subscribers, there will be five identical feeds with five different URLs. If it has 5,000 subscribers, there will be 5,000 identical feeds with 5,000 different URLs. By creating these unique feeds, podcasters can do member management. If someone unsubscribes, their individual feed will be turned off. If a subscriber takes their secret feed URL and posts it to Reddit or shares it with dozens of people (thereby making it not secret and giving away content that is supposed to be behind a paywall), that feed can similarly be disabled. This is a system that works pretty well in the podcasting world, and has been done by a few different news websites, but is not widely utilized with written content. On Tedium,Smith explainedthat RSS has empowered podcasters, but that it needs a “creator economy rethink” for text. We think, and hope, that a similar custom feed solution can strike the correct balance between making our work easy to access and read using whatever RSS reader you want without destroying the subscriber-funded business model that we are using and believe in, and which is fundamental to us being able to continue our journalism. **What Happened When We Asked for Your Email Addresses** In January,we published an article explaining whywe decided to put up an email “freewall” on all of our posts, meaning we now require an email registration to read the site. The wall was created for a few reasons. Low-effort AI scrapers were taking our articles and automatically posting them with various errors on content farm websites. But we also explained that, in part because of AI spam, a Google algorithm that seemed to be getting worse, and the fracturing of social media, we feared a future where we wouldn’t be able to reach our readers directly. The email wall has generally been very beneficial for us as a website and as a business. We have been able to get more free email subscribers, and a notable portion of those free email subscribers have valued our work enough to become paid subscribers. For the most part, it has had its intended effect. But the email wall has also broken other things. The wall has essentially broken the site’s RSS functionality, because RSS readers cannot see past the wall. This means that we unintentionally made our product worse for people who are paying us money. So we sought to fix this. **A Path Forward** We knew that RSS couldn’t see past our paywall soon after we launched the site. Until we turned the email wall on, however, this wasn’t much of a problem because almost all of our articles were not walled. After the wall went on, people using RSS could only read the first few lines of our articles. As far as we know, there were no existing integrations or plugins for Ghost, the content management system and site infrastructure we use, that can create a full-text RSS feed of a Ghost website (it is possible that it’s been done, but we searched far and wide in the Ghost Forums, asked some friends, and asked other people running Ghost sites, and no one was aware of any solutions). We saw one Ghost site that managed to make a single RSS feed of its paid content, but that feed got leaked, making it possible for anyone who had the link to bypass the paywall. Disabling that link would then break the feed for any paid readers who were using it. We reached out to a few services that do paid podcast RSS feeds to see if they would be able to develop a solution for us, but no one we asked had time to do it. Then we found FeedPress. FeedPress was able to take an API used by Ghost to create a single fulltext RSS feed, then was able to create the individualized feeds we needed as well. Outpost was then able to sync these feeds with Ghost’s membership API, meaning that each paid subscriber is assigned a custom feed. We are grateful to both companies for working with us to develop this so that we can provide it to our readers. Both FeedPress and Outpost have said they plan to offer this service to other Ghost publishers moving forward. The fulltext RSS feed is a feature for paid subscribers only, because we had to pay for the development of this solution, and it will also cost us money every month to keep the feeds up and running. We have tested the feed a fair bit and believe it should work well. But there may be some bumps in the road, so please let us know if you find anything broken or if your feed isn’t working for you for some reason. We were only able to afford the development work on this project because of our paid subscribers, and are proud that we’ve been able to take your membership fees and reinvest them into the company to make your member benefits better. **Unparalleled access to hidden worlds both online and IRL.** About RSS Support/FAQ Podcast FOIA Forum Archive Merch Advertise Referral Program Thanks Privacy"}