{"id": 149, "name": "The BMJ (British Medical Journal)", "domain": "bmj.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://www.bmj.com/about-bmj/resources-authors/forms-policies-and-checklists", "title": "Forms Policies And Checklists", "content": "Intended for healthcare professionals Access provided by Wellesley College Library Subscribe My AccountMy email alerts My email alerts My email alerts BMA member login Username*Password*Forgot your log in details?Need to activateBMA Member Log InLog in via OpenAthensLog in via your institution UK South Asia International **Search form** Advanced search Search responses Search blogs ResearchAt a glanceResearch papersResearch methods and reportingMinerva At a glance Research papers Research methods and reporting Minerva At a glance Research papers Research methods and reporting Minerva EducationAt a glanceClinical reviewsPracticeMinervaEndgamesState of the artWhat your patient is thinkingRapid recommendationsStudent At a glance Clinical reviews Practice Minerva Endgames State of the art What your patient is thinking Rapid recommendations Student At a glance Clinical reviews Practice Minerva Endgames State of the art What your patient is thinking Rapid recommendations Student News & ViewsAt a glanceNewsFeaturesEditorialsAnalysisOpinionHead to headEditor's choiceLettersObituariesCareersRapid responses At a glance News Features Editorials Analysis Opinion Head to head Editor's choice Letters Obituaries Careers Rapid responses At a glance News Features Editorials Analysis Opinion Head to head Editor's choice Letters Obituaries Careers Rapid responses CampaignsAt a glanceBetter evidenceClimate changeDivestment from fossil fuelsPatient and public partnershipToo much medicine At a glance Better evidence Climate change Divestment from fossil fuels Patient and public partnership Too much medicine At a glance Better evidence Climate change Divestment from fossil fuels Patient and public partnership Too much medicine JobsDoctor Jobs UKHospital Jobs UKGP Jobs UKInternational Jobs Doctor Jobs UK Hospital Jobs UK GP Jobs UK International Jobs Doctor Jobs UK Hospital Jobs UK GP Jobs UK International Jobs Archive For authors Hosted About The BMJ Resources for authors Forms, policies, and ethics **Forms, policies, and ethics** **Transparency policy** The mission ofThe BMJis to lead the debate on health and to engage, inform, and stimulate all doctors and health care researchers in ways that enable them to make better decisions and improve outcomes for patients. Underpinning these aims,The BMJhas a set of ethical editorial principles, an ethics advisory committee, and a commitment to transparency. We try to ensure that readers, authors, and editors know as much about the background to each other’s work as possible. We do this through policies such as open peer review, declaring competing interests, and explaining the role of the bodies that fund research. There are many other policies and principles that helpThe BMJto be an ethical publisher, and we have brought all of them together in this single transparency policy. You can reach the policies listed below simply by clicking on the links. We will add toThe BMJ’s transparency policy as often as we need to. Please contact us if you feel there is anything missing. **Other aspects of transparency** Please follow the links to find these policies: Competing interestsEthics approval of researchThe BMJ's ethics committeeOpen accessCopyright and permission to reuseTrial registration and data sharingAuthorship and contributorshipPatient confidentialityPublishing images of patientsOur peer review processPrevious peer review reportsPeer reviewing research done by BMJ editorsEvidence based publishing atThe BMJEditorial research atThe BMJOccupational workforce researchPrevious publicationDuplicate publication and plagiarismCorrections and retractionsScientific misconductArticle provenanceRole of professional medical writersReporting industry-sponsored trialsCompeting interests ofThe BMJ'seditorial staffCompeting interests ofThe BMJ'seditorial advisory boardBMJ (publishing group) advertising and sponsorship policyArticles criticising doctors and others **Publication ethics** The BMJaims to ensure that all articles published inThe BMJreport on work that is morally acceptable, and expects authors to follow the World Medical Association'sDeclaration of Helsinki. **Copyright and open access** All research inThe BMJis published Open Access. Please see full details of our approach on our page aboutcopyright, open access and permissions. **Competing interests** A competing interest — often called a conflict of interest — exists when professional judgment concerning a primary interest (such as patients' welfare or the validity of research) may be influenced by a secondary interest (such as financial gain or personal rivalry). We believe that, to make the best decision on how to deal with an article, we should know about any competing interests that authors may have, and that if we publish the article readers should know about them too. **Scientific misconduct** There are differing definitions of scientific misconduct. AtThe BMJ, we deal with these problems on a case by case basis while following guidance produced by the major publication ethics bodies. **Patient consent, confidentiality, and images of patients** Our policy is based on the UK's data protection law and the English common law of confidentiality. UK authors should be aware that the General Medical Council has extensive guidance on patient consent and confidentiality and that our policy is in line with GMC advice. **Editorial duty of confidentiality towards authors** The BMJ's editors treat all submitted manuscripts as confidential documents, which means they will not divulge information about a manuscript to anyone without the authors' permission. During the process of manuscript review the following people may also have access to manuscripts:• Editors and editorial staff atThe BMJ, including medical students on placement and occasional overseas visitors - usually doctors or editors from other journals;• External reviewers, including statisticians and experts in trial methods;• Members of the journal's editorial committees, comprising the final stage in our peer review process for original research articles;• The only occasion when details about a manuscript might be passed to a third party without the authors’ permission is if the editor suspects serious research misconduct. **Criticism of health professionals** The BMJsometimes publishes articles that criticise health professionals. Being a professional implies operating to a higher ethical standard than the general population. Thus, when balancing the interest of patients and the profession against those of an individual professional,The BMJhas an obligation to give more weight to the interests of patients and the profession than might be the case if a publication was balancing the interest of a lay individual against those of the general community. The BMJhas guidelines on articles in which the health professionals are clearly identified and those in which they are not, and some elements are common to both. **ICMJE Requirements for all manuscripts submitted toThe BMJ** All submissions toThe BMJmust conform to the International Committee of Medical Journal Editors uniform requirements for manuscripts submitted to biomedical journals. Ourrequirementsreflect those of the ICMJE, although we also have specific requirements for differenttypes of articleand particularly detailed ones for research articles. **Authorship and contributorship** The BMJfollows The International Committee of Medical Journal Editors Recommendations for the Conduct, Reporting, Editing, and Publication of Scholarly Work in Medical Journals (ICMJE Recommendations 2018) with regards to authorship, contributorship and group authorship. **Research about workforces** Guidelines about informing workforces about the results of research in which they have participated before publication in mass media. Research undertaken with workforces can take place only with their full cooperation. Understandably, they expect to hear from the researchers about the results of the research and its implications for them before publication in the mass media. **AI use** The BMJ's policy on AI applies to all authors and contributors submitting content for publication in a BMJ title. It applies to all types of content, including original research, debate, opinion, journalism. It applies to all formats, including, without limitation, all text, audio, video and audio-visual material, abstracts, databases, tables, data, diagrams, photographs and other images or illustrative materials. **Tobacco industry funding** All BMJ journals publish content which is free from financial ties to the tobacco industry. The principle of excluding content funded by the tobacco industry applies to all content. This is to avoid our journals being used in the service of industry to downplay the harms of tobacco and related products such as vapes. Read the full policy on BMJ Author Hub Press and embargo policy **Press and embargo policy** **Press and embargo policy** Release of material to the media All content in a BMJ Group journal is strictly embargoed until it posts into the public domain, so should not be disseminated, including on social media, before that date. This is to ensure that clinicians and the public are able to access content as soon as it appears in the media. We accept that reports may appear in the media after presentations at scientific meetings. Authors wishing to submit their work to a BMJ Group journal should not give the media any further information beyond what was included in the presentation. Please advise if your work has been presented at a scientific meeting, has been posted on a preprint server or has been publicised in any way, including on social media, before submission. Responsibility for advising any co-authors, funders, and employers of imminent publicity rests with the corresponding author. If we decide not to press release a particular item, we are happy for authors (or their organisations) to issue their own press release. This can be done by requesting the external release protocol of the relevant journal’s production editor. This allows you to select a preferred online posting date/time and provides a pdf of the article for distribution to journalists. Press releases BMJ Group regularly publicises content of interest to journalists from our portfolio of 65+ journals. This includes original research papers, analysis articles, commentaries, editorials, letters, consensus statements, case reports and podcasts. We do this primarily via press releases and social media engagement. Press releases are designed to generate news coverage, and content is selected on the basis of its news potential for a general (non-medical) audience. Some journals are a richer source of newsworthy articles than others. Press releases are sent to around 3,000 media outlets across every platform around the world. We also flag content to recipients on smaller lists, categorised by geographical region or area of interest. We exclude lobby/consumer/charity/campaign groups to preserve editorial independence and so as not to favour any particular organisation or group. Press release content Press releases are based purely on the content of an article and aim to promote the journal, the science, and perform some public service. They are not intended to endorse particular policies or to boost the profile of individual organisations. Press releases aim to provide a balanced summary of the content, written in plain English. They don’t include content that is not in the article itself or personally attributed quotes. Funder information is included in the notes for editors at the bottom of the press release. We always provide author contact details for further information or for interview requests on the press release. If you prefer to nominate a co-author or your press office to handle media queries, please provide the relevant details. An out of hours contact number is also helpful for the press office to enable us to respond to requests out of hours. The corresponding author will be sent draft text to check for accuracy and clarity and provide contact details a maximum of 24-48 hours in advance. Our embargoed press releases are posted onEurekAlert(the website of the American Association for the Advancement of Science) and once the embargo has lifted, onBMJ Group’s Media Hub. Responding to journalists If you agree to be a contact for journalists, please ensure you are available during the embargo period and respond promptly to any media requests: journalists work to very tight deadlines. Don’t be surprised if you aren’t contacted at all during the embargo period. Unless they have queries about the content itself, journalists may simply prefer to seek comment from alternative sources. However, if your research is particularly topical or controversial, you may receive multiple media requests. Press embargoes Press releases are usually embargoed until 23:30 hours (UK time) on the day of online publication. Embargoes ensure that all parties are adequately prepared and they enable competing journalists to work to a common deadline, giving them ample time to produce balanced and well informed copy. During the embargo period you can talk to journalists, but nothing must be published or broadcast before the embargo lifts. A broken embargo usually limits the overall media coverage rather than increases it and creates chaos for all the parties involved. For further information please contact the media relations team:mediarelations@bmj.com Publishing model Editorial staff Advisory panels Explore The BMJ BMJ Student How green is The BMJ? Sources of revenue Resources for authorsArticle types and preparationArticle submissionForms, policies, and ethicsAuthorship & contributorshipCompeting interest policyCopyright, open access, and permission to reusePatient consent and confidentialityResearch EthicsGuidance for new authorsBMJ Christmas issue Article types and preparation Article submission Forms, policies, and ethicsAuthorship & contributorshipCompeting interest policyCopyright, open access, and permission to reusePatient consent and confidentialityResearch Ethics Authorship & contributorship Competing interest policy Copyright, open access, and permission to reuse Patient consent and confidentiality Research Ethics Guidance for new authors BMJ Christmas issue Article types and preparation Article submission Forms, policies, and ethicsAuthorship & contributorshipCompeting interest policyCopyright, open access, and permission to reusePatient consent and confidentialityResearch Ethics Authorship & contributorship Competing interest policy Copyright, open access, and permission to reuse Patient consent and confidentiality Research Ethics Authorship & contributorship Competing interest policy Copyright, open access, and permission to reuse Patient consent and confidentiality Research Ethics Guidance for new authors BMJ Christmas issue Resources for advertisers and sponsors Resources for BMA members Resources for media Resources for subscribers Resources for readers Resources for reviewers About The BMJ app Poll archive Contact us UK jobs International jobs **This week's poll** Readrelated article Seeprevious polls **Follow us on** Twitter Facebook YouTube RSS **Content links** Collections Health in South Asia Women’s, children’s & adolescents’ health Zika virus Research Education News and views BMJ Opinion Rapid responses Archive **About us** About us Editorial staff BMJ in the USA BMJ in Latin America BMJ in South Asia Advisers Policies Submit your paper **Resources** Authors Reviewers BMA members Readers Subscribers Advertisers and sponsors Media Recruiters **Explore BMJ** Our company BMJ Careers BMJ Learning BMJ Masterclasses BMJ Journals BMJ Student Academic edition of The BMJ BMJ Best Practice The BMJ Awards **My account** Email alerts Activate subscription **Information** Contact us Complaints Cookie settings Cookie Policy Privacy policy Website T&Cs Revenue Sources HighWire Press Sitemap Legal Information"}