{"id": 1516, "name": "USA Today", "domain": "usatoday.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://10best.usatoday.com/food-drink/latino-owned-wineries-in-america/", "title": "Latino Owned Wineries In America", "content": "Readers' Choice Awards Travel Food & Drink Lifestyle Instagram Facebook Twitter / X **An impressive blend: 8 Latino-owned wineries living the American dream** **From Oregon to New York, these are the vineyards to visit** Published onJun. 3, 2025 Winemaker Aurora Cória (pictured, center) embraces the family business – Photo courtesy of Cória Estates For generations, folks from Mexico and South and Central America have immigrated to the U.S. and made their mark on the American wine industry. Although in the minority, many Latino-owned wineries are making waves in the industry by blending heritage with innovation, from the vine to the bottle. Here, we toast to eight Latino-owned wineries creating a legacy and inspiring future generations of winemakers in the U.S. **Ceja Vineyards, Sonoma, California** The Ceja family welcomes guests to their winery – Photo courtesy of Ceja Vineyards Despite being founded in 1999,Ceja Vineyards’ story began in 1967 when patriarch Pablo Ceja and his wife, Juanita, along with their six children, left Mexico and immigrated to the United States. They settled in the St. Helena area, where both parents worked and became acquainted with the art of viticulture. By 1983, the hardworking family, along with two sons, Pedro and Armando, and Pedro’s wife, Amelia, took a leap of faith and purchased 15 acres in Carneros, which straddles Napa and Sonoma counties. Today, Ceja Vineyards spans 113 lush acres and specializes in chardonnay and pinot noir, along with a selection of other premium Carneros-based wines. Tastings are by reservation only. Where to stay:Located in the heart of Sonoma, the elegantMacArthur Place Hotel & Spaoffers spacious guest rooms, a spa, an outdoor pool, and three restaurants. **** **Cória Estates, Salem, Oregon** Luis, Aurora, and Janice Cória are often seen welcoming guests at their family winery – Photo courtesy of Cória Estates Driving toCória Estateswill take your breath away. The tasting room is perched on a hilltop in Salem, offering expansive views of the valley below. Founded in 1998 by Luis and Janice Cória, they planted their first grapes on nine acres in 1999. Mexican-born Luis left home when he was only 14 years old, seeking opportunities in the U.S., where he eventually met Janice, who grew up in Idaho. Many years later, the property spans 104 acres and is a family affair; daughters Aurora and Elizabeth help run the successful business. Tasting experiences at this Latino-owned winery are fun and eventful, featuring a variety of delicious food offerings from the de la cocina menu. They also host livemusical performanceson the patio. Sit back and relax as you watch the sun go down, sipping their classic pinot noir or pinot gris. Reservations are encouraged, but walk-ins are welcome. Where to stay:Nestled along the Willamette River, the 72-roomIndependence Hotelis conveniently near antique shops, charming boutiques, and a nice selection of eateries in downtown Independence. **Guerrero Fernandez Winery, Windsor, California** Founders Olga Fernandez and Martin Guerrero make boutique wines in Sonoma County – Photo courtesy of Guerrero Fernandez Winery Located in the Artisan Beverage District in Windsor, the husband-and-wife team of Martin Guerrero and Olga Fernandez foundedGuerrero Fernandez Wineryin 2004. The winery sources grapes from local vineyards in the Russian River Valley and Sonoma County, capturing the essence of the region’s flavors in every bottle. Using traditional winemaking methods, their portfolio primarily features red wines, including pinot noir, merlot, zinfandel, and cabernet sauvignon. The couple’s journey began almost 40 years ago when they left their home in Morelia, Mexico, to explore new opportunities in California’s wine country. Guerrero worked at Korbel Champagne Cellars for 20 years, where he learned and fine-tuned his skills before pursuing his own business and becoming a winemaker. Where to stay:Nestled along the Russian River,Mine + Farmis a contemporary bed-and-breakfast offering cozy digs for those looking to escape the hustle and bustle. **** **Atticus Estate Vineyard & Winery, Yamhill, Oregon** Atticus owners Ximena and Guy Orrego host private tastings in their home – Photo courtesy of Carolyn Wells-Kramer Located in Oregon's Willamette Valley,Atticus Estate Vineyard & Wineryis part of the Yamhill-Carlton American Viticultural Area (AVA), renowned for its vibrant pinot noir grapes. Winemaker Ximena Orrego, who founded the winery in 2005 alongside her husband, Guy, was born in Peru and raised in Venezuela. At Atticus Estate, you'll find by-appointment-only wine tastings offered in both English and in Spanish. **Wine tasting on a budget: 10 affordable wine regions that aren't Napa** “One of the most meaningful changes I’ve witnessed is the increasing presence of women in the wine industry,\" says Ximena. \"I’ve also noticed a slow but steady rise in diversity, which is bringing fresh ideas, broader perspectives, and renewed energy to our field. It’s no longer just about tasting. People are seeking something deeper, more personal, and truly memorable.” Where to stay:Stay in a converted grain silo atAbbey Road Farm, a splendid 82-acre property nearby. One bonus is the fresh multicourse breakfast crafted by celebrated chef Will Preisch. **Clear Creek Vineyard & Winery, Camp Verde, Arizona** Winemaker Ignacio Mesa's pups are some of the friendly faces you'll see at Clear Creek Winery – Photo courtesy of Ignacio Mesa / Clear Creek Winery The Verde Valley AVA is unique due to its high-desert atmosphere, rich soil, and diverse temperature changes from day to night.Clear Creek Vineyard & Winerywas established in 1999 when owner and winemaker Ignacio Mesa purchased 10 acres of land. From the outset, Mesa was committed to organic farming, with a focus on sustainability. His passion and dedication to responsible practices earned him the Silver Innovator Sustainability Certification in Arizona in 2018, making him the first winery in the state to receive this recognition. Mesa’s family is originally from Mexico. “My grandfather moved in with us when I was in my teens,\" Mesa says. \"He was very grumpy, but he became calmer when he had a glass of wine in the evenings. I recognized the benefit of wine and thought I would like to make wine someday.” The Latino-owned winery is surrounded by mountain views and features a patio for outdoor tastings. Rhône, Bordeaux, and Spanish varietals are Clear Creek’s highlights. Guests can make reservations for tastings online. Where to stay:Located in the Village of Oak Creek,Las Posadas of Sedonais a lovely boutique hotel offering suites and villas, along with a hearty homemade daily breakfast. **** **Story of Soil, Los Olivos, California** Jessica Gasca saved money and began making wine while apprenticing on a vineyard – Photo courtesy of Lauren Maeve Photography Story of Soil, located in the picturesque town of Los Olivos in Santa Barbara County, is dedicated to small-batch, single-vineyard wines. Winemaker Jessica Gasca, a strong advocate for vineyard and farm workers in the area, created her first Story of Soil vintage in 2012 and opened the tasting room in 2017 with her husband. Story of Soil works with a curated selection of vineyards within the county to highlight the bold flavors of the region; Gasca’s focus is on single varietals, showcasing each one’s unique flavor. Enjoy these handcrafted wines — especially her pinot noirs — on the spacious outdoor patio. Where to stay:Sleep in ranch-chic luxury at theInn at Mattei's Tavern, Auberge Resorts Collection, just a few blocks away from the tasting room. **** **Jose Wine Caves, Garden Valley, California** Jose Wine Caves owner Alfonso Elena keeps his family close – Photo courtesy of Jose Wine Caves Located in the Sierra Foothills about an hour from Sacramento, you’ll findJose Wine Caveson a small bluff overlooking the Coloma Valley. Owner and winemaker Alfonso Elena has been working in the industry since 1975, when he emigrated from Tonalà, Oaxaca, Mexico, to Napa. After spending many years there, he resettled in El Dorado County, where he purchased land and started growing grapes. He opened Jose Wine Caves in 2013, in dedication to his brother. **Discover Idaho wine country, a rising star in American viticulture** The region’s cooler temperatures and higher elevations create unique and complex flavors. Elena’s specialties are zinfandel and syrah; although, he produces other blends. The wines are made with hand-picked grapes and contain a limited amount of sulfites. The intimate tasting room is family friendly and welcomes pets. Where to stay:Located about 15 minutes away from Jose Wine Caves,Rock Creek Innoffers six motel-style rooms with modern amenities. **RG|NY Vineyards, Riverhead, New York** Maria Rivero González keeps family tradition alive at RG|NY Wine – Photo courtesy of Estefany Molina / RG|NY The Rivero González family has been making wines in Parras, Coahuila, Mexico, since 1998. In 2018, the family purchased vineyards on the North Fork of Long Island and createdRG|NY Vineyards. RG|NY spans over 200 acres amidst an established East Coast wine region that's home to more than 60 vineyards. In addition to tastings, RG|NY hosts awide array of events, including dinners and live musical performances. Maria Rivero González, CEO of RG|NY, taps her family’s experience and success in Mexico and applies it to the vineyards in North Fork. The certified sustainable winery incorporates natural pest control, eliminating the use of toxic chemicals, and utilizes renewable energy. Where to stay:The historicPreston House & Hotel, in downtown Riverhead, offers guests a comfortable stay in a quiet neighborhood setting. **** **About the Author** **Jean Chen Smith** Jean Chen Smith is a food and travel writer who loves a good glass of pinot. **You may also like...** **Wine tasting on a budget: 10 affordable wine regions that aren't Napa** Napa is expensive. We have tips on more affordable wine-tasting regions around the U.S., like Southern Oregon, the Finger Lakes, and more. **Why McMinnville, Oregon, is perfect for exploring Willamette Valley wineries** Make the charming town of McMinnville, Oregon, home base to explore Willamette Valley wineries. Here's where to stay, sip, and more. **Discover Idaho wine country, a rising star in American viticulture** Savor exceptional Idaho wine from Snake River Valley to Lewis Clark Valley, and discover reds and whites at surprisingly affordable prices. About 10BEST Careers Sitemap Reprints & Permissions Contact Us **Sign up for our newsletter** Your Privacy Choices Privacy Policy California Notice at Collection Terms and Conditions Ethical Principles Responsible Disclosure ©202510BEST, a division of Gannett Satellite Information Network, LLC."}