{"id": 2188, "name": "World Press Review", "domain": "worldpress.org", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.worldpress.org/article.cfm/nearly-one-third-of-gazans-wanted-to-leave-the-gaza-strip-before-the-2023-war", "title": "Nearly One Third Of Gazans Wanted To Leave The Gaza Strip Before The 2023 War", "content": "About Us Donate Contact Us Advertise Web Statistics Africa Americas Asia-Pacific Europe Middle East Home **Search** **World News** Home Africa Americas Asia-Pacific Europe Middle East World Blogs World Headlines World Newspapers **RSS News Feeds** Middle East More Feeds **Features** Travel, Dining &Entertainment Opinion Students & Educators Editor of the Year Award Country Maps & Profiles Think Tanks & N.G.O.s **World Maps** Map of the World Africa Antarctica Asia & Middle East Australasia& Oceania Europe North America South America **Services** Find Freelancers Archives About Us Advertise With Us Website Traffic Make a Donation **Middle East** More Sharing ServicesShareShare on facebookShare on twitter **Nearly One-Third of Gazans Wanted to Leave the Gaza Strip Before the 2023 War** Teri SchureFebruary 15, 2025 Just before October 7, 2023—and before Hamas attacked Israel—Dr. Amaney Jamal, the Dean of the Princeton School of Public and International Affairs, conducted a Gaza survey in conjunction with the Palestinian Center for Policy and Survey Research. Dr. Jamal is Palestinian and spent much of her childhood in Ramallah, a city in the West Bank, about ten miles north of Jerusalem. The poll revealed that 44 percent of Gazan Palestinian youth between the ages of 18 and 28 wanted to leave, which represents one-third of the entire population of Gaza. To give you some background, the average Palestinian is around 20 and appears more open to the formation of armed groups. In recent surveys of Gaza and the West Bank, younger respondents also seem to be more militaristic, which has many experts asking if the current situation for young Palestinians will only breed more contempt. The bottom line is that before Hamas attacked Israel on October 7, 2023, and before the resulting war, a whopping 31 percent of Gazans wanted to leave. According to Itamar Marcus, the founder of Palestinian Media Watch, the number of Gazans who want to leave could be almost double what it was before the war, meaning that it's possible up to 60 percent of Gazans might be willing to go to other locations around the world. Based on the poll results, it is Marcus' opinion that the problem is not that Gazans don't want to leave but rather that the Palestinian Authority and Hamas, ideologically, politically, and in fear of losing their power, don't want the Palestinians to leave. Marcus further thinks that if President Trump wants to help the Gazans create a better future for themselves, he needs to create a mechanism whereby those who wish to leave can do so under the protection and guise of the United States. Marcus also believes whoever is in charge of the emigrating process should handle it discreetly and quietly. He believes that once the process is safely underway, and if those remaining in Gaza hear positive things from their friends and families who have left, they will also want to leave. The September 2023 poll and the aftermath of October 7 show that a significant percentage of Gazans are ready to leave—to rebuild their lives. Many experts believe that the Gazans who say they don't want to leave are either fearful or under pressure from Hamas. In a recent news segment on ILTV Israel News, Mr. Marcus discussed why he thinks young Gazans want to leave. Marcus asks, \"What eighteen-year-old wants to be told that you're going to be living in a tent or in a caravan for the next ten years of your life? You're only going to start your life when you're 28 years old. The Gazans are going to want to leave. The question is, where are they going to go? Where are they going to be spread out? According to that original poll, the majority of them want to move to Turkey. Will Turkey, a so-called American ally, and will the United States, be able to put enough pressure on Turkey that these people will go to Turkey and be welcomed in Turkey, where most of them want to go.\" The poll found that Turkey is Gazans' most preferred destination for immigration, followed by Germany, Canada, the United States, and Qatar. One of the questions asked in the poll was about Gazans' attitude towards Hamas. The poll revealed that trust in the Hamas government was low and declining. About 67 percent of Gazans polled said they had no trust, or little trust in Hamas. When Gazans were polled regarding their preferred party, 27 percent said Hamas. Thirty percent said they would favor the Palestinian Authority, proof that both Hamas and the Palestinian Authority have very little support or popularity among Gazan citizens. The poll also showed that the Palestinian Authority and Hamas are considered corrupt, with corruption being one of the top domestic issues. According to Dr. Jamal, who conducted the survey, \"We know that Hamas leads in a very dictatorial fashion in Gaza. We know from the poll that 40 percent said that the freedom of expression in Gaza was guaranteed to a great or moderate extent, which means about 60 percent did not believe the freedom of expression was guaranteed. And then, about close to 70 percent believe that the right to participate in a peaceful protest was not protected under Hamas rule. So increasingly, Palestinians in Gaza, at the eve of these atrocious attacks were feeling that their freedoms and the ability to express their opinion was limited, to express their opposition to the Hamas government was limited. In Gaza and elsewhere, even on the West Bank, it's increasingly become common to hear of stories where Palestinians oppose the leaderships, and they are arrested for criticizing the government.\" In the September 2023 survey, 75 percent of Palestinians polled in Gaza said they couldn't afford to eat because they lacked the money to buy food. In a 2021 survey, 51 percent of Palestinians polled in Gaza said they couldn't afford to eat, so their food insecurity is not new and has been going on for years. Before the October 2023 war, Gazans relied primarily on about 500 trucks per day for food and aid from the global community and other international organizations. Additionally, most Gazans polled in September 2023 blamed Hamas, and not Israel, for their food insecurities. The poll response that was cited most frequently by Palestinians was to blame mismanagement of the Hamas-led government, basically due to the level of corruption. The broad consensus from the September 2023 poll was that the Gazan Palestinians placed direct blame on the Hamas-led government for the mismanagement of food and resources and accused Hamas of an unequal and unfair dispersion of resources, food, or aid to their people. And their food and medical insecurities are only going to get worse before they get better, which is why the average Palestinian was discontent with Hamas and the economic situation in Gaza well before October 7, 2023. Back in 2014—eleven years ago—Dr. Jamal wrote a piece for The Washington Post saying that Gazans who supported Hamas tended to be in a better position economically than those who did not support Hamas. She further suggested that Hamas made life more difficult for their opponents and that anyone in Gaza who wanted to benefit economically needed to be loyal to Hamas. Dr. Jamal has more recently affirmed her prior sentiment by saying that the poorest and most disadvantaged people in Gaza are the most critical of Hamas. So, one can concur that those who align with and have close ties to Hamas—basically the thriving middle-class in Gaza—benefit from their allegiance with Hamas, and this is the main reason why they aren't as disadvantaged as other Gazans. As such, it is those Gazans who align with Hamas and who benefit from Hamas who are the ones invested in seeing Hamas stay in power. And they are more likely the ones who don't want to leave. My question is, if 75 percent of Gazans polled in September of 2023 said they couldn't afford to eat, what is the percentage of Gazans who benefit from Hamas? And yet, not one Arab country has offered to take in Gazan Palestinians. Not even during the war, and not even temporarily, when doing so might have saved thousands of lives and helped Israel defeat Hamas terrorists without so much bloodshed. Ghazi Hamad, a Hamas official, went on Lebanese television in November 2023 and said, \"We will do this again and again. The Al-Aqsa Flood is just the first time, and there will be a second, a third, a fourth.\" But do Gazans want this? After saying that Hamas wants a second, third, and fourth Al-Aqsa flood, Ghazi Hamad said, \"Will we have to pay a price? Yes, and we are ready to pay it. We are called a nation of martyrs, and we are proud to sacrifice martyrs.\" Maybe Hamas is ready to pay the price, but one has to wonder whether young Gazans want to be sacrificed as martyrs by Hamas. There have not been elections in Gaza in almost 20 years, and since the recent 2023 poll shows that 67 percent of Gazans distrust Hamas, what is the percentage of Gazans who are ready to pay the price for a second, third, and fourth Al-Aqsa flood? If you go back and look at the 2006 election, Hamas never represented the majority of the Palestinian people. Even though the 2006 elections brought Hamas to power, the election was far from a landslide. Hamas secured only 44 percent of the popular vote in that election, and many experts think that the 2006 outcome was more of a referendum against ending the corruption of the Palestinian Authority than actual support for Hamas. No one will argue the fact that Mahmoud Abbas, the leader of the Palestinian Authority, is grossly unpopular. Fifty-two percent of the Gazans polled believe the Palestinian Authority is a burden on the Palestinian people, with 67 percent wanting to see Abbas resign. But he refuses to do so, leaving no alternative leaders for the Palestinian people. Additionally, the 2023 poll offered Gazans a choice of four solutions: A two-state solution that recognizes Israel and is based on the 1967 borders; A confederation between Israel and a future Palestine; A one-state solution where Israelis and Palestinians would all live in one state and enjoy equal opportunities; A write-in solution The majority supported a two-state solution, but about 20 percent of the Gazans polled opted to write in armed resistance against Israel. In a June 2023 poll of Palestinians, 28 percent supported the concept of a two-state solution, while 70 percent were completely opposed. In a poll conducted in December 2022, 31 percent of Palestinians chose to reach a peace agreement. But 40 percent chose to wage an armed struggle against Israeli occupation. Perhaps, given the poll numbers, leaving Gaza may be the only way to achieve personal peace. I keep going back to what Itamar Marcus had to say on ILTV about the youth in Gaza: What eighteen-year-old wants to hear that they will have to live in a tent or a caravan for the next ten years? Dr. Jamal sadly and recently said this about today's Palestinian and Israeli youth: \"I want to bring in the role of social media. I look at some of the things I'm seeing on TikTok and elsewhere. And the truth is, it just pains me. It pains me as a mother. It pains me as a citizen of the world. It pains me as somebody who still fundamentally believes in a two-state solution that our children can be so ruthless to each other, on both the Israeli and the Palestinian side. It just pains me. It pains me, it pains me, it pains me. When our children are ridiculing the death and suffering of the other side, somebody has done something wrong. And I just hope that we look at this, and we say that this is what the failure of reconciliation and peace has brought. There is an active dehumanization campaign going on, on both ends, and it's just got to stop.\" Copyright © 1997-2025 Worldpress.org. All Rights Reserved"}