{"id": 679, "name": "iNews", "domain": "inews.co.uk", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://inews.co.uk/inews-lifestyle/money/property-and-mortgages/mortgage-rates-dropping-some-rising-ahead-interest-rate-decision-3740924", "title": "Mortgage Rates Dropping Some Rising Ahead Interest Rate Decision 3740924", "content": "IMPARTIAL NEWS + INTELLIGENT DEBATE News Politics Opinion Culture Money Sport Life & More Puzzles Newsletters NewsUKWorldScotlandHealthEducationTechnologyScienceEnvironmentBusinessHousing UK World Scotland Health Education Technology Science Environment Business Housing UK World Scotland Health Education Technology Science Environment Business Housing PoliticsConservativesLabourLiberal DemocratsBrexitScotlandAnalysis Conservatives Labour Liberal Democrats Brexit Scotland Analysis Conservatives Labour Liberal Democrats Brexit Scotland Analysis OpinionIan BirrellYasmin Alibhai-BrownEmma BarnettSimon KelnerEsther WalkerKitty DonaldsonVicky SprattMore i Columnists Ian Birrell Yasmin Alibhai-Brown Emma Barnett Simon Kelner Esther Walker Kitty Donaldson Vicky Spratt More i Columnists Ian Birrell Yasmin Alibhai-Brown Emma Barnett Simon Kelner Esther Walker Kitty Donaldson Vicky Spratt More i Columnists CultureTelevisionFilmMusicArtsBooksRadio & Podcasts Television Film Music Arts Books Radio & Podcasts Television Film Music Arts Books Radio & Podcasts MoneyBusinessSavingPropertyRetirementSmall BusinessBills Business Saving Property Retirement Small Business Bills Business Saving Property Retirement Small Business Bills SportFootballCricketRugby UnionFootball FixturesFootball TablesFootball Results Football Cricket Rugby Union Football Fixtures Football Tables Football Results Football Cricket Rugby Union Football Fixtures Football Tables Football Results Life & MoreRelationshipsLiving WellFood and DrinkTraveliTravel Offers Relationships Living Well Food and Drink Travel iTravel Offers Relationships Living Well Food and Drink Travel iTravel Offers PuzzlesHomeCrosswordsiFavouritesNumber puzzlesWord puzzles Home Crosswords iFavourites Number puzzles Word puzzles Home Crosswords iFavourites Number puzzles Word puzzles Newsletters **SECTIONS** Homeexpand_circle_down Newsexpand_circle_downUKexpand_circle_downWorldexpand_circle_downScotlandexpand_circle_downHealthexpand_circle_downEducationexpand_circle_downScienceexpand_circle_downEnvironmentexpand_circle_downHousingexpand_circle_down UKexpand_circle_down Worldexpand_circle_down Scotlandexpand_circle_down Healthexpand_circle_down Educationexpand_circle_down Scienceexpand_circle_down Environmentexpand_circle_down Housingexpand_circle_down UKexpand_circle_down Worldexpand_circle_down Scotlandexpand_circle_down Healthexpand_circle_down Educationexpand_circle_down Scienceexpand_circle_down Environmentexpand_circle_down Housingexpand_circle_down Politicsexpand_circle_downConservativesexpand_circle_downLabourexpand_circle_downLiberal Democratsexpand_circle_downScotlandexpand_circle_downAnalysisexpand_circle_down Conservativesexpand_circle_down Labourexpand_circle_down Liberal Democratsexpand_circle_down Scotlandexpand_circle_down Analysisexpand_circle_down Conservativesexpand_circle_down Labourexpand_circle_down Liberal Democratsexpand_circle_down Scotlandexpand_circle_down Analysisexpand_circle_down Opinionexpand_circle_downIan Birrellexpand_circle_downYasmin Alibhai-Brownexpand_circle_downEmma Barnettexpand_circle_downKitty Donaldsonexpand_circle_downSimon Kelnerexpand_circle_downEsther Walkerexpand_circle_downVicky Sprattexpand_circle_downStefano Hatfieldexpand_circle_downIan Burrellexpand_circle_downCharlene Whiteexpand_circle_downSusie Dentexpand_circle_downPoorna Bellexpand_circle_downSarah Carsonexpand_circle_down Ian Birrellexpand_circle_down Yasmin Alibhai-Brownexpand_circle_down Emma Barnettexpand_circle_down Kitty Donaldsonexpand_circle_down Simon Kelnerexpand_circle_down Esther Walkerexpand_circle_down Vicky Sprattexpand_circle_down Stefano Hatfieldexpand_circle_down Ian Burrellexpand_circle_down Charlene Whiteexpand_circle_down Susie Dentexpand_circle_down Poorna Bellexpand_circle_down Sarah Carsonexpand_circle_down Ian Birrellexpand_circle_down Yasmin Alibhai-Brownexpand_circle_down Emma Barnettexpand_circle_down Kitty Donaldsonexpand_circle_down Simon Kelnerexpand_circle_down Esther Walkerexpand_circle_down Vicky Sprattexpand_circle_down Stefano Hatfieldexpand_circle_down Ian Burrellexpand_circle_down Charlene Whiteexpand_circle_down Susie Dentexpand_circle_down Poorna Bellexpand_circle_down Sarah Carsonexpand_circle_down Cultureexpand_circle_downTelevisionexpand_circle_downFilmexpand_circle_downMusicexpand_circle_downArtsexpand_circle_downBooksexpand_circle_downGamingexpand_circle_downRadioexpand_circle_down Televisionexpand_circle_down Filmexpand_circle_down Musicexpand_circle_down Artsexpand_circle_down Booksexpand_circle_down Gamingexpand_circle_down Radioexpand_circle_down Televisionexpand_circle_down Filmexpand_circle_down Musicexpand_circle_down Artsexpand_circle_down Booksexpand_circle_down Gamingexpand_circle_down Radioexpand_circle_down Moneyexpand_circle_downBusinessexpand_circle_downSavingexpand_circle_downPropertyexpand_circle_downRetirementexpand_circle_downInvestingexpand_circle_downSmall Businessexpand_circle_downMotoringexpand_circle_downBillsexpand_circle_down Businessexpand_circle_down Savingexpand_circle_down Propertyexpand_circle_down Retirementexpand_circle_down Investingexpand_circle_down Small Businessexpand_circle_down Motoringexpand_circle_down Billsexpand_circle_down Businessexpand_circle_down Savingexpand_circle_down Propertyexpand_circle_down Retirementexpand_circle_down Investingexpand_circle_down Small Businessexpand_circle_down Motoringexpand_circle_down Billsexpand_circle_down Sportexpand_circle_downFootballexpand_circle_downCricketexpand_circle_downRugby Unionexpand_circle_downFootball Fixturesexpand_circle_downFootball Tablesexpand_circle_downFootball Resultsexpand_circle_down Footballexpand_circle_down Cricketexpand_circle_down Rugby Unionexpand_circle_down Football Fixturesexpand_circle_down Football Tablesexpand_circle_down Football Resultsexpand_circle_down Footballexpand_circle_down Cricketexpand_circle_down Rugby Unionexpand_circle_down Football Fixturesexpand_circle_down Football Tablesexpand_circle_down Football Resultsexpand_circle_down Life & Moreexpand_circle_downRelationshipsexpand_circle_downWellbeingexpand_circle_downFood & Drinkexpand_circle_downTravelexpand_circle_downi Travel Offersexpand_circle_down Relationshipsexpand_circle_down Wellbeingexpand_circle_down Food & Drinkexpand_circle_down Travelexpand_circle_down i Travel Offersexpand_circle_down Relationshipsexpand_circle_down Wellbeingexpand_circle_down Food & Drinkexpand_circle_down Travelexpand_circle_down i Travel Offersexpand_circle_down Puzzlesexpand_circle_downHomeexpand_circle_downCrosswordsexpand_circle_downiFavouritesexpand_circle_downNumber puzzlesexpand_circle_downWord puzzlesexpand_circle_down Homeexpand_circle_down Crosswordsexpand_circle_down iFavouritesexpand_circle_down Number puzzlesexpand_circle_down Word puzzlesexpand_circle_down Homeexpand_circle_down Crosswordsexpand_circle_down iFavouritesexpand_circle_down Number puzzlesexpand_circle_down Word puzzlesexpand_circle_down **MY ACCOUNT** **Why some mortgage rates are dropping and some rising ahead of interest rate decision** The Bank of England will decide whether to cut interest rates from their current level of 4.25 per cent next week Some major banks are cuttingmortgage ratesat the same time others are upping them in turbulent times for the market. From Wednesday (11 June), Barclays will raise rates by 0.2 percentage points across its fixed rate products, while HSBC will make similar changes. But NatWest is cutting some rates from Wednesday as well, with reductions of up to 0.23 percentage points. The changes to rates come a week before the nextBank of England interest ratedecision. The base rate currently stands at 4.25 per cent. Mortgage rates generally go down when there are expectations that interest rates will be cut further. This is because this sends swap rates – the rates at which banks lend to one another – down. **Read Next** **Where Rachel Reeves's spending cuts will hurt the most - in charts** **Where Rachel Reeves's spending cuts will hurt the most - in charts** TheBank of Englandhas cut interest rates twice already this year, and this has correlated with mortgage rates being reduced. Although previously there had been an expectation that interest rates could get below 4 per cent in 2025, these are no longer as prevalent and someexperts say there could be just one more cut. In turn, this has stopped the speed of mortgage rate reductions from being as fast and has pushed some rates up. Experts say that the general trend is that rates are going up, but that some lenders are having to use their “own strategy” to keep customers coming to them. Aaron Strutt of Trinity Financial said: “There is a mixture of changes but there is no getting away from the fact most rates are going up. There are also fewer sub-4 per cent fixes.” Nick Mendes of John Charcol brokers said: “Broadly speaking the bigger high-street names seem to be holding firm for now, clearly keen to stay competitive and keep volumes ticking over. “Meanwhile, a few others have started tweaking their rates or tightening criteria just to balance the books especially those with less wiggle room on margins. “It’s a classic case of every lender having its own strategy, really. The larger players can afford to ride it out and play the long game, while others are having to be a bit nimbler. So what could happen to mortgage rates in the future? Brokers aren’t sure, but expect they could stay steady or begin to fall. “If swaps stay steady, I wouldn’t be surprised to see a few more competitive offers creeping in,” says Mr Mendes. Elliott Culley of Switch Mortgage Finance added: “Some lenders may increase rates to reduce business levels for a short period of time whilst others decrease them to obtain more business. It likely won’t stay like this for long though.” The Bank of England will decide whether to cut interest rates from their current level next Thursday 19 June. Economists widely expect rates will be held at 4.25 per cent. The day before this, on Wednesday 18 June, the Office for National Statistics will unveil the latest inflation data. Economists generally think that the consumer prices index measure of inflation will fall marginally – to around 3.4 per cent – but a much bigger drop could lead to swap rates falling. Conversely, a large rise could lead to swap rates rising, which could potentially push mortgage rates upwards. Although there are cheaper rate best buys available, the average two-year fix is 5.13 per cent and the average five-year is 5.1 per cent, according to Moneyfacts. **EXPLORE MORE ON THE TOPICS IN THIS STORY** **MOST READ BY SUBSCRIBERS** **Austria school shooter who killed ten was 21-year-old former pupil, police say** **Where temperatures are set to soar to 29°C - as thunderstorm warnings loom** **BBC insiders fear Russia will fill void after World Service cuts** **Be in no doubt: Putin has Britain in his sights** **I’m suffering ‘micro stress’ – but there is a simple way to cope** **Winter fuel U-turn solves one headache for Starmer but creates two more** **Editor's Picks** **8 things we've learned from the spending review - and what they mean for you** **'Boil in a bag' funerals will challenge British squeamishness about death** **At 63, I’m fitter than ever - after a lifetime of cigs and booze** **Most Popular** **Where Rachel Reeves's spending cuts will hurt the most - in charts** **I keep £200 cash in my underwear drawer - here's why you should do the same** **How much will a combined income of £74k affect our winter fuel payment?** **Inheritance tax changes could lead to further probate delays, experts warn** **The vulnerable groups that could miss out despite winter fuel U-turn** **500,000 more pensioners will miss out on winter fuel payments by 2030** **I bought our London home for £390k in 2018 – six years later, it sold for the same price** **The strategy that could wipe thousands off your pension - what is pound-cost ravaging?** **My income is topped up with universal credit. Can I still get a mortgage?** Impartial news + intelligent debate **ESSENTIALS** News Sport Lifestyle Culture Opinion Puzzles **USEFUL LINKS** Contact Us About Advertise Print Subscriptions Rewards Student Digital Subscription Sitemap Newsletters Saved Articles Manage account **FOLLOW US ON** FacebookFacebook XX InstagramInstagram YouTubeYouTube TikTokTikTok LinkedInLinkedIn ThreadsThreads BlueskyBluesky All rights reserved. © 2025 Associated Newspapers Limited. Cookie Settings Do not sell or share my personal information Terms and Conditions Privacy Policy"}