{"id": 1918, "name": "Citizens United", "domain": "citizensunited.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.citizensunited.org/washington-times-david-bossie-under-trump-spending-cuts-are-suddenly-the-talk-of-the-town/", "title": "Washington Times David Bossie Under Trump Spending Cuts Are Suddenly The Talk Of The Town", "content": "Home About UsWho We AreWhat Is Citizens UnitedFulfilling Our MissionContact usInternship Who We Are What Is Citizens United Fulfilling Our Mission Contact us Internship Who We Are What Is Citizens United Fulfilling Our Mission Contact us Internship NewsLatest UpdatesCU In The NewsEditorialsPress Releases Latest Updates CU In The News Editorials Press Releases Latest Updates CU In The News Editorials Press Releases VideosFilm TrailersIssue Ads Film Trailers Issue Ads Film Trailers Issue Ads Film LibraryRiggedTorchbearerRocky Mountain HeistFast TerryOur Sacred HonorThe Hope & The ChangeThe Gift Of LifeA City Upon A HillAmerica At RiskNine Days That Changed The WorldRonald ReaganSee all 27 documentaries Rigged Torchbearer Rocky Mountain Heist Fast Terry Our Sacred Honor The Hope & The Change The Gift Of Life A City Upon A Hill America At Risk Nine Days That Changed The World Ronald Reagan See all 27 documentaries Rigged Torchbearer Rocky Mountain Heist Fast Terry Our Sacred Honor The Hope & The Change The Gift Of Life A City Upon A Hill America At Risk Nine Days That Changed The World Ronald Reagan See all 27 documentaries Support usWay to DonatePlanned GivingLegacy SocietyFrequently Asked QuestionsSubscribe Way to Donate Planned Giving Legacy Society Frequently Asked Questions Subscribe Way to Donate Planned Giving Legacy Society Frequently Asked Questions Subscribe **WASHINGTON TIMES: DAVID BOSSIE: Under Trump, spending cuts are suddenly the talk of the town** Last year, I posted on X that America’s unsustainable national debt and reckless federal spending problem is “the crisis that no one wants to talk about.” The national debt currently stands at $36.2 trillion. We’ve tacked on an astonishing $1.6 trillion in debt in just one calendar year. The budget deficit is hovering around $1 trillion. Over the past five years, the federal government has gone from spending $4.4 trillion to spending $7.3 trillion annually. We overspent to prop up the economy during COVID-19, and then the Biden administration continued spending as if the pandemic were never-ending, thus creating a more dependent population. Despite all this, Congress continued legislating from government shutdown crisis to shutdown crisis, never getting all their appropriations bills finished on time, ignoring all the flashing red lights and sirens along the way — and salivating over the next opportunity to pass yet another multi-trillion dollar omnibus bill without any meaningful debate or reforms. **Don’t Miss Out** Subscribe to our free email newsletter and get all the latest sent directly to your inbox. Well, what a difference a president makes. Since the historic reelection of President Trump, Republicans winning majorities in both houses of Congress and the creation of the Department of Government Efficiency (DOGE), cutting government spending is suddenly the talk of the town in Washington. And believe it or not, we’re starting to see some results that are providing a flicker of hope. The House recently passed Mr. Trump’s “One Big Beautiful Bill Act” — also known as a budget reconciliation package — and the consequential legislation not only extends the enormously successful 2017 Trump tax cuts, but also saves taxpayers about $1.5 trillion through spending reforms over the next 10 years. The bill doesn’t go far enough on the savings side, but in the context of the small GOP majorities in Congress, the effort should be seen as an important first step in the right direction. That being said, Mr. Trump understands that spending measures such as this can’t be just a “one and done” undertaking. The time has come for Washington to shed its spending addiction permanently and replace it with a strict adherence to fiscal responsibility so the American people start regaining trust in government. In addition to the savings in the monumental budget bill that’s now being considered by the Senate, over the past four months DOGE has also secured $175 billion in savings by conducting a long overdue “audit with teeth.” And it goes without saying at this point that the DOGE savings numbers would be even higher if it weren’t for activist liberal judges abusing their power in the name of defending the failed status quo of unchecked wasteful spending in the bloated bureaucracy of Washington. Additionally, starting immediately, the White House Office of Management and Budget (OMB) is sending the first of several spending rescission packages to Congress. The opening salvo will total around $9.4 billion in budget cuts targeting NPR, PBS and USAID foreign aid. The White House is also leaving the door open to using pocket rescissions to achieve additional budget cuts under the Impoundment Control Act that don’t require congressional approval. After years of malpractice by the mainstream media — a big federal spending fight could come and go without the national debt even being mentioned in the news coverage — we now have financial leaders from the private and public sectors singing from the same hymnbook regarding the emergency we’re facing. Treasury Secretary Bessent said recently, “I came to Washington because I was concerned about the debt. The deficit is already lower than last year and will continue to decline over the next four years.” Similarly, JP Morgan Chase CEO Jamie Dimon called the national debt “a big deal … a real problem” and said common-sense entitlement program reforms that rein in waste, fraud and abuse are part of the equation to target the spending crisis. And Senator Ron Johnson, Wisconsin Republican, recently wrote in The Wall Street Journal that we must “go line by line through the entire federal budget to uncover, expose, and eliminate the hundreds of billions of dollars of waste, fraud and abuse that the DOGE effort has shown exists. If we don’t, America is headed off a cliff.” Indeed, Mr. Trump is providing incredible leadership on the issue of federal spending. In fact, he’s working hard to change the entire fiscal attitude in Washington, and not a moment too soon. In his address to Congress earlier this year, he said, “I want to do what has not been done in 24 years: Balance the federal budget.” Elon Musk summed up the Trump-inspired reforms taking place perfectly when he posted on X that “The @DOGE mission will only strengthen over time as it becomes a way of life throughout the government.” Let’s face it, every level of government — state, county and municipal — would be much better off with its very own DOGE operation. This has become an indisputable fact almost overnight thanks to Mr. Trump and his courage to allow DOGE to succeed in its critically important mission. Now, as we look forward to FY2026 spending and a transparent appropriations process under regular order in Congress, the DOGE savings must be codified into law because going back to the mess that the Biden administration left us with isn’t an option. In fact, it can be argued that this year’s appropriations hearings and mark-ups are the most eagerly anticipated in decades, because Congress won’t only be moving spending bills to codify all the savings and efficiencies DOGE has identified; they can also cement the DOGE mindset itself as a roadmap for future administrations and legislative sessions. The American people want to see meaningful spending reductions this year. For Congress, it’s time to go big or go home. Our $36 trillion national debt must be confronted here and now. • David N. Bossie is the president of Citizens United. He served as a senior adviser to the Trump 2024 and 2020 campaigns. He served as deputy campaign manager for Donald J. Trump for President in 2016 and deputy executive director for the Trump Transition Team. **About Citizens United** Latest Updates Latest UpdatesWASHINGTON TIMES: DAVID BOSSIE: Under Trump, spending cuts are suddenly the talk of the townLatest UpdatesDAILY CALLER: DAVID BOSSIE: Terrorism, Gangs And Spies Prove Trump’s Point On ImmigrationLatest UpdatesDAILY CALLER: DAVID BOSSIE: Time For Congress To Pull Back The Curtain On BidenLatest UpdatesDAILY CALLER: DAVID BOSSIE: Two Things Dems Should Do If They Want To Stay Relevant **WASHINGTON TIMES: DAVID BOSSIE: Under Trump, spending cuts are suddenly the talk of the town** **DAILY CALLER: DAVID BOSSIE: Terrorism, Gangs And Spies Prove Trump’s Point On Immigration** **DAILY CALLER: DAVID BOSSIE: Time For Congress To Pull Back The Curtain On Biden** **DAILY CALLER: DAVID BOSSIE: Two Things Dems Should Do If They Want To Stay Relevant** **WASHINGTON TIMES: DAVID BOSSIE: Under Trump, spending cuts are suddenly the talk of the town** **DAILY CALLER: DAVID BOSSIE: Terrorism, Gangs And Spies Prove Trump’s Point On Immigration** **DAILY CALLER: DAVID BOSSIE: Time For Congress To Pull Back The Curtain On Biden** **DAILY CALLER: DAVID BOSSIE: Two Things Dems Should Do If They Want To Stay Relevant** CU In the News CU In The NewsNEW YORK POST: Trump’s first-100-days wins, red alert for ActBlue and other commentaryCU In The NewsREAL CLEAR POLITICS: DAVID BOSSIE: Trump’s First 100 Days Has America Thinking Big AgainCU In The NewsNEW YORK POST: Lame move from a lame duck, grim wages of Joe’s weakness and other commentaryCU In The NewsBREITBART: Exclusive: Citizens United Releasing Film on ‘Trump’s Rescue Mission,’ Exposing Kamala Harris’s ‘Radical’ Record **NEW YORK POST: Trump’s first-100-days wins, red alert for ActBlue and other commentary** **REAL CLEAR POLITICS: DAVID BOSSIE: Trump’s First 100 Days Has America Thinking Big Again** **NEW YORK POST: Lame move from a lame duck, grim wages of Joe’s weakness and other commentary** **BREITBART: Exclusive: Citizens United Releasing Film on ‘Trump’s Rescue Mission,’ Exposing Kamala Harris’s ‘Radical’ Record** **NEW YORK POST: Trump’s first-100-days wins, red alert for ActBlue and other commentary** **REAL CLEAR POLITICS: DAVID BOSSIE: Trump’s First 100 Days Has America Thinking Big Again** **NEW YORK POST: Lame move from a lame duck, grim wages of Joe’s weakness and other commentary** **BREITBART: Exclusive: Citizens United Releasing Film on ‘Trump’s Rescue Mission,’ Exposing Kamala Harris’s ‘Radical’ Record** AboutWho We AreWhat Is Citizens UnitedFulfilling Our MissionContact usInternship Who We Are What Is Citizens United Fulfilling Our Mission Contact us Internship Who We Are What Is Citizens United Fulfilling Our Mission Contact us Internship NewsLatest UpdatesCU In The NewsEditorialsPress Releases Latest Updates CU In The News Editorials Press Releases Latest Updates CU In The News Editorials Press Releases Film & VideosCU MoviesFilm TrailersIssue Ads CU Movies Film Trailers Issue Ads CU Movies Film Trailers Issue Ads Support UsDonate OnlineDonate Phone / MailPlanned GivingLegacy SocietyFAQsSubscribe Donate Online Donate Phone / Mail Planned Giving Legacy Society FAQs Subscribe Donate Online Donate Phone / Mail Planned Giving Legacy Society FAQs Subscribe"}