{"id": 447, "name": "First Coast News", "domain": "firstcoastnews.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.firstcoastnews.com/article/weather/forecast/weather-forecast-jacksonville-st-augustine-st-johns-county-atlantic-beach-neptune-beach-jacksonville-beach-northest-florida-southeast-georgia/77-fb677f1d-8110-4fa2-a57e-5f5a21f52038", "title": "Weather Forecast Jacksonville St Augustine St Johns County Atlantic Beach Neptune Beach Jacksonville Beach Northest Florida Southeast Georgia", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalNear MeInvestigationsPoliticsCrimeTrafficNation WorldEntertainmentFeaturesLatest News StoriesCopeland's restaurant on Southside Boulevard taped off after shootingJacksonville Beach police looking for suspects they say robbed the same Marshalls twice Back Local Near Me Investigations Politics Crime Traffic Nation World Entertainment Features Copeland's restaurant on Southside Boulevard taped off after shooting Jacksonville Beach police looking for suspects they say robbed the same Marshalls twice Back Local Near Me Investigations Politics Crime Traffic Nation World Entertainment Features Copeland's restaurant on Southside Boulevard taped off after shooting Jacksonville Beach police looking for suspects they say robbed the same Marshalls twice WeatherBackForecastRadar10-DayHourlyMapsHurricane CentralClosings & DelaysLatest Weather StoriesHeat and humidity continue this week with daily afternoon storm chancesTalkin' Tropics: No development expected in the next 7 days Back Forecast Radar 10-Day Hourly Maps Hurricane Central Closings & Delays Heat and humidity continue this week with daily afternoon storm chances Talkin' Tropics: No development expected in the next 7 days Back Forecast Radar 10-Day Hourly Maps Hurricane Central Closings & Delays Heat and humidity continue this week with daily afternoon storm chances Talkin' Tropics: No development expected in the next 7 days SportsBackHigh School SportsJacksonville JaguarsGatorsSeminolesIcemenJumbo ShrimpArmadaAthlete of the WeekBulldogsOlympicsLocked On Podcast NetworkLatest StoriesNCAA will allow coaches' challenges in men's and women's basketballMen's and women's basketball coaches can now challenge officials' calls, NCAA saysNCAA announces new rule changes for men's and women's basketballCollege basketball coaches will be allowed to challenge officials' calls next seasonFemale athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law Back High School Sports Jacksonville Jaguars Gators Seminoles Icemen Jumbo Shrimp Armada Athlete of the Week Bulldogs Olympics Locked On Podcast Network NCAA will allow coaches' challenges in men's and women's basketballMen's and women's basketball coaches can now challenge officials' calls, NCAA saysNCAA announces new rule changes for men's and women's basketballCollege basketball coaches will be allowed to challenge officials' calls next season Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law Back High School Sports Jacksonville Jaguars Gators Seminoles Icemen Jumbo Shrimp Armada Athlete of the Week Bulldogs Olympics Locked On Podcast Network NCAA will allow coaches' challenges in men's and women's basketballMen's and women's basketball coaches can now challenge officials' calls, NCAA saysNCAA announces new rule changes for men's and women's basketballCollege basketball coaches will be allowed to challenge officials' calls next season Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law SearchSearch:Search Hurricane Central Advertise With Us On Your Side Ask Anthony First Coast Living Contests Buddy Check 12 La Primera Costa First Coast Foodies Military HeartThreads TV Listings **Heat and humidity continue this week with daily afternoon storm chances** JACKSONVILLE, Fla. —HEADLINES: **HEADLINES:** **HEADLINES:** THURSDAY-FRIDAY:Heat and humidity continue to remain relentless. Afternoon and evening sea breeze thunderstorms remain possible, with a few local strong storms developing. SATURDAY AND SUNDAY:Moisture will be in from the south with pm showers continuing through the weekend. Temperatures pushing into the low 90s. TALKIN' TROPICS:No tropical formation is expected in the next 7 days. You can always get the latest information byreading our Talkin' Tropics story here. Meteorological Seasons: Spring: March 1 - May 31 Summer: June 1 - Aug. 31 Fall: Sept. 1 - Nov. 30 Winter: Dec. 1 - Feb. 28 (or the 29th on a Leap Year). Download the First Coast News app and sign up for severe weather alerts. iPhone- Click here Android- Click here **** To stream FCN on your phone, you need the FCN app. **** **Download the FCN app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video In Other News **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}