{"id": 890, "name": "Medical News Today", "domain": "medicalnewstoday.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.medicalnewstoday.com/articles/novel-treatment-aldosterone-synthase-inhibitor-may-help-treat-hard-control-hypertension-global-trial", "title": "Novel Treatment Aldosterone Synthase Inhibitor May Help Treat Hard Control Hypertension Global Trial", "content": "Health ConditionsHealth ConditionsAlzheimer's & DementiaAnxietyAsthma & AllergiesAtopic DermatitisBreast CancerCancerCardiovascular HealthCOVID-19DiabetesEndometriosisEnvironment & SustainabilityExercise & FitnessEye HealthHeadache & MigraineHealth EquityHIV & AIDSHuman BiologyLeukemiaLGBTQIA+Men's HealthMental HealthMultiple Sclerosis (MS)NutritionParkinson's DiseasePsoriasisSexual HealthUlcerative ColitisWomen's Health **Health Conditions** Alzheimer's & Dementia Anxiety Asthma & Allergies Atopic Dermatitis Breast Cancer Cancer Cardiovascular Health COVID-19 Diabetes Endometriosis Environment & Sustainability Exercise & Fitness Eye Health Headache & Migraine Health Equity HIV & AIDS Human Biology Leukemia LGBTQIA+ Men's Health Mental Health Multiple Sclerosis (MS) Nutrition Parkinson's Disease Psoriasis Sexual Health Ulcerative Colitis Women's Health **Health Conditions** Alzheimer's & Dementia Anxiety Asthma & Allergies Atopic Dermatitis Breast Cancer Cancer Cardiovascular Health COVID-19 Diabetes Endometriosis Environment & Sustainability Exercise & Fitness Eye Health Headache & Migraine Health Equity HIV & AIDS Human Biology Leukemia LGBTQIA+ Men's Health Mental Health Multiple Sclerosis (MS) Nutrition Parkinson's Disease Psoriasis Sexual Health Ulcerative Colitis Women's Health Health ProductsHealth ProductsAllNutrition & FitnessVitamins & SupplementsCBDSleepMental HealthAt-Home TestingMen’s HealthWomen’s Health **Health Products** Nutrition & Fitness Vitamins & Supplements CBD Sleep Mental Health At-Home Testing Men’s Health Women’s Health **Health Products** Nutrition & Fitness Vitamins & Supplements CBD Sleep Mental Health At-Home Testing Men’s Health Women’s Health DiscoverNewsLatest NewsOriginal SeriesMedical MythsHonest NutritionThrough My EyesNew Normal HealthPodcastsAllAMA: Registered dietitian answers 5 key questions about fiber and weight lossHealth misinformation and disinformation: How to avoid itBrain health, sleep, diet: 3 health resolutions for 20255 things everyone should know about menopause3 ways to slow down type 2 diabetes-related brain agingToxic metals in tampons: Should you be worried? **News** Latest News **Original Series** Medical Myths Honest Nutrition Through My Eyes New Normal Health **Podcasts** AMA: Registered dietitian answers 5 key questions about fiber and weight loss Health misinformation and disinformation: How to avoid it Brain health, sleep, diet: 3 health resolutions for 2025 5 things everyone should know about menopause 3 ways to slow down type 2 diabetes-related brain aging Toxic metals in tampons: Should you be worried? **News** Latest News **Original Series** Medical Myths Honest Nutrition Through My Eyes New Normal Health **Podcasts** AMA: Registered dietitian answers 5 key questions about fiber and weight loss Health misinformation and disinformation: How to avoid it Brain health, sleep, diet: 3 health resolutions for 2025 5 things everyone should know about menopause 3 ways to slow down type 2 diabetes-related brain aging Toxic metals in tampons: Should you be worried? ToolsGeneral HealthDrugs A-ZHealth HubsNewsletterHealth ToolsFind a DoctorBMI Calculators and ChartsBlood Pressure Chart: Ranges and GuideBreast Cancer: Self-Examination GuideSleep CalculatorQuizzesRA Myths vs FactsType 2 Diabetes: Managing Blood SugarAnkylosing Spondylitis Pain: Fact or Fiction **General Health** Drugs A-Z Health Hubs Newsletter **Health Tools** Find a Doctor BMI Calculators and Charts Blood Pressure Chart: Ranges and Guide Breast Cancer: Self-Examination Guide Sleep Calculator **Quizzes** RA Myths vs Facts Type 2 Diabetes: Managing Blood Sugar Ankylosing Spondylitis Pain: Fact or Fiction **General Health** Drugs A-Z Health Hubs Newsletter **Health Tools** Find a Doctor BMI Calculators and Charts Blood Pressure Chart: Ranges and Guide Breast Cancer: Self-Examination Guide Sleep Calculator **Quizzes** RA Myths vs Facts Type 2 Diabetes: Managing Blood Sugar Ankylosing Spondylitis Pain: Fact or Fiction ConnectAbout Medical News TodayWho We AreOur Editorial ProcessContent IntegrityConscious LanguageFind CommunityBezzy Breast CancerBezzy MSBezzy MigraineBezzy PsoriasisFollow Us **About Medical News Today** Who We Are Our Editorial Process Content Integrity Conscious Language **Find Community** Bezzy Breast Cancer Bezzy MS Bezzy Migraine Bezzy Psoriasis **Follow Us** **About Medical News Today** Who We Are Our Editorial Process Content Integrity Conscious Language **Find Community** Bezzy Breast Cancer Bezzy MS Bezzy Migraine Bezzy Psoriasis **Follow Us** Causes & Risk Factors Diagnosis Diet Home Remedies Management Prevention Prognosis Related Conditions Stages Symptoms Treatment Types Causes & Risk FactorsCauses & Risk FactorsRelated ArticlesRisk Factors OverviewSudden CausesCauses of Hypertension with Low PulseAfter SurgeryPainGenetics **Causes & Risk Factors** Risk Factors Overview Sudden Causes Causes of Hypertension with Low Pulse After Surgery Pain Genetics **Causes & Risk Factors** Risk Factors Overview Sudden Causes Causes of Hypertension with Low Pulse After Surgery Pain Genetics DiagnosisDiagnosisRelated ArticlesDiagnosis OverviewNormal Blood PressureBlood Pressure ChartBlood Pressure ReadingsWide Pulse PressureHigh Blood Pressure Numbers **Diagnosis** Diagnosis Overview Normal Blood Pressure Blood Pressure Chart Blood Pressure Readings Wide Pulse Pressure High Blood Pressure Numbers **Diagnosis** Diagnosis Overview Normal Blood Pressure Blood Pressure Chart Blood Pressure Readings Wide Pulse Pressure High Blood Pressure Numbers DietDietRelated ArticlesDiet OverviewMorning DrinkBeet JuiceIncreased Blood Pressure After EatingDrinks to AvoidApple Cider VinegarTyramine Free FoodsCoffee and HypertensionLow Sodium Meals **Diet** Diet Overview Morning Drink Beet Juice Increased Blood Pressure After Eating Drinks to Avoid Apple Cider Vinegar Tyramine Free Foods Coffee and Hypertension Low Sodium Meals **Diet** Diet Overview Morning Drink Beet Juice Increased Blood Pressure After Eating Drinks to Avoid Apple Cider Vinegar Tyramine Free Foods Coffee and Hypertension Low Sodium Meals Home RemediesHome RemediesRelated ArticlesHome Remedies OverviewNatural Beta BlockersSupplementsEssential Oils **Home Remedies** Home Remedies Overview Natural Beta Blockers Supplements Essential Oils **Home Remedies** Home Remedies Overview Natural Beta Blockers Supplements Essential Oils ManagementManagementRelated ArticlesLower Resting Heart RateMorning Blood PressureTime to Reduce Blood PressureChecking Blood PressureExercises to AvoidBlood Pressure Lying DownBlood Pressure WatchesBlood Pressure and ExercisingWrist Blood Pressure MonitorsBlood Pressure Monitors **Management** Lower Resting Heart Rate Morning Blood Pressure Time to Reduce Blood Pressure Checking Blood Pressure Exercises to Avoid Blood Pressure Lying Down Blood Pressure Watches Blood Pressure and Exercising Wrist Blood Pressure Monitors Blood Pressure Monitors **Management** Lower Resting Heart Rate Morning Blood Pressure Time to Reduce Blood Pressure Checking Blood Pressure Exercises to Avoid Blood Pressure Lying Down Blood Pressure Watches Blood Pressure and Exercising Wrist Blood Pressure Monitors Blood Pressure Monitors PreventionPreventionRelated ArticlesPrevention Overview **Prevention** Prevention Overview **Prevention** Prevention Overview PrognosisPrognosisRelated ArticlesAge **Prognosis** Age **Prognosis** Age Related ConditionsRelated ConditionsRelated ArticlesViagraAnxietyCardiomegalyHyperthyroidismDehydrationMale Sexual HealthAsthmaDuring PregnancyKidney DiseaseGut HealthHeart Conditions **Related Conditions** Viagra Anxiety Cardiomegaly Hyperthyroidism Dehydration Male Sexual Health Asthma During Pregnancy Kidney Disease Gut Health Heart Conditions **Related Conditions** Viagra Anxiety Cardiomegaly Hyperthyroidism Dehydration Male Sexual Health Asthma During Pregnancy Kidney Disease Gut Health Heart Conditions StagesStagesRelated ArticlesStages OverviewPrehypertensionHypertensive Emergency **Stages** Stages Overview Prehypertension Hypertensive Emergency **Stages** Stages Overview Prehypertension Hypertensive Emergency SymptomsSymptomsRelated ArticlesSymptoms OverviewHeadachesWhat Does It Feel Like?DizzinessNose BleedsTirednessIn Females **Symptoms** Symptoms Overview Headaches What Does It Feel Like? Dizziness Nose Bleeds Tiredness In Females **Symptoms** Symptoms Overview Headaches What Does It Feel Like? Dizziness Nose Bleeds Tiredness In Females TreatmentTreatmentRelated ArticlesTreatment OverviewHow to Lower Diastolic Blood PressureLosartanHydrochlorothiazideAmlodipineTelmisartanLisinoprilFurosemideCarvedilolMetoprololBisoprololMedicationsSpironolactoneAldactoneStabilizing Blood PressurePropranololClonidine IRBenzonatatePerindoprilLopressorDiureticsLower Blood Pressure QuicklyACE InhibitorsDiovanVerapamilTenormin **Treatment** Treatment Overview How to Lower Diastolic Blood Pressure Losartan Hydrochlorothiazide Amlodipine Telmisartan Lisinopril Furosemide Carvedilol Metoprolol Bisoprolol Medications Spironolactone Aldactone Stabilizing Blood Pressure Propranolol Clonidine IR Benzonatate Perindopril Lopressor Diuretics Lower Blood Pressure Quickly ACE Inhibitors Diovan Verapamil Tenormin **Treatment** Treatment Overview How to Lower Diastolic Blood Pressure Losartan Hydrochlorothiazide Amlodipine Telmisartan Lisinopril Furosemide Carvedilol Metoprolol Bisoprolol Medications Spironolactone Aldactone Stabilizing Blood Pressure Propranolol Clonidine IR Benzonatate Perindopril Lopressor Diuretics Lower Blood Pressure Quickly ACE Inhibitors Diovan Verapamil Tenormin TypesTypesRelated ArticlesTypes OverviewHigh Diastolic Blood PressureLow Diastolic Blood PressureNocturnalLabileHigh vs Low Blood PressureHypertensive CrisisPortalReboundSupineLow ReninPostpartumVenousSevere PulmonaryRenalWhite CoatOcularPulmonaryNewborn **Types** Types Overview High Diastolic Blood Pressure Low Diastolic Blood Pressure Nocturnal Labile High vs Low Blood Pressure Hypertensive Crisis Portal Rebound Supine Low Renin Postpartum Venous Severe Pulmonary Renal White Coat Ocular Pulmonary Newborn **Types** Types Overview High Diastolic Blood Pressure Low Diastolic Blood Pressure Nocturnal Labile High vs Low Blood Pressure Hypertensive Crisis Portal Rebound Supine Low Renin Postpartum Venous Severe Pulmonary Renal White Coat Ocular Pulmonary Newborn **Novel treatment may help treat hard-to-control hypertension, global trial shows** A novel treatment for hard-to-control high blood pressure has shown strong results in a major global clinical trial. The Phase 3 Launch-HTN study found that lorundrostat, an aldosterone synthase inhibitor, safely and consistently lowered blood pressure in a large, diverse group of patients who had not responded to other medications. These findings mark a significant step forward in the development of the first targeted aldosterone synthase inhibitor for these conditions. Blood pressure refers to the force exerted by blood against the walls of the arteries. Hypertension, or high blood pressure, happens when this force is consistently higher than normal. Hypertension impactsone in three adultsglobally and significantly raises the risk of heart disease, heart attacks, and strokes. Resistant hypertensionis a form of high blood pressure that remains elevated despite a person taking three different blood pressure medications at their maximum recommended doses. Up to 15%of individuals with hypertension have abnormal regulation of aldosterone, a hormone that helps control blood pressure. When aldosterone levels are elevated due to this dysregulation, it can lead to hypertension. A new study,presentedat the 34th European Meeting on Hypertension and Cardiovascular Protection, shows that lorundrostat — a drug that inhibits aldosterone synthase — is both safe and effective for treating individuals with uncontrolled or resistant hypertension. The findings are yet to be published in a peer-reviewed journal. **How does lorundrostat treat hypertension?** Lorundrostat is specifically designed to lower aldosterone levels by targeting and inhibiting CYP11B2, the enzyme that drives its production. The study demonstrated consistent reductions in blood pressure across a large and diverse group of patients and represents the largest phase three trial to date for this class of treatment. Manish Saxena, MD, Clinical Co-Director of the William Harvey Heart Centre at Queen Mary University of London and Hypertension Specialist from Barts Health NHS Trust and the study’s lead Investigator, spoke toMedical News Today. “Despite available treatments, more than40%of adults with hypertension worldwide are not reaching their blood pressure goal. Aldosterone pathway plays important role in blood pressure regulation, and leads to blood pressure related complications such as heart failure and kidney problems. In the Launch-HTN trial we explored the safety and effectiveness of lorundostat, which belongs to a new class of drugs called aldosterone synthase inhibitors that block production of hormone aldosterone from the adrenal glands.” — Manish Saxena, MD “The Launch-HTN trial is the largest phase 3 hypertension study with a novel drug,” Saxena explained. “We tested lorundostat in a large, diverse patient population recruited globally and found that it has good safety profile and lowered blood pressure consistently in all of our patient groups.” “Hormone aldosterone secreted from adrenal glands in the body plays an important role in driving blood pressure. Now there is more awareness of dysregulated aldosterone secretion in patients with difficult to treat blood pressure. Lorundrostat blocks biosynthesis of hormone aldosterone in the body and helps reduce blood pressure.”— Manish Saxena, MD **Lorundrostat shows sustained efficacy in resistant hypertension** The Launch-HTN trial was a global, Phase 3 study that was randomized, double-blind, and placebo-controlled. It included adult participants whose blood pressure remained uncontrolled despite taking two to five antihypertensive medications. Designed to reflect real-world clinical practice, the trial used automated office blood pressure (AOBP) measurements and allowed participants to continue their existing treatments. Lorundrostat, administered once daily at a 50 mg dose, showed meaningful and sustained reductions in systolic blood pressure — dropping by 16.9 mmHg at Week 6 (a 9.1 mmHg reduction compared to placebo) and by 19 mmHg at Week 12 (an 11.7 mmHg reduction versus placebo). “The LAUNCH-HTN trial demonstrated blood pressure lowering efficacy and safety of lorundrostat in a very diverse patient group with uncontrolled and difficult to treat hypertension that were on background 2-5 blood pressure lowering medication. The blood pressure reduction observed was consistent across key sub-groups, significant and clinically meaningful.”— Manish Saxena, MD **A new tool to control hypertension** Two experts, not involved in the study, also spoke toMNT. Cheng-Han Chen, MD, board certified interventional cardiologist and medical director of the Structural Heart Program at MemorialCare Saddleback Medical Center in Laguna Hills, CA, noted that “aldosterone synthase inhibitors are a new class of drugs being studied for the treatment of hypertension.” “This trial found that lorundrostat, one of these new types of drugs, was safe and effective for patients with uncontrolled or resistant hypertension. This puts us one step closer to having another tool in our arsenal for patients with difficult to control blood pressure despite being on multiple medications,” Chen explained. “Many patients have high blood pressure that are not under control with multiple classes of medications. By having another class of blood pressure medications at our disposal, we will better be able to reduce rates of hypertension in our population and improve health outcomes.” — Cheng-Han Chen, MD **Needing fewer medications to treat hypertension** Rigved Tadwalkar, MD, FACC, consultative cardiologist and director of Digital Transformation Pacific Heart Institute in Santa Monica, CA toldMNTthat “this is a meaningful step forward.” “We still see far too many patients with uncontrolled or resistant hypertension, even when they’re on three, four, sometimes five medications. The reality is that for a significant subset of these patients, aldosterone is driving the problem and until now, we haven’t had a way to target that mechanism directly in a safe, practical way,” Tadwalkar explained. “Lorundrostat appears to change that. It inhibits aldosterone synthesis at the enzymatic level, and based on this trial, it does so with a good safety profile and consistent efficacy across a diverse population. The blood pressure reductions– nearly 17 mmHg at 6 weeks and close to 19 mmHg at 12– are significant, especially when you consider that these were already heavily treated patients. That kind of additional drop is not something we usually see at this stage of therapy.” — Rigved Tadwalkar, MD, FACC “Since patients stayed on their background medications, these results feel more clinically relevant than more tightly controlled washout studies,” Tadwalkar added. “It’s a welcome addition to the field, even as we continue to see the limitations of existing therapies, including newer device-based approaches like renal denervation.” Tadwalkar said that lorundrostat had potential to make a real difference in patients’ lives. “If lorundrostat becomes widely available, it could offer a new option for patients who’ve exhausted standard pathways. For people living with resistant hypertension, many of whom are already dealing with co-morbidities like kidney disease or heart failure, having another tool, especially one that targets the underlying hormonal dysregulation, could make a real difference in long-term outcomes,” he said. Saxena said that once lorundostat becomes commercially available, it could become a novel treatment option for hypertension for many patients. Tadwalkar continued by noting that “at the population level, we’re still facing a huge burden from poorly controlled blood pressure.” He said untreated hypertension was a major contributor to chronic diseases and cardiovascular problems. “A drug like this, if used properly, could help narrow that treatment gap. It’s certainly not a silver bullet, but it’s a step toward more personalized, mechanism-specific care. This is something the hypertension field has needed for a long time.” — Rigved Tadwalkar, MD, FACC Hypertension Clinical Trials / Drug Trials Drugs Share this article **Latest news** Eating more berries each day could boost healthy aging, study finds Plant compound in nuts, veggies, and fruit may lower diabetes, heart disease risk MIND diet could lower dementia risk no matter when in life you start it Is autism on the rise? Expert fact-checks recent claims 2 servings of mangoes a day may support postmenopausal heart health **Related Coverage** Medical Myths: All about hypertensionIn this edition of Medical Myths, we challenge some common misconceptions that surround hypertension. We cover medication, risk factors, salt, and…READ MORE In this edition of Medical Myths, we challenge some common misconceptions that surround hypertension. We cover medication, risk factors, salt, and… In this edition of Medical Myths, we challenge some common misconceptions that surround hypertension. We cover medication, risk factors, salt, and… The DASH diet: How does it work?Medically reviewed byKatherine Marengo LDN, R.D.The main aim of the DASH diet is to manage blood pressure, but it can also help people maintain their weight and boost their overall health. Find out…READ MORE The main aim of the DASH diet is to manage blood pressure, but it can also help people maintain their weight and boost their overall health. Find out… The main aim of the DASH diet is to manage blood pressure, but it can also help people maintain their weight and boost their overall health. Find out… In Conversation: Is intermittent fasting actually bad for your heart?In this episode, Medical News Today discusses whether intermittent fasting and time-restricted eating practices are safe for the heart, especially in…READ MORE In this episode, Medical News Today discusses whether intermittent fasting and time-restricted eating practices are safe for the heart, especially in… In this episode, Medical News Today discusses whether intermittent fasting and time-restricted eating practices are safe for the heart, especially in… In Conversation: What makes a diet truly heart-healthy?In this episode of our podcast, Feature Editor Maria Cohut discusses matters related to diet and heart health with Dr. Oyinlola Oyebode from Queen…READ MORE In this episode of our podcast, Feature Editor Maria Cohut discusses matters related to diet and heart health with Dr. Oyinlola Oyebode from Queen… In this episode of our podcast, Feature Editor Maria Cohut discusses matters related to diet and heart health with Dr. Oyinlola Oyebode from Queen… In Conversation: Can we really ‘outrun the Grim Reaper’?In this episode of our podcast, editors Maria Cohut and Yasemin Nicola Sakay discuss how extreme exercise may help people live longer with Michael…READ MORE In this episode of our podcast, editors Maria Cohut and Yasemin Nicola Sakay discuss how extreme exercise may help people live longer with Michael… In this episode of our podcast, editors Maria Cohut and Yasemin Nicola Sakay discuss how extreme exercise may help people live longer with Michael… About Us Contact Us Terms of Use Privacy Policy Privacy Settings Advertising Policy Health Topics Health Hubs Medical Affairs Content Integrity Newsletters Your Privacy Choices © 2025 Healthline Media UK Ltd, London, UK. All rights reserved. MNT is the registered trade mark of Healthline Media. Healthline Media is an RVO Health Company. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional.See additional information. OUR BRANDS"}