{"id": 1867, "name": "American Legislative Exchange Council (ALEC)", "domain": "alec.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://alec.org/press-release/alec-applauds-president-trumps-executive-order-to-dissolve-the-department-of-education/", "title": "Alec Applauds President Trumps Executive Order To Dissolve The Department Of Education", "content": "**ALEC Applauds President Trump’s Executive Order to Dissolve the Department of Education** **ALEC unveils new model resolution and letter campaign to support students and teachers by returning power to the states.** Arlington, VA– The American Legislative Exchange Council (ALEC) announced their support today for President Trump’s Executive Order to dissolve the Department of Education. “President Trump’s bold vision to shrink the federal bureaucracy within the Department of Education and restore authority to the states marks a long-overdue return of constitutional order,” said ALEC CEO Lisa B. Nelson. “This is the natural, unstoppable evolution of the parental empowerment movement sparked amid the pandemic lockdowns. The states are ready for it, and they’ve been clamoring for it. This executive order is a fundamental step forward in the American education revolution. We fully support President Trump’s leadership in eliminating wasteful, bureaucratic mandates that push political agendas and divert taxpayer funds away from students. By putting the states back in charge of this funding, students, families, and teachers will be put first – rather than the bloated bureaucracy in Washington, DC.” A constant theme of President Trump’s 2024 campaign, the dissolution of the Department of Education will restore decision-making power over America’s schools to the states. This move aims to eliminate costly federal bureaucracy, reduce inefficiencies, and refocus education policy on local needs—ultimately improving student outcomes. On March 11, 2025, the ALEC Board of Directors officially adopted a model resolution endorsing this move. Read the ALEC Model Resolution Supporting Devolution of Power from the U.S. Department of Education to the States. “ALEC believes that policymakers should empower parents, not government bureaucrats, to direct their child’s education,” said West Virginia Senator and ALEC National Chair Patricia Rucker. “For decades, the U.S. Department of Education has steadily increased red tape and imposed one-size-fits-all mandates that neglect the unique needs of individual students. ALEC fully supports President Trump’s mission to end this wasteful bureaucracy and return education authority back to where it belongs – the states.” Today, ALEC alsolaunched a coalition and state legislator letter campaignadvocating for the dissolution of the Department of Education, inviting its 2,000+ members to sign. This initiative builds on ALEC’s track record of successful legislative letter campaigns, including letters in support of the Tax Cuts and Jobs Act (TCJA) as well as a letter supporting Israel and condemning the Hamas terrorist massacre on October 7, 2023. Read the new ALEC letter. “The U.S. Department of Education has overseen decades of stagnation in student achievement,” said Pennsylvania State Representative and ALEC Education & Workforce Development Task Force Chair Barbara Gleim. “Since the Nation’s Report Card began tracking 4th and 8th grade reading scores in 1992, average performance has declined by two points despite the department spending over $1 trillion. ALEC’s Education & Workforce Development Task Force strongly supports President Trump and Secretary McMahon’s bold efforts to dismantle this ineffective agency and restore control to states and parents, where it belongs.” Published:March 20, 2025 Issues:Education Categories:Education,Press Releases White House Issues New Executive Orders on K-12, Higher Education, and Workforce DevelopmentThis week, President Trump signed a series of executive orders (EOs) addressing numerous aspects of K-12 and higher education. The new EOs cover the role of artificial intelligence in education,… This week, President Trump signed a series of executive orders (EOs) addressing numerous aspects of K-12 and higher education. The new EOs cover the role of artificial intelligence in education,… This week, President Trump signed a series of executive orders (EOs) addressing numerous aspects of K-12 and higher education. The new EOs cover the role of artificial intelligence in education,… Myths vs. Facts: Closing the Federal Education BureaucracyLast month, President Trump signed his Executive Order directing Secretary McMahon to begin the process of closing the Department of Education, returning education authority back to the states. Since then,… Last month, President Trump signed his Executive Order directing Secretary McMahon to begin the process of closing the Department of Education, returning education authority back to the states. Since then,… Last month, President Trump signed his Executive Order directing Secretary McMahon to begin the process of closing the Department of Education, returning education authority back to the states. Since then,… How States Should Manage Education: Andrew Handel on NewsTalk STLAndrew Handel, ALEC Education and Workforce Development Task Force Director, recently discussed the Trump Administration’s executive to dissolve the Department of Education with… Andrew Handel, ALEC Education and Workforce Development Task Force Director, recently discussed the Trump Administration’s executive to dissolve the Department of Education with… Andrew Handel, ALEC Education and Workforce Development Task Force Director, recently discussed the Trump Administration’s executive to dissolve the Department of Education with… Returning Education Policy And Funding To The States: Jonathan Williams on American Radio JournalLast week, President Donald Trump signed a historic Executive Order instructing the Secretary of Education, Linda McMahon, to shift the funding of the United States Department of… Last week, President Donald Trump signed a historic Executive Order instructing the Secretary of Education, Linda McMahon, to shift the funding of the United States Department of… Last week, President Donald Trump signed a historic Executive Order instructing the Secretary of Education, Linda McMahon, to shift the funding of the United States Department of… April CEO UpdateA lot has happened since I last wrote to you. President Donald J. Trump’s executive order to close the U.S. Department of Education emerged not just as a policy shift… A lot has happened since I last wrote to you. President Donald J. Trump’s executive order to close the U.S. Department of Education emerged not just as a policy shift… A lot has happened since I last wrote to you. President Donald J. Trump’s executive order to close the U.S. Department of Education emerged not just as a policy shift… States Are Chomping At The Bit To Overhaul America’s Broken Education System: Lisa B. Nelson and Patricia Rucker in The Daily CallerALEC CEO Lisa B. Nelson and ALEC National Chair & West Virginia State Senator Patricia Rucker co-authored an op-ed in The… ALEC CEO Lisa B. Nelson and ALEC National Chair & West Virginia State Senator Patricia Rucker co-authored an op-ed in The… ALEC CEO Lisa B. Nelson and ALEC National Chair & West Virginia State Senator Patricia Rucker co-authored an op-ed in The… How Trump’s Executive Order Could Reshape America’s Schools: Andrew Handel on Rod & GregIn a significant policy move, the Trump administration has announced plans to dismantle the Department of Education, shifting responsibilities to the states. ALEC Education… In a significant policy move, the Trump administration has announced plans to dismantle the Department of Education, shifting responsibilities to the states. ALEC Education… In a significant policy move, the Trump administration has announced plans to dismantle the Department of Education, shifting responsibilities to the states. ALEC Education… Trump’s Education Overhaul Empowers States to Lead the Way: Jonathan Williams on The Hugh Hewitt ShowArlington, VA—President Donald Trump’s executive order, signed Thursday night to dismantle the Department of Education has sparked a national conversation about the future of schooling. ALEC President and Chief Economist… Arlington, VA—President Donald Trump’s executive order, signed Thursday night to dismantle the Department of Education has sparked a national conversation about the future of schooling. ALEC President and Chief Economist… Arlington, VA—President Donald Trump’s executive order, signed Thursday night to dismantle the Department of Education has sparked a national conversation about the future of schooling. ALEC President and Chief Economist… Restoring Decision-Making Power Over America’s Schools To The States: ALEC In The News RoundupArlington, VA—On March 20, 2025, President Donald Trump signed an executive order to dismantle the U.S. Department of Education, signaling a dramatic shift in federal education policy. In this new… Arlington, VA—On March 20, 2025, President Donald Trump signed an executive order to dismantle the U.S. Department of Education, signaling a dramatic shift in federal education policy. In this new… Arlington, VA—On March 20, 2025, President Donald Trump signed an executive order to dismantle the U.S. Department of Education, signaling a dramatic shift in federal education policy. In this new… ALEC Legislator Letter: Permanently Extending the Tax Cuts and Jobs Act of 20171 day ago States Realize the Importance of Price Transparency in HealthcareBrooklyn Roberts/2 days ago High-Tax States Shouldn’t Socialize Their Policy Costs: Jonathan Williams in Forbes MagazineJonathan Williams/6 days ago 2025 State Wins and the One Big Beautiful Bill: Jonathan Williams on The Hugh Hewitt ShowJonathan Williams/1 week ago ALEC Policy Champions Reduce Agency Overreach in OklahomaAlan Jernigan/1 week ago Arkansas Ranks Among Top Ten States: Rich States, Poor States on KATV NewsLars Dalseide/1 week ago States That Work: A Labor Policy Roadmap Across AmericaAlan Jernigan/1 day ago Rich States, Poor States 18th EditionJonathan Williams/2 months ago 2024 ALEC Annual Report2 months ago Energy Affordability Report, 4th EditionJake Morabito/2 months ago About ALEC Leadership State Chairs Staff Alumni Contact Public Reporting Privacy Policy Work at ALEC Issues Task Force Model Policy Blog Policy Centers Publications Media and Public Affairs Press Releases ALEC Media Policy Facebook X (Twitter) Instagram LinkedIn YouTube Join Donate Meetings © 2025 American Legislative Exchange Council About Meetings Publications Articles Log In Join Us Donate"}