{"id": 294, "name": "Crooks and Liars", "domain": "crooksandliars.com", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://blueamerica.crooksandliars.com/2025/04/26/the-people-who-got-us-into-this-mess-wont-be-the-ones-to-get-us-out-but-nick-uniejewski-will/", "title": "The People Who Got Us Into This Mess Wont Be The Ones To Get Us Out But Nick Uniejewski Will", "content": "**The People Who Got Us Into This Mess Won’t Be The Ones To Get Us Out… But Nick Uniejewski Will** Nick Uniejewski just announced his campaign for the Illinois state Senate seat on the Northside of Chicago, a blue district wasted by a longtime do-nothing incumbent, Sara Feigenholtz. Nick’s an old comrade of ours from his work on Marie Newman’s campaigns. He told Chicago voters that “Right now, we have a president who pits people against each other and encourages hate and division and an incumbent Senator who has faced numerous calls for her resignation because of her frequent racist and Islamophobic remarks. We deserve better. We, as Democrats, cannot expect to escape the mess our party is in by electing people who seek to divide rather than unite. I’m running for the state Senate to bring people together and help build people up-– no matter where they live, who they love, or where they were born. We need new energetic leadership so we can get back to making this a fabulous place to live, work, and play for everyone. I believe we can have a better future if we elect leaders who aren’t afraid to fight for that future.” Please consider . If he wins he’d be only the second openly gay person to serve in the Illinois Senate, and the first openly gay state Senator to represent one of the largest LGBTQ+ communities in the country, Northalsted. **Progress Means Building— Not Just Talking About It-by Nick Uniejewski** I’m running against the incumbent in the Democratic primary. In fact, that seat’s been locked down for decades. My opponent has served in Springfield for 30 years without ever facing a primary. And the 6th District hasn’t seen a contested election since 1972.That’s over 50 years without a real choice. I’m running because that’s not democracy— and it’s certainly not progress. I’m not interested in being a career politician. I’m a community organizer, a policy nerd, and a public transit rider. I worked alongside former Congresswoman Marie Newman, fighting to put people— not corporations— at the center of politics. And I’m running for State Senate because we need to get serious about the things that make life better for working people in Illinois: housing, transit, and democracy that can’t be bought. Housing: Affordability Is Not a Luxury We’re in a housing crisis— let’s stop pretending otherwise. Rents are rising faster than wages. Families are being priced out of their neighborhoods. We all should be able to live in the communities we love without the fear of being priced out. As a Senator, I’ll push for: Legalizing multi-family housing and accessory dwelling units (ADUs) so we can build more homes where people want to live Reforming the zoning and permitting process so it serves people, not just developers or NIMBY interests Prioritizing state investments in affordable housing— not giveaways to luxury condos Transit: Safe, Reliable, and Built for the Future I don’t own a car. I bike. I walk. I take the CTA and Metra. And like many of you, I’ve waited in the freezing rain wondering if the bus is ever coming. We need a 21st-century transit system that reflects our values: clean, accessible, and equitable. I’ll fight for: Real, recurring funding for CTA, Metra, and Pace— without balancing the budget on riders’ backs Protected bike and bus lanes to speed up commutes and reduce car dependence Regional coordination that treats transit like the public good it is—not just a budget line to cut **Recent Posts** \"Moms 4 Liberty\" is Daughters of the Confederacy 2.0. Just more white women stanning for their pathetic Christian nationalist husbands.pic.twitter.com/MRwo5HBfxZ Sorry,@Moms4Liberty, you don't get a do-over on a front page, fan-boy Hitler quote.You've told us who you are. It's important we listen.https://t.co/oZVwdBYun6 **Blue America is**"}