{"id": 1991, "name": "Honest Reporting", "domain": "honestreporting.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://honestreporting.com/nytimes-publishes-coexistence-advocate-who-called-oct-7-provoked-and-compared-hamas-to-holocaust-survivors/", "title": "Nytimes Publishes Coexistence Advocate Who Called Oct 7 Provoked And Compared Hamas To Holocaust Survivors", "content": "Home About UsThe Photo that Started it AllSubscribeContact UsCareers at HonestReporting The Photo that Started it All Subscribe Contact Us Careers at HonestReporting The Photo that Started it All Subscribe Contact Us Careers at HonestReporting News Critiques Exposés Take Action In the Media Videos Educational Articles Home About UsThe Photo that Started it AllSubscribeContact UsCareers at HonestReporting The Photo that Started it All Subscribe Contact Us Careers at HonestReporting The Photo that Started it All Subscribe Contact Us Careers at HonestReporting News Critiques Exposés Take Action In the Media Videos Educational Articles Home About UsThe Photo that Started it AllSubscribeContact UsCareers at HonestReporting The Photo that Started it All Subscribe Contact Us Careers at HonestReporting The Photo that Started it All Subscribe Contact Us Careers at HonestReporting Videos News Critiques Mapped: Hamas’ Tunnels of Terror Exposés Take Action In the Media Educational Articles Donate Send Us Your Tips With your support we continue to ensure media accuracy **NYTimes Platforms ‘Progressive’ Palestinian Activist Who Called Oct 7 ‘Provoked’ and Compared Hamas to Holocaust Survivors** Rachel O'Donoghue March 20, 2025 2:34 pm Reading time:3minutes The documentaryNo Other Land, a joint Israeli-Palestinian production that won an Academy Award earlier this month, is not “just a film”—at least according to aguest essayinThe New York Timesby Rania Batrice and Libby Lenkinski. Batrice, described by The Times as a Palestinian-American activist and “strategist for progressive causes,” and Israeli-American activist Lenkinski, argue that No Other Land is much more than a movie—it’s a “statement, a challenge, and an act of defiance.” Batrice and Lenkinski argue that the film’s Israeli and Palestinian creators are “defying the zero-sum logic that dominates the region” by working together. Yet, as they acknowledge, No Other Land has faced criticism from both Israelis and Palestinians. Among the latter, the Boycott, Divestment, and Sanctions (BDS) campaign condemned Palestinian activist Basel Adra for collaborating with Israeli filmmaker Yuval Abraham. According to Batrice and Lenkinski, this opposition has “undermined the joint artistic work that directly criticizes the Israeli government.” Oscar-winning Israeli journalist Yuval Abraham and Palestinian activist Basel Adra claim to show “life under occupation” in Masafer Yatta, yet their doc distorts the area’s true history. When you start with a pre-written script, propaganda wins out over facts.pic.twitter.com/7z2vLjp2Ev — HonestReporting (@HonestReporting)March 7, 2025 This, ultimately, is the core message of their essay: No Other Land presents a model of collaboration in which Israeli activists align with Palestinian efforts to challenge Israel’s existence—what Batrice and Lenkinski euphemistically call “co-resistance.” It’s a charming spin. After all, “resistance” is precisely the term Hamas uses for every suicide bombing and stabbing attack it orchestrates against Israeli civilians. Batrice and Lenkinski now attempt to repackage the term, stripping it of its violent connotations. See? Israelis are “resisting” too. It’s non-violent. It’s peaceful. It’s art. “If there is any hope for the future, it lies precisely in these partnerships, in collaboration, and in what the filmmakers aptly call ‘co-resistance,’” they write. There’s just one problem. One of the essay’s authors had a rather different interpretation of “resistance” on October 7, when Hamas terrorists, aided by Gazan civilians, invaded Israel, massacred over 1,200 people, and dragged 251 more back to Gaza as hostages. On that day—the morning Israelis woke to hundreds of rockets and videos flooding social media of men, women, and children being hunted down, shot, stabbed, and bludgeoned—Rania Batrice was busy amplifying Hamas propaganda. She shared footage of terrorists paragliding into Israel and opening fire, complete with a text overlay likening them to Jews smuggling weapons into Nazi ghettos during the Holocaust. Rania Batrice posted a video of Hamas’ Oct. 7 attacks that described terrorists attacking civilians as “resistance… invading illegal settlements housing illegal settlers.” Now this “progressive” Palestinian American activist is writing in@nytimes. 🧵pic.twitter.com/7COOZ5XMV7 — HonestReporting (@HonestReporting)March 17, 2025 And 24 hours later—on October 8, when even the most committed apologists could no longer claim ignorance about the scale of the atrocities—Batrice doubled down, declaring that anyone who described the attack as “unprovoked” was “part of the problem.” The essay calls No Other Land a “challenge”—and in a way, that’s true. It is certainly a challenge to take seriously a film thatdistorts decades of legal rulings and historical factsso thoroughly that its inclusion in the Academy’s documentary category was an insult in itself. But the essay itself presents an even greater challenge: How does one reconcile its co-author’s supposed belief in the unity of Israelis and Palestinians when on the day of the bloodiest massacre in Israeli history, she was celebrating? Liked this article? Follow HonestReporting onTwitter,Facebook,InstagramandTikTokto see even more posts and videos debunking news bias and smears, as well as other content explaining what’s really going on in Israel and the region. Get updates direct to your phone. Join ourWhatsAppandTelegramchannels! **American Campuses in the Heat of the Israeli-Palestinian Conflict** **▶ BBC Complains About Lack of Access While Ignoring Hamas Lies** **Media Give Greta Thunberg a Celebrity Welcome at Paris Airport** **From LA to Gaza, With Violence: Palestinian Flags, Molotov Cocktails, and a Media Blackout** **CBS Tries to Embarrass the Gaza Humanitarian Foundation and Fails** **The New York Times’ Anti-Israeli Tunnel Vision** About Us Subscribe Donate About Us Subscribe Donate Activity Reports Governance Careers Activity Reports Governance Careers Contact Us Terms Privacy Policy Contact Us Terms Privacy Policy HonestReporting is a USA non-profit 501(c)(3) charitable organization as recognized by the Internal Revenue Service (IRS). EIN/Tax ID# 06-1611859. Your generous tax-deductible donations make a real difference. © 2025 All Rights Reserved to HonestReporting Accessibility Tools Increase TextIncrease Text Decrease TextDecrease Text GrayscaleGrayscale High ContrastHigh Contrast Negative ContrastNegative Contrast Light BackgroundLight Background Links UnderlineLinks Underline Readable FontReadable Font ResetReset"}