{"id": 1463, "name": "Vallejo Times-Herald", "domain": "timesheraldonline.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.timesheraldonline.com/2024/09/10/september-12-vallejo-vacaville-arts-and-entertainment-source-mira-theatre-debuts-new-play-last-call-at-club-vibe/", "title": "September 12 Vallejo Vacaville Arts And Entertainment Source Mira Theatre Debuts New Play Last Call At Club Vibe", "content": "e-Edition e-Edition NewsLocal NewsNews AlertsAmerican CanyonBeniciaVallejoCrime and Public SafetyCourtsBusinessBest ReviewsMarijuanaEducationHealthHousingTransportationCalifornia News Local News News Alerts American Canyon Benicia Vallejo Crime and Public Safety Courts Business Best Reviews Marijuana Education Health Housing Transportation California News Local News News Alerts American Canyon Benicia Vallejo Crime and Public Safety Courts Business Best Reviews Marijuana Education Health Housing Transportation California News SportsSportsLocal SportsHigh School SportsAthlete of the WeekCal MaritimeVallejo AdmiralsOakland AthleticsRaidersSan Francisco 49ersSan Francisco GiantsSan Jose SharksGolden State Warriors Sports Local Sports High School Sports Athlete of the Week Cal Maritime Vallejo Admirals Oakland Athletics Raiders San Francisco 49ers San Francisco Giants San Jose Sharks Golden State Warriors Sports Local Sports High School Sports Athlete of the Week Cal Maritime Vallejo Admirals Oakland Athletics Raiders San Francisco 49ers San Francisco Giants San Jose Sharks Golden State Warriors LifestyleLifestyleEntertainmentRestaurants Food and DrinkHome & GardenMoviesComicsPuzzlesEvents Lifestyle Entertainment Restaurants Food and Drink Home & Garden Movies Comics Puzzles Events Lifestyle Entertainment Restaurants Food and Drink Home & Garden Movies Comics Puzzles Events ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary OpinionOpinionColumnistsEditorialsLetters to the Editor Opinion Columnists Editorials Letters to the Editor Opinion Columnists Editorials Letters to the Editor Best of 2024 Magazine AdvertisingAdvertise with UsA&E SourceLocal GuideJobsReal EstateToday’s AdsSpecial SectionsSponsored ContentPublic Notices Advertise with Us A&E Source Local Guide Jobs Real Estate Today’s Ads Special Sections Sponsored Content Public Notices Advertise with Us A&E Source Local Guide Jobs Real Estate Today’s Ads Special Sections Sponsored Content Public Notices Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Subscribe Log In Logout Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print Subscribe Log In Sign up for email newsletters Subscribe Log In e-Edition e-Edition News Sports Lifestyle Obituaries Place Obit Opinion Advertise e-Edition A&E Source Best of 2024 Magazine Trending: Officer Matt Bowen remembered for his kindness, dedication and devotion to family, community Local activities guide September 12 Vallejo/Vacaville Arts and Entertainment Source: Mira Theatre debuts new play “Last Call at Club Vibe” Bill targets high rent deposits Wilderness bill reintroduced **September 12 Vallejo/Vacaville Arts and Entertainment Source: Mira Theatre debuts new play “Last Call at Club Vibe”** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print Chocolate Rainbow Theatre Company, in partnership with Mira Theatre Guild, will debut “Last Call at Club Vibe” this weekend, a new play that shines a spotlight on the vanishing spaces for LGBTQ+ communities in America. “Last Call at Club Vibe” takes audiences on an emotional journey through the history and significance of the city’s first lesbian bar— and perhaps its last. The play explores the cultural and historical disappearance of lesbian and gay bars, which have long served as vital gathering places for the LGBTQ+ community. These spaces have historically offered refuge, celebration and identity in a world that has often marginalized them. Written and performed by the talented members of Chocolate Rainbow Theatre Company, directed by award-winning comedian Julia Jackson, and produced by Meja Pannell-Tyehimba, this production offers an authentic, heartfelt narrative that reflects both the loss and the resilience of LGBTQ+ spaces across America. “Through ‘Last Call at Club Vibe,’ we’re not just putting on a play, we’re calling attention to a critical cultural shift and asking audiences to reflect on what is being lost,” said Pannell-Tyehimba, in a release for the production. “These spaces are not just bars, they are community centers, safe havens and vital cultural institutions.” This evocative story is brought to life by a diverse cast of performers who reflect the spirit and mission of Chocolate Rainbow Theatre Company (CRTC)—artists who identify as POC, LGBTQ+AI, and their Allies. Director Julia Jackson brings her unique blend of comedy and heart to this story, offering a fresh lens for audiences to connect with the characters and themes. Jackson’s accolades as a comedian and storyteller ensure this production is as entertaining as it is meaningful. “Last Call at Club Vibe” is made possible in part by the Vallejo Arts Fund and marks a significant cultural moment for Vallejo’s performing arts scene. As gentrification, digital culture, and changing social landscapes contribute to the closure of iconic LGBTQ+ establishments, this play asks urgent questions about community, identity and the need for safe, welcoming spaces. IF YOU GO: WHAT:Last Call at Club Vibe WHEN:September 13 and 14 at 7:30 p.m., September 15 at 3 p.m. WHERE:Mira Theatre, 51 Daniels Avenue, Vallejo. TICKETS:$20-30. Tickets are available for purchase online at miratheatreguild.org or day-of at the Mira Theatre Guild’s Box Office. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print **RevContent Feed** **Most Popular** Federal Court confirms trust status for Scotts Valley TribeFederal Court confirms trust status for Scotts Valley Tribe **Federal Court confirms trust status for Scotts Valley Tribe** **Federal Court confirms trust status for Scotts Valley Tribe** Hundreds gather in San Jose, Oakland and San Francisco to protest ICEHundreds gather in San Jose, Oakland and San Francisco to protest ICE **Hundreds gather in San Jose, Oakland and San Francisco to protest ICE** **Hundreds gather in San Jose, Oakland and San Francisco to protest ICE** Arts/Entertainment Source: Jump Off supports new musicians in VallejoArts/Entertainment Source: Jump Off supports new musicians in Vallejo **Arts/Entertainment Source: Jump Off supports new musicians in Vallejo** **Arts/Entertainment Source: Jump Off supports new musicians in Vallejo** ‘All time great’ Sly Stone dies at 82'All time great' Sly Stone dies at 82 **‘All time great’ Sly Stone dies at 82** **‘All time great’ Sly Stone dies at 82** Suspect arrested in attempted murder and sexual assault caseSuspect arrested in attempted murder and sexual assault case **Suspect arrested in attempted murder and sexual assault case** **Suspect arrested in attempted murder and sexual assault case** Solano Supes ask Suisun City to halt California Forever annexation talksSolano Supes ask Suisun City to halt California Forever annexation talks **Solano Supes ask Suisun City to halt California Forever annexation talks** **Solano Supes ask Suisun City to halt California Forever annexation talks** Suisun City manager declines bonus amid budget crunchSuisun City manager declines bonus amid budget crunch **Suisun City manager declines bonus amid budget crunch** **Suisun City manager declines bonus amid budget crunch** Vallejo Seaweed win again at homeVallejo Seaweed win again at home **Vallejo Seaweed win again at home** **Vallejo Seaweed win again at home** **More in Things To Do** Camp at a Colorado hop farm this summer, and enjoy beers onsite **Camp at a Colorado hop farm this summer, and enjoy beers onsite** **Camp at a Colorado hop farm this summer, and enjoy beers onsite** Want to grow your own rice? A step-by-step guide for adventurous gardeners **Want to grow your own rice? A step-by-step guide for adventurous gardeners** **Want to grow your own rice? A step-by-step guide for adventurous gardeners** This easy tortellini salad is easy on the pocketbook, too **This easy tortellini salad is easy on the pocketbook, too** **This easy tortellini salad is easy on the pocketbook, too** Brian Wilson, Beach Boys visionary leader and summer’s poet laureate, dies at 82 **Brian Wilson, Beach Boys visionary leader and summer’s poet laureate, dies at 82** **Brian Wilson, Beach Boys visionary leader and summer’s poet laureate, dies at 82** 2024 September 10 Subscribee-EditionSign Up For NewslettersPrint SubscribeWeb Subscribe e-Edition Sign Up For Newsletters Print Subscribe Web Subscribe e-Edition Sign Up For Newsletters Print Subscribe Web Subscribe Contact UsWork With UsSpecial SectionsPrivacy PolicyAccessibilitySitemap Work With Us Special Sections Privacy Policy Accessibility Sitemap Work With Us Special Sections Privacy Policy Accessibility Sitemap Advertise With UsMediaNews Group AdvertisingToday’s Ads MediaNews Group Advertising Today’s Ads MediaNews Group Advertising Today’s Ads Public NoticesLocal GuideJobsReal Estate Local Guide Jobs Real Estate Local Guide Jobs Real Estate Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}