{"id": 617, "name": "Grist", "domain": "grist.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://grist.org/indigenous/in-californias-largest-landback-deal-the-yurok-tribe-reclaims-sacred-land-around-the-klamath-river/", "title": "In Californias Largest Landback Deal The Yurok Tribe Reclaims Sacred Land Around The Klamath River", "content": "$10/mo $15/mo Other FollowFollow us on FacebookFollow us on TwitterFollow us on InstagramFollow us on YouTubeFollow us on BlueskyGet your weekly dose of good climate news to your inboxEmail AddressSubmitΔ Follow us on Facebook Follow us on Twitter Follow us on Instagram Follow us on YouTube Follow us on Bluesky **Get your weekly dose of good climate news to your inbox** Δ Follow us on Facebook Follow us on Twitter Follow us on Instagram Follow us on YouTube Follow us on Bluesky **Get your weekly dose of good climate news to your inbox** Δ Donate Donate **Menu** A nonprofit, independent media organization dedicated to telling stories of climate solutions and a just future. **Search** **Go To** About Support Us Newsletters Advertise Become a Member Events The Grist 50 Imagine 2200 Cli-Fi Pitch Us Local News **Topics** Politics Energy Equity Solutions All Topics **** Follow us on Facebook Follow us on Twitter Follow us on Instagram Follow us on YouTube Follow us on Bluesky **Get your weekly dose of good climate news to your inbox** Δ **In California’s largest landback deal, the Yurok Tribe reclaims sacred land around Klamath River** **\"It's our job, our inherent right, to take care of the Klamath Basin and its river.”** More than 17,000 acres around the Klamath River in Northern California, including the lower Blue Creek watershed, have returned to the Yurok Tribe, completing the largest landback deal in California history. The Yurok people have lived, fished, and hunted along the Klamath for millennia. But when the California gold rush began, the tribe lost 90 percent of its territory. For the last two decades, the Yurok Tribe has been working with the nonprofit Western Rivers Conservancy to get its land back. The 17,000 acres composes the final parcel of a $56 million, 47,097-acre land transfer that effectively doubles the current land holdings of the Yurok Tribe. The tribe has already designated the land as a salmon sanctuary and community forest and plans to eventually put it into a trust and care for it in perpetuity. Grist thanks its sponsors.Become one. To support our nonprofit environmental journalism, please considerdisabling your ad-blockerto allow ads on Grist.Here's How “No words can describe how we feel knowing that our land is coming back to the ownership of the Yurok people,” said Joseph James, the chairman of the Yurok Tribal Council, who is from the village of Shregon on the Klamath River. “The Klamath River is our highway. It is also our food source. And it takes care of us. And so it’s our job, our inherent right, to take care of the Klamath Basin and its river.” The land transfer comes just months after the utility PacifiCorp removed four dams on the Klamath River, thelargest dam removal project in U.S. history. The removal of the dams enabled coho and Chinook salmon that had been blocked to finally swim upstream to spawn for the first time in more than a century. The deal is also part of a broader push to revitalize the Klamath River Basin, where water diversions and pollution have long strained the wildlife and the Indigenous peoples who rely on them. Josh Kling, conservation director at the Western Rivers Conservancy, said the nonprofit acquired the land in pieces from Green Diamond, a timber company, and paid for it using a combination of private funding, tax credits, carbon credit sales, low-interest loans, revolving loans, federal revolving loan programs, and settlement funds. The project was also partially funded by the state of California, whichreturned 2,800 acres of state landalong the Klamath River to the Shasta Indian Nation last year. Kling said the 47,000 acres of land returned to the Yurok Tribe includes redwood forests that help protect against climate change and protect crucial habitat for birds such as the marbled murrelet, Humboldt marten. and northern spotted owl, just as the trees were becoming ripe for a fresh round of logging. Grist thanks its sponsors.Become one. To support our nonprofit environmental journalism, please considerdisabling your ad-blockerto allow ads on Grist.Here's How “The project was really timely to get in there before a new round of timber harvest and the associated road building,” said Kling. He is particularly excited about how Blue Creek, a cold-water tributary just 16 miles from the mouth of the river, is now protected because of how the tributary provides an essential place for salmon and steelhead to cool off before heading further upstream to spawn. “The importance of Blue Creek to the larger Klamath system really can’t be overstated,” he said. “With the dam removals and the restoration of fish passage to over 400 miles of spawning habitat in the upper basin, none of that means anything if the fish can’t get there.” James from the Yurok Tribe described Blue Creek as a high prayer area, a village site, and essential fishing grounds. In 2020, it was also where Yurok officials helped persuade PacifiCorp officials to move forward with dam removal after two decades of advocacy. James credited Troy Fletcher, a former executive director of the Yurok Tribe who played a key role in the dam removal campaign and who has since passed away, for helping to initiate the landback project. Restoring the land will involve everything from stream restoration projects to road maintenance, James said: “We want to do everything we can to protect Mother Earth.” Kling said the conservancy is increasingly working with tribal nations to facilitate land transfers and hopes to work with more.Studieshave shown that conservation goals are more effectively met when Indigenous peoples manage their own territories. “The more that we can partner with tribal stewards to achieve our conservation outcomes, those are durable lasting results,” Kling said. James, too, hopes that the deal will be far from the last. “Here’s a model that we can share with the Indian Country,” he said. “Indigenous people are the managers of the land, and they’re driving it.” A message from Grist is the only award-winning newsroom focused on exploring equitable solutions to climate change. It’s vital reporting made entirely possible by loyal readers like you. At Grist, we don’t believe in paywalls. Instead, we rely on our readers to pitch in what they can so that we can continue bringing you our solution-based climate news. Grist is the only award-winning newsroom focused on exploring equitable solutions to climate change. It’s vital reporting made entirely possible by loyal readers like you. At Grist, we don’t believe in paywalls. Instead, we rely on our readers to pitch in what they can so that we can continue bringing you our solution-based climate news. **A new podcast asks: Are ‘radical’ climate activists really that radical?** Grist thanks its sponsors.Become one. Grist thanks its sponsors.Become one. To support our nonprofit environmental journalism, please considerdisabling your ad-blockerto allow ads on Grist.Here's How **Indigenous Affairs** **The transfer of a sacred site to a copper mine is delayed once again** Cuts to USAID severed longstanding American support for Indigenous peoples around the worldGraham Lee Brewer, The Associated Press **Cuts to USAID severed longstanding American support for Indigenous peoples around the world** **Cuts to USAID severed longstanding American support for Indigenous peoples around the world** Indigenous land defenders face rising threats amid global push for critical mineralsMiacel Spotted Elk **Indigenous land defenders face rising threats amid global push for critical minerals** **Indigenous land defenders face rising threats amid global push for critical minerals** In her new book, ‘Kuleana,’ Sara Kehaulani Goo fights to keep her family’s landAnita Hofschneider **In her new book, ‘Kuleana,’ Sara Kehaulani Goo fights to keep her family’s land** **In her new book, ‘Kuleana,’ Sara Kehaulani Goo fights to keep her family’s land** **Latest** **Can a crowdsourced map of the world help save millions of people from climate disaster?** Coal miners are fighting Trump’s safety cuts — and winningKatie Myers **Coal miners are fighting Trump’s safety cuts — and winning** **Coal miners are fighting Trump’s safety cuts — and winning** In California, a biomass company’s expansion raises fears of more firesTom Brown **In California, a biomass company’s expansion raises fears of more fires** **In California, a biomass company’s expansion raises fears of more fires** Trump’s second term is creating ‘a limbo moment’ for US battery recyclersMaddie Stone **Trump’s second term is creating ‘a limbo moment’ for US battery recyclers** **Trump’s second term is creating ‘a limbo moment’ for US battery recyclers** **Modal Gallery** The only newsroom focused on finding solutions at the intersection of climate and justice. Donate today to help keep Grist’s site and newsletters free. **Topics** Energy Politics Solutions Accountability Extreme Weather The Grist 50 **Company** About Team Contact Careers Fellowships Pressroom **More** Newsletters Events Become a Member Advertising Republish Accessibility © 1999-2025 Grist Magazine, Inc. All rights reserved.Grist is powered byWordPress VIP.Terms of Use|Privacy Policy Follow us on Facebook Follow us on Twitter Follow us on Instagram Follow us on YouTube Follow us on Bluesky"}