{"id": 119, "name": "Bay Nature Magazine", "domain": "baynature.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://baynature.org/2025/05/08/local-americorps-fellows-lose-jobs-leaving-oaks-unplanted-and-career-prospects-unclear/", "title": "Local Americorps Fellows Lose Jobs Leaving Oaks Unplanted And Career Prospects Unclear", "content": "Sign up for ourfree weekly newsletterand understand everything better! Donate Join / Renew Science and Nature Conservation Exploration Bay Nature Talks Find an Event Donate Join / Renew Current & Back Issues Bay Nature Store My Membership Account Search Science & Nature Conservation Exploration Events BN Talks Local Heroes Search My Account Conservation **Local AmeriCorps Fellows Lose Jobs, Leaving Oaks Unplanted and Career Prospects Unclear** **AmeriCorps fellowships are a pathway for many young people to start environment-related careers. Under Trump, that pathway has suddenly crumbled away.** Over the past eight months, Christian Noriega, 22, collected a few thousand acorns at Blue Oak Ranch Reserve, about 10 miles outside San José, sprouted them, and planted 120 seedlings of blue, valley, and black oak trees. He also planted native California brome, purple needlegrass, and blue wildrye, and cut channels along mountain ridges in the rain to prevent roads from overflooding. But Noriega’s main focus was leading hikes for middle and high school students from east San José, near his hometown, teaching them about the oak trees at the reserve. Like them, Noriega hadn’t had much access to the outdoors while growing up. He enjoyed telling students to be like his favorite tree, a blue oak, by being “resilient to change and to any challenges that face you,” he says. Last week Noriega faced his own challenge—a termination notice—as President Donald Trump’s Department of Government Efficiency (DOGE) slashed $400 million from the federal agency AmeriCorps and placed 85 percent of its staff on administrative leave, leaving young service-minded fellows like Noriega across the nation in the lurch. AmeriCorps employs more than 200,000 people in the United States annually, and nearly 7,000 in California. These volunteers, largely young people, perform service work from language education to disaster relief. In the Bay Area, 155 out of 806 fellows do nature-related fellowships. Ninety of those 155 fellowships have now been terminated. Bay Nature is documenting how federal money affects local nature. Read more stories in the projecthere, and send tips towildbillions@baynature.orgor to one of our reporters on Signal: Jillian Magtoto:beluga.23 Tanvi Dutta Gupta:colugo_68.21 Left: GrizzlyCorps fellow Christian Noriega grows oak seedlings at Blue Oak Ranch Reserve. While planting them, he came across a gopher snake. (Zac Harlow) Noriega worked for GrizzlyCorps, a statewide conservation program. On April 25th, California Volunteers, which administers most of the state’s AmeriCorps funding, told GrizzlyCorps that its grants were gone. Across the Bay Area, DOGE cuts of about $11 million affected 28 programs and 304 locations. GrizzlyCorps fellows were told to stop working immediately, three months early. Some, like Noriega, were in the midst of applying to renew their fellowships. “I’m leaving behind an opportunity, not just for me,” Noriega says, but also “for a bunch of students in east San José who never get to experience the outdoors. That really hurt me.” “We’ve put 45 people out in the field, some of them in pretty rural areas, with a very low salary,” says GrizzlyCorps founder Ken Alex. “Suddenly, they’re cut off from their job and their paycheck.” A paycheck that is by most measures extraordinarily low: California Volunteers’ AmeriCorps-funded fellows receive a maximum stipend of $35,000 for an 11-month term. “They are taking such a big sacrifice to give back to their communities,” Silver says. The perks are modest: Some fellows qualify for food stamps. Others get a temporary pause on student loans. Occasionally, they receive housing from their host organization. The programs themselves are on the chopping block, says Jake Silver, who directs the Sustainability Service Corps (SSC), which places AmeriCorps fellows with government agencies and nonprofits doing sustainability projects in the Bay Area. “This whole week has been spent trying to do whatever we can to not just save the fellows, but to save our own staff,” says Silver. “There’s a real possibility that this is the end.” Fellows in programs that are partly funded by the state of California—like the College Corps and the California Climate Action Corps—may be able to finish out their terms thanks to supplemental state grant dollars, though no longer as AmeriCorps fellows, California Volunteers spokesperson Joyia Emard wrote in an email. Alex says that without federal money, GrizzlyCorps will have to raise $2 million by mid-June to run the program next year. The organization has delayed its application round for next year, and is just 20 percent of the way towards its funding goal. It is also trying to cover the remainder of the current fellows’ positions. “Right now, we have been able to fund our program for the month of May and are hoping to cover June and July as well,” writes GrizzlyCorps director Eliza Munger. From left: Sustainability Service Corps fellow Grace Dwyer shows off a yellow-eyed ensatina (Esperanza Pimentel), and leads a group of volunteers for the Presidio Trust (Kristen Jones). Often, Silver says, the fellowships help recent college grads kick off a career in an environmental field. This year, SSC fellow Grace Dwyer, 23, was one of two fellows removing invasives, restoring native dune habitat, and leading volunteer days at the Presidio—tasks that “definitely solidified my desire to contribute to restoration work,” she says. She learned about 100 different plant species along the way, and resolved to apply to graduate school. “About a third of the fellows working in such rural communities end up getting hired by their host organizations,” Alex says. “Almost all of them are working and staying in the same fields.” “It’s really daunting to see these entry-level jobs that require five years of experience,” says former GrizzlyCorps fellow Elliot Grant, who spent his fellowship at the San Francisco-based nonprofit Sustainable Conservation in 2021. Two years later, Grant was hired there as a program manager. “Because of GrizzlyCorps,” he says, “Sustainable Conservation was able to really take a chance on me.” Less than a year after he was hired, he started mentoring his own GrizzlyCorps fellow, whom he hired and now supervises. GrizzlyCorps fellows work in “some of the most rural parts of the state that often are ignored,” says Alex. In the Bay Area, local places seeing impacts include field stations at University of California natural reserves: Blue Oak Ranch Reserve in San José, Point Reyes Field Station, and Hastings Natural History Reservation in Carmel. Their facilities serve as temporary homes for visitors and researchers, allowing people to access natural areas. “Our staff are spread thin,” says Neetha Iyer, an administrative director for the reserve system. GrizzlyCorps fellows “allow us to expand what we’re able to offer as an education and research facility,” she says. At Hastings Natural History Reservation in Carmel Valley, GrizzlyCorps fellow Natalia Valdés Heredia was waiting to plant hundreds of blue oak seedlings at the end of this year, from thousands of acorns she collected throughout the property. They have been germinating in greenhouses for months. While she waited, she kept her plate full: fixing leaky faucets, whacking weeds, removing downed trees with a chainsaw after a fire in October, and tracking wildlife with a dozen camera traps that she set up—capturing mountain lions, bobcats, wild pigs, and raptors. “I loved my position here,” says Valdés Heredia, 25. Now the seedlings may never be planted. “We don’t have the staff or the capacity to do that,” says Jen Hunter, the reserve resident director, who is also the only other staff member living with Valdés Heredia at the reserve. Valdés Heredia’s fellowship “gave us an opportunity to get some of these big projects done.” GrizzlyCorps member Emily Dewing, 25, was in the middle of quite a big project: the GIS mapping of fire resilience projects, aging infrastructure, bird tagging spots, and more across 5,000 acres of land for Audubon Canyon Ranch in Marin and Sonoma. These projects would help the ranch be more efficient when planning future projects, says ecologist Scott Jennings, especially for managing fire-resistant landscapes. Plus, “I was really looking forward to having completed projects that I would be able to show on my applications to schools and on my applications to other jobs,” Dewing says. With her work incomplete, she feels stuck. “Now, it doesn’t look like I’ll be able to save up enough money for my masters” in a GIS-related field, Dewing says. She’s been applying to jobs without much success. While filling out one application, the online job posting vanished due to federal cuts to that program. Dewing, Noriega, and Dwyer say they are hoping for seasonal work, since a “lot of the long-term projects that are being federally funded are disappearing,” says Dewing. “If it comes to it,” she says, “I will be applying to the grocery store nearest to me.” At the Carmel reserve, Valdés Heredia was inspired by her camera trap work. “I was hoping to use my money to go to grad school,” she says. Two weeks ago, she sent a renewal letter to GrizzlyCorps, in hopes of continuing at the reserve for another year. Hunter, her mentor, sees future opportunities for aspiring environmental scientists like Valdés Heredia dwindling as Trump slashes agencies and research. “The thing that makes me nervous is that if this was [Valdés Heredia’s] opportunity to kind of get that type of experience, and it’s been cut short,” says Hunter, “I’m not sure she’s going to have another chance to tap into that.” From left: GrizzlyCorps fellow Natalia Valdés Heredia fixes technical difficulties with a battery box, on one of her first days of work last September at Hastings Natural History Reservation in Carmel; and posing after a chainsaw training, which she put to use soon after a fire at the reservation in October. (Jen Hunter) Valdés Heredia sees another way forward, an option that means not just saying goodbye to the Corps, but also to America as a place of opportunity. “It would honestly break my heart to think of doing anything other than environmental sciences,” says Valdés Heredia. She’s looking at Canada or Australia as backup options. “If I really need to go that route,” she says, “I’m not afraid to.” California is fighting back against the cuts. On April 25, Gov. Gavin Newsom issued a statement saying that “the federal government is giving the middle finger to service. We will serve them with a lawsuit.” On April 29, the District of Columbia and 24 Democratic-governed states, co-led by California, filed that lawsuit, arguing that the president does not have authority to effectively eliminate a service that Congress created. Jillian Magtoto is a 2024–2025 editorial fellow at Bay Nature and a recent graduate of the Columbia School of Journalism. A UC Berkeley alumna, she is excited to be back in the Bay and write stories on how humans and wildlife are learning to live with one another. **Join Us** Every story from Bay Nature magazine is the product of a team dedicated to connecting our readers to the world around them and increasing environmental literacy. Please help us keep this unique regional magazine thriving, and support the ecosystem we’ve built around it, by becoming a member today—you’ll get Bay Nature four times a year in your mailbox, free access to our hikes and online talks, and discounts to ticketed events! **Hungry to Help? Spring Stewardship Opportunities** **Trump’s EPA Suspends $19M North Richmond Environmental Justice Grant—Again** **The Hills Have Ears** **The Comeback Quail** Bay Nature connects the people of the San Francisco Bay Area to our natural world and motivates people to solve problems with nature in mind. Header illustrations by Jane Kim,InkDwell Donate Bay Nature Institute1328 6th St., #2Berkeley, CA 94710(510) 528-8550 Tax ID: 76-0744881 Become a Member Bay Nature Store Current & Back Issues in Print Online Magazine Story Archive Bay Nature Talks Give Us Feedback Pitch Us Stories, Photos or Art About Staff and Board Employment Opportunities Partner with Bay Nature Advertise Add An Event My Account Join / Renew Membership Customer Service:888-4-BAYNAT (888-422-9628)service@baynature.orgPO Box 6409Albany, CA 94706 Bay Nature’s email newsletter delivers local nature stories, hikes, and events to your inbox each week. Sign up today: Sign Up! Bay Nature is a member of the INN Network."}