{"id": 1303, "name": "Stimson Center", "domain": "stimson.org", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.stimson.org/2025/despite-significant-geostrategic-challenges-president-lee-can-make-progress-on-korean-peninsula-security/", "title": "Despite Significant Geostrategic Challenges President Lee Can Make Progress On Korean Peninsula Security", "content": "ResearchTrade& TechnologyConventional ArmsEmerging TechnologyNonproliferationTrade Risk MitigationConventional ArmsEmerging TechnologyNonproliferationTrade Risk MitigationSecurity& StrategyGrand StrategyDefense Policy & PostureDiplomacy & DialogueGrand StrategyDefense Policy & PostureDiplomacy & DialogueHuman Security& GovernanceHuman Rights & IHLInternational & Regional OrganizationsPeacekeepingProtection of CiviliansHuman Rights & IHLInternational & Regional OrganizationsPeacekeepingProtection of CiviliansClimate& Natural ResourcesEnergy, Water & OceansResilience & SustainabilityEnergy, Water & OceansResilience & SustainabilityPivotalPlacesAsia & Indo-PacificAsia & Indo-PacificChinaJapanKorean PeninsulaSouth AsiaSoutheast AsiaChinaJapanKorean PeninsulaSouth AsiaSoutheast AsiaMiddle East & North AfricaRussiaMiddle East & North AfricaRussia Conventional Arms Emerging Technology Nonproliferation Trade Risk Mitigation Conventional Arms Emerging Technology Nonproliferation Trade Risk Mitigation Grand Strategy Defense Policy & Posture Diplomacy & Dialogue Grand Strategy Defense Policy & Posture Diplomacy & Dialogue Human Rights & IHL International & Regional Organizations Peacekeeping Protection of Civilians Human Rights & IHL International & Regional Organizations Peacekeeping Protection of Civilians Energy, Water & Oceans Resilience & Sustainability Energy, Water & Oceans Resilience & Sustainability Asia & Indo-Pacific Asia & Indo-Pacific China Japan Korean Peninsula South Asia Southeast Asia China Japan Korean Peninsula South Asia Southeast Asia Middle East & North Africa Russia Middle East & North Africa Russia Conventional Arms Emerging Technology Nonproliferation Trade Risk Mitigation Conventional Arms Emerging Technology Nonproliferation Trade Risk Mitigation Grand Strategy Defense Policy & Posture Diplomacy & Dialogue Grand Strategy Defense Policy & Posture Diplomacy & Dialogue Human Rights & IHL International & Regional Organizations Peacekeeping Protection of Civilians Human Rights & IHL International & Regional Organizations Peacekeeping Protection of Civilians Energy, Water & Oceans Resilience & Sustainability Energy, Water & Oceans Resilience & Sustainability Asia & Indo-Pacific Asia & Indo-Pacific China Japan Korean Peninsula South Asia Southeast Asia China Japan Korean Peninsula South Asia Southeast Asia Middle East & North Africa Russia Middle East & North Africa Russia Engagement Solutions Events AboutAbout StimsonMission & VisionNews & AnnouncementsProgramsHistoryLoomis CouncilEastWest CouncilMission & VisionNews & AnnouncementsProgramsHistoryLoomis CouncilEastWest CouncilTransparencyEthics & IndependenceFunding & FinancesOur Core ValuesEthics & IndependenceFunding & FinancesOur Core ValuesPeopleStaff & AffiliatesBoard of DirectorsWork at StimsonStaff & AffiliatesBoard of DirectorsWork at StimsonSubscribeFirst NameLast NameEmailSubscribeMore Subscription Options Mission & Vision News & Announcements Programs History Loomis Council EastWest Council Mission & Vision News & Announcements Programs History Loomis Council EastWest Council Ethics & Independence Funding & Finances Our Core Values Ethics & Independence Funding & Finances Our Core Values Staff & Affiliates Board of Directors Work at Stimson Staff & Affiliates Board of Directors Work at Stimson Mission & Vision News & Announcements Programs History Loomis Council EastWest Council Mission & Vision News & Announcements Programs History Loomis Council EastWest Council Ethics & Independence Funding & Finances Our Core Values Ethics & Independence Funding & Finances Our Core Values Staff & Affiliates Board of Directors Work at Stimson Staff & Affiliates Board of Directors Work at Stimson Support ResearchTrade& TechnologyConventional ArmsEmerging TechnologyNonproliferationTrade Risk MitigationConventional ArmsEmerging TechnologyNonproliferationTrade Risk MitigationSecurity& StrategyGrand StrategyDefense Policy & PostureDiplomacy & DialogueGrand StrategyDefense Policy & PostureDiplomacy & DialogueHuman Security& GovernanceHuman Rights & IHLInternational & Regional OrganizationsPeacekeepingProtection of CiviliansHuman Rights & IHLInternational & Regional OrganizationsPeacekeepingProtection of CiviliansClimate& Natural ResourcesEnergy, Water & OceansResilience & SustainabilityEnergy, Water & OceansResilience & SustainabilityPivotalPlacesAsia & Indo-PacificAsia & Indo-PacificChinaJapanKorean PeninsulaSouth AsiaSoutheast AsiaChinaJapanKorean PeninsulaSouth AsiaSoutheast AsiaMiddle East & North AfricaRussiaMiddle East & North AfricaRussia Conventional Arms Emerging Technology Nonproliferation Trade Risk Mitigation Conventional Arms Emerging Technology Nonproliferation Trade Risk Mitigation Grand Strategy Defense Policy & Posture Diplomacy & Dialogue Grand Strategy Defense Policy & Posture Diplomacy & Dialogue Human Rights & IHL International & Regional Organizations Peacekeeping Protection of Civilians Human Rights & IHL International & Regional Organizations Peacekeeping Protection of Civilians Energy, Water & Oceans Resilience & Sustainability Energy, Water & Oceans Resilience & Sustainability Asia & Indo-Pacific Asia & Indo-Pacific China Japan Korean Peninsula South Asia Southeast Asia China Japan Korean Peninsula South Asia Southeast Asia Middle East & North Africa Russia Middle East & North Africa Russia Conventional Arms Emerging Technology Nonproliferation Trade Risk Mitigation Conventional Arms Emerging Technology Nonproliferation Trade Risk Mitigation Grand Strategy Defense Policy & Posture Diplomacy & Dialogue Grand Strategy Defense Policy & Posture Diplomacy & Dialogue Human Rights & IHL International & Regional Organizations Peacekeeping Protection of Civilians Human Rights & IHL International & Regional Organizations Peacekeeping Protection of Civilians Energy, Water & Oceans Resilience & Sustainability Energy, Water & Oceans Resilience & Sustainability Asia & Indo-Pacific Asia & Indo-Pacific China Japan Korean Peninsula South Asia Southeast Asia China Japan Korean Peninsula South Asia Southeast Asia Middle East & North Africa Russia Middle East & North Africa Russia Engagement Solutions Events AboutAbout StimsonMission & VisionNews & AnnouncementsProgramsHistoryLoomis CouncilEastWest CouncilMission & VisionNews & AnnouncementsProgramsHistoryLoomis CouncilEastWest CouncilTransparencyEthics & IndependenceFunding & FinancesOur Core ValuesEthics & IndependenceFunding & FinancesOur Core ValuesPeopleStaff & AffiliatesBoard of DirectorsWork at StimsonStaff & AffiliatesBoard of DirectorsWork at StimsonSubscribeFirst NameLast NameEmailSubscribeMore Subscription Options Mission & Vision News & Announcements Programs History Loomis Council EastWest Council Mission & Vision News & Announcements Programs History Loomis Council EastWest Council Ethics & Independence Funding & Finances Our Core Values Ethics & Independence Funding & Finances Our Core Values Staff & Affiliates Board of Directors Work at Stimson Staff & Affiliates Board of Directors Work at Stimson Mission & Vision News & Announcements Programs History Loomis Council EastWest Council Mission & Vision News & Announcements Programs History Loomis Council EastWest Council Ethics & Independence Funding & Finances Our Core Values Ethics & Independence Funding & Finances Our Core Values Staff & Affiliates Board of Directors Work at Stimson Staff & Affiliates Board of Directors Work at Stimson Support SearchFind ResearchResearch, programs and projects, events, and institutional information.SearchFind ExpertsStaff and affiliates by name or research area.By Research AreaClimate & Natural Resources-Energy, Water & Oceans-Resilience & SustainabilityHuman Security & Governance-Human Rights & IHL-International & Regional Organizations-Peacekeeping-Protection of CiviliansPivotal Places-Asia & Indo-Pacific--China--Japan--Korean Peninsula--South Asia--Southeast Asia-Middle East & North Africa-RussiaSecurity & Strategy-Defense Policy & Posture-Diplomacy & Dialogue-Grand StrategyTrade & Technology-Conventional Arms-Emerging Technology-Nonproliferation-Trade Risk MitigationSearch **Despite Significant Geostrategic Challenges, President Lee Can Make Progress on Korean Peninsula Security** **ByFrank Aum** **Korean Peninsula** June 10, 2025 Despite not being as prominent an issue for the South Korea public as it has been in the past, North Korea will continue to be a driving force in newly elected President Lee Jae-myung’s overall security policy. Along with revitalizing the economy, bolstering democratic institutions, and navigating a tricky U.S.-South Korea alliance relationship, Lee will have to be judiciously bold and aggressive on North Korea policy to guarantee that South Korea shapes its own security rather than remains a passive bystander. **On the Alliance** As an initial matter, President Lee will need to demonstrate enough political savvy to ensure that President Trump acts as a productive alliance partner. Trump maintains a sour impression of South Korea based on his previous dealings, including rancorous negotiations related to host nation burden sharing and former president Moon Jae-in’s eager interventions in North Korea policy. A post on X by Laura Loomer, an influential far-right activist, deploring Lee’s election win with “RIP South Korea. The communists have taken over” makes the new president’s task more difficult. President Lee recognizes the uphill battle, stressing both urgency and pragmatism in his foreign policy. He has repeatedly declared that alliance relations is the foundation of South Korean security and added, “I will crawl between [President Trump’s] legs if necessary, if that’s what I have to do for my people.” He also noted, however, that “I am not a pushover, either. South Korea also has quite a few cards to play in give-and-take negotiations.” The expanding negotiating space created by Trump’s “America First” approach to alliance relations and a new progressive South Korean administration means that Lee indeed has cards to play. The Trump administration seeks to lower its own security costs by pushing allies to assume a greater burden for their own defenses as well as to help contain China’s rise. Lee could propose scaling back joint military exercises and U.S. strategic asset deployments to the Korean Peninsula, which the alliance has done in the past and would appeal to both Trump, who called these measurescostly, and Kim Jong Un, who characterizes them as hostile andoffensive. And as Washington shifts to a regional strategy that requires more resources and attention on China, President Lee could encourage an accelerated transition of wartime operational control to a ROK-led combined forces command. Seoul could then take the lead in the alliance’s defense against North Korea, a move that previous progressive administrations have sought to enhance national sovereignty, which would allow Washington to focus more on China. On trade and tariff issues, Seoul can take a wait-and-see approach, studying the negotiations of its neighbors China and Japan. Given South Korea’s robust position as a leader in sectors of high U.S. interest, such as semiconductors, shipbuilding, and steel, and its massive investments in the U.S. economy (South Korea was thelargest investorin the United States in 2023 with $20 billion in investments, and one of the largest Asian importers of U.S.liquefied natural gas), Lee would not be short of leverage. **On North Korea** Despite these options, President Lee will have a tougher row to hoe with North Korea. Pyongyang is in perhaps its strongest position over the last thirty years due to financial, political, and technological support from Russia and China and its own illicit cyber activities, including its February theft of$1.5 billionfrom the ByBit cryptocurrency exchange. In addition, North Korea has made significant quantitative and qualitative gains in its nuclear deterrent capabilities since 2021 and upended its longstanding inter-Korean policy by renouncing unification with South Korea. Recognizing this changed security landscape, President Lee is adopting a cautious engagement approach toward North Korea that avoids specific grand proposals. Instead, he has spoken generally during his presidential campaign and in his election night and inaugural speeches about pursuingpeace, dialogue, and cooperationwith North Korea. He noted the unlikelihood of inter-Korean summits in the near-term but promised to reinstate the 2018 Comprehensive Military Agreement and halt leaflet campaigns toward North Korea. President Lee supports North Korea’s gradual denuclearization, likely recognizing the implausibility of disarming North Korea in the near-term but also the political danger of abandoning denuclearization as a goal altogether. This stance reflects a flexibility on the nuclear issue that values diplomatic progress with North Korea as the best guarantee of security and peace. Jumpstarting inter-Korean dialogue may be dependent on factors outside of Lee’s control, including an end to the Ukraine conflict and renewed U.S.-North Korea diplomacy, but he can still take unilateral measures that increase Pyongyang’s receptivity. Although he hasn’t yet provided a definitive perspective on unification, he has hinted thatpeaceful coexistencein the present would be a bridge to aspirations of unification in the long-term. Given North Korea’s renunciation of unification and the defunct nature of former president Yoon Suk Yeol’s hardline approach to unification, Lee will need to more proactively clarify his prioritization of near-term normalization over long-term unification with North Korea to avoid the fate of “Korea passing.” Seoul cannot be absent from the table as Washington and Pyongyang negotiate the future of the Korean Peninsula. Another area where President Lee will need to tread a fine line is on deterrence measures. He has already supported maintaining South Korean reliance on U.S. extended deterrence while shunning indigenous nuclear capabilities, which may leave little room to foreclose joint military exercises or U.S. strategic asset deployments. In addition, his backing of South Korean conventional deterrence, including upgrading the aggressivethree-axisdefense system developed by prior administrations, could potentially signal hostility to North Korea. However, as the Moon Jae-in administration demonstrated, South Korea can support and rely on U.S. extended nuclear deterrence and its own conventional deterrence while still mitigating tensions by significantly limiting aggressive deterrence signaling. For example, President Moon maintained military deterrence and readiness through combined military exercises but reduced theirscale and scopeand halted the deployment of U.S. strategic assets; he alsosoftened the terminologyfor the three-axis system to dampen hostile rhetoric. **Looking Ahead** The new Lee administration will face many geostrategic and economic challenges that require deft navigation. President Lee has already asserted that he will seek pragmatic balance in dealing with China, Japan, Russia, the EU and the global South in areas such as export diversification, critical materials cooperation, and food security. This means improving the critical bilateral economic relationship with China while managing U.S. calls for South Korea to play a greater role in strategic competition. He has also underscored the importance of trilateral U.S.-ROK-Japan cooperation and not living in the past despite having previously criticized Japan’s unwillingness to honestly account for historical abuses. If President Lee plays his cards right, he might be able capitalize on the current geostrategic fluidity to achieve many of his goals for North Korea, alliance relations, economic stability, and a more secure South Korea. **Recent & Related** **About Stimson** Mission & Vision News & Announcements Programs History Loomis Council EastWest Council Mission & Vision News & Announcements Programs History Loomis Council EastWest Council **Transparency** Ethics & Independence Funding & Finances Our Core Values Ethics & Independence Funding & Finances Our Core Values **People** Staff & Affiliates Board of Directors Work at Stimson Staff & Affiliates Board of Directors Work at Stimson **Contact** 202.223.5956 1211 Connecticut Ave NW, 8th Floor, Washington, DC 20036 Fax: 202.238.9604 202.478.3437 Caiti Goodman Communications Dept. News & Announcements Copyright The Henry L. Stimson Center Privacy Policy **Subscription Options** **Research Areas** Trade & Technology Security & Strategy Human Security & Governance Climate & Natural Resources **Pivotal Places** Asia & the Indo-Pacific Russia Middle East & North Africa **Publications & Project Lists** South Asia Voices Publication Highlights Global Governance Innovation Network Updates Mekong Dam Monitor: Weekly Alerts and Advisories Middle East Voices Updates **38 North: News and Analysis on North Korea** All News & Analysis (Approx Weekly) 38 North Today (Frequently) Only Breaking News (Occasional) None"}