{"id": 738, "name": "KBSI - Cape Girardeau News", "domain": "kbsi23.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kbsi23.com/news/first-annual-c-a-r-e-symposium-held-in-cape-girardeau-addressing-mental-health-needs-of-the-community/", "title": "First Annual C A R E Symposium Held In Cape Girardeau Addressing Mental Health Needs Of The Community", "content": "Main Navigation NewsMissouri NewsKentucky NewsIllinois NewsTennessee News2024 General Election ResultsScamsSubmit Your News Missouri News Kentucky News Illinois News Tennessee News 2024 General Election Results Scams Submit Your News Missouri News Kentucky News Illinois News Tennessee News 2024 General Election Results Scams Submit Your News WeatherSevere Weather AlertsLive Cameras Severe Weather Alerts Live Cameras Severe Weather Alerts Live Cameras CommunityField Trip FridaysFOX 23, American Red Host “Battle of the Chambers Blood Drive”FOX23 Back to School DriveCareer ConnectionsMidwest MarketplaceFarmer Wants a WifeCountdown to ChristmasContestsSchool ZoneLocal Events Field Trip Fridays FOX 23, American Red Host “Battle of the Chambers Blood Drive” FOX23 Back to School Drive Career Connections Midwest Marketplace Farmer Wants a Wife Countdown to Christmas Contests School Zone Local Events Field Trip Fridays FOX 23, American Red Host “Battle of the Chambers Blood Drive” FOX23 Back to School Drive Career Connections Midwest Marketplace Farmer Wants a Wife Countdown to Christmas Contests School Zone Local Events WatchFOX23 News Live at 9Live CamerasHow to Set up Your Antenna to Watch Free TV FOX23 News Live at 9 Live Cameras How to Set up Your Antenna to Watch Free TV FOX23 News Live at 9 Live Cameras How to Set up Your Antenna to Watch Free TV AboutAdvertise with UsCareersClosed CaptioningFCC Public FileFCC ApplicationsChildren’s TV ReportDMCA AgentEEO ReportTerms of UsePrivacy PolicyStandard Media Advertise with Us Careers Closed Captioning FCC Public File FCC Applications Children’s TV Report DMCA Agent EEO Report Terms of Use Privacy Policy Standard Media Advertise with Us Careers Closed Captioning FCC Public File FCC Applications Children’s TV Report DMCA Agent EEO Report Terms of Use Privacy Policy Standard Media WDKAFCC ApplicationsFCC Public FileChildren’s TV ReportClosed CaptioningEEO Report FCC Applications FCC Public File Children’s TV Report Closed Captioning EEO Report FCC Applications FCC Public File Children’s TV Report Closed Captioning EEO Report GOLF PASS NOW APP Connect With Us Submit Your News Submit Your News NewsMissouri NewsKentucky NewsIllinois NewsTennessee News2024 General Election ResultsScamsSubmit Your News Missouri News Kentucky News Illinois News Tennessee News 2024 General Election Results Scams Submit Your News Missouri News Kentucky News Illinois News Tennessee News 2024 General Election Results Scams Submit Your News WeatherSevere Weather AlertsLive Cameras Severe Weather Alerts Live Cameras Severe Weather Alerts Live Cameras CommunityField Trip FridaysFOX 23, American Red Host “Battle of the Chambers Blood Drive”FOX23 Back to School DriveCareer ConnectionsMidwest MarketplaceFarmer Wants a WifeCountdown to ChristmasContestsSchool ZoneLocal Events Field Trip Fridays FOX 23, American Red Host “Battle of the Chambers Blood Drive” FOX23 Back to School Drive Career Connections Midwest Marketplace Farmer Wants a Wife Countdown to Christmas Contests School Zone Local Events Field Trip Fridays FOX 23, American Red Host “Battle of the Chambers Blood Drive” FOX23 Back to School Drive Career Connections Midwest Marketplace Farmer Wants a Wife Countdown to Christmas Contests School Zone Local Events WatchFOX23 News Live at 9Live CamerasHow to Set up Your Antenna to Watch Free TV FOX23 News Live at 9 Live Cameras How to Set up Your Antenna to Watch Free TV FOX23 News Live at 9 Live Cameras How to Set up Your Antenna to Watch Free TV AboutAdvertise with UsCareersClosed CaptioningFCC Public FileFCC ApplicationsChildren’s TV ReportDMCA AgentEEO ReportTerms of UsePrivacy PolicyStandard Media Advertise with Us Careers Closed Captioning FCC Public File FCC Applications Children’s TV Report DMCA Agent EEO Report Terms of Use Privacy Policy Standard Media Advertise with Us Careers Closed Captioning FCC Public File FCC Applications Children’s TV Report DMCA Agent EEO Report Terms of Use Privacy Policy Standard Media WDKAFCC ApplicationsFCC Public FileChildren’s TV ReportClosed CaptioningEEO Report FCC Applications FCC Public File Children’s TV Report Closed Captioning EEO Report FCC Applications FCC Public File Children’s TV Report Closed Captioning EEO Report GOLF PASS NOW APP **First annual C.A.R.E. symposium held in Cape Girardeau, addressing mental health needs of the community** CAPE GIRARDEAU, Mo. (KBSI) —The Gibson Center for Behavioral change held its first annual Critical Access, Response, and Engagement (CARE) symposium today — made possible by a grant from the Missouri Foundation for Health. It was an opportunity for all members of the community to learn about mental health, available resources, and how to access services. The goal is to build more resilient communities Chief Operating Officer Ryan Essex said it started a year ago with a CARE grant that allowed them to get into the community and learn what the needs are. “The premise of it was to investigate and learn and educate the community about resources and providing access to care,” he said. After a year of outreach, the Gibson center found one area in particular needed urgent attention: youth mental health. Speakers today covered issues such as bullying and adverse childhood experiences (ACEs). “Tiffany Lacy Clark talked about adverse childhood events, you know, trauma that happens in all walks of life when we’re children and how that affects us later in life and how we can help combat that,” Essex said, “and things that we can do to help those youth overcome some of those struggles they have.” From bullying to trauma to resilience building — the symposium covered it all. Those who attended walked away with practical tools, from mentorship strategies to crisis intervention training. Through the NOW Local News app, viewers shared their own experiences and perspectives on why these conversations matter. “Mental health is an extremely important topic for me,” Kate Appleman said. “There are so many resources in our area that include various counseling services… But it is important to talk about mental health because no one really understands, truly, who could be impacted. So it’s important to be kind to everyone. If you are having those issues or needing to talk to someone, please reach out and find that resource for you.” “It’s easy to shut down,” Danielle Torbet said. “It’s easy to avoid uncomfortable conversations. But as mental health and behavioral health issues continue to be an epidemic here in our nation and around the country, I think it’s important to be transparent and keep the lines of communication open and honest and check in on your loved ones — check in on your friends.” According to Essex, the symposium will be back next year — bigger and even better. Facebook Pinterest Twitter Linkedin **Related** **Cape Girardeau police search for woman accused in assault** **Man arrested on terroristic threatening charges** **Fire Departments conduct vehicle extrication training** Most ViewedWoman dies after fall at Giant City State ParkTwo killed in McCracken County collisionATF, NYPD, Kentucky State Police execute search warrant in Smithland, Ky.Teenager seriously injured after being struck by vehicle in PaducahMissouri police investigate death of Bernie Police LieutenantSouthern Illinois town struggles under the weight of deteriorating homes and abandoned properties **Most Viewed** **Woman dies after fall at Giant City State Park** **Two killed in McCracken County collision** **ATF, NYPD, Kentucky State Police execute search warrant in Smithland, Ky.** **Teenager seriously injured after being struck by vehicle in Paducah** **Missouri police investigate death of Bernie Police Lieutenant** **Southern Illinois town struggles under the weight of deteriorating homes and abandoned properties** **Most Viewed** **Woman dies after fall at Giant City State Park** **Two killed in McCracken County collision** **ATF, NYPD, Kentucky State Police execute search warrant in Smithland, Ky.** **Teenager seriously injured after being struck by vehicle in Paducah** **Missouri police investigate death of Bernie Police Lieutenant** **Southern Illinois town struggles under the weight of deteriorating homes and abandoned properties** Submit Your News Missouri News Kentucky News Illinois News Tennessee News Blood Drive Midwest Marketplace Contests School Zone Local Events Watch Advertise with Us Careers Closed Captioning FCC Public File FCC Applications Children’s TV Report DMCA Agent EEO Report Terms of Use Privacy Policy Standard Media Contact Us FCC Applications FCC Public File Children’s TV Report Closed Captioning EEO Report © 2025 KBSI FOX23 News Cape Girardeau News | Paducah News."}