{"id": 1600, "name": "WNEP - Scranton News", "domain": "wnep.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wnep.com/article/news/local/lackawanna-county/cornerstone-placed-as-moosic-unveils-future-hub-for-first-responders-greenwood-hose-company-borough-department/523-32ae64ab-e748-4c2a-8e02-3b070d04af20", "title": "Cornerstone Placed As Moosic Unveils Future Hub For First Responders Greenwood Hose Company Borough Department", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalNear MeHome & BackyardPA Outdoor LifeOnly On 16CommunityHealthwatch 16Newswatch 16 InvestigatesTalkback 16Websites MentionedNation WorldTrafficLatest News StoriesRam causes rush hour mishap near DallasFree roof for Monroe County homeowner Back Local Near Me Home & Backyard PA Outdoor Life Only On 16 Community Healthwatch 16 Newswatch 16 Investigates Talkback 16 Websites Mentioned Nation World Traffic Ram causes rush hour mishap near Dallas Free roof for Monroe County homeowner Back Local Near Me Home & Backyard PA Outdoor Life Only On 16 Community Healthwatch 16 Newswatch 16 Investigates Talkback 16 Websites Mentioned Nation World Traffic Ram causes rush hour mishap near Dallas Free roof for Monroe County homeowner WeatherBackForecastRadarHourly7-DayMapsClosings & DelaysRiversLive CamsEn EspañolLatest Weather StoriesWildfire smoke creates a hazy sky, strawberry moon could actually look red tonight as a resultPronóstico para la semana del 9 - 15 de junio Back Forecast Radar Hourly 7-Day Maps Closings & Delays Rivers Live Cams En Español Wildfire smoke creates a hazy sky, strawberry moon could actually look red tonight as a result Pronóstico para la semana del 9 - 15 de junio Back Forecast Radar Hourly 7-Day Maps Closings & Delays Rivers Live Cams En Español Wildfire smoke creates a hazy sky, strawberry moon could actually look red tonight as a result Pronóstico para la semana del 9 - 15 de junio SportsBackHigh School SportsLocked On Podcast NetworkLatest StoriesNCAA announces new rule changes for men's and women's basketballAaron Rodgers reveals secret marriage during Steelers debut Back High School Sports Locked On Podcast Network NCAA announces new rule changes for men's and women's basketball Aaron Rodgers reveals secret marriage during Steelers debut Back High School Sports Locked On Podcast Network NCAA announces new rule changes for men's and women's basketball Aaron Rodgers reveals secret marriage during Steelers debut SearchSearch:Search Advertise With Us Events Calendar WNEP+ Team Allied Home & Backyard PA Outdoor Life en español Contests Lottery Contact Us Podcasts Photo Galleries Local Focus Meet the Team TV Listings Apps Gas Tracker About Us **Cornerstone placed as Moosic unveils future hub for first responders** **** To stream WNEP on your phone, you need the WNEP app. **** **Download the WNEP app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video MOOSIC, Pa. — Parts of Moosic Borough's past will now be joining its future as members of the Greenwood Hose Company, the mayor's office, and the police department placed items of importance behind the cornerstone of its new emergency services building. “This new facility reflects Moosic's commitment to our police department, our fire department, and our first responders. Giving them the tools and the facilities that they need as they continue to serve and protect and render aid to those in need,\" said Moosic Mayor Bob Bennie. The more than $3 million project sits behind the original Greenwood Hose Company along Birney Avenue. Firefighter Brittain Banull says the new home offers more opportunities that their current location of 47 years just can't handle. “This will offer us more space to get new apparatus to be able to serve Moosic in better ways, in the proper ways. And with that it'll also allow us the opportunity to be able to train. This building has dedicated areas for rope systems we could set up,\" said Banull. \"It's got bigger spaces to store stuff.” Inside the building, Moosic Police Chief Rick Janesko can see his officers’ future department taking shape. “So there'll be a cove here. They can go into. Someone comes to the window, we have to buzz them in the door, buzz them in if they need a copy of a report or need to speak to an officer,” said Chief Janesko. Over the last 3 years, Janesko and his team have operated out of a leased property along Springbrook Avenue. While it's worked out, he's eager for more space. “I'm grateful for the officers that work in Moosic Borough, that come out every day,\" said Janesko. \"And you know, again, we're in a makeshift police station, and they come out every day and do their job without question.” As work continues, both departments are eager to move in so they can continue serving their community. “The community will be able to come in here and see our new location,\" said Janesko. \"They see the police cars driving around, but they don't actually see our building, and this is going to be our home for many, many years.” “It really offers that opportunity to see each other regularly, to really know what's going on, to be able to work and operate together on a regular basis,” said Banull. While the cornerstone is in place, the rest of the construction is set to wrap up at the end of the summer. **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}