{"id": 969, "name": "New Atlas", "domain": "newatlas.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://newatlas.com/science/the-worlds-largest-gold-deposit-is-under-our-feet-and-out-of-reach/", "title": "The Worlds Largest Gold Deposit Is Under Our Feet And Out Of Reach", "content": "SUBSCRIBE LOG IN HOME SCIENCEBiologyEnvironmentMaterialsMedicalPhysicsSpaceView all SCIENCE newsBiologyEnvironmentMaterialsMedicalPhysicsSpaceView all SCIENCE news Biology Environment Materials Medical Physics Space View all SCIENCE news Biology Environment Materials Medical Physics Space View all SCIENCE news Biology Environment Materials Medical Physics Space View all SCIENCE news Biology Environment Materials Medical Physics Space View all SCIENCE news TECHAI & HumanoidsArchitectureConsumer TechEnergyManufacturingMilitaryRoboticsDealsView all TECHNOLOGY newsAI & HumanoidsArchitectureConsumer TechEnergyManufacturingMilitaryRoboticsDealsView all TECHNOLOGY news AI & Humanoids Architecture Consumer Tech Energy Manufacturing Military Robotics Deals View all TECHNOLOGY news AI & Humanoids Architecture Consumer Tech Energy Manufacturing Military Robotics Deals View all TECHNOLOGY news AI & Humanoids Architecture Consumer Tech Energy Manufacturing Military Robotics Deals View all TECHNOLOGY news AI & Humanoids Architecture Consumer Tech Energy Manufacturing Military Robotics Deals View all TECHNOLOGY news TRANSPORTAircraftAutomotiveBicyclesMarineMotorcyclesUrban TransportView all TRANSPORT newsAircraftAutomotiveBicyclesMarineMotorcyclesUrban TransportView all TRANSPORT news Aircraft Automotive Bicycles Marine Motorcycles Urban Transport View all TRANSPORT news Aircraft Automotive Bicycles Marine Motorcycles Urban Transport View all TRANSPORT news Aircraft Automotive Bicycles Marine Motorcycles Urban Transport View all TRANSPORT news Aircraft Automotive Bicycles Marine Motorcycles Urban Transport View all TRANSPORT news OUTDOORCampers & Adventure VehiclesGear & ToolsOutdoor ToysTiny HousesView all OUTDOOR newsCampers & Adventure VehiclesGear & ToolsOutdoor ToysTiny HousesView all OUTDOOR news Campers & Adventure Vehicles Gear & Tools Outdoor Toys Tiny Houses View all OUTDOOR news Campers & Adventure Vehicles Gear & Tools Outdoor Toys Tiny Houses View all OUTDOOR news Campers & Adventure Vehicles Gear & Tools Outdoor Toys Tiny Houses View all OUTDOOR news Campers & Adventure Vehicles Gear & Tools Outdoor Toys Tiny Houses View all OUTDOOR news BODY & MINDMedical InnovationsWellness & Healthy LivingIllnesses and conditionsBrain HealthMedical InnovationsWellness & Healthy LivingIllnesses and conditionsBrain Health Medical Innovations Wellness & Healthy Living Illnesses and conditions Brain Health Medical Innovations Wellness & Healthy Living Illnesses and conditions Brain Health Medical Innovations Wellness & Healthy Living Illnesses and conditions Brain Health Medical Innovations Wellness & Healthy Living Illnesses and conditions Brain Health HOME SCIENCEBiologyEnvironmentMaterialsMedicalPhysicsSpaceView all SCIENCE news Biology Environment Materials Medical Physics Space View all SCIENCE news Biology Environment Materials Medical Physics Space View all SCIENCE news TECHAI & HumanoidsArchitectureConsumer TechEnergyManufacturingMilitaryRoboticsDealsView all TECHNOLOGY news AI & Humanoids Architecture Consumer Tech Energy Manufacturing Military Robotics Deals View all TECHNOLOGY news AI & Humanoids Architecture Consumer Tech Energy Manufacturing Military Robotics Deals View all TECHNOLOGY news TRANSPORTAircraftAutomotiveBicyclesMarineMotorcyclesUrban TransportView all TRANSPORT news Aircraft Automotive Bicycles Marine Motorcycles Urban Transport View all TRANSPORT news Aircraft Automotive Bicycles Marine Motorcycles Urban Transport View all TRANSPORT news OUTDOORCampers & Adventure VehiclesGear & ToolsOutdoor ToysTiny HousesView all OUTDOOR news Campers & Adventure Vehicles Gear & Tools Outdoor Toys Tiny Houses View all OUTDOOR news Campers & Adventure Vehicles Gear & Tools Outdoor Toys Tiny Houses View all OUTDOOR news BODY & MINDMedical InnovationsWellness & Healthy LivingIllnesses and conditionsBrain Health Medical Innovations Wellness & Healthy Living Illnesses and conditions Brain Health Medical Innovations Wellness & Healthy Living Illnesses and conditions Brain Health SUBSCRIBE LOG IN TECH TRANSPORT SCIENCE HEALTH OUTDOOR SUBSCRIBE HOME **World's largest deposit holds 99.999% of all gold on Earth** Facebook Twitter Flipboard LinkedIn Reddit Scientists have discovered the single largest repository of gold in the world that makes Fort Knox look like a piggy bank. Making up 99.999% of all the precious metal on the planet, it's just sitting there for the taking. However, there is a catch. Gold holds a unique place in human culture. It's far more than just an element used in coins or jewelry. Ralph Waldo Emerson said, \"The desire of gold is not for gold. It is for the means of freedom and benefit.\" Yet even that is an understatement. The desire for gold has built and toppled empires. For millennia, it supported the economy of the entire world. And in more than one instance it's become a personal obsession that goes far beyond its market value and ends up with James Bond strapped under a laser. There are many reasons for this. Aside from its unique luster and heaviness, gold has many desirable qualities – especially as a medium of exchange and symbol of wealth. It's relatively easy to refine and assay, chemically inert and immune to corrosion or tarnishing, non-toxic, solid at a reasonable range of temperatures, and easy to transport. It's also extremely malleable, conducts electricity and heat extremely well, and has a surprisingly wide range of industrial uses. Oh, and it's very rare, but not too rare. In the whole of human history, over 216,000 tonnes of gold have been mined or enough to make a cube about 73 feet (22 m) on a side. Since gold is nearly indestructible and has been recycled many times, much of the gold used today dates from prehistoric ages. It's also smuggled and hoarded like, well, gold, so exactly how much there is remains an estimate that doesn't take into account the secret holdings of the powerful or the many jewelry collections of Indian women traditionally kept as a hedge against hard times. However, all that gold is chump change compared to the single greatest deposit still waiting to be tapped that has been the topic of study by scientists at the University of Göttingen. The good news is, they know exactly where this treasure trove is. The bad news is that we can't get to it. The small consolation is that even if we can't get to the gold, it can come to us, albeit very, very slowly. Where is this gold? At the center of the Earth in its molten core. The problem is that all the gold we've mined, along with all the other heavy metals, is essentially a trace found in the light silicate minerals that make up the Earth's crust. The vast majority is deep in the core where it settled as the planet was formed 4.5 billion years ago. This is especially the case with gold because it is a siderophile, or iron-loving, element that likes to associate with the iron that makes up most of the Earth's mass. It must be a happy association because there's enough gold down there to coat the entire surface of the Earth to a depth of 1.5 ft (0.46 m) . All that is very tantalizing and more than a little annoying because what good is all that gold if you can't get at it? What the scientists did was to look at the ratios of ruthenium and tungsten isotopes found in oceanic basalts and picrites from Hawaii, Baffin Island, Galápagos, and La Réunion islands. By measuring the ratios, they saw that there was an odd discrepancy. The ruthenium isotope ¹⁰⁰RU was slightly higher than it should have been. According to the team, this means that rocks containing the isotopes came from deep inside the Earth. The measurements suggest that the ruthenium-containing rocks came from the boundary between the core of the Earth and the Mantle and then to the crust through volcanic vents. In other words, elements, including gold, aren't trapped in the core. Instead, they're migrating slowly upward through plumes circulating from the deepest parts of the molten regions to the mantle and, from there, to areas accessible by us. Of course, if you lack the patience to wait a few hundred million years for new gold deposits to form, you could take the shortcut of going to the asteroids that are the leftovers of the formation of the solar system. Some, like Psyche, are mineral rich without all that pesky planet concealing the goodies. If Psyche contains precious metals like gold, it could be worth a cool US$10,000 quadrillion. How's that for a slice of fried gold? The research was published inNature. Source:University of Göttingen **Tags** Facebook Twitter Flipboard LinkedIn Reddit **Most Viewed** AutomotiveToyota and Lexus no longer most reliable carmakers, says Consumer Reports **Toyota and Lexus no longer most reliable carmakers, says Consumer Reports** **Toyota and Lexus no longer most reliable carmakers, says Consumer Reports** EnergyFrance runs fusion reactor for record 22 minutes **France runs fusion reactor for record 22 minutes** **France runs fusion reactor for record 22 minutes** AutomotiveKawasaki unveils a hydrogen-powered, ride-on robot horse **Kawasaki unveils a hydrogen-powered, ride-on robot horse** **Kawasaki unveils a hydrogen-powered, ride-on robot horse** **FREE NEWSLETTER** HOMESUBSCRIBEFEATURESREVIEWSABOUTADVERTISETERMSPRIVACYCONTACTRSSFAQ SUBSCRIBE FEATURES REVIEWS ABOUT ADVERTISE TERMS PRIVACY CONTACT RSS FAQ SUBSCRIBE FEATURES REVIEWS ABOUT ADVERTISE TERMS PRIVACY CONTACT RSS FAQ SCIENCEBiologyEnvironmentMaterialsMedicalPhysicsSpaceQuantum Computing Biology Environment Materials Medical Physics Space Quantum Computing Biology Environment Materials Medical Physics Space Quantum Computing TECHNOLOGYAI & HumanoidsArchitectureComputersConsumer TechDronesEnergyGood ThinkingHome EntertainmentLifestyleManufacturingMilitaryMusicPetsRemarkable PeopleRoboticsTelecommunicationsVirtual RealityDeals AI & Humanoids Architecture Computers Consumer Tech Drones Energy Good Thinking Home Entertainment Lifestyle Manufacturing Military Music Pets Remarkable People Robotics Telecommunications Virtual Reality Deals AI & Humanoids Architecture Computers Consumer Tech Drones Energy Good Thinking Home Entertainment Lifestyle Manufacturing Military Music Pets Remarkable People Robotics Telecommunications Virtual Reality Deals TRANSPORTAircraftAutomotiveBicyclesMarineMotorcyclesUrban Transport Aircraft Automotive Bicycles Marine Motorcycles Urban Transport Aircraft Automotive Bicycles Marine Motorcycles Urban Transport OUTDOORGearOutdoor VehiclesOutdoor ToysTiny HousesATVs & UTVsBoats & WatersportCampervansCamping TrailersDirtbikesExpedition TrucksKnives & MultitoolsOutdoor CookingPickup CampersRVs & MotorhomesSki & SnowboardSnowmobilesTents Gear Outdoor Vehicles Outdoor Toys Tiny Houses ATVs & UTVs Boats & Watersport Campervans Camping Trailers Dirtbikes Expedition Trucks Knives & Multitools Outdoor Cooking Pickup Campers RVs & Motorhomes Ski & Snowboard Snowmobiles Tents Gear Outdoor Vehicles Outdoor Toys Tiny Houses ATVs & UTVs Boats & Watersport Campervans Camping Trailers Dirtbikes Expedition Trucks Knives & Multitools Outdoor Cooking Pickup Campers RVs & Motorhomes Ski & Snowboard Snowmobiles Tents BODY & MINDIllnesses and conditionsBrain HealthMedical InnovationsAI in HealthImaging & DiagnosticsMedical DevicesPsychedelicsWellness & Healthy LivingAging WellDiet & NutritionFitness & ExerciseSleep Illnesses and conditions Brain Health Medical Innovations AI in Health Imaging & Diagnostics Medical Devices Psychedelics Wellness & Healthy Living Aging Well Diet & Nutrition Fitness & Exercise Sleep Illnesses and conditions Brain Health Medical Innovations AI in Health Imaging & Diagnostics Medical Devices Psychedelics Wellness & Healthy Living Aging Well Diet & Nutrition Fitness & Exercise Sleep twitter instagram pinterest flipboard facebook linkedin"}