{"id": 1625, "name": "WTXL - Tallahassee News", "domain": "wtxl.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wtxl.com/news/local-news/in-your-neighborhood/monticello/monticello-celebrates-74th-annual-watermelon-festival-with-community-spirit-economic-impact", "title": "Monticello Celebrates 74th Annual Watermelon Festival With Community Spirit Economic Impact", "content": "Menu WeatherDaily ForecastHourly ForecastAlertsInteractive RadarHurricane Center Daily Forecast Hourly Forecast Alerts Interactive Radar Hurricane Center Daily Forecast Hourly Forecast Alerts Interactive Radar Hurricane Center Traffic VideoLatest VideoWatch ABC 27 NewsWatch Breaking News Live Latest Video Watch ABC 27 News Watch Breaking News Live Latest Video Watch ABC 27 News Watch Breaking News Live Contests Station InfoAppsContact UsABC 27 News StaffAdvertise with UsEmployment Apps Contact Us ABC 27 News Staff Advertise with Us Employment Apps Contact Us ABC 27 News Staff Advertise with Us Employment Submit a News Tip In Your Neighborhood National News SportsCollege SportsHigh School SportsInside Seminole FootballInside Seminole Basketball College Sports High School Sports Inside Seminole Football Inside Seminole Basketball College Sports High School Sports Inside Seminole Football Inside Seminole Basketball CommunityOur Town Our Town Our Town EntertainmentTV Guide TV Guide TV Guide Lifestyle Sign In Newsletters Sign Out Manage Emails Apps Careers Search Downtown Tallahassee Midtown Tallahassee Northeast Tallahassee Northwest Tallahassee Southeast Tallahassee Southwest Tallahassee College Town Quincy Havana Perry Steinhatchee Crawfordville Panacea Live Oak Thomasville Valdosta Bainbridge Monticello **Actions** Facebook Tweet Email **Monticello celebrates 74th annual watermelon festival with community spirit, economic impact** The Monticello Watermelon Festival celebrates its 74th year, marking a key cultural event in Jefferson County. Events include pageants, parades, bed races, and the Watermelon Run. Watch the video to learn how the festival impacts local small businesses. BROADCAST TRANSCRIPT: Monticello's streets come alive this week as the town marks the 74th annual watermelon festival. “Ever since I was a little girl, I have loved being a part of it,” said neighbor and festival volunteer Teri Naylor. I'm Lentheus Chaney, your Monticello neighborhood reporter, bringing you the story of a festival that has become synonymous with community and tradition in Jefferson County. The Monticello Watermelon Festival began in 1949, initiated by the American Legion to celebrate the local watermelon industry's impact. At its peak in the 1940s, Jefferson County was responsible for producing about 80% of the nation's watermelon seeds, highlighting its agricultural significance. Today, the festival features a range of events, including the Watermelon Queen pageants, parades, bed races, and the popular Watermelon Run. These activities not only entertain but also foster a sense of unity and pride among neighbors and visitors alike. Neighbor and festival volunteer Teri Naylor says it’s the food, the fun, and the fellowship that keeps people coming back each year to experience the festival. \"I grew up here. I was born and raised here and I participated in the Watermelon Festival and in the pageant when I was younger and and so it’s just very rich and tradition and it’s just part of Jefferson County,\" Naylor said. This year's festival also pays tribute to Dr. George Pittman, who has been named grand marshal in recognition of his lifelong dedication to education and civic involvement in Jefferson County. Naylor says that as a small business owner, the festival provides a welcome boost to the bottom line—not just for her, but for businesses across the community. The Monticello Watermelon Festival kicks off with a block party this Friday. Here is a list of scheduled events: June 6 – Kick-Off Block Party June 7 – Kiwanis 5K Watermelon Run & Walk June 9 – Slice & Savor Watermelon Cooking Class June 12 – Women's Club Luncheon & Fashion Show June 13–14 – Festival Day One & Two In Monticello, I’m Lentheus Chaney, ABC27. Want to see more local news? Visit theWTXL ABC 27 Website. Stay in touch with us anywhere, anytime. Like us on Facebook Follow us onInstagramandX. **Sign up for theHeadlines Newsletterand receive up to date information.** **now signed up to receive theHeadlines Newsletter.** **More News In Your Neighborhood** **More News In Your Neighborhood** News Sports First To Know Weather Community Features About Us Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact WTXLABC27 wtxlabc27 abc27 UCqU2iMFdzqfexHNfxTcPJzw/"}