{"id": 2079, "name": "Oh!MyMag", "domain": "ohmymag.co.uk", "bias": "center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.ohmymag.co.uk/entertainment/celebrities/bill-joel-diagnosed-with-a-brain-condition-that-has-forced-him-to-cancel-his-concerts-what-is-nph_art23118.html", "title": "Bill Joel Diagnosed With A Brain Condition That Has Forced Him To Cancel His Concerts What Is Nph_art23118.html", "content": "ConnexionMon compteMon profilMes favorisNotificationsDéconnexion Mon profil Mes favoris Notifications Déconnexion Mon profil Mes favoris Notifications Déconnexion NEWS ENTERTAINMENT WELL-BEING EXPLORE LIFESTYLE CELEBRITIES ROYAL FAMILY WATCH HEALTH PERSONALITY RELATIONSHIPS & SEX STORIES EARTH & SPACE ASTROLOGY PETS BEAUTY & FASHION FOOD & DRINKS TECH NEWS ENTERTAINMENTCELEBRITIESROYAL FAMILYWATCH CELEBRITIES ROYAL FAMILY WATCH CELEBRITIES ROYAL FAMILY WATCH WELL-BEINGHEALTHPERSONALITYRELATIONSHIPS & SEX HEALTH PERSONALITY RELATIONSHIPS & SEX HEALTH PERSONALITY RELATIONSHIPS & SEX EXPLORESTORIESEARTH & SPACEASTROLOGY STORIES EARTH & SPACE ASTROLOGY STORIES EARTH & SPACE ASTROLOGY LIFESTYLEPETSBEAUTY & FASHIONFOOD & DRINKSTECH PETS BEAUTY & FASHION FOOD & DRINKS TECH PETS BEAUTY & FASHION FOOD & DRINKS TECH Newsletter About us General Conditions Contact **Billy Joel diagnosed with a brain condition that has forced him to cancel his concerts: What is NPH?** The Piano Man star pauses his tour amid NPH diagnosis, but he’s not closing the curtain just yet. At 76, Billy Joel has long defied the norms of ageing rock stardom, still thrilling fans with the same gravelly charm and melodic prowess that made him a household name. Discover our latest podcast But recently, the legendary performer revealed that he hadbeen diagnosed with normal pressure hydrocephalus (NPH), a rare brain condition that affects mobility and memory. This comes afterhe postponed his 2025 tour. Despite this sobering announcement,Joel has no plans to retire. Supported by his family and fans, themusician is stepping back only temporarily, determined to prioritise his health. As his wife and daughter rally publicly behind him,Joel remains hopeful and focused on recovery. **Billy Joel shares his diagnosis but vows to return to the stage** Billy Joelannounced on 23 May 2025that he had been diagnosed with normal pressure hydrocephalus (NPH) and would be cancelling all his concerts. The five-time Grammy Award winner had previously postponed tour dates through June, citing a medical condition that required physical therapy. Now, with confirmation of an NPH diagnosis, his management made it official:all remaining shows through 2026 would be scrapped. Yet, the mood surrounding Joel's announcement is far from final. According toPeople, insiders insist that retirement is not on the cards. A music industry source told the publication: A source close to Joel also stated: Joel himself added: Joel addressed his diagnosis directly, saying: Before this announcement, Joel had taken a fall on stage in Connecticut in February, an incident that raised early concerns. Nevertheless, he finished the show. In the following month,he postponed several performances due to a 'medical condition.'Now under the supervision of doctors and undergoing targeted physical therapy, Joel has been advised to step away from the stage temporarily. **His wife Alexis and daughter Alexa offer heartfelt support** In the wake of Billy Joel's announcement, his family has become a strong source of public encouragement.Alexis Roderick Joel, his wife since 2015, shared an update on Instagram. She wrote in the caption of a photo of the couple with their daughters, Della and Remy: Joel's daughter Alexa Ray, from a previous marriage, also took to social media. She posted an artistic portrait of her and her father with the caption: **Understanding NPH** Normal pressure hydrocephalus (NPH) isa rare but serious brain condition, most common in people over 65.It occurs when cerebrospinal fluid builds up in the brain's ventricles, causing pressure that affects various neurological functions. Unlike other types of dementia,NPH is often treatable and sometimes reversible. According to theCleveland Clinic, the primary symptoms are known as Hakim’s triad: gait disturbances, urinary incontinence, and cognitive issues.Patients may find it difficult to lift their feet, often appearing as if they are walking on magnets.Urinary urgency or accidents can occur, and cognitive difficulties might manifest as forgetfulness, slow thinking, or mood changes. Causes of NPH can be either idiopathic (of unknown origin) or secondary,resulting from brain injuries, surgeries, or infections. Diagnosis typically involves brain imaging like MRI scans and sometimes lumbar punctures to relieve pressure. Treatment usually requires surgery to implant a shunt. This device drains excess fluid from the brain into another part of the body, typically the abdomen. According toToday,many patients show significant improvements within days of the procedure.However, outcomes are best when the condition is diagnosed early. Although NPH shares symptoms with Alzheimer’s and Parkinson’s disease, it differs significantly in that the symptoms of NPH can often be reversed. Recovery times vary, but with proper medical intervention, many regain mobility and mental clarity. Read more: Christie Brinkley explains why she divorced Billy Joel in new memoir: 'I never wanted to end things' Billy Joel: The musician's career might be one of the most lucrative in the US Billy Joel: Why the music legend postponed his 2025 tour and when he will perform next Sources used: People: Billy Joel \"Not Ready to Retire\" amid NPH Diagnosis: What the Brain Condition Means for His Future The Independent: Billy Joel’s wife shares update on husband’s brain disorder and ‘recovery’ after tour cancellation Cleveland Clinic: Normal Pressure Hydrocephalus (NPH) Today: Billy Joel Was Diagnosed With a Reversible Type of Dementia. What Are the Symptoms?"}