{"id": 381, "name": "East Idaho News", "domain": "eastidahonews.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.eastidahonews.com/2025/06/looking-back-bear-attacks-idaho-falls-man-and-two-teenagers-and-toddler-pulled-from-irrigation-ditch-miraculously-survives/", "title": "Looking Back Bear Attacks Idaho Falls Man And Two Teenagers And Toddler Pulled From Irrigation Ditch Miraculously Survives", "content": "Idaho Falls news, Rexburg news, Pocatello news, East Idaho news, Idaho news, education news, crime news, good news, business news, entertainment news, Feel Good Friday and more. 69℉ 69℉ Idaho Falls Rexburg Pocatello CitiesIdaho FallsRexburgPocatelloAmmonBlackfootChubbuckRigbySt. AnthonyDriggsStatewide Idaho Falls Rexburg Pocatello Ammon Blackfoot Chubbuck Rigby St. Anthony Driggs Statewide Idaho Falls Rexburg Pocatello Ammon Blackfoot Chubbuck Rigby St. Anthony Driggs Statewide SectionsLocalKohberger CaseDaybell CaseTraffic WebcamsCrime WatchEducationRegional (Idaho/Utah/Wyoming)NationWorldPoliticsOutdoorsArts & EntertainmentBusiness & MoneyFaith & FamilyEast Idaho ElectsSports Local Kohberger Case Daybell Case Traffic Webcams Crime Watch Education Regional (Idaho/Utah/Wyoming) Nation World Politics Outdoors Arts & Entertainment Business & Money Faith & Family East Idaho Elects Sports Local Kohberger Case Daybell Case Traffic Webcams Crime Watch Education Regional (Idaho/Utah/Wyoming) Nation World Politics Outdoors Arts & Entertainment Business & Money Faith & Family East Idaho Elects Sports Features7 QuestionsAsk the DoctorBiz BuzzCourtroom InsiderDave SaysEast Idaho EatsFeel Good FridayIn the GardenLiving the Wild LifeLiving ElevatedLooking BackPet of the WeekSavvy SeniorTasty TuesdayWorkin' ItYou Have To See This!Secret Santa 7 Questions Ask the Doctor Biz Buzz Courtroom Insider Dave Says East Idaho Eats Feel Good Friday In the Garden Living the Wild Life Living Elevated Looking Back Pet of the Week Savvy Senior Tasty Tuesday Workin' It You Have To See This! Secret Santa 7 Questions Ask the Doctor Biz Buzz Courtroom Insider Dave Says East Idaho Eats Feel Good Friday In the Garden Living the Wild Life Living Elevated Looking Back Pet of the Week Savvy Senior Tasty Tuesday Workin' It You Have To See This! Secret Santa Obits Calendar Weather Sports Lifestyles Music Shop Donate **Breaking News** **Local woman who embezzled over $26k sentenced to 5 years probation and restitution** **Breaking News** **Local woman who embezzled over $26k sentenced to 5 years probation and restitution** **Looking back: Bear attacks Idaho Falls man and two teenagers, and toddler pulled from irrigation ditch miraculously survives** IDAHO FALLS — EastIdahoNews.com is looking back at what life was like during the week of June 9 to June 15 in east Idaho history. **1900-1925** BLACKFOOT —A local cook was committed to the insane asylum in Blackfoot, The Bingham County News reported on June 10, 1912. Jennie McDonough had been employed as a cook on the Binnaird Ranch in Mud Lake. The paper said she was “evidently insane and more or less violent by spells.” McDonough claimed to have two children in the orphan’s home in Helena, Montana. “Separation from her children and an unhappy marriage seem to have unsettled her mind,” the article reads. **1926-1950** REXBURG —A two-year-old boy was miraculously rescued after being spotted floating in an irrigation ditch, The Rexburg Standard reported on June 9, 1932. The boy, the son of Mr. and Mrs. Furniss, who were visiting Mr. and Mrs. Dale Garner, of Rexburg, was rescued from a ditch on South First East. The mother reportedly didn’t realize the child was missing until after the child had been rescued. The toddler floated through two or three culverts before he was pulled from the ditch by a passerby. That person then carried the child to a near-by hospital. “The child was breathing easily and sleeping deeply a few hours after the rescue,” the paper said. “However, it might be well for mothers to keep close watch on their small children when the city ditches are so full of water.” **1951-1975** ASHTON —A grizzly bear “severely mauled” an Idaho Falls man and injured two teenagers, the Idaho State Journal reported on June 9, 1967. The state game warden Dale Barney of St. Anthony brought a pack of dogs from Preston into the timber north of Ashton where the search for the bear was underway. The search was focused in Idaho’s Porcupine Forest District, west of Yellowstone National Park. Experienced trackers said the dogs faced a “tough job” as the trail was already two days old and there had since been rain. The U.S. Forest Service said the animal jumpedByrle Walker. Two youths, James Black, 14, and Kristan Sparks, 13, were staying with the timber workers and heard Walker’s screams. They ran to him and were attacked as they tried to distract the bear. As the teenagers tried to chase the animal away with sticks, the bear snapped Black’s right arm with its jaws and left deep bruises in Sparks’ forearms. “The victims told authorities the attack was quick and ruthless,” the article states. “Walker was working a short distance from the two boys when he heard a noise. He turned and the bear charged.” Walker was swatted to the ground. The bear then straddled him and began biting and ripping at him with its claws. Black said the bear knocked him over and he kept swinging a stick in its face. After he was bitten in several places, Black played dead and the grizzly left. Sparks said he thought Walker and Black were both dead. He ran three miles to get help. Walker was eventually taken to Ashton where the doctor who operated on him for more than four hours said, “She was out to kill him. He was ripped in pieces.” The doctor also said Walker needed more than 300 stitches to close the wounds, adding that the father of five “has muscle damage and will be disfigured.” Authorities said that when the teenagers “drew the bear’s attack on themselves” they saved Walker’s life. The teenagers were also hospitalized in Ashton but in less serious condition than Walker’s. The forest service mentioned the bear may be the same one that attacked one of their rangers in the Porcupine area the year before. **1976-2000** POCATELLO —A second-degree burglary charge was dropped against a 21-year-old Utah man, the Idaho State Journal reported on June 15, 1977. Shannon Richmond had been charged with the burglary of the Lava Drug Store that happened in June 1976. Sixth District Judge Arthur P. Oliver dropped the charge following a motion by Bannock County Prosecuting Attorney Garth Pincock. Pincock asked the charge against Richmond be dropped in “the interest of justice” because all the evidence for the case was stolen from the Lava Hot Springs Police Department. No further information about the theft was published at that time. This story is brought to you byNewspapers.com, where a simple search of our newspaper archive transports you to the past. Get a front-row seat to famous events and hidden histories in more than 28,000 historical newspapers from small towns and major cities across the U.S. and beyond. The past: read all about it! SUBMIT A CORRECTION **Support local journalism** We hope you appreciated this story. A small team of local journalists runs EastIdahoNews.com – not a big business or corporation. Our stories are produced to inform and serve the public. We don't have a paywall or require a subscription to use EastIdahoNews.com, but there is a cost associated with bringing you stories every day. Please consider supporting us just once for $1 or, if you're able, contribute a little more monthly or annually. We sincerely appreciate your consideration. Donation amount:$ **MOST POPULAR STORIES** Download Our App Terms of Use Copyright Claims Privacy Statement About Us Contact Us Advertise With Us Careers Our Team Our Ethics Get Email Alerts © 2015 - 2025 EastIdahoNews.com LLC"}