{"id": 1096, "name": "Pharos Tribune", "domain": "pharostribune.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.pharostribune.com/puzzles-palace/", "title": "Puzzles Palace", "content": "Email Local news Community happenings Police/Fire Events State news Nation/world news Features Business Heartland Magazine Comics Puzzles Games Local sports National sports Colts Pacers Indiana Purdue Hoops in the Hoosier State Columns Editorials Letters to the Editor Submit a Letter to the Editor Submit community news Purchase photos Events Celebrations Anniversary Engagements Weddings Births Education Community Directory Destination Cass County Pet Madness Jobs Autos Homes Place An Ad Submit a Public Notice Purchase Photos Submit a Letter to the Editor Submit a News Tip Place an Obituary About us Advertise with us Start a Subscription Manage My Subscription E-Paper App Downloads Newsletter Destination Cass County Weekly Ads Newspaper Ads Search Search Search Contact UsPurchase PhotosSubmit a Letter to the EditorSubmit a News TipPlace an Obituary Purchase Photos Submit a Letter to the Editor Submit a News Tip Place an Obituary Purchase Photos Submit a Letter to the Editor Submit a News Tip Place an Obituary SUBSCRIBEStart a SubscriptionManage My SubscriptionE-PaperApp DownloadsNewsletter Start a Subscription Manage My Subscription E-Paper App Downloads Newsletter Start a Subscription Manage My Subscription E-Paper App Downloads Newsletter Login About usContact usAdvertise with usSubscribeSubscriber ServicesEZPaye-EditionDigital archivesDestination Cass County About us Contact us Advertise with us Subscribe Subscriber Services EZPay e-Edition Digital archives Destination Cass County About us Contact us Advertise with us Subscribe Subscriber Services EZPay e-Edition Digital archives Destination Cass County E-Edition Local EventsSee All EventsAdd Your Event See All Events Add Your Event See All Events Add Your Event Celebrations Obituaries Public NoticesSubmit a Public Notice Submit a Public Notice Submit a Public Notice Photo Galleries Heartland Magazine ContestsReaders ChoiceHealthy Selfie ContestBest Pizza Readers Choice Healthy Selfie Contest Best Pizza Readers Choice Healthy Selfie Contest Best Pizza 84°Logansport, IN(46947)TodayA few clouds. Low 62F. Winds SSW at 10 to 15 mph..TonightA few clouds. Low 62F. Winds SSW at 10 to 15 mph.Updated: June 11, 2025 @ 5:48 pmFull Forecast Logansport, IN(46947)TodayA few clouds. Low 62F. Winds SSW at 10 to 15 mph..TonightA few clouds. Low 62F. Winds SSW at 10 to 15 mph.Updated: June 11, 2025 @ 5:48 pm A few clouds. Low 62F. Winds SSW at 10 to 15 mph.. A few clouds. Low 62F. Winds SSW at 10 to 15 mph. Updated: June 11, 2025 @ 5:48 pm Full Forecast Logansport, IN(46947)TodayA few clouds. Low 62F. Winds SSW at 10 to 15 mph..TonightA few clouds. Low 62F. Winds SSW at 10 to 15 mph.Updated: June 11, 2025 @ 5:48 pm A few clouds. Low 62F. Winds SSW at 10 to 15 mph.. A few clouds. Low 62F. Winds SSW at 10 to 15 mph. Updated: June 11, 2025 @ 5:48 pm A few clouds. Low 62F. Winds SSW at 10 to 15 mph.. A few clouds. Low 62F. Winds SSW at 10 to 15 mph. Updated: June 11, 2025 @ 5:48 pm Full Forecast Print Edition Facebook **Brian Wilson, Beach Boys visionary leader and s…** **PHOTOS: Winners at the 2025 Pharos-Tribune Spor…** **Century Career Center Co-op Student: Ashlyn Brumett** **Century Career Center Intern: Ashlyn Brumett** **Trending Recipes** **Obituaries** More Obituaries **Most Popular** Articles Images Videos Commented LHS principal Matt Jones leaves legacy of humility, kindness, opportunity Ten months after scoliosis surgery, LHS' Evan Brandstatter thriving on the golf course Century Career Center Co-op Student: Lucas Perry Silver Alert issued for missing Logansport woman; in 'extreme danger' BOYS GOLF: Logansport wins sectional title; Pioneer advances as a team GIRLS TRACK: Logansport's Ashanta Curry gears for State Finals Sports Awards: County’s top student-athletes recognized at event Trump on Capitol Hill implores divided Republicans to unify behind his big tax cuts bill SECTIONAL ROUNDUP: Risley pitches perfect game as Logan rolls to win Colts owner Jim Irsay dies at 65 Sorry, there are no recent results for popular commented articles. **Videos** **20250530_103043.mp4** guest5 **Drone814** guest5 **Brilea Southard released video** Riley Hospital For Children **Lt. Justin Sears of the THPD on Thursday's plane crash at Terre Haute Regional Airport** **Video: Maddy Willis performs \"Hopelessly Devoted to You\"** Josh Flynn | Pharos-Tribune **Photo Galleries** **PHOTOS: Winners at the 2025 Pharos-Tribune Sports Awards** 5 hrs ago **Photos: Class of 2025 graduates at Lewis Cass** Josh Flynn Pharos-Tribune Jun 8, 2025 **PHOTOS: Pioneer and Logansport at boys golf sectional** Andrea Bridge | For the Pharos-Tribune Jun 6, 2025 **PHOTOS: Caston vs. Tri-County at baseball sectional** Adryanna Sellers | For the Pharos-Tribune Jun 3, 2025 **PHOTOS: Cass vs. Oak Hill at sectional** Adryanna Sellers | For the Pharos-Tribune Jun 2, 2025 **PHOTOS: Western vs Logan softball sectional** Kelly Lafferty Jun 2, 2025 **Featured Local Savings** Sign up now to get our FREE breaking news coverage delivered right to your inbox. First Amendment:Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances. About Us Contact Us Advertise with Us Subscriber Services Site Forms Delivery Contractor Information Cookie Preferences Home News Comics Puzzles Sports Community Opinion Obituaries Weather Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}