{"id": 1518, "name": "US Climate Action Network", "domain": "usclimatenetwork.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.usclimatenetwork.org/looking-for-director-of-operations", "title": "Looking For Director Of Operations", "content": "**US Climate Action Network** Home Home Home Home Ways to GiveDonateDonor Advised Fund Ways to Give Donate Donor Advised Fund Ways to Give Ways to Give Donate Donor Advised Fund AboutStrategic PlanUSCAN MembersUSCAN StaffOur HistoryNews & MediaResources About Strategic Plan USCAN Members USCAN Staff Our History News & Media Resources About About Strategic Plan USCAN Members USCAN Staff Our History News & Media Resources Looking For: Director of Operations Looking For: Director of Operations Looking For: Director of Operations Looking For: Director of Operations Become a Member Become a Member Become a Member Become a Member USCAN Statements USCAN Statements USCAN Statements USCAN Statements JEDI JEDI JEDI JEDI Climate Action Network International Climate Action Network International Climate Action Network International Climate Action Network International More More More Looking For: Director of Operations **Director of Operations** Job Title:Director of Operations ​ Reports To:Executive Director ​ Location:Remote, with a preference for Washington, D.C.-area ​ Travel:The position will require occasional domestic and international travel ​​ **Please Apply Here** ​ About US Climate Action Network (USCAN): ​ The US Climate Action Network (USCAN) is a powerful network of over 175 organizations working to fight climate change and promote equity and justice. We are the U.S. node of the Climate Action Network International (CAN-I), the world’s largest network working to promote government and individual action to limit human-induced climate change to ecologically sustainable levels. USCAN members place a high priority on both environmental protection and social justice. ​ Job Summary: ​ The Director of Operations is a critical leadership role responsible for the effective and efficient operation of USCAN. This position oversees a wide range of operational functions, including finance, human resources, IT, and administration, ensuring the organization has the necessary infrastructure and resources to achieve its mission. The Director of Operations will supervise the Network Systems Administrator, Members Relationship Manager, and work closely with the Executive Director and the Board of Directors. ​ Key Responsibilities: ​ Financial Management:Oversee all financial operations, including budgeting, forecasting, and financial reporting.Manage relationships with external accounting and bookkeeping service providers.Ensure compliance with all financial regulations and reporting requirements.Analyze financial data and provide recommendations to the Executive Director and Board. Financial Management: Oversee all financial operations, including budgeting, forecasting, and financial reporting. Oversee all financial operations, including budgeting, forecasting, and financial reporting. Manage relationships with external accounting and bookkeeping service providers. Manage relationships with external accounting and bookkeeping service providers. Ensure compliance with all financial regulations and reporting requirements. Ensure compliance with all financial regulations and reporting requirements. Analyze financial data and provide recommendations to the Executive Director and Board. Analyze financial data and provide recommendations to the Executive Director and Board. Financial Management: Oversee all financial operations, including budgeting, forecasting, and financial reporting. Oversee all financial operations, including budgeting, forecasting, and financial reporting. Oversee all financial operations, including budgeting, forecasting, and financial reporting. Manage relationships with external accounting and bookkeeping service providers. Manage relationships with external accounting and bookkeeping service providers. Manage relationships with external accounting and bookkeeping service providers. Ensure compliance with all financial regulations and reporting requirements. Ensure compliance with all financial regulations and reporting requirements. Ensure compliance with all financial regulations and reporting requirements. Analyze financial data and provide recommendations to the Executive Director and Board. Analyze financial data and provide recommendations to the Executive Director and Board. Analyze financial data and provide recommendations to the Executive Director and Board. Human Resources:Manage all aspects of the employee lifecycle, including recruitment, onboarding, performance management, and offboarding.Oversee payroll and benefits administration in collaboration with external providers.Develop and implement HR policies and procedures.Ensure compliance with all labor laws and regulations. Human Resources: Manage all aspects of the employee lifecycle, including recruitment, onboarding, performance management, and offboarding. Manage all aspects of the employee lifecycle, including recruitment, onboarding, performance management, and offboarding. Oversee payroll and benefits administration in collaboration with external providers. Oversee payroll and benefits administration in collaboration with external providers. Develop and implement HR policies and procedures. Develop and implement HR policies and procedures. Ensure compliance with all labor laws and regulations. Ensure compliance with all labor laws and regulations. Human Resources: Manage all aspects of the employee lifecycle, including recruitment, onboarding, performance management, and offboarding. Manage all aspects of the employee lifecycle, including recruitment, onboarding, performance management, and offboarding. Manage all aspects of the employee lifecycle, including recruitment, onboarding, performance management, and offboarding. Oversee payroll and benefits administration in collaboration with external providers. Oversee payroll and benefits administration in collaboration with external providers. Oversee payroll and benefits administration in collaboration with external providers. Develop and implement HR policies and procedures. Develop and implement HR policies and procedures. Develop and implement HR policies and procedures. Ensure compliance with all labor laws and regulations. Ensure compliance with all labor laws and regulations. Ensure compliance with all labor laws and regulations. Risk Management:Identify and assess potential organizational risks.Develop and implement risk mitigation strategies.Oversee insurance policies and ensure adequate coverage. Risk Management: Identify and assess potential organizational risks. Identify and assess potential organizational risks. Develop and implement risk mitigation strategies. Develop and implement risk mitigation strategies. Oversee insurance policies and ensure adequate coverage. Oversee insurance policies and ensure adequate coverage. Risk Management: Identify and assess potential organizational risks. Identify and assess potential organizational risks. Identify and assess potential organizational risks. Develop and implement risk mitigation strategies. Develop and implement risk mitigation strategies. Develop and implement risk mitigation strategies. Oversee insurance policies and ensure adequate coverage. Oversee insurance policies and ensure adequate coverage. Oversee insurance policies and ensure adequate coverage. Performance Evaluation:Develop and implement systems for monitoring and evaluating organizational performance.Track progress towards strategic goals and objectives.Identify areas for improvement and make recommendations to the Executive Director and Board. Performance Evaluation: Develop and implement systems for monitoring and evaluating organizational performance. Develop and implement systems for monitoring and evaluating organizational performance. Track progress towards strategic goals and objectives. Track progress towards strategic goals and objectives. Identify areas for improvement and make recommendations to the Executive Director and Board. Identify areas for improvement and make recommendations to the Executive Director and Board. Performance Evaluation: Develop and implement systems for monitoring and evaluating organizational performance. Develop and implement systems for monitoring and evaluating organizational performance. Develop and implement systems for monitoring and evaluating organizational performance. Track progress towards strategic goals and objectives. Track progress towards strategic goals and objectives. Track progress towards strategic goals and objectives. Identify areas for improvement and make recommendations to the Executive Director and Board. Identify areas for improvement and make recommendations to the Executive Director and Board. Identify areas for improvement and make recommendations to the Executive Director and Board. IT Infrastructure:Manage and maintain the organization's IT infrastructure, including hardware, software, and network systems.Ensure data security and privacy.Oversee IT vendors and service providers. IT Infrastructure: Manage and maintain the organization's IT infrastructure, including hardware, software, and network systems. Manage and maintain the organization's IT infrastructure, including hardware, software, and network systems. Ensure data security and privacy. Ensure data security and privacy. Oversee IT vendors and service providers. Oversee IT vendors and service providers. IT Infrastructure: Manage and maintain the organization's IT infrastructure, including hardware, software, and network systems. Manage and maintain the organization's IT infrastructure, including hardware, software, and network systems. Manage and maintain the organization's IT infrastructure, including hardware, software, and network systems. Ensure data security and privacy. Ensure data security and privacy. Ensure data security and privacy. Oversee IT vendors and service providers. Oversee IT vendors and service providers. Oversee IT vendors and service providers. Equipment and Supplies:Manage the procurement and maintenance of office equipment and supplies.Negotiate contracts with vendors. Equipment and Supplies: Manage the procurement and maintenance of office equipment and supplies. Manage the procurement and maintenance of office equipment and supplies. Negotiate contracts with vendors. Negotiate contracts with vendors. Equipment and Supplies: Manage the procurement and maintenance of office equipment and supplies. Manage the procurement and maintenance of office equipment and supplies. Manage the procurement and maintenance of office equipment and supplies. Negotiate contracts with vendors. Negotiate contracts with vendors. Negotiate contracts with vendors. Grant Management:Oversee the grant application and reporting process.Ensure compliance with grant requirements. Grant Management: Oversee the grant application and reporting process. Oversee the grant application and reporting process. Ensure compliance with grant requirements. Ensure compliance with grant requirements. Grant Management: Oversee the grant application and reporting process. Oversee the grant application and reporting process. Oversee the grant application and reporting process. Ensure compliance with grant requirements. Ensure compliance with grant requirements. Ensure compliance with grant requirements. Contract Management:Review and negotiate contracts with vendors and partners.Ensure compliance with contractual obligations. Contract Management: Review and negotiate contracts with vendors and partners. Review and negotiate contracts with vendors and partners. Ensure compliance with contractual obligations. Ensure compliance with contractual obligations. Contract Management: Review and negotiate contracts with vendors and partners. Review and negotiate contracts with vendors and partners. Review and negotiate contracts with vendors and partners. Ensure compliance with contractual obligations. Ensure compliance with contractual obligations. Ensure compliance with contractual obligations. Supervision:Supervise the Network Systems Administrator, and Members Relationship Manager, providing guidance, support, and performance feedback. Supervision: Supervise the Network Systems Administrator, and Members Relationship Manager, providing guidance, support, and performance feedback. Supervise the Network Systems Administrator, and Members Relationship Manager, providing guidance, support, and performance feedback. Supervision: Supervise the Network Systems Administrator, and Members Relationship Manager, providing guidance, support, and performance feedback. Supervise the Network Systems Administrator, and Members Relationship Manager, providing guidance, support, and performance feedback. Supervise the Network Systems Administrator, and Members Relationship Manager, providing guidance, support, and performance feedback. ​ Qualifications: 7+ years of experience in operations management, preferably in the non-profit sector. 7+ years of experience in operations management, preferably in the non-profit sector. 7+ years of experience in operations management, preferably in the non-profit sector. Strong understanding of financial management, human resources, and risk management principles. Strong understanding of financial management, human resources, and risk management principles. Strong understanding of financial management, human resources, and risk management principles. Experience with grant management and contract negotiation. Experience with grant management and contract negotiation. Experience with grant management and contract negotiation. Excellent organizational, communication, and interpersonal skills. Excellent organizational, communication, and interpersonal skills. Excellent organizational, communication, and interpersonal skills. Ability to work independently and as part of a team. Ability to work independently and as part of a team. Ability to work independently and as part of a team. Passion for USCAN's mission and commitment to addressing climate change. Passion for USCAN's mission and commitment to addressing climate change. Passion for USCAN's mission and commitment to addressing climate change. Desired skills: Financial Management: Budgeting, forecasting, financial reporting, and compliance. Financial Management: Budgeting, forecasting, financial reporting, and compliance. Financial Management: Budgeting, forecasting, financial reporting, and compliance. Human Resources: The Director will manage HR aspects, including recruitment, onboarding, performance management, and compliance with labor laws. Human Resources: The Director will manage HR aspects, including recruitment, onboarding, performance management, and compliance with labor laws. Human Resources: The Director will manage HR aspects, including recruitment, onboarding, performance management, and compliance with labor laws. Risk Management: Identifying and mitigating organizational risks. Risk Management: Identifying and mitigating organizational risks. Risk Management: Identifying and mitigating organizational risks. Grant and Contract Management: Experience in these areas, especially within the non-profit sector, is highly valuable. Grant and Contract Management: Experience in these areas, especially within the non-profit sector, is highly valuable. Grant and Contract Management: Experience in these areas, especially within the non-profit sector, is highly valuable. Communication and Interpersonal Skills: The Director will interact with various stakeholders and must have excellent communication skills. Communication and Interpersonal Skills: The Director will interact with various stakeholders and must have excellent communication skills. Communication and Interpersonal Skills: The Director will interact with various stakeholders and must have excellent communication skills. Organizational Skills: Managing multiple responsibilities and ensuring deadlines are met requires strong organizational skills. Organizational Skills: Managing multiple responsibilities and ensuring deadlines are met requires strong organizational skills. Organizational Skills: Managing multiple responsibilities and ensuring deadlines are met requires strong organizational skills. Leadership Skills: The Director will supervise staff and must be able to provide guidance, support, and feedback. Leadership Skills: The Director will supervise staff and must be able to provide guidance, support, and feedback. Leadership Skills: The Director will supervise staff and must be able to provide guidance, support, and feedback. Strategic Thinking: The ability to analyze financial data and make recommendations, track progress towards strategic goals, and identify areas for improvement are all important aspects of the role. Strategic Thinking: The ability to analyze financial data and make recommendations, track progress towards strategic goals, and identify areas for improvement are all important aspects of the role. Strategic Thinking: The ability to analyze financial data and make recommendations, track progress towards strategic goals, and identify areas for improvement are all important aspects of the role. Nonprofit Experience: While not explicitly required, experience in the nonprofit sector is preferred and would likely be considered highly desirable. Nonprofit Experience: While not explicitly required, experience in the nonprofit sector is preferred and would likely be considered highly desirable. Nonprofit Experience: While not explicitly required, experience in the nonprofit sector is preferred and would likely be considered highly desirable. Passion for USCAN's Mission: A commitment to addressing climate change and promoting equity and justice aligns with USCAN's core values. Passion for USCAN's Mission: A commitment to addressing climate change and promoting equity and justice aligns with USCAN's core values. Passion for USCAN's Mission: A commitment to addressing climate change and promoting equity and justice aligns with USCAN's core values. ​ Compensation and Benefits: ​ The salary range for this position is between $115,000 - $130,000, commensurate with qualifications and experience. Experience and skills will be carefully considered for this critical role, rather than salary history, so candidates with the requisite skills but a smaller current salary are encouraged to apply. In addition, USCAN strives to offer generous benefits to attract and retain qualified staff, but staff benefits are not mandatory expenditures of the organization, except where defined by U.S. and D.C. law. USCAN offers Healthcare, Dental insurance, short term life insurance, family/parental leave, 401(k) and phone. Medical and Dental insurance is offered to USCAN employees and one family affiliate, such as their spouse/domestic partner or their child/dependent. The U.S. Climate Action Network encourages diversity and prohibits discrimination in the office place. The organization exceeds the anti-discrimination policies of the District of Columbia and of the federal government. Specifically, USCAN prohibits discrimination in hiring on the basis of race, color, religion, national origin, sex, age, marital status, personal appearance, sexual orientation, disability, matriculation, political affiliation, source of income, place of residence or business, gender identity, or socio-economic status. How to Apply: Apply for this position by usingthis formto submit cover letter, resume, and to answer a few brief questions. ​The deadline to apply is April 4. Metro Offices (Metro Center) 700 12th Street NW Suite 700 Washington, DC 20005-4052 Phone:(301) 375-0476 operations@usclimatenetwork.org **Contact us** **​** ​ **Follow us on Instagram**"}