{"id": 1950, "name": "Earth First Journal", "domain": "earthfirstjournal.news", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://earthfirstjournal.news/2024/04/12/southern-oregon-treesitters-protest-old-growth-logging-from-100-feet-above-the-forest-floor/", "title": "Southern Oregon Treesitters Protest Old Growth Logging From 100 Feet Above The Forest Floor", "content": "EF! Newswire Downloads Subscribe StoreCart Cart Cart Get Involved!DirectoryFriends of EF!SubmissionsEventsDonate Directory Friends of EF! Submissions Events Donate Directory Friends of EF! Submissions Events Donate Prisoner SupportEco-Prisoner ListInformants Eco-Prisoner List Informants Eco-Prisoner List Informants AboutContact Contact Contact Archive Menu **Southern Oregon Treesitters Protest Old-Growth Logging from 100 Feet Above the Forest Floor** fromOBP A tree sitter is stationed at the top of an old-growth ponderosa pine in the U.S. Bureau of Land Management’s Poor Windy project area in Josephine County, Ore. A group of activists is fighting proposed logging in the Poor Windy project area. In dense forests off I-5 in Josephine County, Oregon, up a few miles of winding dirt roads, a handful of tents, a hammock and an acoustic guitar mark the camp of those describing themselves as “forest defenders.” This land, at the foothills of the Cascades, is a checkerboard of private and public ownership. The square of thick forest where activists have been camping for a week is managed by the Bureau of Land Management, part of the agency’s 11,000-acrePoor Windy projectthat includes areas slated for commercial timber harvest as well as forest thinning to prevent wildfires from getting out of control. One activist, who wants to go by just “Taylor,” gestured to some of the larger trees among the camp. “You can kind of see the ones with the orange markings around them here. These are all old-growth trees,” she said. What makes a tree “old growth” can vary. But for the BLM, trees between 36 to 40 inches in diameter, depending on the area, and over 174 years old are generally off-limits to logging. At the top of one of these trees, a massive Ponderosa pine with a thin band of orange paint around its trunk, a big banner reads: “No Old Growth Logging in a Climate Crisis.” There’s a small platform attached to the trunk near the top, over 100 feet above the forest floor. “How’s the view up there?” yelled Taylor to the tree sitter, who declined to give their name, stationed on the platform. “It’s beautiful. I see mountains all around. I see a lot of other old-growth trees along this ridgeline,” they yelled down. “I’m up here to send a message to the Bureau of Land Management, that there are people watching them. And that we’re here to protest old-growth logging,” they said, speaking over a radio. The activists here claim a logging company plans to put a road through this spot — that’s why they’ve chosen this location as their camp. Despite these old-growth trees being marked for protection, loggers can cut them down if they are in the way. George Sexton, conservation director with the Ashland-based environmental nonprofit Klamath-Siskiyou Wildlands Center, calls it a loophole. “Where those tree sitters are shows that the BLM is in fact logging old-growth trees that are older than our nation,” said Sexton. In 2022, President Biden signed an executive order directing federal agencies to inventory old-growth forests and develop policies for their protection. But some conservation groups think the federal government isn’t doing enough and, in response, they have been fighting timber sales like this one. Nearly 40 organizations recently sent a letter to Interior Secretary Deb Haaland and BLM Director Tracy Stone-Manning demanding the cancellation of the Poor Windy project. The BLM has already scaled back the plan, dropping around 10,000 acres, after a judge found it harmed protected spotted owl habitat. And environmental groups recently filed a complaint against the BLM to protect old-growth forest in the Rogue Gold Forest Management Project near Gold Hill in Southern Oregon. “The BLM needs to faithfully implement old-growth protections, which they’re not doing right now. Or they need to acknowledge that they’re logging old growth and explain why they’re doing it,” said Sexton, whose organization was party to both of those lawsuits. A spokesperson with the BLM’s Medford office, meanwhile, said that old-growth logging isn’t the goal for these projects. “We work really hard to design timber sales and access roads to have the least amount of impact. We hear from our timber operators that they don’t want to cut those larger trees. It’s a safety issue. It increases the costs,” said Kyle Sullivan, a BLM spokesperson. He said that there are barely any mills left in Oregon that can take old-growth sized logs and claimed those large trees that are felled are left on the forest floor to become wildlife habitat. The BLM has legal requirements for how to manage forests in Josephine County, Sullivan said. The Oregon and California Revested Lands Sustained Yield Management Act of 1937 — better known as the O&C Act — mandates the region be managed for permanent timber production. The BLM’s 2016 Southwest Oregon Resource Management Plan sets the quantity of timber sales and also prescribes thinning out forests to reduce fuel for wildfire. “Some studies have shown that over 51% of forests in southwest Oregon are overly dense and in need of treatment. And so the actions that the BLM designs help reduce that competition, they can open up the canopy,” said Sullivan. Although there’s disagreement about whether BLM’s actions in this area will help control wildfires. Sexton, with KS Wild, thinks the Poor Windy project will increase wildfire risk. He claimed that the agency’s efforts at reducing the forest canopy and the planting of Douglas fir trees can raise fire hazards. The BLM, meanwhile, sees those actions as vital to treating forests that have become overgrown after decades of fire suppression. Studies do show that old-growth trees are more resilient to fire. Back at the “forest defender” camp at Poor Windy, while details of forest management are debated in court, this tree sitter deals with more immediate challenges. “Well the sale is called Poor Windy. And it does sometimes get pretty windy up here. So that’s kind of the biggest challenge,” they said. Despite the weather, they don’t plan to come down soon. “How long you plan on being up there for?” Taylor yelled into the canopy high above their head. “As long as it takes!” came the reply. **Post navigation** **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. Δ **Cart** **Recent Posts** Another Summer, Another Earth First! Summer GatheringApril 13, 2025 Searching for More OC Info? Look No FurtherMarch 11, 2025 The Earth First! OC is Right Around the CornerFebruary 6, 2025 An Anti-Snitch Oral History of the Seattle WTO ProtestsAugust 17, 2024 Protecting a Florida Coastal Preserve from DeSantis Campus TakeoverJune 8, 2024 Earth First! Journal, Spring 2024April 27, 2024 Southern Oregon Treesitters Protest Old-Growth Logging from 100 Feet Above the Forest FloorApril 12, 2024 Spring Skill Share in Humboldt this MarchFebruary 19, 2024 **Archives** April 2025 March 2025 February 2025 August 2024 June 2024 April 2024 February 2024 January 2024 August 2023 July 2023 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 December 2022 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 October 2021 June 2021 May 2021 April 2021 March 2021 February 2021 January 2021 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 November 2012 October 2012 September 2012 August 2012 July 2012 June 2012 May 2012 April 2012 March 2012 February 2012 January 2012 December 2011 November 2011 October 2011 September 2011 August 2011 July 2011 June 2011 May 2011 April 2011 March 2011 February 2011 January 2011 December 2010 November 2010 October 2010 September 2010 August 2010 July 2010 June 2010 May 2010 February 2010 **Categories** Analysis Anarchist Movement Animal Liberation Animal Liberation Front Animals Fight Back AnnouncementsCalls to Action Calls to Action Calls to Action Anti-Fascism Atlanta Forest Black Liberation Climate Change Direct ActionArmed StruggleArsonEncampments and OccupationsLockdowns and BlockadesRiots and RebellionsSabotageSlowdowns, Stoppages, and StrikesTree SpikingTreesitsVandalism Armed Struggle Arson Encampments and Occupations Lockdowns and Blockades Riots and Rebellions Sabotage Slowdowns, Stoppages, and Strikes Tree Spiking Treesits Vandalism Armed Struggle Arson Encampments and Occupations Lockdowns and Blockades Riots and Rebellions Sabotage Slowdowns, Stoppages, and Strikes Tree Spiking Treesits Vandalism Direct Action Alerts Direct Action Reports Earth First! History Earth Liberation Front Ecological CollapseBiodiversity LossClimate CatastropheIndustrial DisasterNatural DisastersSocial and Economic Collapse Biodiversity Loss Climate Catastrophe Industrial Disaster Natural Disasters Social and Economic Collapse Biodiversity Loss Climate Catastrophe Industrial Disaster Natural Disasters Social and Economic Collapse Environmental Justice Events Factory Farms Fallen Warriors Hunting Indigenous ResistanceLand RightsWater Protection Land Rights Water Protection Land Rights Water Protection Industrial Agriculture InfrastructureDamsDevelopmentMiningOil ExtractionPipelinesPortsRailRoadsWater Dams Development Mining Oil Extraction Pipelines Ports Rail Roads Water Dams Development Mining Oil Extraction Pipelines Ports Rail Roads Water International Eco-DefenseAfricaAsiaAustraliaCentral AmericaEuropeNorth AmericaOceaniaSouth America Africa Asia Australia Central America Europe North America Oceania South America Africa Asia Australia Central America Europe North America Oceania South America Labor Movement Land DefenseForest Defense Forest Defense Forest Defense Lawsuits and Paperwrenching Logging MagazinesCall for Submissions Call for Submissions Call for Submissions Migration and Borders News Ocean Defense Oil Industry Prisoner SolidarityJune 11 June 11 June 11 Public Health Radical Environmental Events Scientific Studies Self-Care Social Justice Solidarity State RepressionCounterinsurgencyExtrajudicial ViolenceFire to the PrisonsFuck the PoliceInformantsSurveillance Counterinsurgency Extrajudicial Violence Fire to the Prisons Fuck the Police Informants Surveillance Counterinsurgency Extrajudicial Violence Fire to the Prisons Fuck the Police Informants Surveillance Strategy and Analysis Tar Sands Translated Articles Uncategorized Victories Wild and Weird Wilderness Earth First! Journal PO Box 459 Athens, OH 45701 (561) 320-3840‬ collective@earthfirstjournal.news"}