{"id": 168, "name": "Brown Political Review", "domain": "brownpoliticalreview.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://brownpoliticalreview.org/xtwitter-marks-the-spot-the-bjps-use-of-social-media-extends-their-attacks-on-sikhs-across-borders/", "title": "Xtwitter Marks The Spot The Bjps Use Of Social Media Extends Their Attacks On Sikhs Across Borders", "content": "U.S.EducationRhode IslandElectionsForeign PolicyHealthLaw/Justice Education Rhode Island Elections Foreign Policy Health Law/Justice Education Rhode Island Elections Foreign Policy Health Law/Justice WorldAfricaAsia/PacificEuropeLatin AmericaMiddle East Africa Asia/Pacific Europe Latin America Middle East Africa Asia/Pacific Europe Latin America Middle East Economy Interviews MultimediaMediaData24castBPRadio Media Data 24cast BPRadio Media Data 24cast BPRadio Magazine AboutAboutMastheadPitch an Article!Join BPR!High School ProgramDonateContact Us About Masthead Pitch an Article! Join BPR! High School Program Donate Contact Us About Masthead Pitch an Article! Join BPR! High School Program Donate Contact Us U.S.EducationRhode IslandElectionsForeign PolicyHealthLaw/Justice Education Rhode Island Elections Foreign Policy Health Law/Justice Education Rhode Island Elections Foreign Policy Health Law/Justice WorldAfricaAsia/PacificEuropeLatin AmericaMiddle East Africa Asia/Pacific Europe Latin America Middle East Africa Asia/Pacific Europe Latin America Middle East Economy Interviews MultimediaMediaData24castBPRadio Media Data 24cast BPRadio Media Data 24cast BPRadio Magazine AboutAboutMastheadPitch an Article!Join BPR!High School ProgramDonateContact Us About Masthead Pitch an Article! Join BPR! High School Program Donate Contact Us About Masthead Pitch an Article! Join BPR! High School Program Donate Contact Us Home > World > X(Twitter) Marks the Spot: The BJP’s Use of Social Media Extends Their Attacks on Sikhs Across Borders **X(Twitter) Marks the Spot: The BJP’s Use of Social Media Extends Their Attacks on Sikhs Across Borders** Just months after then-Prime Minister Justin Trudeau sent shockwaves through the international community byaccusingthe Indian government of assassinating a Sikh activist in Vancouver, the United States Department of Justice announced its success in thwarting a similarattemptagainst an American Sikh leader in New York City. Beyond reflecting a recent rise in anti-Sikh violence, the plots to kill Hardeep Singh Nijjar in Canada and Gurpatwant Singh Pannun in the US represent a dangerous new tactic of an increasingly authoritarian Indian government—a strong arm of populism that extends across borders, especially via social media. Despite the fact that they are legally recognized as a minority group, Sikhs have often faced persecution in India, especially at the hands of the state. From the 1947 Partition of India and Pakistan thatdisplaced or killedsignificant numbers of the Sikh population to the 1984 anti-Sikh riots in Delhi that resulted in the deaths ofnearly three-thousandindividuals, Sikhs have historically been the target of prejudiced violence. With the rise of social media, however, prejudice and propaganda against Sikhs have taken on a new form. It is easier than ever for the Indian state to spread its populist rhetoric with detrimental consequences on vulnerable minority groups while slipping under the radar of mainstream media. Social media censorship is one of the primary tactics that the state is using to target Sikhs. The Indian government has demanded that platforms such as X (also known as Twitter) remove over500accounts, including those based in the US, for merely posting content relating to Sikhism or Sikh activism. The social media company revealed that, under the threat of imprisonment for its local employees, it was forced to comply. Similarly, Instagram faced criticism from the Sikh American Legal Defense and Education Fund, Khalsa Aid, and the World Sikh Organization forblocking“#Sikh” on the platform around the anniversary of the 1984 anti-Sikh riots, in which thousands of Sikhs werekilledfollowing the assassination of Indira Gandhi by her Sikh bodyguards. YouTube—at the request of the Indian government—alsoremovedseveral songs that were created by Punjabi artists as a form of pro-Sikh activism. This suppression is not unique to Sikhs either. Social media censorship and targeting have alsoextendedto journalists who report on hate crimes against Muslims in India. The state’s use of censorship can only be described as an authoritarian effort to stifle dissent that challenges the Hindu nationalist ideologies of Prime Minister Narendra Modi and his Bharatiya Janata Party (BJP). This level of censorship should be of particular concern to the international community, because it not only impacts minorities within India’s borders, but also members of diaspora communities around the world. In fact, members of the Sikh diaspora have often been some of the first to spread information about the censorship of Sikhs on social media, even when mainstream media has failed to cover the issue. The Indian state’s manipulation of social media platforms was also particularly evident during the height of the 2020-2021Indian Farmers’ Protests. The backlash began when the BJP, in an attempt to modernize India’s farming practices and stimulate agricultural sales to private entities,removedthe minimum price threshold for outside entities to buy crops. Farmers, fearing that this policy would place guaranteed prices for several essential cash crops at risk—especially in the smaller markets of Punjab and Haryana—decided to protest. Because Sikh populations are most heavily concentrated in these northern regions of India, many of the farmers who started and joined the Farmers’ Protests were Sikhs who relied on agriculture to make a living. As the protests garnered international attention, one medium in particular became a prominent site of discourse: Social media. Although itenabledcountless Sikhs in the diaspora to mobilize and organize in solidarity with the protests that were taking place on the ground in Punjab, social media also became a site of state interference. Government accounts on X, WhatsApp, and Facebooklegitimizedmisinformation—such asforgedvideos and graphics of alleged protests—in order toinciteviolence against Sikhs. Strategies also includedpostingedited videos and photographs from previous protests in attempts tofalselyassociate participants of the Farmers’ Protest with separatist movements. This conflation of the Farmers’ Protest with Sikh separatist movements wrongfully provided the populist government with a means to write off struggling agricultural workers as so-called religious extremists. Even more concerning is the state’s use of social media interference tophysicallytarget activists and dissidents. One such case occurred in 2019, when an 18-year-old wasarrestedin India for liking a Facebook poem that promoted Sikh separatism. The issue even impacts the diaspora community, seeing as Indian authorities have previouslyrevokedthe visa privileges of international Indians who criticize the current administration or the BJP as a whole. While it is well-documented that the Indian government has usedimprisonment,torture, andsexual abuseto target activists andjournalists, the role of social media companies in enabling this violence is less publicized. In fact, companies such as Facebook and Google haveprovidedthe state with private information that has enabled government forces totrackdown anddetainactivists and supporters of protests. These corporations are directly responsible for aiding in not only the degradation of free speech, but also in the physically violent suppression of dissidents. It is also worth noting that resistance from these social media companies is effectively impossible, if not illegal, due to the implementation of 2021legislationthat demands that platforms provide the state with the personal information of any original poster who creates content that is deemed problematic by the Indian government. In a form of excessive government overstep and regulation, this legislationcompelssocial media sites such as WhatsApp to break down existing end-to-end encryption that serves to protect the privacy of users. Further policies provide rigid guidelines to keep social media companies compliant. In particular, the IT Rules of 2021includea provision for the appointment of a Chief Compliance Officer (CCO) who can be held legally responsible for the actions of their employer. If a social media platform fails to comply with the Indian government’s request for user information within a 36-hour period, the CCO will face legal punishment. The CCO is also responsible for ensuring that their respective platform resolves content issues within 15 days. In practice, this policy places a significantburdenon social media companies that already have to monitor a significant amount of content according to their own policies. By giving these companies such a short period of time to comply with harsh policies that include no provisions to prevent baseless or unnecessary grievances, the Indian state is practically forcing social media platforms to censor content without a critical evaluation of whether or not said content is truly problematic. While social media has been a valuable tool for Indian activists to organize, especially amongst the Sikh diaspora, it has also given the populist Indian administration a platform to spread disinformation and suppress dissent in a way that targets Sikh populations. The international community must become more critical of the role that social media can play in global politics. As ethnic and religious tensions continue to increase in India, Big Tech is reinforcing Modi’s populist agenda against multiple ethnic and religious minority groups in India. The Indian government is thereby expanding the tactics that it deploys to target minorities, and the world must pay close attention. Asia/Pacific World SUGGESTED ARTICLES Magazine World Magazine World Magazine World About Masthead – Fall 2024 Contact Us Join BPR! Donate"}