{"id": 1509, "name": "Understand Reality Through Science", "domain": "understandrealitythroughscience.blogspot.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://understandrealitythroughscience.blogspot.com/2025/05/this-will-be-my-last-entry-on-this-blog.html#comment-form", "title": "This Will Be My Last Entry On This Blog.html#comment Form", "content": "**Understand Reality Through Science** Human knowledge has progressed exponentially since the dawn of modern science. It is no longer reasonable to accept claims without sufficient objective evidence. The harm from religion, alternatives to medicine, conservatism, and all other false beliefs will be exposed on this blog by reporting the findings of science. This blog will also reinforce what should be the basics of education: History, Civics, Financial Literacy, Media Literacy, and Critical/Science Based Thinking. **Pages** Home About The Blog Owner Why This Blog? Skepticism/Critical Thinking Terms Defined Logical Fallacies Fact-Checking (This Blog Rated \"High\") Alternatives To Medicine Religion Politics Featured Posts Random Words Of Wisdom **Saturday, May 24, 2025** **This Will Be My Last Entry On This Blog** For over a decade, I have promoted the pinnacle of brain function(critical/science-based thinking)on this blog. I have had great support from mainly foreign sources (especially Singapore). However, a putrid response from my native USA has been very disappointing. Because of this, as well as increasing mental and emotional struggles with the escalating political troubles in the USA, I no longer wish to continue adding content to this blog. It is VERY clear where I stand on all aspects of reality. Those of you whohave what I don't have, continue the battle.I have adequately presented enough information in my targeted areas to help anyone interested in learning more about them. To anyone still interested in this blog in the future, please continue to explore it. I will leave it active indefinitely for that purpose. Peace to you all. - - - - - - - - - Below, I conclude with links that are extremely pertinent to the current state of democracy in the USA. **Did America Really Choose Trump? (Yes, and how sad)** Post a Comment **Labels** **Choose how you look at reality wisely. Yes, it is a binary choice.** **SCIENCE JUSTIFIES ITSELF** **Blog Archive**"}