{"id": 100, "name": "Aspenia Online", "domain": "aspeniaonline.it", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://aspeniaonline.it/the-trump-administrations-choices-and-the-heritage-foundations-project-2025-loose-inspiration-or-blueprint/", "title": "The Trump Administrations Choices And The Heritage Foundations Project 2025 Loose Inspiration Or Blueprint", "content": "Likes Subscribers Followers About Us Aspen Institute Italia Aspenia Quarterly News Alert The editorial committee Likes Aspenia Online - international analysis and commentary RegionsUS & AmericasEU & EuropeMiddle East & North AfricaChina & East AsiaIndo-PacificRussia & Central AsiaSub-Saharan Africa US & Americas EU & Europe Middle East & North Africa China & East Asia Indo-Pacific Russia & Central Asia Sub-Saharan Africa US & Americas EU & Europe Middle East & North Africa China & East Asia Indo-Pacific Russia & Central Asia Sub-Saharan Africa TopicsPolitics & GovernmentEconomy & FinanceSecurity & DiplomacySociety & CultureEnvironment & PlanetTechnology & Science Politics & Government Economy & Finance Security & Diplomacy Society & Culture Environment & Planet Technology & Science Politics & Government Economy & Finance Security & Diplomacy Society & Culture Environment & Planet Technology & Science Dossiers Editorials Authors **The Trump administration’s choices and the Heritage Foundation’s “Project 2025”: loose inspiration or blueprint?** The Trump administration’s second term has been marked by the swift and deliberate implementation of policies outlined inProject 2025, a comprehensive 922-page blueprint developed by a conservative think tank, The Heritage Foundation – published in January 2023. This agenda seeks to significantly reshape the federal government, emphasizing a more centralized executive power, a reduction in federal agencies, and a reorientation of US domestic and foreign policies. While President Trump has openly distanced himself from direct involvement with Project 2025 (when asked about this), his administration’s actions closely mirror many of its recommendations, indicating a strong alignment with its objectives. A cornerstone of Project 2025 is the expansion of presidential authority, advocating for a unitary executive theory that consolidates power within the White House. This approach challenges the traditional separation of powers and the independence of federal agencies. Under this framework, agencies like the Department of Justice and the Federal Bureau of Investigation (FBI) would operate under direct presidential control, undermining their autonomy and potentially politicizing their functions. The implementation of this vision has been evident in the administration’s actions, including the revocation of security clearances for certain officials and the reclassification of federal employees to facilitate easier dismissal of those deemed disloyal. Project 2025 advocates stringent immigration policies, including mass deportations, the termination of birthright citizenship, and the dismantling of the asylum system. The Trump administration has enacted several measures aligning with these recommendations. First of all, the deployment of military forces: the administration authorized the use of military personnel to manage federal lands along the southern border, facilitating the construction of border barriers and the deployment of detection equipment. Secondly, an executive order was issued to halt the US Refugee Admissions Program, reflecting Project 2025’s stance on limiting refugee entries. Thirdly, Trump proceeded with the reinstatement of the Remain in Mexico Policy: This policy requires asylum seekers to wait in Mexico while their cases are processed, aligning with the blueprint’s recommendations. Project 2025 proposes the elimination or significant restructuring of several federal agencies to reduce the size and scope of the federal government. The President has signed an executive order that plans to cancel the Department of Education, with the plan of transferring its responsibilities to state governments. The administration has moved to reduce the budget of the National Oceanic and Atmospheric Administration (NOAA), eliminating its climate-focused research and redirecting resources to support increased fossil fuel production. Even more striking, the reinstatement of Schedule F allows for the removal of federal employees in policy roles, facilitating the replacement of career officials with political appointees loyal to the administration’s agenda. This is a clear move to build a loyal backbone of public officials, an extra-large spoil system, never done before. Trump also followed Project 2025 in advocating for significant reductions in federal spending, particularly in areas such as social programs and foreign aid. First of all, the imposition of a 10% baseline tariff on all imports, with higher tariffs on specific countries, aims to reduce trade deficits and encourage domestic production. Initiatives to shrink the federal workforce, including buyouts and mandatory returns to office, align with Project 2025’s goal of reducing government size. An executive order freezing new foreign aid for 90 days reflects the blueprint’s recommendation to limit international assistance. Project 2025 also emphasizes deregulation of environmental policies to promote fossil fuel development. The Trump administration has acted on these recommendations with the Alaska Energy Development (an executive order was signed to promote the use of Alaska’s energy resources, expediting permitting and development of oil and gas projects) and the withdrawal from Climate agreements: Biden made the US re-enter the Paris Climate Agreement, but the current administration has taken steps to withdraw from all climate initiatives, reflecting Project 2025’s stance on international climate accords. The Trump administration’s early actions in its second term demonstrate a clear alignment with the objectives outlined in Project 2025 and social policy changes are probably one of the most visible areas. Trump II and Project 2025 agree on the criminalization of certain behaviors and the rollback of protections for marginalized groups. The President seems to be obsessed with transgenders (especially trans women) and executive orders were signed to revoke federal recognition of transgender individuals, affecting documentation and healthcare access. The administration has also moved to remove legal protections against anti-LGBT discrimination, reflecting Project 2025 recommendations. At the media level, the administration tends to distance itself from direct involvement with Project 2025. That’s because the general perception is for the document to be too extreme and it wouldn’t look good for the current President to be inspired by a manifesto written by others behind closed doors. However, Trump’s policies reflect a strong and continuing commitment and his presidency has already raised a question that goes way beyond the single norms: Is US democracy in danger? About seven years ago, Harvard Professors Steven Levitsky and Daniel Ziblatt, in their seminal “How Democracies Die”, believed the answer is yes. Democracy no longer ends with a bang, in a revolution or military coup, but with a whimper: the slow, steady weakening of critical institutions, such as the judiciary and the press, and the gradual erosion of long-standing political norms. Marco Morini is Assistant Professor in Political Science at Sapienza University of Rome (Italy). He has previously been Jean Monnet Fellow at the Robert Schuman Centre (European University Institute), Assistant Professor in Political Science at the International University of Sarajevo (Bosnia and Herzegovina) and Post-Doctoral Research Fellow in Sociology at Macquarie University (Australia). He is the author of \"Lessons from Trump’s Political Communication: How to Dominate the Media Environment\". London, Palgrave (2020). Previous Articles Un presidente «crypto-curious»: i rapporti tra l’amministrazione Trump e le criptovalute Next Articles I dazi doganali, panacea impossibile di tutti i mali Come parla Gaza all’Occidente Israel’s endgame and the fading prospect of a Palestinian state La Turchia tra democrazia svuotata e autocrazia in costruzione Saudi Arabia and the US: Aligned on Syria amid uncertainty on Gaza and Iran Offices / Contacts Privacy Policy GDPR Facebook Twitter Linkedin"}