{"id": 51, "name": "American Geophysical Union (AGU)", "domain": "agu.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://www.agu.org/learn-and-develop/learn/student-competitions/ospa/how-to-participate", "title": "Student Competitions", "content": "We are experiencing difficulty processing your payment.Please do not refresh the page or submit again.Contact our Member Service Center for help at[email protected], or 800.966. 2481 (toll-free in North America), or +1 202.462.6900. We are experiencing difficulty processing your payment.Please do not refresh the page or submit again. Contact our Member Service Center for help at[email protected], or 800.966. 2481 (toll-free in North America), or +1 202.462.6900. We are experiencing difficulty processing your payment.Please do not refresh the page or submit again. Contact our Member Service Center for help at[email protected], or 800.966. 2481 (toll-free in North America), or +1 202.462.6900. Give to AGU Sign In Join AGU About AGU Career Development Honors & Funding Meetings & Events Publications & News Policy & Outreach About AGU Career Development Honors & Funding Meetings & Events Publications & News Policy & Outreach AGU Membership ValueEmpower your future today! Ethics, Diversity & Inclusive SciencePromoting an inclusive scientific culture Membership DirectoryFind members by section, region or expertise Programs & InitiativesAdvance your career and connect with peers Find Your CommunityConnect by science, interest and identity AGU Net Zero HeadquartersVisit AGU’s award-winning HQ in D.C. Leadership & GovernanceVolunteers shaping AGU and the future of science AGU SectionsConnect with colleagues in your discipline Jobs at AGUJoin AGU’s team to advance science Connect with the global AGU community. Student ProgramsLaunch your career with a supportive community Leadership OpportunitiesSign up for leadership and volunteer updates Awards & FundingApply for scholarships and fellowships University & Faculty ProgramsNetwork and share best practices in education K-12Explore Bright STaRS program and travel grants Career CenterFind or post job listings; search career resources Career GuidanceCreate a personalized career plan Programs by Career StagePrograms and support for every career level Fellowships & Cohort ProgramsBuild in-depth skills alongside peers Read your OSPA presentation feedback Union Medals, Awards & PrizesRecognizing top achievements in science Union Fellows ProgramRecognizing excellence in research Section Awards & LecturesCelebrating section-specific achievements Student AwardsRewarding scientific excellence in students Science Policy & Communication AwardsAwarding excellence in science outreach View past recipients ScholarshipsInvesting in science’s future leaders Travel GrantsSupport travel for AGU meetings Research GrantsFunding new discoveries and breakthroughs AGU Annual MeetingJoin AGU25 in New Orleans this December ChapmansSpecialized meetings for science insights WaterSciConInnovations in hydrology Ocean SciencesJoin Ocean experts in Glasgow 2026 AbSciConUncover new insights in astrobiology Exhibits and Sponsorship OpportunitiesElevate your visibility in the geosciences Submit a proposal for AGU25 Meetings & Event CalendarTrack key dates for AGU events Book the AGU Conference CenterHost your event at AGU Headquarters WebinarsOnline sessions for science insights JournalsExplore 24 high-impact, peer-reviewed journals AuthorsResources and policies for authors BooksRead and publish AGU textbooks and manuals EditorsResources and policies for editors Special CollectionsPremier collections highlighting key topics ReviewersResources and policies for reviewers Publish with AGU Open AccessExplore funding for open access publishing Inclusive PublishingFostering diversity and transparency in publishing ESS Open ArchiveSearch Earth and space science preprints Data LeadershipExplore AGU data guidelines for researchers EosAGU’s award-winning science news magazine Stay in the KnowSign up for AGU updates and news Press Releases & Media ResourcesVisit AGU's newsroom for science updates From the ProwRead the latest message from AGU leadership Science Policy ProgramsGet involved in AGU’s policy initiatives Science Policy ResourcesTools to advocate effectively for science Grassroots ActionMobilize local voices for policy impact Science CommunicationDevelop skills to share your science Community ScienceConnect science to local community priorities U.S. Government OutreachLearn to navigate U.S. science policy Global OutreachCollaborate globally for sustainable solutions Open ScienceExpanding participation and access to science Climate & SustainabilityScience for a thriving, sustainable future Ethical, Diverse & Just ScienceChampioning ethics and equity in science Inclusive CollaborationFostering an inclusive science culture Join AGU Sign In Give to AGU **How to participate in OSPA** Students Reviewers Liaisons Coordinators **Sign up to Participate as a Student Presenter** Sign up to Participate as a Student Presenter Sign up to Participate as a Student Presenter OSPA Student Sign-up and Requirements Student presenters at AGU24 are not automatically signed up to participate in OSPA. Students who wish to participate in OSPA must sign up for the programwhen submitting their abstract for AGU24. We are not able to add any new students to OSPA for AGU24. All OSPA student presenters are required to: upload a digital version of their presentation in the online OSPA portal by 6 December, upload a digital version of their presentation in the online OSPA portal by 6 December, upload a digital version of their presentation in the online OSPA portal by 6 December, to act as a reviewer and provide feedback to one other OSPA presenter at AGU24,You may not review your own presentation. You are not assigned a presentation - you will select the presentation you want to review using the OSPA platform. to act as a reviewer and provide feedback to one other OSPA presenter at AGU24, You may not review your own presentation. You are not assigned a presentation - you will select the presentation you want to review using the OSPA platform. You may not review your own presentation. You are not assigned a presentation - you will select the presentation you want to review using the OSPA platform. to act as a reviewer and provide feedback to one other OSPA presenter at AGU24, You may not review your own presentation. You are not assigned a presentation - you will select the presentation you want to review using the OSPA platform. You may not review your own presentation. You are not assigned a presentation - you will select the presentation you want to review using the OSPA platform. You may not review your own presentation. You are not assigned a presentation - you will select the presentation you want to review using the OSPA platform. to present at the day/time assigned to you, and to present at the day/time assigned to you, and to present at the day/time assigned to you, and to respond to communications (virtual or in-person) from OSPA reviewers. to respond to communications (virtual or in-person) from OSPA reviewers. to respond to communications (virtual or in-person) from OSPA reviewers. Access the OSPA Platform Access the OSPA platform Log in to your AGU account. You will automatically be logged in to the online platform, where you can upload your digital presentation and sign up to review a peer. OSPA Student Resources Review theStudent Reviewer Instructions for the OSPA platform. Learn more aboutvolunteering as an OSPA Reviewer. Review theOSPA Evaluation Rubric. If you have any questions, please contact AGU at[email protected]. Return to OSPA homepage. **** AGU student members pursuing a high school, undergraduate, master’s, or doctorate degree at the time of the meeting are eligible to participate. Postdoctoral researchers are not eligible. You must also be the lead author of the abstract presented. **** **** **** Presentations will be evaluated by up to three reviewers. AGU and OSPA volunteers work diligently to recruit enough volunteers to evaluate student presentations. AGU encourages students to remind attendees that they are presenting in OSPA and that they would like feedback in the OSPA portal. Reviewers may submit questions to students via the online OSPA portal. Students are expected to respond to questions as they are asked. At the meeting, many judges prefer to stay anonymous during your presentation. All feedback will be sent back to students anonymously. **** Reviewers will evaluate student presentations in the following areas: Scientific Approach:Demonstration of scientific reasoning; Appropriateness of instrumentation, data, and/or analysis techniques to address the science question; Strength and supportability of conclusions and/or next steps Presentation Effectiveness:Effective use of allotted time or space to convey important information; Appropriateness of presentation to audience level and interests Presentation Visuals:Figures, tables, and graphics aid in comprehension of procedures and results; Materials are clearly visible and readable for the audience Additional Feedback:Feedback on the student’s understanding of the broader context of their work; Three strengths of the presentation; One to three areas for improvement **** OSPA Student Orientations coming later this year! **OSPA reviewer information** AGU needs volunteers like you to provide feedback to student presenters. Many AGU students will remember their OSPA experience fondly thanks to the generosity of reviewers. Volunteer to review at AGU24It is simple to volunteer – just follow these three steps: Using the OSPA platform, sign up to review student presentations.Access the OSPA systemLog in with your AGU account.You will be logged in to the OSPA platform, where you will navigate to the OSPA Reviewer Gallery.Find a presentation you are interested in reviewing and select REVIEW OSPA PRESENTATION on the bottom right side of your screen.You can find the full platform instructions for reviewershere. Access the OSPA system Log in with your AGU account. You will be logged in to the OSPA platform, where you will navigate to the OSPA Reviewer Gallery. Find a presentation you are interested in reviewing and select REVIEW OSPA PRESENTATION on the bottom right side of your screen. You can find the full platform instructions for reviewershere. Access the OSPA system Log in with your AGU account. You will be logged in to the OSPA platform, where you will navigate to the OSPA Reviewer Gallery. Find a presentation you are interested in reviewing and select REVIEW OSPA PRESENTATION on the bottom right side of your screen. You can find the full platform instructions for reviewershere. Attend these student presentations at AGU24. If possible, ask questions about their work. Submit your feedback before the evaluation deadline: 15 January 2025. Reviewer Eligibility and Expectations All AGU24 attendees (including students!) are eligible to serve as an OSPA reviewer. All AGU24 attendees (including students!) are eligible to serve as an OSPA reviewer. All AGU24 attendees (including students!) are eligible to serve as an OSPA reviewer. Reviewers are required to submit feedback for each of the presentations they have signed up to review. Reviewers are required to submit feedback for each of the presentations they have signed up to review. Reviewers are required to submit feedback for each of the presentations they have signed up to review. Feedback submitted via the OSPA portal will be shared anonymously. Feedback submitted via the OSPA portal will be shared anonymously. Feedback submitted via the OSPA portal will be shared anonymously. Reviewers are not allowed to review students from their own institution or with whom they are acquainted. Reviewers are not allowed to review students from their own institution or with whom they are acquainted. Reviewers are not allowed to review students from their own institution or with whom they are acquainted. Reviewer Resources While all evaluations must be submitted through the OSPA portal, you may review theevaluation rubric here. While all evaluations must be submitted through the OSPA portal, you may review theevaluation rubric here. While all evaluations must be submitted through the OSPA portal, you may review theevaluation rubric here. Reviewer Instructions for the OSPA Platform. Reviewer Instructions for the OSPA Platform. Reviewer Instructions for the OSPA Platform. Reviewers are encouraged to read theReviewer Feedback Guidance document. Reviewers are encouraged to read theReviewer Feedback Guidance document. Reviewers are encouraged to read theReviewer Feedback Guidance document. In March 2025, all AGU24 OSPA reviewers will receive an email from AGU noting their volunteerism in this program. In March 2025, all AGU24 OSPA reviewers will receive an email from AGU noting their volunteerism in this program. In March 2025, all AGU24 OSPA reviewers will receive an email from AGU noting their volunteerism in this program. Return to OSPA homepage. **Reviewing process** Whether evaluating an oral or poster, an in-person or virtual presentation, the reviewer must adhere to the following requirements: Reviewers are not allowed to evaluate students from their institution or students they are acquainted with. AGU will provide resources on how to provide constructive feedback for OSPA reviewers to read before submitting evaluations. If a reviewer cannot review a presentation that they signed up for, it is that reviewer’s responsibility for finding a substitute. Ask a colleague or friend. Please note: all presentations will have a virtual component that can be used for evaluation in the case that you missed the in-person presentation. **Reviewing criteria** OSPA reviewers will offer helpful feedback to students on the following areas of their presentations: Scientific Approach:Demonstration of scientific reasoning; Appropriateness of instrumentation, data, and/or analysis techniques to address the science question; Strength and supportability of conclusions and/or next steps Presentation Effectiveness:Effective use of allotted time or space to convey important information; Appropriateness of presentation to audience level and interests Presentation Visuals:Figures, tables, and graphics aid in comprehension of procedures and results; Materials are clearly visible and readable for the audience Additional Feedback:Feedback on the student’s understanding of the broader context of their work; Three strengths of the presentation; One to three areas for improvement Presentations will be evaluated by up to three reviewers in an effort to ensure impartiality. **Reviewer Resources** OSPA Feedback Support and Orientations Orientation sessions coming later this year! **OSPA Liaison Information** Designated by the primary session convener, liaisons are responsible for ensuring each OSPA presenter in their session(s) has three pieces of feedback submitted by volunteer reviewers. Liaison Responsibilities Secure volunteer reviewers for your session’s OSPA presentation(s) by leveraging your network. AGU assists in recruiting, but your professional connections are integral in securing volunteers. Ensure your session’s OSPA presentation(s) has three reviewers signed up to evaluate. Ensure the reviewers assigned to your session’s OSPA presentation(s) submit their feedback. You may choose to review students in your session yourself. This is acceptable if there is no conflict of interest. Learn more about reviewing student presentationshere. Liaison Resources Review theLiaison instructions for the OSPA platform. Review theReviewer Instructions for the OSPA platform. Learn more aboutvolunteering as an OSPA Reviewer. Review theOSPA Evaluation Rubric. Access the Liaison OSPA Platform Access the OSPA platform here:https://agu24.ipostersessions.com/This access link is only for Coordinators and Liaisons. If you are sharing an access link with reviewers,please use this link This access link is only for Coordinators and Liaisons. If you are sharing an access link with reviewers,please use this link This access link is only for Coordinators and Liaisons. If you are sharing an access link with reviewers,please use this link Log in to your AGU account. You will automatically be logged in to the online platform. Please review theliaison instructions for the OSPA platform here. If you have any questions, please contact AGU at[email protected]. Return to OSPA homepage. Eligibility:Only AGU members are eligible to serve as liaisons. It is not required to attend Fall Meeting, but attendance will be helpful. Student members are eligible to serve as liaisons if they are not participating in OSPA as a student presenter. **OSPA Coordinator Information** Coordinators act as the OSPA managers for their section. The coordinator role requires a minimal time commitment (about one to two hours per week through early February). Section coordinators are assigned by their section leadership. Responsibilities Manage the effort to secure volunteer reviewers for students within their section by encouraging reviewers to sign up via direct email or other communications Support their section’s liaisons in their efforts to recruit reviewers for their sessions Encourage reviewers to enter their scores by the deadline Participate in the selection of OSPA winners within their section Commit about one to two hours per week, starting in November through early February Eligibility:Non-student AGU members are eligible to serve as OSPA Coordinators. Attendance at the AGU Meeting is not required but may be helpful. If you are interested in participating as an OSPA coordinator, contact your Section leadership. Coordinator Resources Review theCoordinator instructions for the OSPA platform. Review theReviewer Instructions for the OSPA platform. Learn more aboutvolunteering as an OSPA Reviewer. Review theOSPA Evaluation Rubric. Access the OSPA Platform Access the OSPA platform here:https://agu24.ipostersessions.com/This access link is only for Coordinators and Liaisons. If you are sharing an access link with reviewers, please use this link:agu24.ipostersessions.com/?s=login&dest=reviewer This access link is only for Coordinators and Liaisons. If you are sharing an access link with reviewers, please use this link:agu24.ipostersessions.com/?s=login&dest=reviewer This access link is only for Coordinators and Liaisons. If you are sharing an access link with reviewers, please use this link:agu24.ipostersessions.com/?s=login&dest=reviewer Log in to your AGU account. You will automatically be logged in to the online platform. Please review thecoordinator instructions for the OSPA platform here. Join AGU Donate Advertise Careers in Earth & Space Science Honor Publish Meet Learn Volunteer About AGU DEI Science Policy Jobs At AGU Newsroom Eos 2000 Florida Ave. NW, Washington, DC 20009 Phone: +1 202 462 6900 Toll Free: 800 966 2481 (North America only) Monday-Friday from 8:30 am – 6 pm ET"}