{"id": 965, "name": "Nebraska City News-Press", "domain": "ncnewspress.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ncnewspress.com/peru-state-student-senate-celebrates-school-year-honors-individuals-organizations/", "title": "Peru State Student Senate Celebrates School Year Honors Individuals Organizations", "content": "Home News Sports Web Extras Lifestyle Opinion ObituariesObituariesSubmit an Obituary Obituaries Submit an Obituary Obituaries Submit an Obituary ClassifiedsSubmit a ClassifiedJobs Submit a Classified Jobs Submit a Classified Jobs LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Login Home Subscribe Login Home News Sports Web Extras Lifestyle Opinion ObituariesObituariesSubmit an Obituary Obituaries Submit an Obituary Obituaries Submit an Obituary ClassifiedsSubmit a ClassifiedJobs Submit a Classified Jobs Submit a Classified Jobs LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Subscribe Login **Peru State Student Senate celebrates school year, honors individuals, organizations** June 9, 2025 Free,News The 2024-25 Peru State College Student Senate Banquet was held in April in the Live Oak Room on the College campus. The event, attended by members and guests, highlighted a successful year by the Senate and recognized individuals and organizations for their accomplishments. Student Senate president Brandon Kristensen (Wausa) presided over the banquet. After Kristensen’s welcome, the dinner, prepared by Fresh Ideas, was served. It was followed by the presentation of four annual awards given by the Student Senate. The first award was the Thomas Ediger Award which is given to an outstanding club or organization that has served the campus and community. Senate Financial Secretary Brady VanBoening of Hastings announced the nominees which included the Residence Hall Association, Campus Activities Board, and the Peru Association of Student Athletes (PASA). Winning the award for the 2024-25 year was the Campus Activities Board. The Campus Activities Board, also known as CAB, has been a vital part of Peru State College’s culture, community, and engagement. CAB plans many different activities for the student population such as movie nights, grocery bingo, sports game trips, free bowling nights, and musical theatre trips. They also aid in planning major events like homecoming. CAB student executives are very determined to make this campus, student body, and community a more engaging place for students. Announcing the second award was public relations secretary Alyse Foster of Indianola. The second award was the Elaine Hanson Award which is given to an individual or individuals who go above and beyond for the Peru State College Community. They must not be employed by the College, and they must show a true dedication to Peru State and abide by the motto of “Once a Bobcat, Always a Bobcat.” The nominees for this year’s award were Peggy Groff (Auburn), Kathy Tynon (Peru), and the Bookshire Coffee business of Peru. Receiving the 2024-25 Elaine Hanson Award was Bookshire Coffee. The local coffee shop has been a vital part of Peru State College’s culture, community, and engagement. They host many different events in which Peru State students participate such as free pancake nights, game nights, and study nights. They sponsor events on campus, have late night hours once a week for students to stop in, and provide job opportunities for Peru students. The owners of Bookshire Coffee are often seen on campus supporting students in various activities. The next award presented was the Scroll of Service Award which is the highest non-academic award given to a student at Peru State College. Sergeant-At-Arms Gaby Raburn of Cambridge introduced the nominees. The individual recognized must have demonstrated dedication and service to the student body. The nominees for the award were Lucas Hrabik (Louisville), Alyse Foster (Indianola), and Carlos Soriano (Santa Domingo, Dominican Republic). Soriano was selected for the 2024-25 honor. He is a passionate content creator for the Peru State College athletics and marketing departments, as well as with his own business, JoeVisual. Soriano attends as many events on campus as possible and always has his camera with him. A quote from his nominator, “He does an amazing job of capturing moments, memories, and the essence of Peru State. Any video, edit, or picture that Carlos has put his hands on is pure magic. His scope of Peru through his camera is extraordinary.” The final award presented by the Senate was the Barb Lewellen Award and was announced by Madi Hammer, the recording secretary from Hebron. This award recognizes outstanding faculty, staff, or an administrator who has distinguished himself or herself to the betterment of students and student life at Peru State College. The nominees for the recognition were Amy Oestmann (Johnson), Donna Menke (Nebraska City), and Nate Crotty (Auburn). Being recognized for 2024-25 was Oestmann. She has been a vital part of the campus for many years, first as an office assistant in Student Records and then as project coordinator for Residence Life. Oestmann is known as a hard worker and cares about the students, faculty, staff, and community of Peru State College. She aids the resident assistants, professional staff, and other members of the campus community in many ways. A quote from her nominator stated, “She is always there to aid students in any ways she can, even if it is a comforting hug or delicious homemade treats.” Nebraska State College System Chancellor Dr. Paul Turman presented the 2024 NSCS Teaching Excellence Award to Dr. Kathi Nehls, Professor of History, from Nebraska City. Additional recognition went to the 2024-25 senators and student trustee. Hrabik introduced the past senators and noted which positions held and/or committees served on. The senators for the past year other than who have been previously noted were Hend Alasman (Kuala Lumpur, Malaysia), CoDee Hartle (Waterloo), Sam Hall (Weeping Water), Jordan Deloske Buck (Louisville), Carson Pierce (Lincoln), Delena Dotson (Omaha), Chloe Clapp (Pleasant Hill, Iowa), Caleb Kozeny (Louisville), Lydia Lang (Palmyra), Misa De Abreau (Caracas, Venezuela), Quinton Rowell (Raytown, Mo.), and Kaylee Manion (Nebraska City). Serving as the student trustee this past year was Cayla Schuster (Oakland, Iowa). Dr. Matt Thielen, one of the advisers for the Senate recognized the outgoing seniors in attendance who served in the Senate over the course of their attendance at Peru State. They included Shannon Jones (Humboldt), Foster, Gracie Wenzel (Arthur), Olivia McAsey (Holton, Kan.), Carly Johnson (Schuyler), Madison Wittwer (Columbus), Raburn, Taylor Hendricks (Omaha), De Abreu, and Grace Cochran (Chappell). Dr. Luke Klicka, faculty advisor, and Bekka Rinne, staff advisor, recognized Kristensen and Hrabik for their service as the 2024-25 president and vice president, respectively. Then, Dr. Klicka presided over the passing of the gavel to the 2025-26 president and vice president. Leading the Senate next year will be Hrabik as president and Schuster as vice president. Hrabik concluded the evening with a few remarks. The 2025 Student Senate Banquet was a fitting tribute to the many achievements of the organization as well as Peru State College’s students, faculty, staff, and community members. The Student Senate is the voice of the students for the students. The Senate focuses on the interests and opinions of the students regarding the operations of the College. Through involvement in a wide variety of campus affairs, the Senate provides a means for students to participate in the formulation and application of institutional policy affecting academic and student services. Nestled in the hills of historic southeast Nebraska, Peru State College offers a mix of innovative online and traditional classroom undergraduate and graduate programs, including online graduate degrees in education and organizational management. Established in 1867 as Nebraska’s first college, Peru State has transformed over the past century and a half into a state-of-the-art institution offering diverse, multifaceted educational programs annually to nearly 2,000 students. Legion Juniors post June 6 win over Sampson Nebraska City 16s-18s League Team Nebraska City Swim Team NDA announces 2025 NAYI delegates Kreifels Hills Subdivision is site of ribbon cutting, open houses Public Records 6-13-25 Editorial Cartoon Community Calendar 6-13-25 Peru State Student Senate celebrates school year, honors individuals, organizations Pro Baseball Updates, 6-8-25 **Other News** June 11, 2025 June 11, 2025 June 11, 2025 Home About Accessibility Community Rules Contact Us Cookie Policy Privacy Policy Terms of Service Copyright © 2025 Nebraska City News-Press, aCherryRoad MediaNewspaper. All rights reserved."}