{"id": 1786, "name": "Political Mayhem News", "domain": "politicalmayhem.news", "bias": "fake-news", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://politicalmayhem.news/planned-parenthood-president-gets-owned-after-tweeting-insane-thing-about-women-aborting-babies-on-mothers-day/", "title": "Planned Parenthood President Gets Owned After Tweeting Insane Thing About Women Aborting Babies On Mothers Day", "content": "Politics US News Health & Science Cops & Criminals **Planned Parenthood President Gets OWNED After Tweeting Insane Thing About Women Aborting Babies On Mother’s Day** The new Mother’s Day ‘gift’ crazy should be abortion? Well that is exactly what Cecile Richards, the President of Planned Parenthood, seems to think. This disgusting waste of human flesh should be banned from any and all interaction with children with her clone-like beliefs of Margret Sanger. Who says something like this and maintains any kind of public following? Oh, that’s right… a liberal murderer. Via Truth Feed : Things went very poorly for Cecile Richards when she tried to mix two things that don’t go well together at all – Mother’s day wishes and abortions. In her tweet, she writes “Nothing says ‘I love you, Mom!’ like standing up for the right of mothers everywhere to get the care they need.” One reply to her has nearly as many “likes” as her original tweet. It says “Nothing says ‘I love you, mom!’ Like the deafening silence of a dead baby who will never say ‘I love you, Mom!” Amiright? Other responses are equally snarky, pointing out the blatant hypocrisy. Finally, Dinesh D’Souza weighs in as well. This open ‘tolerance’ policy of the left has gone far beyond any sense orlf normal morality and values in this country, and it leaves many of us wanting to wipe the slate clean. Never in the history of America has society been quite this full of ridiculous and absolutely unbelievably moronic social leaders. Can we vote to jail them all for the betterment of our future? Please? How do you feel about this attack of motherhood? Let us know in the comments. **Related Articles** **7 Most Important Women in Politics 2020** It has become stereotyped that women have nothing to do in politics. Men believe that they should sit at home and raise children. Great accomplishments must be left to men as they are stronger. However, history regularly refutes this thesis. It turns out that women regularly came to politics for hundreds of centuries, sometimes exerting […] **Cyanide Bombs Are Being Planted All Over The US— Here’s What We Know So Far** Government over-reach has been a big issue for years and it needs to be addressed in so many different avenues. The use of cyanide bombs to protect humans from predatory animals is one of them. These hidden and dangerous devices are just as dangerous to those that live around them than they are to the […] **BREAKING: Senate Takes First Step To Punish Obama For His Role In Russian Nuclear Bribery Case** The Senate Judiciary Committee has initiated an investigation regarding a Russian nuclear bribery case. The committee members are demanding that the FBI and other federal agencies reveal what they knew, if anything, about Russian agents giving out bribes prior to the Obama Administration in 2010 approving a deal to sell uranium to the Russians. The […] **Post navigation** **Elevate Your Celebrations with Balloon Decorations** Balloons have transcended their simple nature and have become a versatile and creative decorating tool that is also easy to purchase https://balloons.online/contact/. Balloons are no longer limited to traditional parties, they can be molded, shaped and illuminated for any event. The allure of balloon decorations lies in their ability to charm and captivate guests of […] **How to Counter CS:GO’s Most Annoying Weapons and Tactics** **10 Women Who Changed the Way We See Politics in the Modern World** **7 Most Important Women in Politics 2020** It has become stereotyped that women have nothing to do in politics. Men believe that they should sit at home and raise children. Great accomplishments must be left to men as they are stronger. However, history regularly refutes this thesis. It turns out that women regularly came to politics for hundreds of centuries, sometimes exerting […] **BREAKING: Senate Takes First Step To Punish Obama For His Role In Russian Nuclear Bribery Case** **Illegal Burka Clad Woman Ploughs Over American Baby, Gets Away With Crime For 1 Startling Reason**"}