{"id": 493, "name": "Frontier in Amphibian and Reptile Science", "domain": "frontiersin.org/journals/amphibian-and-reptile-science", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/amphibian-and-reptile-science/articles/10.3389/famrs.2025.1599382/full", "title": "Amphibian And Reptile Science", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Behavior and Ecology Conservation Evolution Phylogenetics and Paleobiology Physiology and Health Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Behavior and Ecology Conservation Evolution Phylogenetics and Paleobiology Physiology and Health Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Behavior and Ecology Conservation Evolution Phylogenetics and Paleobiology Physiology and Health Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office TECHNOLOGY AND CODE article Front. Amphib. Reptile Sci. Sec. Behavior and Ecology Volume 3 - 2025 |doi: 10.3389/famrs.2025.1599382 This article is part of the Research TopicGlobal Human-Snake Conflicts and Ethno-OphidiologyView all articles **Using Livestreaming Technology to Promote Public Engagement with Secretive and Maligned Animals** 1Biological Sciences Department, California Polytechnic State University, San Luis Obispo, United States 2Bailey College of Science and Mathematics Design and Fabrication Facility, California Polytechnic State University, San Luis Obispo, United States 3Biology Department, Dickinson College, Carlisle, Pennsylvania, United States The final, formatted version of the article will be published soon. Select one of your emails You have multiple emails registered with Frontiers: Notify me on publication Please enter your email address: If you already have an account, pleaselogin You don't have a Frontiers account ? You canregister here As people become increasingly disconnected from nature, novel approaches are needed to facilitate empathy and conservation action for wildlife. Recent advances in livestreaming cameras enable the public’s observation of wild animals in real time and facilitate engagement community science. In 2024, we launched an off-grid livestreaming camera at a rattlesnake mega-den in Colorado, where hundreds of snakes emerge in the spring and dozens of females rest for the summer and prepare to give birth in the fall. This paper provides the first detailed description of the equipment and setup needed for remote, off-grid camera livestreaming. The camera continually streamed live to YouTube over the snakes' active season (May 15 through November 5). During this time, a group of students and volunteers operated the camera and moderated a live-chat by interacting with viewers and answering questions. YouTube comments reflected a feeling of community among the viewers, and many of them contributed to data collection from the livestream as community scientists. Media coverage of the livestream resulted in increased viewership. Livestreaming technology shows great potential for showcasing animal aggregations, connecting the public with nature and scientific research, and improving the public perceptions of unpopular animals like rattlesnakes. Keywords:Wildlife camera, Human-snake relationship, Human-wildlife coexistence, Rattlesnake, Livestream, Virtual nature experiences, wildlife monitoring, Environmental Education Received:24 Mar 2025;Accepted:26 May 2025. Copyright:© 2025Bachhuber, Roberts, Singer, Brewster, Brewster, Dunham, Boback and Taylor. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) or licensor are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. * Correspondence:Owen M. Bachhuber, Biological Sciences Department, California Polytechnic State University, San Luis Obispo, United StatesMax C Roberts, Biological Sciences Department, California Polytechnic State University, San Luis Obispo, United StatesEmily N. Taylor, Biological Sciences Department, California Polytechnic State University, San Luis Obispo, United States Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Share on Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}