{"id": 1449, "name": "This Is Money", "domain": "thisismoney.co.uk", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.thisismoney.co.uk/money/mailplus/article-14797355/My-neighbour-flooded-flat-says-pay-DEAN-DUNHAM-reveals-exactly-deal-dispute-PLUS-way-you-banish-annoying-ice-cream-vans-road.html#video", "title": "My Neighbour Flooded Flat Says Pay Dean Dunham Reveals Exactly Deal Dispute Plus Way You Banish Annoying Ice Cream Vans Road.html#video", "content": "Money Home Business Saving & banking Investing Cost of living & bills Cars Cards & loans Pensions Mortgages Buy-to-let My Profile Logout Login **** UK borrowing costs rise as Rachel Reeves splashes the cash: Nervous investors fret over spending spree Reeves urged to rule out pensions tax raid amid mounting concern over how she will pay for her lavish spending Business counts cost of Labour's bloated state amid fears Chancellor is set to launch another tax raid The best cars you can buy: Luxury German SUV tops list of 10 models rated highest by owners Will the Chancellor launch an even bigger tax raid on the wealthy and could it hit YOUR pension, property and inheritance? How to keep your FULL winter fuel allowance (even if your joint income is £69,000): JEFF PRESTRIDGE's guide to what you need to know Retirement poverty 'postcode lottery' revealed: Where pensioners are under most financial strain What is an affordable home in the new £39bn plan – and does YOUR town and city have plans to build some? Affordable housing plan boosts builders but Labour is still on track to miss election target of 1.5m homes Labour faces backlash after taking credit for Bank of England's interest rate cuts Another two UK firms sell out to foreign bidders - but tech stars fend off predators UK Pharmaceutical industry at risk from government's 'sky-high and unpredictable' rebates system KKR threat to NHS landlord: Don't give the barbarians a foothold in a sacred public service, says ALEX BRUMMER Experts call on Government to deliver a 'bold' industrial strategy to reboot the British economy Is Meta a good investment? A growth fund manager replies Beat inheritance tax like Laurence Llewelyn-Bowen: Could you really give your home to your children NOW? Cash Isa battle cools but tax-free savings rates are still riding high: Which are the REAL best buys now? BYD's five-minute EV 'flash chargers' coming to Europe to boost batteries in same time it takes to fill up with petrol The fund that trebled investors' money by backing Britain's smallest companies: INVESTING SHOW Is new Winter Fuel Payment £35k threshold for an individual or a household? STEVE WEBB replies How YOU can profit from wave of tech takeovers sweeping Britain: These firms might be next Surge in first-time buyers over the age of 45 will land millions with a mortgage to pay in retirement Rental price boom is over, says Zoopla - but agents warn of more pain for tenants if landlords continue to sell up Auction expert reveals four property types savvy buyers are snapping up including short-lease flats **My neighbour flooded my flat but says I have to pay: DEAN DUNHAM replies** By DEAN DUNHAM Updated:13:28 EDT, 10 June 2025 e-mail 14 Viewcomments 14 Viewcomments My neighbour's drains backed up and flooded my house. He says I should claim on my insurance but I think it's his responsibility to pay. Who is right? A.H., via email. Dean Dunham replies:Your ability to hold your neighbour to account will depend on who is legally responsible for the drains blockage and whether a court could be convinced that it is fair, just and reasonable for your neighbour to be held responsible for the harm that you have sustained. Your first port of call is to ascertain where the root cause of the drain issue lies and this may involve hiring a drains company or calling out your local water authority. If the blocked drain only serves your neighbour’s property and is within their property boundary, they will be responsible for maintaining and repairing these drains to prevent blockages and potential flooding. If the drain is shared between multiple properties, the responsibility is typically determined by a shared agreement between the property owners. In some cases, the responsibility might fall on the water authority if the shared drain also connects to the public sewer system or if the cause of the blockage stems from drains located outside any property boundary, such as lateral drains, and the main sewers that collect wastewater from multiple properties. If it transpires that the blocked drains are your neighbour’s sole responsibility, in these circumstances your neighbour should be footing the bill for the damage caused to your house. If he continues to refuse to do so, you could make a claim on his insurance policy. However, if the drains blocked up due to your neighbour’s failure to keep them maintained and clear, his policy is unlikely to provide cover. If this is the case, you could consider mediation. Details on mediation services are on the Government website:gov.uk/how-to-resolve-neighbour-disputes/use-a-mediation-service. If mediation does not work, or if your neighbour refuses to engage with this, you could try to claim on your insurance policy. If all else fails and as a last resort, you could take your neighbour to court and claim compensation for the damage. Here you will have to prove that your neighbour failed to take reasonable care to prevent the drains from blocking. If the drain is shared between multiple properties, the responsibility is typically determined by a shared agreement between the property owners **I can't stand the jingle from the ice-cream van that parks outside my house** An ice-cream van parks outside my house and I can’t stand its jingle playing and engine running, sometimes for 20 minutes. Is there anything I can do? Debbie D., Epping. Dean replies:There is something you can do under Section 62 of a law called the Control of Pollution Act 1974. Action may be taken if ice-cream van chimes sound after 7pm, or before midday, or if they are sounded at any time as to cause an annoyance. The Department for Food and Rural Affairs also introduced a code of practice in 2013 on noise from ice-cream van chimes in England. This code of practice says no chimes should be operated that produce a noise level in any direction of more than 80 decibels. Also, the passage of music played should not last more than 12 seconds. The chimes should be played once only on the approach to each stopping place or ‘selling point’, only once when the van is stationary, and never at intervals of less than two minutes. The chimes should not be played more often than once every two hours in a particular length of street. The code of practice also says that the chimes should not be played within 50 meters of areas where people may be especially sensitive to their sound, such as hospitals, places of worship on a Sunday and schools, during school hours. You should first try to recruit some of your neighbours in making a complaint. Before making your complaint, gather evidence of the annoyance, preferably several video or sound recordings along with a diary on when they have occurred in recent times. Alongside those who join you, explain your issue to the ice-cream van owner and ask them to avoid the annoyance. If this is ignored, you will be able to make a complaint to your local authority. **Share or comment on this article: My neighbour flooded my flat but says I have to pay: DEAN DUNHAM replies** e-mail Add comment **Comments14** Share what you think Newest Oldest Best rated Worst rated The comments below have not been moderated. The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. **Add your comment** By posting your comment you agree to ourhouse rules. Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with ourPrivacy Policy. Best savings rates tables Find the best mortgage calculator Power Portfolio investment tracker Stock market data and share prices This is Money's podcast This is Money's newsletter The best DIY investing platforms The best bank accounts The best cash Isas The best credit cards Save on energy bills Compare broadband and TV deals How to find cheaper car insurance Investing Show videos Financial calculators **DON'T MISS** Cash Isa battle cools but rates are still riding high: Which are the REAL best buys now? Why is Meta a good investment? A growth investor repliesSponsored The RAC sent us a measly £40 after we waited two days for a rescue that never came: SALLY SORTS IT Surge in first-time buyers over 45 will land millions with a mortgage in retirement SUVs are a 'growing threat to public safety' and drivers can't see children as old as nine directly in front of them How long will it take me to save a £30,000 home deposit?Sponsored Beat inheritance tax like Laurence Llewelyn-Bowen: Could you really give your home to your children NOW? Is the new Winter Fuel Payment £35,000 threshold for an individual or a household? Driving licence rule change TODAY allows millions to legally take to the wheel of larger cars... with a catch I'm an auction expert - here's four type of property savvy buyers are snapping up right now Winding road back for Rolls: Mini nuclear power plant deal could spark a chain reaction, says ALEX BRUMMER Property expert Phil Spencer on future house prices, mortgage rates and his best ever investment... I advise lottery winners... here's six things they must do if they win record EuroMillions U-turn on Winter Fuel Payment: You WILL get it if your income is up to £35,000 The 10 common blunders people make when they move home revealed by experts Why did Starling block me from buying a EuroMillions ticket and lock my bank account for two days? **MOST READ MONEY** The little-known bank rule that could cost you hundreds: SYLVIA MORRIS My neighbour flooded my flat but says I have to pay: DEAN DUNHAM Luxury British car makers like Aston Martin and Morgan facing rocky future as headwinds mount, industry warns HMRC ramps up special investigations into the wealthy with AI and helps it claw back £1.5bn in tax in ONE YEAR EXCLUSIVEStarling launches AI chatbot Spending Intelligence in UK banking first Pension savers underestimate cost of a comfortable retirement by £410,000 Why am I being unfairly penalised over 25% pension tax-free cash after lifetime allowance abolition? STEVE WEBB replies Chase Bank launches top 5% easy-access savings deal I'm a veteran mechanic. Here are the cars I'd buy myself - and the surprising popular models you should avoid at ALL COSTS We loathe our neighbours - can we put a fence down the middle of our shared driveway? HUGO DUNCAN: Labour's dealt the economy a hammer blow. Joblessness is soaring. Now you are about to pick up the tab... How to snatch a 10% dividend from cheap renewable energy trusts: INVESTING ANALYST Tech stampede to the exit: British brilliance born of our great universities is being plundered daily, says ALEX BRUMMER My father-in-law gave us £15,000 for our home renovation but now he wants it back with interest! VICKY REYNAL replies How far would you go to avoid your personal tax raid? This is Money Podcast No wealth means no welfare: How can we change the narrative in Britain? RUTH SUNDERLAND I'd never paid a bill until my divorce at 57! Can we gift our daughter three of the bedrooms in our house to lower inheritance tax bill? Actress Helen Lederer needed a loan when the tax was due for her Celebrity Big Brother stint Why the high flying FTSE is defying the gloom: HAMISH MCRAE The exact amount you need for a 'moderate' retirement - and why it's NOT too late to hit the goal at any age Interactive Investor launches pension cashback of up to £2,000: Is it a good way to boost your pot? How NatWest (and a baffling postcode lottery) left a tourist hotspot with no bank: JEFF PRESTRIDGE John Lewis binned my carpet - but refuses to give me a refund: TONY HETHERINGTON investigates The forgotten investment fund quietly turning Europe's gems into moneymakers Should you invest in charity bonds paying up to 7.5% interest? MIDAS SHARE TIPS Sporty electric Mini Aceman JCW packs plenty of poke - but is it too much power for its own good? The expensive funds that ARE worth paying for Should you pay in the local currency or pounds when you're on holiday? A third of Britons want to own a buy-to-let... but is it still a good idea? Millions of homeowners could be paying far too much for their mortgages A villa we booked in Portugal was infested with mould, slugs, and ants... why won't Booking.com refund? Is this Revolut email genuine? It's asking me out of the blue to confirm personal details but how can I be sure it's not a scam... Drivers speed more in 20mph zones than any other limits - and councils want to up restrictions The best mortgage rates for first-time buyers: What deals are available and how long should you fix for? Unloved house next to Eryri National Park in Wales is going to auction: Could it be YOUR perfect project? Does someone else have a mortgage on my new home? CRANE ON THE CASE Nintendo Switch 2 launches today - should you invest in the world's leading video game brands? Four ways the Chancellor shifted financial habits of the middle-classes in under a year, by LEE BOYCE 'Bigger pension pots for Britons': Chancellor says reforms will boost economic growth - here's how Britain's booming housing markets: Rightmove reveals 10 areas where sales have skyrocketed Are you at risk of a 'zombie retirement'? Pension savers warned over this common mistake Why did NS&I name the precise town where the most recent £1m Premium Bonds jackpot winner came from? Victorian chapel home in Hampshire could be yours for £1.4m Mercedes exec calls £155k electric version of iconic SUV a 'complete flop' EXCLUSIVECustomers of crypto firm left without access to funds as it freezes 'Boost' accounts EXCLUSIVEHow I was was conned out of £62k by a Facebook scammer posing as a French single mother Stock market braced for tech takeover frenzy: Blow to the City as foreign predators target FIVE promising firms It's tax not salaries that pushes top bosses out of the UK, says ALEX BRUMMER EXCLUSIVEAreas where care homes cost double for self-funders - is YOURS on the list? Rachel Reeves's £30bn tax bomb is about to drop - here's how to protect YOUR wealth, says JEFF PRESTRIDGE The 600,000 homeowners told their hot water could stop working - unless they switch to a smart meter Has Nationwide found a winning formula with its cash bonuses? This is Money Podcast Topshop boss confirms stores are coming back to British high streets - here's when For every disabled parking bay there are 52 Blue Badge holders as oversubscribed scheme is rife with fraud and abuse Money Home Business Saving & banking Investing Cost of living & bills Cars Cards & loans Pensions Mortgages Buy-to-let This is Money is part of theDaily Mail,Mail on Sunday&Metromedia group"}