{"id": 1042, "name": "New York Daily News", "domain": "nydailynews.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.nydailynews.com/2025/06/09/protesters-rage-at-ice-arrests-amid-heavy-police-presence-at-foley-square-in-lower-manhattan/", "title": "Protesters Rage At Ice Arrests Amid Heavy Police Presence At Foley Square In Lower Manhattan", "content": "Daily News e-Edition Daily News e-Edition Evening e-Edition Evening e-Edition Subscriber Services Daily E-Edition Evening E-Edition NewsCrime and Public SafetyPoliticsBusinessHealthNational NewsWorld NewsPhotos and VideosEspanol Crime and Public Safety Politics Business Health National News World News Photos and Videos Espanol Crime and Public Safety Politics Business Health National News World News Photos and Videos Espanol Local NewsNew York NewsManhattanBronxBrooklynQueensNYC CrimeEducationNew York Politics New York News Manhattan Bronx Brooklyn Queens NYC Crime Education New York Politics New York News Manhattan Bronx Brooklyn Queens NYC Crime Education New York Politics SportsSportsYankeesMetsGiantsJetsKnicksNetsLibertyRangersIslandersBaseballBasketballFootballHockeySoccer Sports Yankees Mets Giants Jets Knicks Nets Liberty Rangers Islanders Baseball Basketball Football Hockey Soccer Sports Yankees Mets Giants Jets Knicks Nets Liberty Rangers Islanders Baseball Basketball Football Hockey Soccer ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary OpinionOpinionEditorial Cartoons Opinion Editorial Cartoons Opinion Editorial Cartoons SNYDE Viva Things To DoThings To DoBest ReviewsFitnessRestaurants, Food and DrinkFun and GamesHoroscopes Things To Do Best Reviews Fitness Restaurants, Food and Drink Fun and Games Horoscopes Things To Do Best Reviews Fitness Restaurants, Food and Drink Fun and Games Horoscopes AdvertiseAdvertise with UsClassifiedsPublic Notices Advertise with Us Classifieds Public Notices Advertise with Us Classifieds Public Notices Branded ContentPaid Partner ContentAdvertising by AscendPaid Content by BrandpointSpecial Sections Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Special Sections Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Special Sections About UsHelp CenterContact UsAutomotivePhoto requests, reprintsArchivesTAG Disclosure Help Center Contact Us Automotive Photo requests, reprints Archives TAG Disclosure Help Center Contact Us Automotive Photo requests, reprints Archives TAG Disclosure Contests Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to share on X (Opens in new window)X Subscribe Login Sign up for email newsletters Subscribe Log In Daily News e-Edition Daily News e-Edition Evening e-Edition Evening e-Edition E-Newspaper NYC Crime National News Politics Sports Eats Photos Puzzles & Games Obits Trending: No National Guard in NYC: top cop Today’s horoscope ‘No Kings Day’ protest in NYC Asking Eric Hidden dining gems Musk-Trump feud **Protesters rage at ICE arrests amid heavy police presence at Foley Square in lower Manhattan** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to share on X (Opens in new window)X Hundreds of protesters swarmed into lower Manhattan Monday evening to decry themass arrests of detainees by Immigration and Customs Enforcement. Around 200 demonstrators gathered for an“ICE out of NYC”protest near Foley Square around 5 p.m., steps away from anICE facility at 26 Federal Plazawhere an unknown number of detainees are being held. Demonstrators roared on the streets, demanding “No ICE, NO KKK, No Fascist USA” and “Free them all.” The NYPD took seven people into custody as the protests raged. Four received summonses to appear in court at a later date and three were criminally charged, an NYPD spokesman said. The criminal charges were not immediately disclosed. A Daily News reporter witnessed cops taking five demonstrators into custody for blocking the roadway alongLafayette and Duane Sts.Another protester was taken into custody for blocking the path of a black SUV leaving the ICE facility. “This is not America, ICE is not saving our community,” said Rain Reilly, 27, who praised massiveanti-ICE protests in Los Angeles.. “[New York City Mayor] Eric Adams says he wants to crack down on violence, but this just perpetuates it. … I’m so proud of the people of L.A., they are so close to my heart. They’re what a community should be.” Protesters held signs demanding “Reject fascism” and “Torch Fascism.” “I called out from work to be here,” said 21-year-old nanny Amaria Allen. “People are being kidnapped, put in cells and sleeping on floors. It’s an outrage. Shame on New Yorkers who are at home sitting on the couch.” Numerous NYPD officers were seen ordering protesters to stay on the sidewalk during the demonstration. Earlier Monday, Police Commissioner Jessica Tisch said the NYPD had “at the mayor’s direction” developed plans to prepare for any potential anti-President Trump protests in the city, with “the full resources of the New York City Police Department” on standby. The heated rally came hours after protestors gathered Monday afternoon inside thelobby of Trump Tower, raging against ICE raids, holding up anti-ICE signs and demanding the release ofhundreds of immigrants reportedlybeing held in El Salvador. Police said 24 protesters were arrested in the demonstration and were given summonses for criminal trespassing. Over the weekend, the Trump administration sentNational Guard troops to Los Angeles, where protesters have been clashing with law enforcement in an intense standoff over stepped-up ICE raids for several days. “The escalation of protests in Los Angeles over the last couple of days is unacceptable and will not be tolerated if attempted in our city,” said Mayor Adams at a Monday afternoon press conference. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to share on X (Opens in new window)X **RevContent Feed** **Most Popular** Dad of missing toddler jailed after telling mom he threw son into Bronx RiverDad of missing toddler jailed after telling mom he threw son into Bronx River **Dad of missing toddler jailed after telling mom he threw son into Bronx River** **Dad of missing toddler jailed after telling mom he threw son into Bronx River** Body believed to be missing 2-year-old Bronx boy Montrell Williams found in East RiverBody believed to be missing 2-year-old Bronx boy Montrell Williams found in East River **Body believed to be missing 2-year-old Bronx boy Montrell Williams found in East River** **Body believed to be missing 2-year-old Bronx boy Montrell Williams found in East River** Freak to the Knicks? 4 trade offers that land Giannis Antetokounmpo in NYCFreak to the Knicks? 4 trade offers that land Giannis Antetokounmpo in NYC **Freak to the Knicks? 4 trade offers that land Giannis Antetokounmpo in NYC** **Freak to the Knicks? 4 trade offers that land Giannis Antetokounmpo in NYC** Protesters rage at ICE arrests amid heavy police presence at Foley Square in lower ManhattanProtesters rage at ICE arrests amid heavy police presence at Foley Square in lower Manhattan **Protesters rage at ICE arrests amid heavy police presence at Foley Square in lower Manhattan** **Protesters rage at ICE arrests amid heavy police presence at Foley Square in lower Manhattan** Top NYPD chief and NYC deputy mayor meet with Trump on golf courseTop NYPD chief and NYC deputy mayor meet with Trump on golf course **Top NYPD chief and NYC deputy mayor meet with Trump on golf course** **Top NYPD chief and NYC deputy mayor meet with Trump on golf course** Ex NY Jets QB Aaron Rodgers got married ‘a couple months ago’Ex NY Jets QB Aaron Rodgers got married 'a couple months ago' **Ex NY Jets QB Aaron Rodgers got married ‘a couple months ago’** **Ex NY Jets QB Aaron Rodgers got married ‘a couple months ago’** DOJ employee charged with murder for allegedly giving girlfriend abortion drugDOJ employee charged with murder for allegedly giving girlfriend abortion drug **DOJ employee charged with murder for allegedly giving girlfriend abortion drug** **DOJ employee charged with murder for allegedly giving girlfriend abortion drug** Mayor Adams offers a surprising compliment to Democratic primary challenger Zohran MamdaniMayor Adams offers a surprising compliment to Democratic primary challenger Zohran Mamdani **Mayor Adams offers a surprising compliment to Democratic primary challenger Zohran Mamdani** **Mayor Adams offers a surprising compliment to Democratic primary challenger Zohran Mamdani** LIRR trains canceled, delayed or rerouted after transformer room fire at Grand Central MadisonLIRR trains canceled, delayed or rerouted after transformer room fire at Grand Central Madison **LIRR trains canceled, delayed or rerouted after transformer room fire at Grand Central Madison** **LIRR trains canceled, delayed or rerouted after transformer room fire at Grand Central Madison** Sean ‘Diddy’ Combs’ defense grills accuser ‘Jane’ about his fetishesSean 'Diddy' Combs' defense grills accuser 'Jane' about his fetishes **Sean ‘Diddy’ Combs’ defense grills accuser ‘Jane’ about his fetishes** **Sean ‘Diddy’ Combs’ defense grills accuser ‘Jane’ about his fetishes** **More in Crime and Public Safety** Cops bust man for fatally shooting father of three in Brooklyn auto shop **Cops bust man for fatally shooting father of three in Brooklyn auto shop** **Cops bust man for fatally shooting father of three in Brooklyn auto shop** NJ man charged with fatally stabbing wife was sleepwalking at time of crime: lawyer **NJ man charged with fatally stabbing wife was sleepwalking at time of crime: lawyer** **NJ man charged with fatally stabbing wife was sleepwalking at time of crime: lawyer** Ex-NXIVM cult member Allison Mack weds 2 years after prison release **Ex-NXIVM cult member Allison Mack weds 2 years after prison release** **Ex-NXIVM cult member Allison Mack weds 2 years after prison release** Harvey Weinstein convicted in Manhattan sexual assault retrial in split verdict **Harvey Weinstein convicted in Manhattan sexual assault retrial in split verdict** **Harvey Weinstein convicted in Manhattan sexual assault retrial in split verdict** 2025 June 9 Tribune PublishingChicago TribuneThe Morning CallThe Daily PressThe Virginian PilotOrlando SentinelSun-SentinelHartford CourantStudio 1847 Chicago Tribune The Morning Call The Daily Press The Virginian Pilot Orlando Sentinel Sun-Sentinel Hartford Courant Studio 1847 Chicago Tribune The Morning Call The Daily Press The Virginian Pilot Orlando Sentinel Sun-Sentinel Hartford Courant Studio 1847 Company InfoAbout UsCareersHelp CenterManage Web NotificationsPlace an adMedia KitPrivacy PolicySite Map About Us Careers Help Center Manage Web Notifications Place an ad Media Kit Privacy Policy Site Map About Us Careers Help Center Manage Web Notifications Place an ad Media Kit Privacy Policy Site Map Subscriber ServicesArchives Archives Archives Subscribe Now Subscriber Terms and Conditions Terms of Service Cookie Policy Cookie Preferences California Notice at Collection CA Notice of Financial Incentive Do Not Sell/Share My Personal Information Copyright © 2025 New York Daily News"}