{"id": 612, "name": "Greatist", "domain": "greatist.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://greatist.com/move/abs-workout-unexpected-moves-that-work-better-than-crunches", "title": "Abs Workout Unexpected Moves That Work Better Than Crunches", "content": "Health & WellnessWellnessWomen's HealthMen's HealthMental HealthSexual HealthRelationshipsSkin & HairSleepCBDHomePetsWeight LossTravelHealth ConditionsADHDAllergiesCold & FluDiabetesHigh CholesterolHIVIBDMental Health ConditionsMigrainesPsoriatic ArthritisSkin ConditionsSTDs **Wellness** Women's Health Men's Health Mental Health Sexual Health Relationships Skin & Hair Sleep CBD Home Pets Weight Loss Travel **Health Conditions** ADHD Allergies Cold & Flu Diabetes High Cholesterol HIV IBD Mental Health Conditions Migraines Psoriatic Arthritis Skin Conditions STDs **Wellness** Women's Health Men's Health Mental Health Sexual Health Relationships Skin & Hair Sleep CBD Home Pets Weight Loss Travel **Health Conditions** ADHD Allergies Cold & Flu Diabetes High Cholesterol HIV IBD Mental Health Conditions Migraines Psoriatic Arthritis Skin Conditions STDs FoodFoodNutritionVitamins & SupplementsVegan & Vegetarian EatingInternational FoodCooking 101Kitchen GearRecipesAllBreakfast & BrunchAppetizers & SnacksMain DishesSandwichesSaladsSidesDessertsDrinks **Food** Nutrition Vitamins & Supplements Vegan & Vegetarian Eating International Food Cooking 101 Kitchen Gear **Recipes** Breakfast & Brunch Appetizers & Snacks Main Dishes Sandwiches Salads Sides Desserts Drinks **Food** Nutrition Vitamins & Supplements Vegan & Vegetarian Eating International Food Cooking 101 Kitchen Gear **Recipes** Breakfast & Brunch Appetizers & Snacks Main Dishes Sandwiches Salads Sides Desserts Drinks FitnessFitnessWorkout TipsStrength TrainingHIITKettlebellResistance BandsRunningCyclingYogaStretchingGearWorkoutsBeginnerAbs & CoreLegsArmsButtFull Body **Fitness** Workout Tips Strength Training HIIT Kettlebell Resistance Bands Running Cycling Yoga Stretching Gear **Workouts** Beginner Abs & Core Legs Arms Butt Full Body **Fitness** Workout Tips Strength Training HIIT Kettlebell Resistance Bands Running Cycling Yoga Stretching Gear **Workouts** Beginner Abs & Core Legs Arms Butt Full Body FavesProduct ReviewsHealthFitness & Home GymFood & CookingSkin & BeautyHome & GardenSleepSeriesThe LiftCrash CourseFirst GearDJ Gr8stGreatist ReadsHow-ToTrain for a 10KBetter Sex in 10 Days30 Days of Yoga14-Day Guide to Plant-Based Eating **Product Reviews** Health Fitness & Home Gym Food & Cooking Skin & Beauty Home & Garden Sleep **Series** The Lift Crash Course First Gear DJ Gr8st Greatist Reads **How-To** Train for a 10K Better Sex in 10 Days 30 Days of Yoga 14-Day Guide to Plant-Based Eating **Product Reviews** Health Fitness & Home Gym Food & Cooking Skin & Beauty Home & Garden Sleep **Series** The Lift Crash Course First Gear DJ Gr8st Greatist Reads **How-To** Train for a 10K Better Sex in 10 Days 30 Days of Yoga 14-Day Guide to Plant-Based Eating ConnectThe Greatist CommunityInstagramFacebookTwitterPinterestTikTokSpotifyYouTubeAbout GreatistWho We AreOur Editorial ProcessOur Product Vetting ProcessContent IntegrityConscious Language **The Greatist Community** Instagram Facebook Twitter Pinterest TikTok Spotify YouTube **About Greatist** Who We Are Our Editorial Process Our Product Vetting Process Content Integrity Conscious Language **The Greatist Community** Instagram Facebook Twitter Pinterest TikTok Spotify YouTube **About Greatist** Who We Are Our Editorial Process Our Product Vetting Process Content Integrity Conscious Language Fitness 101 Cardio Strength training Yoga Sports & outdoor fitness Mobility Sports nutrition Fitness products Workouts Exercise library We include products we think are useful for our readers. If you buy through links on this page, we may earn a small commission.Here’s our process **14 Unexpected Moves That Work Your Abs Better Than Crunches** Before you start Bodyweight moves With weights tl;dr When it comes to bodyweight abs exercises, crunches aren’t the be-all and tense-all. In fact, some research has shown that the classic crunch may not even be that effective, since it doesn’t activate all of your core muscle. Whether you want to build strength for that elusive pull-up or are just after the opportunity to show off a six-pack (hey, no judgment!), there are more effective exercises than endless crunches. From plank variations to weighted exercises, these moves fromTone Househead coachEvan Bettswill totally change the way you think about working your midsection. It won’t even feel like you’re specifically targeting your abdominals, but you’ll still be engaging your core for abs-olutely abs-tonishing results (sorry, not sorry). **How to use this list** Depending on your fitness level, Betts suggests picking two or three of the moves below and slotting them into a workout routine that takes the following shape: Perform each move for 60 seconds (or for the number of reps indicated) Rest for 20 seconds. Perform the next move. At the end of all three moves, rest for up to 60 seconds. Repeat the circuit. Get through 3 or 4 rounds total. **Bodyweight moves** With these moves, you need nothing but your bod and sheer willpower. **1. High knees** Imagine running, but to nowhere? With your knees going really high? If this sounds self-defeating, think again. Stand with your feet hip-width apart, being sure to engage your core and keep your back straight. Hold your arms steady, or swing them to help with momentum. Run in place, drawing each knee as high as possible toward your chest, and using your lower abs to pull your knees high. (Think sprint, not jog.) Go as fast as you can for 60 seconds. If you’re experiencing a bit of knee pain but you want to give this a try, theseyoga poses for knee paincan help loosen up your joints. **2. Tuck jump** Bounce, bunny, bounce! This workout really keeps you on your toes. Stand with your feet hip-width apart, your core engaged, and, yep, you guessed it, a straight back. Send the hips back, bend your knees slightly, and bend your elbows at 90 degrees with your palms facing downward. In one explosive movement (POW!), jump up and draw your knees toward your chest, so they tap your downturned palms. Land lightly on your toes, with a slight bend in your knees, and immediately jump up again. Jump for 60 seconds. Jumping can be a great addition to any workout plan — here’s our guide tomastering the vertical jump. **3. Plank walk** What ‘arm could it do? Start off in a high plank position. Lower onto your right forearm, then your left forearm. You’ll now be in a forearm plank. Return to the starting position by pushing up from your left forearm to your left hand, then from your right forearm to your right hand. Continue for 60 seconds. At the 30-second mark, switch to leading with your other arm. Here are47 waysto mix up your planks that will give you an insane core. **4. Plank jack** Like a jumping jack without the jumping, and with more planking. Start in a high plank position. With your core braced, jump both feet apart wider than hip width. Now quickly jump them back together. Try to land softly on your toes each time (because who likes a broken toe?). Focus on keeping your hips steady and your arms straight. Continue for 60 seconds. More into jacks of the “jumping” variety? Here’show to nail them. **5. Plank arms walk-out** Hey, I’m plank-walkin’ here! Start in a high plank position. Slowly walk your hands forward, so that your wrists are no longer under your shoulders and your body is extended. Walk your hands as far forward as possible. Pause at the farthest point for a moment before walking your hands back to the starting position. Continue to repeat for up to 60 seconds. If you’re more into working out with friends, here’s how toincorporate someone elseinto your exercise. **6. High-plank bird dog** Because it’s a dog-tweet-dog world out there. Start in a high plank position. Brace your core and raise your right hand and left foot off the ground, like a traditional bird dog. Return to the starting position and repeat this motion on the other side of your body. Do 10 reps on each side. We found a 7-minute workout that canchange your ab gameforever. **7. Scorpion** This one stings, but it will get the job done. Start on all fours. Brace your core, come to the tips of your toes, and shift your weight to the right side of your body. Pick your left hand and foot off the ground, allowing your right hand and foot to shift, so you come into a faceup position. Lift your right hand and left foot off the ground. With your left leg extended, crunch your torso together to tap your right hand to your left toes. Return to all fours. Repeat on the other side, without letting your hips hit the ground at any time. Continue for 10 reps on each side. Push-ups more your bag? Try these82 advanced variationsto get your arms (and blood) pumping. **8. Spider-man push-up** (Disclaimer: You don’t get to swing from any tall buildings after trying this.) Start in a high plank position. Engage your core and bring your right knee forward toward the right elbow, turning your hip out and your inner thigh parallel to the floor. As your right knee comes forward, bend your arms and lower yourself into a push-up. Return to the starting position and repeat the exercise on the other side. Do 10 reps on each side. Make it easier:Skip the push-up. Instead, hold a high plank throughout and focus on squeezing your obliques toengage your core. **9. Body saw** You’ll need a small towel or you canfind a set of sliders onlinefor this move. Start in a forearm plank with your toes on the towel/sliders. With your core engaged, slide your body forward, bringing your shoulders as far forward as possible past your elbows. Then slide back, allowing your shoulders to shift behind your elbows. Continue to move back and forth for 60 seconds. Make it easier:Do amountain climberor wide-leg mountain climber instead. **10. Dragon flag** This move is absolutely fire. And feels like it too. Find an anchor to hold onto with your arms extended overhead. You could use a chair, bench, or closed door. (We used a floor anchor in the GIF above.) Lie face-up with your knees bent. Shifting your weight into your shoulders, engage your core and lift your feet overhead, like a shoulder stand. Try to keep your legs as straight as possible. Lower your legs, without allowing them to touch the floor, then repeat. Do 3 to 5 slow, controlled reps. Important note:Do not perform this exercise if you have pre-existing shoulder issues. Once in shoulder stand, look straight ahead, never side-to-side, to protect your neck from injury. (If your neck does hurt a little, here arethe best pillowsmoney can buy.) **Weighted moves** For when you wanna get hot and heavy. **11. Single-arm farmer’s walk** This isn’t your average walk in the park (or farm). Grab a heavy weight, such as a dumbbell, kettlebell, or sandbag (as shown). Stand with your feet hip-width apart, your core engaged, and your back straight. Holding the weight in your right hand, walk forward about 10 feet (or for about 30 seconds). When you turn back, switch the weight to your opposite hand. Make it harder:Amp up the challenge by walking backward (carefully!) or by stopping halfway through the walk and holding for a few seconds before continuing. Sheesh! When lifting weights, it’s super important to build up slowly. Here’s the know-how onpicking your weight. **12. Medicine ball halo** 🎤“You hit me like a meeeeeeedicine ball…”🎤 Shop for amedicine ball(as shown),dumbbell, orkettlebellonline. Hold the weight with both your hands at chest height. Make a big circle around your upper body. Keep your knees soft and your core engaged and steady throughout. Repeat for 30 seconds in one direction, then reverse direction for another 30 seconds. We found25 more waysa medicine ball can rock your world. **13. Resistance band rotation** Look for aresistance bandor cable machine for this exercise. Be sure to only use light resistance to protect your spine. Stand with your left side toward the band anchor. With your hands shoulder-width apart, elbows at 90 degrees, and palms down, use your core to pull away from the band anchor. Slowly, return to the starting position — it’s important not to snap back into place. Do 15 to 20 reps, then repeat on the other side. Resistance bands are brilliant. We rounded up33 great resistance band exercisesto help tone every part of your body. **14. Renegade row** Become a renegade master… Start in high plank position with a dumbbell close to your right hand. Keep your body straight and your core engaged as you lift the dumbbell with your right hand. Perform a row, keeping your arm close to your side and your elbow in line with your rib cage as you lift the dumbbell toward your ribs. Lower the dumbbell to its starting position. Repeat the move for 30 seconds, then switch sides for another 30 seconds. Rowing is absolutely boss when you do it right.Here‘s how to make sure you’re never up a creek without a paddle. **Takeaway** Wait, what’s a crunch again? There are moves for every ability level here, and ways to edge up to the more difficult ones. So, if these seem intimidating at first, there’s always a way to make them accessible and give them a try. We looked a little deeper intothe world of crunchesand whether they provide the complete picture for ab strength (spoiler alert: they don’t). Shot on location atTone Housein New York City. Special thanks toTone Househead coachEvan Betts, who designed these moves, modeled for us, and pulled off this killer push-up — just for fun. #PushupGoals 1 sourcecollapsed Stenger E, et al. (2014). Abs! Abs! Abs!https://www.acefitness.org/education-and-resources/professional/prosource/april-2014/3764/abs-abs-abs/ **Read this next** 5 Crunch Variations That Might Transform Your Core WorkoutExplore crunch variations to spice up your core workout. Try mermaid, bridge, spiderman, and standing side crunches for a stronger core.READ MORE Explore crunch variations to spice up your core workout. Try mermaid, bridge, spiderman, and standing side crunches for a stronger core. Explore crunch variations to spice up your core workout. Try mermaid, bridge, spiderman, and standing side crunches for a stronger core. How Long Does It Take to Get a Six Pack and Stick to the Plan?Learn how long it takes to get a six-pack and the lifestyle changes needed. Discover habits to ditch for faster ab results.READ MORE Learn how long it takes to get a six-pack and the lifestyle changes needed. Discover habits to ditch for faster ab results. Learn how long it takes to get a six-pack and the lifestyle changes needed. Discover habits to ditch for faster ab results. Why Does My Side Hurt When I Run? Causes and Prevention TipsWondering why your side hurts when you run? Find out the common causes and simple tips to ease the pain and run comfortably.READ MORE Wondering why your side hurts when you run? Find out the common causes and simple tips to ease the pain and run comfortably. Wondering why your side hurts when you run? Find out the common causes and simple tips to ease the pain and run comfortably. Rucking Benefits: Add Weight to Your Walk to Boost Fitness and StrengthExplore the benefits of rucking and how adding weight to your walk can enhance fitness, build strength, and improve endurance.READ MORE Explore the benefits of rucking and how adding weight to your walk can enhance fitness, build strength, and improve endurance. Explore the benefits of rucking and how adding weight to your walk can enhance fitness, build strength, and improve endurance. Vegetarian Bodybuilding: 4 Tips to Build MuscleDiscover top tips for vegetarian bodybuilding to help you build muscle and achieve your fitness goals.READ MORE Discover top tips for vegetarian bodybuilding to help you build muscle and achieve your fitness goals. Discover top tips for vegetarian bodybuilding to help you build muscle and achieve your fitness goals. Text Neck Exercises: Simple Moves to Ease Digital StrainText neck is the neck and back pain from spending too much time looking down at your phone or computer. Here are easy tips to help relieve and prevent…READ MORE Text neck is the neck and back pain from spending too much time looking down at your phone or computer. Here are easy tips to help relieve and prevent… Text neck is the neck and back pain from spending too much time looking down at your phone or computer. Here are easy tips to help relieve and prevent… Yoga and Overweight: Health Benefits and Tips for Getting StartedDiscover how yoga supports wellness and weight management, explore its key health benefits, and get practical tips for starting your yoga practice.READ MORE Discover how yoga supports wellness and weight management, explore its key health benefits, and get practical tips for starting your yoga practice. Discover how yoga supports wellness and weight management, explore its key health benefits, and get practical tips for starting your yoga practice. Should I Exercise with a Phlegmy Cough? What You Need to KnowWondering “should I exercise with a phlegmy cough?” Discover when it’s safe to work out while sick and when you might need to rest and recover.READ MORE Wondering “should I exercise with a phlegmy cough?” Discover when it’s safe to work out while sick and when you might need to rest and recover. Wondering “should I exercise with a phlegmy cough?” Discover when it’s safe to work out while sick and when you might need to rest and recover. Boost Your Bod With Eccentric ExerciseDive into the world of eccentric lifting to discover its techniques, benefits, and more!READ MORE Dive into the world of eccentric lifting to discover its techniques, benefits, and more! Dive into the world of eccentric lifting to discover its techniques, benefits, and more! What Does Skinny Fat Look Like? Signs, Causes, and Health RisksDiscover what “skinny fat” looks like and its health implications. Learn about signs, causes, and risks to better understand this body type.READ MORE Discover what “skinny fat” looks like and its health implications. Learn about signs, causes, and risks to better understand this body type. Discover what “skinny fat” looks like and its health implications. Learn about signs, causes, and risks to better understand this body type. About Us Contact Us Terms of Use Privacy Policy Privacy Settings Advertising Policy Medical Affairs Content Integrity Your Privacy Choices OUR BRANDS"}