{"id": 1638, "name": "WZMQ - Marquette News", "domain": "wzmq19.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://wzmq19.com/news/349667/president-trump-gov-newsom-spar-over-federal-response-as-immigration-protests-break-out-across-u-s/", "title": "President Trump Gov Newsom Spar Over Federal Response As Immigration Protests Break Out Across U S", "content": "Home NewsUP 200LocalLansing BureauWashington D.C. BureauNationalInsightsWatch 19 News LiveCBS News LiveReport News UP 200 Local Lansing Bureau Washington D.C. Bureau National Insights Watch 19 News Live CBS News Live Report News UP 200 Local Lansing Bureau Washington D.C. Bureau National Insights Watch 19 News Live CBS News Live Report News WeatherForecast + ConditionsCurrent AlertsInteractive RadarCamerasShare Photos/VideosClosings and Delays Forecast + Conditions Current Alerts Interactive Radar Cameras Share Photos/Videos Closings and Delays Forecast + Conditions Current Alerts Interactive Radar Cameras Share Photos/Videos Closings and Delays Sports FeaturesLife in the 906The Yooper Goddess Life in the 906 The Yooper Goddess Life in the 906 The Yooper Goddess MarquetteHaze 66° MarquetteHaze 66° EscanabaHaze 76° EscanabaHaze 76° HoughtonClear 69° HoughtonClear 69° Iron MountainHaze 74° Iron MountainHaze 74° Home NewsUP 200LocalLansing BureauWashington D.C. BureauNationalInsightsWatch 19 News LiveCBS News LiveReport News UP 200 Local Lansing Bureau Washington D.C. Bureau National Insights Watch 19 News Live CBS News Live Report News UP 200 Local Lansing Bureau Washington D.C. Bureau National Insights Watch 19 News Live CBS News Live Report News WeatherForecast + ConditionsCurrent AlertsInteractive RadarCamerasShare Photos/VideosClosings and Delays Forecast + Conditions Current Alerts Interactive Radar Cameras Share Photos/Videos Closings and Delays Forecast + Conditions Current Alerts Interactive Radar Cameras Share Photos/Videos Closings and Delays Sports FeaturesLife in the 906The Yooper Goddess Life in the 906 The Yooper Goddess Life in the 906 The Yooper Goddess **President Trump, Gov. Newsom Spar Over Federal Response as Immigration Protests Break Out Across U.S.** By Brendan Scanland WASHINGTON, D.C.— Los Angeles has become the epicenter of a political firestorm after federal immigration raids sparked outrage, unrest and mounting tension between California leaders and the Trump administration. Since Saturday, hundreds have been arrested in Los Angeles amid escalating demonstrations against Immigration and Customs Enforcement (ICE) and other federal enforcement operations. What began as peaceful protests Friday quickly devolved into chaos. As of early Wednesday, city officials said that at least 30 businesses had been looted. A curfew is now in effect in parts of downtown Los Angeles from 6 a.m. to 8 p.m. The unrest is spreading from coast to coast, with protests erupting in cities including New York, Chicago, Boston and Denver. Thousands have taken to the streets expressing opposition to the immigration crackdown. “Right now in California, what we’re doing is working,” said U.S. Attorney General Pam Bondi on Wednesday. “We’re not scared to go further. We’re not frightened to do something else if we need to.” In response to the unrest, President Donald Trump has deployed 4,000 National Guard troops to Los Angeles, in direct opposition to California’s governor. “Democracy is under assault before our eyes,” said Gov. Gavin Newsom (D- CA). In addition to the National Guard, roughly 700 U.S. Marines have been mobilized to assist in protecting federal personnel and property. The Marines have reportedly been briefed on the rules for use of force on American soil and are scheduled to begin operations Wednesday. “We do not want our streets militarized by our own armed forces,” Newsom said on Tuesday. “These are the men and women trained for foreign combat, not domestic law enforcement.” “You can have a civil discourse about what’s happening, but you don’t ruin private property and public property,” said Rep. Mike Kelly (R-Pa.), who voiced support for the administration’s decision to send reinforcements. “If you don’t intercede and you don’t stop it, it will get worse as time goes on,” Kelly said. “It’s about keeping peace. It’s about making sure that citizens don’t get harmed, don’t get hurt. Public and private property must be protected. Why would you not use the assets you have?” On Tuesday, Rep. Nick Langworthy (R-NY.) introduced theStop Dangerous Sanctuary Cities Act of 2025. The bill seeks to withhold federal funds from sanctuary jurisdictions that prohibit or restrict cooperation with federal immigration enforcement. “Sanctuary cities are actively undermining federal immigration enforcement by refusing to cooperate with ICE detainer requests and releasing dangerous criminals back onto our streets,” Langworthy said in a statement. “The violence we are seeing happen in LA right now is a cautionary tale for New York, another sanctuary state catering to criminal illegal immigrants and left-wing extremists.” Specifically, the bill would block funds from states and cities that do not comply with federal immigration efforts. Additionally, it clarifies legal authority for local and state law enforcement to honor federal immigration detainer requests by deeming officers who comply to be acting as federal agents. The legislation also aims to protect law enforcement by shielding officers and jurisdictions from liability when they cooperate with federal immigration enforcement. “We must stand with our heroic ICE officers, our men and women in blue, and with the American people who cry out for safety and common sense in their local governments,” said Langworthy. **Get WZMQ 19 anytime, anywhere** Download the app Watch on TV Connect on social media **More** **Manistique invites community and guests to Summer Street Party on June 13** **Former Norway Police officer charged with misconduct** **U.S. Small Business Admin. grants disaster declaration request for counties impacted by ice storm** **FORSYTH TWP. MAN CHARGED WITH CSC** **Electrical issue determined as likely cause of multiple-house fire in Escanaba in March** **U.S. Coast Guard responds to marine casualty on Hay Lake** Home News Weather Sports Features Events Programming Station © 2025 WZMQ, LLC |FCC Public File|EEO Report Home NewsUP 200LocalLansing BureauWashington D.C. BureauNationalInsightsWatch 19 News LiveCBS News LiveReport News UP 200 Local Lansing Bureau Washington D.C. Bureau National Insights Watch 19 News Live CBS News Live Report News UP 200 Local Lansing Bureau Washington D.C. Bureau National Insights Watch 19 News Live CBS News Live Report News WeatherForecast + ConditionsCurrent AlertsInteractive RadarCamerasShare Photos/VideosClosings and Delays Forecast + Conditions Current Alerts Interactive Radar Cameras Share Photos/Videos Closings and Delays Forecast + Conditions Current Alerts Interactive Radar Cameras Share Photos/Videos Closings and Delays Sports FeaturesLife in the 906The Yooper Goddess Life in the 906 The Yooper Goddess Life in the 906 The Yooper Goddess Events ProgrammingProgramming GuideCBSMeTVStart TVHeroes & IconsCourt TVION Programming Guide CBS MeTV Start TV Heroes & Icons Court TV ION Programming Guide CBS MeTV Start TV Heroes & Icons Court TV ION StationAbout UsCommunity InvolvementMobile AppMeet the TeamContactCareersAdvertisingRequest Copy of StoryFCC Public FileEEO Report About Us Community Involvement Mobile App Meet the Team Contact Careers Advertising Request Copy of Story FCC Public File EEO Report About Us Community Involvement Mobile App Meet the Team Contact Careers Advertising Request Copy of Story FCC Public File EEO Report Home NewsUP 200LocalLansing BureauWashington D.C. BureauNationalInsightsWatch 19 News LiveCBS News LiveReport News UP 200 Local Lansing Bureau Washington D.C. Bureau National Insights Watch 19 News Live CBS News Live Report News UP 200 Local Lansing Bureau Washington D.C. Bureau National Insights Watch 19 News Live CBS News Live Report News WeatherForecast + ConditionsCurrent AlertsInteractive RadarCamerasShare Photos/VideosClosings and Delays Forecast + Conditions Current Alerts Interactive Radar Cameras Share Photos/Videos Closings and Delays Forecast + Conditions Current Alerts Interactive Radar Cameras Share Photos/Videos Closings and Delays Sports FeaturesLife in the 906The Yooper Goddess Life in the 906 The Yooper Goddess Life in the 906 The Yooper Goddess Events ProgrammingProgramming GuideCBSMeTVStart TVHeroes & IconsCourt TVION Programming Guide CBS MeTV Start TV Heroes & Icons Court TV ION Programming Guide CBS MeTV Start TV Heroes & Icons Court TV ION StationAbout UsCommunity InvolvementMobile AppMeet the TeamContactCareersAdvertisingRequest Copy of StoryFCC Public FileEEO Report About Us Community Involvement Mobile App Meet the Team Contact Careers Advertising Request Copy of Story FCC Public File EEO Report About Us Community Involvement Mobile App Meet the Team Contact Careers Advertising Request Copy of Story FCC Public File EEO Report"}