{"id": 140, "name": "Black Ennterprise Magazine", "domain": "blackenterprise.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.blackenterprise.com/the-unspoken-divide-morayo-afolabi-brown-reveals-nigerian-parents-u-s-directives-that-encourage-division-with-black-americans/", "title": "The Unspoken Divide Morayo Afolabi Brown Reveals Nigerian Parents U S Directives That Encourage Division With Black Americans", "content": "BusinessBUSINESSEntrepreneurshipLeadershipDIVERSITY, EQUALITY, INCLUSIONTECHNOLOGYMONEY BUSINESSEntrepreneurshipLeadershipDIVERSITY, EQUALITY, INCLUSIONTECHNOLOGYMONEY BUSINESS Entrepreneurship Leadership DIVERSITY, EQUALITY, INCLUSION TECHNOLOGY MONEY BUSINESSEntrepreneurshipLeadershipDIVERSITY, EQUALITY, INCLUSIONTECHNOLOGYMONEY BUSINESS Entrepreneurship Leadership DIVERSITY, EQUALITY, INCLUSION TECHNOLOGY MONEY BUSINESS Entrepreneurship Leadership DIVERSITY, EQUALITY, INCLUSION TECHNOLOGY MONEY NewsNEWSEDUCATIONMENWOMENPOLITICSGLOBALNewsbyAtiya JordanNYPD Confirms Woman Knew Her Alleged Kidnapper After AllNewsbyAtiya JordanThe Legendary ‘King of Calypso’ and Activist Harry Belafonte Dies at 96NewsPoliticsbySharelle B. McNairJoe Biden Takes Another Crack At The Presidency, Announces His Bid For 2024 Reelection NEWSEDUCATIONMENWOMENPOLITICSGLOBAL NEWS EDUCATION MEN WOMEN POLITICS GLOBAL News News News Politics NEWSEDUCATIONMENWOMENPOLITICSGLOBAL NEWS EDUCATION MEN WOMEN POLITICS GLOBAL NEWS EDUCATION MEN WOMEN POLITICS GLOBAL News News News Politics LifestyleLIFESTYLEFASHION AND BEAUTYTRAVEL AND LEISURESPORTSHEALTH & WELLNESSKIDPRENEURS®ARTS & CULTURELifestyleHealth and WellnessbyAtiya JordanAn Inaugural Night of Sexual Healing: Honey Pot Debuts New Sexual Wellness CollectionLifestyleCelebrity NewsbyStacy JacksonPorsha Williams Treats Baby Pilar To Birthday Getaway In Costa RicaWomenNewsLifestyleHealth and WellnessbyIman MilnerStudy: Black Women Should Be Screened For Breast Cancer At Age 40 LIFESTYLEFASHION AND BEAUTYTRAVEL AND LEISURESPORTSHEALTH & WELLNESSKIDPRENEURS®ARTS & CULTURE LIFESTYLE FASHION AND BEAUTY TRAVEL AND LEISURE SPORTS HEALTH & WELLNESS KIDPRENEURS® ARTS & CULTURE Lifestyle Health and Wellness Lifestyle Celebrity News Women News Lifestyle Health and Wellness LIFESTYLEFASHION AND BEAUTYTRAVEL AND LEISURESPORTSHEALTH & WELLNESSKIDPRENEURS®ARTS & CULTURE LIFESTYLE FASHION AND BEAUTY TRAVEL AND LEISURE SPORTS HEALTH & WELLNESS KIDPRENEURS® ARTS & CULTURE LIFESTYLE FASHION AND BEAUTY TRAVEL AND LEISURE SPORTS HEALTH & WELLNESS KIDPRENEURS® ARTS & CULTURE Lifestyle Health and Wellness Lifestyle Celebrity News Women News Lifestyle Health and Wellness Events2025-26 EVENTSVIEW FULL EVENTS CALENDAR »2025-26 IN-PERSON EVENTSBlack Men XCEL 2025Consumers Energy Community DayBE Global SeriesBE Smart Hackathon 2025Women Of Power 2026Women Of Power Summit 2025 »Virtual EventsBLACK ENTERPRISE HEALTH IS WEALTH, SPONSORED BY MERCKWealth Building DadsTownhall SeriesTHE FUTURE OF BLACK BUSINESS AND ENTREPRENEURSHIPECONOMIC OUTLOOK FOR AFRICAN AMERICANSWhy We Must Focus on Health to Drive WealthHow HBCUs Create The Best & The Brightest 2025-26 EVENTSVIEW FULL EVENTS CALENDAR » VIEW FULL EVENTS CALENDAR » 2025-26 IN-PERSON EVENTSBlack Men XCEL 2025Consumers Energy Community DayBE Global SeriesBE Smart Hackathon 2025Women Of Power 2026Women Of Power Summit 2025 » Black Men XCEL 2025 Consumers Energy Community Day BE Global Series BE Smart Hackathon 2025 Women Of Power 2026 Women Of Power Summit 2025 » Virtual EventsBLACK ENTERPRISE HEALTH IS WEALTH, SPONSORED BY MERCKWealth Building Dads BLACK ENTERPRISE HEALTH IS WEALTH, SPONSORED BY MERCK Wealth Building Dads Townhall SeriesTHE FUTURE OF BLACK BUSINESS AND ENTREPRENEURSHIPECONOMIC OUTLOOK FOR AFRICAN AMERICANSWhy We Must Focus on Health to Drive WealthHow HBCUs Create The Best & The Brightest THE FUTURE OF BLACK BUSINESS AND ENTREPRENEURSHIP ECONOMIC OUTLOOK FOR AFRICAN AMERICANS Why We Must Focus on Health to Drive Wealth How HBCUs Create The Best & The Brightest 2025-26 EVENTSVIEW FULL EVENTS CALENDAR » VIEW FULL EVENTS CALENDAR » VIEW FULL EVENTS CALENDAR » 2025-26 IN-PERSON EVENTSBlack Men XCEL 2025Consumers Energy Community DayBE Global SeriesBE Smart Hackathon 2025Women Of Power 2026Women Of Power Summit 2025 » Black Men XCEL 2025 Consumers Energy Community Day BE Global Series BE Smart Hackathon 2025 Women Of Power 2026 Women Of Power Summit 2025 » Black Men XCEL 2025 Consumers Energy Community Day BE Global Series BE Smart Hackathon 2025 Women Of Power 2026 Women Of Power Summit 2025 » Virtual EventsBLACK ENTERPRISE HEALTH IS WEALTH, SPONSORED BY MERCKWealth Building Dads BLACK ENTERPRISE HEALTH IS WEALTH, SPONSORED BY MERCK Wealth Building Dads BLACK ENTERPRISE HEALTH IS WEALTH, SPONSORED BY MERCK Wealth Building Dads Townhall SeriesTHE FUTURE OF BLACK BUSINESS AND ENTREPRENEURSHIPECONOMIC OUTLOOK FOR AFRICAN AMERICANSWhy We Must Focus on Health to Drive WealthHow HBCUs Create The Best & The Brightest THE FUTURE OF BLACK BUSINESS AND ENTREPRENEURSHIP ECONOMIC OUTLOOK FOR AFRICAN AMERICANS Why We Must Focus on Health to Drive Wealth How HBCUs Create The Best & The Brightest THE FUTURE OF BLACK BUSINESS AND ENTREPRENEURSHIP ECONOMIC OUTLOOK FOR AFRICAN AMERICANS Why We Must Focus on Health to Drive Wealth How HBCUs Create The Best & The Brightest VideosSeriesView Series & Podcast »Beyond The HypeThe New NormThe Culture ShiftThe Rundown with Ramon RayClass Is In SessionLights Camera BusinessOn The ClockFrom The Corner OfficeInside The StudioBranded SeriesFinding Joy hosted by Capital OnePerspectives on Equity by Capital OneChange Starts Here by HyattBoardroom Chats by NationwidePodcastsSistersInc.Your Money, Your LifePast Virtual Events/SummitsDiversity Equity + Inclusion Summit Feb 2022Diversity Equity + Inclusion Summit June 2021C-Suite Summit & Boardroom Equity 2022C-Suite Summit & Boardroom Equity 2021Wealth Building + Real Estate Summit 2022Wealth Building + Real Estate Summit 2021Sisters Inc Summit 202140 Under 40 Summit 2021Small Business SummitEvent Video Recaps. Economic Equity & Racial Justice Townhall Series SeriesView Series & Podcast »Beyond The HypeThe New NormThe Culture ShiftThe Rundown with Ramon RayClass Is In SessionLights Camera BusinessOn The ClockFrom The Corner OfficeInside The Studio View Series & Podcast » Beyond The Hype The New Norm The Culture Shift The Rundown with Ramon Ray Class Is In Session Lights Camera Business On The Clock From The Corner Office Inside The Studio Branded SeriesFinding Joy hosted by Capital OnePerspectives on Equity by Capital OneChange Starts Here by HyattBoardroom Chats by Nationwide Finding Joy hosted by Capital One Perspectives on Equity by Capital One Change Starts Here by Hyatt Boardroom Chats by Nationwide PodcastsSistersInc.Your Money, Your Life SistersInc. Your Money, Your Life Past Virtual Events/SummitsDiversity Equity + Inclusion Summit Feb 2022Diversity Equity + Inclusion Summit June 2021C-Suite Summit & Boardroom Equity 2022C-Suite Summit & Boardroom Equity 2021Wealth Building + Real Estate Summit 2022Wealth Building + Real Estate Summit 2021Sisters Inc Summit 202140 Under 40 Summit 2021Small Business SummitEvent Video Recaps. Economic Equity & Racial Justice Townhall Series Diversity Equity + Inclusion Summit Feb 2022 Diversity Equity + Inclusion Summit June 2021 C-Suite Summit & Boardroom Equity 2022 C-Suite Summit & Boardroom Equity 2021 Wealth Building + Real Estate Summit 2022 Wealth Building + Real Estate Summit 2021 Sisters Inc Summit 2021 40 Under 40 Summit 2021 Small Business Summit Event Video Recaps. Economic Equity & Racial Justice Townhall Series SeriesView Series & Podcast »Beyond The HypeThe New NormThe Culture ShiftThe Rundown with Ramon RayClass Is In SessionLights Camera BusinessOn The ClockFrom The Corner OfficeInside The Studio View Series & Podcast » Beyond The Hype The New Norm The Culture Shift The Rundown with Ramon Ray Class Is In Session Lights Camera Business On The Clock From The Corner Office Inside The Studio View Series & Podcast » Beyond The Hype The New Norm The Culture Shift The Rundown with Ramon Ray Class Is In Session Lights Camera Business On The Clock From The Corner Office Inside The Studio Branded SeriesFinding Joy hosted by Capital OnePerspectives on Equity by Capital OneChange Starts Here by HyattBoardroom Chats by Nationwide Finding Joy hosted by Capital One Perspectives on Equity by Capital One Change Starts Here by Hyatt Boardroom Chats by Nationwide Finding Joy hosted by Capital One Perspectives on Equity by Capital One Change Starts Here by Hyatt Boardroom Chats by Nationwide PodcastsSistersInc.Your Money, Your Life SistersInc. Your Money, Your Life SistersInc. Your Money, Your Life Past Virtual Events/SummitsDiversity Equity + Inclusion Summit Feb 2022Diversity Equity + Inclusion Summit June 2021C-Suite Summit & Boardroom Equity 2022C-Suite Summit & Boardroom Equity 2021Wealth Building + Real Estate Summit 2022Wealth Building + Real Estate Summit 2021Sisters Inc Summit 202140 Under 40 Summit 2021Small Business SummitEvent Video Recaps. Economic Equity & Racial Justice Townhall Series Diversity Equity + Inclusion Summit Feb 2022 Diversity Equity + Inclusion Summit June 2021 C-Suite Summit & Boardroom Equity 2022 C-Suite Summit & Boardroom Equity 2021 Wealth Building + Real Estate Summit 2022 Wealth Building + Real Estate Summit 2021 Sisters Inc Summit 2021 40 Under 40 Summit 2021 Small Business Summit Event Video Recaps. Economic Equity & Racial Justice Townhall Series Diversity Equity + Inclusion Summit Feb 2022 Diversity Equity + Inclusion Summit June 2021 C-Suite Summit & Boardroom Equity 2022 C-Suite Summit & Boardroom Equity 2021 Wealth Building + Real Estate Summit 2022 Wealth Building + Real Estate Summit 2021 Sisters Inc Summit 2021 40 Under 40 Summit 2021 Small Business Summit Event Video Recaps. Economic Equity & Racial Justice Townhall Series Be ExtrasCampaignsWomen's History Month 2025BLACK HISTORY MONTH 2025Black Business MonthHONORING JUNETEENTH SPONSORED BY NATIONWIDEPlan To Prosper sponsored by New York LifeWealth Strategies for 2024BE on The VineyardHEALTH EQ SPONSORED BY GILEADBRAND ARCHITECTSListsRegistry Of Corporate Directors40 Under 40Best Companies for Diversity 202350 Most influential Entrepreneurs 2021BLACK ENTERPRISEAbout UsManagementSubscribe to NewsletterContributor NetworkShopContact UsDIGITAL COVERSCoversLifestylebyDarren SandsAn Open Letter To Washington Redskins Owner Daniel SnyderEducationbySheiresa NgoBack-to-School: CFPB Works to Protect Student VeteransMoneybySheiresa NgoConsumer Tip of the Day: Free Car Seat Inspections in November CampaignsWomen's History Month 2025BLACK HISTORY MONTH 2025Black Business MonthHONORING JUNETEENTH SPONSORED BY NATIONWIDEPlan To Prosper sponsored by New York LifeWealth Strategies for 2024BE on The VineyardHEALTH EQ SPONSORED BY GILEADBRAND ARCHITECTS Women's History Month 2025 BLACK HISTORY MONTH 2025 Black Business Month HONORING JUNETEENTH SPONSORED BY NATIONWIDE Plan To Prosper sponsored by New York Life Wealth Strategies for 2024 BE on The Vineyard HEALTH EQ SPONSORED BY GILEAD BRAND ARCHITECTS ListsRegistry Of Corporate Directors40 Under 40Best Companies for Diversity 202350 Most influential Entrepreneurs 2021 Registry Of Corporate Directors 40 Under 40 Best Companies for Diversity 2023 50 Most influential Entrepreneurs 2021 BLACK ENTERPRISEAbout UsManagementSubscribe to NewsletterContributor NetworkShopContact Us About Us Management Subscribe to Newsletter Contributor Network Shop Contact Us DIGITAL COVERSCovers Covers Lifestyle Education Money CampaignsWomen's History Month 2025BLACK HISTORY MONTH 2025Black Business MonthHONORING JUNETEENTH SPONSORED BY NATIONWIDEPlan To Prosper sponsored by New York LifeWealth Strategies for 2024BE on The VineyardHEALTH EQ SPONSORED BY GILEADBRAND ARCHITECTS Women's History Month 2025 BLACK HISTORY MONTH 2025 Black Business Month HONORING JUNETEENTH SPONSORED BY NATIONWIDE Plan To Prosper sponsored by New York Life Wealth Strategies for 2024 BE on The Vineyard HEALTH EQ SPONSORED BY GILEAD BRAND ARCHITECTS Women's History Month 2025 BLACK HISTORY MONTH 2025 Black Business Month HONORING JUNETEENTH SPONSORED BY NATIONWIDE Plan To Prosper sponsored by New York Life Wealth Strategies for 2024 BE on The Vineyard HEALTH EQ SPONSORED BY GILEAD BRAND ARCHITECTS ListsRegistry Of Corporate Directors40 Under 40Best Companies for Diversity 202350 Most influential Entrepreneurs 2021 Registry Of Corporate Directors 40 Under 40 Best Companies for Diversity 2023 50 Most influential Entrepreneurs 2021 Registry Of Corporate Directors 40 Under 40 Best Companies for Diversity 2023 50 Most influential Entrepreneurs 2021 BLACK ENTERPRISEAbout UsManagementSubscribe to NewsletterContributor NetworkShopContact Us About Us Management Subscribe to Newsletter Contributor Network Shop Contact Us About Us Management Subscribe to Newsletter Contributor Network Shop Contact Us DIGITAL COVERSCovers Covers Covers Lifestyle Education Money Culture June 11, 2025 **The Unspoken Divide: Morayo Afolabi-Brown Reveals Nigerian Parents’ U.S. Directives That Encourage Division With Black Americans** Morayo Afolabi-Brown acknowledged that immigrants benefited from Black American labor and struggle. A candid revelation by Nigerian media host Morayo Afolabi-Brown has brought to light a rarely discussed, yet seemingly common, piece of advice many Nigerian parents impart to their children before they travel to the United States: a cautionary instruction to avoid African Americans and instead “stay with the white people.” Afolabi-Brown shared this “pep talk”on an episodeof her TVC program,Your View,exposing a generational fear rooted in stereotypes that creates a wedge between African immigrants and Black Americans. She described this widespread counsel as being driven by fear and preconceived notions, noting how it inadvertently fosters judgment and distance. This advice, she highlighted, persists despite the profound historical sacrifices made by Black Americans that fundamentally paved the way for African immigrants and their descendants toachieve success andopportunity abroad. While perhaps intended as a form of protection, the sentiment inadvertently reinforcesharmful divideswithin the broader Black diaspora. “I can’t categorically say every Nigerian got this talk, but–-a lot of Nigerians who travel abroad–-got this talk from their families,” Afolabi-Brown began. “Where they would sit you down and tell you, ‘You’re going over there.’” “Don’t go talking to those Black Americans, oh..You can get pregnant. You can get into drugs…They give you that talk, ‘Just go to the white community and find a nice place.’ So when you enter America, you already have a perception of African Americans. You judge them, and of course, they can see that judgment. And they see how you, ‘Yes Massa,’ to the oyinbos (whites).” The savvy media personality candidly expressed how she could see why Black Americans were defensive when it came to Nigerians openly shunning them. Afolabi-Brown also acknowledged that immigrants benefited from Black American labor and struggle. A post shared by Onsite! AFRICA (@its_onsiteafrica) It’s Onsite Africa’s Instagram page, where the video was posted, and the comments section went up for the difficult open admission. “It’s always been fascinating to watch Africans, specifically Nigerians, cosplay Black Americaness when it’s convenient for them,” one person wrote. Social media personality King Keraun chimed in, “We lowkey knew this.” A Nigerian in the comments section seconded Afolabi-Brown’s charge. “I have to admit I’m 🇳🇬 and got that same pep talk. Guess who got humbled real quick by them white people in nursing school? Me, they saw me as a threat and hated my soul, so yeah, racism still exists. While I’m proud to be a Nigerian, I got to tip my hats off to the black Americans that sacrificed their lives just for all of us colored people to be in this country. I learned my lesson the hard way.” “From the way we are treated, we already knew about ‘the talk’”. 😂” The phenomenon Afolabi-Brown described illustrates a complex interplay of identity, perception, and historicalunderstandingamong different Black communities in the United States. Many African immigrants arrive with a distinct cultural background, sometimes carrying stereotypes about Black Americans absorbed from various sources, including media and anecdotal tales. Conversely, Black Americans, having endured centuries of systemic racism and struggle,often view such aseparation as a betrayal of shared racial identity and a dismissal of the sacrifices made to create a more equitable society. Afolabi-Brown’s willingness to address this sensitive topic publicly is a vital opening for introspection and dialogue. It highlights the pressing need to dismantle internal biases within the global Black community, encouraging understanding and genuine solidarity over outdated divisions. Afolabi-Brown, born in Nigeriaand educatedin the United States, is a communications executive and television personality with a media career spanning 17 years. She has worked with notable media organizations, including CMC Connect, Cue Media, and HiTV, and currently serves as the Chief Media Consultant of Kabiti Media House Limited. Her first book,Becoming the Queen of Talk TV, further solidifies her voice in the media landscape. The conversation invites both African immigrants and Black Americans to acknowledge their interconnected histories and shared struggles, ultimately fostering unity rather than allowing systemic prejudice to exploit existing rifts. RELATED CONTENT:The Enduring Fire: Revisiting Malcolm X’s Vision For Black Liberation On What Would Have Been His 100th Birthday African disapora diasporic relations Morayo Afolabi-Brown Nigerians black americans #BEGlobal **Subscribe to Newsletter** **GET THE APP** About Management Masthead Privacy Policy Sales Partnership Solutions © 2025 Black Enterprise. All Rights Reserved."}