{"id": 655, "name": "HotNews", "domain": "hotnews.ro", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://hotnews.ro/regina-maria-este-reteaua-de-sanatate-cu-cele-mai-multe-centre-de-excelenta-acreditate-international-de-surgical-review-corporation-din-europa-trei-centre-noi-au-fost-acreditate-in-luna-aprilie-1994267", "title": "Regina Maria Este Reteaua De Sanatate Cu Cele Mai Multe Centre De Excelenta Acreditate International De Surgical Review Corporation Din Europa Trei Centre Noi Au Fost Acreditate In Luna Aprilie 1994267", "content": "ActualitateAdministratie LocalaAjutor pentru UcrainaCoronavirusCopii&PărințiCulturaDefenseEducatieEuropa împreunăEsentialFilmInfrastructuraInternationalMagazinMediuMinte&CorpOpiniiPerspektivaPoliticRăzboi în UcrainaSanatate Administratie Locala Ajutor pentru Ucraina Coronavirus Copii&Părinți Cultura Defense Educatie Europa împreună Esential Film Infrastructura International Magazin Mediu Minte&Corp Opinii Perspektiva Politic Război în Ucraina Sanatate Administratie Locala Ajutor pentru Ucraina Coronavirus Copii&Părinți Cultura Defense Educatie Europa împreună Esential Film Infrastructura International Magazin Mediu Minte&Corp Opinii Perspektiva Politic Război în Ucraina Sanatate EconomieAsigurări și pensii privateAutoBani europeniFinante – BanciBlogul PwC RomaniaBurseCariereCompaniiITEnergieEuROfonduriFiscalitatea la ziGadgetImobiliarIndustrie FeroviaraMedia și PublicitateStartup CafeTelecomThe cost of money Asigurări și pensii private Auto Bani europeni Finante – Banci Blogul PwC Romania Burse Cariere Companii IT Energie EuROfonduri Fiscalitatea la zi Gadget Imobiliar Industrie Feroviara Media și Publicitate Startup Cafe Telecom The cost of money Asigurări și pensii private Auto Bani europeni Finante – Banci Blogul PwC Romania Burse Cariere Companii IT Energie EuROfonduri Fiscalitatea la zi Gadget Imobiliar Industrie Feroviara Media și Publicitate Startup Cafe Telecom The cost of money SportAlte sporturiEuro 2024ExtremFotbalMotorPariuri – PublicitateTeamBallTenisSnookerSuperLiga Alte sporturi Euro 2024 Extrem Fotbal Motor Pariuri – Publicitate TeamBall Tenis Snooker SuperLiga Alte sporturi Euro 2024 Extrem Fotbal Motor Pariuri – Publicitate TeamBall Tenis Snooker SuperLiga LifeCalatoriiFunMuzicaNaturalPortrete din MultimePovestiri UrbanePrin orasShowbiz Calatorii Fun Muzica Natural Portrete din Multime Povestiri Urbane Prin oras Showbiz Calatorii Fun Muzica Natural Portrete din Multime Povestiri Urbane Prin oras Showbiz ScienceArheologieAntropologieIdeiInterviuri HotSciencePoveștile ȘtiințeiSpatiulStiinte fundamentaleStiintele vietiiTehnologieTerraTech&Innovation Arheologie Antropologie Idei Interviuri HotScience Poveștile Științei Spatiul Stiinte fundamentale Stiintele vietii Tehnologie Terra Tech&Innovation Arheologie Antropologie Idei Interviuri HotScience Poveștile Științei Spatiul Stiinte fundamentale Stiintele vietii Tehnologie Terra Tech&Innovation Revista preseiBusinessFaze TariPoliticOpinii/AnalizeRadio – TVSubiectele zileiUtileVedete Business Faze Tari Politic Opinii/Analize Radio – TV Subiectele zilei Utile Vedete Business Faze Tari Politic Opinii/Analize Radio – TV Subiectele zilei Utile Vedete Dosare JuridiceOpinia specialistilor DeloitteOpinia specialiștilor Stoica & AsociaţiiOpinia specialistilor act | Botezatu Estrade PartnersOpinia specialistilor Filip & CompanyOpinia specialistilor Schoenherr & Asociatii Opinia specialistilor Deloitte Opinia specialiștilor Stoica & Asociaţii Opinia specialistilor act | Botezatu Estrade Partners Opinia specialistilor Filip & Company Opinia specialistilor Schoenherr & Asociatii Opinia specialistilor Deloitte Opinia specialiștilor Stoica & Asociaţii Opinia specialistilor act | Botezatu Estrade Partners Opinia specialistilor Filip & Company Opinia specialistilor Schoenherr & Asociatii ProiecteFacem România bineInsurtech TalksPagini de [cod]Totul pentru pacienți #SanatosiAcasaBanking și mai șiMemorial – spitalul din afarăSistemul Garanție – ReturnareBlogul PwC RomaniaAnadolu – Excelență în OncologieEY – Fiscalitatea la ziAlternative fără fumDă tu tonul, alege cartonul!Drink InsiderLegile AfacerilorGoDigitalProiect PULSE Facem România bine Insurtech Talks Pagini de [cod] Totul pentru pacienți #SanatosiAcasa Banking și mai și Memorial – spitalul din afară Sistemul Garanție – Returnare Blogul PwC Romania Anadolu – Excelență în Oncologie EY – Fiscalitatea la zi Alternative fără fum Dă tu tonul, alege cartonul! Drink Insider Legile Afacerilor GoDigital Proiect PULSE Facem România bine Insurtech Talks Pagini de [cod] Totul pentru pacienți #SanatosiAcasa Banking și mai și Memorial – spitalul din afară Sistemul Garanție – Returnare Blogul PwC Romania Anadolu – Excelență în Oncologie EY – Fiscalitatea la zi Alternative fără fum Dă tu tonul, alege cartonul! Drink Insider Legile Afacerilor GoDigital Proiect PULSE English HomeRăzboi în UcrainaInternaționalPoliticEducațieSănătateMinte&CorpCopii&PărințiProiect PULSE Război în Ucraina Internațional Politic Educație Sănătate Minte&Corp Copii&Părinți Proiect PULSE Război în Ucraina Internațional Politic Educație Sănătate Minte&Corp Copii&Părinți Proiect PULSE EconomieFinanțe – BănciCompaniiEuROfonduriAutoITTelecomEnergieThe cost of money Finanțe – Bănci Companii EuROfonduri Auto IT Telecom Energie The cost of money Finanțe – Bănci Companii EuROfonduri Auto IT Telecom Energie The cost of money SportSuperLigaEuro 2024FotbalTenisMotorPariuri – PublicitateAlte sporturi SuperLiga Euro 2024 Fotbal Tenis Motor Pariuri – Publicitate Alte sporturi SuperLiga Euro 2024 Fotbal Tenis Motor Pariuri – Publicitate Alte sporturi LifeCălătoriiMuzicaShowbizPrin orașAcasăNaturalFun Călătorii Muzica Showbiz Prin oraș Acasă Natural Fun Călătorii Muzica Showbiz Prin oraș Acasă Natural Fun ScienceSpațiulTerraTehnologiePoveștile ȘtiințeiArheologieȘtiintele viețiiAntropologieTech&Innovation Spațiul Terra Tehnologie Poveștile Științei Arheologie Știintele vieții Antropologie Tech&Innovation Spațiul Terra Tehnologie Poveștile Științei Arheologie Știintele vieții Antropologie Tech&Innovation Opinii Dosare JuridiceDeloitteStoica & Asociaţiiact | Botezatu Estrade PartnersFilip & CompanySchoenherr & Asociatii Deloitte Stoica & Asociaţii act | Botezatu Estrade Partners Filip & Company Schoenherr & Asociatii Deloitte Stoica & Asociaţii act | Botezatu Estrade Partners Filip & Company Schoenherr & Asociatii NEWSLETTER Ultima Oră Opinii Newsletter **REGINA MARIA este rețeaua de sănătate cu cele mai multe Centre de Excelență acreditate internațional de Surgical Review Corporation, din Europa. Trei centre noi au fost acreditate în luna aprilie** Maria Munteanu Rețeaua de sănătate REGINA MARIA, liderul calității medicale din România și furnizorul de sănătate cu cele mai multe Centre de Excelență din Europa, acreditate internațional de Surgical Review Corporation, a obținut, în luna aprilie, trei noi certificări pentru Centre de Excelență. Concomitent, au fost reacreditate mai multe dintre Centrele de Excelență deja existente în rețea. Astfel, REGINA MARIA pune, din nou, medicina românească pe harta sănătății din Europa, reîntărindu-și angajamentul de a le oferi pacienților săi tratamente medicale și chirurgicale la cele mai înalte standarde internaționale. **Peste 20.000 de intervenții efectuate în Centrele de Excelență din rețea** REGINA MARIA a fost prima rețea de sănătate din România care a obținut acreditări internaționale Surgical Review Corporation şi este furnizorul de servicii medicale cu cele mai multe acreditări internaționale pentru Centre de Excelență, nu doar din România, ci și din Europa –o realizare semnificativă pentru medicina din țara noastră. „Am pus întotdeauna pe primul loc siguranța pacienților noștri și am urmărit întotdeauna să aducem în România standarde medicale așa cum vedem în spitalele internaționale, în țările care au dezvoltat o cultură a calității serviciilor de sănătate. Să aplicăm pentru acreditările SRC a fost un pas firesc al acestei preocupări”,a declarat Dr. Nirvana Georgescu, Directorul Diviziei de Calitate și Siguranța Pacientului, rețeaua de sănătate REGINA MARIA. 16 dintre cele 22 de Centre de Excelență acreditate SRC existente în România se află în cadrul REGINA MARIA, în spitale și centre ale rețelei din București (Ponderas Academic Hospital și Spitalul Euroclinic), Timișoara (Spitalul Premiere) și Constanța (Gastromond), unde pacienții beneficiază de servicii medicale de cea mai înaltă calitate și de expertiza unor echipe medicale de top. Mai mult,dintre cele 33 de acredităripentru Chirurgi de Excelență existente în România, 25 sunt deținute de medici chirurgi care activează în rețeaua REGINA MARIA. Până în prezent,au fost efectuate peste 20.000 de intervenții chirurgicaleîn Centrele de Excelență din rețeaua REGINA MARIA. **Ce este un Centru de Excelență și de ce este relevant pentru pacienții români?** Un Centru de Excelență acreditat de Surgical Review Corporation (SRC)este o unitate medicală care respectă cele mai înalte standarde internaționale de calitate și excelență medicală și oferă pacienților acces la tratamente de top, echipe multidisciplinare, echipamente medicale moderne și tehnologii de ultimă generație care asigură o diagnosticare corectă, intervenții eficiente și monitorizare postoperatorie. Doar spitalele de top din întreaga lume sunt eligibile pentru acreditare. Pentru obținerea acesteia, este monitorizat permanent numărul de cazuri tratate, iar rezultatele intervențiilor sunt comparate cu cele ale altor spitale acreditate. Mai mult decât atât, un chirurg poate obține titulatura de Chirurg de Excelență doar după ce îndeplinește criterii care îi susțin expertiza, adică un număr minim de cazuri pentru specialitatea respectivă și rezultate foarte bune în urma intervențiilor efectuate (număr redus de complicații post-operatorii, reinternări sau reintervenții). Conform datelor SRC, în cadrul unui Centru de Excelență, se înregistrează cu 65% mai puține complicații operatorii, siguranța pacienților este îmbunătățită cu 71%, iar eficacitatea și eficiența tratamentelor sunt îmbunătățite cu 47%. **Trei noi Centre de Excelență deschise în rețeaua REGINA MARIA** În luna aprilie, au fostacreditate 3 noi Centre de Excelență în rețeaua REGINA MARIA: un Centru de Excelență în Chirurgia Metabolică și Bariatrică revizională, în Ponderas Academic Hospital – Chirurg de Excelență Prof. Dr. Cătălin Copăescu. două Centre de Excelență în Protezare Articulară, în cadrul Spitalului Euroclinic, Chirurg de Excelențǎ Dr. Robert Apostolescu, respectiv în Ponderas Academic Hospital, Chirurg de Excelență Dr. Vlad Predescu Odată obținută,acreditarea Surgical Review Corporation se reînnoiește la fiecare 3 ani, pentru dovedirea menținerii standardelor și criteriilor de calitate care au fost evaluate inițial. „Acreditările internaționale SRC se reînnoiesc o dată la trei ani, ceea ce reprezintă, pentru noi, un angajament ferm față de pacienții noștri: astfel, le reconfirmăm acestora că le asigurăm, în permanență, cele mai înalte standarde de calitate medicală. Acreditările internaționale se bazează pe seturi solide de bune practici care și-au dovedit, de-a lungul timpului, eficiența și rolul esențial în îngrijirea pacienților. Acreditările SRC sunt încă un instrument prin care ne asigurăm că pacientul nostru este în siguranță și că obținem rezultatele îngrijirii medicale pe care ni le dorim cu toții”, completează Dr. Nirvana Georgescu, Directorul Diviziei de Calitate și Siguranța Pacientului, rețeaua de sănătate REGINA MARIA. Despre Rețeaua de Sănătate REGINA MARIA Rețeaua de sănătate REGINA MARIA este lider în calitatea serviciilor medicale din România, fiind singurul operator care deține cinci spitale cu acreditări internaționale. Prin cele 22 de acreditări deținute – o performanță unică în Europa Centrală și de Est, REGINA MARIA demonstrează constant angajamentul său pentru excelența medicală și siguranța îngrijirii pacienților. În ultimul deceniu, aproape 1 milion de recenzii au fost acordate de pacienți medicilor REGINA MARIA, printr-un sistem unic de acordare a feedback-ului, ajungând astfel la o medie de 9,63 la nivelul Rețelei. Rețeaua este, totodată, lider în digitalizarea sănătății în România – aplicația medicală REGINA MARIA fiind cea mai descărcată și utilizată aplicație de acest tip, cu peste 1,7 milioane de conturi de pacienți. Articol susținut de Regina Maria 23:58•ActualitateDispută în PNL Constanța. Primarul Vergil Chițac a cerut demisia viceprimarului său 23:47•ActualitateCererea de extrădare a lui Paul al României, examinată de Curtea de Apel din Paris. Când va fi pronunţată decizia 23:34•ActualitateCirculație închisă pe podul Giurgiu-Ruse. Măsura va viza toate categoriile de autovehicule 23:21•ActualitateUcraina va pierde şi mai mult teritoriu dacă refuză condiţiile Moscovei, ameninţă negociatorul-șef al Rusiei 23:00•ActualitateVIDEO Noi evoluții în SUA: Pușcașii marini așteaptă în afara Los Angeles, în timp ce protestele se extind în mai multe orașe 22:40•ActualitateSituația de la Salina Praid se înrăutățește. Populația din zonă, sfătuită să-și facă stocuri de apă potabilă 22:05•ActualitateDOCUMENT Motivarea CCR privind secretizarea declarațiilor de avere ale demnitarilor vorbește despre „O atenție publică nerezonabilă” / Alte observații 21:45•ActualitateNegocieri tensionate pe măsurile fiscale, încheiate fără consens / Când vor fi reluate discuțiile Eugen RădulescuNe-am învățat să plătim cu cardurile? Ne vom dezvăța, că nimeni nu e nebun să cumpere o sticlă de lapte și să mai dea un comision de un leu10:41 Sorin Adrian PredescuStatul român e obligat să asigure accesul la tratamente noi. Dacă există, trebuie să ajungă la oameni9 iun. Cătălin TolontanIlie Bolojan și testul gunoiului8 iun. David Leonard BularcaÎntrebare pentru Patriarhia Română7 iun. SuperLiga: FC Botoșani s-a despărțit de patru jucători într-o singură zi SuperLiga: Farul a transferat un fotbalist care retrogradase în Liga 2 SuperLiga: Vadim Raţă va evolua la FC Argeş SuperLiga: Dinamo confirmă transferul lui Musi de la FCSB. El a semnat pe patru sezoane SuperLiga: Portarul grec Giannis Anestis și-a prelungit contractul cu FC Botoșani **Proiecte** Facem România bine Pagini de [cod] Totul pentru pacienți #SanatosiAcasa Banking și mai și Digitalizare IMM by NTT DATA SuperBrands Memorial – spitalul din afară AI for All by Samsung Din lumea laptelui Blogul PwC Romania Anadolu – Excelență în Oncologie EY – Fiscalitatea la zi Alternative fără fum Dă tu tonul, alege cartonul! Drink Insider Legile Afacerilor GoDigital Proiect PULSE Sameday cumpără firma de curierat Cargus Una dintre marile platforme de streaming disponibile și în România își va schimba proprietarul Un patron român cu afaceri de 60 milioane EUR anual cere ANAF controale mai eficace: „Avem vecini magazine care aveau un singur bon pe zi” Glovo și firma-mamă, Delivery Hero, amendate de UE cu 329 milioane EUR Companiile aeriene trag un semnal de alarmă privind taxele vamale care le afectează și „distrug bunăstarea și nivelul de trai” Fumigene sau soluții pentru echilibrarea bugetului? Oglinzile biologiei. Cum ne devorăm elitele O carte pentru optimiști Estul care (încă) rezistă – Moldova, România și defensiva liberală a Uniunii Europene Despre muncă și alți demoni Trendyol România, reacție la informațiile privind concurența neloială: Vrem să creștem împreună cu afacerile românești Oradea: Eveniment pentru antreprenori și inovatori, pe 18 iunie 2025 „Există anumite îngrijorări legat de ceea ce va însemna AI pentru creatori și site-uri. Noi vedem lucrurile foarte diferit” – cercetător senior al Google [P] Generația Z la muncă în România: Dincolo de TikTok și așteptări salariale HP lansează primul dispozitiv pentru tehnologia Google de videoconferințe 3D Despre NoiSiteContactRedacțiePublicitate Site Contact Redacție Publicitate Site Contact Redacție Publicitate AgentiiAgerpresFrance PresseNews.roReutersProfimedia ImagesInquam PhotosDreamstime Agerpres France Presse News.ro Reuters Profimedia Images Inquam Photos Dreamstime Agerpres France Presse News.ro Reuters Profimedia Images Inquam Photos Dreamstime Parteneri MediaContributorsDeutsche WelleEuractivRise ProjectStartupCafe Contributors Deutsche Welle Euractiv Rise Project StartupCafe Contributors Deutsche Welle Euractiv Rise Project StartupCafe ParteneriEsri RomaniaGTSMedlifeTremend Esri Romania GTS Medlife Tremend Esri Romania GTS Medlife Tremend HotNews.ro utilizeazăcookie-uri pentru a îmbunătăți experiența dvs. AccesațiModifică Setărilepentru preferințe și consultațiPolitica de confidențialitate. Continuarea navigării implică acceptareaTermenilor și Condițiilor. © HotNews.ro 2006-2024"}