{"id": 2157, "name": "The Times of India", "domain": "timesofindia.indiatimes.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/raj-kundra-on-shilpa-shettys-viral-video-from-croatia-ranbir-kapoor-alia-bhatts-new-mansion-is-costliest-celebrity-home-arbaaz-khan-confirms-sshura-khan-being-pregnant-top-5-entertainment-news-of-the-day/articleshow/121779170.cms", "title": "Raj Kundra On Shilpa Shettys Viral Video From Croatia Ranbir Kapoor Alia Bhatts New Mansion Is Costliest Celebrity Home Arbaaz Khan Confirms Sshura Khan Being Pregnant Top 5 Entertainment News Of The Day", "content": "**TOI** home cinema news movie reviews movie listings box office anime previews did you know videos showtimes blogs awards hindi english tamil telugu malayalam kannada bengali punjabi marathi bhojpuri Gujarati News entertainment hindi bollywood Raj Kundra on Shilpa Shetty's viral video from Croatia, Ranbir Kapoor-Alia Bhatt's new mansion is Bollywood's costliest: Top 5 news **Raj Kundra on Shilpa Shetty's viral video from Croatia, Ranbir Kapoor-Alia Bhatt's new mansion is Bollywood's costliest: Top 5 news** Small Medium Large The TOI Entertainment Desk is a dynamic and dedicated team of journalists, working tirelessly to bring the pulse of the entertainment world straight to the readers of The Times of India. No red carpet goes unrolled, no stage goes dark - our team spans the globe, bringing you the latest scoops and insider insights from Bollywood to Hollywood, and every entertainment hotspot in between. We don't just report; we tell tales of stardom and stories untold. Whether it's the rise of a new sensation or the seasoned journey of an industry veteran, the TOI Entertainment Desk is your front-row seat to the fascinating narratives that shape the entertainment landscape. Beyond the breaking news, we present a celebration of culture. We explore the intersections of entertainment with society, politics, and everyday life.Read More **Visual Stories** 10 baby girl names inspired by the beauty of nature 10 baby girl names inspired by the beauty of nature Bollywoodâ\u0080\u0099s Child Stars: Then and Now â\u0080\u0093 A Stunning Transformation Through the Years Bollywoodâ\u0080\u0099s Child Stars: Then and Now â\u0080\u0093 A Stunning Transformation Through the Years 9 low-maintenance but beautiful flowers that will add a burst of colour to the balcony 9 low-maintenance but beautiful flowers that will add a burst of colour to the balcony Deepika and Ranveer in ethnic elegance: the couple wrapped in Royalty, Aristocracy in Bollywood Deepika and Ranveer in ethnic elegance: the couple wrapped in Royalty, Aristocracy in Bollywood Nishchay Malhan and Ruchika Rathore's dreamy wedding pictures Nishchay Malhan and Ruchika Rathore's dreamy wedding pictures 10 largest animals on Earth and where to spot them 10 largest animals on Earth and where to spot them 8 beauty products that aren't worth the money 8 beauty products that aren't worth the money Zodiac signs that remain calm in anger Zodiac signs that remain calm in anger Kabir Das Jayanti 2025: 10 dohas by Kabir that are great life lessons Kabir Das Jayanti 2025: 10 dohas by Kabir that are great life lessons How Each Zodiac Sign Causes Their Own Heartbreak How Each Zodiac Sign Causes Their Own Heartbreak 1 2 3 **Photostories** 1 2 3 1 2 3 4 **Featured In Movies** **** **MORE FROMETIMES**"}