{"id": 1968, "name": "Florida Daily", "domain": "floridadaily.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://floridadaily.com/florida-department-of-agriculture-and-consumer-services-searches-for-the-next-florida-future-chef-champion/", "title": "Florida Department Of Agriculture And Consumer Services Searches For The Next Florida Future Chef Champion", "content": "Home Politics Economy MoreCrimeEducationTheme ParksAbout Us Crime Education Theme Parks About Us Crime Education Theme Parks About Us Hi, what are you looking for? **Florida Daily** Home Politics Economy MoreCrimeEducationTheme ParksAbout Us Crime Education Theme Parks About Us Crime Education Theme Parks About Us **Florida News** **Florida Department of Agriculture and Consumer Services Searches for the Next Florida Future Chef Champion** By Published TheFlorida Department of Agriculture and Consumer Services(FDACS) is now accepting entries forFlorida Future Chef 2025,a statewide student cooking competition that celebrates Florida agriculture, culinary creativity, and nutritional awareness of theNational School Lunch Program. Now in its fifth year, Florida Future Chef invites Florida students ages 7-13 to submit a short, two-to-five-minute video preparing an elevated school meal using at least one Florida commodity. Students are competing to win prizes including up to $5,000 in college funds, sponsored by the 2025 Presenting Partner, the Sprouts Healthy Communities Foundation. The contest is open now through July 11 at 11:59 p.m. ET. “Empowering Florida’s students with hands-on culinary experience is key to cultivating nutritious eating habits and a deeper appreciation for our state’s rich agricultural roots,” said Florida Commissioner of Agriculture Wilton Simpson. “Through the Florida Future Chef competition, we’re not only encouraging creativity in the kitchen, but also helping students understand the value of using fresh, Florida-grown ingredients.” Each year, FDACS’ Division of Food, Nutrition and Wellness reviews hundreds of submissions to select the top three finalists from across the state. These talented culinary creatives are then invited to participate in a three-day finale event in Tampa, Florida, where they will vie for the title of 2025 Florida Future Chef Champion. During the event, they will learn kitchen skills, receive education about nutrition standards for school meals, and prepare their finale dish for a panel of three judges. In addition to the title, student chefs will compete for up to $5,000 in a Florida 529 Savings Plan scholarship, the honor of having their recipe adapted into a school meal, and other special prizes. The contest is an extension of Florida’s National School Lunch Program, through which Florida schools provide nutritionally balanced, low-cost or no-cost lunches to children each school day. VisitFloridaFutureChef.comto learn more about the competition, including official rules and how to enter. Jacksonville Area News Orlando Area News Miami Area News Tampa Area News **Trending News** **This Years Farm Bill See as a Win for Agriculture and Consumers** **This Years Farm Bill See as a Win for Agriculture and Consumers** Calling it the most far-reaching agriculture legislative package ever enacted by the state legislature, this year’s farm bill enhances Florida’s agricultural community and consumers.Prioritizing... **Popular Stories** **Florida’s Future Growth Will Come from The Rural Counties** **Florida’s Future Growth Will Come from The Rural Counties** It’s being called Florida’s “Rural Renaissance.”A report from the Florida Chamber Foundation (FCF) says with the proper investment, Florida’s 31 rural counties are poised... **Education News** **University of Florida Researchers Testing New Tree Resistant to Citrus Greening** **University of Florida Researchers Testing New Tree Resistant to Citrus Greening** A new report from the University of Florida (UF) indicates that researchers are testing a new type of citrus tree designed to combat the... **Popular Stories** **Three Potential Candidates for Florida Governor in 2026** **Three Potential Candidates for Florida Governor in 2026** With Ron DeSantis‘ second term expiring after 2026, speculation over Florida’s next governor is beginning to grow. Below is a list of three names... Our Team Political News Home Economy Privacy Policy We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off insettings. Privacy Overview Strictly Necessary Cookies 3rd Party Cookies This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. HOW WE COLLECT E-MAIL INFORMATION: If you sign up to subscribe to Florida Daily’s e-mail newsletter, you will provide us your e-mail address and name, voluntarily, and we will never obtain any of your contact information that you don’t voluntarily provide. HOW WE USE AN E-MAIL ADDRESS IF YOU VOLUNTARILY PROVIDE IT TO US: If you voluntarily provide us with your name and email address, we will use it to send you one email update per weekday. Your email address will not be given to any third parties. YOUR CONTROLS: You will have the option to unsubscribe to our E-mail update at anytime by clicking an unsubscribe link that will be provided in each E-Mail we send. Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. This website uses Google Analytics to collect anonymous information such as the number of visitors to the site, and the most popular pages. Keeping this cookie enabled helps us to improve our website. Please enable Strictly Necessary Cookies first so that we can save your preferences!"}