{"id": 1166, "name": "Red Pepper", "domain": "redpepper.org.uk", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.redpepper.org.uk/economics-unions-work/capitalism/the-war-racket-the-military-industrial-complexs-grip-on-political-and-economic-life/", "title": "The War Racket The Military Industrial Complexs Grip On Political And Economic Life", "content": "Subscribe to Red Pepper About Search Global Politics Political Parties and Ideologies Economics, Unions and Work Environment and Climate Law, Policing and Justice Society and People Culture and Media ABOUT US CURRENT ISSUE ARCHIVE Subscribe to Red Pepper Subscribe to Red Pepper About Search Global Politics Political Parties and Ideologies Economics, Unions and Work Environment and Climate Law, Policing and Justice Society and People Culture and Media Feature **The war racket: the military industrial complex’s grip on political and economic life** Paul Rogerscritiques the extensive network of politicians, corporations and institutions that keep the military at the front and centre of our politics 5 to 6 minute read UK Prime Minister Boris Johnson visiting BAE Systems Warton in Preston, LancashireCREDIT: ANDREW PARSONS With global military expenditure reaching record highs in 2021, before Russia’s horrific invasion of Ukraine, it is increasingly clear that the military industrial complex is once more moving into the position of what Dwight Eisenhower termed ‘unwarranted influence’. Across the world, militarism (and the mountains of money this entails) is again on the rise. The United States has already providedbillions of dollars in security assistance to Ukrainesince the war began. Germany has rapidlyincreased defence spendingin response to Putin’s war and there are increasingly loud calls fromScandinavian countries to join NATO. Behind this state expenditure are, of course, the lobbying efforts of the industry’s most powerful corporate players. It was reported that in 2020 alone, five US corporations – Lockheed Martin, Boeing, Northrop Grunman, Raytheon Technologies and General Dynamics – spent $60 million pressuring politicians in the US. Yet this corporate power does not fully explain the military industrial complex’s sustained grip on political and economic life. **A closely integrated system** The complex in Britain, as elsewhere, has three core components: the military, the civil service and the corporations. For the military the ostensive rationale is obviously the defence of the realm, but promotion and career progress are significant individual motives, along with inter-service rivalry. For the civil service, the emphasis is more strongly on career prospects. The manufacturing corporations, inevitably, pursue profit. Yet the complex runs much deeper and wider than these three institutions. The intelligence services, think tanks, university departments and private companies all have a role to play.Trade unions, concerned with defending members’ jobs, have also contributed to a sustained militarism. Theinter-connections, therefore, are numerous. In the economically important area of arms sales, embassies provide local contacts, with diplomats and defence attachés lubricating sales processes wherever they can. Corporations also maintain very close links with the civil service, with secondments of personnel, principally from the former to the latter. The same is the case with uniformed military staff, except that transit from the military to corporations is most common. Private military companies have become much more useful in the post-9/11 world, and they rely heavily on former military personnel, especially special forces. It is hardly surprising that a cluster of these companies can befound around Hereford, which is conveniently close to an SAS barracks. Revolving doors between sectors are especially useful in cementing relationships. Former military and civil servants gravitate to think tanks and university departments, and senior military and civil servants approaching retirement are much in demand by the arms corporations. Retainers, consultancies and even seats on boards are delightful carrots, especially with the early retirement ages and lack of bonuses in the public sector. Politicians, too, (both serving and retired) benefit from the revolving door, with people from both major parties grasping the opportunities. There is a high degree of conformity across the major political parties where the military is concerned, with Labour often mimicking or looking to outflank the Tories on defence for appear of appearing unpatriotic. Evencriticism of NATO is now forbiddenwithin Labour ranks. It is hardly surprising, then, given the extensive relationships and networks outlined above, that radical leaders who challenge militarism and war are demonised and presented as a danger to the system. In the days following the 2017 election, when Jeremy Corbyn’s Labour had come so close to being able to form a minority government, Corbyn delivered a speech to the United Nations in Geneva. In it, he emphasised that a ‘bomb first, think later’ approach to conflict resolution was one of four grand challenges to human security. The fact that Corbyn directly challenged the defence establishment and the traditionally close Atlantic relationship explains many of the concerted efforts to stop him, from within and outside the Labour Party. The same pressures are now involved in the obsession of the Starmer leadership toexpunge all trace of Corbyn and Corbynismfrom the party. **The culture of military security** The nature of political culture regarding security has also been important in sustaining the military industrial complex. That culture privileges national security as the prime imperative to which other needs should be subordinated. It scarcely recognises security as a common right. National interests are defined by the political establishment, including corporate business interests, with the narrative typically dominated by a small and exclusive elite, to the exclusion of other voices. There is often a strong theme of national status with a premium on making Britain (or the US, France, Turkey, India) great again. The concentration of power and influence in the military industrial complex has to be dismantled if we are going to encourage new approaches relevant to global human needs The overall culture, driven as it is by profit, is essentially short-term and concentrates on military threats, overlooking outstanding fundamental challenges such as climate breakdown and severe socio-economic inequality. In this culture the overall intention is to have control over the strategic environment primarily through offensive military capabilities and alliances. It is permeated by a deeply entrenched masculinity, leading to an emphasis on military responses to the exclusion of a comprehensive conversation on the social and ecological conditions of security. Two further elements of the culture are crucial, and both are difficult to counter. One is a penchant for secrecy that permeates the system and provides a convenient excuse for closing down discussion. This is especially true of nuclear issues, on which the Johnson government has been entirely secretive. The other is the inevitable resort to patriotism and the dangers of appeasement in the face of any serious intellectual or factual challenge. **Radically rethinking security** The sheer concentration of power and influence that resides in the military industrial complex has to be dismantled if we are going to succeed in encouraging new approaches relevant to global human needs. The many high-profile failures of western intervention (think, for instance, of Afghanistan) or the military’s failure to adequately contribute to the response to the Covid-19 pandemic or ongoing climate breakdown speaks to its irrelevance in the world we have to build. Fortunately, there are some strong campaigning groups and individual scholars that throw light on the nature of the security complex, the Campaign Against the Arms Trade being one example. At the more general level, theRethinking Securitygroup leads a coalition of movements, think tanks, academics, campaigners and practitioners and has recently established the three-year Alternative Security Review for the UK. This will be rooted in a human security-focused strategy ‘that will prioritise inclusion, equality, accountability and well-being at home, as well as a vision of shared global security and a commitment to the ecological security of our planet’. In times of crisis, such as these, it is imperative to think beyond the status quo and replace the institutions that got us here. In the case of the military industrial complex, there is an irrefutable argument to rethink the entire system. **This article first appeared in Issue #236The War Racket.Subscribetoday to support independent socialist media and get your copy hot off the press!** Paul Rogersis emeritus professor of peace studies at Bradford University **Share this page** Twitter Facebook LinkedIn **Community Consultation 2025** Help shape the future of Red Pepper **Related Content** The spiral of violence in Balochistan Nakba facing Palestine then and now Thames Water and the failures of privatisation From bystander to peacebuilder **Share this article** Facebook Twitter **Subscribe to Red Pepper Magazine** Fed up with the mainstream media? Support radical, challenging, independent media instead! Subscribe now to get our last quarterly print magazine delivered to your door PLUS access to our exclusive Subscribers newsletter and FULL digital archive – over 245 issues going back to June 1994! NEW SUBSCRIPTIONSSUPPORT EMERGING WRITERS AND FUND OUR ONLINE PUBLISHING, EVENTS AND CAMPAIGN WORK Choose how much you pay! **Get the latest articles and updates in your inbox** Sign up for our exciting Pepperista monthly email Facebook Twitter About usGet involvedContactPrivacy PolicyCurrent issuePast issuesWrite for us Red Pepper is published by Socialist Newspaper (Publications) Ltd (Reg. No. 02644973, VAT No. 577 5026 20) and printed by Zenith Print & Packaging Ltd. © Socialist Newspaper (Publications) Ltd 2023. ISSN 1353-7024 Facebook Twitter About usGet involvedContactPrivacy PolicyCurrent issuePast issues Red Pepper is published by Socialist Newspaper (Publications) Ltd (Reg. No. 02644973, VAT No. 577 5026 20) and printed by Zenith Print & Packaging Ltd. © Socialist Newspaper (Publications) Ltd 2023. ISSN 1353-7024 **For a monthly doseof our best articlesdirect to your inbox...**"}