{"id": 1920, "name": "Claremont Institute", "domain": "claremont.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.claremont.org/claremont-institute-awarded-prestigious-national-humanities-medal/", "title": "Claremont Institute Awarded Prestigious National Humanities Medal", "content": "Claremont Review of Books American Mind Center for the American Way of Life Founding.com Facebook Twitter Youtube Podcast Sign-Up Donate Search AboutMission & OverviewLeadership & StaffBoard of DirectorsScholarsAnnual ReportPress ReleasesCareersContact Mission & Overview Leadership & Staff Board of Directors Scholars Annual Report Press Releases Careers Contact Mission & Overview Leadership & Staff Board of Directors Scholars Annual Report Press Releases Careers Contact PublicationsClaremont Review of BooksAmerican MindFounding.comCAWL ProvocationsCAWL Investigative ReportsAmerican Way of Life Claremont Review of Books American Mind Founding.com CAWL Provocations CAWL Investigative Reports American Way of Life Claremont Review of Books American Mind Founding.com CAWL Provocations CAWL Investigative Reports American Way of Life CentersCenter for Constitutional JurisprudenceThe Center for the American Way of Life Center for Constitutional Jurisprudence The Center for the American Way of Life Center for Constitutional Jurisprudence The Center for the American Way of Life FellowshipsOur FellowshipsPublius FellowshipLincoln FellowshipJohn Marshall FellowshipSpeechwriters FellowshipSheriffs FellowshipAlumni SpotlightAlumniApplication Forms Our Fellowships Publius Fellowship Lincoln Fellowship John Marshall Fellowship Speechwriters Fellowship Sheriffs Fellowship Alumni Spotlight Alumni Application Forms Our Fellowships Publius Fellowship Lincoln Fellowship John Marshall Fellowship Speechwriters Fellowship Sheriffs Fellowship Alumni Spotlight Alumni Application Forms Events Media Podcasts **Claremont Institute Awarded Prestigious National Humanities Medal** 11.18.2019 As one of America’s leading think tanks, the Claremont Institute has made invaluable contributions to the history of American conservative thought.Claremont educates, reminds, and informs Americans about the founding principles that have made our country the greatest nation anywhere on earth. Through publications, seminars, and scholarships, they fight to recover the American Idea—I know it well—by teaching about the Declaration of Independence, the Constitution, the writings of Abraham Lincoln (whose bedroom is right above us). The Claremont Institute helps preserve our national traditions for generations to come.— President Donald J. Trump Claremont, CA, November 18, 2019—The Claremont Institute is pleased to announce that it has been selected as a recipient of the prestigious National Humanities Medal. This high honor, bestowed by the President in consultation with the National Endowment for the Humanities, honors individuals or groups whose work has deepened the nation’s understanding of the humanities, broadened citizens’ engagement with the humanities, or helped preserve and expand Americans’ access to important resources in the humanities. “We are humbled by this honor and grateful to President Trump and NEH Chairman Peede,” said Claremont Institute President Ryan Williams. “The medal is more than anything a testament to 40 years of teaching and writing about the history and intellectual traditions of the American founding and their application to our politics today—and to our teachers, students, staff, and supporters whose dedication these past four decades has been essential to our work, success, and most importantly, to promoting and defending American greatness.” Along with the Claremont Institute, which is only the second think tank to ever receive this high distinction, the President recognizes educator and philanthropist Dr. Teresa Lozano Long, chef Patrick J. O’Connell, and author James Patterson. Past recipients of the medal include luminaries such as Allen Bloom, Ken Burns, Tom Wolfe, Richard Peck, Thomas Sowell, Joseph Epstein, Harvey Mansfield, Victor Davis Hanson, and David McCullough. Since its founding in 1979, the Claremont Institute’s mission has been to “restore the principles of the American Founding to their rightful, preeminent authority in our national life.” Claremont serves this mission in part through its four annual fellowship programs—Publius, Lincoln, John Marshall, and Speechwriters—which engage the most promising young thinkers and statesmen by examining the historical arc leading from the American Founding to today’s progressivism. Alumni of these prestigious programs today total more than 700, with many now in prominent positions in government, academia, and journalism. Claremont also provides the most thoughtful intellectual debate on the right through its flagship publication theClaremont Review of Books, a journal of political thought and statesmanship, andThe American Mind, an online publication examining the ideas that drive American political life. Finally, we bring the natural law constitutionalism of the Founding to America’s courts through our Center for Constitutional Jurisprudence. ###### Download logo Download media press kit We Need Your Support **Give the Gift of Freedom** Give Now Stay Connected **Sign-up for Updates** \"*\" indicates required fields Δ Facebook Twitter Youtube Podcast Sign-Up Donate **About** Mission & Overview Leadership & Staff Board of Directors Scholars Annual Report Press Releases Careers Contact **Publications** Claremont Review of Books American Mind Founding.com CAWL Provocations CAWL Investigative Reports American Way of Life **Centers** Center for Constitutional Jurisprudence The Center for the American Way of Life **Fellowships** Our Fellowships Publius Fellowship Lincoln Fellowship John Marshall Fellowship Speechwriters Fellowship Sheriffs Fellowship Alumni Spotlight Alumni Application Forms ©2025 Claremont Institute |Privacy Policy Mission & Overview Leadership & Staff Board of Directors Scholars Annual Report Press Releases Careers Contact Claremont Review of Books American Mind Founding.com CAWL Provocations CAWL Investigative Reports American Way of Life Center for Constitutional Jurisprudence The Center for the American Way of Life Our Fellowships Publius Fellowship Lincoln Fellowship John Marshall Fellowship Speechwriters Fellowship Sheriffs Fellowship Alumni Spotlight Alumni Application Forms Donate FacebookTwitterYoutubePodcast Facebook Twitter Youtube Podcast Facebook Twitter Youtube Podcast Sign-Up"}