{"id": 1270, "name": "The Sociable", "domain": "sociable.co", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://sociable.co/government-and-policy/wef-international-cybercrime-coordination-authority-impose-collective-penalties/", "title": "Wef International Cybercrime Coordination Authority Impose Collective Penalties", "content": "Social Web Mobile Science **WEF blog calls for an ‘International Cybercrime Coordination Authority’ to impose collective penalties on uncooperative nations** SHARE **How long until online misinformation and disinformation are considered cybercrimes? perspective** The World Economic Forum (WEF) publishes a blog post calling for the creation of a global authority on cybercrime that would have extradition and enforcement powers over uncooperative nations. Last week, the WEF published ablogpostentitled, “4 steps towards creating an international agency against cybercrime,” in which the authors argue for the creation of an “International Cybercrime Coordination Authority (ICCA)” to act as an intelligence sharing body between like-minded nations that also has to the power to “standardize cybercrime extradition laws” and to “impose collective penalties on nations” that refuse to cooperate. “It is time to formalize these efforts through the creation of an International Cybercrime Coordination Authority (ICCA), a standing alliance of nations committed to coordinated enforcement, intelligence-sharing, legal harmonization and joint disruption of cybercriminal infrastructure” Written by Anna Sarnek from Amazon Web Services and Ross Haleliuk of Venture in Security, the article is part of the WEF’s Center for Cybersecurity wherein the authors argue that the establishment of an ICCA would go far beyond the intelligence sharing capabilities of groups like the Five Eyes, the UN, and NATO and into the realm of collective punishment and extradition powers over nations. “While intelligence-sharing networks like Five Eyes and global institutions like the United Nations (UN) have historically played a role in international warfare, they are not sufficient to address the scale, complexity and speed of modern digital threats,” they write. To the unelected globalists, every problem is a global one, and every problem requires a global solution bathed in bureaucracy. “The ICCA would push to standardize cybercrime extradition laws, simplify digital evidence-sharing procedures and impose collective penalties (financial or diplomatic) on nations that refuse to cooperate or actively harbor offenders” Using Russia as an exemplary boogeyman for providing a safe haven for cybercriminals, the WEF authors want the ICCA, once established, to “impose collective penalties” on the country for being uncooperative and actively harboring offenders. “In order to stop safe havens like Russia, we need to standardize extradition laws for cybercriminals and strengthen Interpol-led cybercrime enforcement,” they write. However, before setting up an international body that would operate like a hybrid International Cybercriminal Court, a Global Police Force, and a Five Eyes rolled into one, a definition of what cybercrime actually is will be needed. “Building on top of the work by Partnership against Cybercrime (PAC), a globally recognized legal definition of cybercrime could include attacks on hospitals, emergency services, airports and public utilities, ransomware, digital extortion, financial fraud, phishing, and identity theft at scale, as well as operation of criminal infrastructure such as botnets and dark web marketplaces,” the authors write. What the authors leave out is that the Partnership against Cybercrime Working Group, and the WEF in general for that matter, also considers online “disinformation” as a threat to democratic governments as detailed in anInsight Reportfrom November, 2020. “In addition to financial crimes, criminals use internet based infrastructure to uphold terrorism and drug trafficking, and spread disinformation to destabilize governments and democracies” Commenting on this point is investigative journalist, author, and contributing editor atUnlimited Hangout, who wrote “Ending Anonymity: Why the WEF’s Partnership Against Cybercrime Threatens the Future of Privacy” forThe Last American Vagabondin July 2021: “Notably, the WEF Partnership against Cybercrime employs a very broad definition of what constitutes a ‘cybercriminal’ as they apply this label readily to those who post or host content deemed to be ‘disinformation’ that represents a threat to ‘democratic’ governments. The WEF’s interest in criminalizing and censoring online content has been made evident by its recent creation of a newGlobal Coalition for Digital Safetyto facilitate the increased regulation of online speech by both the public and private sectors.” “Shoring up trust will be a key goal of cybersecurity efforts over the next decade. The online spread of mis- and disinformation are now core cybersecurity concerns”“Cybersecurity will become less about protecting the confidentiality and availability of information and more about protecting its integrity and provenance” If that wasn’t enough, the WEF declared that online misinformation and disinformation were “core cybersecurity concerns” ina reportpublished on December 5, 2023 entitled “Cybersecurity Futures 2030: New Foundations.” According to the report, “Stable governments that follow through on long-term technology and cybersecurity strategies can become trusted ‘brands,’ gaining advantages in attracting talent, seizing leadership opportunities in multilateral standards-setting processes and countering disinformation campaigns.” Fast forward a few years, and the desire to stamp out all narratives that don’t align with unelected globalists at the UN and WEF has only intensified. For the second year in a row, the WEF has declared that the greatest global risk is misinformation and disinformation. According to the WEF Global Risks 2025report: Polarization “continues to fan the flames of misinformation and disinformation, which, for the second year running, is the top-ranked short- to medium-term concern across all risk categories. “Efforts to combat this risk are coming up against a formidable opponent in Generative AI-created false or misleading content that can be produced and distributed at scale,” which was the same assessment given in the 2024 report. “TheGlobal Initiative for Information Integrity on Climate Changeresponds to the commitment in the Global Digital Compact, adopted by United Nations Members States at the Summit of the Future in September 2024, which encourages UN entities, in collaboration with Governments and relevant stakeholders, to assess the impact of mis- and disinformation on the achievement of the Sustainable Development Goals” Last year, the G20 launched the “Global Initiative for Information Integrity on Climate Change” as an attempt “to address disinformation campaigns that are delaying and derailing climate action.” In the name of “information integrity” any narrative that could impede upon the UN’s Sustainable Development Goals (SDGs) is to be stamped out. According to the G20 Leaders Summit 2024,“The Initiative responds to the commitment in the Global Digital Compact, adopted by United Nations Members States at the Summit of the Future in September 2024, which encourages UN entities, in collaboration with Governments and relevant stakeholders, to assess the impact of mis- and disinformation on the achievement of the Sustainable Development Goals.” At the time UN Secretary General Antonio Guterres remarked that member states must work together to crush climate disinformation. “We must fight the coordinated disinformation campaigns impeding global progress on climate change, ranging from outright denial to greenwashing to harassment of climate scientists. Through this Initiative, we will work with researchers and partners to strengthen action against climate disinformation” \"We must fight the coordinated disinformation campaigns impeding global progress on climate change, ranging from outright denial to greenwashing to harassment of climate scientists\" Antonio Guterres, G20 Leaders Summitpic.twitter.com/2fkR0hAP2a In 2023, the UN established a “voluntary UN Code of Conduct for Information Integrity on Digital Platforms” replete with policies aimed atsilencing dissenting voiceson digital platforms under the guise of mitigating “mis- and disinformation,” which is conveniently lumped-in with hate speech. To give you an idea of the sheer size and scope to which the UN wishes to eradicate anything it deems “mis- and disinformation,” here are a few policy recommendations taken from the “Towards a United Nations Code of Conduct” section of thepolicy briefthat calls-on not just member states, but private groups such as stakeholders (i.e. NGOs, businesses, academia, etc.), digital platforms, advertisers, and news media to do the UN’s bidding: All stakeholdersshould refrain from using, supporting or amplifying disinformation and hate speech for any purpose. All stakeholdersshould allocate resources to address and report on the origins, spread and impact of mis- and disinformation and hate speech, while respecting human rights norms and standards and further invest in fact-checking capabilities across countries and contexts. All stakeholdersshould promote training and capacity-building to develop understanding of how mis- and disinformation and hate speech manifest and to strengthen prevention and mitigation strategies. All stakeholdersshould take urgent and immediate measures to ensure the safe, secure, responsible, ethical and human rights-compliant use of artificial intelligence and address the implications of recent advances in this field for the spread of mis- and disinformation and hate speech. Member Statesshould ensure public access to accurate, transparent, and credibly sourced government information, particularly information that serves the public interest, including all aspects of the Sustainable Development Goals. Member Statesshould invest in and support independent research on the prevalence and impact of mis- and disinformation and hate speech across countries and languages, particularly in underserved contexts and in languages other than English, allowing civil society and academia to operate freely and safely. Digital platformsand advertisers should ensure that advertisements are not placed next to online mis- or disinformation or hate speech, and that advertising containing disinformation is not promoted. Digital platformsshould ensure meaningful transparency regarding algorithms, data, content moderation and advertising. Digital platformsshould publish and publicize accessible policies on mis- and disinformation and hate speech, and report on the prevalence of coordinated disinformation on their services and the efficacy of policies to counter such operations. Digital platformsshould ensure the full participation of civil society in efforts to address mis- and disinformation and hate speech. News mediashould ensure that all paid advertising and advertorial content is clearly marked as such and is free of mis- and disinformation and hate speech. In its own words, the UN is primarily concerned with what it deems to be “misinformation” because the unelected globalist body is worried about information that may affect “UN mandate delivery and substantive priorities,” especially when it comes to criticism of its Sustainable Development Goals. To bring it all back home, the WEF is promoting the creation of anInternational Cybercrime Coordination Authority, but how long will it be until online misinformation and disinformation are considered cybercrimes? Don’t agree with climate change narratives? You’re a murderer for killing the planet. You’re committing ecocide. Don’t agree with illegal migration? You’re a bigot and what you say is hate speech. Don’t like what your representatives are doing and want to speak up? You’re undermining the authority of democratic governments. Don’t want to be a part of the UN’s Agenda 2030 or the WEF’s great reset? You’re eroding trust in institutions. Don’t want war? You’re supporting dictators, thugs, and terrorists. With so-called hate speech constantly being lumped together with mis-and-disinformation regarding “digital safety,” how long before the two are indistinguishable? Image Source: AI-generated by GROK SHARE globalism great reset perspective wef Tim Hinchliffe The Sociable editor Tim Hinchliffe covers tech and society, with perspectives on public and private policies proposed by governments, unelected globalists, think tanks, big tech companies, defense departments, and intelligence agencies. Previously, Tim was a reporter for the Ghanaian Chronicle in West Africa and an editor at Colombia Reports in South America. These days, he is only responsible for articles he writes and publishes in his own name.[email protected] Tim Hinchliffe The Sociable editor Tim Hinchliffe covers tech and society, with perspectives on public and private policies proposed by governments, unelected globalists, think tanks, big tech companies, defense departments, and intelligence agencies. Previously, Tim was a reporter for the Ghanaian Chronicle in West Africa and an editor at Colombia Reports in South America. These days, he is only responsible for articles he writes and publishes in his own name.[email protected] Nisum, Applied AI Consulting partner-up to turn the promise of AI into tangible results With surge in AI-generated code creates security concerns, DeepSource launches trio of autonomous AI agents for DevSecOps **Related** **Club of Rome launches joint taskforce that would restrict your food, travel & ownership choices** The 'Materials and Consumption Taskforce' is an attempt to micro-manage all aspects of your life:... **UN finalizes neurotech ethics draft, to be adopted at General Conference** The United Nations Educational, Scientific, and Cultural Organization (UNESCO) finalizes its... **Tony Blair wants UK to enable animal gene editing, fund precision-bred livestock** Is genetically editing animals really about preventing pandemics, or is there something deeper to... **Sociable's Podcast** Brains Byte Back interviews startups, entrepreneurs, and industry leaders that tap into how our brains work. We explore how knowledge & technology intersect to build a better, more sustainable future for humanity. If you’re interested in ideas that push the needle, and future-proofing yourself for the new information age, join us every Friday. Brains Byte Back guests include founders, CEOs, and other influential individuals making a big difference in society, with past guest speakers such as New York Times journalists, MIT Professors, and C-suite executives of Fortune 500 companies. In this episode ofBrains Byte Back, we dive into the world of agentic AI — the next wave of automation that’s smarter, faster, and way more capable than the AI we use today. Our guest, Ruben Phukan, CEO and co-founder of GoodGist, shares how this technology is transforming how businesses handle everything from invoices to complex workflows, unlocking huge efficiency gains along the way. According to Ruben, agentic AI is a step towards the AI Hollywood has sold us on. Doing more through goal-directed autonomy, creating a world of growth and efficiency that feels futuristic, and it’s much closer than we think.Find out more about Ruben Phukanhere. Learn more about GoodGisthere. Reach out to today’s host,Erick Espinosa–[email protected] Get the latest on tech news –https://sociable.co/ Leave an iTunes review –https://rb.gy/ampk26 Follow us on your favourite podcast platform –https://link.chtbl.com/rN3x4ecY **Trending** **DARPA to simulate disease outbreaks: model lockdown, vaccination &...** **Club of Rome launches joint taskforce that would restrict your food, travel...** **Tony Blair wants UK to enable animal gene editing, fund precision-bred livestock...** **UN finalizes neurotech ethics draft, to be adopted at General Conference...** 2023 Copyright © All rights reserved"}