{"id": 418, "name": "Economic Policy Institute", "domain": "epi.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.epi.org/blog/house-republican-budget-bill-gives-trump-185-billion-to-carry-out-his-mass-deportation-agenda-while-doing-nothing-for-workers-immigration-enforcement-would-have-80-times-more-funding-than-la/", "title": "House Republican Budget Bill Gives Trump 185 Billion To Carry Out His Mass Deportation Agenda While Doing Nothing For Workers Immigration Enforcement Would Have 80 Times More Funding Than La", "content": "**** AboutAbout EPIEventsNewsroomCareersStaffBoard of DirectorsAcademic Advisory BoardNewsletterContact UsWhy Give to EPIDonate About EPI Events Newsroom Careers Staff Board of Directors Academic Advisory Board Newsletter Contact Us Why Give to EPI Donate About EPI Events Newsroom Careers Staff Board of Directors Academic Advisory Board Newsletter Contact Us Why Give to EPI Donate Areas of ResearchBudget, Taxes, and Public InvestmentChild LaborFederal Policy WatchEconomic GrowthProgram on Race, Ethnicity, and the EconomyEducationHealthInequality and PovertyJobs and UnemploymentMinimum WageImmigrationRegulationRetirementUnions and Labor StandardsTrade and GlobalizationWages, Incomes, and WealthView all Budget, Taxes, and Public Investment Child Labor Federal Policy Watch Economic Growth Program on Race, Ethnicity, and the Economy Education Health Inequality and Poverty Jobs and Unemployment Minimum Wage Immigration Regulation Retirement Unions and Labor Standards Trade and Globalization Wages, Incomes, and Wealth View all Budget, Taxes, and Public Investment Child Labor Federal Policy Watch Economic Growth Program on Race, Ethnicity, and the Economy Education Health Inequality and Poverty Jobs and Unemployment Minimum Wage Immigration Regulation Retirement Unions and Labor Standards Trade and Globalization Wages, Incomes, and Wealth View all Publications Data Library Experts ResourcesFederal Policy Watch →How many federal workers live in your state?Family Budget CalculatorChild care costs in the United StatesEconomic Indicators →Jobs and UnemploymentState Jobs and UnemploymentState Unemployment by Race and EthnicityJOLTSMinimum Wage TrackerNominal Wage TrackerLow Wage Workforce TrackerCompany Wage TrackerGDPIncome & PovertyProductivity–Pay GapAnti-racist Policy ResearchImmigrant workers + your state factsheetsEconomic Analysis & Research Network →EARNCon 2025EARNCon SponsorshipU.S. workers’ rights preemption mapTax & Spending ExplorerMultimediaProjects →State of Working AmericaInequality.isBuilding Worker PowerSocial Media ToolkitView all Federal Policy Watch →How many federal workers live in your state? How many federal workers live in your state? Family Budget Calculator Child care costs in the United States Economic Indicators →Jobs and UnemploymentState Jobs and UnemploymentState Unemployment by Race and EthnicityJOLTSMinimum Wage TrackerNominal Wage TrackerLow Wage Workforce TrackerCompany Wage TrackerGDPIncome & PovertyProductivity–Pay Gap Jobs and Unemployment State Jobs and Unemployment State Unemployment by Race and Ethnicity JOLTS Minimum Wage Tracker Nominal Wage Tracker Low Wage Workforce Tracker Company Wage Tracker GDP Income & Poverty Productivity–Pay Gap Anti-racist Policy Research Immigrant workers + your state factsheets Economic Analysis & Research Network →EARNCon 2025EARNCon Sponsorship EARNCon 2025 EARNCon Sponsorship U.S. workers’ rights preemption map Tax & Spending Explorer Multimedia Projects →State of Working AmericaInequality.isBuilding Worker Power State of Working America Inequality.is Building Worker Power Social Media Toolkit View all Federal Policy Watch →How many federal workers live in your state? How many federal workers live in your state? How many federal workers live in your state? Family Budget Calculator Child care costs in the United States Economic Indicators →Jobs and UnemploymentState Jobs and UnemploymentState Unemployment by Race and EthnicityJOLTSMinimum Wage TrackerNominal Wage TrackerLow Wage Workforce TrackerCompany Wage TrackerGDPIncome & PovertyProductivity–Pay Gap Jobs and Unemployment State Jobs and Unemployment State Unemployment by Race and Ethnicity JOLTS Minimum Wage Tracker Nominal Wage Tracker Low Wage Workforce Tracker Company Wage Tracker GDP Income & Poverty Productivity–Pay Gap Jobs and Unemployment State Jobs and Unemployment State Unemployment by Race and Ethnicity JOLTS Minimum Wage Tracker Nominal Wage Tracker Low Wage Workforce Tracker Company Wage Tracker GDP Income & Poverty Productivity–Pay Gap Anti-racist Policy Research Immigrant workers + your state factsheets Economic Analysis & Research Network →EARNCon 2025EARNCon Sponsorship EARNCon 2025 EARNCon Sponsorship EARNCon 2025 EARNCon Sponsorship U.S. workers’ rights preemption map Tax & Spending Explorer Multimedia Projects →State of Working AmericaInequality.isBuilding Worker Power State of Working America Inequality.is Building Worker Power State of Working America Inequality.is Building Worker Power Social Media Toolkit View all Blog Donate Blog|Budget, Taxes, and Public Investment **House Republican budget bill gives Trump $185 billion to carry out his mass deportation agenda—while doing nothing for workers:Immigration enforcement would have 80 times more funding than labor standards enforcement** Blog• ByDaniel Costa• June 5, 2025 House Republicans recently passed Trump’s budget reconciliation legislation thatmassively redistributes incomefrom some of the poorest households to the richest. It is now under consideration in the Senate and Trump ispressuringsenators to pass it without major changes. Aside from cutting taxes by trillions for the wealthy, kicking 15 million people off health care, and cutting food aid for the poor, the bill provides an unfathomable amount of additional money to fund Trump’s draconian mass deportation agenda. In just a few months, Trump’s deportation troops have repeatedlyarrestedanddeportedthe wrong people,including U.S. citizens; sentinnocent people to gulagsdesigned for terrorists in third countries;separated familiesand turned children into orphans;detained high school honors students; and engaged in countless other heinous actions. The bill provides $155 billion in new immigration enforcement funding—more than five times the amount of current funding—to supercharge the ability of the Trump administration to carry out more actions like these, as well as further militarize the border and build more miles of the border wall, put immigrants in new and expanded prisons, and carry out worksite raids across the country. Altogether, asFigure Ashows, Trump would have $185 billion for immigration enforcement, and this doesn’t include additional appropriations that Congress could pass in future years. Even with all that spending, there isn’t one new cent in the bill that would go to ensuring that wages and working conditions are protected by increasing funding to the federal agencies that hold lawbreaking employers accountable. In fact, the $185 billion Trump could have at his disposal to carry out his radical immigration enforcement agenda would be 80 times more than the annual government funding for labor standards enforcement. That disparity alone tells you all you need to know about how little the Trump administration prioritizes working people. The data below can be saved or copied directly into Excel. The data underlying the figure. Notes:The total for 2025 existing funding for immigration enforcement, not including new funds via reconciliation, includes funding for U.S. Customs and Border Protection, U.S. Immigration and Customs Enforcement, and the Office of Biometric Identity Management, all of which are in the U.S. Department of Homeland Security. Notes:The total for 2025 existing funding for immigration enforcement, not including new funds via reconciliation, includes funding for U.S. Customs and Border Protection, U.S. Immigration and Customs Enforcement, and the Office of Biometric Identity Management, all of which are in the U.S. Department of Homeland Security. Totals for labor standards enforcement are for fiscal year 2023, adjusted for inflation to 2025 dollars using the CPI-U, and include appropriations for all subagencies, administrations, and offices of the U.S. Department of Labor considered for “worker protection” in budget documents, including the Employee Benefits Security Administration, Office of Workers’ Compensation Programs, Wage and Hour Division, Office of Federal Contract Compliance Programs, Office of Labor–Management Standards, Occupational Safety and Health Administration, Mine Safety and Health Administration, and the Office of the Solicitor, in addition to two other agencies not within the Department of Labor: the National Labor Relations Board and the National Mediation Board. Sources:U.S. Department of Labor,Fiscal Year 2025—Department of Labor, Budget in Brief; National Mediation Board,Congressional Justifications, fiscal year2024; National Labor Relations Board,Performance Budget Justification, fiscal year2025; and U.S. Department of Homeland Security budget data are from William L. Painter,Comparing DHS Component Funding, FY2025: In Brief, Congressional Research Service, R48115, updated May 12, 2025; and U.S. Department of Homeland Security,Congressional Budget Justification Fiscal Year(FY) 2025, section onManagement Directorate, n.d;H.R.1 - One Big Beautiful Bill Act, 119th Congress (2025-2026). American Immigration Council, \"Rapid Response Analysis: U.S. House of Representatives 2025 'Reconciliation' Spending Provisions Related to Immigration and the Border,\" Fact Sheet, May 2025; Adam Isacson, \"$160 Billion to Detain and Deport: Congress’s 'Reconciliation' Bill is a Betrayal of Priorities and Will Harm the Most Vulnerable,\" Features, Washington Office on Latin America, May 22, 2025. Copy the code below to embed this chart on your website. Let’s take stock of this new funding that would help Trump turn the country into an authoritarian police state. First, the reconciliation bill provides $27 billion for Immigration and Customs Enforcement (ICE) agents and operations. This would nearly triple the agency’s funding and make ICE the highest-funded law enforcement agency in the entire federal government. Giving ICE more funding than any other law enforcement agency toviolate due processat an even grander scale won’t help anyone, however, becausedeportations don’t improve workers’ wages and working conditions. It’ll unquestionablymake workplace conditions worse, while giving ICE the ability to do much more of what they’ve already been doing—namely, covering their faces andkidnapping studentswho are in the country lawfully, as well as going afterlabor organizers,university scientists, and even sometimes construction workers who areU.S. citizens. The bill also provides $45 billion to spend on new and expanded immigrant detention centers through September 30, 2029, nearly quadrupling ICE’sdetention budget on an annualized basis. As one analyst recentlypointed out, the federal Bureau of Prisons currently has an annual budget of $8.3 billion, so ICE’s annual budget for immigrant detention would be nearly 50% larger than that of the entire federal prison system. And then there’s $83.2 billion in new funds for border enforcement and construction of Trump’s border wall. That includes $8.3 billion for Customs and Border Protection (CBP) agents, vehicles, and facilities, $6.3 billion for border surveillance technology and vetting, and $51.6 billion for border wall construction. Another $5 billion would go to the Department of Defense (DOD) for so-called “border operations,” meaning the deployment of military personnel and the temporary detention of immigrants on DOD installations. And right before the bill passed, an additional $12 billion was added to reimburse states for money they’ve spent on border enforcement (most of which would likely go to Texas to reimburse the state government for things like barriers and razor wire they installed in the Rio Grande). In addition to mind-blowing levels of new government spending for detaining, deporting, and terrorizing immigrants, House Republicans also included punitive new taxes and fees on immigrants. They added a 3.5% fee onremittances(money sent abroad) paid by people who are not U.S. citizens, which would also turn staff at places like Western Union into de facto immigration enforcement officials because they would have to check their customers’ immigration statuses. House Republicans also voted to impose exorbitant fees on applications that immigrants file with the U.S. government. For example, people seeking relief in immigration court would be charged hundreds of dollars in new fees, and people who are the subject of immigration enforcement actions would be charged thousands. Those seeking asylum, who currently do not have to pay a fee to apply for humanitarian protection, would be required to pay a new $1,000 filing fee. The ultimate result is that asylum protections would all but disappear for children and people in detention who can’t work. Those not in detention would have to pay a new $550 fee every six months for their work permits—and people withparole and Temporary Protected Statuswould have to pay this new fee, too. A new $8,500 up-front fee for sponsors of migrant children would mean that the vast majority of children in government shelters might end up detained for lengthy periods. These are just a few examples froma long list. And finally, the bill neither improves the immigration system nor helps workers. The bill only spends $1.25 billion on the immigration court system. Investments in judges and staff would speed up adjudications on benefits and deportations and make the immigration process fairer and timelier relative to the status quo, where people with legitimate claims are left in limbo for many years about whether or not they can remain lawfully in the United States. This is a drop in the bucket compared with what’s needed. And despite the Trump administration’s manyclaimsthat they want to help U.S. workers, the Republican budget bill provides exactly zero new dollars to federal agencies that protect workers—even though these agencies’funding has been flat or decliningfor decades while workers are beinghurt, killed, androbbedon the job at alarmingrates. It spends zero on agencies that check if workplaces are safe. It spends zero to fight illegal child labor. And it spends zero dollars on the agency that enforces safety and health rules for people who work in mines. To add insult to injury, the Trump administration is working hard toreduce staffat those agencies andfiringtheir leadership, as well. The senators who vote in favor of taking this bill one step closer to becoming law will be turning their backs on workers while plunging the United States into a dark new era of authoritarianism, extreme and intrusive surveillance, and a new national network of internment camps. See related work onImmigration|Unions and Labor Standards|Budget, Taxes, and Public Investment|Budget|Congress|Public office, private gain See more work byDaniel Costa We envision an economy that is just and strong, sustainable, and equitable--where every job is good, every worker can join a union, and every family and community can thrive. EPI is a leader in the movement for economic justice. We use the tools of economics to win policy change that advances power for workers, economic security for families, and racial and gender equity in our nation. EPI's rigorous research and transformative ideas fortify worker organizing, build a shared understanding of how power and policy shape economic outcomes, and drive progressive policy change at every level of government. 1225 Eye St. NW, Suite 600Washington, DC 20005Phone: 202-775-8810 •epi@epi.org © 2025 Economic Policy Institute •Privacy Policy Accessible, up-to-date data on the living standards of workers in the United States. The state and local network of organizations improving workers' lives through research and advocacy. Exploring how race, ethnicity, and class intersect to affect economic outcomes in the United States. How do taxes and spending work, and where do you fit in? Why give to EPI|DonateEIN 52-1368964 About EPINewsroomStaff|Board of DirectorsContact us The Economic Policy Institute staff is unionized with theNonprofit Professional Employees Union."}