{"id": 915, "name": "MinnPost", "domain": "minnpost.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.minnpost.com/state-government/2025/05/i-literally-cried-why-some-dfl-lawmakers-say-they-wont-support-budget-compromise-that-phases-out-minnesotacare-for-undocumented-adults/", "title": "I Literally Cried Why Some Dfl Lawmakers Say They Wont Support Budget Compromise That Phases Out Minnesotacare For Undocumented Adults", "content": "🤍 Donate NewsOpen dropdown menuState GovernmentMetroPublic SafetyGreater MinnesotaNationalEnvironmentSportsInside MinnPost State Government Metro Public Safety Greater Minnesota National Environment Sports Inside MinnPost State Government Metro Public Safety Greater Minnesota National Environment Sports Inside MinnPost Arts & CultureOpen dropdown menuArtscapeMNopedia Artscape MNopedia Artscape MNopedia HealthOpen dropdown menuMental Health & AddictionRace & Health Equity Mental Health & Addiction Race & Health Equity Mental Health & Addiction Race & Health Equity OpinionOpen dropdown menuCityscapeCommunity Voices Cityscape Community Voices Cityscape Community Voices Newsletters Quiz Events About Us MinnPost Nonprofit, independent journalism. Supported by readers. 🤍 Donate NewsOpen dropdown menuState GovernmentMetroPublic SafetyGreater MinnesotaNationalEnvironmentSportsInside MinnPost State Government Metro Public Safety Greater Minnesota National Environment Sports Inside MinnPost State Government Metro Public Safety Greater Minnesota National Environment Sports Inside MinnPost Arts & CultureOpen dropdown menuArtscapeMNopedia Artscape MNopedia Artscape MNopedia HealthOpen dropdown menuMental Health & AddictionRace & Health Equity Mental Health & Addiction Race & Health Equity Mental Health & Addiction Race & Health Equity OpinionOpen dropdown menuCityscapeCommunity Voices Cityscape Community Voices Cityscape Community Voices Newsletters Quiz Events About Us Topics State Government Metro Public Safety Greater Minnesota National Environment Mental Health & Addiction Sports The Glean MinnPot **‘I literally cried.’ Why some DFL lawmakers say they won’t support budget compromise that phases out MinnesotaCare for undocumented adults** **Share this:** Click to email a link to a friend (Opens in new window)Email Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print **Paywall-free, every single day.** MinnPost’s reporting is always free, but it isn’t free to produce. We rely on donations from readers to fund our independent journalism.Will you join over 5,100 members and make a gift to support our local news coverage today? Sunday Review| Catch up on our biggest stories from the past week. Delivered to your inbox Sunday mornings. Daily Newsletter| MinnPost's top stories delivered to your inbox Monday through Saturday. A group of DFL lawmakers protested Thursday’s budget deal announcement in dramatic fashion: They pounded at the closed door of the governor’s reception room midway through an otherwise triumphant press conference. Their beef: MinnesotaCare being phased out for undocumented immigrant adults. Following several instances of loud thumping coming from the door that interrupted Gov. Tim Walz and other speakers, a security guard stood at the ornate wooden double doors, which remained closed. Soon after, chants of “You’ve sold out,” “Don’t kill immigrants,” and “Don’t kill our neighbors” could be heard through the heavy wood that separated the executive office reception room from the governor’s office lobby. DFL lawmakers pounded on the door of the Governor’s Reception Room during the budget press conference in protest of leadership’s compromise on stripping adult undocumented immigrants from state health care. “One Minnesota, right!” they chanted.@kare11pic.twitter.com/VhkTEGOZdI The compromise budget hammered out by Walz and legislative leadership would stop providing access to MinnesotaCare, the state’s subsidized health insurance available to low-income residents, to undocumented immigrant adults at the end of the year. The compromise would continue to provide health insurance for children who are undocumented. The move was seen as a victory for Republicans, who hold shared power with the DFL over the Minnesota House and had argued the program’s costs would spiral. **Latest from the Capitol** **Minnesota lawmakers grit teeth, pass state budget in crammed special session** **Legislature, with GOP and 4 DFL votes, ends MinnesotaCare for undocumented adults** **What to know about Legislature’s Monday special session to finish the budget** **Related:Health care for immigrants is a tiny part of the budget, huge talking point** Up to that point in the press conference, Walz, joined by House Speaker Lisa Demuth, R-Cold Spring, House Speaker Emerita Melissa Hortman, DFL-Brooklyn Park, and Senate Majority Leader Erin Murphy, DFL-St. Paul, had touted their success in eking out a budget compromise with only days left in the legislative session. The leaders celebrated the idea that even if national politicians were mired in party-line standoffs, Minnesota could and would get a budget passed in a bipartisan fashion – a must considering the House tie and the DFL’s one-vote majority in the state Senate. But of course, a bipartisan budget requires compromises, and each leader will have to sell those compromises to their caucuses. As the scene Thursday showed, some compromises will be harder for legislators to digest than others. As the chants continued, Walz addressed the elephant in the room – or rather, right outside of it. The audible anger of his own party members showed “we still have a lot of work to do,” Walz told the assembled journalists. At a separate press conference about an hour and a half later held by the People of Color and Indigenous Caucus and other DFL legislators, the chants turned into speeches decrying the proposed budget that they said would lead to people being kicked off of dialysis, losing cancer treatment, and eventually dying for lack of care. “Although we protected the children, which is a very noble thing to do, those children will lose moms, dads, grandfathers, aunts, uncles, siblings,” Rep. Cedrick Frazier, DFL-New Hope, said. Of the roughly 20,000 undocumented immigrants that the Department of Human Services says are on MinnesotaCare, about 17,000 are adults and 3,000 are children, the legislators said. Legislators and activists also said there was no financial incentive to kick undocumented immigrants off of MinnesotaCare, since these same individuals would now be a further burden on taxpayers by turning to costly emergency rooms in times of crisis instead of accessing affordable preventative care with insurance. Minnesota is one of about a dozen states that use state funds to provide health insurance to low-income residents regardless of immigration status, according to theKaiser Family Foundation. The other states are California, Connecticut, Illinois, Maine, Massachusetts, New Jersey, New York, Oregon, Rhode Island, Utah, Vermont, and Washington, as well as the District of Columbia. A number of other states provide insurance for children but not for adults, as shown in thismapfrom the National Immigration Law Center. However, the reality of budget constraints and changing public opinion has recently led Gov. Gavin Newsom of California toreversehis long-held position that health care should be available to all state residents, regardless of immigration status. And just this week, Republicans in Congress targeted states like Minnesota in their proposed Medicaid budget. **Related:GOP’s Medicaid overhaul would punish Minnesota for providing health care to undocumented immigrants** If the budget compromise passes as proposed, Minnesota will head in that direction. But as of now, its passage remains uncertain. The vociferous opposition to the MinnesotaCare compromise puts the future of the budget deal in peril. When asked if all of the representatives and senators on the stage would vote against the budget, Frazier said, “I think we’ve been clear at this point that it means that we’re not going to vote yes on this provision.” Losing the votes of the 20 DFL representatives and 10 senators in the POCI Caucus, as well as any allied legislators, would mean leaders would need to lean on Republicans for support to get the budget over the finish line. The compromise around undocumented immigrants was crucial to getting Republican buy-in for the budget, so to turn back now seems untenable for legislative leadership. **Related:After losing family member to cancer, advocate hopes new MinnesotaCare for immigrants saves lives** For some though, even the idea of kicking undocumented immigrants off of MinnesotaCare is antithetical to why they believe they were elected. It remains unclear what lengths this caucus and its supporters will go to to protect those they consider the most vulnerable Minnesotans, but it is clearly an emotional issue for many. Rep. Samakab Hussein, DFL-St. Paul, described a feeling of betrayal by party leaders. He said he has gotten hundreds of phone calls from undocumented constituents who were already concerned about their legal status and health care options prior to the budget’s release. “When they [released] this budget, I literally cried,” he said. Keep Minnesota news paywall-free. Start a monthly gift todayto keep our in-depth journalism free for all to access. **Related** Republish This Story Republish our articles for free, online or in print, under a Creative Commons license. **Republish this article** This work is licensed under aCreative Commons Attribution-NoDerivatives 4.0 International License. **‘I literally cried.’ Why some DFL lawmakers say they won’t support budget compromise that phases out MinnesotaCare for undocumented adults** by Shadi Bushra, MinnPostMay 15, 2025 **Your guide to the policy shaping Minnesota.** Keep up with the politics, culture and stories shaping Minnesota with MinnPost's daily newsletter. **Most Read** **Walz sales tax proposal hits consumers, while sparing business-to-business transactions** **Three things to know about St. Paul’s latest development spat, and why neighborhood organizers are right this time** **It’s still unclear if trash will be picked up in St. Paul starting April 1** **Trump’s critical minerals order may boost efforts to mine copper, nickel and cobalt in Minnesota** **Crowded field emerges to replace former state Sen. Justin Eichorn** **MinnPost is your source for local news.** Help keep our independent journalism paywall-free with a donation today! Put your knowledge to the test with MinnPost’s weekly news quiz. **Thanks to our major sponsors** is a 501(c)(3) nonprofit newsroom About Us Newsletters Careers Advertise Membership Help Contact Submit a Tip Code of Ethics Terms of Use Privacy Policy Twitter Facebook Instagram RSS Feed P.O. Box 18438 | Minneapolis, MN 55418 |612.455.6950 **Sign in** Enter the code sent to your email. Email address Enter your password Sign in by entering the code we sent to, or clicking the magic link in the email. Privacy Policy. This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. **Sign up for newsletters** Get the best of MinnPost directly in your email inbox. Sending to:"}