{"id": 1885, "name": "AsiaNews.it", "domain": "asianews.it", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.asianews.it/notizie-it/Lavoro-minorile:-Asia-Pacifico-guida-calo-globale,-ma-gli-obiettivi-Onu-restano-lontani-63276.html", "title": "Lavoro Minorile: Asia Pacifico Guida Calo Globale, Ma Gli Obiettivi Onu Restano Lontani 63276.html", "content": "Sostieni AsiaNewsChi siamoP.I.M.E.ScriviciRSSNewsletter **Lavoro minorile: Asia-Pacifico guida calo globale, ma gli obiettivi Onu restano lontani** Nuovi dati di Organizzazione internazionale del lavoro e Unicef rivelano una diminuzione di 22 milioni di bambini lavoratori in quattro anni. Tuttavia 138 milioni di minori restano intrappolati in questa piaga, in particolare nell'agricoltura e nell'economia informale. L'esperto Insaf Nizam sottolinea ad AsiaNews il ruolo della crescita economica ma avverte sui pericoli delle disuguaglianze e delle responsabilità familiari. Ginevra (AsiaNews) – Sono ancora 138 milioni i bambini coinvolti nel lavoro minorile a livello mondiale. Un dato drammatico, lontano dagli obiettivi di sviluppo sostenibile delle Nazioni unite, ma che segnala anche uno sviluppo positivo: in quattro anni la cifra è diminuita di 22 milioni, invertendo un preoccupante aumento che si era registrato tra il 2016 e il 2020, quando nel lavoro minorile erano coinvolti 160 milioni di bambini. E l’Asia-Pacifico è la regione che ha ottenuto la riduzione più significativa, con il tasso sceso dal 5,6% al 3,1% (da 49 milioni a 28 milioni di bambini). A dirlo è un nuovo rapporto congiunto dell’Organizzazione Internazionale del Lavoro (ILO) e di UNICEF, intitolato“Child Labour: Global estimates 2024, trends and the road forward”e pubblicato oggi in occasione della Giornata mondiale contro il lavoro minorile che si celebra il 12 giugno. Le organizzazioni Onu sottolineano che si possa parlare di un progresso significativo: nonostante la popolazione infantile sia aumentata di 230 milioni dal 2000, si contano circa 108 milioni di bambini lavoratori in meno, pari a una riduzione del 44% a livello globale. “I risultati del nostro rapporto offrono speranza e dimostrano che il progresso è possibile. I bambini devono stare a scuola, non al lavoro”, ha dichiarato Gilbert F. Houngbo, direttore dell’ILO”. Il lavoro minorile aumenta infatti la probabilità di restare esclusi dal ciclo scolastico: per i bambini tra i 5 e i 14 anni coinvolti nel lavoro minorile, il 59% non frequenta la scuola. Tra coloro che non sono coinvolti nel lavoro minorile, invece, il dato si ferma all’8%. Insaf Nizam, esperto dell’ILO per l’Asia del Sud, ha spiegato adAsiaNewsche “ci sono una serie di fattori che influenzano il lavoro minorile in qualsiasi Paese o regione, tra cui la povertà, l’assenza di un’istruzione aperta a tutti, la mancanza di opportunità di lavoro dignitoso per gli adulti”. Nel caso dell’Asia-Pacifico, anche se i programmi mirati e le misure politiche per ridurre il lavoro minorile hanno aiutato molto, è stata soprattutto la crescita economica a permettere i progressi registrati dal rapporto: “La tendenza è stata più pronunciata in Asia e nel Pacifico, con un calo di oltre l'80% dei tassi di povertà dal 2008 al 2024”, ha sottolineato Nizam. L’Africa sub-sahariana, tuttavia, continua a sopportare il carico maggiore di lavoro minorile, ospitando quasi i due terzi di tutti i bambini che lavorano, una cifra di circa 87 milioni. Il rapporto mette inoltre in luce che l’agricoltura rimane il settore predominante per il lavoro minorile, rappresentando il 61% di tutti i casi, seguita dai servizi (27%), come il lavoro domestico e la vendita di beni nei mercati, e dall'industria (13%), in cui è inclusa l’estrazione mineraria e la manifattura. Queste percentuali valgono anche per l’Asia-Pacifico: “Affrontare il lavoro minorile nell’agricoltura presenta le sue particolari sfide, perché è un settore rurale, difficile da monitorare, a base familiare e spesso informale”, ha spiegato ancora Insaf Nizam. Tuttavia, per contrastare il fenomeno si è dimostrato vincente l’attenzione alla filiera agricola: “Molti prodotti sono collegati a catene di approvvigionamento globali che sono sempre più consapevoli delle violazioni dei diritti umani, come il lavoro minore, per cui i requisiti legali e le preoccupazioni sulla propria reputazione hanno fatto in modo di restringere il problema, in maniera efficace perché, come detto, è un settore ancora in gran parte informale e difficile da raggiungere dalle autorità di polizia”. Il rapporto anche una disparità di genere: i ragazzi hanno maggiori probabilità delle ragazze di essere coinvolti nel lavoro minorile a ogni età. Tuttavia, quando si includono i lavori domestici non retribuiti di 21 o più ore a settimana, il divario di genere si inverte, con una quota leggermente maggiore di ragazze rispetto ai ragazzi. “Per l’Asia-Pacifico posso indicare due fattori chiave che contribuiscono a ciò”, commenta l’esperto dell’ILO. “In primo luogo, le norme di genere nella regione sono ancora molto conservatrici e impongono un carico sproporzionato sulle ragazze e sulle donne per quanto riguarda le responsabilità domestiche. Esiste un’aspettativa sociale secondo cui è ‘dovere delle ragazze impegnarsi nelle faccende domestiche’. In secondo luogo, la definizione sociale di ‘lavoro’ riguarda le attività svolte fuori casa o che generano valore economico, quindi in molti casi, mentre le ragazze lavorano per lunghe ore svolgendo faccende domestiche, ciò non viene riconosciuto dalla società, rimanendo un fenomeno nascosto dietro le porte di casa”. Anche se dal 2000 il lavoro minorile si è quasi dimezzato, il ritmo attuale è ancora troppo lento per raggiungere l’eliminazione completa come auspicato dagli obiettivi di sviluppo sostenibile: per porre fine al lavoro minorile nei prossimi cinque anni, il tasso di progresso dovrebbe essere 11 volte più veloce. “Un alto livello di informalità, in particolare nei settori rurali e agricoli, una crescita disomogenea o che non ha raggiunto tutti i segmenti della popolazione, l’enorme carico di assistenza che ancora grava sulle spalle di donne e bambini continuano a rimanere le principali sfide nella lotta contro il lavoro minorile”, ha evidenziato Nizam. “L’informalità è una grande sfida in quanto non solo aumenta la vulnerabilità dei bambini a essere coinvolti nel lavoro minorile, ma nasconde proprio il lavoro minorile dalla vista. Le ispezioni sono molto più complicate quando si tratta dell’economia informale. Riduce anche le possibilità per le famiglie di accedere alla protezione sociale, aumentandone ulteriormente la vulnerabilità”. E anche il progressivo invecchiamento della popolazione asiatica potrebbe rallentare ulteriormente i progressi ottenuti finora: “Significa che c’è un carico di assistenza sempre crescente sulle famiglie, che sarà condiviso in modo sproporzionato da bambini e donne. Sono necessarie misure politiche lungimiranti per affrontare questi problemi e garantire che il lavoro minorile non diventi la strategia di coping per le famiglie nell’affrontare questi oneri crescenti”. Asia lavoro minorile ILO Unicef **invia ad un amico** **A chi vuoi inviare questo articolo?** **Inserisci i tuoi dati:** **Inserisci il codice di verifica:** **Hong Kong vieta un gioco online di combattimento 'contro i comunisti'** **Hong Kong vieta un gioco online di combattimento 'contro i comunisti'** Iscriviti alle newsletter di Asia News o modifica le tue preferenze Home Sostieni AsiaNews Chi siamo P.I.M.E. Scrivici RSS Newsletter"}