{"id": 1019, "name": "Nonprofit Quarterly", "domain": "nonprofitquarterly.org", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://nonprofitquarterly.org/trumps-authoritarian-spectacle-corruption-in-us-governance-and-what-nonprofits-can-do-about-it/", "title": "Trumps Authoritarian Spectacle Corruption In Us Governance And What Nonprofits Can Do About It", "content": "Membership Donate Social JusticeRacial JusticeClimate JusticeDisability JusticeEconomic JusticeHealth JusticeImmigrationLGBTQ+ Racial Justice Climate Justice Disability Justice Economic Justice Health Justice Immigration LGBTQ+ Racial Justice Climate Justice Disability Justice Economic Justice Health Justice Immigration LGBTQ+ Civic News Nonprofit LeadershipBoard GovernanceEquity-Centered ManagementFinancesFundraisingHuman ResourcesOrganizational CulturePhilanthropyPower DynamicsStrategic PlanningTechnology Board Governance Equity-Centered Management Finances Fundraising Human Resources Organizational Culture Philanthropy Power Dynamics Strategic Planning Technology Board Governance Equity-Centered Management Finances Fundraising Human Resources Organizational Culture Philanthropy Power Dynamics Strategic Planning Technology CONTENT TYPES Leading Edge Membership Newsletters Webinars **Trump’s Authoritarian Spectacle: Corruption in US Governance and What Nonprofits Can Do About It** In February 2025, Citizens for Responsibility and Ethics in Washington (CREW)released a reportinvestigating what it called the “unprecedented corruption” of the Donald Trump administration. As Rebecca Jacobs, a research associate at CREW, wrote, “The most corrupt president of all time is back in office with a slew of new conflicts of interest.” Corruption, of course, is not new to US politics. From Watergate to the Iran-Contra affair, American history is riddled with examples of public officials exploiting their positions. As Kristen Drybread, coeditor ofCorruption and Illiberal Politics in the Trump Era, explained toNPQ, the history ofaccumulation of wealthby career politicians—many of whom have become millionaires while in office—suggests that such abuses long predate Trump. But what is new is the brazenness. Rather than being concealed, corruption under Trump isovert,performative, and, in many cases,legally sanctionedby far-right courts. Unsurprisingly, this is all part of a larger strategy, alongside Trump’sauthoritarian spectacle, to reshape the legal and political landscape. The more gifts (like the$400 million planeQatar donated to act as Air Force One) or lavish expenses (such as Trump’s$148 million meme coin dinner), the more democratic norms erode and allow Trump andother oligarchsto profit from their public positions. This leaves grassroots organizations and nonprofits as a critical bastion of resistance for civil society—and offers the opportunity to develop new strategies and systems of care that center the many rather than the few. **What Is “Corruption” Exactly?** While the term “corruption” is often invoked to describe the erosion of democratic norms, its legal definition remainsstrikingly narrow. “Corruption does not necessarily align with what is illegal,” Danielle Brian, the executive director and president of the nonprofit Project On Government Oversight (POGO) toldNPQ. “That doesn’t mean it’s not corruption. It just means our systems are not meeting the moment.” “There are many things that we have in our culture before Trump was reelected that were corrupt but legal,” she noted, pointing tocampaign finance loopholes, lawmakers’ ability totrade stocks, and the exemption of the president and vice president fromcertain ethics rulesas examples of practices that may be lawful but are deeply unethical. “That doesn’t mean it’s not corruption. It just means our systems are not meeting the moment,” she explained. “Corruption is the abuse of political power for private gain. It doesn’t necessarily mean financial gain. Sometimes what we’re seeing happen is someone using their political power to just advance their power.” **Trump’s Overt Corruption** Historically, officials sought to obscure corrupt acts to avoid public outrage or legal consequences. Trump, by contrast,seems to embracethe inadequacy of the law as part of his political brand. Since taking office, Trump’s actions—particularly those made for his own personal gain—are thinly veiled, at best. If corruption in his first term was a whisper, this time it’s a bombastic shout. “Trump’s been able to get away with visible corruption because he doesn’t try to hide it….Instead, he recasts his self-dealing, dishonesty, and abuse as proof that he’s powerful, successful, and not a chump,” Drybread said. This performance of power is not incidental butstrategic. Visible corruption functions as a transitional mechanism—eroding democratic norms, normalizing impunity, and paving the way forauthoritarian control. “In an era where politics has become increasingly mediatized, Trump’s spectacles…constitute a performative governance style rooted in authoritarian populism,” Peter Bloom, professor of Management at the University of Essex, toldNPQ. For the nonprofit sector, this shiftposes an existential threatsince many organizations rely on the rule of law, transparency, and public accountability to carry out their missions. But now, these democratic foundations arebeing actively dismantled. Indeed, the Trump administration has increasingly used corrupt—and likely unlawful—means to undermine nonprofits:slashing federal funding, attempting toconsolidate controlover independent organizations, andthreatening the tax-exempt statusof groups that challenge its policies. As Chioma Chukwu, interim executive director of nonpartisan watchdog organization American Oversight, explained toNPQ, “When rule-breaking becomes commonplace and consequences disappear, the public’s sense of outrage dulls. This desensitization makes it easier for antidemocratic behavior to take root and spread, normalizing abuses that would have once triggered alarm.” **When Corruption Becomes Law** Legal redefinitions of corruption have not only failed to constrain Trump’s executive overreach—they’ve helped legitimize it. InMcDonnell v. United States(2016), the US Supreme Court significantly narrowed the federal definition of corruption, limiting it toexplicit quid pro quoarrangements involving specific “official acts.” As a result,gifts, privileged access, and blatant favoritism often escape legal scrutiny. “When rule-breaking becomes commonplace and consequences disappear, the public’s sense of outrage dulls.” And the narrowing of corruption laws has emboldened political actors to blur ethical lines under the guise of legality, enabling Trump to defy ethical norms openly. As Chukwu noted, “Corruption—especially when committed openly—operates as a show of dominance. It signals to the public that those in power are above the law, while simultaneously discouraging dissent by undermining faith in accountability. Authoritarian regimes often use this visibility strategically: not to hide misconduct but to flaunt it.” While this flaunting of misconduct was evident from the start of his first administration, as Brian noted, taking office and “publicly exploiting our weak corruption laws as they apply to the presidency” in Trump’s second term has only intensified. **What Nonprofits Must Do Now** As visible corruption becomes agoverning strategy, nonprofits must adapt. The illusion that “business as usual” still applieshas evaporatedin today’s political environment, one in which accountability isdeliberately undermined, oversight is hollowed out, andspectacle replaces substance. The nonprofit sector must not only defend democratic norms buttake up the mantleof actively rebuilding them. As Chukwu said, “This is a moment that demands vigilance, strategic litigation, and storytelling.” Drawing on interviews with watchdog leaders, scholars, and accountability experts, here are six key strategies nonprofit leaders must consider in responding to this authoritarian moment: Document Relentlessly—Even Without Immediate Recourse. A clear, factual record is the foundation of future accountability. Even when courts falter or watchdog agencies are defunded,documentation preserves the truthand lays the groundwork for legal, journalistic, or public reckoning. Subscribe toNPQ'snewsletters to have our top stories delivered directly to your inbox. By signing up, you agree to our privacy policy and terms of use, and to receive messages from NPQ and our partners. “Watchdog groups must pay closer attention to systematic efforts to deny public access to government records—a foundational step in the authoritarian playbook,” Chukwu toldNPQ.“By framing access to truth not as a bureaucratic procedure but as a fundamental democratic right, we can help citizens understand what’s at stake and mobilize more effective resistance before these patterns become normalized and irreversible.” Even as the Trump administrationguttedthe staffing and infrastructure of key federal agencies,obstructed records requests, and attempted to shield entire offices—such as DOGE—from Freedom of Information Act (FOIA) oversight, nonprofits must continue tracking government misconduct, regulatory rollbacks, and FOIA obstructions. “The key lesson: documentation is power,” Chukwu said. Reframe Corruption as a Democratic Emergency. As we well know, corruption today isovert, performative, and systemic. Yet it’s too often framed as a technical or ethical issue rather than a democratic crisis. “Effective campaigns must translate systemic misconduct into clear, moral terms that mobilize people, linking abuses of power to harms that communities understand, like public health, economic justice, and civil rights,” Chukwu toldNPQ. Nonprofits can help reframe corruption by connecting institutional erosion to tangible harms such asunsafe housing,polluted water,voter suppression, anddefunded schools. “Watchdog groups must track and expose efforts to suppress dissent, subvert oversight, and politicize the justice system….Simultaneously, we must amplify the stories of those who have been harmed, connecting legal analysis to their lived experiences,” Chukwu explained. “Democracy doesn’t erode in the abstract; it erodes in courtrooms, cabinet meetings, and executive memos. Our job is to bring that into the light and keep government officials from shrouding their work in secrecy or illegally covering their tracks.” By grounding abstract principles in everyday consequences, nonprofits can mobilize public concern and reengage communities. “Democracy doesn’t erode in the abstract; it erodes in courtrooms, cabinet meetings, and executive memos.” Build Narrative Power to Counter Spectacle. Trump’s dominance stems not just from policy but fromnarrative control. Spectacle is part of the strategy—and the nonprofit sector mustreclaim the power of storytelling. “Narratives that humanize the consequences of corruption and show how legal manipulation affects everyday life can reenergize civic engagement and resistance,” Chukwu said. “We need to tell better stories,” added Drybread and pointed to The OpEd Project, a nonprofit that works to amplify the voices of those often excluded from public discourse, including nonprofit leaders and underrepresented thinkers. Rooted in the belief that “the story we tell becomes the world we live in,” the organization trains individuals to step into thought leadership roles and helps shift who gets heard in public conversations. “I think nonprofits need to make themselves publicly visible as the heroic figures they often are. The public is so often unaware of the amazing and important work nonprofits do because such work rarely brings fame or riches,” Drybread continued. “They can write op-eds, publicize their work on Tik Tok, find ways to reach people and tell their stories.” Build Cross-Sector Solidarity and Collective Infrastructure. In this political climate, no organization can stand alone. Leadersemphasizethe growing need for collective legal support, cybersecurity, communications strategies, and rapid response infrastructure. “One thing I think is really great is that our community is proactively coming together. There are a variety of spaces where those of us leading organizations are connecting across the sector, recognizing that when one member of our community is being threatened—[when] our First Amendment rights to do this work [are at risk]—it impacts all of us,” Brian toldNPQ. Brian notes that early fragmentation amonguniversitiesandlaw firmsleft the sector vulnerable. But as collaboration increased, so did their resilience. What has been especially helpful is sharing resources, legal strategies, and advice on how to set ourselves up for success. Prepare for 24-Hour Communications Cycles. In amedia landscapedriven by speed and spectacle, real-time response is essential. Nonprofits must train staff in crisis communications, form rapid response teams, and build relationships with journalists before the next headline breaks. “We’re also very focused on the rumors of executive orders targeting our sector—and it’s very realistic given the executive orders that we’ve already seen. We’re very much on a rapid response,” Brian explained. “We’ve actually brought on a PR firm to help us with rapid response communications because we think it’s really important to get ahead of the narrative and what is happening every day.” She added, “The velocity of the news cycle is breathtaking, and it’s more than any single organization that works on corruption can handle with the staff that we have. I think that that’s an important thing to recognize: In the end, especially when we look at how other countries have survived authoritarian threats, it is the voice of civil society.” Advance a Vision Beyond Resistance. Finally, experts note that corruption today is not only about personal gain—it reflects the emergence of what Bloom calls the “authoritarian-financial complex”: a fusion of state power and private capital that thrives on crisis, insecurity, and privatization. “The logic of this system is recursive: It produces crises that it then claims to solve through mechanisms of surveillance, austerity, and top-down intervention,” Bloom toldNPQ. “Political imagination is trapped within the closed loop of technocratic solutions and strongman fantasies,” he continued, “where progress is synonymous with executive decisiveness, where public safety is conflated with control, and where prosperity is imaginable only through market compliance.” Nonprofits must counter this not only by resisting repression but by modeling different systems of care, ownership, and governance, he explained. That includes (but is not limited to): Commons-based resource stewardshipParticipatory budgetingandlocal democracyCollective ownership ofhousing,food, andenergyMutual aid,cooperative economies, andnarrative repairDefinitions of wealth based oninterdependence,not accumulation Commons-based resource stewardship Participatory budgetingandlocal democracy Collective ownership ofhousing,food, andenergy Mutual aid,cooperative economies, andnarrative repair Definitions of wealth based oninterdependence,not accumulation Commons-based resource stewardship Participatory budgetingandlocal democracy Collective ownership ofhousing,food, andenergy Mutual aid,cooperative economies, andnarrative repair Definitions of wealth based oninterdependence,not accumulation “The real danger here is not just repression—it is the foreclosure of alternatives,” Bloom toldNPQ. The nonprofit sector must becomemore than a service provider; it must become asite of democratic imagination—an engine fornew forms of public lifeandcollective power. “If there is one question that should be asked more urgently,” Bloom posited, “it is this: What would it look like to build a world where freedom does not require force, where prosperity does not require profit, and where leadership does not require submission?” Zane McNeill is the editor ofVegan Entanglements: Dismantling Racial and Carceral Capitalism(Lantern Publishing & Media, 2022) andBuilding Multispecies Resistance Against Exploitation: Stories from the Frontlines of Labor and Animal Rights(Peter Lang Publishing, 2024). Journalism, nonprofits, and multiracial democracy are under attack. At NPQ, we fight back by sharing stories and essential insights from nonprofit leaders and workers—and we pay every contributor. Your support keeps truth alive when it matters most.Every single dollar makes a difference. **Upcoming Webinars** From Performance Management to Mutual Commitment Fostering a Culture of Joyful Accountability Organizing in Divided Times The Relational Infrastructure We Need to Protect Democracy Subscribe to theNPQnewsletter to have our top stories delivered directly to your inbox. By signing up, you agree to our privacy policy and terms of use, and to receive messages from NPQ and our partners. About Advertise Careers Contact Copyright Donate Editorial Policy Funders Submissions We are using cookies to give you the best experience on our website. Privacy Overview Strictly Necessary Cookies This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again."}