{"id": 53, "name": "American Institute of of Physics", "domain": "aip.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://www.aip.org/statistics/impacts-of-restrictions-on-federal-grant-funding-in-physics-and-astronomy-graduate-programs", "title": "Impacts Of Restrictions On Federal Grant Funding In Physics And Astronomy Graduate Programs", "content": "Events Newsletters Giving **Sections** Physics Today Society of Physics Students AIP Foundation AIP Publishing Federation News & AnalysisAllScienceStatisticsPolicyFYI HomeArticlesBudget TrackerBill TrackerAgenciesAbout FYI All Science Statistics PolicyFYI HomeArticlesBudget TrackerBill TrackerAgenciesAbout FYI FYI Home Articles Budget Tracker Bill Tracker Agencies About FYI All Science Statistics PolicyFYI HomeArticlesBudget TrackerBill TrackerAgenciesAbout FYI FYI Home Articles Budget Tracker Bill Tracker Agencies About FYI FYI Home Articles Budget Tracker Bill Tracker Agencies About FYI Researchers Students Careers STEM Excellence AboutAboutHistory of AIPLeadershipAwards and PrizesAIP NewsPolicies and Reports About History of AIP Leadership Awards and Prizes AIP News Policies and Reports About History of AIP Leadership Awards and Prizes AIP News Policies and Reports Physics Today Society of Physics Students AIP Foundation AIP Publishing Federation News & AnalysisAllScienceStatisticsPolicyFYI HomeArticlesBudget TrackerBill TrackerAgenciesAbout FYI All Science Statistics PolicyFYI HomeArticlesBudget TrackerBill TrackerAgenciesAbout FYI FYI Home Articles Budget Tracker Bill Tracker Agencies About FYI All Science Statistics PolicyFYI HomeArticlesBudget TrackerBill TrackerAgenciesAbout FYI FYI Home Articles Budget Tracker Bill Tracker Agencies About FYI FYI Home Articles Budget Tracker Bill Tracker Agencies About FYI Researchers Students Careers STEM Excellence AboutAboutHistory of AIPLeadershipAwards and PrizesAIP NewsPolicies and Reports About History of AIP Leadership Awards and Prizes AIP News Policies and Reports About History of AIP Leadership Awards and Prizes AIP News Policies and Reports Physics Today Society of Physics Students AIP Foundation AIP Publishing All Science Policy Statistics Share Facebook Email Download **Impacts of Restrictions on Federal Grant Funding in Physics and Astronomy Graduate Programs** Stories about academic programs reducing the number of graduate students they will enroll due to changes in approaches to federal funding have recently made headlines. Colleges Restrict Graduate Student Admissions After NIH Proposes Rate Cut Disheartened by funding cuts, international students look beyond the US Iowa State University rescinds some admission offers for graduate students Given the significance of this issue, AIP’s research team engaged in a systematic survey to better understand the extent of recent changes in federal funding and policy. We asked all 292 department chairs at departments offering graduate degrees in physics and astronomy in the US a few questions to better understand the impacts. Our questionnaire was in the field from April 3 to April 16. We received responses from 115 departments, 76 in public institutions and 39 in private institutions, to our brief survey; this is a 39% response rate. Here is what we learned. **Impact on the Number of First-Year Graduate Students** Overall, 37% of the responding department chairs said they expect to enrollfewerfirst-year graduate students in the fall of 2025 than they did the previous year, while 55% expect to enroll about the same number. More than half of the responding chairs at private institutions (55%) expect to enrollfewerstudents, and 39% expect to enroll the same number of first-year graduate students. For departments at public universities, 28% expect to enrollfewerfirst-year students, with 63% expecting the same number. The number of first-year graduate students in physics and astronomy is anticipated to decline by about 13%. This is a projected decline of about 600 first-year graduate students. The number of first-year graduate students in private institutions is anticipated to decline by about 25%. The number of first-year graduate students in public institutions is anticipated to decline by about 7%. Many department chairs cautioned that the full picture had yet to emerge. They believe the decline in first-year students will be even larger in the Fall 2026 semester. The graph below shows the distribution of first-year graduate students across all departments. There is a distinct downward shift for the 2025 fall semester when compared to 2024. The box plot above plots the 25th, 50th, and 75thpercentiles with the bars on either end extending to the minimum and maximum.The data for Fall of 2025 are projections for the responding departments, and the data for Fall of 2024 are actual numbers for those same departments. The box plot above plots the 25th, 50th, and 75thpercentiles with the bars on either end extending to the minimum and maximum.The data for Fall of 2025 are projections for the responding departments, and the data for Fall of 2024 are actual numbers for those same departments. The box plot above plots the 25th, 50th, and 75thpercentiles with the bars on either end extending to the minimum and maximum.The data for Fall of 2025 are projections for the responding departments, and the data for Fall of 2024 are actual numbers for those same departments. The box plot above plots the 25th, 50th, and 75thpercentiles with the bars on either end extending to the minimum and maximum.The data for Fall of 2025 are projections for the responding departments, and the data for Fall of 2024 are actual numbers for those same departments. **Prevalence of Funding Cuts** Respondents from 18% of the departments reported at least one faculty member whose federal funding had been terminated or reduced. An additional 28% of departments expect such news within the next six months. That is almost half (46%) of the responding departments experiencing or anticipating cuts in federal funding. The outlook is more dire at private institutions than public institutions, with 34% having experienced cuts and another 29% anticipating cuts. For public institutions, the numbers are 9% with cuts and 28% anticipating cuts. We did not attempt to measure the magnitude of the cuts; we focused only on the prevalence across physics and astronomy departments. Proportion of Departments Experiencing or Anticipating Faculty with Cuts in Federal Funding Proportion of Departments Experiencing or Anticipating Faculty with Cuts in Federal Funding Proportion of Departments Experiencing or Anticipating Faculty with Cuts in Federal Funding Proportion of Departments Experiencing or Anticipating Faculty with Cuts in Federal Funding **Rescission of Graduate School Acceptance** As previously noted, department chairs told us it was too early to understand fully the impact on first-year graduate students for the Fall 2025 semester. Stories on individual programs and university departments indicated they were rescinding offers of acceptance to their graduate programs. Our survey data suggest that, so far, this has not happened in many cases. Only three department chairs told us they had already rescinded at least one offer. Some shared that they have changed the default language for their offers to students to no longer commit to providing funding during their program of study. Others told us their funding offers were limited to the first year of study only. Several department chairs told us their administration did not allow them to make follow-up offers when an offer was declined. **The Department Chairs Speak** We also gave all respondents the opportunity to provide any additional write-in comments. Department chairs shared concerns about demoralization of students and faculty, negative effects of hiring freezes brought about by funding uncertainty, and anxiety for students and faculty resulting in decreased well-being and productivity. Some also expressed considerable fear of the effects of changes in immigration and visa policy creating a brain drain as students and faculty look for opportunities in other countries. Below we provide direct quotes of comments from the department chairs in each of these areas. **Demoralizing Scientists at All Career Levels** Several department chairs noted that they see students and faculty being demoralized by these policy changes. **Decreased Capacity for Scientific Research and Teaching** Several department chairs noted that uncertainty related to funding has prompted institutions to implement hiring freezes for faculty and staff positions and that this could have major impacts on the capability of their programs to support the scientific enterprise. **Anxiety and Uncertainty Resulting in Decreased Wellbeing and Productivity** Several department chairs commented that uncertainty around funding is already having significant negative effects on the productivity of their faculty and students in engaging in scientific research. **** **Immigration and Visa Policy’s Effects on the Scientific Enterprise** Several department chairs shared concerns about how the administration’s immigration and visa policies are affecting students and faculty. They note that they are concerned this may also result in a brain drain of scientific talent from the United States to other countries. **Links to Articles Referenced** Colleges Restrict Graduate Student Admissions After NIH Proposes Rate Cut Disheartened by funding cuts, international students look beyond the US Iowa State University rescinds some admission offers for graduate students **Methodology** We sent a brief questionnaire to department chairs in the 292 departments that offer a graduate degree in physics or astronomy in the US. The first request was sent April 3, with follow-up requests on April 9 and April 15. We closed the questionnaire on April 16. We received responses from 115 department chairs. Graduate Faculty Physics Statistics Subscribe to Research Updates from AIP Receive updates on education and employment trends for physical scientists. Whenever new content is posted American Institute of Physics advances, promotes and serves the physical sciences for the benefit of humanity. As a 501(c)(3) non-profit, AIP is a federation that advances the success of our Member Societies and an institute that engages in research and analysis to empower positive change in the physical sciences. The mission of AIP (American Institute of Physics) is to advance, promote, and serve the physical sciences for the benefit of humanity. instagram facebook linkedin **Stay in touch** **Member societies** Acoustical Society of America American Association of Physicists in Medicine American Association of Physics Teachers American Astronomical Society ACA: The Structural Science Society American Meteorological Society American Physical Society Optica The Society of Rheology AVS: Science & Technology of Materials, Interfaces and Processing instagram facebook linkedin American Institute of Physics advances, promotes and serves the physical sciences for the benefit of humanity. As a 501(c)(3) non-profit, AIP is a federation that advances the success of our Member Societies and an institute that engages in research and analysis to empower positive change in the physical sciences. The mission of AIP (American Institute of Physics) is to advance, promote, and serve the physical sciences for the benefit of humanity. **Member societies** Acoustical Society of America American Association of Physicists in Medicine American Association of Physics Teachers American Astronomical Society ACA: The Structural Science Society American Meteorological Society American Physical Society Optica The Society of Rheology AVS: Science & Technology of Materials, Interfaces and Processing **Stay in touch** instagram facebook linkedin AIP Careers Policies & Procedures Privacy Policy © 2025. American Institute of Physics"}