{"id": 307, "name": "Cygnal Polling", "domain": "cygn.al", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.cygn.al/national-poll-record-number-say-nation-is-on-right-track-voters-back-trumps-one-big-beautiful-bill-for-tax-relief-and-border-security/", "title": "National Poll Record Number Say Nation Is On Right Track Voters Back Trumps One Big Beautiful Bill For Tax Relief And Border Security", "content": "Services Team Latest News Podcast In The News About **National Poll: Record Number Say Nation is on Right Track; Voters Back Trump’s ‘One Big Beautiful Bill’ for Tax Relief and Border Security** Home ServicesMulti-Mode PollingPublic AffairsVoter Scoring & ModelingEmotive AnalysisCTV/OTT Measurement & PlacementMomentum TrackingDigital ProfilingAd Creative Testing Multi-Mode Polling Public Affairs Voter Scoring & Modeling Emotive Analysis CTV/OTT Measurement & Placement Momentum Tracking Digital Profiling Ad Creative Testing Multi-Mode Polling Public Affairs Voter Scoring & Modeling Emotive Analysis CTV/OTT Measurement & Placement Momentum Tracking Digital Profiling Ad Creative Testing TeamMeet Our PollstersMeet The Full Cygnal TeamJoin Our Team Meet Our Pollsters Meet The Full Cygnal Team Join Our Team Meet Our Pollsters Meet The Full Cygnal Team Join Our Team InsightsNewsNVT ‘Live’ PanelsIn The NewsPulse Pod30 Under Thirty News NVT ‘Live’ Panels In The News Pulse Pod 30 Under Thirty News NVT ‘Live’ Panels In The News Pulse Pod 30 Under Thirty About WASHINGTON, D.C. (June 10, 2025) –Cygnal, one of the nation’s fastest growing and most accurate private polling firms, released its monthlyNational Voter Trends (NVT) poll(conducted June 3-4) of 1,500 likely general election voters. Brent Buchanan, Cygnal’s President, and Alex Tarascio, Director of Policy and Political Strategy, were the pollsters for this month’s NVT. Here are the poll’s top takeaways: Big and Beautiful:Parents (+11 net support), swing voters (+9), and those earning under $75k (+5), are the most supportive of the “One Big Beautiful Bill” proving President Trump’s policy content is a winning message with his unique and growing coalition. When the bill is explicitly tied to the President, female support shifts 12 points to the negative. While Democrats claim the bill is a handout to the wealthy, those making over $200,000 are the least supportive (-16) group by income. “Contrary to what Democrats are pushing in the media, the One Big Beautiful Bill – especially its individual components – is popular with voters mostly because of the tax cut provisions,”saidPollster and Cygnal President, Brent Buchanan.“This proves President Trump’s political senses reflect the priorities of regular Americans. Voters want to see action from Congress to match Trump’s pace and this push for the BBB reflects that – especially when we hit another record number of voters saying the country is on the right track.” Tariffs Explained:A great irony among Democrat voters is that 54 percent say they prefer a free market approach on trade without government intervention. Overall, when President Trump’s tariff rationale is explained, a plurality of voters (34%) support using tariffs to pressure companies to bring production home with an additional 26 percent supporting the goal but not the method – showing broad support for the idea of reshoring. “I never thought I’d see the day when Democrats preferred a free market approach to anything,”saidAlex Tarascio, Pollster and Director of Policy and Political Strategy.“But apparently they do when it comes to tariffs and trade if President Trump is on the other side of the issue. The partisan divide on tariffs as a tool of leverage is stark – 54 percent of Democrats say a free-market approach is better for reshoring jobs and manufacturing compared to only nine percent of Republicans who share that view. The GOP firmly supports, 63 percent, President Trump’s actions to use tariffs to pressure companies to bring back production.” Death and Taxes:When asked about specific provisions in the “BBB”, the top three most supported performers all concern taxation. Increasing the standard deduction for seniors (24%) took the top spot, followed by eliminating taxes on tips and overtime (17%) and permanently extending the Trump tax cuts (17%). Interest in the bill’s tax provisions comes alongside another record number (47%) who think the country is headed in the right direction and a growing sense of fiscal hawkishness with voters saying that reducing government waste and spending is a top priority at 12 percent. ‘A Lannister Always Pays His Debts’:But not the government – 38 percent of voters are extremely concerned about the national debt. When asked if they support reducing government spending to pay down the national debt, even if that meant reductions in services for some, 53 percent of voters support the tradeoff. Female swing voters back cuts by +10, showing an opportunity for persuasion. Medicaid:Voters see Medicaid’s purpose differently. 58% say it should be a bridge for those in need to get back on their feet if and when they’re able to work, compared to just 38% who believe Medicaid is a lifeline for those in need and should be accessible without conditions. Antisemitism:82 percent of voters say they are concerned about rising antisemitism in the United States. When asked which groups are treated fairly or unfairly, Republicans and Democrats see completely different problems. Republicans say Jewish (57%), White (40%), and Native American (38%) peoples were treated most unfairly whereas Democrats say Black (73%), Palestinian (70%), and Native American (70%) peoples. Older voters are 10 points more likely than those under 55 to say Jewish people face unfair treatment. Let’s Land This Bird:Only a quarter of voters think they could land a passenger plane in an emergency. Genders differ significantly with 36 percent of men saying they could land the plane compared to just 16 percent of women. Among partisans, Republicans were most confident (30%) compared to just 20 percent of Democrats. Independents were right in the middle (25%). Share **Contact Us** Home Services Team Insights About Contact"}