{"id": 1279, "name": "Space.com", "domain": "space.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.space.com/space-exploration/search-for-life/scientists-question-possible-signs-of-life-on-exoplanet-k2-18b-in-new-study-we-never-saw-more-than-insignificant-hints", "title": "Scientists Question Possible Signs Of Life On Exoplanet K2 18b In New Study We Never Saw More Than Insignificant Hints", "content": "View Profile Sign out Sign up to our newsletterNewsletter Space Exploration Astronomy Stargazing Launches & Spacecraft Videos The Moon MoreSubscribe to Our NewslettersLike 4K Video from SpaceArtemisJames Webb Space TelescopeEntertainmentSolar SystemForumsTechnologySearch for LifeGet Space MagazinesAbout UsWeb Notifications Subscribe to Our Newsletters Like 4K Video from Space Artemis James Webb Space Telescope Entertainment Solar System Forums Technology Search for Life Get Space Magazines About Us Web Notifications Subscribe to Our Newsletters Like 4K Video from Space Artemis James Webb Space Telescope Entertainment Solar System Forums Technology Search for Life Get Space Magazines About Us Web Notifications Strawberry Moon This Week! Night sky tonight! Live 4K Sen video from space! Aurora Forecast Next Full Moon Space Calendar Best Binoculars Best Telescopes Lego Star Wars deals Best Drones Solar System Planets Best Star Projectors **Recommended reading** Space Exploration Search for Life **Scientists question possible signs of life on exoplanet K2-18b in new study: 'We never saw more than insignificant hints'** \"Until we can separate these signals more clearly, we have to be especially careful not to misinterpret them as signs of life.\" When you purchase through links on our site, we may earn an affiliate commission.Here’s how it works. In 2023, scientists from Cambridge University reported what appeared to be very exciting news. NASA's James Webb Space Telescope, they said, had detected signs of a liquid water ocean — and possibly life — on the exoplanet K2-18b, a temperate sub-Neptune world located about 124 light-years away from Earth. Then, earlier this year, the same team announced what they called even stronger evidence for those potential signs of alien life. The signs were rooted in a tentative detection of dimethyl sulfide (DMS) — a molecule produced onEarthsolely by marine life — and/or its close chemical relative DMDS, which is also a potential biosignature, in the atmosphere of the exoplanet. This finding, along with the possibility that K2-18b is a \"Hycean world\" with a liquid water ocean, sparked significant interest about its potential to support life. However, these results have sparked intense debate among astronomers. While recognizing this finding would be a groundbreaking achievement and a major testament to theJames Webb Space Telescope's (JWST) capabilities if true, many scientists remain skeptical, questioning both the reliability of the detected DMS signature as well as whether DMS itself is a dependable sign of life in the first place. As such, manyindependent teamshave been conducting follow-up studies about the original claims — and a newly published one only adds to the debate, suggesting the Cambridge scientists' DMS detection wasn't significant enough to warrant the publicity it received. Possible signs of alien life found on nearby exoplanet, study reports James Webb Space Telescope could find signs of life on alien 'hycean' ocean worlds How rare are inhabited worlds in the universe? The 'LIFE' space telescope fleet could find out \"Among the physical sciences, astronomy enjoys a privileged position,\" Rafael Luque, a post doctoral researcher at the University of Chicago, told Space.com. \"It is more frequently covered in the media thanks to its visual appeal and the big philosophical and universal questions it addresses. It was therefore expected that — even if tentative — the detection of a potential biomarker in the atmosphere of an exoplanet would have extensive coverage.\" **The significance of significance** Luque and his colleagues, including fellow postdoctoral researchers Caroline Piaulet-Ghorayeb and Michael Zhang, remain unconvinced that what astronomers observed on K2-18b was in fact a credible signature indicating life. In a recent arxivpreprint— which is yet to be peer-reviewed — their team re-examined the validity of the original evidence. \"This is how science works: evidence and counterevidence go hand in hand,” he stated. When scientists study data from different instruments separately, they might end up with conflicting results — it's like finding two different \"stories\" about a subject that don't match. \"This is, in fact, what happened in the original team's papers,\" Zhang told Space.com. \"They inferred a much higher temperature from their MIRI (mid-infrared) data than from their NIRISS and NIRSpec (near-infrared) data. Fitting all the data with the same model ensures that we're not telling contradictory stories about the same planet.\" Thus, the team conducted a joint analysis of K2-18b using data from all three of the JWST's key instruments — the Near Infrared Imager and Slitless Spectrograph (NIRISS) and the Near Infrared Spectrograph (NIRSpec), which capture near-infrared light, and the Mid-Infrared Instrument (MIRI), which detects longer mid-infraredwavelengths. The goal was to ensure a consistent, planet-wide interpretation of K2-18b's spectrum that the team felt the original studies both lacked. **Get the Space.com Newsletter** Breaking space news, the latest updates on rocket launches, skywatching events and more! \"We reanalyzed the same JWST data used in the study published earlier this year, but in combination with other JWST observations of the same planet published […] two years ago,\" Piaulet-Ghorayeb told Space.com. \"We found that the stronger signal claimed in the 2025 observations is much weaker when all the data are combined.\" These signals may appear weaker when all data is combined because the initial \"strong\" detection may have been overestimated, the team says, due to being based on a limited initial data set. Combining data from multiple sources lets scientists cross-check and verify the strength — and validity — of a particular signal. \"Different data reduction methods and retrieval codes always give slightly different results, so it is important to try multiple methods to see how robust the results are,\" explained Piaulet-Ghorayeb. \"We never saw more than insignificant hints of either DMS or DMDS, and even these hints were not present in all data reductions.\" \"Importantly, we showed that when testing a wider range of molecules that we expect to be produced abiotically in the atmosphere, the same observed spectral features can be reproduced without the need for DMS or DMDS,\" she continued. **More than one path to a result** Molecules in an exoplanet's atmosphere are typically detected through spectral analysis, which identifies unique \"chemical fingerprints\" based on how the planet's atmosphere absorbs specific wavelengths of starlight as it passes — or transits — in front of its host star. This absorption leaves distinct patterns in the light spectrum that reveal the presence of different molecules. \"Each molecule’s signature is unique, but different molecules can have some features that fall in similar places because of their close molecular structures,\" explained Piaulet-Ghorayeb. The difference between DMS and ethane — a common molecule in exoplanet atmospheres — is just one sulfur atom, and current spectrometers, including those on the JWST, have impressive sensitivity, but still face limits. The distance to exoplanets, the faintness of signals, and the complexity of atmospheres mean distinguishing between molecules that differ by just one atom is extremely challenging. \"It is widely recognized as a huge problem for biomarker detection, though not an insurmountable one, because different molecules do have subtly different absorption features,\" said Piaulet-Ghorayeb. \"Until we can separate these signals more clearly, we have to be especially careful not to misinterpret them as signs of life.\" Beyond technical limitations, another source of skepticism is how the data has been interpreted statistically. Luque points out that the 2023 study described the detection of DMS as \"tentative,\" reflecting the preliminary nature of the finding. However, the most recent 2025 paper reported that the detection of DMS and/or DMDS reached 3-sigma significance — a level that, while below the 5-sigma threshold required for a confirmed discovery, is generally considered moderate statistical evidence. \"Surprisingly,this latest workwasused to double down on the claim for DMSand even more complex molecules to be present. The detection, however, is not statistically significant nor robust, as we show in our work. Despite these uncertainties, the team is worried that media coverage has continued to spotlight bold claims about DMS and other molecules. \"The [JWST] telescope is incredibly powerful, but the signals we're detecting are very small. As a community, we have to make sure that any claims we make about a planet’s composition are robust to the choices made when processing the data from the telescope,\" said Piaulet-Ghorayeb. —Doubts over signs of alien life on exoplanet K2-18b are rising: 'This is evidence of the scientific process at work' —Does exoplanet K2-18b host alien life or not? Here's why the debate continues —The pursuit of truths: A letter on the boy who cried aliens (op-ed) \"Researchers have the responsibility to double-check and verify, but the media is also responsible for duly reporting these follow-up works to the general public,\" added Luque. \"Even if they have less catchy titles.\" \"As Carl Sagan once said, 'extraordinary claims require extraordinary evidence,'\" said Luque. \"That threshold was not met by how the results were disseminated to the general public.\" Whetherwe'll ever get a clear answer about life on K2-18 b is uncertain — not just because of technological limits, but because the case for follow-ups with the JWST may simply not be strong enough. \"JWST is continuing to observe K2-18b, and even though the new observations won't have the ability to detect life, we will soon find out more about the planet's atmosphere and interior,\" Zhang said. Join our Space Forumsto keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at:community@space.com. A chemist turned science writer, Victoria Corless completed her Ph.D. in organic synthesis at the University of Toronto and, ever the cliché, realized lab work was not something she wanted to do for the rest of her days. After dabbling in science writing and a brief stint as a medical writer, Victoria joined Wiley’s Advanced Science Newswhere she works as an editor and writer. On the side, she freelances for various outlets, including Research2Reality and Chemistry World. **You must confirm your public display name before commenting** Please logout and then login again, you will then be prompted to enter your display name. 1We're halfway between the April 2024 and August 2026 total solar eclipses: Here's why we're excited 2Star Trek Strange New Worlds Season 3 trailer promises new worlds, new adventures, and new romances (video) 3June's Strawberry Moon rises tonight. Here's what to expect from the lowest full moon since 2006 4An Indian astronaut is about to visit the ISS for the 1st time ever 5NASA raises the odds that an asteroid could hit the moon in 2032 Space is part of Future US Inc, an international media group and leading digital publisher.Visit our corporate site. About Us Contact Future's experts Terms and conditions Privacy policy Cookies policy Accessibility Statement Advertise with us Web notifications Careers © Future US, Inc. Full 7th Floor, 130 West 42nd Street, New York, NY 10036. **Please login or signup to comment** **Please wait...**"}