{"id": 898, "name": "Meridian Star", "domain": "meridianstar.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://meridianstar.com/2025/06/04/sports-journalist-rick-cleveland-explores-the-intersection-of-sports-and-entertainment-with-malcolm-white-at-the-max/", "title": "Sports Journalist Rick Cleveland Explores The Intersection Of Sports And Entertainment With Malcolm White At The Max", "content": "Home Subscriptions Newsletter signup E-Edition News Opinion Sports Obituaries ClassifiedsJobsHomes Jobs Homes Jobs Homes ServicesAbout UsContact Us About Us Contact Us About Us Contact Us Home News Obituaries Sports Opinion E-Edition Special Sections **Sports journalist Rick Cleveland explores the Intersection of sports and entertainment with Malcolm White at The MAX** Published 4:23 pm Wednesday, June 4, 2025 ByStaff Reports In celebration of the State Games of Mississippi’s opening weekend, the public is invited to The Mississippi Arts + Entertainment Experience for a conversation between renowned sportswriter Rick Cleveland and Malcolm White, former executive director of the Mississippi Arts Commission, to discuss the often-overlooked connection between creativity, the arts and athletics. The program will highlight the outstanding careers of both well-known and lesser-known multi-disciplined Mississippians, including Jim Weatherly, Charley Pride, John Grisham, Dizzy Dean, Lem Barney, Jerry Clower, and, of course, The King himself, Elvis Presley. The event is set to take place beginning at 11 a.m. Saturday at The MAX. **Email newsletter signup** After the conversation, Cleveland and White will be available to sign copies of their books, which will be available for purchase in The MAX Store. “We look forward to welcoming thousands of athletes and their families to The MAX this weekend and throughout the summer,” said Penny Kemp, president and CEO of The MAX. “When Malcolm mentioned the opportunity to explore the intersection of arts and athletics with Rick, I couldn’t think of a better time to explore this topic than the opening weekend of the State Games of Mississippi.” Rick Cleveland is the most awarded sportswriter in Mississippi history. Cleveland began reporting and writing for the Hattiesburg American at the age of 13. In his nearly six-decade career as a newspaper reporter, editor and columnist, he also has worked for Monroe (La.) News-Star World, Jackson Daily News and Clarion Ledger—starting as a beat writer covering Mississippi State and the University of Mississippi, later becoming sports editor and columnist. Today, Cleveland is the sports columnist at Mississippi Today and his work is syndicated in newspapers across Mississippi. Prior to that Rick served as executive director of the Mississippi Sports Hall of Fame and Museum—about which, he said, “We’ve got such an incredible sports story to tell in Mississippi. Over the course of my sports writing career I covered Walter Payton, Jerry Rice and Brett Favre essentially from high school through the Super Bowl. You’re talking about the leading receiver and scorer, the second leading passer and the second leading rusher in NFL history, all from rural Mississippi. What other state can come close to that? It’s a story we need to tell, tell well and keep telling.” Cleveland has received numerous state, regional and national awards for telling those stories. In 2011, he became the first sportswriter to receive the Richard Wright Award for Literary Excellence. After retiring from the Mississippi Sports Hall of Fame, he was inducted himself in 2017, for having won Mississippi Sportswriter of the Year an unprecedented 14 times. Rick has also been inducted into the Hattiesburg Hall of Fame, the University of Southern Mississippi’s Alumni Hall of Fame and Communications Hall of Fame, and the Mississippi Press Association Hall of Fame. He also won the Press Association’s Distinguished Mississippian Award. Author of four books—“Vaught: The Man & His Legacy”; “Boo: A Life in Baseball, Well Lived”; “Mississippi’s Greatest Athletes”; and “The Mississippi Football Book” co-authored by Neil White. Cleveland’s literary influences include Mississippi Arts + Entertainment Hall of Fame writers Willie Morris, Eudora Welty and William Faulkner. Malcolm White is a cultural ambassador, promoter, and visionary provocateur who has worked in Mississippi’s fields of food, music, art and literature for more than 40 years. In 1983, Malcolm founded Hal’s St. Paddy’s Parade, which supports Children’s Hospital of Mississippi and attracts more than 75,000 visitors a year. Then, in 1985, Malcolm and his brother, Harold White, opened Hal & Mal’s restaurant—one of Mississippi’s most renowned public gathering places. Since then, Malcolm has built a long track record of promoting Mississippi culture, beginning with George Street Grocery, then Jubilee Jam, Zoo Blues and WellsFest—all longstanding cultural icons in Jackson. In 2020, Malcolm retired as executive director of the Mississippi Arts Commission, capping 15 years of public service at the Arts Commission and Visit Mississippi. Throughout, he has been a major proponent of Mississippi and her culture as an economic engine, tourism asset, means of transformation, destination for filmmakers and powerful educational tool. In both posts, White increased Mississippi’s visibility around the globe and at home through initiatives like the state’s trail marker trail—the Mississippi Writers Trail, and Mississippi Freedom Trail, and chairing the Mississippi Blues Commission. As a writer, Malcolm has published two books: “Little Stories: A Collection of Mississippi Photos”, and “The Artful Evolution of Hal & Mal’s”, a collaboration with artist Ginger Williams Cook and memoir of “the most talked about upscale honky-tonk in Mississippi.” He is also the author of numerous articles about food in Mississippi and creator of award-winning recipes in the Southern genre. A longtime radio personality, Malcolm created and hosted the Mississippi Arts Hour. Today, he co-hosts Deep South Dining—a program all about the culture and flavor of southern cuisine on MPB Radio, available through NPR, YouTube and Apple Podcasts. White frequently travels the state talking about foodways with the Mississippi Humanities Council Speakers Bureau—and, this year, he was presented the Humanities Council’s highest honor, the Cora Newman Award for lifetime contribution to the public humanities. **You Might Like** **Riley Center announces fall-winter series** **Riley Center announces fall-winter series** **Meridian Orthopaedic Specialists cuts ribbon on Highway 39 location** **Meridian Orthopaedic Specialists cuts ribbon on Highway 39 location** **Bland wins mayor’s race, council set** **Bland wins mayor’s race, council set** **UMMC looks to raise $125 million for NIC designated cancer center** **UMMC looks to raise $125 million for NIC designated cancer center** News Obituaries Opinion Sports Newsletter signup e-Edition Subscriptions Classifieds Jobs About Us Contact Us"}