{"id": 2159, "name": "TMZ", "domain": "tmz.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.tmz.com/2025/06/11/michael-knowles-claims-gavin-newsom-mishandled-ice-protests-needed-donald-trump/#disqus_thread", "title": "Michael Knowles Claims Gavin Newsom Mishandled Ice Protests Needed Donald Trump", "content": "Facebook X Youtube Instagram news Sports Hip Hop Watch Photos Tours Deals news Sports Hip Hop Watch Photos Tours Deals En Español **shows** **download the app** contact careers Privacy Policy (New) Terms of Use ad choices Your Privacy Choices Articles Articles XML Updated Articles Updated Articles XML Galleries Photos XML Videos Give Usa Call Shoot Usan Email Send Usa Text **Eva Longoria Shows Off Beach Body in Spain As She Kisses Husband José Bastón** **Eva Longoria Shows Off Beach Body in Spain As She Kisses Husband José Bastón** **Alessandra Ambrosio Turns Up Temps On Cheeky Cabo Vacay ... See The Pics!** **Alessandra Ambrosio Turns Up Temps On Cheeky Cabo Vacay ... See The Pics!** **Kim Zolciak and Kroy Biermann Forced to Move Out of Home by U.S. Marshals** **Kim Zolciak and Kroy Biermann Forced to Move Out of Home by U.S. Marshals** **Can You Guess 'The Bachelorette' Bikini Babe in This Hot Shot?!** **Can You Guess 'The Bachelorette' Bikini Babe in This Hot Shot?!** **Diddy's Ex 'Jane' Says She Used Freak-Offs to Get Her Way With Diddy** **Diddy's Ex 'Jane' Says She Used Freak-Offs to Get Her Way With Diddy** **Gavin Newsom Handled Ice Protests So Terribly That Trump Had To Step In, Conservative Pundit Says** **Gov. Gavin NewsomHe Failed To Step In, So Trump Had To!!!Says Conservative pundit** Exclusive 491 Conservative commentatorMichael Knowlestore into Gov.Gavin Newsomon \"TMZ Live\" -- ripping his response to the L.A. ICE protests and claiming it was such a mess,Trumphad no choice but to step in. Knowles pointed to torched cop cars, assaulted officers, and even an 'illegal alien' allegedly tossing a Molotov cocktail as proof L.A. was in serious trouble -- blaming the chaos on Newsom and MayorKaren Bass' failure to act accordingly, which forced Trump to bring in the National Guard and send in the Marines. When our hosts pushed back -- noting the chaos was limited to one small area -- Knowles doubled down, saying Trump’s actually showing restraint in the matter... and this kind of tough crackdown is exactly what voters are begging for. You gotta watch the full convo -- it gets seriously heated. Knowles even dives into whether he’d back a Dem president doing the same in a red state ... and you're gonna want to hear his take on that! Shareon Facebook Shareon X **related articles** **about tmz** About TMZ.com Privacy Policy (New) Terms of Use Ad Choices Your Privacy Choices Articles Articles XML Updated Articles Updated Articles XML Galleries Photos XML Videos **contact tmz** Contact Us Send a Hot Tip Careers Advertising Inquiries Media Inquiries **subscribe** Yes! Send me email updates and offers from TMZ and its Affiliates. By subscribing, I agree to thePrivacy PolicyandTerms of Use **follow** **TMZ apps** Download the TMZ App on the Apple App Store Download the TMZ App on the Google Play Store"}