{"id": 218, "name": "Chicago Reader", "domain": "chicagoreader.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://chicagoreader.com/reader-partners/support-local-students-higher-education-7x-bingo-multiplier-illinois-lottery/", "title": "Support Local Students Higher Education 7x Bingo Multiplier Illinois Lottery", "content": "Donate Newsletters BEST OF CHICAGO NEWS CITY LIFE MUSICOpen dropdown menuEarly WarningsSecret History of Chicago Music Early Warnings Secret History of Chicago Music Early Warnings Secret History of Chicago Music VISUAL ARTS PERFORMING ARTS BOOKS FILM & TV FOOD & DRINK ABOUTOpen dropdown menuContact usWays to giveFind a print copyReader StoreClassifiedsPrint subscriptionsADVERTISE Contact us Ways to give Find a print copy Reader Store Classifieds Print subscriptions ADVERTISE Contact us Ways to give Find a print copy Reader Store Classifieds Print subscriptions ADVERTISE Twitter Facebook Instagram RSS Chicago Reader Chicago’s alternative nonprofit newsroom Donate Newsletters BEST OF CHICAGO NEWS CITY LIFE MUSICOpen dropdown menuEarly WarningsSecret History of Chicago Music Early Warnings Secret History of Chicago Music Early Warnings Secret History of Chicago Music VISUAL ARTS PERFORMING ARTS BOOKS FILM & TV FOOD & DRINK ABOUTOpen dropdown menuContact usWays to giveFind a print copyReader StoreClassifiedsPrint subscriptionsADVERTISE Contact us Ways to give Find a print copy Reader Store Classifieds Print subscriptions ADVERTISE Contact us Ways to give Find a print copy Reader Store Classifieds Print subscriptions ADVERTISE 🗞 Get the latest issue 🎸 Never miss a show: Sign up for Early Warnings 💛Support the Reader! 🏆Win prizes: The Goodman Theatre, Theo Ubique and more! **Support local students pursuing higher education with your purchase of a 7X Bingo Multiplier Instant Ticket from the Illinois Lottery** **Share this:** Click to share on Bluesky (Opens in new window)Bluesky Click to share on Facebook (Opens in new window)Facebook Click to share on Threads (Opens in new window)Threads Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on X (Opens in new window)X Click to email a link to a friend (Opens in new window)Email The Illinois Lottery is nationally recognized for its pioneering work with specialty lottery tickets dedicated to raising awareness and funding for specific worthy causes that impact local communities.In January 2024, the Illinois Lottery launched a joint specialty instant ticket supporting ten different causes, including the United Negro College Fund (UNCF). A portion of every dollar spent on this ticket directly contributes to UNCF, helping fund educational scholarships for college and university students.Now in its second year, the joint ticket, the 7X Bingo Multiplier, costs $5 and isavailable for purchase at more than 7,000 Illinois Lottery retailers throughout the state. With its eye-popping green background and colorful, eye-catching design, 7X Bingo Multiplier makes a great present for friends, family members, neighbors, and colleagues 18 and over—or play it yourself for a chance to win up to $200,000. Visit theIllinois Lottery websitefor more information about 7X Bingo Multiplier and the many good causes it supports each year. Read on to learn more about the United Negro College Fund, which celebrated its 80th-anniversary last year, and how your purchase of a 7X Bingo Multiplier ticket can help them empower Illinois students pursuing higher education over the next 80 years and beyond. Higher education is a major pathway to upward mobility for individuals and leads to economic stability for families and communities. That reality inspired civil rights activist William J. Trent, educator and activist Mary McLeod Bethune, and Tuskegee Institute president Frederick D. Patterson to found the United Negro College Fund (UNCF) in 1944. The philanthropic organization, whose motto is “A mind is a terrible thing to waste, but a wonderful thing to invest in,” supports Historically Black Colleges and Universities (HBCUs) while working to make higher education more accessible and equitable for marginalized students throughout the country. In 2024, UNCF celebrated its 80th anniversary of educational leadership, advocacy, and community building. As it looks toward the next 80 years, the organization maintains a sterling reputation in the nonprofit world and beyond.The Chronicle of Philanthropyranks it among the top charitable organizations in the United States. In the fiscal year 2023, it maintained a cost ratio of 15 percent of total expenses, with 4 percent going for administrative costs and 11 percent for fundraising efforts. That means 85 percent of their funding goes toward mission-related programming expenditures. That’s no small potatoes when you consider that UNCF awards more than 12,000 scholarships annually that are collectively worth around $65 million, making them the largest funder of minority students seeking higher education in the country. Here in Illinois, UNCF awarded 399 scholarships to 310 students, including 230 scholarships to 178 students in Chicago in the 2023-2024 year, for a total of $2,844,435.99. “The dollar amount that scholarship assistance needs to be to help a student graduate is $5,000,” says UNCF Chicago regional development director Lisa Rollins. “Our average scholarship amount in the state of Illinois is $7,100, and for the city level of Chicago, the average scholarship amount is close to $9,000—so we almost double that amount.” While some assume that students must attend one of UNCF’s 37 member schools to qualify for a scholarship through the organization, that’s not the case. Depending on the donor requirements, UNCF scholarship recipients use their funds to attend private and public universities and colleges in and out of their home states. Another common misconception is that students must be African American to apply. However, the organization does not discriminate based on race or ethnicity, and everyone is welcome to apply. In addition to its higher ed services, UNCF provides college readiness programs for families and students in kindergarten through 12th grade. As a testament to their work, 70 percent of African American students who receive a UNCF scholarship graduate within six years, compared to a national rate of 45 percent for all African American students. UNCF is also committed to supporting students at risk of dropping out of school due to unexpected financial hardships such as housing insecurity, medical issues, or natural disasters. Through their Emergency Student Aid (ESA) program, students can receive emergency grants and small loans to help cover their expenses. “We do find that 65 percent of those students graduate within one year of receiving their emergency assistance award. So we do know that that’s working,” Rollins says. That makes it all the more clear that every dollar donated to UNCF can make a difference in a student’s future. Last year, under Illinois Senate Bill 1508 (sponsored by Senator Mattie Hunter), UNCF became one of ten worthy causes to become part of the Illinois Lottery’s joint specialty ticket, which sells for $5 each at retailers across the state. The effort proved to be a stunning success. “The Lottery results had we had them last year, would have automatically propelled us another million dollars,” Rollins says. “So we would’ve given out $3.8 million as opposed to $2.8, and that’s a huge difference. And when we do start giving them out, they’ll be twice the normal amount that we know it takes [to help students graduate]. The Lottery scholarships will be $10,000 scholarships.” Rollins anticipates those scholarships will be distributed in May or June of this year. In the meantime, she encourages people to visit the UNCF website to learn more about their various scholarships and educational resources and to get involved. “In April, we’ll be doing our second radiothon in celebration of UNCF’s anniversary, and then we have our two big events. In June, we will celebrate the 25th anniversary of our gala, and in September, we will be doing our walk,” she says. As UNCF looks ahead to its next 80 years, Illinoisans can continue to support their mission by purchasing a 7X Bingo Multiplier Instant Ticket from the Illinois Lottery. “I just want people to continue to buy the lottery ticket to help send kids to school here in Illinois or other places because we know that the number one reason our kids do not finish college is finance,” Rollins says. “That’s the number one reason they don’t go to school and the number one reason they don’t stay in school.” For more information about UNCF Chicago, visit uncf.org/local-offices/chicagoTo learn more about CIVC and how you can support Illinois Veterans, visitciveteran.org. **Sponsored by Illinois Lottery** The news you should know in the city you love. **SAIC nontenure-track faculty ratify first union contract** **Spot on** **DOJ investigates ”racist” hiring practices at City Hall** **Is SAIC trying to stifle free speech?** **When fatal shooting victims are Black, Chicago police arrest rates drop** **Illinois police, retailers don’t want you to mask up** Twitter Facebook Instagram RSS About theChicago ReaderContact usFind the paperSubscribe Contests/Giveaways/PromotionsShop theReaderstoreClassifieds AdvertisePromote your event Privacy Policy|Terms of Use"}