{"id": 1113, "name": "Center for Popular Democracy", "domain": "populardemocracy.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://populardemocracy.org/news-article/popular-democracy-denounces-ice-detention-of-mahmoud-khalil-as-an-egregious-violation-of-civil-rights-and-first-amendment-freedoms/", "title": "Popular Democracy Denounces Ice Detention Of Mahmoud Khalil As An Egregious Violation Of Civil Rights And First Amendment Freedoms", "content": "**Stay In Touch** Home About UsJob Opportunities Job Opportunities Job Opportunities Our Affiliates Take Action Ways to Give Donate **News** 03/10/2025 **Popular Democracy Denounces ICE Detention of Mahmoud Khalil as an Egregious Violation of Civil Rights and First Amendment Freedoms** ShareTweet Popular Democracy strongly condemns the recent abduction of Mahmoud Khalil, a permanent U.S. resident and a Palestinian activist, by Immigration and Customs Enforcement (ICE). This alarming act is not only a blatant violation of civil rights but also a dangerous precedent that threatens the First Amendment freedoms of all individuals in the United States. The detention of Mr. Khalil is nothing short of an attack on free speech and the right to dissent. These actions by ICE and the current administration signal a terrifying shift toward the normalization of authoritarian tactics where individuals—whether citizens or non-citizens—can be detained and disappeared for exercising their constitutional rights. We cannot and will not stand by as this country moves toward a dangerous erosion of democratic principles. This moment demands collective resistance. It is our shared responsibility to push back against these injustices, hold those in power accountable, and ensure that our country remains a place where civil liberties and due process are fiercely protected. Popular Democracy calls on all elected officials, community leaders, and citizens to speak out against this abuse of power. We demand the immediate release of Mahmoud Khalil. We must not allow this dangerous precedent to stand. **NEW VIDEO: The Truth About Forced Arbitration** **From Our Blog** **¡Alcance!** **#FamiliesBelongTogether Protests Outside of Jamie Dimon’s Home** **#MarchForTruth This Saturday, June 3** **#Power4PuertoRico Campaign Acts for a Just Recovery** **#ReclaimMLK Honors Dr. King's Legacy** **News** **Statement from Popular Democracy on the Confirmation of Dr. Oz** **Popular Democracy Condemns Trump’s Executive Order To Silence Voters And Seize Power** **Popular Democracy Statement On Democratic Leadership Advancing Trump’s Plans To Gut Government** **Popular Democracy Denounces ICE Detention of Mahmoud Khalil as an Egregious Violation of Civil Rights and First Amendment Freedoms** **CENTER FOR POPULAR DEMOCRACY ACTION DENOUNCES OVERTURN OF ROE V. WADE, CALLS FOR LAWMAKERS TO SAFEGUARD ABORTION RIGHTS** 449 Troutman Street, Suite ABrooklyn, NY 11237 1730 M Street NW, Suite 1115Washington, DC 20036 © 2025 Popular Democracy. All Rights Reserved. | EIN: 45-3813436 |Privacy Policy|State Nonprofit Disclosures Full Color Blueprint Logo Lock upWith a little help fromBlueprint Interactive"}