{"id": 889, "name": "MediaShift", "domain": "mediashift.org", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://mediashift.org/2018/03/mediashift-podcast-263-facebook-disarray-privacy-concerns-google-spend-300-million-support-journalism-vox-medias-melissa-bell/", "title": "Mediashift Podcast 263 Facebook Disarray Privacy Concerns Google Spend 300 Million Support Journalism Vox Medias Melissa Bell", "content": "Social MediaFacebookTwitterEngagementPodcastingOnline Video Facebook Twitter Engagement Podcasting Online Video Facebook Twitter Engagement Podcasting Online Video BusinessAdvertisingShiftBookShiftMagazineShiftMovieShiftNewspaperShiftRadioShiftTVShiftTechnology AdvertisingShift BookShift MagazineShift MovieShift NewspaperShift RadioShift TVShift Technology AdvertisingShift BookShift MagazineShift MovieShift NewspaperShift RadioShift TVShift Technology Global ViewEuropeFree SpeechPoliticalShift Europe Free Speech PoliticalShift Europe Free Speech PoliticalShift EducationInnovationEntrepreneurshipLaw & EthicsTools & TipsPerspectives#EdShift Chats Innovation Entrepreneurship Law & Ethics Tools & Tips Perspectives #EdShift Chats Innovation Entrepreneurship Law & Ethics Tools & Tips Perspectives #EdShift Chats MetricsBest PracticesCase StudiesImpactSocial MetricsTools & Resources#MetricShift Chats Best Practices Case Studies Impact Social Metrics Tools & Resources #MetricShift Chats Best Practices Case Studies Impact Social Metrics Tools & Resources #MetricShift Chats Training Podcast Events Studio ADVERTISEMENT **MediaShift Podcast #263: Facebook in Disarray Over Privacy Concerns; Google to Spend $300 Million to Support Journalism; Vox Media’s Melissa Bell** In the news this week, Facebook has taken one hit after another when the news broke that Trump consulting firm Cambridge Analytica had received Facebook profile data on 50 million users to help sway the election. Can the social giant turn the tide of bad news? Meanwhile Google made a splash by pledging $300 million for its new Google News Initiative to fight fake news, support subscriptions for publishers and more. As Facebook and Google lose share in online advertising, publishers are also looking elsewhere for social distribution, including Twitter and Pinterest. And Vox Media’s Melissa Bell joins us to talk about the company’s social video layoffs as the company pivots toward more podcasts and TV shows. Don’t have a lot of time to spare, but still want to get a roundup of the week’s top news? Then check out our Digital Media Brief below! **MediaShift Podcast** **Digital Media Brief** Listen to the MediaShift podcast andfollow us on SoundCloud!Thanks to SoundCloud for providing audio support. Subscribe to the MediaShift podcastvia iTunes. Follow@Mediashiftpod on Twitter. Listen to the podcast viaour Stitcher pageor with the Stitcher app. **Host Bio** Mark Glaseris executive editor and publisher of MediaShift and Idea Lab. He is an award-winning writer and accidental entrepreneur, who has taken MediaShift from a one-person blog to a growing media company with events such as Collab/Space workshops and weekend hackathons; the weekly MediaShift podcast; and digital training, DigitalEd, in partnership with top journalism schools. You can follow him on Twitter@mediatwit. **SPECIAL GUESTS** Melissa Bellis the publisher of Vox Media, overseeing editorial strategy and development of the company’s networks, including SB Nation, Eater, The Verge, Vox, Curbed, Recode, Racked, and Polygon. She is also the co-founder of Vox, Vox Media’s brand known for explaining the news. **Top News Of The Week** Facebook in Disarray Over Cambridge Analytica Misdeeds This week has been one disaster after the next for social giant Facebook and its dealings with political data consultants at Cambridge Analytica. It all started with joint reports from the New York Times, Guardian and Observer showing that Cambridge Analytica, which helped the Trump campaign in 2016, obtained psychographic profiles of 50 million Facebook users without their consent. The reports detailed how the firm obtained the data from a Russian-American app maker which had asked for people’s permission to play a game, but instead of destroying the data, they turned around and made a deal with Cambridge Analytica. Facebook banned the company from its site, and is now under fire by politicians in the U.S. and U.K. for potential meddling in elections on both sides of the Atlantic. As the Tow Center’s Jonathan Albright told the Times: “Unethical people will always do bad things when we make it easy for them and there are few – if any – lasting repercussions.” One of the more ethical people, Facebook’s security chief Alex Stamos, is planning to leave the company in August. The New York Times reported that Stamos faced resistance at Facebook when he advocated for more disclosure on Russian interference on the platform. Meanwhile, damaging reports continued from Channel 4 in the U.K., which secretly taped top Cambridge Analtyca execs admitting to dirty tricks in elections around the world. That includes entrapment of politicians with bribes and sex workers. Cambridge Analytica CEO Alexander Nix was put on leave while the company investigated itself. Meanwhile, the reports had an immediate impact on Facebook’s stock, which lost $36 billion in market value on Monday. And the company has gone into damage control to address the fallout. In a Facebook post, Andrew Bosworth, a senior executive, wrote, “Much of the critique that has emerged over the weekend is valid and I am following it closely and listening.” The FTC, Congress and several states were starting investigations into the company. Where will this all lead? It’s time for Facebook’s leaders to show leadership, and tighten rules around privacy and personal data. https://www.nytimes.com/2018/03/18/us/cambridge-analytica-facebook-privacy-data.htmlhttps://www.nytimes.com/2018/03/17/us/politics/cambridge-analytica-trump-campaign.htmlhttps://www.channel4.com/news/cambridge-analytica-revealed-trumps-election-consultants-filmed-saying-they-use-bribes-and-sex-workers-to-entrap-politicians-investigationhttps://www.cnbc.com/2018/03/20/facebook-ceo-mark-zuckerberg-summoned-by-uk-mps-over-cambridge-analytica.htmlhttps://www.wsj.com/articles/facebook-is-pummeled-by-user-data-blowback-1521561322?mod=trending_now_2https://www.nytimes.com/2018/03/19/technology/facebook-alex-stamos.html Google Plans to Invest $300 Million to Support Journalism While Facebook suffered, rival tech giant Google made a splash of a different kind. The company announced the new Google News Initiative, which will be focused on surfacing accurate information during breaking news events, helping the business side of journalism, and creating tools for journalists to do their jobs. And Google is supporting the wide-ranging initiative with $300 million in funding over the next three years. The initiative will swallow up the existing Google News Lab, making their work part of the larger project. And fighting fake news and misinformation is a big challenge for Google and especially YouTube, where every breaking news story seems to be followed by popular conspiracy theory videos. The latest example was after the school shooting in Florida, with student survivors being called “crisis actors.” Another key initiative is “Subscribe with Google,” a feature for publishers to dig into data to gain new subscribers. The search giant will also make buying subscriptions easier in search, with people using their Google Wallet to buy subscriptions from partners such as the New York Times, the Telegraph, USA Today Network and the Washington Post. But they’re also making it easier to read articles from publications you’re already subscribed to. When you’re logged into your Google Account, you’ll see a subsection of articles from sources you’re subscribed to when you search. They’re also building a new dashboard in Google Analytics to help news organizations find and target readers for subscriptions. All of this points to a serious effort by Google to help publishers on subscriptions, metrics and more. Let’s hope it continues. https://www.theverge.com/2018/3/20/17142788/google-news-initiative-fake-news-journalist-subscriptionshttps://www.blog.google/topics/google-news-initiative/introducing-subscribe-google/https://www.bloomberg.com/news/articles/2018-03-20/google-pours-300-million-into-effort-to-aid-news-publishershttp://www.bbc.com/news/business-43473938https://blog.google/topics/google-news-initiative/announcing-google-news-initiative/ Publishers Embrace Twitter and Pinterest as the Duopoly Fades A lot has been written about the power Google and Facebook wield in the digital ad market, but other platforms are trying their hardest to contest the duopoly. Research firm eMarketer predicts that Amazon will pull into third place in digital ads by 2020 with an expected 4.5 percent market share in the U.S. Snapchat is expected to break $1 billion dollars in ad revenues this year which is about 1 percent of the U.S. digital ad market. Meanwhile, Twitter’s U.S. digital ad share will drop this year but will grow again next year. Overall, eMarketer expects Facebook and Google to lose a couple percentage points of market share this year, which gives an opening to other platforms as well. Many publishers that are fed up with the duopoly have started to cast their eyes elsewhere. Last year Twitter announced that it would partner with a handful of media companies to provide video content on the platform. There have been a few changes to Twitter’s video strategy, including more live broadcasting and event coverage, and they’ve also made it easier for users to post videos. And publishers who have struggled with social video on Facebook are also turning to Pinterest. Digiday’s Lucia Moses reports that publishers rarely had consistent communication with Pinterest but that’s changed over the past few months, with an increase in outreach, collaboration and requests for feedback from the social platform. David Temple, Pinterest’s head of content, told Digiday the platform was looking into tools and analytics to help publishers distribute their content on the platform. http://mediashift.org/2018/03/publishers-learning-embrace-twitter-video/https://www.emarketer.com/content/google-and-facebook-s-digital-dominance-fading-as-rivals-share-growshttps://digiday.com/media/facebook-news-feed-changes-publishers-look-hopefully-pinterest/https://theoutline.com/post/3719/publishers-pivoting-to-pinterest?zd=1&zi=5d7kilndhttps://digiday.com/media/snapchat-is-enlisting-more-publishers-to-make-video-shows/ Here are some other stories we’re following The rise of fake news and Trump could be leading to a rise in journalism majors at large universities.Tronc chairman Michael Ferro steps down as new allegations come from women saying he made inappropriate advances toward them.Cheddar, the financial news service for millennials, raises $22 million in a fourth round of venture funding.And researchers in Germany have discovered pornography and links to child abuse images in bitcoin’s blockchain. Music on this Episode Can’t Hate The Hater by 3 Feet UpSinking Feeling by Jessie SpillaneDJ by JahzzarBacked Clean Vibes by Kevin MacleodAir Hockey Saloon by Chris ZabriskieI Never Wanted To Say by Lorenzo’s MusicI’m Going for a Coffee by Lee Rosevere Jefferson Yen is the producer for the MediaShift Podcast. His work has been on KPCC Southern California Public Radio and KRTS Marfa Public Radio. You can follow him@jeffersontyen. Comments are closed. ADVERTISEMENT ADVERTISEMENT Who We AreMediaShift is the premier destination for insight and analysis at the intersection of media and technology. The MediaShift network includes MediaShift, EducationShift, MetricShift and Idea Lab, as well as workshops and weekend hackathons, email newsletters, a weekly podcast and a series of DigitalEd online trainings.About MediaShift »Contact us »Sponsor MediaShift »MediaShift Newsletters »Follow us on Social Media@MediaShiftorg@Mediatwit@MediaShiftPodFacebook.com/MediaShift **Who We Are** **Follow us on Social Media** **Who We Are** **Follow us on Social Media** **MediaShift** Metrics EducationShift Social Media Business Global View About Contact Us Sponsorships MediaShift Events DigitalEd MediaShift Podcast **Mark Glaser** Privacy Policy Terms of Use Copyright MediaShift 2016"}