{"id": 707, "name": "Jamestown Sun", "domain": "jamestownsun.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.jamestownsun.com/news/north-dakota/trump-epa-plans-to-roll-back-bidens-carbon-mercury-emissions-rules-that-would-hit-north-dakota-coal-plants", "title": "Trump Epa Plans To Roll Back Bidens Carbon Mercury Emissions Rules That Would Hit North Dakota Coal Plants", "content": "📣 Advertise With Us Magazines and More Local ND Legislature UJ Sports JHS Sports Advertise With UsDigital AdvertisingPrint AdvertisingPrinting ServicesTV AdvertisingVideo ServicesPlace a Public NoticeGet Our Advertising Newsletter Digital Advertising Print Advertising Printing Services TV Advertising Video Services Place a Public Notice Get Our Advertising Newsletter Digital Advertising Print Advertising Printing Services TV Advertising Video Services Place a Public Notice Get Our Advertising Newsletter Sponsored Content NewsLocalNorth DakotaSouth DakotaNationalWorldThe VaultAgweekWDAY LiveForum News Network Local North Dakota South Dakota National World The Vault Agweek WDAY Live Forum News Network Local North Dakota South Dakota National World The Vault Agweek WDAY Live Forum News Network Weather SportsPrepPrep StandingsCollegeBison Media ZoneFCS StandingsProNorthland OutdoorsWDAY+ Prep Prep Standings College Bison Media Zone FCS Standings Pro Northland Outdoors WDAY+ Prep Prep Standings College Bison Media Zone FCS Standings Pro Northland Outdoors WDAY+ Obituaries Health Business OpinionEditorialsColumnsLetters Editorials Columns Letters Editorials Columns Letters LifestyleArts / EntertainmentHome / GardenAstro BobComicsFree Games Arts / Entertainment Home / Garden Astro Bob Comics Free Games Arts / Entertainment Home / Garden Astro Bob Comics Free Games CommunityMilestonesCalendarContestsAnnouncements Milestones Calendar Contests Announcements Milestones Calendar Contests Announcements Podcasts ListingsClassifiedsPublic NoticesJobsHQ Classifieds Public Notices JobsHQ Classifieds Public Notices JobsHQ AccountFCC NetworkProfileNewslettersHelpSubscriber Benefits FCC Network Profile Newsletters Help Subscriber Benefits FCC Network Profile Newsletters Help Subscriber Benefits Sponsored By ADVERTISEMENT ADVERTISEMENT **Trump EPA plans to roll back Biden's carbon, mercury emissions rules that would hit North Dakota coal plants** **North Dakota leaders say the Biden EPA rules threaten the state's lignite plants, the country's power grid and national security. An environmental group claims rescinding the rule would cost lives.** FARGO — President Donald Trump’s administration plans to repeal two Biden-era rules that North Dakota leaders saywould threaten the state’s coal industry. But rescinding the rule could cost lives, an environmental group said. ADVERTISEMENT The Environmental Protection Agency has proposed rescinding the Clean Power Plan 2.0 and a Mercury and Air Toxics Standards, or MATS, rule, according to a release issued Wednesday, June 11. North Dakota’s congressional delegation and North DakotaGov. Kelly Armstrongcelebrated the development. “Today’s action by the EPA is a win for U.S. energy dominance and supports continued access to the affordable and reliable baseload power provided by coal,” Sen.John Hoeven,R-N.D., said in a statement. The EPA needs to finalize its decision to rescind the rules. It's unclear when that may happen. Fargo woman accused of embezzling from one employer to pay for previous theft1d ago $7 billion data center deal in southeast North Dakota is 'worth the growing pains,' residents say4d ago Serendipity, then a DNA match, lead Medora Musical veteran to her birth family4d ago After 6 new cases over the weekend, North Dakota has nation’s highest measles rateJun 4 Alleged leader, members of large-scale rural North Dakota meth ring indicted2d ago Under former President Joe Biden, the EPA approved the Clean Power Plan 2.0 in an effort to reduce carbon emissions from fossil fuels that generate electricity. Biden aimed to cut back greenhouse gas emissions and slowclimate change. Biden’s EPA also called on coal-fired power plants to reduce the amount of toxic metal emissions released into the atmosphere. Mercury in the air can be dangerous for certain populations, including pregnant women and children, according to the Sierra Club, an environmental advocacy group. “It’s completely reprehensible that Donald Trump would seek to roll back these lifesaving standards and do more harm to the American people and our planet just to earn some brownie points with the fossil fuel industry,\" Sierra Club Climate Policy Director Patrick Drupp said in a statement. \"This repeal means more climate disasters, more heart attacks, more asthma attacks, more birth defects, more premature deaths.\" Lignite coal-fired plants, like the five in North Dakota, initially had to reduce mercury emissions by 70% before July 8, 2027. Trump extended that deadline by two years after the coal industry said technology to reduce mercury emissions didn’t exist. ADVERTISEMENT The MATS rule would cost coal plants in 12 states, including North Dakota, $1.2 billion over a decade starting in 2028, the EPA said in its Wednesday news release. EPA Administrator Lee Zeldin criticized Biden’s Clean Power Plan, claiming its purpose was to “regulate coal, oil and gas out of existence.” “Affordable, reliable electricity is key to the American dream and a natural byproduct of national energy dominance,” Zeldin said in a statement. “According to many, the primary purpose of these Biden-Harris administration regulations was to destroy industries that didn't align with their narrow-minded climate change zealotry. Repealing the Clean Power Plan would save the power sector $19 billion in regulatory costs, the EPA said. U.S. Sen Kevin Cramer, Hoeven and Armstrong called the Biden-era rules an overreach. Armstrong said he met with Zeldin last month in Washington, D.C., to discuss the rules. In a statement, Armstrong said the Clean Power Plan would “effectively shut down existing coal-fired power plants by requiring them to curb greenhouse gas emissions by 90% by 2032.” MATS threatened the power grid and would force coal plants to prematurely close, Armstrong said. “It’s refreshing to finally have a regulatory agency that takes input from the people who produce what the world needs – and allows them to do it better than anyone else while protecting the environment,” the governor wrote. ADVERTISEMENT The two rules targeted North Dakota’s energy industries, Cramer said. “In North Dakota, we mine lignite coal and produce very reliable, long-term, steady electricity at a low cost,” he said in a statement. “I’ve always resented that somebody in this building, at EPA, thought they cared more about the air, land, water and economy than I did and my family did.” The Biden rules would threaten the reliability of the country’s power grid and weaken national security, U.S. Rep. Julie Fedorchak, R-N.D., said in a statement. “Under the Trump administration, the EPA is charting a new course — one that supports the responsible development of the natural resources we’ve been blessed with for the good of the American people,” she said in calling the potential repeal “a big win for North Dakota energy and American manufacturing.” ADVERTISEMENT ADVERTISEMENT AccountManage My AccountPrivacy PolicyTerms and ConditionsPolicies and StandardsSubscriber Benefits Manage My Account Privacy Policy Terms and Conditions Policies and Standards Subscriber Benefits Manage My Account Privacy Policy Terms and Conditions Policies and Standards Subscriber Benefits NewsSubscription OptionsEmail NewslettersE-PaperOur News Network Subscription Options Email Newsletters E-Paper Our News Network Subscription Options Email Newsletters E-Paper Our News Network ContactGet HelpContact UsAdvertise With UsGet Our Advertising NewsletterCareers Get Help Contact Us Advertise With Us Get Our Advertising Newsletter Careers Get Help Contact Us Advertise With Us Get Our Advertising Newsletter Careers MoreJobsHQClassifiedsPublic Notices JobsHQ Classifieds Public Notices JobsHQ Classifieds Public Notices Twitter Facebook"}