{"id": 2191, "name": "Government Accountability Institute", "domain": "g-a-i.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://g-a-i.org/throw-them-all-out-how-politicians-and-their-friends-get-rich-off-insider-stock-tips-land-deals-and-cronyism-that-would-send-the-rest-of-us-to-prison-2010/", "title": "Throw Them All Out How Politicians And Their Friends Get Rich Off Insider Stock Tips Land Deals And Cronyism That Would Send The Rest Of Us To Prison 2010", "content": "GAI NEWS GAI BOOKSFool’s Gold (2025)Blood Money (2024)Controligarchs (2023)Red Handed (2022)Fallout (2020)Profiles in Corruption (2020)Compromised (2018)Secret Empires (2018)Fraud (2018)Bush Bucks (2015)Clinton Cash (2015)Extortion (2013)Throw Them All Out (2010) Fool’s Gold (2025) Blood Money (2024) Controligarchs (2023) Red Handed (2022) Fallout (2020) Profiles in Corruption (2020) Compromised (2018) Secret Empires (2018) Fraud (2018) Bush Bucks (2015) Clinton Cash (2015) Extortion (2013) Throw Them All Out (2010) Fool’s Gold (2025) Blood Money (2024) Controligarchs (2023) Red Handed (2022) Fallout (2020) Profiles in Corruption (2020) Compromised (2018) Secret Empires (2018) Fraud (2018) Bush Bucks (2015) Clinton Cash (2015) Extortion (2013) Throw Them All Out (2010) INVESTIGATIONS DONATE TO GAI NEWSLETTER CONTACT USMEDIA REQUESTS MEDIA REQUESTS MEDIA REQUESTS ABOUT US TIPS Follow Us GAI NEWS GAI BOOKSFool’s Gold (2025)Blood Money (2024)Controligarchs (2023)Red Handed (2022)Fallout (2020)Profiles in Corruption (2020)Compromised (2018)Secret Empires (2018)Fraud (2018)Bush Bucks (2015)Clinton Cash (2015)Extortion (2013)Throw Them All Out (2010) Fool’s Gold (2025) Blood Money (2024) Controligarchs (2023) Red Handed (2022) Fallout (2020) Profiles in Corruption (2020) Compromised (2018) Secret Empires (2018) Fraud (2018) Bush Bucks (2015) Clinton Cash (2015) Extortion (2013) Throw Them All Out (2010) Fool’s Gold (2025) Blood Money (2024) Controligarchs (2023) Red Handed (2022) Fallout (2020) Profiles in Corruption (2020) Compromised (2018) Secret Empires (2018) Fraud (2018) Bush Bucks (2015) Clinton Cash (2015) Extortion (2013) Throw Them All Out (2010) INVESTIGATIONS DONATE TO GAI NEWSLETTER CONTACT USMEDIA REQUESTS MEDIA REQUESTS MEDIA REQUESTS ABOUT US TIPS GAI NEWS GAI BOOKS- Fool's Gold (2025)- Blood Money (2024)- Controligarchs (2023)- Red Handed (2022)- Fallout (2020)- Profiles in Corruption (2020)- Compromised (2018)- Secret Empires (2018)- Fraud (2018)- Bush Bucks (2015)- Clinton Cash (2015)- Extortion (2013)- Throw Them All Out (2010) - Fool's Gold (2025) - Blood Money (2024) - Controligarchs (2023) - Red Handed (2022) - Fallout (2020) - Profiles in Corruption (2020) - Compromised (2018) - Secret Empires (2018) - Fraud (2018) - Bush Bucks (2015) - Clinton Cash (2015) - Extortion (2013) - Throw Them All Out (2010) - Fool's Gold (2025) - Blood Money (2024) - Controligarchs (2023) - Red Handed (2022) - Fallout (2020) - Profiles in Corruption (2020) - Compromised (2018) - Secret Empires (2018) - Fraud (2018) - Bush Bucks (2015) - Clinton Cash (2015) - Extortion (2013) - Throw Them All Out (2010) INVESTIGATIONS DONATE TO GAI NEWSLETTER CONTACT US- MEDIA REQUESTS - MEDIA REQUESTS - MEDIA REQUESTS ABOUT US TIPS **Throw Them All Out: How Politicians and Their Friends Get Rich Off Insider Stock Tips, Land Deals, and Cronyism That Would Send the Rest of Us To Prison (2011)** **The book that exposed insider trading by Congress still makes headlines today.** This book, published in 2011, was author Peter Schweizer’s first effort at exposing the full smörgåsbord of ways members of Congress have to line their pockets and play the system. It is the full story of the inside game in Washington and shows how the permanent political class enriches itself at the expense of the rest of us. It was after completing work on this book that Peter Schweizer realized that to truly expose the mountains of corrupt activities, schemes, side-deals, and crooked politicians in Washington, it would take an organization. He then founded the Government Accountability Institute in 2012. Key findings in Throw Them All Out: Insider trading is illegal on Wall Street, yet it is routine among members of Congress. Normal individuals cannot get in on IPOs at the asking price, but politicians do so routinely. The Obama administration has been able to funnel hundreds of millions of dollars to its supporters, ensuring yet more campaign donations. An entire class of investors now makes all of its profits based on influence and access in Washington. Peter Schweizer doggedly researched through mountains of financial records. With the help of two part-time researchers, he tracked complicated deals and stock trades back to the timing of briefings, votes on bills, and every other point of leverage for politicians in Washington. The work was painstaking and slow, because these are the kinds of records that the powerful do not want people to ever find. But the result is a manifesto for revolution: the Permanent Political Class must go. “Send me a bill that bans insider trading by members of Congress. I will sign it tomorrow.” ~President Barack Obama, State of the Union speech, 2014 The book led to the resignation of Rep. Spencer Bachus from his committee chairmanship. Its deep research and journalistic rigor ledNewsweekmagazine to dub Schweizer, “The Wonk Who Slayed Washington.” Available everywhere! For media inquiries and interview requests aboutThrow Them All Out,please contact publicist Sandy Schulz throughemail. LA Riots Coming to You Soon?June 11, 2025 Congressman Chip Roy on Fiscal ResponsibilityJune 4, 2025 The current state of civil rights in America with Harmeet DhillonMay 28, 2025 Schweizer: Media Still Lying About BidenMay 21, 2025 Qatar vs QvarMay 14, 2025 Clinton Cash - A Decade of Impact With Special Guest Steve BannonMay 7, 2025 Schweizer: Even for non-Catholics, the Next Pope MattersApril 30, 2025 Harvard Fights to DiscriminateApril 22, 2025 Billy Long at the IRSApril 16, 2025 The Real Issue Behind the TariffsApril 8, 2025 SCHWEIZER ON AUTOPEN SCANDAL: There’s the Question of ‘Oval Office Capture’ [WATCH] NOT SHOCKED AT ALL! Eggers Says Biden Admin Hiding Terrorists from Media ‘Incredibly Consistent’ With How Bidens Do Business [WATCH] SCHWEIZER: ‘What We’re Talking About Here is the Capture of the Oval Office’ [WATCH] ‘THE OUTRAGE IS BIPARTISAN’: Bruner Says Americans Sick of Congress Members Enriching Themselves in Office [WATCH] ‘Worst President in Modern History’: Bruner Unloads on Biden After Bombshell COVID Report [WATCH] The Government Accountability Institute is a non-profit organization, recognized as tax-exempt under the IRS status of 501(c)(3). Our Privacy Policy|Terms of Service|State Nonprofit Disclosures| All content is © 2025. | All Rights Reserved. When people treat corruption as a routine part of the process, you have something far worse than wrongdoing or moral failing. You have a political cancer that breeds cynicism about democratic government and infects all of society.~ Edward Brooke HOME DONATE TO GAI CONTACT GAI"}