{"id": 1834, "name": "Vaccine Impact", "domain": "vaccineimpact.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "very-low", "questionable": null, "url": "https://vaccineimpact.com/2025/ice-kidnaps-permanent-resident-in-u-s-for-10-years-on-his-way-to-an-interview-to-become-a-u-s-citizen-no-warrant-no-criminal-record-no-charges-and-nobody-knows-where-he-is/", "title": "Ice Kidnaps Permanent Resident In U S For 10 Years On His Way To An Interview To Become A U S Citizen No Warrant No Criminal Record No Charges And Nobody Knows Where He Is", "content": "Home Subscribe Peace with God About UsAbout Vaccine ImpactContact UsOpportunities About Vaccine Impact Contact Us Opportunities About Vaccine Impact Contact Us Opportunities Resources Advanced Search Search for:Search Button Home Subscribe Peace with God About UsAbout Vaccine ImpactContact UsOpportunities About Vaccine Impact Contact Us Opportunities About Vaccine Impact Contact Us Opportunities Resources Advanced Search Search for:Search Button **ICE Kidnaps Permanent Resident in U.S. for 10 Years on His Way to an Interview to Become a U.S. Citizen – No Warrant, No Criminal Record, No Charges, and Nobody Knows Where He Is** Mohsen Mahdawiappeared on 60 Minutes in December of 2023where he condemned antisemitism. byBrian ShilhavyEditor, Health Impact News ICE agents seized a Palestinian student this week, Mohsen Mahdawi, who was a legal permanent resident holding a Green Card, and who had been in the U.S. legally for 10 years. Ironically, he was attending an immigration interview to become a U.S. Citizen in Vermont, something he would not have been able to do if he were here illegally, and if he had not already have resided in the U.S. for many years with no criminal record, in order to earn this interview to become a U.S. Citizen. Like previous students before him, he was approached by masked men, with reportedly no warrant, handcuffed and taken away, and at the time of this writing, nobody knows where he is, not even his lawyers whom he apparently was not allowed to call. Here is a 3-minute report from CBS in New York: Because Mohsen Mahdawi was a leader of a pro-Palestinian group at Columbia University,the New York Timesis reporting that Mahdawi is being deported because his activities could “potentially undermine” the Middle East peace process, according to a memo from Secretary of State Marco Rubio. The Trump administration is seeking to deport a Columbia student because his activities could “potentially undermine” the Middle East peace process, according to a memo from Secretary of State Marco Rubio that was reviewed by The New York Times. The memo asserted, without elaboration, that protests of the type Mr. Mahdawi had led could undermine the Middle East peace process by reinforcing antisemitic sentiment in the region and around the world and ultimately threatening a U.S. foreign policy goal of resolving the Gaza conflict “peacefully.” It also said, without elaborating, that Mr. Mahdawi had “engaged in threatening rhetoric and intimidation of pro-Israeli bystanders” and that his actions had undermined efforts to protect Jewish students from violence. A lawyer for Mr. Mahdawi, Luna Droubi, asked to comment on the assertions in the memo, said that they were “baseless claims made with no evidence.” “Mohsen in fact took the lead on bringing Palestinian and Israeli students together in pursuit of a just peace on campus and in the Middle East,” she said. “Mohsen, like every other person in this country, is entitled to due process and protections under the First Amendment.” (Source.) These kinds of lies from the Trump administration are becoming quite frequent, especially when they claim these Palestinian protesters are “threatening Jewish students,” when in fact Jewish students and other Jews are protesting against these illegal kidnappings. This is from theIsraeli publication Haaretz: Despite leading the Columbia’s Gaza solidarity encampment, Mohsen Mahdawi spent months fostering ties with Israeli and Jewish students, even holding meetings with university administrators to promote dialogue. Roni Ziv, an Israeli student who met with Mahdawi, says the Trump administration ‘will come for everyone’. (Source.) **White House Confirms that Trump is Looking for Ways to Deport U.S. Citizens** AsI wrote yesterday, President Trump has stated he wants to be able to deport U.S. Citizens that his administration declares are “criminals.” I actually expected some kind of retraction or “clarification” from his administration today, since Trump has a habit of going off script and saying embarrassing things that later need to be “clarified.” Surely the thought of deporting U.S. Citizens to one of the most barbaric and famous prisons in the world in El Salvador, would be one of those cases, I thought. But no, the White House announced today that this is actually true. President Donald Trump is exploring whether he can legally deport U.S. citizens to prisons in Central American countries, the White House said Tuesday. “It’s another question that the president has raised,” press secretary Karoline Leavitt said when a reporter asked if Trump currently has the power to send Americans to foreign prisons or would need to change the law to do so. “It’s a legal question that the president is looking into,” Leavitt answered. (Source.) Of course there are no laws that would allow ICE agents to start pulling U.S. Citizens off the street, and then immediately fly them to a prison in El Salvador with no due process of law. The Trump Administration obviously knows this. So the only way this could happen is the same way they are doing it right now with the students, by issuing an Executive Order, probably by declaring some kind of “emergency” to give Trump “emergency powers,” which is what he did in 2020 with COVID and the COVID injections, and is what he is doing right now with his tariffs and hisantisemitism task force. **Will the Zionists Prevail in Taking Over the U.S. and Eliminating Free Speech?** Image source and article. What we are now observing in real time here in the U.S. is Trump’s Zionist Administration trying to abolish the Constitution of the United States, and turning this country into a Zionist Jewish Monarchy instead, giving Trump powers outside the legal bounds of U.S. law, and even exploring ways to keep him in power beyond his current term. They are already clearly disregarding an order from the U.S. Supreme Court, and challenging the legitimacy of the U.S. legal system. The DOJ and the attorneys of the Maryland man who was mistakenly sent to the prison in El Salvador were back before a federal judge today, where the judge is beginning the discovery process to find out if the Trump Administration is guilty of being in contempt of court. A federal judge rebuked the Trump administration for doing “nothing” to arrange the return a Maryland man who was wrongly flown to a prison in El Salvador last month, and in a hearing on Tuesday set in motion a process to determine if the Trump administration officials had defied court orders requiring the government to bring the man, Kilmar Armando Abrego Garcia, back to the United States. The case has set up what could be a constitutional showdown between the White House and the judicial branch. The administration has argued that federal judges have no authority to tell the White House how to conduct foreign policy. Forcing the administration to reveal what it has done behind the scenes is an interim step on the way toward Judge Xinis figuring out if officials are in contempt of court. The judge also notes that this could be an uncomfortable process as the administration is compelled to answer specific questions and officials are possibly made to sit for depositions. She says she envisions the discovery process taking about two weeks. Suggesting how expeditiously she intends to move, Judge Xinis tells Drew Ensign, the Justice Department lawyer, that he should clear his calendar in order to arrange the discovery information she intends to request. “Cancel vacation,” she says. “Cancel other appointments. I’m usually pretty good about this in my courtroom, but not this time.” Laying out what she describes as a “tight timeline,” Judge Xinis asked Abrego Garcia’s lawyers to get their questions for the government ready by tomorrow. She says the plaintiffs can submit up to 15 questions and 15 requests for documents. The judge also says the plaintiffs can depose up to six administration officials, naming a few of them: Robert Cerna, a top official at U.S. Immigration and Customs Enforcement, and Joseph Mazzara, the acting general counsel of the Department of Homeland Security. (Source.) The Trump Administration is claiming that they are powerless to bring this man back to the U.S., but theNew York Times has reportedthat Trump has already done this before, in 2018 during his first term, where an Iraqi man was wrongly deported. In August 2018, during President Trump’s first term, an Iraqi immigrant named Muneer Subaihani went missing. A refugee who had been living in the United States for nearly 25 years, Mr. Subaihani was among hundreds of Iraqis who had been protected from deportation under a federal court order. His lawyers figured he was still in the custody of Immigration and Customs Enforcement, where he had been placed after he was swept up in an ICE raid. A search of the federal ICE database turned up nothing, so the attorneys went to the Justice Department, looking for an answer. Within a day, they got one. The government said it had made a mistake, according to Margo Schlanger, a professor at the University of Michigan Law School who was one of Mr. Subaihani’s lawyers. Mr. Subaihani had been deported to Iraq, in violation of the court order. The case has striking similarities to one that is playing out now in Mr. Trump’s second term, after the United States deported a Salvadoran man because of what the government has acknowledged was an “administrative error.” But the Trump administration’s response in the two cases could not be more different, a sign of how emboldened Mr. Trump has become in his defiance of the courts and in his determination to take a hard line on deportations, regardless of legal constraints. In Mr. Subaihani’s case, the government recognized its error to the federal court, setting off a monthslong odyssey to track down and retrieve a man who never should have been deported in the first place. (Source.) **A Public Announcement to my Critics and Enemies** As I have previously written just before Trump took his oath to office for his second term, where he did NOT put his hand on the Bible, I fasted and prayed for 10 days to seek God’s wisdom as to just what my role should be in Trump 2.0. I am repeating that here, because I have received emails from people demanding that I stop criticizing Trump, or complaining that I now cover “politics” too much. This is the verse the Lord spoke to me through at the beginning of this year (2025): John rebuked Herod the tetrarch because of Herodias, his brother’s wife, and all the other evil things he had done. (Luke 3:19) Readmy first article published under Trump 2.0: Excerpt: God has given me clear guidance in a couple of different ways, and one of those was in my recent study of the Gospel of Luke, and the account of the ministry of John the Baptist, who was the cousin of Jesus Christ, and whom Jesus testified was the last of the line of Old Testament prophets, and the greatest man to have walked the earth. The ruling religious leaders of John’s day were the members of the Sanhedrin, but the political leader was Herod, and John was led by the Holy Spirit to reveal the sins of this political leader of the Jews to the public as a warning. The result was that John was put in prison, and eventually beheaded, but his mission was already complete, which was to prepare The Way of Jesus Christ, the Jewish Messiah, which he did. The great news about the New Covenant, is that any believer in Jesus Christ filled with his Holy Spirit can now prophesy and testify to the truth. However, the consequences of doing so remain the same, and if Zionism spreads unchecked, I fear that what we saw during COVID in Trump 1.0 will pale in comparison to what might be about to happen in Trump 2.0. (Full article.) So just as John the Baptist, who prepared The Way of Jesus Christ to fulfill his ministry in the First Century, and was also called upon by God to expose the sins of the government of his day, so too is the Holy Spirit leading me to expose the dangers and sins of Trump 2.0. Therefore, to every one of my critics and enemies who email me demanding that I stop criticizing Donald Trump so much, I have to choose between obeying you, or obeying God, and that choice is easy for me. And if you live in the United States of America and believe that you can avoid making a similar choice about Trump and his Zionist goals, you are gravely mistaken. Whoever acknowledges me before men, I will also acknowledge him before my Father in heaven. But whoever disowns me before men, I will disown him before my Father in heaven. Do not suppose that I have come to bring peace to the earth.I did not come to bring peace, but a sword. For I have come to turn“a man against his father, a daughter against her mother, a daughter-in-law against her mother-in-law— a man’s enemies will be the members of his own household.”(Jesus Christ – Matthew 10:32-36) Comment on this article atHealthImpactNews.com. This article was written by Human Superior Intelligence (HSI)See Also:Understand the Times We are Currently Living ThroughWhere is Your Citizenship Registered?The Bewitching of America with the Evil Eye and the Mark of the BeastJesus Christ’s Opposition to the Jewish State: Lessons for TodayDistinguishing True Prophets from False Prophets in These Evil Modern TimesWho Controls the World? by Dr. A. True OttExposing the Christian Zionism CultInsider Exposes Freemasonry as the World’s Oldest Secret Religion and the Luciferian Plans for The New World OrderIdentifying the Luciferian Globalists Implementing the New World Order – Who are the “Jews”?The Brain Myth: Your Intellect and Thoughts Originate in Your Heart, Not Your BrainFact Check: “Christianity” and the Christian Religion is NOT Found in the Bible – The Person Jesus Christ IsThe Seal and Mark of God is Far More Important than the “Mark of the Beast” – Are You Prepared for What’s Coming?The Satanic Roots to Modern Medicine – The Mark of the Beast?Medicine: Idolatry in the Twenty First Century – 8-Year-Old Article More Relevant Today than the Day it was WrittenHaving problems receiving our emails? See:How to Beat Internet Censorship and Create Your Own NewsfeedWe Are Now onTelegram. Video channels atBitchute, andOdysee.If our website is seized and shut down, find us onTelegram, as well asBitchuteandOdyseefor further instructions about where to find us.If you use theTOR Onion browser, here are the links and corresponding URLs to use in theTOR browserto find us on the Dark Web:Health Impact News,Vaccine Impact,Medical Kidnap,Created4Health,CoconutOil.com. This article was written by Human Superior Intelligence (HSI) See Also: **Understand the Times We are Currently Living Through** **Where is Your Citizenship Registered?** **The Bewitching of America with the Evil Eye and the Mark of the Beast** **Jesus Christ’s Opposition to the Jewish State: Lessons for Today** **Distinguishing True Prophets from False Prophets in These Evil Modern Times** **Who Controls the World? by Dr. A. True Ott** **Exposing the Christian Zionism Cult** **Insider Exposes Freemasonry as the World’s Oldest Secret Religion and the Luciferian Plans for The New World Order** **Identifying the Luciferian Globalists Implementing the New World Order – Who are the “Jews”?** **The Brain Myth: Your Intellect and Thoughts Originate in Your Heart, Not Your Brain** **Fact Check: “Christianity” and the Christian Religion is NOT Found in the Bible – The Person Jesus Christ Is** **The Seal and Mark of God is Far More Important than the “Mark of the Beast” – Are You Prepared for What’s Coming?** **The Satanic Roots to Modern Medicine – The Mark of the Beast?** **Medicine: Idolatry in the Twenty First Century – 8-Year-Old Article More Relevant Today than the Day it was Written** **** Having problems receiving our emails? See: **How to Beat Internet Censorship and Create Your Own Newsfeed** **We Are Now onTelegram. Video channels atBitchute, andOdysee.** If our website is seized and shut down, find us onTelegram, as well asBitchuteandOdyseefor further instructions about where to find us. If you use theTOR Onion browser, here are the links and corresponding URLs to use in theTOR browserto find us on the Dark Web:Health Impact News,Vaccine Impact,Medical Kidnap,Created4Health,CoconutOil.com. This article was written by Human Superior Intelligence (HSI) See Also: **Understand the Times We are Currently Living Through** **Where is Your Citizenship Registered?** **The Bewitching of America with the Evil Eye and the Mark of the Beast** **Jesus Christ’s Opposition to the Jewish State: Lessons for Today** **Distinguishing True Prophets from False Prophets in These Evil Modern Times** **Who Controls the World? by Dr. A. True Ott** **Exposing the Christian Zionism Cult** **Insider Exposes Freemasonry as the World’s Oldest Secret Religion and the Luciferian Plans for The New World Order** **Identifying the Luciferian Globalists Implementing the New World Order – Who are the “Jews”?** **The Brain Myth: Your Intellect and Thoughts Originate in Your Heart, Not Your Brain** **Fact Check: “Christianity” and the Christian Religion is NOT Found in the Bible – The Person Jesus Christ Is** **The Seal and Mark of God is Far More Important than the “Mark of the Beast” – Are You Prepared for What’s Coming?** **The Satanic Roots to Modern Medicine – The Mark of the Beast?** **Medicine: Idolatry in the Twenty First Century – 8-Year-Old Article More Relevant Today than the Day it was Written** **** Having problems receiving our emails? See: **How to Beat Internet Censorship and Create Your Own Newsfeed** **We Are Now onTelegram. Video channels atBitchute, andOdysee.** If our website is seized and shut down, find us onTelegram, as well asBitchuteandOdyseefor further instructions about where to find us. If you use theTOR Onion browser, here are the links and corresponding URLs to use in theTOR browserto find us on the Dark Web:Health Impact News,Vaccine Impact,Medical Kidnap,Created4Health,CoconutOil.com. Comments are closed. We respect your email privacy **Top Stories This Week** **Navigation** Home About Us Terms Of Use Privacy Statement Contact Us **Health Impact News Network** Health Impact News Medical Kidnap Vaccine Impact Coconut Health Created4Health.org We respect youremail privacyAre youalready a subscriber?"}