{"id": 1727, "name": "Global Research", "domain": "globalresearch.ca", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://www.globalresearch.ca/world-war-iii-is-on-but-the-empire-has-already-lost-an-american-civil-war-looms-spiritual-transformation-is-the-only-way-to-prevent-extinction/5868285", "title": "World War Iii Is On But The Empire Has Already Lost An American Civil War Looms Spiritual Transformation Is The Only Way To Prevent Extinction", "content": "Home About Contact Membership Store Donate Archives USA Canada Latin America Africa Middle East Europe Russia Asia Oceania Italiano Deutsch Português srpski العربية 中文 Notre site en Français:mondialisation.ca **Global Research** grtv youtube twitter facebook rss US Nato War Economy Civil Rights Environment Poverty Media Justice 9/11 War Crimes Militarization History Science **World War III Is “On” But the Empire Has Already Lost. An American Civil War Looms. Spiritual Transformation Is the Only Way to Prevent Extinction.** **Global Research E-Book, Centre for Research on Globalization (CRG)** [This can be read in 51 languages via the “Translate Website” dropdown menu above. This can also be downloaded as PDF by clicking the PDF button above the featured image.] . . . . . . . **World War III Is “On” But the Empire Has Already Lost.** **An American Civil War Looms.** **Spiritual transformation is the only way to prevent extinction.** **By Richard C. Cook** Global Research E-Book, September 2024 This eBook is dedicated to the memory of the millions of human lives lost in WWI, WWII, and now WWIII. Featured photo: “Sacred Ground” Dunker Church remained standing at the center of theAntietam Battlefield, Sharpsburg, Maryland,on September 17, 1862, “the bloodiest day in American history.” Photo courtesy Karen Tintle-Cook Based on an article originally published on VT Foreign Policy. Copyright 2024 by Richard C. Cook. Copying, printing, transmission, and translation are authorized under Fair Use. Direct all inquiries to[email protected]including notification of reprinting or translation. **About the Author** Richard C. Cookis co-founder and lead investigator for the American Geopolitical Institute. Mr. Cook is a retired U.S. federal analyst with extensive experience across various government agencies, including the U.S. Civil Service Commission, FDA, the Carter White House, NASA, and the U.S. Treasury. As a whistleblower at the time of the Challenger disaster, he exposed the flawed O-ring joints that destroyed the Space Shuttle, documenting his story in the book “Challenger Revealed.” After serving at Treasury, he became a vocal critic of the private finance-controlled monetary system, detailing his concerns in “We Hold These Truths: The Hope of Monetary Reform.” He served as an advisor to the American Monetary Institute and worked with Congressman Dennis Kucinich to advocate for replacing the Federal Reserve with a genuine national currency. See his new book,Our Country, Then and Now, Clarity Press, 2023. Also see his Three Sages Substack athttps://montanarcc.substack.comand his American Geopolitical Institute articles athttps://www.vtforeignpolicy.com/category/agi/ “Every human enterprise must serve life, must seek to enrich existence on earth, lest man become enslaved where he seeks to establish his dominion!” Bô Yin Râ (Joseph Anton Schneiderfranken, 1876-1943), translation by Posthumus Projects Amsterdam, 2014. Also download the Kober Press edition of The Book on the Living Godhere. **** **Table of Contents** Preface Chapter 1: Introduction Chapter 2: How Did We Get Here? Chapter 3: Key Dates: 1880-1990 Chapter 4: Key Dates: 1991-2024 Chapter 5: The Plan is Population Reduction Chapter 6: American Civil War II? Chapter 7: Spiritual Transformation Addendum 1: The Fourteen Holy Helpers Addendum 2: Richard Wagner (1813-1883) Addendum 3: Jesus on a White Horse A Note on Documentation:Major sources have been indicated, but every statement made in this eBook has documentary backing which may or may not be cited. Of course, the author takes responsibility for the entire content. Also, while some of the statements in the text may be shocking to some readers, it is still necessary that they be made. Finally, the text has been reviewed in its entirety by several responsible experts, so that it is in this sense the product of a community of individuals that has been interacting for some time. **Preface** I was born in 1946 in Missoula, Montana, then the heart of one of the most wild and remote parts of the continental U.S. Mom had grown up in the wilderness around Seeley Lake, where her dad worked in the lumber camps. My dad was attending Montana State College on the GI Bill. My memories are impressionistic: a small house at the foot of a mountain, dressing up like an Indian, wandering off one night and being found by neighbors. Dad was hired by Dow Chemical, so we lived in Midland, Michigan, until the summer of 1960. It was a typical family life in a small Midwestern factory city: School and church. Baseball and football seasons. A chemistry set for Christmas. Howdy Doody on TV. But also an awakening to American history around the 8thgrade, especially Civil War history. The question of the day: Should Communist China be allowed to join the UN? The shock of Sputnick. When I was 13, Dad was transferred to a Dow/Badische plant near Williamsburg, Virginia, and life suddenly changed. We lived near the Restored Area of Colonial Williamsburg (CW) that had been created through the philanthropy of John D. Rockefeller, Jr. High school had two social classes: the town kids coming mainly from families associated with CW or the College of William and Mary, and the country kids whose families went back to Confederate days or even earlier. Of course, the schools were segregated. And moving from a place in Michigan where there were lakes, farms, and forests surrounding the town, I now lived a mile from the CIA “farm” and close to one of the largest conglomerates of Army, Navy, Air Force, and Aerospace facilities in the world.Military-industrial-complex-land! Our high school sent its top students to Ivy League universities, so I was on track for Yale. But the morning of November 22, 1963, I was called to the office, where I learned President John F. Kenney had been shot. Maybe it was a coincidence, but my life seemed like it was falling apart after that. I later started at Yale but dropped out after six weeks. Nothing there resonated. But I ended up making Phi Beta Kappa at the College of William and Mary and a career with the federal government. I’d like to mention a peculiar incident from my senior year. I was then the student head of the James Blair High School International Relations Club. Our faculty adviser had gotten us an invitation to a conference being held at the Williamsburg Lodge. We showed up, but before our group was able to attend any sessions, I got word that we had beendisinvited due to the “bad behavior” of some of our student members. It was a surprise. I had never witnessed any of this. The date was April 11, 1964. Or maybe someone was hiding something. Many years later I learned that the conference was being put on by the Bilderberg Group. At this conference there took place the first meeting between Club of Rome founder Aurelio Peccei and mega-banker David Rockefeller. It was the start of the merger between globalist finance and worldwide population reduction that is still going on and ruling world events today. From the assassination of JFK and the meeting between Peccei and Rockefeller, there is a straight line that marks the trajectory of the catastrophe that I characterize in this eBook as the start of World War III and possibly the American Civil War II. I have been a close-up witness to that trajectory, including 32 years as a federal government analyst and the years of writing I have done since then. It’swhatI have witnessed that this eBook is about. Thanks for reading. I hope you get something out of the pages that follow. Many thanks to Michel Chossudovsky and his colleagues at Global Research for publishing them. Let me know what you think. “Be Not Afraid.” **Chapter I:** **Introduction** We have seen many dire warnings that the crises in Ukraine and the Middle East risk escalation into World War III, a war between the U.S. and its “allies” vs. Russia, Iran, and China (RIC), three nations labeled by U.S. military doctrine as “threats” or “adversaries.” Not far behind on the hit list are North Korea, Syria, Venezuela, and a host of fence-sitting nations from the “Global South.” I contend that the hot phase of World War III actually began with the inauguration of U.S. President Joe Biden on January 20, 2021. A more accurate name for what the U.S. is fronting for is theAnglo-American-Zionist Empire, whose aim for over a century, as we shall discuss, has beentotalworld conquest. In today’s warnings, World War III is equated with a global nuclear conflict. Of course, since the end of World War II, a nuclear “first strike” on Russia by U.S. military planners hasneverbeen off the table. But a global nuclear conflict lies at the far extreme of the potential for devastation. If we can acknowledge that World War III hasalready begun,I contend further that the Empire and its signature globalist ideology havealready lost. The Empire in fact isimploding. The globalists are in a panicked retreat, trying to cover their rear ends with noise, threats, provocations, lies, and bluster. The number of people fooled by all this shrinks by the day. The question then becomes, what happens next? I contend that the sequelhas also already begunand is revealing itself within the U.S. as a possible American Civil War II, which is arguably a continuation of the first Civil War of 1861-1865. This should not be surprising, as history repeats itself inlong wavesthat engage the same underlying forces. Along with many Americans, Europe has also begun to liberate itself from the Empire to which it has been subservient for over a century. Even staunch backers of NATO and its pretentions, like Polish foreign minister Radoslaw Sikorski, have stated that, as quoted bySimplicius, “There is no willingness in Europe to have a war with Russia. This is an absolute red line.” Besides Russia, the focal point of the next phase of European history is likely, as we shall further discuss, the German-speaking world, where even German Chancellor Olaf Scholz, long viewed as a U.S. lapdog, is now calling for negotiations to end the crisis in Ukraine. But will the Empire blow up the world first? **Where Is the “Declaration of War”?** The more-than-semantic difficulty is that even though the U.S. has been at warwith somebodyalmost continuously since World War II, “war” has never been declared by Congress, such declaration seeming to naïve people as being required for armed conflict by that relic of bygone days, the U.S. Constitution. Instead, there have been various congressional “resolutions” authorizing force, such as the Gulf of Tonkin Resolution during the Vietnam War or the 2001Authorization for Use of Military Force (AUMF), days after 9/11. (Here we’ll refrain from talking about “false flags.”) Following 9/11, the U.S. invaded Afghanistan and Iraq, bombed Libya, and inserted proxy jihadist forces into Syria against its legitimate government, with no congressional declaration of war. These conflicts came after the U.S./U.K./NATO destroyed Yugoslavia, finishing it off with Bill Clinton’s 1999 bombing campaign against Serbia. Not to mention U.S. sponsorship of a mind-numbing quantity of “color revolutions” fomented by the CIA and other Deep State agencies, including NGOs run by the Soros gang and multiple “think tanks” like RAND, to overthrow insufficiently-compliant regimes via “democratic” street demonstrations, etc. U.S. support of jihadist groups like ISIS has also been part of the mix, including in Syria and against Russia in Georgia and Ukraine. So how in this environment of lunacy and ambiguity do you tell when a war has really begun? The problem became worse when initiatives like the Wolfowitz Doctrine (1992—see below) opened the door to preemptive attacks on countries thatjust mightbe plotting harm to U.S. “interests.” How could you even get a congressional resolution to justify that? With the aforesaid “first strike” on Russia, for instance, it would be difficult to gain the needed surprise while the action was being debated in Congress! Semantics aside, many aver that a full-blown hot world war may be in the offing, with the customary practice of the U.S. picking off what they think are low-hanging fruit not possible against the RIC. Journalist Pepe Escobar defines what is happening as a final showdown between the Empire, which he calls the “Hegemon,” and Eurasia, with the RIC at its core and the growing BRICS+ community also coming into play. Escobar writes from the standpoint of the Middle East crisis: “The Hegemon is calculating for a World War to halt multipolarity. It supports Israel’s Gaza genocide as a necessary evil to win hard in West Asia, figuring who’s going to careonce the war goes global? **Conflict inUkraine** The Ukrainian conflict is a proxy war by the U.S. and its NATO allies against Russia, most vociferously the U.K., with Ukrainian soldiers dying by the hundreds of thousands in a vain attempt to weaken Russia and bring about regime change against the leadership ofVladimir Putin. Russia would then be Balkanized into a collection of “statelets” subservient to Western economic power. The Ukrainian conflict is an extension of the West’s desire to bring about a strategic defeat of Russia and thereby gain final victory in a rivalry that began with the post-World War II Cold War, was extended through the collapse of the Soviet Union during the 1990s, and continued with the push of NATO to the borders of Russia. Next to join NATO were to be Ukraine and Georgia, with Belarus also targeted, opening the door to the stationing of nuclear weapons on Russia’s doorstep. Actually, the rivalry with Russia dates to the British “great game,” where Britain saw the expanding Russian Empire as endangering British hegemony in the Middle East and India. Napoleon tried to harness Russia in his own series of wars against Britain, an attempt which failed. The bitterly-fought Crimean War of 1853-1856 saw Russia’s southward expansion thwarted by a coalition of Britain, France, Piedmont-Sardinia and the Ottoman Empire, but Russia recovered quickly and was able to send its fleet to New York and San Francisco as a show of strength in support of the Union during the American Civil War. . State flag of Ukraine behind a wall of anonymous protesters in Kyiv, Ukraine. Events of February 18, 2014 (Licensed under CC BY-SA 3.0) . Fast forwarding to today, the current war began with the U.S.-sponsored overthrow of Ukraine’s neutral regime in the pro-Western “Maidan” coup of 2014. Then came the arming and training of Ukraine’s armed forces (AFU) by NATO, then the AFU’s assault on the Russian-speaking Donbas region of eastern Ukraine, all taking us into 2022. With this provocation, and the refusal of Ukraine, Germany, and France to uphold the UNSC-approved Minsk Accords, came the Russian invasion of Donbas in its Special Military Operation starting in February 2022. Russia had annexed Crimea in 2014, location of its Black Sea port of Sevastopol, but now followed-up with four eastern Ukrainian oblasts in 2022. Each annexation was approved locally by an overwhelming popular vote. U.S. President Joe Biden labeled the Russian invasion as “unprovoked.” It has been longstanding practice of the U.S. in war to goad the adversary into attacking first in order to persuade the voting public that the U.S. or its military was not at fault. This was done, for instance, by the Roosevelt administration when it beguiled Japan into attacking at Pearl Harbor on December 7, 1941. Something similar was done in provoking the 2022 Russian attack on Ukraine. These events are documented in my recent bookOur Country, Then and Now(Clarity Press, 2023). The U.S. and its NATO partners deny that they are “parties” to the Ukraine war. But the massive amount of money, munitions, and other forms of support, including multiple anti-Russian economic sanctions, make it clear that without continual U.S. and NATO complicity, the war would be lost by Ukraine within weeks or even days. Sanctions against Russia, along with sabotage of the Nord Stream pipelines, have weakened the economies of Germany, Britain, and the E.U., while Russia has actually benefitted from increased economic self-reliance and the opening of new markets for Russian gas and oil. The claim that the U.S. and NATO are not parties to the war is a lie perpetrated by the U.S., the U.K., and their echo-chamber media. And the fact that the war has brought two nuclear-armed superpowers face-to-face in what for Russia at least is an existential conflict may confirm us in asserting that World War III in fact is underway. It can also be said that if Ukraine falls, so does NATO, and without NATO, the U.S. must revert to being an insular power. The best assessment of the military aspects of the Ukraine conflict has come from Andrei Martyanov, whose bookAmerica’s Final War(Clarity Press, 2024) I am in process of reviewing. **Israel and the Middle East** This brings us to Israel and the Middle East. Yours truly, along with many others, were taken by surprise by the attack by Hamas against Israel, carried out on October 7, 2023. Some have stated that October 7 was a preemptive attack against an Israel already plotting a genocidal assault against the Palestinians in order to hasten the creation of Eretz Israel, the seizure of oil and gas resources along the Gazan coastline, and the building of a new canal from the Red Sea to the Mediterranean. The massive IDF retaliation, seen by much of the world as confirming its genocidal intentions against the Palestinians both in Gaza and the West Bank, showed a level of desperation unknown in Israel since the 1973 Yom Kippur War. As with Ukraine, neither Israel nor the IDF could survive a day without U.S. financial and military support, always guaranteed to be approved by the U.S. government—the president and Congress—due to the overwhelming clout of AIPAC and the rest of the Israel Lobby. This lobby is just as strong, though less overt, in the U.K. What is new to Western public consciousness is the presence in and around Israel of the “Axis of Resistance,” made up not only of Hamas, but also of non-state actors in Lebanon—Hezbollah, and in Yemen—the Houthis (Ansar Allah), plus PMU militias in Iraq, all backed by the governments of Syria and Iran. Since October 8, 2023, Hezbollah, Yemen, and Iran have exposed Israel’s vulnerability to missile assault. Emigration by its citizens out of Israel is growing by the day, with tens of thousands displaced from their homes in the north and in the south, while meanwhile the Israeli economy is collapsing. Image: President Joe Biden participates in a restricted bilateral meeting with Prime Minister Benjamin Netanyahu at the Hotel Kempinski in Tel Aviv, Israel, Wednesday, October 18, 2023. (Official White House Photo by Cameron Smith) As Pepe Escobar has indicated, the Israel government headed byBenjamin Netanyahu, seems to be trying to provoke a major regional war between the U.S. and Iran, thereby leading to a hot regional or world war. Netanyahu is backed by the U.S. Neocons, who have been agitating ferociously for war with Iran for decades. My own personal contacts with informants in the region have made it clear that they haveno doubt whatsoever, that the “settler state” of Israel is on the cusp of being destroyed. For definitive detail, see Fadi Lama’s article:Israel: The Jewish Settler State in the Levant: A Prognosis. Fadi Lama is one of the principals of the Three Sages Substack. Also see the on-line publicationThe Cradleand its series of commentaries on the war. Presently in dire jeopardy is the project some believe has been in place during the entire history of Zionism, whereby those who control the Rabbinic Talmud believe they will someday become the rulers of mankind. After all, they have already conquered America, Great Britain, and much of Western Europe ideologically. What irony if their home base—Israel—were now to cease to exist, an outcome ranked as possible, if not likely, by numerous commentators. For a more complete explanation of the historical roots of the crisis, the classic source is the late British journalist Douglas Reed’sThe Controversy of Zion. **So Has World War III Really Begun?** In my estimation, the obviously pre-planned proxy war against Russia in Ukraine, combined with the shock of the surprise conflagration in Israel and the Middle East, with both reaching the boiling point before completion of Biden’s single term of office, do in fact mark the start of WWIII. I would go further by stating that the reason the U.S. “establishment” was so anxious to prevent Donald Trump from becoming president in 2016, to impeach him after he was elected, to defeat him in his bid for reelection in 2020, to disrupt his administration through the COVID “plandemic,” and to prevent him from running again in 2024, has been becausehe was not fully on-board with the overall planin the way Obama and Hillary Clinton were, Biden has been, and Kamala Harris is now. Fully aligned with the plan are the Neocons, the legacy mainstream media, the Hollywood “stars,” and the past and present leaders of the National Security State, all bought and paid for over decades. Trump’s background is as a businessman, not a war machine mouthpiece, who proved his “unreliability” in office by refusing to engage in the long-planned assault on Syria, much to the chagrin of the war-mongers even within his own national security team. But with the U.S. behind the 8-ball with the coming collapse in Ukraine and the failure of Israel to gain the upper hand after almost a year of screamingly hideous genocidal conflict not just on its borders but within its own territory, the crazies, including Ukraine’s Zelensky, the U.K.’s Keir Starmer, and Netanyahu very well could instigate pushing of the nuclear button rather than face the nightmarish consequences of the Empire’s threatened collapse. Among the most terrifying of these consequences is the ongoing loss of U.S. dollar hegemony at the hands of BRICS+ and other nations. Slippage of the dollar strikes at the heart of the Empire’s usury-based global financial dominance and is indeed the writing on the wall. Once the U.S. government can no longer sell its debt, the fat lady has sung. The billionaires know this, which is why they are scarfing up all the derivatives in sight. The circumstances that incite the West to its present state of growing panic have been documented by Fadi Lama in his bookWHY THE WEST CAN’T WIN: From Bretton Woods to a Multipolar World(Clarity Press, 2019). For additional background, see my own analyses on VT Foreign Policy:Is World War Three About to Start? andIs World War Three About to Start or Has It Already? **Chapter 2:** **How Did We Get Here?** We cannot understand the present dilemma without reference to history. This was why I wrote my most recent book,Our Country, Then and Now.Encompassing American history from the first Puritan settlers, with extensive reference to Native Americans and blacks brought first as slaves, the story focuses on the gradual descent from various peoples’ search for freedom to today’s almost total submission to the globalists and the financial oligarchy. This oligarchy derives its power from the 500-year course of Western fractional reserve banking and the reign of usury. The following narrative is based on the sections ofOur Country, Then and Nowwhich begin in the late 19thand early 20thcenturies. It was then that the U.S. succumbed to its own greed and fear in becoming a major component of the Anglo-American-Zionist Empire; namely, that component charged with fighting and dying in the Empire’s wars. Remember what Henry Kissinger said: “Military men are just dumb, stupid animals to be used as pawns in foreign policy.” The same might be said of America’s ruling class. **Characteristics of the Empire** The Anglo-American-Zionist Empire embodied the convergence of two major historical currents: 1) the transformation of the British Empire into a larger global enterprise knit together at first by British maritime power until this expanded by the mid-20thcentury into a gigantic naval/air complex managed primarily by the U.S. military; and 2) the development of anihilist social-political constructexemplified by the Terror of the French Revolution; the appearance and growth of Communist internationalism after Marx’s publication in 1848 of theCommunist Manifestoand in 1867 ofKapital; the conquest of Tsarist Russia by Rabbinic Judaism, aka, the “Russian Revolution”; and the subversion of American consciousness by the commercialism and philistinism of a social, educational, medical, and media system controlled by the Rockefellers and other British and American oligarchs. Many were Jewish, including many in the U.S. who controlled Hollywood, liquor, and gambling. It may be puzzling to some that I include communist influences in the above list, but if you consider the concept of capitalism for the rich and communism for everyone else, this may be more clear. The net effect of these developments is today’sreign of the billionaires, combined with the near-complete subservience of the individual to the power of state/corporatist tyranny.The underlying purpose is violent world-conquest and massive larceny ofallplanetary resources. The best literary depiction of this apparatus remains the epochal novel1984. These developments began to emerge by around 1905, and through the agency of the British “clubs” and the monetary power of Cecil Rhodes and Nathaniel Rothschild and their “Round Table,” the Empire that now came into existence set out: 1) in Rhodes’s words, “to recover American for the British Empire”; and 2) to annihilate Britain’s main continental rival: Germany. Side-by-side with these measures was the growth of Zionism, which began to influence world events after the Balfour Declaration issued by the British government in 1917 granted the region of Palestine, then part of the Ottoman Empire, to the Jews as a perpetual “homeland.” It is essential to emphasize that even though the creation of Israel in 1947-1948 was claimed to be a reaction to the WWII “Holocaust,” the decision to implant a Jewish national state in Palestine was made long before. Indeed, it was part of British foreign policy well before the turn of the 20thcentury. Among the reasons the British brought the U.S. into World War I was to free a large portion of the British army stationed on the Western Front to be sent to seize Palestine from the Ottomans, with the intention of future Jewish occupation. Geopolitically, this seizure would secure the southern terminus of the “Mackinder Line,” named for a British professor, Sir Halford Mackinder, by which Britain planned to control the world’s “Heartland”; i.e., Eurasia. This line starts in the Baltic region, runs south along Poland and through Ukraine, then across the Dardanelles and Turkey to the Levantine coast. Of course, this is precisely the locale where WWIII has now commenced. (Speaking of the Dardanelles, will Turkey flip and leave NATO to join BRICS+?) Later, during World War II, British Prime Minister Winston Churchill made a secret deal with Hitler, whereby Germany would recall its North African army poised to seize the Suez Canal and Palestine, in exchange for British acquiescence in Germany’s invasion of the Soviet Union. The bringing about of this invasion with full knowledge that Germany would thereby be destroyed, was thecornerstoneof Churchill’s World War II strategy. These historical facts have been explained in Guido Giacomo Preparata’s masterfulConjuring Hitler: How Great Britain and America Created the Third Reich and Destroyed Europe. It was thedestruction of Christian Europe, with the German-speaking world at its core, that became the overriding objective of the Anglo-American-Zionist Empireand has remained so to this day. An early key to this strategy was the so-called “Russian Revolution,” carried out by Jewish forces controlled by Rabbinic Talmudism and financed by Western bankers. Again, the best source on this aspect of the world conspiracy is British journalist Douglas Reed’sThe Controversy of Zion. In fact, through World War I alone, the British-led coalition (with the paid-for help of the Bolsheviks) succeeded in destroyingfourempires with strong religious heritage: the German, the Austro-Hungarian, the Russian, and the Ottoman. We can also observe that the creation of an oligarchical anti-Christian state based on banking and finance—usury—was at the core of a long-term project of transferring priorities and practices from the Italian city-state of Venice to the rest of Western Europe that began to influence England around the year 1520. For more detail see Francis Leader’s Substack of September 3, 2024, based on a lecture by Gerry Rose entitledThe Venetian Takeover of England.Also see Francis Leader’s Substack of September 18, cross-posting “The Venetian Virus: How England Was Conquered from Within,” by H. Graham Lowry inThe Duke Report.See here. Speaking of Venice, William Shakespeare wroteThe Merchant of Venicearound 1596-1598 based on Italian sources. Shakespeare was wired into the highest echelons of English society, and we may take his drama as a warning of what was going on at a time when usury was becoming widespread. Many of England’s aristocratic youth were falling victim to both Jewish and gentile money-lenders operating freely in Renaissance London. Shylock’s “pound of flesh” was an effective symbol of the deadly stakes of the game. **Financial Hegemony** In the field of economics, the Empire’s program is to secure economic, social, and political control of the world through financial hegemony, based, as stated above, on fractional reserve banking and usury. This system, originating in Venice and now over 500 years in the making, was intended to assure the constant flow ofall money(spending power/liquidity/means of exchange) into the hands of the Western bankers. The door was opened to this historical disaster when the Papacy rescinded its centuries-long prohibition on usury under pressure from the wealthy class. The money thence stolen from society would be valued in terms of gold, with fractional reserve banking multiplying the gold into the amount of desired paper money—credit—released into circulation. The gold itself would be held by the bankers in their vaults. In time, every weekday morning a group of the wealthiest men in England would meet at the Rothschild Bank in the City of London to set the price of gold during the upcoming day’s trading. They thus controlled the monetary value of every article bought or sold in the world. The modern-day London Gold Fix was first held on September 12, 1919, to kick-start London’s gold market after the end of the First World War. For 85 years until 2004 the five member banks of the London Gold Fix would meet face-to-face at the offices of N.M. Rothschild on St. Swithins Lane in the City of London. The money thus accumulated as bankers’ profits would be selectively doled out to proxies, including the mass media to control the minds of the masses, then their incomes, living conditions, health care, food supply, etc., even their life span. The following article discloses what is likely the tip of the iceberg, or close to it.See here. A key part of population control would become the manufacture and distribution of addictive drugs by the CIA and other Deep State agencies. Closely related was the prescription drug regime of Big Pharma. The profits from both legal and illegal drug sales today support the Deep State’s “black” agenda, enrich the monetary centers, especially the City of London and Wall Street, and prop up the global financial system, always on the verge of over-extension and collapse as happened with the Global Financial Crisis of 2008-2009. **Targeting of Germany** Germany was the original target of the Empire once it had consolidated itself. Germany was targeted not only because, as everyone knows, the German Empire, formed in 1870 but with deep historic roots, was Britain’s chief naval and commercial rival, but also because Germany, during the 19thcentury, had become the focal point within Europe of numerous profound spiritual currents related to Europe’s Christian heritage. . The German colonial empire and its protectorates in 1914 (Licensed under CC BY-SA 4.0) . These currents not only promised to revitalize Christianity, but also hoped to attain breakthroughs in spiritual fields related to study of Eastern religions, including those of India, China, and Japan, tolerance and unity with Islam sheltered by a budding alliance between Germany and the Ottomans, and the appearance of advanced teachings of comparative spirituality. The latter were exemplified, for instance, by the discourses of Rudolf Steiner and the even more important teachings of Bô Yin Râ (Joseph Anton Schneiderfranken, 1876-1943), whose books garnerned over a million readers in the German-speaking world. The way had been paved by the rich traditions of German music, culminating in the works of composer Richard Wagner, German literature exemplified by Goethe, Schiller, and the Grimm Brothers, and scientist/historians like Gottfried Wilhelm Leibnitz. In the words of H. Graham Lowry. “Leibniz’s writings, particularly his essays on justice and happiness, profoundly influenced republican movements in both England and the American colonies. His ideas of universal benevolence and happiness as central to human purpose directly challenged the Venetian model of imperialism and financial control.” German philosophy had also made major breakthroughs. Immanuel Kant “had enshrined the principle of autonomous reason, of ‘always thinking for oneself,’ as the essence of the Enlightenment. G.W.F. Hegel, Kant’s commanding successor, unveiled a grandiose theory of progress, in which a World Spirit guides history toward a utopian future.” (Alex Ross,Wagnerism: Art and Politics in the Shadow of Music,p.24) Further back in history were the treasures of medieval and Renaissance mysticism, exemplified by Meister Eckhart and religious reformers like Martin Luther and the German Anabaptists. Thousands of German artists, musicians, and writers carried these teachings forward around the world, with special impact in Japan and America. The brilliant fiction of America’s greatest woman writer, Willa Cather, testifies to this movement with her persistent motifs of German thought and spirit, especially regarding Wagner. It took World Wars I & II to reduce Germany to ashes, but the German economic miracle of the 1950s and 1960s showed that nation’s irrepressible spirit. Once again today, the Empire has targeted Germany by forcing it to buy into “Project Ukraine” at the cost of its own cheap energy sources from Russia. But the failure of the Empire’s assault on Russia in Ukraine may also lead to the liberation of Germany and the rest of the E.U. from the shackles the Empire so painstakingly forged through the wars of the 20thcentury. **Uniqueness of Wagner** The great German composer Richard Wagner (1813-1883), persecuted in his youth as a social radical, had figured out the bankers’ tricks. In theRing of the Nibelung,Wagner portrayed the evil dwarf that sought to control the world through the power of the gold ring that he stole from the safekeeping of the Rhine Maidens. This ring gave power over everything in the world. Tolkien’sLord of the Ringsis the English-language version of the story. TheStar Warssagas also draw heavily on Wagner’s story lines, as well as the thematic music. The British bankers knewtheywere the evil dwarves Wagner had highlighted and that the rest of the world was finding out too. So Germany had to go. Wagner had also discovered, through his production ofParsifal,that there existed in the world an order of high spiritual guardians who kept the secret of the Holy Grail—Christ’s path to the Spirit. Access to the Grail’s sacred potency had been interrupted by human failings, but a new community of innocents was discovering it, so Wagner had to be eliminated on these grounds too. Young people especially were not to be allowed to realize that a new spiritual age was dawning, one free from the curse of materialism. Of course, today’s money masters have attempted to scare people away from Wagner by harping on the fact that Hitler liked to listen to his music. But so have millions of people around the world for almost two centuries now. Similarly, the Empire felt compelled to destroy Russian culture along with the German. A quick look at American “streaming” TV tells you what they replaced these classics with and why a majority of people today are without bedrock values. **Chapter 3:** **Key Dates—1880-1990** The Anglo-American-Zionist Empire is, above all, the Empire of the bankers, the financiers, the hedge fund owners, and the stock brokers. Everyone else slaves for them—including the managerial and professional classes, government workers, and the military—besides, of course, the workers. Among the key dates marking the modern history of the Empire, since just before the turn of the 20thcentury, are as follows: 1880-1902:Boer Wars complete theft of South African gold and diamond wealth by British Empire from Dutch and native occupants, with African colonies now under control of the Rothschild banking conglomerate and the Cecil Rhodes-funded Round Table. At the same time, the Zionist movement, originating in Eastern Europe, joins with the British government in advancing plans for creation of the state of Israel. Prior to Zionism, three million European Jews had successfully migrated to the U.S. and were peacefully assimilating as hardworking law-abiding citizens withno thoughtof a Jewish national state. For them the “Promised Land” was America. While some later donated money to the settlement of European Jews in Palestine, virtually none had an interest in ever moving there, much less a terrorist war to seize the land from its occupants. 1902-1909:Anglo-American Pilgrim Society is formed to advance imperial agenda and assure Cecil Rhodes’ dream of “recovering America for the British Empire.” Program implemented to control U.K./U.S. mainstream media as instrument of mass propaganda in support of imperial financial hegemony and worldwide colonialism and wars of conquest. Key U.S. imperial propaganda organ was, and remains, theNew York Times. 1913: Federal Reserve Act and Revenue Act are passed by Congress through influence of Rothschild interests combined with U.S. Money Trust run by Morgans and Rockefellers. (The Rothschildswrotethe Federal Reserve Act.) Main purpose is to channel U.S. industrial wealth into credit advanced to Britain and France to fight war of annihilation against Germany. These measures transfer monetary and financial policy and consequently economic policy in the U.S. to private bankers. Thus, effectively, the U.S. was no longer a sovereign state, but a vassal of the money powers. Additional purpose is to finance Rabbinic Talmud assault against the Russian monarchy, aka, the “Bolshevik” or “Russian” Revolution. Era of mass multigenerational genocide against Russian Christian population follows, with tens of millions killed. 1914: World War I begins. British diplomacy has created the Triple Entente, consisting of Britain, Russia, and France, to assure that the planned “Great War” will force Germany to fight on both Eastern and Western fronts. Germany attacks westward through Belgium to assure a quick knock-out, but conflict bogs down into trench warfare protracted to bleed Germany economically. Britain manipulates U.S. into joining war in Europe so it can send its army to take over Palestine from the Ottomans. U.S. propaganda machine goes full-bore to paint Germans as the “Hun” and imprisons dissenters. U.S. peace movement is led by Republican politicians like Charles Lindbergh, Sr., but is suppressed. Wall Street speculator Bernard Baruch takes over and runs U.S. war economy. 1916: President Woodrow Wilson, a bankers’ puppet who signed the Federal Reserve Act, is reelected on the campaign slogan, “He kept us out of war.” U.S. enters war on Allied side soon afterwards. 1917-1919: Britain issues Balfour Declaration promising Palestine to the Zionists as a future Jewish “homeland” and assures through the Treaty of Versailles that Britain will control Palestine as a League of Nations “mandate.” The treaty imposes a crushing peace on Germany, setting the stage for another world war with Germany still the target. 1921-1929:U.S. profits from financing the war have caused large amounts of gold to be transferred from Britain and Europe that now fuel the “Roaring Twenties” buoyed by banks lending “on margin” to inflate the stock market. The Bank of England crashes the market when the Federal Reserve agrees to restore gold to Britain. The Great Depression follows.Franklin D. Roosevelt, elected president in 1932, confiscates privately-owned gold, removes the U.S. from the gold standard, and finances social and economic recovery programs with large infusions of government debt. 1933:Hitler is named chancellor of Germany as the Depression hits, following a lengthy preparatory period where Anglo-American capital provides means to rebuild Germany’s war machine. Britain and the U.S. also secretly arm the Soviet Union. The aim is to finish off Germany by instigating a German attack on the Soviet Union. British deceptive diplomacy leads Hitler on by appearing to “appease” territorial ambitions. Hitler swallows the bait. 1939-1941:As World War II starts in Europe, the American “internationalists” assert themselves by tarring the anti-war movement with the label “isolationist.” Meanwhile, the U.S. arms Britain, France, and the Soviet Union through Lend-Lease, while goading Japan to attack in the Pacific. Government debt and war budgets eliminate unemployment while creating huge standing army of uniformed military, defense contractors, bureaucrats living off the federal budget deficit, and ordinary citizens dependent for a living on government payments. Enough of these people vote Democratic to assure Roosevelt’s election in four consecutive presidential contests. 1940-1941: Using Rockefeller Foundation funding, the Council on Foreign Relations develops a series of studies that it submits to the government advocating that the U.S. establish a permanent policy of gaining and maintainingglobal military supremacy. This policy is implemented as the central U.S. war aim and is never rescinded. Nevertheless, Roosevelt himself favors downsizing of the British Empire and a global balance of power among the U.S. and its Western allies, with the Soviet Union in Europe, and China in Asia. This policy is implemented through the U.N. charter and Security Council membership for the U.S., Britain, France, the Soviet Union, and China. However, Roosevelt dies, and Truman drops atom bombs on Japan, sets up the National Security State, commences the Cold War against the Soviets, recognizes Israel, and goes to war in Korea. 1945:World War II leaves Germany and Japan in ruins, while the U.S. and Soviet Union share the spoils of war. The U.S. now has the world’s greatest industrial plant, while the Soviet Union controls much of Europe. The Soviets also prepare to transfer fighters and weapons for Jewish gangs to conquer Palestine with financial help from U.S. Jews. Britain facilitates the founding of NATO and induces the U.S. to rebuild Germany via the Marshall Plan. World financial control continues to rest with the City of London, which backs U.S. dollar hegemony through Bretton Woods, the IMF, and the World Bank. The U.S. will need dollar hegemony to finance the war machine. 1948: Israel expels 700,000 Palestinians in its terrorist Nakba and declares its statehood as a Jewish settler state. Israel is recognized immediately by the Soviet Union and the U.S. With Churchill having declared the existence of the “Iron Curtain,” the Soviets are now pushed out of the “Western Alliance.” The Anglo-American-Zionist Empire has taken its final form, with the U.S. creating the CIA and the National Security State to engage the Soviets in what will become the Cold War. The U.S. and the Soviets jostle for position in Korea, the Middle East, Africa, and along the East-West divide in Europe. 1953: U.S. inaugurates era of CIA “regime change” operations by overthrowing the elected president of Iran, Mohammad Mossadegh. U.S., Britain, and France divide up Iran’s oil assets. 1961: President Dwight Eisenhower warns of the growth in power of the “military-industrial-complex.” Election of John F. Kennedy as president is followed by Bay of Pigs invasion, Kennedy’s vow to “break the CIA into a million pieces,” Cuban Missile Crisis, and Kennedy’s American University address for world peace. Victory of the National Security State over the last semblance of authentic American democracy is assured by its assassination of President Kennedy in 1963. Not by coincidence, Kennedy was coming out in opposition to a U.S. war in Vietnam and in the acquisition by Israel of nuclear weapons. 1963-1974:Vietnam War leaves Southeast Asia in ruins and American society profoundly divided between the establishment war machine and a growing anti-war movement. CIA attacks youth with MK Ultra mind-control program and promotion of illicit drugs like LSD. CIA sponsors illegal drug epidemic in American cities. CIA Project Mockingbird fastens ironclad control on mass media in favor of war and financial exploitation worldwide. 1964:Club of Rome founder Aurelio Peccei and banker David Rockefeller meet in Williamsburg, VA, at Bilderberg Conference to begin the merger between globalist finance and worldwide population reduction. 1965-1968: Assassinations of Malcolm X, Dr. Martin Luther King, Jr., and Robert Fitzgerald Kennedy, Jr., profoundly affect American society and culture and cement growing control by globalists and Deep State. 1974:Resignation of President Richard Nixon after CIA set-up. Nixon had been trying to rein in power of CIA after working with National Security Adviser Henry Kissinger in reaching rapprochement with Russia and “Opening to China.” 1973: David Rockefeller founds the Trilateral Commission to begin movement toward globalist control of world economy via division among U.S., Europe, and Japan. This is the era of growing power of secret societies and behind-the-scenes control of events by shadow groups like Bilderberg, the Rockefeller and other tax-exempt foundations, “think tanks” like RAND and the Council on Foreign Relations, the World Economic Forum (founded in 1971), National Endowment for Democracy, NGOs like George Soros’s Open Society Foundations, etc. Combined with secret maneuvering of Deep State agencies like the CIA and NSA, secrecy by the Federal Reserve and globalist corporations, plus massive involvement of the U.S. military in development of biological and chemical weapons, the U.S. population, along with much of the world, is under near-total influence and control of hidden forces accountable to no one except hidden financial, military, and intelligence power centers. 1979: Islamic Revolution takes place in Iran, whereby Iran becomes the first major nation to break away from control by the Empire. In Afghanistan, CIA begins funding of Al Qaeda to fight Soviet presence. CIA funding startedbeforeSoviets entered Afghanistan to create a Vietnam for the Soviets. The Soviets were subsequently invited to enter by the Afghan government. Beginning of large-scale funding of jihadist groups by Empire to launch terrorist attacks against its enemies in the Islamic countries of Southwest Asia, the Caucasus, Central Asia, and North Africa, most recently being ISIS in Iraq and Syria. 1980s-1990s: Era of financial deregulation—leveraged buyouts, stock buybacks, explosion of hedge funds, Michael Milken junk bond scandal, repeal of Glass-Steagall, etc. Monetary assaults take place against SE Asia, Africa, and Latin America, particularly Mexico. We now see the complete conversion of the U.S. economy to one of Wall Street financial control and the corresponding takeover of governance by the rentier class. Middle class wealth also shifts from home ownership to stock market assets with conversion of savings and retirement accounts to tax-deferred programs. 1981: “Reagan Revolution” and formation of Neocons through merger of two cadres: Staff members of Senator Henry Jackson (Rumsfeld, Cheney, etc.) and “Straussians”—revolutionary followers (Trotskyites) of University of Chicago professor Leo Strauss who avers that only with U.S. global conquest will Israel be safe. The Neocons begin today’s rule of U.S. foreign policy in support of the doctrines of endless war, globalist economic control, and repression of traditional Christian faiths and nationalistic socio-economic ideals. Conversion of U.S. to Venetian finance-usury model is complete. 1986: Murder of Barry Seal, chief CIA drug and weapons smuggler out of Mena, Arkansas, after Governor Bill Clinton opened state to be drug and arms conduit between U.S. and Central America. Clinton, a Rockefeller favorite and Rhodes Scholar, told by CIA operatives that he was in line to become president. 1988: Former CIA director George H.W. Bush elected president. Neocons cement control of U.S. military and foreign policy with Dick Cheney as secretary of defense. 1990:Iraqi attack on Kuwait becomescasus bellifor first Iraq War when U.S. under Bush invades in “Operation Desert Storm.” Invasion halted before reaching Baghdad, leaving Saddam Hussein in power. 1990s: Simultaneously with takeover of U.S. foreign policy by Neocons, the Israel Lobby, headed by AIPAC (founded 1954), takes effective control of U.S. Congress. Representatives entering Congress swear fealty to Israel and are assigned a “minder” to assure compliance. Rep. Thomas Massie has stated he is the only current Member of Congress without a “minder.” 1990s:Rapid development of vaccines as what billionaires view as a means of societal control, Big Pharma enrichment, and population reduction through a vast drop in male fertility, threatening mankind. Also, growth of stress-related chronic illness, deaths from iatrogenic causes, and deaths and injuries from adverse drug reactions, including explosion of autism in children. **Chapter 4:** **Key Dates: 1991-2024** 1991: Fall and breakup of Soviet Union as U.S.-managed “shock therapy” leads to massive sell-off of Russian state assets to oligarchs and Western bankers. Russian economy and standard of living crash under CIA-sponsored Boris Yeltsin presidency. Empire’s dream of destruction of Russia now in sight. 1992: Wolfowitz Doctrine promulgated in expurgated and unexpurgated editions, stating U.S. intentions for world military domination in Neocon update and extension of earlier CFR pre-World War II declarations. Paul Wolfowitz is deputy secretary of defense under Secretary of Defense Dick Cheney and a leading Neocon ideologue. With the Soviet Union now defunct, the Empire moves a giant step toward planned world conquest. 1992: Bill Clinton elected president. North American Free Trade Agreement commences major period of U.S. industrial outsourcing to Third World nations. By the end of Clinton’s term, China is included as outsourcing haven, launching era of global supply chains as determining factor in world economy. U.S. and U.K. have now completed their shift to financialized service economy. E.U. nations follow suit, except for Germany, which remains Europe’s only manufacturing hub. 1993: Clinton signs National Voter Registration Act mandating that all social service programs include a voter registration component that opens the door for large numbers of legal and illegal immigrants to become voters. Later Obama opens social service programs to non-citizens. Combined with today’s open borders and unlimited illegal immigration presided over by Biden Administration, the stage is set for endless stealing of elections by the Democratic Party. Padding the voter rolls with immigrants is a time-honored Democratic ploy. 1994: Articles 8 and 9 of the Uniform Commercial Code (UCC) which are concerned with investment securities in the U.S. are modified in all 50 states. The modifications effectively remove personal ownership of securities and allow “Protected Class” to have first rights to collateral. This is explained in detail by David Rogers Webb inThe Great Taking.Similar commercial laws are enacted in the E.U. by 1998. 1996: Telecommunications Act allows consolidation of media companies to the point where five now own 90 percent of U.S. communications media. Today the consolidation extends to the internet where Facebook and Google account for over 70 percent of users directed to the websites of major news publishers. U.S. mainstream media, including social media, now under complete control of Deep State. 1998: Military funding of Google and start of the National Surveillance State. Hidden government infiltration of the internet and social media lead to ongoing long-term societal degradation of education, religion, and individual consciousness, along with disappearance of personal privacy. 1999: John F. Kennedy, Jr., along with his wife and her sister, die in crash of his private plane while approaching a landing at Martha’s Vineyard airport. Government claims the crash resulted from pilot error, but allegations persist that the plane had been sabotaged and that Kennedy had been assassinated as he was about to start a political career. 1999: Vladimir Putin succeeds Yeltsin as president of Russia. Rebuffed in trying to join NATO, Russia under Putin begins long-term program of state-sponsored economic recovery and military rebuilding. 2000s arms race with the U.S. leaves Russia ahead in missile technology, industrial weapons production, and other elements of land warfare, nuclear weaponry, and strategic air defense. Undercurrent of cyberwarfare grows steadily with increased reach of internet, spy satellites, etc. 2001: Shanghai Cooperation Organization (SCO) forms as a Eurasian political, economic, international security, and defense organization established by China and Russia. Other member states are Kazakhstan, Kyrgyzstan, Tajikistan, Uzbekistan, India, Pakistan, Iran, and Belarus. 15 other states are observers or “dialogue partners,” and six more have applied for membership. U.S. application for observer status rejected in 2005. 2001: U.S. Full Spectrum Dominance is first defined in April 2001 as: “The cumulative effect of dominance in the air, land, maritime, and space domains and information environment, which includes cyberspace, that permits the conduct of joint operations without effective opposition or prohibitive interference.” This is the operative iteration of the 1939-1941CFR plan for total U.S. global military dominance and the Wolfowitz Doctrine of 1991. Full Spectrum Dominance hasnotbeen achieved. 2001: Project for a New American Century (PNAC) had called for a new “Pearl Harbor,” followed by 9/11 “terrorist” attacks and the plan for regime change against seven Middle Eastern countries, to culminate with Iran. U.S. Secretary of State General Colin Powell lies to U.N. about Iraq’s alleged possession of weapons of mass destruction. 2001-2003, wars against Afghanistan and Iraq begin. 2006: Former Vice-President Al Gore publishesAn Inconvenient Truth,advancing the Climate Change/Global Warming hoax which spreads the deception that “Global Warming” is caused by release of man-made emissions into the atmosphere, threatening a CO2 overload that will result in global extinction. This lie forms the basis for proposals of massive societal changes with the outlook of crashing the global food supply and causing worldwide famine. The WEF and related elite groups seize on Climate Change/Global Warming as a primary means of population reduction planning. 2006: Christians United for Israel incorporated by Rev. John Hagee, completing Christian Zionist support of Israel. Christian Zionists, their leaders often funded by Israel, fully swallow “dispensationalist” hoax, causing them in many cases to become cheerleaders for Armageddon. 2006: Julian Assange founds Wikileaks. In 2010, Assange publishes leaks about military war crimes from former U.S. Army intelligence analyst Chelsea Manning. After gaining refuge in Ecuador’s London embassy, Assange is arrested by British police and detained until 2024, when he is released through a plea deal with the U.S. Edward Snowden leaks documents in 2013 from his job with the NSA showing massive illegal government surveillance of individuals. Snowden gains refuge and later citizenship in Russia. 2007: Anticipating election of a Democratic president, former Bill Clinton DOD staffers found Center for a New American Security (CNAS) “to restore America’s credibility, influence, and power in the world and, in so doing, strengthen America’s national security.” Founders state: “The next president will have to convince the American people and their representatives in Congress to reject the neo-isolationist impulses they may feel in the wake of Iraq in order to embrace a smarter and more selective form of engagement….The United States has been and will continue to be the preeminent leader in the international community, and we cannot protect or advance our interests in a globalized world if we do not continue to serve in that role.” Funding for CNAS is provided by Boeing, General Dynamics, Lockheed Martin, Northrop Grumman, and Raytheon.See this. 2008: Housing bubble, caused largely by Federal Reserve and rating agencies’ promotion of “liars’ loans,” leads to a global financial crash that turns into the “Great Recession.” Barack Obama, elected U.S. president on slogan of “change,” oversees multi-trillion-dollar bailouts of banks and financial corporations like AIG. Federal Reserve reduces interest rates to near-zero while buying massive amounts of U.S. government debt under program of “quantitative easing” that continues today. With $35 trillion in debt, much held in limbo by the Federal Reserve, the U.S. government is functionally bankrupt. 2009: The “Good Club,” a gathering of U.S. billionaires led by Bill Gates, David Rockefeller, and George Soros meets at Rockefeller University in New York to continue planning for worldwide population reduction. Group has been meeting for a decade. (SeeOur Country, Then and Now,p. 428.) 2009: BRICS founded among Brazil, Russia, India, China, and South Africa, to create a new economic alliance among non-hegemonic nations. One goal of BRICS is to replace the U.S. dollar with trade in national currencies. Iran, Egypt, Ethiopia, and the UAE have subsequently joined, leading to BRICS+, with many more nations applying. 2009-2017: President Barack Obama is awarded Nobel Peace Prize. Obama’s subsequent wars include2011 attack on Libya with assassination of Gadaffi, 2014 Maidan coup in Ukraine, failed regime change in Syria, multiple color revolutions, including “Arab Spring,” targeted drone assassinations, etc. 2013: Resignation of Pope Benedict XVI after U.S. cut off Vatican from SWIFT payment system. Benedict is forced out due to his conservative positions on theological and social issues and replaced by Jesuit neoliberal Pope Francis. Several key opponents of Pope Francis are expelled from the church. 2016: Republican candidate Donald J. Trump elected president through votes from what defeated candidate Hillary Clinton calls “Deplorables.” Clinton campaign falsely claims Russia threw the election to Trump. The “Shadow Men,” globalist enforcers identified inOur Country, Then and Now,start series of “lawfare” attacks on Trump, including two impeachments, that continue after Trump loses the presidency in 2020 to Joe Biden. 2017: President Donald Trump announces that the United States would cease all participation in the 2015 Paris Agreement on “climate change” mitigation, contending that the agreement would undermine the U.S. economy, and put the U.S. at a permanent economic disadvantage. 2020: On January 30, the World Health Organization announces a global emergency due to spread of COVID-19. On March 13, President Donald Trump declares a nationwide emergency and issues an additional travel ban on non-U.S. citizens traveling from 26 European countries due to what many will later call the COVID-19 “Plandemic.” Introduction of mRNA vaccines results in millions of excess deaths worldwide. COVID lockdowns shatter U.S. economy, destroying small businesses and causing massive unemployment. 2020: Death of George Floyd in Minneapolis followed by BLM and Antifa-instigated riots across U.S. 2020:Election of Joe Biden as president. FBI lies about authenticity of “Hunter Biden laptop” with incriminating content as Biden campaign solicits claims by former security officials that the existence of the laptop is Russian disinformation. 2020: Consumer price inflation hits hard, especially in food and housing, fed by $2 trillion in COVID relief payments to individuals and businesses. Not by coincidence, stock market soars with huge capital gains accruing to individual investors, Wall Street, retirees, and non-profits with stakes in the financial markets. Federal deficit pushes to $35 trillion, including nearly $200 billion in arms and aid to Ukraine and Israel. Rising Federal Reserve interest rates add to deficit. 2021: January 6 pro-Trump rally at U.S. Capitol turns violent with Trump then charged in his second impeachment. In April, Biden withdraws U.S. forces from Afghanistan but supports large-scale Ukrainian artillery attacks on Russian-speaking civilians in east of country. 2021: Biden opens southern border to deliberate influx of millions of illegal immigrants, large numbers being military-age men. Vice-President Kamala Harris called “Border Czar” by media but takes no effective action. 2022: Russia commences its Special Military Operation against Ukraine. U.S. stands accused of surreptitiously blowing up German-Russian Nord Stream pipelines in Baltic Sea or at least allowing it to happen. Conflict in Ukraine becomes largest European military conflict since World War II. Europe slips toward recession due to skyrocketing energy costs resulting from loss of cheap Russian gas and oil. U.S./U.K./E.U. decree vast number of sanctions against Russia, including expulsion from SWIFT, in failed attempt to destroy Russian economy. 2022: Russia announces discovery of U.S.-funded bioweapons labs in Ukraine that conduct research into microbes specifically targeting Slavic gene pools. 2022: Ukraine and U.S. hedge fund BlackRock, world’s largest asset manager, announce joint plan to “focus in the near term on coordinating the efforts of all potential investors and participants in the reconstruction of our country, channeling investment into the most relevant and impactful sectors of the Ukrainian economy.” Ukrainian President Zelensky thanks BlackRock CEO Larry Fink “for the work of the professional team that BlackRock has allocated to advise on structuring the reconstruction projects.” BlackRock investments start with preparations to purchase vast quantities of prime Ukrainian farmland. 2023: Robert F. Kennedy, Jr., launches campaign for the presidency of the U.S., seeking first the Democratic nomination but switching to becoming an independent after being blocked from participation in Democratic Party primaries. Kennedy had published best-selling exposé of the misdeeds of Anthony Fauci in his book,The Real Anthony Fauci, Bill Gates, Big Pharma, and the Global War on Democracy, and Public Health. 2023:Hamas attacks Israel in Gaza region on October 7. Israel retaliates with genocidal attacks against Palestinians in Gaza and West Bank. 2024:Biden withdraws from presidential campaign in favor of Vice President Kamala Harris, completing acoup d’etatby Democratic Party managers. As Dr. Naomi Wolf wrote on her “Outspoken” Substack on August 21, 2024, advocating for RFK, Jr. to merge his campaign with that of Donald Trump: “But since a coup has taken place in the United States of America, with between 18 and 30 million military-age men deployed around our nation, including at strategic locations, likely awaiting direction; and since the coup was engineered by the DNC, with help from our enemies, I no longer think that it is partisan for me to advocate for those leaders and alliances that can restore our Republic and our freedoms.” 2024: Looming Russian victory in Ukraine, coinciding with U.S. loss of arms race to Russia, especially in strategic air power and air defense. 2024:Failure of U.S. weapons in support of Ukraine explodes myth of U.S. Full Spectrum Dominance, followed by the Gaza war, internal collapse of Israeli economy, looming IDF defeat at hands of Axis of Resistance, including Hezbollah in Lebanon and Houthis in Yemen, and pending civil war between Netanyahu reactionary government backed by orthodox militants vs. liberal elements of IDF and Israeli political elite. Large-scale emigration out of Israel continues by Jewish citizens, with close to 100,0000 residents displaced by fighting. 2024: Evidence continues to mount worldwide that billions of people have been poisoned by COVID vax, leading to rising death tolls from turbo-cancers, myocarditis and heart failure, amyloidosis, and “Long-COVID” effects.See this.Deaths and injuries have also resulted from COVID medical treatment protocols, denial of known COVID remedies, and Draconian lockdown policies. Evidence also rises of aggressive globalist plans to crash world economy via carbon-capture, banning of meat, sequestering of farmland, and other attacks on the world food supply.See here. 2024: USDA prepares policy to implement the Sustains Act, determining who will own “environmental services” like the air we breathe, plant photosynthesis and pollination, and the health benefits of “open space.” Viewed critical for UN “sustainable development” agenda. 2024: Attempted assassination of Donald Trump during campaign rally in Butler, Pennsylvania, on July 13. RFK, Jr., suspends campaign and endorses Trump, as does former Democrat and presidential candidate Tulsi Gabbard. 2024: “Debate” between Donald Trump and Kamala Harris on ABC Network discloses Democratic Party intention to use biased mainstream media to steal 2024 election, combined with growing reports of use of illegal immigrants as fronts for election fraud. Col. Douglas McGregor forms group called Our Country Our Choice to contest expected fraud along with other citizens’ groups fearing a “Black Swan” event. Trump refuses any further “debates.” 2024: In response to threats by U.S. Secretary of State Antony Blinken and British Prime Minister Keir Starmer, Russian President Vladimir Putin announces that any Western aid to Ukraine in launching long-range missiles into Russian territory will be considered an act of war. Putin said: “This would mean that NATO countries, the United States, European countries, are at war with Russia. And if that is the case, then bearing in mind the change in the very essence of this conflict, we will take appropriate decisions based on the threats that will be posed to us.” In the spirit of “Let’s you and him fight,” Starmer is reading from the same script in trying to provoke war between the U.S. and Russia as was followed by British leaders in their actions of getting the U.S. to fight World War I and World War II against the Germans. 2024: An employee of ABC News who blew the whistle on the Trump-Harris debate being “rigged” is killed in a car accident near Bethesda, MD, the morning of September 13. Employee had filed a sworn affidavit the day before the debate alleging that Harris had been provided questions in advance, certain topics had been ruled off-limits, Trump but not Harris would be “fact-checked,” Harris’s podium would be smaller than Trump’s, certain camera directions flattering to Harris would be followed, etc. For detailsSee here. 2024: Second attempted assassination of Donald Trump with arrest of accused shooter at Trump’s West Palm Beach, Florida golf club where Trump was playing. Shooter, identified as Ryan Wesley Routh, age 58, a vehementUkraine partisan, captured after fleeing the scene with shots fired by the Secret Service. Suspect reached 300-500 yards of the former president with a scoped AK-47 rifle. “As to why the would-be assassin was able to get that close to the former president despite a previous assassination attempt on him in June, the authorities said that the security perimeter could only be so wide due to him being a presidential candidate as opposed to a sitting president.” Was Routh part of a Deep State plot to kill Trump and blame it on Iran?See here. 2024: September 17-18 attack on Lebanon with thousands of exploding pagers attributed to Israel. Pagers originating in Hungary delivered to Hezbollah. Thousands injured or killed. 2024: In obvious election ploys favorable to Democrats, Federal Reserve cuts interest rates and gasoline prices slashed. **Chapter 5:** **The Plan Is Population Reduction** This brings us to the inescapable observation that the quintessence of the Empire’s plan has been to assure the permanent wealth and power of its ruling billionaires by drastic reductions in the world’s population. The process has been underway since the 1960s, when it was discovered that gain-of-function bioengineering could be performed on viruses to make them more lethal. The population could also then be frightened into taking an increasing diet of harmful vaccines. In a 1981 French book entitledL’Avenir De La Vie(“The Future of Life”), author Michel Salomon, a journalist and doctor, quoted Jacques Attali, who at the time was an adviser to socialist French President François Mitterrand, who said: “In the future it will be about finding a way to reduce the population. We will start with the old, because as soon as he is over 60-65 years of age, man lives longer than he produced and costs society dearly. Then the weak and then the useless who do nothing for society because there will be more and more of them, and especially finally the stupid ones.” This quote from Jacques Attali, adviser to a prominent left-wing European politician, exposes what is essentially an atheistic/materialistic perspective on human life. This reduces human beings to slaves working in a societal anthill controlled by the state.1984again. This is precisely the perspective that is projected today by the Western mass media and the military-industrial complex that rules the Anglo-American-Zionist Empire and its vassals in Europe and elsewhere. It is the perspective of the ruling billionaires. Attali continued: “Euthanasia targeting these groups, euthanasia will have to be an essential instrument of our future societies, in all cases. Of course, we cannot execute people or set up camps. We will get rid of them by making them believe it is for their own good. Too large a population, and for the most part unnecessary, is something economically too expensive.” The country that is furthest along in sponsoring state-supported euthanasia is Canada. In fact, one is inclined to think that this may be the best Trudeau’s totalitarian brand of globalism can offer. In other countries, including the U.S., hospitals clearly have a role in culling the elderly population, especially with the COVID “plandemic.” Death from iatrogenic illness is often facilitated or even planned, as happened during the “plandemic” with protocols handed down to hospitals by the CDC. There are ER nurses who call these protocols murder. More from Attali: “We will find something to cause it, a pandemic that targets certain people, a real economic crisis or not, a virus that will affect the old or the big [sic], it doesn’t matter, the weak will succumb to it, the fearful and the stupid will believe it and ask to be treated. We will have taken care to have planned the treatment, a treatment that will be the solution. The selection of idiots will thus be done by themselves: they will go to the slaughterhouse on their own.”Source: Robin Westenra Substack: September 4, 2024. Reportedly, Henry Kissinger said something similar at a 1990s conference: that once people are made to accept vaccines, it’s “game over.” Added to this horror since then would be the coming likelihood of famine induced by “Climate Change/Global Warming” hysteria and the move within Western nations toward deindustrialization. The attempt by Western nations to produce famine through deindustrialization has been exposed by the writings of Matthew Ehret, editor-in-chief of theCanadian Patriot Reviewand Director of the Rising Tide Foundation. See in particular Ehret’s September 17, 2024, article,BRICS+ vs. the WEF: The Clash of Two Green Paradigms. Ehret starts by recalling China and India’s derailing of the 2009 COP14 agenda in Copenhagen, “which had promised to establish legally binding emission cuts to guide the de-carbonization (and deindustrialization) of much of society.” Ehret continues: “Amidst a supposed pandemic and economic meltdown, puppet leaders like Sarkozy, Merkel, and Obama championed a new era of green global governance and promised to consolidate a legally binding treaty to enforce decarbonization onto the nations of the globe. But it didn’t happen.” Ehret goes on to contrast the plans of BRICS+ for sustainable development based on advanced technology, including nuclear, vs. the “neo-Malthusian” intent of the Western powers to kill off much of mankind by literally returning to the pre-industrial era. On the CO2 “carbon capture” hoax, see Dr. Lewis Coleman’s articleHere.In Britain, thousands of elderly people are expected to die in the approaching winter due to the government’s having withdrawn the annual winter fuel allowance as part of its “green” agenda.See here. In fact, disease, vaccines, and famine are the most favorable methods yet discovered by the elite to engineer massive population reduction in a short period of time without the people of the world become wise to what is going on until it is too late. War, while not eliminated, has been proven to be less effective, more expensive, and too risky to the perpetrators. **Testimony of Robert F. Kennedy, Jr.** On COVID, presidential candidate Robert F. Kennedy Jr. has said, “The COVID pandemic was used to fundamentally change the relationship between U.S. citizens and their government. The government’s public health response was not a medical response, but instead a test of technocratic power to see how the population would respond to totalitarian edicts masked as medical interventions. The government also selected the lockdown winners and losers, transferring nearly four trillion dollars in wealth from the middle class and small business to Silicon Valley and big box stores.” **Testimony of Dr. Francis Boyle** In a Florida case filed by Dr. Joseph Sansone involving anEmergency Petition for a Writ of Mandamusthat seeks to compel Governor DeSantis to prohibit the distribution of COVID 19 injections in the state of Florida. Dr. Sansone stated: “Dr. Francis Boyle, the Harvard educated law professor that drafted the 1989 Biological Weapons and Antiterrorism Act, which passed both houses of Congress unanimously, provided an affidavit stating that COVID 19 injections and mRNA nanoparticle injections violate the law he wrote. Dr. Boyle asserted that ‘COVID 19 injections,’ ‘COVID 19 nanoparticle injections,’ and ‘mRNA nanoparticle injections’ are biological weapons and weapons of mass destruction and violate Biological Weapons 18 USC § 175; Weapons and Firearms § 790.166 Fla. Stat. (2023).” **Testimony of Dr. Meryl Nass** Dr. Meryl Nass is an internist residing in Maine whose medical license was suspended by the state for the entirely legal practices of prescribing ivermectin and hydroxychloroquine to COVID patients. While contesting the suspension, Dr. Nass has been publishing a massively popular Substack blog, attending major conferences worldwide, and has founded a 501c3 organization and website calledDoor to Freedomthat states: “We exist to help people make sense of a rapidly changing world, to stop efforts by the WHO and UN to centralize control during emergencies, and to preserve traditional farming and the production of healthful foods.” On the origin of COVID, Dr. Meryl Nass stated in her August 23, 2024, Substack: “I have always said that the two COVID origin issues are: Whether it was a lab leak or a deliberate release. I favor deliberate but I’m not certain. Next question would be who did it, if deliberate. “I have pointed out that the humanized mice that probably were used to design SARS-CoV-2 came from [Ralph S.] Baric’s lab [in North Carolina] originally, but were shared with the Chinese. The ‘no-see-um’ technology came originally from Baric. Other U.S. coronavirus researchers who may have created part or all of the genome of SARS-CoV-2 include Stanley Perlman at Ames (U Iowa), Vince Munster at NIH’s Rocky Mountain lab, or Vineet Menachery in Galveston, Texas. I could be missing some. There are others scattered around the U.S. and the rest of the world. “There were so many interesting areas of the genome (by that I mean created/selected for inclusion by humans), I think it was stitched together from parts that probably were developed in multiple labs. Who put the finishing touches on it? I don’t know. “Ifit leaked, it likely leaked from a Wuhan lab.Ifit was a deliberate spread, it could have come from the Americans or anywhere, originally, and may have been spread only in Wuhan or in multiple locations. “The issue is alwayscui bono. Who benefited if this was a crime, as I suspect it was, $4 trillion moved from the U.S. poor and middle classes to the billionaire class. Potentially quadrillions are up for grabs if you impoverish the world, tokenize nature, find ways to grab our property, etc., and the super elite take over the planet’s assets.” **Testimony of Dr. Lewis Coleman** In a personal communication, a summary of the current situation has been offered by Dr. Lewis Coleman, the third principal of the Three Sages, along with Fadi Lama and myself. Dr. Coleman is author of the seminal work50 Years Lost in Medical Advance: The Discovery of Dr. Hans Selye’s Stress Mechanism. Dr. Coleman writes: “The only legitimate purposes of government are to protect its population from crime and other governments and provide a universal medium of exchange to optimize technological and economic advance. Unfortunately, government is little more than a disguised mafia on steroids that primarily serves the interests of those who control it. When it comes to their political mischief, anything is possible. “Starvation has often been employed to destroy populations for various reasons, none of which are justifiable. Eisenhower starved thousands of captured and surrendered German soldiers to death by penning them up in barbed wire enclosures without adequate food, clothing, and shelter. Mao Tse Tung starved more than 60 million Chinese to death in the early 1960s, apparently at the behest of Western ‘banksters’ to whom he was beholden for armaments and financial support. Pol Pot liquidated millions in Cambodia for unknown reasons. Stalin starved the Kulak farmers in Ukraine to eliminate their resistance to his communist plans (which didn’t work). Sherman slaughtered the buffalo to conquer the Indians after his infamous march through the South starved the Confederacy into submission. “However, I expect that the method of choice will be more versions of the COVID conspiracy, such as the ‘monkeypox’ and bird viruses that already lurk in government laboratories, along with their lethal mRNA injections that are being prepared even now. Never before has a government inflicted so devious and perverse a form of mass murder on its own population. The American public remains so innocent and naive that the majority of citizens are still totally trusting and unsuspecting. They are virtual ‘sitting ducks’ and lambs awaiting their slaughter. They will ignore the warnings.” Dr. Coleman adds in a separate communication: “Big Pharma is committing mass murder by mass producing weaponized viral RNA and disguising this worthless and inherently lethal poison as ‘vaccines.’ They are using inexpensive enzyme technology to mass produce these toxic substances at negligible cost and reap outrageous profits. It is no accident that they are deliberately by-passing all vaccine safety testing standards and using their political influence to ‘legalize’ mass murder. They are committing the crime of the century, and its consequences will devastate civilization unless it is stopped. It is small wonder that these corporations have attempted to smother free speech. Corporations are government creations, and they should therefore be subject to the same constitutional restrictions as the government itself. Like Dracula, they live forever. Like Frankenstein, they have powers denied to living human beings. The ‘American Experiment’ to restrain government abuse has failed.” See Dr. Coleman’s March 13, 2024, article on the genocidal intent of the COVID vaccinationshere. Also seeDr. Coleman’s Three Sages article, “COVID Mass Genocide Can Only Be Understood by Reference to Stress Theory.” **Nuclear Armageddon?** The plan for population reduction has been the overriding program of the controllers of the Anglo-American-Zionist Empire, with the mass media like theNew York Times,etc., in collusion, to be carried out simultaneously with the military/economic project aimed at destroying Russia, keeping China in thrall as the supplier of consumer goods to the West, and ever-evolving forms of neocolonialism, dollar hegemony, and genocide toward the Global South. Within the U.S. alone, this enterprise costs well over a trillion dollars a year in direct costs. Most of this expenditure flows back to the billionaires and their corporations that produce the weapons, create the vaccines and other medications, pay the salaries of the millions of bureaucrats who do the “work,” and allocate fabulous sums to the stars and celebrities who act in the movies and TV shows or in sports arenas to keep the population in a depraved stupor. Today this entire apparatus has been “goosed up” to amplify the hysteria behind the Harris/Walz campaign. But with the humiliating loss by the U.S. of its proxy war in Ukraine now looming, combined with the failure of the Eretz Israel project in the Middle East, the Empire has been defeated in the opening stages of World War III. There is simply no place to which the Empire can now retreat, having been exposed in its pretensions to global conquest on two critical geopolitical flanks. The only “way out” would be for them to launch all-out nuclear war. I do not know whether we are heading toward nuclear Armageddon. One would think that the Empire’s elites are too concerned with their personal survival to sign their own death warrants. They are essentially parasites, living off other people’s labor. In fact, much of the Empire’s elites, including important segments of the U.S. Deep State and military, seem to have surreptitiouslyrealized the coming defeat on the global stage. But not everyone has accepted defeat. The top political leadership of the U.S.has no reverse gear. Nor do their Neocon cheerleaders. These people would destroy the world and every living thing upon it before admitting defeat. They are the domestic U.S. equivalent of Israel’s “Samson option.” But the real decision makers may be the leadership of the CIA and top military intelligence. Thus on September 13, 2024, during British Prime Minister Keir Starmer’s visit to Washington, President Biden was forced by the military top brass to read a statement set in front of him that Ukraine would not be allowed to fire long-range missiles at Russian territory. This possible glimmer of sanity reflects thatRussia has won the arms race, and at least some within the Empire realize it cannot win a protracted Eurasian land war. U.S. air and sea power, always its military backbone, can today be neutralized by Russian air defense and missiles in a war anywhere in Europe. As Andrei Martyanov puts it, the U.S. Armed Forces “cannot fight a peer or better than peer opponent and win such a fight.” (America’s Last War,p. 167.) This means U.S. Full Spectrum Dominance has been defeated once and for all. It never came to pass and never will. This includes the intention of total control over all print and electronic communications. Unless what is meant by that term is a suicidal nuclear holocaust once all conventional means of warfare have been countered and checkmated by the rising BRICS+ powers. Moreover, Russia at any time can provide the Axis of Resistance in the Middle East the weaponry needed to obliterate Israel entirely. But Israel too will disappear as acausus belli, as within five to ten years it will likely cease to exist in lieu of a new Palestinian state with freedom of settlement and religion. The Axis of Resistance is certain of such an outcome. Where we are clearly heading is toward a world divided between East and West with what remains of the Empire in competition with BRICS+ for control of the Global South. Thus we are likely looking at a lengthy era ofborder warsthat may yet cause much upheaval and suffering. Or, as Pepe Escobar recently put it: “The War on Terror has been debunked; it is now dead. But get ready for serial warsofterror by a Hegemon unaccustomed to not owning the narrative, the seas, and the ground.” See here. While these border wars will provide fodder for endless reams of commentary by cadres of fake analysts and endless opportunities for self-aggrandizement by politicians and grifters of every stripe, they are of no lasting importance. Much better would be a decision by the Empire to finally live in peace with the rest of the world. Fadi Lama has depicted the East-West split in his articleThe west’s Plan B: Secure the realm. **East Is East and West Is West** It is increasingly clear that the world isnaturallydivided between East and West as reflected, among other things, in their respective religious orientations. British poet Rudyard Kipling emphasized a profound truth by writing that, “East is East and West is West, and never the twain shall meet.” The West is definitely far more influenced by Christianity than the rest of the world. The East consists of a number of related religions, including Hinduism, Buddhism, Shintoism, Taoism, and Confucianism, with Islam a bridge between Eastern and Western persuasions. The Empire made its big mistake in trying to conquer the East and inflict upon the majority of the world’s population its materialistic obsessions. The hatred this has stirred up will take a long time to dissipate. The Empire is trying to maintain its grip on the Asian rim via the string of nations beginning with Australia and New Zealand and including the Philippines, Taiwan, Korea, and Japan. But cracks are developing in this scene of imperial hegemony also. While BRICS+ will see the development of nation-statesalong the lines of civilizational entities, the West, stripped of its globalist pretentions, will be wise to look inward at what it has become, what it must atone for, and how it is to survive going forward. Survival of the West is not guaranteed, having completely lost its metaphysical center when everything its leaders do is an expediency justified by claims of reacting to imaginary external enemies. When governance is based on hysteria and paranoia, survival will not be an easy task. It involves a serious search within Western society for our civilizational roots, including the core ideas of the Christian religion that have been erected into dogmas of intolerance. It involves fighting the forces of dissolution: “Wokeism,” etc. It involves throwing the totalitarians out, such as the WHO, the WEF, etc. And it involves stripping the power of the billionaires. Behind all these lurk the cults of revolutionary nihilism. The nihilists still may win control over the West, butneverover the entire globe. In the East, they are being defeated by the great historical civilizations. So what we now must deal with in the West is the still-lingering elite obsession with destroying the health and sanity of its own population. The right-to-exist of the Western peoples must be recognized and affirmed. Non-Western peoples living in the West should become law-abiding citizens or go back to where they came from. And the Zionists need to shut up, get real jobs, and get on-board with Western values and Western civilization. One other factor involves censorship and freedom of speech as specified in the First Amendment to the U.S. Constitution. I have been engaged in a study of the Habsburgs and am now reading about Philip II of Spain. He had inherited the Philippines as part of the Spanish Empire and was contemplating using it as the springboard for the invasion and conquest of Indochina, followed by China itself. That is, after he conquered and took over England with his invincible Armada. Well, we know what happened with that! But he also firmly backed the Spanish Inquisition, introducing it in Spanish America in 1570-1571. The historical result of the Inquisition was that the Spanish intelligentsia and nobility was so terrified of persecution that Spain was permanently stunted. Original thought and scholarship never returned. This was likely what was responsible for Spain’s permanent decline and its status today as a non-entity among nations. What we are now seeing in Europe and America, and especially the U.K., is the modern version of the Inquisition. It is going to have the same effect in that it will destroy the ability of those nations ever to mount any original thought or innovation out of fear of the “Woke” police like Keir Starmer. This above all is what is likely to ensure the permanent decline of the West and quite possibly the collapse and demise of the U.K. and U.S. themselves. By the time this happens, and it is happening now, Europe will have jumped off the sinking ship. **Chapter 6:** **American Civil War II?** Are we in a new American Civil War to resolve the above issues, if in fact they can be resolved? The conflict appears most clearly in the division between the Democratic and Republican Parties. The differences between the two parties have existed since they were created, dating back to the early 19thcentury when their modern versions came into existence—the Democrats in 1828 and the Whigs/Republicans around 1840. The modern Democratic Party was born with the victory of Andrew Jackson in the election of 1828 over incumbent John Quincy Adams, the last president of “The Era of Good Feeling.” The phrase “to the victor go the spoils” was attributed to Jackson and points to the longstanding practice of the Democrats of using the nation’s wealth to create a standing bureaucracy and military to assure its electoral dominance. Of course this is legalized bribery. The Republicans, by contrast, have been the party of limited government spending and promotion of private sector economic growth. Even when the Republicans created the army needed to win the Civil War, that army was disbanded soon afterwards. Much later it was the Democrats under Woodrow Wilson and Franklin D. Roosevelt who created the massive taxpayer-funded military machines that fought World Wars I and II and, in Roosevelt’s case, the bureaucracies of the alphabet agencies that put much of the nation on the “dole” during the Great Depression. Andrew Jackson is famous for having destroyed the Second Bank of the United States, which, despite its benefits to oligarchic interests, had become the only engine of national economic development or means of stabilizing the currency that the country possessed in that era. Jackson sequestered federal tax revenues in an “Independent Treasury,” where they were not available for infrastructure projects such as roads and canals under the Whigs’ proposed “American System.” The result of Jackson’s policies, which were carried forward under his successor Martin Van Buren, was the devastating Panic of 1837, known then as “the Great Depression.” At the same time, Jackson utilized as his personal banker the Rothschilds of London. Under Rothschild agent August Belmont, who emigrated to the U.S. in 1837, the Rothschilds gained a foothold in the New York banking community that they never relinquished. August Belmont became an immediate success by buying assets for pennies on the dollar during the Panic of 1837. Known as “King of the Money Changers,” Belmont became one of the richest men in America. The Democrats were the party of slavery and its expansion into the territories, and potentially into Cuba and Latin America, factors which loomed large in the run-up to the Civil War. The Republicans were emphatically the party of free labor. The Democrats, before the Civil War, were closely allied with the bankers of New York and London and favored low tariffs so they could purchase cheap manufactured goods from England. The Whigs and Republicans favored high tariffs to protect the growth of American domestic industry. This continued until the McKinley Tariff of 1890. By contrast, low tariffs and “free trade” have always been the program of the globalists whose policy is to reduce worker living standards to the lowest possible common denominator—to poverty and starvation if need be. Such is the case with the Democratic Party today. It is no accident that the Democrats under President Joe Biden and Vice President Kamala Harris have admitted millions of illegal immigrants, with many of those who have jobs working at wage-slave levels, while living in housing subsidized by local Democrat-controlled municipal governments. The crime waves that follow are brushed off by prosecutors elected with money from Soros and his ilk. By the time of the Civil War in 1861, with Lincoln having been elected to defend the Union, the Rothschild bankers controlled the Democratic Party behind the party chairmanship of August Belmont. Sounds incredible, but look it up; it’s a fact of history conveniently forgotten by the Democrats of today. Behind Belmont, and behind him the Rothschilds, they ran the disgraced Union General George McLellan against Lincoln in the 1864 election on a platform of compromise with the South but lost decisively. The voters could see the bankers’ snake in the grass. After the war, the Democrats identified with the aristocrats of the defeated South who regained political power when Reconstruction ended by political compromise in 1876. Democratic senators formed the backbone of the “Solid South” until the election of 1968, when Richard Nixon’s “Southern Strategy” began to build Republican Party strength in Dixie in alliance with Republican conservatives elsewhere in the country. From Lincoln onwards, the Republicans favored nationalistic economic policies, including a high tariff and infrastructure investment, all the way through to the presidency of William McKinley who was assassinated in 1900. The exception to the string of Republican presidencies was that of Democrat Grover Cleveland, a lawyer who had been governor of New York. It was Cleveland who went hat-in-hand to the J.P. Morgan/Rothschild banking syndicate for a bailout in 1893 when the U.S. government faced bankruptcy due to its gold deficit. As indicated above, the Democrats are the party of unlimited immigration, which in the 19thcentury swelled the ranks of Democratic voters in cities like New York, Boston, and Chicago, where party machines handed out jobs and welfare benefits in exchange for votes. The same thing was done to get Woodrow Wilson and FDR elected and is happening today with the Democrats having opened the borders to a flood of would-be voters to get Biden and now Kamala Harris elected. In every respect, the Democratsare acting true to form, including their out-of-control spending and their globalist orientation and allegiances. Above all, the Democratic Party is a front for the billionaires who would destroy our nation for profit. Where do you think their fabulously wealthy donors come from who cover their tracks with “woke” platitudes? It was a Democratic president, Woodrow Wilson, who signed the Federal Reserve Act of 1913 that opened the floodgates to control of U.S. finances by the international banking cartel run out of the City of London. In fact, it was the Rothschilds who actually wrote the Federal Reserve Act. SeeOur Country, Then and Now. It was FDR who took us into World War II by inducing the Japanese attack at Pearl Harbor. In both cases, the Republican Party included a strong anti-war element that was suppressed and vilified. In 1948, the Republican rank-and-file wanted to nominate Senator Robert Taft as president. Taft was a conservative senator who opposed Truman’s National Security State. But the Rockefellers threw their weight to get internationalist Dwight D. Eisenhower nominated and elected instead, so the Cold War moved along without a break. John F. Kennedy was an economic nationalist who broke the mold of Democratic presidents in 1960. But he was killed by the warmongers who moved ahead with their Vietnam project, followed later by the Neocon takeover under Reagan. Obviously influences change with the wind, with both political parties implicated in the era of endless wars we are now suffering through, but today there is no question that the Democrats have reverted to historical form by being the party of massive bureaucracies, the suffocating war machine, open borders and immigration without limits, the overwhelming power of the Deep State, censorship, erosion of constitutional rights, unlimited governmental surveillance, and corruption—in short, a continuing criminal enterprise vastly more powerful and dangerous than any we have ever had. The Democratic Party today is a Mafia gang disguised as a political party. In suppressing freedom of speech, the gang is deeply in cahoots with similar creatures from the U.K.See this.I don’t call it theANGLO-American-Zionist Empire for nothing. Image: Tim Walz and Kamala Harris together in March 2024, prior to the start of the Harris 2024 campaign. Walz would go on to become the campaign’s vice presidential candidate. (From the Public Domain) Heading the Democratic Party are two candidates—Kamala Harris and Timothy Walz—nominated by the leadership clique on the basis of identity politics and who have no qualifications whatsoever to govern a nuclear superpower with the respective arsenals of the U.S. and Russia on hair-trigger alert. To picture two such non-entities at the head of American government is beyond appalling. It points to a nation of criminals, lunatics—and traitors. The Republicans, by contrast, have nominated for president and vice-president two individuals—former President Donald Trump and Republican Senator J.D. Vance—who are clearly in the tradition of American economic nationalism similar to the Republicans of by-gone days. Now added to their support is another American nationalist—Robert F. Kennedy, Jr., who has been forced to leave the Democratic Party that nurtured his father and uncle. It is interesting that the Democrats and their controlled press—led as always by the elitistNew York Times—is attacking and ridiculing Trump much as Lincoln was attacked and ridiculed way back when. Cheerleading the attacks are millions of hangers-on who “work” at all levels of government, at NGOs, for the military, for the Deep State, for “think tanks,” for international institutions, or for “non-profits,” and who think nothing of bleeding taxpayers for the benefit of their own status, aggrandizement, and profiteering. Indeed, this class pays itself handsomely as it poses as America’s aristocracy. I add to this list the vast cadres of “work-at-home” employees who have benefited from the tragedies of the COVID pandemic and the “virtual” workplaces appearing on internet platforms conjured up by Silicon Valley. What will become of all these people when someone pulls the plug like Russia is doing to Ukraine’s late, great power grid? Then there is the mass of civil service, military, and Social Security retirees whose annual COLAs—compounded—are a huge source of inflation and also serve to create a permanent voting bloc to cover Democratic Party grift. Given all these factors, it is difficult to see how the Republicans willeverwin another presidential election, but we shall see. The conflict between the two parties is permanent and endemic. But it is just as difficult to see how a nation governed by grift, backed by a military that has not won an actual war or proxy conflict since Japan surrendered in 1945, can survive in an age when BRICS+ is advancing at breakneck speed to make world commerce its own. Unfortunately,Donald Trumpis, and has always been, a political amateur, which was proven by the ease with which the Deep State manipulated and bamboozled him during his previous presidency. This included being conned by Israel to support moving the U.S. embassy to Jerusalem and Anthony Fauci blithely suckering him into actively promoting the fake pandemic through “Operation Warp Speed,” etc. J.D. Vance has the potential to become a master politician, but he is just getting started. Kennedy had trouble gaining traction throughout his truncated campaign. His loss of master-politician Dennis Kucinich as campaign manager was an early disaster, and his economic program which embraced Bitcoin as an economic panacea remained anemic. The opponents of this trio among the Shadow Men and intelligence operatives who now trot Harris-Walz across the stage are consummate professionals at assassination, false flags, and other mayhem and have their long knives at the ready, as already shown by the infamous January 6, 2021, set-up; the July 13 and September 15, 2024, Trump assassination attempts; the current unresolved “lawfare” attacks against Trump by Merrick Garland, Jack Smith, Fani Willis, et.al.; and the rigged travesty of the September 10, 2024 Harris/Trump “debate.” **Failure by Both Parties to Address the Banking System** Unfortunately,neitherpolitical party has addressed the financial system that lies at the root of so many problems. This is the system run by the central banks of the Western nations based on fractional reserve lending and usury. A strong case can be made that ultimate control over this system comes out of Europe and the ancient families that have ruled the Old World for centuries. The Bank for International Settlements in Basle, Switzerland, is often mentioned as the system’s institutional overseer. None of the presidential or vice-presidential candidates offer a clue that they have ever even heard of this system which is explained in my bookOur Country, Then and Nowand many other sources. Further, every utopian scheme put forth by such collectives as the UN, the WEF, NATO, or the respective governments of the Western nations presumes a “rules-based” order with the financial billionaires at the top. When I was at the U.S. Treasury Department post 9/11, we had meetings defining the banking system as “critical infrastructure,” meaning it was to be defended by all available means, including military force, and that any attempt to disrupt it was defined as “terrorism.” A better term than “rules-based” would be “usury-based.” And it’s this usury-based system that persists only through military power that is destroying humanity. As I wrote in a recent article: “The U.S. is in long-term economic decline due to geopolitical factors—the proxy war against Russia in Ukraine, for example—causing a major reduction in dollar hegemony internationally and an increase in the federal debt which now amounts to over $35 trillion. “At the same time, the overall goal of the U.S. economy is to keep the stock market growing at an average rate of 3-5% compounded. Given an economy where economic growth is essentially stagnant; i.e., the only added value is through inflation, every company must cut costs even more. This means lowering wages relative to workers’ cost of living and reducing product quality, including that of food.” **Three Politicians Who Have Challenged the System** Our ruinous financial system has been challenged by onlythreeliving politicians. One is former U.S. representativeRon Paul, who has been calling for many years to “audit the Fed.” The second is former U.S. representativeDennis Kucinich, who proposed the National Emergency Employment Defense Act in 2011 that would replace the Federal Reserve with a system of national currency. I describe the NEED Act and my own role in helping to bring it to pass in the Appendix toOur Country, Then and Now. The third is representativeThomas Massie(R-KY), who proposed legislation on May 16, 2024, to abolish the Federal Reserve. Unfortunately, Mr. Massie has not given any indication of what he would replace it with. The NEED Act, which Mr. Massie must know about but failed to reference, would satisfy that concern. In the area of globalist banking, the willful ignorance of the U.S. political class is staggering. No wonderwe are far along the path of losing our country altogether.Under the rubric “Wagging the Dog,” they used to start wars to distract attention from economic problems. I don’t think that will work anymore. **Public Banking** There is a promising development in the field of public banking being led by the Public Banking Institute founded by Ellen Brown, author of the classicWeb of Debt. Brown cites as an exemplar of public banking the century-old Bank of North Dakota, the only government-owned general-service bank in the U.S. It is the legal depository for all state funds in North Dakota, and uses these deposits to fund business development, farming, and small business. Florida has now come up with a plan for its own Florida State Sunshine Bank. One of its purposes is to keep private banks from “debanking” customers on political or religious grounds. Ellen Brown points out, however, that “Florida may run up against Federal Reserve and FDIC rules for obtaining a Fed master account, which is required for the Sunshine Bank to join the federal payment system.”See here.Thus, no matter what, the globalist central banking system controls access to the banking game. Any bank that is part of the system must adhere to the Fed’s interest rate policies, where any interest rate above 1%, which is the break-even point for banking expenses, should be considered usury, according to the late Stephen Zarlenga, head of the American Monetary Institute. The same applies to banks owned by Indian tribes on reservations, which is another form of public banking, but equally beholden to the globalist system. **Trump’s Economic Program** On September 5, 2024, the Trump campaign introduced an eight-point plan “to defeat inflation, make America affordable again, and return the United States to explosive economic growth.”See Here. The centerpiece of the plan is to rebuild U.S. industry through protective tariffs, which is a time-honored Republican policy centerpiece that the globalist Democrats have always opposed vociferously. The plan also entails scrapping the “Green New Deal,” expanding extraction of fossil fuels, investing in a healthy food supply, creating new affordable housing, and setting up a Sovereign Wealth Fund for infrastructure investment. The plan also calls for “making America the world-capital for crypto and Bitcoin.” While this is far from comprehensive monetary reform, the provision mirrors RFK, Jr.’s, advocacy for a peoples’ currency free from the control of central banks. The next step would be to abolish the Federal Reserve altogether in favor of a new national currency as Rep. Kucinich proposed in 2011. Meanwhile, the madcap Christian Zionists attribute our peril to their “God” and look forward to, or even call for, the very Armageddon that may be unavoidable. I attribute our peril to our own stupidity, greed, ignorance, and cowardice that may require many centuries to run its course. One thing seems certain: implosion and collapse. And what is the alternative to radically-enforced eugenics and genocide to making earth a happy home? It is to create a decent, wholesome society whereallmembers of the Human Family can grow up as sane, productive, positive members of society. This doesnotmean a “perfect” world. Nor does it mean the massive “planning” documents such as Biden’s January 10, 2023, “Declaration of North America” or similar documents proclaimed by the UN, WEF, WHO, etc., which are written by bureaucrats in favor of more government “programs” to solve often non-existent problems by spending taxpayer money for salaries of even more “experts,” to solve even more non-existent problemsad infinitum, forever and ever, amen. To beat a dead donkey, let’s once again point out that all this grift is the staple of today’s Democratic Party. Real change would mean government and its “experts” getting out of the way so ordinary people can live their lives in peace according to the Golden Rule. **Civil War Is Worldwide** While this section focuses on the U.S., civil war may be breaking out not only here but also in Israel and Europe. There too the battle may go violent as the Empire’s hegemony collapses worldwide. But individuals everywhere in the West also sense new opportunities alongside ramped up repression by the endangered elites. As stated earlier, crucial to the outcome is the war being waged by the globalists against freedom of speech, particularly freedom of expression on the internet and social media. Abolishment of free speech is one of their primary aims. Here the war is being fought daily byevery individualwho cares about the future of humanity. The war is also being fought with respect to attempts by globalist institutions like the UN, the WHO, the WTO, and others, to strip nation-states of sovereignty. These attempts are being opposed by figures within the Republican Party and groups like theDoor to FreedomandOur Country Our Choice. **Chapter 7:** **Spiritual Transformation** What can bring about peace in the world? I don’t believe any “reforms” will ever do that without changes to the human personality which can only be self-directed. Nor will anything ever make life on earth “perfect,” because human beings arenot in their essenceearthly beings. All real religions point potentially to a higher spiritual state than mere terrestrial satiety or safety. But thereisthe possibility that through Spirit, people may learn to get along through cooperation and compromise instead of war. There can be a spiritual outcome, however, only when we see self-directed improvements in the lives of the individuals involved, regardless of race, religion, nationality, or ideology.But each person’s spiritual path is unique. **My Journey** Until age 16, I attended the Episcopal Church with my family. Things began to fall apart with the societal disintegration that came with the JFK assassination, the Vietnam War, and the CIA’s assault on young Americans, with the distribution of LSD on college campuses and the infliction on the population of crippling psychotropic medication. Doctors were giving it out like candy, emptying the mental hospitals by turning their patients into vegetables. I witnessed and suffered greatly from all this, but was still able to recover and get a job with the federal government. It was also the era of “cults,” Scientology being one notorious example. I’m not afraid to admit that for 12 years I was an active member of a cult operating out of Washington, D.C., at the same time that I was starting to work as a federal government analyst. This particular cult promised its followers they could “wake up” and not be just “automatons” reacting to “external influences.” Various complex “tasks” and mathematical exercises set to music were given. The cult was highly placed within Washington, D.C., society. You can read something about it in a book calledMary’s Mosaic.If you questioned the leaders, broke secrecy, or—heaven forbid—quit the organization, you were viewed as one who had “died.” I broke these rules and had to move out of a cult-owned residence after a fire I believed was set deliberately. For the next few years our family lived in a run-down farmhouse a couple of hours commuting distance from work. I worked at several jobs to make ends meet. Efforts to join a local church proved pointless. I then began to study Islam and read theKoran.But I had long been interested in Eastern religions, so was able to get in touch with an ashram in India devoted to a deceased Hindu saint named Ramdas. This seemed like the real thing. I corresponded with Ramdas’s successor, a man named Satchitananda, and was given the name “Ramcharandas,” which means, “Servant of the Feet of God.” I began to feel a need to learn how to meditate, with the idea that only by going deeply within could I find the peace that had eluded me my whole life. In May 1998 I attended a retreat in the New York Catskill Mountains put on by a woman Indian teacher named Karunamayi. She had published a book where she said that the greatest living Indian meditation master was a guru named Shivabalayogi. I made contact and learned that a man named Shivabalayogi would be visiting Roanoke, Virginia, the coming September. I traveled with “Swamiji” on his U.S. summer tours for seven years. It was one thing to read about these teachings and another to spend time with people who lived them. I did in fact learn to meditate and continue to this day. My account of Swamiji’s teaching may be found in a book I wrote entitled,In the Footsteps of the Yogi. What I learned during this period was life-changing, but by now I was 60 years old. In 2007 I retired from the federal government and published two books reflecting my government service:Challenger Revealedon the 1986 Challenger disaster that I witnessed at NASA andWe Hold These Truths: The Hope of Monetary Reformon what I had learned about the U.S. monetary system while working for the U.S. Treasury. Both books were “off the beaten path”:wayoff. But I also continued my spiritual search, trying to relate what I had learned about meditation to Western spiritual teachings. This brought me to two books by the German spiritual teacher Eckhart Tolle:The Power of NowandThe New Earth. An article I came across about Eckhart Tolle spoke of his childhood and youth when, as a post-World War II German, he was suffering deep depression and had gone to Spain to live with his father. It turned out that his father was a reader of the works of German spiritual master Bô Yin Râ (Joseph Anton Schneiderfranken, 1876-1943). I learned that books by Bô Yin Râ were becoming available in English translation through the Kober Press of Berkeley, CA, and another publisher in Amsterdam. I began reading everything by Bô Yin Râ I could find and have never looked back. I am now starting to read his books in German. My wife Karen and I visited his birthplace in Franconia, Germany, and I am in touch with his GermanStiftung. Though Bô Yin Râ was raised a Roman Catholic, his teachings apply to all faiths and religions. His books are particularly inspiring, and intensely practical, when speaking of prayer. His bookOn Prayeris the best on the topic I have ever read, and I cannot recommend it too highly. Clearly prayer is desperately needed in today’s crisis. Here is an article I wrote for Three Sages on Bô Yin Râ’s teachings, focusing on his primary text,Book on the Living God. Also see this review of hisThe Book on Life Beyond. Bô Yin Râ writes of a better time ahead as more people are born who have a spiritual orientation. He writes that even in his day, signs could be seen, and that was a century ago. **Addendum 1:** **The Fourteen Holy Helpers** In his bookMore Light,Bô Yin Râ speaks of the Fourteen Holy Helpers, who are saints that appeared in the 14thcentury to help people in Germany suffering from the Black Death. The presence of the Fourteen Holy Helpers is expressed in the following nighttime prayer: When at night I go to sleep,Fourteen angels watch do keep,Two my head are guarding,Two my feet are guiding;Two upon my right hand,Two upon my left hand.Two who warmly coverTwo who o’er me hover,Two to whom ’tis givenTo guide my steps to heaven I firmly believe in the help available to human beings from the heavenly realm. The names of the Fourteen Holy Helpers and the conditions they treat are said to be as follows. May you find some of the help you seek in our own plague-filled era by directing your prayers to one or more of these saints or to any others you choose to follow. I also know that St. Michael and St. Anthony always stand ready to help. I also know that for prayers to be answered, we first mustask. . **Addendum 2:** **Richard Wagner (1813-1883)** When citing German culture, we return to Richard Wagner, creator ofThe Ring of the Nibelung,the great 19thcentury prophecy of the coming of the modern age in which Wagner depicts allegorically the travails through which humanity must past to achieve its promised future. The Empire has been trying in vain to block this future from arising, as such a future has no place for the exploitation of humanity. . Siegfried at Regin’s forge to receive the sword he will use to slay Fafnir the dragon in Richard Wagner’s cycle Ring of the Nibelung: Painting 1880 by Wilhelm Ernst Ferdinand Franz Hauschild (1827-1887), Neuschwanstein Castle collection(Source: Wikimedia Commons) . In contrast to the dwarves and dragons whose grip on the world is passing away, Wagner wrote: “Love in its most perfect reality is only possible between the sexes; it is only as man and woman that human beings can truly love….It is an error to look on this as only one of the forms in which love is revealed, as if there were other forms coequal with it, or even superior to it….It is only in the union of man and woman by love (sensuous and supersensuous) that the human being exists…” Perhaps the best source for Wagner’s adulation of the Eternal Feminine is his operaTannhäuser. Source of quotation: George Bernard Shaw, “The Perfect Wagnerite: A Commentary on the Niblung’s Ring,” Dover edition, 1967, p. 99-100. **Addendum 3:** **Jesus on a White Horse** See here. Comment on Global Research Articles on our Facebook page Become a Member of Global Research **Related** Disclaimer:The contents of this article are of sole responsibility of the author(s). The Centre for Research on Globalization will not be responsible for any inaccurate or incorrect statement in this article. The Centre of Research on Globalization grants permission to cross-post Global Research articles on community internet sites as long the source and copyright are acknowledged together with a hyperlink to the original Global Research article. For publication of Global Research articles in print or other forms including commercial internet sites, contact:[email protected] www.globalresearch.cacontains copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available to our readers under the provisions of \"fair use\" in an effort to advance a better understanding of political, economic and social issues. The material on this site is distributed without profit to those who have expressed a prior interest in receiving it for research and educational purposes. If you wish to use copyrighted material for purposes other than \"fair use\" you must request permission from the copyright owner. For media inquiries:[email protected] Global Research News I-BOOKS SERIES Countries Index Most Popular Links Contact Membership Online Store US NATO War Agenda Global Economy Crimes against Humanity Militarization and WMD Law and Justice Police State & Civil Rights History 9/11 & ‘War on Terrorism’ Media Disinformation Militarization and WMD Oil and Energy Police State & Civil Rights Religion Poverty & Social Inequality Science and Medicine United Nations US NATO War Agenda Women’s Rights Become Member ofGlobal ResearchFree Books!"}