{"id": 563, "name": "Frontiers in Freshwater Science", "domain": "frontiersin.org/journals/freshwater-science", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.frontiersin.org/journals/freshwater-science/articles/10.3389/ffwsc.2025.1577065/full", "title": "Freshwater Science", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Aquatic Population Health and Diseases Freshwater Species Evolution and Ecology Freshwater – Human Impacts Rivers and Floodplains Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Aquatic Population Health and Diseases Freshwater Species Evolution and Ecology Freshwater – Human Impacts Rivers and Floodplains Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Aquatic Population Health and Diseases Freshwater Species Evolution and Ecology Freshwater – Human Impacts Rivers and Floodplains Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Freshw. Sci., 07 May 2025 Sec. Rivers and Floodplains Volume 3 - 2025 |https://doi.org/10.3389/ffwsc.2025.1577065 **Long-term patterns in growth of White Sturgeon in the Sacramento-San Joaquin River Basin, California** 1U.S. Geological Survey, Idaho Cooperative Fish and Wildlife Research Unit, Department of Fish and Wildlife Sciences, University of Idaho, Moscow, ID, United States 2Idaho Cooperative Fish and Wildlife Research Unit, Department of Fish and Wildlife Sciences, University of Idaho, Moscow, ID, United States 3U.S. Fish and Wildlife Service, Arizona Fish and Wildlife Conservation Office, Pinetop, AZ, United States Introduction:The Sacramento-San Joaquin River system (SSJ) of California includes both riverine, delta, and estuarine habitats and is among the most modified aquatic ecosystems in the United States. Water development projects in the system are associated with declines of many native species, including White SturgeonAcipenser transmontanus. Methods:We used White Sturgeon pectoral fin rays collected from 1983 to 2016 throughout the SSJ to assess long-term changes in growth and associations with thermal and hydrological conditions (i.e., temperature, discharge, salinity). Age and growth were estimated from 1,897 White Sturgeon varying in fork length from 25 to 210 cm and from age 0 to 33. Results:Age structure varied through time with the oldest fish generally sampled during the mid-1980s. Growth of White Sturgeon in 1951–1970 was slower than growth of fish in 1971–1990 and 1991–2012. Growth of White Sturgeon during 1991–2012 was ~10% higher than during other time periods. Discussion:Little variation in growth was explained by environmental covariates, suggesting that annual growth was likely influenced by factors not measured in our study. Alternatively, population structure and movement behavior of White Sturgeon in the SSJ may be such that the scale (i.e., spatial or temporal) of available habitat covariates was mismatched to the scale at which growth of White Sturgeon responds. Increased growth in recent times may be partly due to density-dependent processes in association with substantial declines in White Sturgeon population abundance over the last several decades. This research provides important information on long-term patterns in growth that contributes to the conservation and management of White Sturgeon in the SSJ and beyond. **Introduction** Large river systems and their associated deltas and estuaries are among the most complex and important ecosystems in the world (Nichols et al., 1986;Cloern and Jassby, 2012;Feyrer et al., 2021). Many marine and anadromous organisms, including commercially important fishes (e.g., Pacific salmonOncorhynchusspp., Pacific HerringClupea pallasii) and sturgeon (Acipenserspp.) depend on a biologically productive estuarine environment during at least one life stage (Cech et al., 1984;Moyle et al., 2011;Mora et al., 2018). One of the most important systems in North America is the Sacramento-San Joaquin River system (SSJ), California, which encompasses lotic, delta, and estuarine habitats. Many species native to the delta have declined in abundance and distribution since the beginning of the twentieth century as a result of considerable anthropogenic alterations to physical and chemical habitat conditions, overexploitation, and interactions with non-native species (Moyle et al., 2011). Although many native fishes have declined in response to human disturbances in the system, the decline of White SturgeonAcipenser transmontanusis of particular interest given its ecological and economic importance. Like other sturgeon, White Sturgeon exhibit life history traits (e.g., delayed sexual maturity, slow population growth rates, variable recruitment) that make them sensitive to environmental perturbations and overharvest (Boreman, 1997;Pikitch et al., 2005). Since the 1980s, a decreasing trend in successful annual recruitment of White Sturgeon has been observed in the system (Shirley, 1987;Gingras et al., 2013;Blackburn et al., 2019). Recent recruitment has been highly variable with only a few moderately strong year classes documented in the last 25 years (e.g., 2000, 2019). Although old White Sturgeon (i.e., ~25 years old or older) are present in the system, the age structure of White Sturgeon in the SSJ tends to be dominated by fish less than age 11 (Kohlhorst et al., 1980,1991;Blackburn et al., 2019). Commercial fishing for White Sturgeon in California has been banned since 1917 and recreational harvest was closed in 2024, but recent recreational harvest (i.e., 1990s–2010s) has occurred at unstainable levels (Blackburn et al., 2019), especially when coupled with extensive habitat alterations (e.g.,Jager et al., 2001). White Sturgeon evolved to survive fluctuating environmental conditions (e.g., attenuating spring-summer flows, variable salinity) by synchronizing their life cycles with patterns in temperature and flow (Coutant, 2004;Moyle et al., 2011). However, the SSJ is considered one of the most altered ecosystems in the world (Nichols et al., 1986;Cloern and Jassby, 2012). Hydroelectric projects, levees, and water diversion facilities have altered thermal, discharge, salinity, and sediment regimes, channelized river corridors, disrupted floodplain connectivity, and obstructed migration and spawning activities (Jager et al., 2001;Crossman and Hildebrand, 2014;Jackson et al., 2016;Katopodis et al., 2019). For instance, a narrow range of suitable spawning conditions (e.g., temperature, discharge) influence year-class strength through direct (e.g., age-0 survival;Jay et al., 2020) or indirect effects (e.g., spawning cues;Jackson et al., 2016). Although White Sturgeon in the SSJ are anadromous, salinity likely influences growth of White Sturgeon. Increased salinity may decrease prey availability and increase stress at sensitive early life stages (Cech et al., 1984;Tashjian et al., 2007). Water management and recent prolonged drought has resulted in higher concentrations of salinity persisting in the Sacramento-San Joaquin Delta and spreading further upstream than historical gradients (He, 2022). Other environmental conditions, such as degraded water quality, loss of tidal marshes, heavy metal and agricultural chemical contamination, biological invasions (e.g., Basket ClamCorbicula fluminea, Overbite ClamPotamocorbula amurensis) have likely changed the ecosystem (Cloern and Jassby, 2012;Winder and Jassby, 2011;Merz et al., 2016). Protecting White Sturgeon from further reductions in abundance has become a focus of the California Department of Fish and Wildlife (CDFW) and the U.S. Fish and Wildlife Service (USFWS). Although research during the last 10 years has greatly improved our knowledge of White Sturgeon in the SSJ (Hildebrand et al., 2016;Blackburn et al., 2019;Ulaski et al., 2022), an improved understanding of the population dynamics of White Sturgeon is warranted. In particular, understanding patterns and metrics regarding growth is critical, as nearly every event in a fish's life is influenced by size (i.e., length, weight;Quist et al., 2012;Kerns and Lombardi-Carlson, 2017). The objectives of this study were to (i) assess growth patterns over time for White Sturgeon in the SSJ using pectoral fin rays collected from 1983 to 2016 and (ii) evaluate relationships between environmental conditions (i.e., water temperature, discharge, salinity) and growth. **Methods** **Study area** White Sturgeon in California were once widespread throughout large rivers that drained to the Pacific Ocean, but now largely occur in the SSJ (Figure 1). The majority of spawning activity occurs in the Sacramento River (Kohlhorst et al., 1991;Miller et al., 2020) with spawning documented in the San Joaquin River (Jackson et al., 2016). The Sacramento and San Joaquin rivers flow through California's Central Valley draining an area of ~163,000 km2(Cloern and Jassby, 2012). Their confluence forms the delta that supplies fresh water to Suisun and San Pablo bays, and ultimately to San Fransisco Bay. Suisun and San Pablo bays are shallow (mean depth ≤ 5 m) and productive, and typically serve as the brackish transition between marine and freshwater habitat. Mean annual freshwater runoff from the Sacramento and San Joaquin rivers varies between 28 and 40 km3(Cloern and Jassby, 2012). However, the Central Valley experiences high seasonal and inter-annual variability in air temperature and precipitation due to its Mediterranean-like climate, proximity to the ocean, and decadal oscillations in climate patterns. Extended severe droughts are common in the basin (He, 2022). Water development projects have decreased the ratio of winter to summer discharge by over 70% and changed seasonal patterns of freshwater inflow (Jackson et al., 2016). The highest flows in the Sacramento and San Joaquin rivers are managed to occur in late spring (i.e., April–June) in an effort to mitigate flood hazards and supply irrigators followed by a prolonged low-flow period from summer through early spring as reservoirs recharge (Cloern and Jassby, 2012;Jackson et al., 2016). Figure 1. The Sacramento and San Joaquin rivers as they enter the San Francisco Bay system (gray shading), California. Solid circles denote location of U.S. Geological Survey stations used in the analysis. **Field sampling and laboratory processing** We used pectoral fin rays collected between 1983 and 2016 using several gear types to compare growth trends throughout the study area (Table 1). White Sturgeon fin rays were collected during an age estimation study during the 1980s that used various methods of capture including creel surveys, gill nets, and trammel nets to sample fish in Suisun and San Pablo bays and the delta (Brennan and Cailliet, 1989). The USFWS supplied White Sturgeon fin rays collected from fish harvested during sport fishing derbies conducted from 2012 to 2015 and from sampling efforts by USFWS in the San Joaquin River in 2015 and 2016. The majority of fish used in this study were sampled by CDFW from creel surveys, gill and trammel nets, set lines, and incidental bycatch from 1983 to 2003 throughout the study area. Targeted sampling for White Sturgeon by CDFW included a juvenile study using baited set lines described byDuBois et al. (2010)from 1991 to 2000 and an adult population study that used trammel nets from 2014 to 2016 in Suisun and San Pablo bays (DuBois and Danos, 2017;Blackburn et al., 2019). Captured White Sturgeon were examined for previous marks (e.g., fin ray scars, missing scutes, tags) and measured for either fork length (FL) or total length (TL) to the nearest centimeter. In instances where TL was recorded, TL was converted to FL followingBeamesderfer (1993). White Sturgeon do not exhibit external sexual dimorphism, so sex was not identified. A ~2.5 cm section of the anterior pectoral fin ray was taken near the body from White Sturgeon to estimate age (Koch et al., 2008;Ghere et al., 2024). Table 1. Number of White Sturgeon fin rays collected during 1983–2016 by gear in San Francisco Bay and the adjacent Sacramento-San Joaquin Delta, California. White Sturgeon pectoral fin rays that were not previously cut or mounted onto a slide were prepared for age analysis following methods outlined inKoch and Quist (2007). We cut two or three sections varying in thickness from 0.8 to 1.3 mm from the proximal end of the fin ray to increase the likelihood that at least one readable section was available for age and growth analyses. Damaged or unreadable rays were removed from the analyses. We estimated age from cross-sectioned fin rays using a dissecting scope and transmitted light. The distance between annuli was measured using image analysis software (Image-Pro Plus; MediaCybernetics, Rockville, MD). Annuli were enumerated without prior knowledge of fish length. All fin ray sections were aged by two experienced readers. When discrepancies occurred, readers evaluated sections concurrently and attempted to reach a consensus age. If a consensus age was not reached, the fish was removed from all further analysis. Samples collected during winter and early spring (i.e., January–May) were assigned an annulus on the outer edge of the ray. **Environmental data** We focused on temperature, discharge, and salinity as possible factors explaining variability in growth of White Sturgeon in the SSJ. Water temperature (°C) data were obtained from U.S. Geological Survey gaging stations (Figure 1) located throughout the SSJ starting in 1969 when temperature data were first available through 2015. Because of the migratory behavior of White Sturgeon, we used the averaged water temperature from all the stations (n= 32) in the SSJ. Average daily discharge data (m3/s) and salinity (practical salinity units; psu) between 1969 and 2015 were obtained from the California Department of Water Resources' estimate of the net delta outflow index (NDOI;California Department of Water Resources, 2016). All environmental variables were summarized using data from the growing season (01 April−30 September). **Data analysis** Age composition among sampling techniques and years was visually examined using box plots. Mean back-calculated lengths at age for individual fish were estimated using the Dahl-Lea method (Quist et al., 2012;Shoup and Michaletz, 2017). Describing patterns in growth over long time periods is complex, particularly for long-lived fishes whose lifespan transcends multiple decades. As such, we grouped White Sturgeon into one of three time periods (e.g., 1951–1970, 1971–1990, 1991–2012) based on their year class. These periods were selected to separate data into three roughly equal groups. We compared estimated back-calculated lengths at age for fish in each of the three time periods. We focused on the first 8 years of life. We truncated the data set because we sought to ensure consistency with other analyses (see below) and to maximize the number of fish that experienced growth within each of the three time periods. A Kruskal–Wallis test was used to examine differences in back-calculated lengths (Higgins, 2004). Back-calculated lengths are often correlated given that they represent repeated measures of growth from an individual (Shoup and Michaletz, 2017;Ogle et al., 2017). Consequently, we only tested for differences in back-calculated lengths at age 1 and age 8. A significant Kruskal–Wallis test was followed by a Dunn's test for multiple comparisons with a Holm's correction to control for the experiment-wise error rate (Higgins, 2004;Ogle, 2017). A mixed-effects regression model was used to evaluate abiotic and biotic factors related to growth of White Sturgeon (Weisberg et al., 2010;Watkins et al., 2017;Frawley et al., 2024). The model partitioned observed growth into multiple sources of variation—an environmental effect (including both fixed and random effects), the within-fish effect, and residual variation—such that: whereyckais theath annular increment for thekth fish from year classc;lais the annular increment for a fish in theath year of life;nijrepresents the fixed effect of an environmental variableifor yearj=c+a –1 (i.e., the year in which a fish in year-classcwas agea),hc+a−1is the random effect for a fish in year-classcthat was agea;fckis the random effect of fishkin thecth year-class; andeckais the error associated with the model. Year and individual fish were treated as random effects, whereas age and environmental variables were treated as fixed effects. Eight candidate models, including a null model (i.e., no environmental covariates), were developed using combinations of water temperature, discharge, and salinity. Competing models were ranked and evaluated for goodness of fit using Akaike Information Criterion corrected for small sample size (AICc;Burnham and Anderson, 2002). The model with the lowest AICcscore was considered the top model. Additional models were considered plausible if within two AICcof the top model. Akaike's weights (wi) were used to evaluate the relative likelihood of each model. Only age-8 and younger White Sturgeon were included in the mixed-effects modeling. Pectoral fin rays are generally considered the most practical and reliable ageing structure for White Sturgeon (Brennan and Cailliet, 1989), but issues with accuracy and precision have been identified, particularly for older fish (Rien and Beamesderfer, 1994;Ghere et al., 2024). Although broad patterns in age structure and summaries of growth are minimally influenced by modest ageing errors (Ghere et al., 2024), modeling growth as a function of environmental conditions in a specific year is depended on accurate age assignments. As such, we truncated the analysis to younger fish in an effort to minimize ageing errors. All statistical analyses were performed in R (Ogle, 2017;R Core Team, 2018). **Results** Age and growth were estimated from 1,897 White Sturgeon. Fork length at the time of capture varied between 25 and 217 cm FL (mean ± SD; 92.3 ± 32.1 cm) and age varied from 0 to 33 years (7.9 ± 4.9 years;Figure 2). The majority of fish (73%) were < 10 years old and nine individuals were age 30 or older. Year classes from 1951 to 2015 were sampled; the most individuals from a single year class (n= 233) were from the 1986 year-class (Figure 2). Age composition of the samples varied by sampling gear (Figure 3). Angling and trammel nets tended to capture older White Sturgeon than the other sampling techniques. Although age structure varied, we did not observe any patterns in growth associated with capture method. Age structure also varied by sampling year with a higher proportion of older fish sampled prior to 1990. White Sturgeon in samples prior to 1990 averaged ~10–15 years old with many age-25 and older fish. The average age of fish in the 1990s was generally < 10 years with few fish older than age 15 in the samples. After 2010, samples often contained age-15 and older White Sturgeon, and average age was around 10 years. Growth varied over time and among year classes (Table 2). White Sturgeon in year classes 1951–1970 grew the slowest, whereas fish in the most recent year classes (i.e., 1991–2012) appeared to be growing ~10% faster than during previous periods. Back-calculated lengths at age 1 were significantly different between White Sturgeon in year classes 1971–1990 and 1991–2012 (H= 11.7, df = 2,P= 0.003). Additionally, back-calculated lengths at age 8 were significantly greater for White Sturgeon from the 1991–2012 year classes compared to those from 1951 to 1970 (H= 16.9, df = 2,P= 0.002) and 1971–1990 (H= 16.9, df = 2,P= 0.005). Environmental characteristics were highly variable among years (Figure 4) but explained little variability in growth (Table 3). The top model was the null model. Figure 2. Frequency of fork length(A), estimated age-at-capture(B), and year class(C)of White Sturgeon (n= 1,897) sampled from 1983 to 2016 in the San Francisco Bay and the adjacent Sacramento-San Joaquin Delta, California. Figure 3. Estimated ages of White Sturgeon collected from San Francisco Bay and the adjacent Sacramento-San Joaquin Delta, California, from 1983 to 2016 using various gear types. Table 2. Mean back-calculated fork lengths at age (cm) for White Sturgeon sampled from different time periods in San Francisco Bay and the adjacent Sacramento-San Joaquin Delta, California. Figure 4. Environmental data associated with San Francisco Bay and the adjacent Sacramento-San Joaquin Delta, California, including mean water temperature(A), flow(B), and salinity(C)during the growing season (01 April−30 September) from 1969 to 2015. Table 3. Mixed-effect linear models of factors related to White Sturgeon growth San Francisco Bay and the adjacent Sacramento-San Joaquin Delta, California, sampled from 1983 to 2016. **Discussion** Knowledge of long-term patterns in fish population dynamics provides insight on influential factors that can be used to directly inform fisheries management and conservation decisions. Although such evaluations are complicated for long-lived species, our combined data set of contemporary and historical estimates provided a range of lengths and ages covering much of the White Sturgeon life cycle. Several long-term patterns in age structure were observed but may be complicated by biases in sampling techniques (Hayes et al., 2012;Hubert et al., 2012). White Sturgeon sampled between 1989 and 2003 tended to be younger than during other years; however, the only time that set lines and gill nets were used to sample White Sturgeon was during that time period. Fishery-independent gears (e.g., set lines, gill nets) used in the system often fail to capture exceptionally large White Sturgeon (Blackburn et al., 2019). Fishery-dependent samples (i.e., creel) are constrained by harvest regulations that have varied from minimum length limits to various harvest slot length limits (Kohlhorst et al., 1991;Blackburn et al., 2019). Lastly, we lack details on whether sampled fish were subsamples from a larger sample, particularly for those fish sampled in the 1980s and 1990s. As such, the age composition presented here is simply the age composition of the sample and not the age structure of the population. Nevertheless, other studies have reported recent reductions in age structure of White Sturgeon in the SSJ (e.g.,Kohlhorst et al., 1980,1991;Blackburn et al., 2019). Similar to age structure, the technique used to sample fish may be related to patterns in growth. For instance,Gabelhouse and Willis (1986)found biases associated with angling technique and season limited the use of data from Largemouth BassMicropterus nigricansangling tournaments in Kansas.Miranda et al. (1987)reported that use of angler-caught fish tended to overestimate growth of Largemouth Bass compared to data from fishery-independent survey methods. In contrast,Brauer et al. (2018)reported that estimates of growth were nearly identical between BurbotLota lotacaught by anglers and those collected using trammel nets in Flaming Gorge Reservoir, Wyoming-Utah. Unfortunately, sampling year and technique were largely confounded in the current study and precluded an adequate examination of the effects of sampling on growth. A variety of abiotic characteristics often regulate growth of fishes, but water temperature is arguably the most important (Cech et al., 1984;Mayfield and Cech, 2004;Kappenman et al., 2009). Although temperature was not in our top model, water temperature is an important regulating factor of sturgeon growth in other systems (Cech et al., 1984;Paragamian et al., 2005;Kappenman et al., 2009;Porter and Schramm, 2018). Several factors likely obscured any patterns between water temperature and growth of White Sturgeon in the system. In particular, White Sturgeon often move long distances in the system (Miller, 1972;Hildebrand et al., 2016;Miller et al., 2020), so our ability to identify the water temperature actually experienced by fish was likely limited. Ascertaining such insight would require recapture of fish with known movement patterns (e.g., using telemetry techniques) or combining growth evaluations with microchemistry analysis of fish in the system (e.g.,Sweeney et al., 2020;Sellheim et al., 2022). Given the frequency of long-term droughts and highly regulated water management practices in California, continued alterations to the thermal regime will likely pose a challenge to the conservation of native fishes, including White Sturgeon. Productivity of lotic and estuarine systems are dependent on flow variability and floodplain connectivity (Junk et al., 1989;Jager et al., 2001;Kiernan et al., 2012), but physical changes to riverine environments caused by water development projects have adversely affected fishes in river systems (DeVore et al., 1995;Beamesderfer and Farr, 1997;Jager et al., 2001;Armstrong and Hightower, 2002). Discharge was not included in top models of White Sturgeon growth in the SSJ. Although river discharge patterns (e.g., duration, timing, quantity) in large river systems have been shown to be important predictors of growth in several fish species (Quist and Guy, 1998;Kappenman et al., 2009;Quist and Spiegel, 2012;Crossman and Hildebrand, 2014), variability in discharge is a poor predictor of fish growth in other systems. For example,Klein et al. (2017)reported that seasonal flooding was not related to growth of several catostomid species in three Utah rivers. The authors hypothesized that changes in river morphology (i.e., downcutting) due to river regulation had disconnected the floodplain from the main channel, even during high flow events. In the Idaho portion of the Kootenai River,Watkins et al. (2017)found that discharge was not an important factor influencing growth of Mountain WhitefishProsopium williamsonior Largescale SuckersCatostomus macrocheilus. The Kootenai River is disconnected from its floodplain due to highly regulated flows and the presence of large levees. Similar mechanisms are likely operating in the SSJ where large water development projects in California have depleted nutrients and eliminated floodplain connections for over a century (Jaffe et al., 2007;Cloern and Jassby, 2012). One of the most obvious patterns observed in this study was fast growth of White Sturgeon in the most recent decades. Density-dependent changes in growth are widespread in fishes (e.g.,Fowler, 1981;Rieman and Myers, 1992;Hutchings, 2005), including sturgeon (e.g.,Haxton and Findlay, 2008;Justice et al., 2009). Therefore, fast growth of White Sturgeon in the SSJ may partly reflect a density-dependent response to changes in population density. White Sturgeon has long been the focus of commercial and recreational harvest in the system. In the late nineteenth and early twentieth centuries, an unregulated commercial fishery greatly reduced the abundance of White Sturgeon, particularly large, old fish (Pycha, 1956;Skinner, 1962). The population recovered during a complete fishing ban for White Sturgeon from 1917 to 1954 (Chadwick, 1959). The population was deemed resilient enough to support a fishery beginning in 1954. During the 1950s to 1980s, the population was stable to increasing with sustainable harvest rates (Chadwick, 1959;Kohlhorst et al., 1980). Exploitation was estimated to vary between 2 and 7% with most White Sturgeon caught incidentally by anglers targeting other species (Pycha, 1956;Miller, 1972;Kohlhorst et al., 1991). By the early 1990s, exploitation was around 10% as White Sturgeon angling became more popular and technology (e.g., fish finders) became more advanced (Kohlhorst et al., 1991). More recently,Blackburn et al. (2019)estimated that annual mortality varied from 8 to 30% from 2007 to 2015 with an average rate of about 14%. Concurrent with the increase in popularity of the White Sturgeon fishery and high exploitation was a decline in the abundance of White Sturgeon in the system. The CDFW has sporadically conducted an adult sturgeon survey since the late 1960s to provide information on the distribution and relative abundance of White Sturgeon in the SSJ. Since 2001, the average catch rate of White Sturgeon has been well below historical catch rates (DuBois and Danos, 2017). In response to concerns associated with low population density, the White Sturgeon harvest fishery was closed in 2024, and the species is now a candidate for listing under the California Endangered Species Act and proposed for listing under the federal Endangered Species Act. Regular estimation of population density and growth of White Sturgeon would be valuable in evaluating the role of density-dependence on growth of fish in the system. Research on long-term patterns in growth of fishes is rare, particularly long-lived species in river-delta-estuary systems. Such studies provide valuable insight that is not possible over short temporal scales. However, long-term evaluations are also complicated by variable sampling designs (e.g., location and frequency of sampling) and techniques through time. Although the age structure presented in this work should be interpreted with caution given concerns with gear bias, we are confident in the patterns presented with regard to growth. White Sturgeon are growing faster in recent decades. Systematic research supporting comprehensive assessment of growth, recruitment, and mortality of White Sturgeon in this population is particularly important for assessing current status and responses to future management actions. Additional research on movement and trophic dynamics of White Sturgeon would increase knowledge of their ecology in the system and the role of abiotic and biotic factors on growth. Integrating growth estimates with results from microchemistry analysis of fin rays (Sellheim et al., 2022) would be particularly valuable. Continued monitoring of individual growth rates, particularly in spatially explicit manner, will provide insight on White Sturgeon population dynamics and metrics for evaluating conservation actions. **Data availability statement** The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. **Ethics statement** Ethical approval was not required for the study involving animals in accordance with the local legislation and institutional requirements because the fin rays used for age and growth analysis were archived samples collected in the past. **Author contributions** MQ: Conceptualization, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Supervision, Writing – original draft, Writing – review & editing. SB: Conceptualization, Data curation, Formal analysis, Investigation, Methodology, Writing – review & editing. MU: Data curation, Formal analysis, Methodology, Writing – review & editing. ZJ: Conceptualization, Funding acquisition, Investigation, Methodology, Project administration, Writing – review & editing. **Funding** The author(s) declare that financial support was received for the research and/or publication of this article. Funding for the project was provided by California Department of Fish and Wildlife, the U.S. Fish and Wildlife Service, and the U.S. Geological Survey, Idaho Cooperative Fish and Wildlife Research Unit. The Unit is jointly sponsored by the U.S. Geological Survey, University of Idaho, Idaho Department of Fish and Game, and Wildlife Management Institute. Any use of trade, firm, or product names is for descriptive purposes only and does not imply endorsement by the U.S. Government. **Acknowledgments** We thank J. DuBois, M. Gingras, J. Faukner, G. Giannetta, M. Harris, L. Heironimus, Z. Jessee, G. Mytton, K Flowers, and G. Webb for assistance with fin ray collection and database management. S. Gilbert, T. Johnson, Z. Beard, D. Schmetterling, D. Kratville, J. Kelly, K. Sellheim, G. Steinhart, and two reviewers provided helpful comments on previous versions of the manuscript. **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. The author(s) declared that they were an editorial board member of Frontiers, at the time of submission. This had no impact on the peer review process and the final decision. **Generative AI statement** The author(s) declare that no Gen AI was used in the creation of this manuscript. **Publisher's note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **References** Armstrong, J. L., and Hightower, J. E. (2002). Potential for restoration of the Roanoke River population of Atlantic Sturgeon.J. Appl. Ichthyol.18, 475–480. doi: 10.1046/j.1439-0426.2002.00389.x Crossref Full Text|Google Scholar Beamesderfer, R. C. (1993). A standard weight equation for White Sturgeon.Calif. Fish Game79, 63–69. Google Scholar Beamesderfer, R. C., and Farr, F. A. (1997). Alternatives for the protection and restoration of sturgeons and their habitat.Environ. Biol. Fishes48, 407–417. doi: 10.1023/A:1007310916515 Crossref Full Text|Google Scholar Blackburn, S. E., Gingras, J. L., DuBois, J., Jackson, Z. J., and Quist, M. C. (2019). Population dynamics and evaluation of management scenarios for White Sturgeon in the Sacramento-San Joaquin River basin.North Am. J. Fisher. Manage.39, 896–912. doi: 10.1002/nafm.10316 Crossref Full Text|Google Scholar Boreman, J. (1997). Sensitivity of North American sturgeons and Paddlefish to fishing mortality.Environ. Biol. Fish.48, 399–405. doi: 10.1023/A:1007345806559 Crossref Full Text|Google Scholar Brauer, T. A., Rhea, D. T., Walrath, J. D., and Quist, M. C. (2018). Efficacy of using data from angler-caught Burbot to estimate population rate functions.North Am. J. Fisher. Manage.38, 346–354. doi: 10.1002/nafm.10031 Crossref Full Text|Google Scholar Brennan, J. S., and Cailliet, G. M. (1989). Comparative age-determination techniques for White Sturgeon in California.Trans. Am. Fisher. Soc.118, 296–310. doi: 10.1577/1548-8659(1989)118<0296:CATFWS>2.3.CO;2 Crossref Full Text|Google Scholar Burnham, K. P., and Anderson, D. R. (2002).Model Selection and Multi-Model Inference: A Practical Information Theoretic Approach, 2nd Edn. New York, NY: Springer. Google Scholar California Department of Water Resources (2016).On estimating Net Delta Outflow (NDO): Approaches to Estimating NDO in the Sacramento-San Joaquin Delta. Final Report. Sacramento, CA: California Department of Water Resources. Google Scholar Cech, J. J. Jr., Mitchell, S. J., and Wragg, T. E. (1984). Comparative growth of juvenile White Sturgeon and Striped Bass: effects of temperature and hypoxia.Estuaries7, 12–18. doi: 10.2307/1351952 Crossref Full Text|Google Scholar Chadwick, H. K. (1959). California sturgeon tagging studies.Calif. Fish Game45, 297–301. Google Scholar Cloern, J. E., and Jassby, A. D. (2012). Drivers of change in estuarine-coastal ecosystems: discoveries from four decades of study in the San Francisco Bay.Rev. Geophys.50, 1–33. doi: 10.1029/2012RG000397 Crossref Full Text|Google Scholar Coutant, C. C. (2004). A riparian habitat hypothesis for successful reproduction of White Sturgeon.Rev. Fisher. Sci.12, 23–73. doi: 10.1080/10641260490273023 Crossref Full Text|Google Scholar Crossman, J. A., and Hildebrand, L. R. (2014). Evaluation of spawning substrate enhancement for White Sturgeon in a regulated river: effects on larval retention and dispersal.River Res. Appl.30, 1–10. doi: 10.1002/rra.2620 Crossref Full Text|Google Scholar DeVore, J. D., James, B. W., Tracy, C. A., and Hale, D. A. (1995). Dynamics and potential production of White Sturgeon in the Columbia River downstream from Bonneville Dam.Trans. Am. Fisher. Soc.124, 845–856. doi: 10.1577/1548-8659(1995)124<0845:DAPPOW>2.3.CO;2 Crossref Full Text|Google Scholar DuBois, J., and Danos, A. (2017).Field Season Summary for the Adult Sturgeon Population Study. Stockton, CA: California Department of Fish and Wildlife. Google Scholar DuBois, J., Gleason, E., and Gingras, M. (2010). Review of juvenile sturgeon setline survey.Interag. Ecol. Program San Francisco Estuary Newslett.23, 24–33. Google Scholar Feyrer, F., Young, M. J., Huntsman, B. M., and Brown, L. R. (2021). Disentangling stationary and dynamic estuarine fish habitat to inform conservation: species-specific responses to physical habitat and water quality in San Francisco Estuary.Marine Coastal Fisher.13, 548–563. doi: 10.1002/mcf2.10183 Crossref Full Text|Google Scholar Fowler, C. W. (1981). Density dependence as related to life history strategy.Ecol. Soc. Am.62, 602–610. doi: 10.2307/1937727 Crossref Full Text|Google Scholar Frawley, S. E., Corsi, J. P., Dux, A. M., Hardy, R. S., and Quist, M. C. (2024). Abiotic and biotic factors related to growth of nonnative Walleyes in Lake Pend Oreille, Idaho.North Am. J. Fisher. Manage.44, 1325–1341. doi: 10.1002/nafm.11056 Crossref Full Text|Google Scholar Gabelhouse, D. W. Jr., and Willis, D. W. (1986). Biases and utility of angler catch data for assessing size structure and density of Largemouth Bass.North Am. J. Fisher. Manage.6, 481–489. doi: 10.1577/1548-8659(1986)6<481:BAUOAC>2.0.CO;2 Crossref Full Text|Google Scholar Ghere, C. L., Hardy, R. S., Wilson, S. M., and Quist, M. C. (2024). Evaluation of techniques for estimating the age and growth of known-age White Sturgeon.North Am. J. Fisher. Manage.44, 880–889. doi: 10.1002/nafm.11021 Crossref Full Text|Google Scholar Gingras, M., DuBois, J., and Fish, M. A. (2013). Further investigations into San Francisco estuary White Sturgeon (Acipenser transmontanus) year-class strength.Interag. Ecol. Program San Francisco Estuary Newslett.26, 10–12. Google Scholar Haxton, T. J., and Findlay, C. S. (2008). Variation in Lake Sturgeon (Acipenser fulvescns) abundance and growth among river reaches in a large regulated river.Can. J. Fisher. Aquatic Sci.65, 645–657. doi: 10.1139/f08-005 PubMed Abstract|Crossref Full Text|Google Scholar Hayes, D. B., Ferreri, P., and Taylor, W. W. (2012). “Active capture techniques,” inFisheries Techniques, 3rd Edn., eds. A. V. Zale, D. L. Parrish, and T. M. Sutton (Bethesda, MD: American Fisheries Society), 267–304. Google Scholar He, M. (2022). Assessing change in 21st century mean and extreme climate of the Sacramento-San Joaquin Delta in California.Climate10:16. doi: 10.3390/cli10020016 Crossref Full Text|Google Scholar Higgins, J. J. (2004).An Introduction to Modern Nonparametric Statistics. Pacific Grove, CA: Brooks/Cole Publishing Company. Google Scholar Hildebrand, L. R., Schreier, A. D., Lepla, K., McAdam, S. O., McLellan, J., Parsley, M. J., et al. (2016). Status of White Sturgeon (Acipenser transmontanusRichardson, 1863) throughout the species range, threats to survival, and prognosis for the future.J. Appl. Ichthyol.32, 261–312. doi: 10.1111/jai.13243 Crossref Full Text|Google Scholar Hubert, W. A., Pope, K. L., and Dettmers, J. M. (2012). “Passive capture techniques,” inFisheries Techniques, 3rd Edn., eds. A. V. Zale, D. L. Parrish, and T. M. Sutton (Bethesda, MD: American Fisheries Society), 223–265. doi: 10.47886/9781934874295.ch6 Crossref Full Text|Google Scholar Hutchings, J. A. (2005). Life history consequences of overexploitation to population recovery in Northwest Atlantic Cod (Gadus morhua).Can. J. Fisher. Aquatic Sci.62, 824–832. doi: 10.1139/f05-081 Crossref Full Text|Google Scholar Jackson, Z. J., Gruber, J. J., and Van Eenennaam, J. P. (2016). White Sturgeon spawning in the San Joaquin River, California and effects of water management.J. Fish Wildl. Manage.7, 171–180. doi: 10.3996/092015-JFWM-092 Crossref Full Text|Google Scholar Jaffe, B. E., Smith, R. E., and Foxgrover, A. C. (2007). Anthropogenic influence on sedimentation and intertidal mudflat change in San Pablo Bay, California: 1856–1983.Esutarine Coastal Shelf Sci.73, 175–187. doi: 10.1016/j.ecss.2007.02.017 Crossref Full Text|Google Scholar Jager, H. I., Chandler, J. A., Lepla, K. B., and Van Winkle, W. (2001). A theoretical study of river fragmentation by dams and its effects on White Sturgeon populations.Environ. Biol. Fish.60, 347–361. doi: 10.1023/A:1011036127663 Crossref Full Text|Google Scholar Jay, K. J., Crossman, J. A., and Scribner, K. T. (2020). Temperature affects transition timing and phenotype between key developmental stages in White SturgeonAcipenser transmontanusyolk-sac larvae.Environ. Biol. Fish.103, 1149–1162. doi: 10.1007/s10641-020-01007-1 Crossref Full Text|Google Scholar Junk, W. J., Bayley, P. B., and Sparks, R. E. (1989). “The flood pulse concept in river-floodplain systems,” inProceedings of the International Large River Symposium, ed. D. P. Dodge (Nanaimo, BC: Canadian Journal of Fisheries and Aquatic Sciences Special Publication), 110–127. Google Scholar Justice, C., Pyper, B. J., Beamesderfer, R. C., Paragamian, V. L., Rust, P. J., Neufeld, M. D., et al. (2009). Evidence of density- and size-dependent mortality in hatchery-reared juvenile White Sturgeon (Acipenser transmontanus) in the Kootenai River.Can. J. Fisher. Aquatic Sci.66, 802–815. doi: 10.1139/F09-034 Crossref Full Text|Google Scholar Kappenman, K. M., Fraser, W. C., Toner, M., Dean, J., and Webb, M. A. H. (2009). Effect of temperature on growth, condition, and survival of juvenile Shovelnose Sturgeon.Trans. Am. Fish. Soc.138, 927–937. doi: 10.1577/T07-265.1 Crossref Full Text|Google Scholar Katopodis, C., Cai, L., and Johnson, D. (2019). Sturgeon survival: the role of swimming performance and fish passage research.Fisher. Res.212, 162–171. doi: 10.1016/j.fishres.2018.12.027 Crossref Full Text|Google Scholar Kerns, J. A., and Lombardi-Carlson, L. A. (2017). “History and importance of age and growth information,” inAge and Growth of Fishes: Principles and Techniques, eds. M. C. Quist and D. A. Isermann (Bethesda, MD: American Fisheries Society), 1–8. doi: 10.47886/9781934874486.ch1 Crossref Full Text|Google Scholar Kiernan, J. D., Moyle, P. B., and Crain, P. K. (2012). Restoring native fish assemblages to a regulated California stream using the natural flow regime concept.Ecol. Appl.22, 1472–1482. doi: 10.1890/11-0480.1 PubMed Abstract|Crossref Full Text|Google Scholar Klein, Z. B., Breen, M. J., and Quist, M. C. (2017). Population characteristics and the influence of discharge on Bluehead Sucker and Flannelmouth Sucker.Copeia105:375388. doi: 10.1643/CE-16-554 Crossref Full Text|Google Scholar Koch, J. D., and Quist, M. C. (2007). A technique for preparing fin rays and spines for age and growth analysis.North Am. J. Fisher. Manage.27, 781–784. doi: 10.1577/M06-224.1 Crossref Full Text|Google Scholar Koch, J. D., Schreck, W. J., and Quist, M. C. (2008). Standardised removal and sectioning locations for Shovelnose Sturgeon fin rays.Fisher. Manage. Ecol.15, 139–145. doi: 10.1111/j.1365-2400.2008.00594.x Crossref Full Text|Google Scholar Kohlhorst, D. W., Botsford, L. W., Brennan, J. S., and Cailliet, G. M. (1991). “Aspects of the structure and dynamics of an exploited central California population of White Sturgeon (Acipenser transmontanus),” inAcipenser: Actes du premier colloquy international sur l'esturgeon, ed. P. Williot (Bordeaux: CEMAGREF), 277–283. Google Scholar Kohlhorst, D. W., Miller, L. W., and Orsi, J. J. (1980). Age and growth of White Sturgeon collected in the Sacramento-San Joaquin Estuary, California: 1965–1970 and 1973–1976.Calif. Fish Game66, 83–95. Google Scholar Mayfield, R. B., and Cech, J. J. Jr. (2004). Temperature effects on Green Sturgeon bioenergetics.Trans. Am. Fisher. Soc.133, 961–970. doi: 10.1577/T02-144.1 PubMed Abstract|Crossref Full Text|Google Scholar Merz, J. E., Bergman, P. S., Simonis, J. L., Delaney, D., Pierson, J., Anders, P., et al. (2016). Long-term seasonal trends in the prey community of Delta Smelt (Hypomesus transpacificus) within the Sacramento-San Joaquin Delta, California.Estuar. Coasts39, 1526–1536. doi: 10.1007/s12237-016-0097-x Crossref Full Text|Google Scholar Miller, E. A., Singer, G. P., Peterson, M. L., Chapman, E. D., Johnston, M. E., Thomas, M. J., et al. (2020). Spatio-temporal distribution of Green Sturgeon (Acipenser medirostris) and White Sturgeon (A. transmontanus) in the San Francisco Estuary and Sacramento River, California.Environ. Biol. Fish.103, 1163–1164. doi: 10.1007/s10641-020-01006-2 PubMed Abstract|Crossref Full Text|Google Scholar Miller, L. W. (1972). White Sturgeon population characteristics in the Sacramento-San Joaquin Estuary as measured by tagging.Calif. Fish Game58, 94–101. Google Scholar Miranda, L. E., Wingo, W. M., Muncy, R. J., and Bates, T. D. (1987). “Bias in growth estimates derived from fish collected by anglers,” inThe Age and Growth of Fishes, ed. R. C. Summerfelt and G. E. Hall (Ames, IA: Iowa State University Press), 211–220. Google Scholar Mora, E. A., Battleson, R. D., Lindley, S. T., Thomas, M. J., Bellmer, R., Zarri, L. J., et al. (2018). Estimating the annual spawing run size and population size of the southern distinct population segment of Green Sturgeon.Trans. Am. Fisher. Soc.147, 195–203. doi: 10.1002/tafs.10009 Crossref Full Text|Google Scholar Moyle, P. B., Katz, J. V., and Quinones, R. M. (2011). Rapid decline of California's native inland fishes: a status assessment.Biol. Conserv.144, 2414–2423. doi: 10.1016/j.biocon.2011.06.002 Crossref Full Text|Google Scholar Nichols, F. H., Cloern, J. E., Luoma, S. N., and Peterson, D. H. (1986). The modification of an estuary.Science567–573. doi: 10.1126/science.231.4738.567 PubMed Abstract|Crossref Full Text|Google Scholar Ogle, D. H. (2017).FSA: Fisheries Stock Analysis. R Package Version 0.8,13. Google Scholar Ogle, D. H., Brenden, T. O., and McCormick, J. L. (2017). “Growth estimation: growth models and statistical inference,” inAge and Growth of Fishes: Principles and Techniques, eds. M. C. Quist and D. A. Isermann (Bethesda, MD: American Fisheries Society), 265–352. doi: 10.47886/9781934874486.ch12 Crossref Full Text|Google Scholar Paragamian, V. L., Beamesderfer, R. C., and Ireland, S. C. (2005). Status, population dynamics, and future prospects of the endangered Kootenai River White Sturgeon population with and without hatchery intervention.Trans. Am. Fisher. Soc.134, 518–532. doi: 10.1577/T03-011.1 Crossref Full Text|Google Scholar Pikitch, E. K., Doukakis, P., Lauck, L., Chakrabarty, P., and Erickson, D. L. (2005). Status, trends, and management of sturgeon and paddlefish.Fish Fisher.6, 233–265. doi: 10.1111/j.1467-2979.2005.00190.x Crossref Full Text|Google Scholar Porter, J. M., and Schramm, H. L. Jr. (2018). Effects of temperature and hydrology on growth of Shovelnose SturgeonScaphirhynchus platorynchus(Rafinesque, 1820) in the lower Mississippi River.J. Appl. Ichthyol.34, 21–28. doi: 10.1111/jai.13548 Crossref Full Text|Google Scholar Pycha, R. L. (1956). Progress report on White Sturgeon studies.Calif. Fish Game42, 23–35. Google Scholar Quist, M. C., and Guy, C. S. (1998). Population characteristics of Channel Catfish from the Kansas River, Kansas.J. Freshw. Ecol.13, 351–359. doi: 10.1080/02705060.1998.9663628 PubMed Abstract|Crossref Full Text|Google Scholar Quist, M. C., Pegg, M. A., and DeVries, D. R. (2012). “Age and growth,” inFisheries Techniques, 3rd Edn., eds. A. V. Zale, D. L. Parrish, and T. M. Sutton (Bethesda, MD: American Fisheries Society), 677–731. Google Scholar Quist, M. C., and Spiegel, J. R. (2012). Population demographics of catostomids in large river ecosystems: effects of discharge and temperature on recruitment dynamics and growth.River Res. Appl.28, 1567–1586. doi: 10.1002/rra.1545 Crossref Full Text|Google Scholar R Core Team (2018).R: A Language and Environment for Statistical Computing. Vienna: R Foundation for Statistical Computing. Available online at:https://www.R-project.org(accessed December 16, 2024). Google Scholar Rieman, B. E., and Myers, D. L. (1992). Influence of fish density and relative productivity on growth of kokanee in ten oligotrophic lakes and reservoirs in Idaho.Trans. Am. Fisher. Soc.121, 178–191. doi: 10.1577/1548-8659(1992)121<0178:IOFDAR>2.3.CO;2 Crossref Full Text|Google Scholar Rien, T. A., and Beamesderfer, R. C. (1994). Accuracy and precision of White Sturgeon age estimates from pectoral fin rays.Trans. Am. Fish. Soc.123, 255–265. doi: 10.1577/1548-8659(1994)123<0255:AAPOWS>2.3.CO;2 Crossref Full Text|Google Scholar Sellheim, K., Willmes, M., Lewis, L. S., Sweeney, J., Merz, J., Hobbs, J. A., et al. (2022). Diversity in habitat use by White Sturgeon revealed using fin ray geochemistry.Front. Marine Sci.9:859038. doi: 10.3389/fmars.2022.859038 Crossref Full Text|Google Scholar Shirley, D. E. (1987).Age distribution of White Sturgeon (Acipenser transmontanus) in the Sacramento-San Joaquin Bay-Delta(Master's thesis). University of California, Davis, Davis, CA, United States. Google Scholar Shoup, D. E., and Michaletz, P. H. (2017). “Growth estimation: summarization,” inAge and Growth of Fishes: Principles and Techniques, eds. M. C. Quist, and D. A. Isermann (Bethesda, MD: American Fisheries Society), 233–264. doi: 10.47886/9781934874486.ch11 Crossref Full Text|Google Scholar Skinner, J. E. (1962).An historical review of the fish and wildlife resources of the San Francisco Bay area. California Department of Fish and Game Water Project Branch Report. Sacramento, CA: California Department of Fish and Wildlife, p. 1. Google Scholar Sweeney, J. K., Willmes, M., Sellheim, K., Lewis, L. S., Hobbs, J. A., Fangue, N. A., et al. (2020). Ontogenetic patterns in the calcification and element incorporation in fin rays of age-0 White Sturgeon.Environ. Biol. Fish.103, 1401–1418. doi: 10.1007/s10641-020-01031-1 Crossref Full Text|Google Scholar Tashjian, D., Cech, J. J. Jr., and Hung, S. S. O. (2007). Influence of dietary L-selenomethionine on the survival and osmoregulatory capacity of White Sturgeon in fresh and brackish water.Fish Physiol. Biochem.33, 109–119. doi: 10.1007/s10695-006-9122-5 Crossref Full Text|Google Scholar Ulaski, M. E., Blackburn, S. E., Jackson, Z. J., and Quist, M. C. (2022). Management goals for conserving White Sturgeon in the Sacramento-San Joaquin River basin.J. Fish Wildl. Manage.13, 334–343. doi: 10.3996/JFWM-21-070 Crossref Full Text|Google Scholar Watkins, C. J., Ross, T. J., Quist, M. C., and Hardy, R. S. (2017). Response of fish population dynamics to mitigation activities in a large regulated river.Trans. Am. Fisher. Soc.146, 703–715. doi: 10.1080/00028487.2017.1308882 Crossref Full Text|Google Scholar Weisberg, S., Spangler, G., and Richmond, L. S. (2010). Mixed effects models for fish growth.Can. J. Fisher. Aquatic Sci.67, 269–277. doi: 10.1139/F09-181 Crossref Full Text|Google Scholar Winder, M., and Jassby, A. D. (2011). Shifts in zooplankton community structure: implications for food-web processes in the upper San Franscisco Estuary.Estuaries Coasts34, 675–690. doi: 10.1007/s12237-010-9342-x Crossref Full Text|Google Scholar Keywords:fish, Sturgeon, growth, temperature, population ecology, discharge Citation:Quist MC, Blackburn SE, Ulaski ME and Jackson ZJ (2025) Long-term patterns in growth of White Sturgeon in the Sacramento-San Joaquin River Basin, California.Front. Freshw. Sci.3:1577065. doi: 10.3389/ffwsc.2025.1577065 Received:14 February 2025;Accepted:08 April 2025;Published:07 May 2025. Edited by: Reviewed by: Copyright© 2025 Quist, Blackburn, Ulaski and Jackson. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Michael C. Quist,bWNxdWlzdEB1aWRhaG8uZWR1 †Present addresses:Shannon E. Blackburn, Montana Department of Fish, Wildlife and Parks, Billings, MT, United StatesMarta E. Ulaski, Earth to Ocean Research Group, Simon Fraser University, Burnaby, BC, Canada Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract Introduction Methods Results Discussion Data availability statement Ethics statement Author contributions Funding Acknowledgments Conflict of interest Generative AI statement Publisher's note References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}