{"id": 1553, "name": "WBHM - NPR - Birmingham", "domain": "wbhm.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://wbhm.org/2025/canceled-climate-grants-would-have-cut-pollution-while-boosting-production-jobs-at-two-alabama-ironworks/", "title": "Canceled Climate Grants Would Have Cut Pollution While Boosting Production Jobs At Two Alabama Ironworks", "content": "NewsWBHM NewsGulf States NewsroomAmerica Amplified Election 2024Utility Bill of The MonthDeliberate IndifferenceJournalism Code of IntegrityWBHM’s Local Journalism Innovation FundNewsletters WBHM News Gulf States Newsroom America Amplified Election 2024 Utility Bill of The Month Deliberate Indifference Journalism Code of Integrity WBHM’s Local Journalism Innovation Fund Newsletters WBHM News Gulf States Newsroom America Amplified Election 2024 Utility Bill of The Month Deliberate Indifference Journalism Code of Integrity WBHM’s Local Journalism Innovation Fund Newsletters ResourcesHope And HelpResource Guide Hope And Help Resource Guide Hope And Help Resource Guide ProgramsAll ShowsAnthems of PrideHow To ListenSchedule All Shows Anthems of Pride How To Listen Schedule All Shows Anthems of Pride How To Listen Schedule MembershipDONATESustaining Membership FAQ’SUpdate Your Credit CardDonate Your VehicleMatched GivingFoundation SupportGift PlanningMemberConnect DONATE Sustaining Membership FAQ’S Update Your Credit Card Donate Your Vehicle Matched Giving Foundation Support Gift Planning MemberConnect DONATE Sustaining Membership FAQ’S Update Your Credit Card Donate Your Vehicle Matched Giving Foundation Support Gift Planning MemberConnect SponsorshipCurrent SponsorsCommunity Sponsor CirclePay Your InvoiceWhy become a sponsor?Sponsorship Guidelines Current Sponsors Community Sponsor Circle Pay Your Invoice Why become a sponsor? Sponsorship Guidelines Current Sponsors Community Sponsor Circle Pay Your Invoice Why become a sponsor? Sponsorship Guidelines AboutWho We AreOur TeamBoard of TrusteesJunior BoardWBHM’s Local Journalism Innovation FundCoverage MapCareersPrivacy Policy Who We Are Our Team Board of Trustees Junior Board WBHM’s Local Journalism Innovation Fund Coverage Map Careers Privacy Policy Who We Are Our Team Board of Trustees Junior Board WBHM’s Local Journalism Innovation Fund Coverage Map Careers Privacy Policy ContactContact UsHow to Connect Contact Us How to Connect Contact Us How to Connect NewsWBHM NewsGulf States NewsroomAmerica Amplified Election 2024Utility Bill of The MonthDeliberate IndifferenceJournalism Code of IntegrityWBHM’s Local Journalism Innovation FundNewsletters WBHM News Gulf States Newsroom America Amplified Election 2024 Utility Bill of The Month Deliberate Indifference Journalism Code of Integrity WBHM’s Local Journalism Innovation Fund Newsletters WBHM News Gulf States Newsroom America Amplified Election 2024 Utility Bill of The Month Deliberate Indifference Journalism Code of Integrity WBHM’s Local Journalism Innovation Fund Newsletters ResourcesHope And HelpResource Guide Hope And Help Resource Guide Hope And Help Resource Guide ProgramsAll ShowsAnthems of PrideHow To ListenSchedule All Shows Anthems of Pride How To Listen Schedule All Shows Anthems of Pride How To Listen Schedule MembershipDONATESustaining Membership FAQ’SUpdate Your Credit CardDonate Your VehicleMatched GivingFoundation SupportGift PlanningMemberConnect DONATE Sustaining Membership FAQ’S Update Your Credit Card Donate Your Vehicle Matched Giving Foundation Support Gift Planning MemberConnect DONATE Sustaining Membership FAQ’S Update Your Credit Card Donate Your Vehicle Matched Giving Foundation Support Gift Planning MemberConnect SponsorshipCurrent SponsorsCommunity Sponsor CirclePay Your InvoiceWhy become a sponsor?Sponsorship Guidelines Current Sponsors Community Sponsor Circle Pay Your Invoice Why become a sponsor? Sponsorship Guidelines Current Sponsors Community Sponsor Circle Pay Your Invoice Why become a sponsor? Sponsorship Guidelines AboutWho We AreOur TeamBoard of TrusteesJunior BoardWBHM’s Local Journalism Innovation FundCoverage MapCareersPrivacy Policy Who We Are Our Team Board of Trustees Junior Board WBHM’s Local Journalism Innovation Fund Coverage Map Careers Privacy Policy Who We Are Our Team Board of Trustees Junior Board WBHM’s Local Journalism Innovation Fund Coverage Map Careers Privacy Policy ContactContact UsHow to Connect Contact Us How to Connect Contact Us How to Connect |DONATE **Canceled climate grants would have cut pollution while boosting production, jobs at two Alabama ironworks** June 10, 2025 American Cast Iron Pipe (ACIPCO) was founded in Birmingham in 1905 and employs approximately 1,600 people at its Birmingham facilities. Dennis Pillion, Inside Climate News This article originally appeared onInside Climate News, a nonprofit, independent news organization that covers climate, energy and the environment. It is republished with permission. Sign up for their newsletterhere. By Dennis Pillion, Inside Climate News BIRMINGHAM, Ala.—Two iron pipe manufacturers in Alabama learned last month they lost a combined $150 million in promised federal funding that would have increased productivity and employment while slashing greenhouse gas emissions and other air pollution. The grants, $75 million each, were issued to the American Cast Iron Pipe Company in Birmingham and the U.S. Pipe and Foundry Company in Bessemer through the U.S. Department of Energy’s Office of Clean Energy Demonstrations to replace older coke or gas-fueled blast furnaces with electric induction furnaces. The projects were estimated to cut the greenhouse gas emissions at U.S. Pipe by 73 percent and at American Cast Iron Pipe by 62 percent. “This project is expected to reduce the cost of operations, improve manufacturing capacity, and enhance overall melting process and reliability, demonstrating the viability of electrifying a core process for iron and steel manufacturing,” theU.S. Pipe project descriptionstates. The two Alabama grants were among24 clean energy awards terminated last weekby the Department of Energy, totaling $3.7 billion. The DOE said in a news release announcing the cuts that the terminated awards “failed to advance the energy needs of the American people, were not economically viable and would not generate a positive return on investment of taxpayer dollars.” Energy Secretary Chris Wright said in the release that the Biden administration “failed to conduct a thorough financial review” before approving the projects last year. “While the previous administration failed to conduct a thorough financial review before signing away billions of taxpayer dollars, the Trump administration is doing our due diligence to ensure we are utilizing taxpayer dollars to strengthen our national security, bolster affordable, reliable energy sources and advance projects that generate the highest possible return on investment,” Wright said. “Today, we are acting in the best interest of the American people by cancelling these 24 awards.” Both companies have deep roots in Birmingham’s industrial center and have been operating in the area for more than a century. Both make ductile iron pipes used for water and wastewater infrastructure, among other products. The projects would have decreased both facilities’ reliance on coke as fuel. Coke, a purified form of coal, is created by “baking” coal in high-temperature, low oxygen ovens to remove impurities. The ovens use large amounts of energy to make coke, and are often associated with numerous potentially hazardous emissions. TheNational Cancer Institute warnsthat coke oven emissions “typically include carcinogens such as cadmium and arsenic,” and that “[e]xposure to coke oven emissions increases the risk oflung cancerand, possibly,kidney cancer.” A coke plant in Birmingham wasshuttered by local authorities due to alleged Clean Air Act violationsin 2021 and has not reopened. “By replacing the burning of coke with electric induction, this project would substantially improve air quality including reductions in particulate matter, nitrogen oxides, and sulfur oxides for nearby communities,” the U.S. Pipe project description states. American Cast Iron Pipe, or ACIPCO, said it “remains committed to moving forward” with the project despite the loss of federal funding. “American is disappointed to learn that our cooperative agreement with the Department of Energy for our Next Generation Melt Project has been terminated,” the company said in a released statement. “Once completed, the Next Generation Melt Project and future downstream projects will increase capacity, provide flexibility with production scheduling and add high-quality, high-paying jobs,” the company said. According to the company website, the project isestimated to be completed in 2029. ACIPCO was founded in Birmingham in 1905 and employs approximately 1,600 people at its Birmingham facilities. U.S. Pipe did not respond to requests for comment from Inside Climate News or other media outlets. The company removed a 2024 press release touting the grant from its website and has not indicated whether it plans to continue the electrification project. U.S. Pipe was created in 1899 by consolidating 14 iron and steel foundries in nine states. One of those was theHoward-Harrison Iron Company in Bessemer. Local economic development agencies say U.S. Pipe employs970 people in Alabama. **** **In Miami, deportations are raising concerns among Cuban-Americans** South Florida's Cuban-American community supports President Trump, but some members are uneasy with his immigration policies. \"I'm not for deporting people without criminal records.\" **Performers and video game companies reach deal that ends nearly year-long strike** Performers who do stunt and voice work for video games went on strike in July after reaching a stalemate in negotiations over how companies can use A.I. in game development. **Trump’s EPA plans to repeal climate pollution limits on fossil fuel power plants** The Trump administration plans to get rid of all limits on climate-warming pollution from the nation's fossil fuel power plants. Fossil fuel interests hailed the proposal, which likely faces legal challenges from environmental groups. **Brian Wilson: NPR’s interviews, concerts and appreciations** The Beach Boys' co-founder Brian Wilson has died at the age of 82, leaving behind a storied legacy as one of pop music's greatest songwriters and producers. Here are NPR's best interviews, concerts and appreciations of the late artist. **Jury finds Harvey Weinstein guilty in sex crimes case** Weinstein's 2020 conviction on sex crimes in New York was overturned last year. In a new trial, jurors heard allegations from three women. **Drag performers plan to protest Trump’s attendance of ‘Les Mis’ at the Kennedy Center** The drag performers are expected to attend the musical alongside Trump, who after changing leadership at the Kennedy Center, said he would end drag shows there. View our privacy statement. PCI Compliant – CompliAssured ™ Secured FCC Public Inspection File Equal Employment Opportunity Commission (EEOC) Report Financial Statements American Public Media Alabama Public Television (APT) Birmingham Business Journal BirminghamWatch Corporation For Public Broadcasting (CPB) National Public Radio Public Radio Exchange (PRX) WNYC Studios University of Alabama at Birmingham © WBHM 90.3"}