{"id": 320, "name": "Arlington Heights Daily Herald", "domain": "dailyherald.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.dailyherald.com/20250611/nation-and-world-politics/la-police-swiftly-enforce-downtown-curfew-as-protests-against-trumps-immigration-crackdown-continue/", "title": "La Police Swiftly Enforce Downtown Curfew As Protests Against Trumps Immigration Crackdown Continue", "content": "Log Out Account Profile Newsletters Subscribe Log In Today’s Stories News Sports Opinion Obituaries Business Entertainment Lifestyle Classifieds Calendar Twitter Facebook Instagram **Police detain more than 20 people on first night of curfew aimed at protests in downtown Los Angeles** LOS ANGELES — Police detained more than 20 people, mostly on curfew violations, on the first night of restrictions in downtown Los Angeles and used crowd-control projectiles to break up hundreds of protesters demonstrating againstPresident Donald Trump’s immigration crackdown, officials said Wednesday. But there werefewer clashesbetween police and demonstrators than on previous nights, and by daybreak, the downtown streets were bustling with residents walking dogs and commuters clutching coffee cups. Officials said the curfew was necessary to stop vandalism and theft by agitators after five days of protests, which have mostly been concentrated downtown.Demonstrations have also spreadto other cities nationwide, including Dallas and Austin in Texas, and Chicago and New York, where thousands rallied and more arrests were made. LA's nightly curfew, which the mayor said would remain in effect as long as necessary, covers a 1-square-mile (2.5-square-kilometer) section that includes an area where protests have occurred since Friday in the sprawling city of 4 million. The city of Los Angeles encompasses roughly 500 square miles (1,295 square kilometers). “If there are raids that continue, if there are soldiers marching up and down our streets, I would imagine that the curfew will continue,” Mayor Karen Bass said. The tensions in LA and elsewhere emerged as immigration authorities seek to dramatically increase the number of daily arrests across the country. Bass said the raids spread fear across the city at the behest of the White House. “We started off by hearing the administration wanted to go after violent felons, gang members, drug dealers,” she told a news conference. “But when you raid Home Depots and workplaces, when you tear parents and children apart, and when you run armored caravans through our streets, you’re not trying to keep anyone safe. You’re trying to cause fear and panic.” Referring to the protests, she added: “If you drive a few blocks outside of downtown, you don’t know that anything is happening in the city at all.” Some 2,000 National Guard soldiers are in the city, and about half of them have been protecting federal buildings and agents, said Army Maj. Gen. Scott Sherman, head of Task Force 51, which is overseeing the deployment of National Guard and Marines to Los Angeles. About 700 Marines will soon join the Guard troops, but they are still undergoing training and will not be mobilized Wednesday, Sherman said. Another 2,000 Guard troops should be on the streets by Thursday, he said. Democratic Gov. Gavin Newsom hasaccused Trump of drawing a “military dragnet”across the nation’s second-largest city with his escalating use of the National Guard, which Trump activated, along with the Marines, over the objections of city and state leaders. Newsom asked a court to put an emergency stop to the military helping federal immigration agents. The assistance includes some guardsmen now standing protectively around agents as they carry out arrests. A judge set a hearing for Thursday, giving the administration several days to continue its activities. The change moves the military closer to engaging in law enforcement actions such as deportations, asTrump has promisedas part of hisimmigration crackdown. The Guard has the authority to temporarily detain people who attack officers, but any arrests would be made by law enforcement. The president posted on the Truth Social platform that the city “would be burning to the ground” if he had not sent in the military. Meanwhile in New York City, police said they took 86 people into custody during protests in lower Manhattan that lasted into Wednesday morning. Police Commissioner Jessica Tisch said the vast majority of demonstrators were peaceful. A 66-year-old woman in Chicago was injured when she was struck by a car during downtown protests Tuesday evening, police said. Video showed a car speeding down a street where people were protesting. In Texas, where police in Austin used chemical irritants to disperse several hundred demonstrators Monday, Republican Gov. Greg Abbott’s office said Texas National Guard troops were “on standby” in areas where demonstrations are planned. Guard members were sent to San Antonio, but Police Chief William McManus said he had not been told how many troops were deployed or their role ahead of planned protests Wednesday night and Saturday. Authorities announce arrests in protests Two people accused of throwing Molotov cocktails at police during the LA protests over the weekend face charges that could bring up to 10 years in prison, the Justice Department announced Wednesday. No one was injured by the devices. One of the suspects is a U.S. citizen, and the other overstayed a tourist visa and was in the U.S. illegally, authorities said. “We are looking at hundreds of people,” U.S. Attorney Bill Essayli said. “If you took part in these riots and were looking to cause trouble, we will come looking for you.” Trump, Newsom locked in a war of words Trump hascalled the protesters “animals”and “a foreign enemy” and described Los Angeles in dire terms that the governor says isnowhere close to the truth. Newsom called Trump’s actions the start of an “assault” on democracy. “California may be first, but it clearly will not end here. Other states are next,” he said. The protests began Friday after federal immigration raids arrested dozens of workers in Los Angeles. Protesters blocked a major freeway and set cars on fire over the weekend, andpolice respondedwith tear gas, rubber bullets and flash-bang grenades. Thousands of people have peacefully rallied outside City Hall and hundreds more protested outside a federal complex that includes a detention center where some immigrants are being held following workplace raids. Despite the protests, immigration enforcement activity has continued throughout the county, with city leaders and community groups reporting U.S. Immigration and Customs Enforcement present at libraries, car washes and Home Depots. School graduations in Los Angeles have increased security over fears of ICE action, and some have offered parents the option to watch on Zoom. Los Angeles police detained 200 people related to the protests throughout the day on Tuesday, including 67 who were occupying a freeway, according to the city's chief. The majority of arrests since the protests began have been for failing to disperse, while a few others were for assault with a deadly weapon, looting and vandalism. At least seven police officers have been injured. ___ Taxin reported from Orange County and Seewer reported from Toledo, Ohio. Associated Press writers Julie Watson in San Diego, Jesse Bedayn in Denver, Jim Vertuno in Austin, Texas, contributed to this report. Daily Herald Events Daily Herald Media Group News Privacy Policy Terms of Service Advertising/Marketing Jobs at Paddock Publications Contact Us E-Edition Contests Calendar Share Article or Event Newsletters About our Ads Advertise Place a Classified Ad Contacts Business Directory RSS Email Newsletters"}