{"id": 630, "name": "Healthcare Finance News", "domain": "healthcarefinancenews.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.healthcarefinancenews.com/news/secret-weapon-unitedhealths-optum-business-laying-waste-old-notions-about-how-payers-make-money", "title": "Secret Weapon Unitedhealths Optum Business Laying Waste Old Notions About How Payers Make Money", "content": "For Payers Research Webinars Jobs More Search **Search form** Events Newsletters Sponsored About Reimbursement Revenue Cycle Management Strategic Planning Capital Finance Supply Chain Accounting & Financial Management More Acute Care Ambulatory Care Analytics HFN @ ANI Billing and Collections Budgeting Business Intelligence Claims Processing Community Benefit Compliance & Legal Construction & Facilities Management Hospital/physician relations ICD-10 & Coding Meaningful Use Medical Devices Medicare & Medicaid Mergers & Acquisitions Operations Patient Engagement Pharmacy Policy and Legislation Population Health Quality and Safety Risk Management Telehealth Workforce **Secret weapon: UnitedHealth's Optum business is laying waste to old notions about how payers make money** **Entering the healthcare services market might just be the answer to offset risk-laden insurance products.** Photo of OptumInsight CEO Eric Murphy by Eric Mueller. As major health insurers battle steep losses on the exchange market, UnitedHealth has leveraged its ace in the hole to stay out of the red: Optum. And its success creates an important lesson for other payers -- entering the healthcare services market might just be the answer to offset risk-laden insurance products. Optum is a behemoth in the healthcare industry, reaping profits for parent company UnitedHealth Group by having virtually every payer and over 5,000 hospitals in its portfolio. Optum works with about 300 health plans, including the insurance arm of UnitedHealth Group, UnitedHealthcare. Its payer portfolio has roughly 70 percent of the market that uses integrity tools, according to OptumInsight CEO Eric Murphy, Optum's former chief growth officer. Roughly 20 percent of the market uses Optum to manage capability aroundclaims processing, he said. [Also:Optum drives strong growth in first quarter for UnitedHealth Group] \"Optum, as an United division, is unique for a big top five payer to have,\" Murphy said. \"This year our revenues are on pace to triple from 2011. We continuously look to help our clients solve bigger and broader business challenges. We have really enjoyed dynamic growth of 23 percent, compounded annually.\" In another boost to earnings, earlier this year, OptumCare acquired surgery center chain, Surgical Care Affiliates for $2.3 billion, adding more than 200 free-standing surgical centers in 33 states. And in early May, Optum won the Company of the Year award during the annual Frost & Sullivan Growth Innovation and Leadership Awards Banquet in Santa Clara, California. **A payer leading payers** Insurers using Optum's services fall into one or two camps, according to Murphy. Either they want help to grow their top line, and/or they want to manage their expenses. \"Often times when talking about assisting a health plan … depending on the magnitude of the system, they want us to go at-risk,\" Murphy said. This risk comes in various models of financial or performance-based metrics. For instance, Optum could ensure it would not receive remuneration until it achieved a certain savings threshold. \"Optum has vested interest,\" Murphy said. \"It makes Optum unique in delivering an outcome.\" Clients, he said, \"want to make sure you're aligned with them.\" As theinformation technologyand services arm of UnitedHealth Group, Optum offerspopulation healthmanagement,pharmacybenefit management, analytics, consulting and other services to care providers, health plans, government entities and life sciences companies through its OptumRx, OptumInsight and OptumHealth businesses. For example , the nation's second-largest retirement plan administrator Empower Retirement, recently named OptumHealth its exclusive partner for health savings accounts. Revenue for OptumInsight, the advisory consulting branch for technology and analytics, grew 19 percent or by $2.1 billion dollars last year. In a recent shuffling of executive positions, Murphy, the company's former chief growth officer, became CEO of OptumInsight. \"We have the largest healthcare consultancy in the industry,\" Murphy said. \"We have 1,000 consultants within the advisory practice on both strategy and tactics.\" Clients who sign on with Optum get access to all of its services, from OptumInsight to OptumRx to clinical management programs. \"We go as a single Optum enterprise,\" Murphy said. **A diversified model** Sean Wieland, a research analyst with Piper Jaffray, said every business segment of Optum has the goal to drive down the medical loss ratio, for itself and for other payers. But about two-thirds of Optum's revenue comes from UnitedHealthcare, according to Wieland. \"Optum sells to every plan, including UnitedHealthcare,\" Wieland said. \"I look at it as a ying and yang relationship. Everything it does is to drive a low medical loss business for itself and other payers.\" For instance, the pharmacy care services business, OptumRx, does everything that a pharmacy benefit manager does, but also makes sure patients are taking the right medications at the right time, he said. \"When it comes to seeking care, OptumCare is one of the fastest growth areas of the business,\" Wieland said. \"Doctors or caregivers employed by United help you manage your care, with the goal of keeping you out of the hospital.\" [Also:UnitedHealth Group shuffles executive management, names new Optum leaders] A member can use Optum through each step of the medical process, according to Wieland. \"You get a United member, the first point of contact is an Optum care physician, they receive medications from OptumRx,analyticsare done on care gaps by OptumInsight,\" he said. \"All of those are to lower loss on medical care.\" What doesn't lower costs, such as electronic health records, or owning hospitals, isn't part of Optum's business plan, he said. \"For the vast majority of the member base, all of that stuff is working and should be able to reduce hospital admissions,\" Wieland said. \"It's enabling UnitedHealthcare to have a lower medical loss trend and allows them to realize profits in Optum.\" Because it is a separate business from UnitedHealth Group and UnitedHealthcare, Optum is not under the same restrictive regulations faced by insurers. This means it can have a higher profit margin than the 15 to 20 percent that's regulated. Insurers are mandated to spend 80 to 85 percent on medical costs. If they make more than that, they must give the profits back to members. \"Optum is not an insurance company so it doesn't have to adhere,\" Wieland said. Payers and providers that sign up for Optum's services do not get this benefit. They use Optum because it provides good services at a fair price, Wieland said. Peter Costa, a senior analyst and managing director at Wells Fargo, said Optum represents no one single business model rolled up under one umbrella. All of Optum's businesses give United two key things, Costa said. One is that it helps with the benefits business because of the technology that exists at Optum. \"It gives United a business model that's less regulated because it's not a part of health insurance business it's servicing,\" Costa said of the second. **Sincerest form of flattery** All of this success isn't going unnoticed. In fact, other companies are already trying to emulate Optum, even if at a smaller scale. \"Optum is a bigger entity than what anyone else has,\" Costa said. \"Others have pieces of it.\" \"For years, UnitedHealth Group was somewhat unique in that business model,\" Murphy said. \"On the health plan side are mini-Optums. I've seen health plans, stand up venture-type organizations, take equity interest through health plans that have their own solutions group or make acquisitions of service providers to build out a portfolio.\" [Also:OptumCare to acquire Surgical Care Affiliates for $2.3 billion] UnitedHealth Group began as anHMOin 1974 and over the last 40 years has evolved to include UnitedHealthcare and Optum. It has built a vast network of preferred care providers, using its large economy of scale to negotiate better medical care rates with care providers. About 20 years ago, United didn't just sit back and say the business was being about a managed care organization, Murphy said. \"It asked,\" he said, \"'how do you get capabilities and assets on the insurance side? How do you meet the needs of rest of marketplace, through a diversified portfolio?\" The genesis of what is now Optum started when UnitedHealth decided to diversify its portfolio. United used Optum to support its own insurance business, and to look to the external market that had similar wants and needs. In April, UnitedHealth Group released strong first quarter results, driven in no small part by Optum's 16 percent growth inoperations. UnitedHealth Group net earnings rose to $2.17 billion from $1.61 billion a year earlier. The company is focused on five high-growth markets to drive the next decade of growth, according to Murphy. These include technology-enabled information and services, clinical care delivery, pharmacy care services, consumer-centric benefits and global opportunities. Optum is helping clients through a model called plan-build-manage, Murphy said. Plan is the advisory piece. Build is the assets, the intellectual property, tools software and applications. And manage is the ability to provide these services in a risk-based outsourcing model. \"We manage businesses across the entire value chain around claims payment processing,\" Murphy said. \"We generate upwards of $6 billion of savings for our clients.\" Optum CEO Larry Renfro has set the goal of \"70 in 7.\" That is in reference to a net promoter system, so Renfro wants to see NPS of 70 percent, in 7 years. Optum is currently at 40 percent. NPS is a growth metric, measuring client satisfaction, from those that sing Optum's praises, to those that are neutral, and clients that are detractors. The NPS goals are fully aligned across UnitedHealth Group's compensation systems, Renfro said during the April earnings call. This year, NPS scores have risen four points in commercial, Medicare and retirement and community and state businesses. And Optum's results show strong satisfaction as well, Renfro said. \"When you lay it all out, what we did at Optum (is ask), how can we overlay Optum across the value chain, so we help those health plans executive on their strategies, on their tactical programs?\" Murphy said. \"Providers and payers, we are seeing more and more interest especially as the market moves towards value-basedreimbursement. It really drives the motivation around to become an integrated system.\" Optum's focus has been on making the healthcare system work better for everyone while historically it's been a business-to-business relationship, Murphy said. \"Ultimately, it's business-to-business-to-consumer,\" Murphy said. Twitter:@SusanJMorse **Breaking News. In-Depth Reporting. Best Practices.Delivered to your inbox daily.** HIMSS Media Events Solutions About Contact **Publications** Healthcare IT News MobiHealthNews **Education** Conferences White Papers HIMSS Books **Career Advancement** HIMSS Resource Center HIMSS JobMine **Newsletters** Healthcare Finance Daily Healthcare Finance Weekly Healthcare Payer **About us** About Editors Privacy Policy Advertising News Video"}