{"id": 430, "name": "FactCheck.org", "domain": "factcheck.org", "bias": "center", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://www.factcheck.org/2025/05/trump-administration-incorrectly-claims-certainty-about-origin-of-coronavirus/", "title": "Trump Administration Incorrectly Claims Certainty About Origin Of Coronavirus", "content": "Home ArticlesFactCheck PostsSciCheckDebunking Viral ClaimsEn Español FactCheck Posts SciCheck Debunking Viral Claims En Español FactCheck Posts SciCheck Debunking Viral Claims En Español Ask a QuestionAsk FactCheckAsk SciCheck Ask FactCheck Ask SciCheck Ask FactCheck Ask SciCheck Donate TopicsPresident TrumphealthCoronavirusimmigrationclimate changeView All President Trump health Coronavirus immigration climate change View All President Trump health Coronavirus immigration climate change View All About UsOur MissionOur ProcessOur FundingOur StaffUndergraduate FellowsAwardsRequest a CorrectionContact Us Our Mission Our Process Our Funding Our Staff Undergraduate Fellows Awards Request a Correction Contact Us Our Mission Our Process Our Funding Our Staff Undergraduate Fellows Awards Request a Correction Contact Us Search MoreViral ClaimsSubscribeInstagramThreadsYouTubeX (Twitter)FacebookTikTokFactCheck On the AirMailbag Viral Claims Subscribe Instagram Threads YouTube X (Twitter) Facebook TikTok FactCheck On the Air Mailbag Viral Claims Subscribe Instagram Threads YouTube X (Twitter) Facebook TikTok FactCheck On the Air Mailbag **Trump Administration Incorrectly Claims Certainty About Origin of Coronavirus** ByJessica McDonald Posted onMay 23, 2025| Clarification on May 23, 2025 Este artículo estará disponible en españolen El Tiempo Latino. Since regaining power, the Trump administration has repeatedly claimed with false certainty that the COVID-19 pandemic originated in a lab. In late January, White House Press Secretary Karoline Leavittsaidthat a lab leak is “the confirmable truth.” Inmid-April, covid.gov and covidtests.gov, websites the government previously used toeducate the publicabout the disease and allow people toplace orders for free tests, redirected to a new, splashy White Housewebpagethat declared a lab leak the “true origins” of COVID-19. This month, in explaining a nearly $18 billion proposed cut to the National Institutes of Health, President Donald Trump’sbudget requestfor the next fiscal year stated that a lab origin “is now confirmed by several intelligence agencies.” But there has been no such confirmation. In late January, the CIAjoinedthe FBI and the Department of Energy in concluding a lab origin is “most likely.” But those determinations were each made with low or moderate confidence, and the agencies don’t agree on the source lab.As many as five other intelligence bodieslean toward a natural origin or are undecided. Joel Wertheim, a professor of medicine at the University of California San Diego who has published research on how the pandemic began, told us the website is “untrue.” As we’veexplainedbefore, the origin of the coronavirus, SARS-CoV-2, is unknown. Multiple lines of scientific evidence, however, point to a natural origin, with the virus spilling over into humans from animals through the illegal wildlife trade in China. That is similar to what has happened in the past, including in the early 2000s with SARS, when a similar coronavirus caused a respiratory disease outbreak that began in China. “There’s overwhelming scientific evidence that COVID emerged from an animal market in Wuhan, which was miles away from a virology lab,”Gigi Gronvall, a senior scholar at the Johns Hopkins Center for Health Security and an associate professor at the Bloomberg School of Public Health, told us. While for many scientists the evidence for a natural origin is convincing, no intermediate animal has been found harboring a virus highly similar to SARS-CoV-2, so the theory remainsunproved. Some scientists are uncertain and some favor a lab leak. It is unclear on what specific information the intelligence agencies are basing their determinations. Scientists who have studied the origins question closely have encouraged more transparency, but note that the scientific aspect of the investigation is highly technical.Michael Worobey, an expert in virus evolution at the University of Arizona who is an author of several of the major COVID-19 origins papers,toldthe Associated Press in 2023 that he doubted the individuals making the assessments “have the scientific expertise … to really understand the most important evidence.” OtherTrump officials have also recently endorsed a lab leak, even if they do not always frame it as definitive. Food and Drug Administration Commissioner Dr. Marty Makary, for example,saidthe pandemic was “probably the result of some scientists messing with Mother Nature” and that a lab leak “is now the leading theory among scientists.” In congressional testimony on May 15, Health and Human Services Secretary Robert F. Kennedy Jr.statedthat multiple agencies “have all agreed that NIH research almost certainly led to the pandemic.” Those statements are unsupported or contradicted by available evidence. As we said, there is neither a consensus nor strong confidence among the different U.S. intelligence agencies that there was a lab leak. But one thing nearly all did agree on, according to a declassified 2023report, is that the coronavirus “was not genetically engineered.” Scientists have also previouslytold usthat it’s virtually impossible that SARS-CoV-2 was engineered. “SARS-CoV-2 shows no evidence of being manipulated or passage[d] in a laboratory prior to its emergence,” Wertheim said. “The scientific literature is emphatic on this point, with broad consensus even among scientists who disagree regarding the particulars of the location and timing of the emergence of SARS-CoV-2.” There is also little to suggest that scientists now prefer the lab leak theory, as Makary said. In 2023, 156 scientists penned acommentaryin the Journal of Virology that said that the zoonosis hypothesis, or the idea that the virus spilled over to humans from an animal, “has the strongest supporting evidence,” while lab leak scenarios have “no compelling evidence.” Subsequently, another 120 scientists with the Australasian Virology Societywroteto the journal to agree. A 2024surveyby the Global Catastrophic Risk Institute also found scientists overwhelmingly favored a natural origin. Wertheim objected to Makary’s characterization, noting that the “peer-reviewed literature is dominated by articles supporting a zoonotic origin” while lab leak papers “are rare, fringe, and mutually incompatible with each other.” Claims that the NIH funded work that led to the pandemic have been promoted for years. But aswe’verepeatedlyexplained, the small amount of NIH grant money that went to the Wuhan Institute of Virology funded experiments using viruses that are very different from SARS-CoV-2 and could not have led to the creation of the coronavirus. When asked what the Trump administration’s certainty about a lab leak was based on, and why it discounted the published research that supports a natural origin, White House spokesman Kush Desai pointed to the Intelligence Community assessments. “Multiple intelligence agency assessments have now substantiated that COVID-19 originated from a lab leak – an idea that the mainstream media once completely wrote off as a lunatic fringe conspiracy theory,” he told us in an email. “While the media continues to decimate what’s left of itsrecord-low credibility, the Trump administration remains committed to transparency for the American people.” HHS did not respond to a similar inquiry about Kennedy’s and Makary’s statements. **Factually Inaccurate Website** In addition to incorrectly presenting a lab leak as an established fact, the White Housewebpagelists five numbered statements purporting to bolster its case. Each is either incorrect or misleading. We’ll address them one by one (the italic emphasis in each statement is the White House’s). “The virus possesses a biological characteristic that isnot found in nature.”False. This is presumably a reference to SARS-CoV-2’s furin cleavage site, or FCS, a short sequence that helps the virus enter cells. Much of the speculation about the coronavirus being lab-generated has stemmed from this site, since no other SARS-related coronavirus is known to have a FCS. But as we’ve explainedbefore, the sites do exist in other, more distant coronaviruses. As a result, while unusual, the FCS isnot inherently suspicious. “It is most certainly found in nature,” Wertheim said. “Data shows that all COVID-19 cases stem fromasingle introduction into humans. This runs contrary to previous pandemics where there were multiple spillover events.”Data do not show this. A Science paperpublishedin 2022, which analyzed genomic data from early COVID-19 cases, concluded that there were likely at least two spillovers from animals to humans. Wertheim, who was a senior author of that paper, said he took “particular umbrage” with this claim because “it was an uphill battle to convince other scientists that not only did multiple introductions occur, but that multiple introductions would be expected.” “Wuhan is home to China’s foremost SARS research lab, which has a history of conducting gain-of-function research (gene altering and organism supercharging) at inadequate biosafety levels.”Wuhan is home to the Wuhan Institute of Virology, which worked on bat coronaviruses and genetically manipulated some of them. But there’s no evidence the WIV worked on any viruses remotely similar enough to have given rise to SARS-CoV-2 (whether the experiments qualified as gain-of-function is also subject todebate). The intense focus on such issues is in many ways irrelevant, since the scientific literature is “unified” in concluding that the coronavirus “was not subject to manipulation or ‘gain-of-function’ experiments prior to its emergence,” Wertheim said. The presence of the institute can seem too unlikely to be a coincidence, but as we’ve explainedbefore, Wuhan is a hub for the wildlife trade and is home to some 11 million people. The population density is key, since a spillover in rural China would likely have simply fizzled out, Wertheim said. Much is often made about the long distance between Wuhan and where SARS-CoV-2’s closest ancestors were identified in bats. But the coronavirus behind the 2002 SARS epidemic, which everyone agrees was a natural spillover, also traveled a similar distance to Guangdong. Apaperpublished in May in Cell, co-authored by Wertheim, documents the similarities between the two cases andimplicatestravel via the wildlife trade for both. “Wuhan Institute of Virology (WIV) researchers weresick with COVID-like symptomsin the fall of 2019, months before COVID-19 was discovered at the wet market.”Rumors of sick WIV workers — with various details shifting over time — have circulated since 2020, as we’ve explainedbefore. But the U.S. Intelligence Community has already said that the information is not relevant to the question of how the pandemic began. Because “the researchers’ symptoms could have been caused by a number of diseases and some of the symptoms were not consistent with COVID-19,” the 2023 declassified reportexplains, the IC “continues to assess that this information neither supports nor refutes either hypothesis of the pandemic’s origins.” “By nearly all measures of science, if there was evidence of a natural origin it would havealready surfaced. But it hasn’t.”There is evidence of a natural origin; it’s just not conclusive. The lack of an intermediate animal — which might prove a natural origin, and is presumably what this is referencing — does not mean that the coronavirus must have originated in a lab. As we havewritten, the wet market where the first COVID-19 cases were recognized was quickly shut down. While some animal testing occurred early on, it was primarily in species that would not be expected to be the animals that transferred the virus to humans. China has also demonstrated little to no interest in looking any further for an intermediate animal, insisting instead that the virus came fromabroad,includingfrom the U.S. “Evidence of zoonosis has surfaced,” Wertheim said, noting that there is now geneticevidencethat animals known to transmit SARS-like viruses were in the same part of the market where the first cases were found, with remnants of SARS-CoV-2 where the animals were kept. “This evidence is exactly what you would expect to find had a zoonotic virus emerged.” That’s in addition to the epidemiology data, whichshowthe earliest COVID-19 cases cluster around the market, even those without a known connection to the market. Again, all of this doesn’t formally rule out a lab leak. But it’s incorrect to claim that the lack of an intermediate animal is strong evidence of a lab leak. Clarification, May 23: We clarified that Wertheim was a senior author, and not just a co-author, of one of the scientific papers. Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made throughour “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, P.O. Box 58100, Philadelphia, PA 19102. CategoriesFactCheck PostsSciCheck FactCheck Posts SciCheck FactCheck Posts SciCheck IssuecoronavirusCOVID-19COVID-19 pandemic coronavirus COVID-19 COVID-19 pandemic coronavirus COVID-19 COVID-19 pandemic PeopleDonald TrumpMarty MakaryRobert F. Kennedy Jr. Donald Trump Marty Makary Robert F. Kennedy Jr. Donald Trump Marty Makary Robert F. Kennedy Jr. MisconceptionsThe Origins of COVID-19 The Origins of COVID-19 The Origins of COVID-19 Q: Did President Donald Trump call military nurse Ruby Bradley a “loser,” and were there orders for her service history to be removed from Department of Defense archives? A: There’s no evidence for these claims. We could find no record of Trump referring to nurse Ruby Bradley, who received 34 medals for her service during World War II and the Korean War. A Pentagon spokesperson told us that there was “nothing deleted and/or taken offline related to Ruby Bradley” and “we have not received any guidance requiring the removal of content” related to her. Archives Privacy Copyright Policy Contact Us Report Accessibility Issues and Get Help"}