{"id": 2022, "name": "KMJNow - Fresno", "domain": "kmjnow.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.kmjnow.com/news/trump-set-to-lift-fishing-restrictions-off-new-england-coast/", "title": "Trump Set To Lift Fishing Restrictions Off New England Coast", "content": "Home ShowsKMJ On Air LineupNews Team – (M-F) 12AM-12AMBlake TaylorGeorge TakataGabriel NavarroMichael ReedJoshua WeakleyLiz KernRon McCaryDon York – (M-F) 5AM – 6AMChristopher Gabriel – (M-F) 6AM – 9AMRandy James – (M-F) 6AM – 9AMGreg Lane – (M-F) 6AM – 9AMChristina Musson – (M-F) 9AM – 11AMJohn Broeske – (M-F) 9AM – 11AMRay Appleton – (M-F) 11AM – 2PMPhilip Teresi – (M-F) 2PM – 6PMMark Levin – (M-F) 6PM – 9PMArmstrong & Getty – (M-F) 9PM – 12AMRed Eye Radio – (M-F) 12AM – 4AMWeekend Shows KMJ On Air Lineup News Team – (M-F) 12AM-12AMBlake TaylorGeorge TakataGabriel NavarroMichael ReedJoshua WeakleyLiz KernRon McCary Blake Taylor George Takata Gabriel Navarro Michael Reed Joshua Weakley Liz Kern Ron McCary Don York – (M-F) 5AM – 6AM Christopher Gabriel – (M-F) 6AM – 9AM Randy James – (M-F) 6AM – 9AM Greg Lane – (M-F) 6AM – 9AM Christina Musson – (M-F) 9AM – 11AM John Broeske – (M-F) 9AM – 11AM Ray Appleton – (M-F) 11AM – 2PM Philip Teresi – (M-F) 2PM – 6PM Mark Levin – (M-F) 6PM – 9PM Armstrong & Getty – (M-F) 9PM – 12AM Red Eye Radio – (M-F) 12AM – 4AM Weekend Shows KMJ On Air Lineup News Team – (M-F) 12AM-12AMBlake TaylorGeorge TakataGabriel NavarroMichael ReedJoshua WeakleyLiz KernRon McCary Blake Taylor George Takata Gabriel Navarro Michael Reed Joshua Weakley Liz Kern Ron McCary Blake Taylor George Takata Gabriel Navarro Michael Reed Joshua Weakley Liz Kern Ron McCary Don York – (M-F) 5AM – 6AM Christopher Gabriel – (M-F) 6AM – 9AM Randy James – (M-F) 6AM – 9AM Greg Lane – (M-F) 6AM – 9AM Christina Musson – (M-F) 9AM – 11AM John Broeske – (M-F) 9AM – 11AM Ray Appleton – (M-F) 11AM – 2PM Philip Teresi – (M-F) 2PM – 6PM Mark Levin – (M-F) 6PM – 9PM Armstrong & Getty – (M-F) 9PM – 12AM Red Eye Radio – (M-F) 12AM – 4AM Weekend Shows NewsLocal NewsAgricultureTrafficWeatherValley Crime StoppersKMJ: 100 Years In the Valley Local News Agriculture Traffic Weather Valley Crime Stoppers KMJ: 100 Years In the Valley Local News Agriculture Traffic Weather Valley Crime Stoppers KMJ: 100 Years In the Valley ContestsContestsJoin VIP ClubLocal Contest Rules Contests Join VIP Club Local Contest Rules Contests Join VIP Club Local Contest Rules Podcasts EventsConcerts and Events Concerts and Events Concerts and Events Sweet Deals **Trump Set to Lift Fishing Restrictions off New England Coast** President Donald Trump is expected to sign an executive order to “unleash commercial fishing in the Atlantic” by rolling back prohibitions former President Barack Obama placed on a 4,913 square mile area off the New England coast. The NHJournal, reporting Friday on a White House fact sheet it obtained, reported that the White House said Trump is “committed to removing unnecessary restrictions on American fishermen in order to strengthen the U.S. economy, support coastal communities, and restore fairness to an industry disadvantaged by overregulation and unfair foreign competition.” The publication reported that the president was expected to sign an executive order on the fishing issue Friday. But according to the White House website, the order had not been issued as of Saturday. Read more at Newsmax© 2025 Newsmax. All rights reserved. **Free Apps** Privacy Policy Terms of Service General Contest Rules Advertise With Us Station Information Employment Opportunities Cumulus Media Corporate 2024 EEO Report – KMJ AM 2024 EEO Report – KMJ FM FCC Public File – KMJ AM FCC Public File – KMJ FM FCC Applications – KMJ-AM FCC Applications – KMJ-FM Copyright 2020 Cumulus Media / Cumulus Media is an equal opportunity employer / AA View Full Site"}