{"id": 2078, "name": "Off The Press", "domain": "offthepress.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.offthepress.com/epa-to-save-over-1b-annually-scrapping-biden-era-emissions-rules-for-gas-and-coal-plants/", "title": "Epa To Save Over 1b Annually Scrapping Biden Era Emissions Rules For Gas And Coal Plants", "content": "Breaking News Who We Are For Journalists For Publishers **Trending Now** Securing America Capitol Hill DOGE Breaking News Who We Are For Journalists For Publishers Breaking News Who We Are For Journalists For Publishers **Get OTP in your inbox** **EPA To Save Over $1B A Year Ending Biden-Era Emissions Rules For Gas, Coal Plants** View Source| June 11, 2025 2:02 pm **Share This Article** The Environmental Protection Agency (EPA) is removing Biden-era administration greenhouse gas regulations — which saddled the energy industry with an extra $1.3 billion per year in costs — in order to provide cheaper coal and natural gas production, The Post can reveal. EPA Administrator Lee Zeldin will announce later Wednesday the repeal of two emissions standards that targeted coal and gas power plants generating electricity and had been projected to raise energy costs by up to $20 billion over the next two decades, officials said. “The sole purpose of these Biden-Harris administration regulations was to destroy industries that didn’t align with their narrow-minded climate change zealotry,” Zeldin said in a statement Wednesday. “Together, these rules were designed to regulate coal, oil and gas out of existence.” A senior EPA official added that the move will boost US “energy independence,” as President Trump seeks to meet growing demand from manufacturers and artificial intelligence companies for domestic power sources — and to reduce the country’s reliance on imports. More here **Tagged:Climate** **More From Climate** **Breaking Now** **LA Rioters Face Federal Charges** **LA Rioters Face Federal Charges** **Sign Up for Our Newsletter** **Join our list!** Get all the latest news in your inbox every day. Subscribe to the Off The Press newsletter and NEVER miss an important story. Copyright 2025 Off The Press. All Rights Reserved."}