{"id": 1001, "name": "KNPN - News-Press Now", "domain": "newspressnow.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.newspressnow.com/news/government/state-of-missouri-government/2025/06/11/new-missouri-law-modernizes-fireworks-regulations-for-first-time-in-over-two-decades/", "title": "New Missouri Law Modernizes Fireworks Regulations For First Time In Over Two Decades", "content": "Home NewsLocal NewsRegional NewsNational NewsPublic SafetyEducationCity/County GovernmentBusiness/ConsumerSpecial Reports Local News Regional News National News Public Safety Education City/County Government Business/Consumer Special Reports Local News Regional News National News Public Safety Education City/County Government Business/Consumer Special Reports WeatherLocal ForecastWeather WiseClosings Local Forecast Weather Wise Closings Local Forecast Weather Wise Closings SportsHigh School SportsCollege SportsSt. Joseph MustangsKansas City RoyalsKansas City ChiefsCNN SportsOutdoors High School Sports College Sports St. Joseph Mustangs Kansas City Royals Kansas City Chiefs CNN Sports Outdoors High School Sports College Sports St. Joseph Mustangs Kansas City Royals Kansas City Chiefs CNN Sports Outdoors Obituaries eEdition Livestream Marketplace JobsLocal JobsNews-Press NOW Jobs Local Jobs News-Press NOW Jobs Local Jobs News-Press NOW Jobs OpinionPolls Polls Polls CommunityBe MindfulCelebrationsPet PalsSee St. JosephCorner PostWestern WednesdaysEvent Calendar Be Mindful Celebrations Pet Pals See St. Joseph Corner Post Western Wednesdays Event Calendar Be Mindful Celebrations Pet Pals See St. Joseph Corner Post Western Wednesdays Event Calendar Featured Columns Share PlayPuzzles Puzzles Puzzles About UsClosed Captioning contactsManage Your AccountMobile AppsMeet the NewsroomAdvertise with UsEEO & FCC ReportsNewsletter Sign-upTV Listings Closed Captioning contacts Manage Your Account Mobile Apps Meet the Newsroom Advertise with Us EEO & FCC Reports Newsletter Sign-up TV Listings Closed Captioning contacts Manage Your Account Mobile Apps Meet the Newsroom Advertise with Us EEO & FCC Reports Newsletter Sign-up TV Listings News Obituaries Sports Weather Share eEdition Contests **Video Forecast** **Tracking toasty temperatures, isolated t-storm chances** **New Missouri law modernizes fireworks regulations for first time in over two decades** By Mitchell Kaminski, ABC 17 News COLUMBIA, Mo. (KMIZ) -- A new law signed by Gov. Mike Kehoe on Tuesday includes sweeping public safety reforms, including updating the state’s outdated firework regulations. Senate Bill 81, which takes effect Aug. 28, modernizes how Missouri regulates fireworks for the first time in more than two decades, updating technical definitions, safety protocols and inspection authority. “In terms of the fireworks provisions, there's just a lot of things that needed updated and improved,” Sen. Kurtis Gregory, R-Cooper County, who sponsored the bill, told ABC 17 News. “In terms of fireworks, I think it's been 25 years and there's been some major advancements in fireworks and definitions needed changed. We had the proper definitions for the proper type of fireworks to make sure we had the right licenses and availabilities out there for everything to be done in a safe manner.” Gregory emphasized that while the state hadn’t experienced enforcement issues, outdated definitions led to confusion. For example, some pyrotechnics commonly seen at sporting events were being mislabeled. “The correct term is articles pyrotechnic, and that is what you see at football games and celebrations where it's like on a timed button that gets pushed,” Gregory said. “Those are being defined as proximate fireworks. That's not the correct definition at all.” The bill also overhauls the state’s fee structures to help provide training for fire departments across Missouri. Gregory pointed to Missouri’s unique relationship with fireworks as to why the law was necessary. “Missourians per capita spend more money on fireworks than anyone, any other state in the country, by like almost double,” Gregory said. “I think Missourians on average spend about $25 per person on fireworks. The next closest state is just a little over $10.” Industry veteran Bob Geru -- who has owned and operated Bob’s Fireworks in Columbia since 2005 -- has seen Missouri’s fireworks landscape change since entering the business in 1965. “It was a lot looser than it is today,” Geru said. “But it's basically been the same. They don't want fireworks in the city. And, you know, I can understand that to a degree.” Still, Geru said any state enforcement presence on his business has been minimal. “I haven't seen an inspector in 10 years,” Geru said. “If they come in my first thought is ‘Tell me what I need to do to correct it.'’” Geru also echoed Gregory’s point, noting that Missouri consistently ranks among the top states in fireworks sales nationwide. “Missouri has a reputation amongst all the states as being fireworks-friendly,” Geru said. “I’ve been asked the question many times. Just what is your favorite fireworks? I got a standard answer. Anything with a fuse.” While the law will expand the State Fire Marshal’s authority to inspect retail locations, including those outside counties with local fire codes, it’s not expected to disrupt operations in regulated areas like Boone County. “I think what it really does is it allows the State Fire Marshal's office a little more access to those areas that don't have a fire code,” said Gale Blomenkamp, who is an assistant chief of the Boone County Fire Protection District. “The trend has been people are leaning towards more of a brick-and-mortar type facility for these temporary fireworks stands because they're easier to secure. Storms don't blow them away, you know, like they're blowing away their tents and their product is more secure and more safe.” Blomenkamp noted that for many counties without their own codes, the law will help close inspection gaps. “That will allow the State Fire Marshal's office to gain access into those structures, to do those inspections,” Blomenkamp said. Though SB 81 becomes law in late August, its fireworks provisions won’t impact the upcoming Fourth of July season. Full implementation is expected by 2026. Jump to comments ↓ **News-Press NOW** **Related Articles** **Baseball Glance** **National League Glance** **American League Glance** **Baseball Expanded Glance** News-Press Now is committed to providing a forum for civil and constructive conversation. Please keep your comments respectful and relevant. You can review our Community Guidelines byclicking here. If you would like to share a story idea, please submit ithere. Community GuidelinesContact UsEEO Public FileFCC ApplicationsFCC Public FilePrivacy PolicyTerms of ServiceDo Not Sell My Personal Information **Subscribe: News-Press NOW Newsletters** Breaking NewsContests & PromotionsLocal News Updates **Download: News-Press NOW Apps** Accessibility Tools Increase TextIncrease Text Decrease TextDecrease Text GrayscaleGrayscale High ContrastHigh Contrast Negative ContrastNegative Contrast Light BackgroundLight Background Links UnderlineLinks Underline Readable FontReadable Font ResetReset"}