{"id": 1596, "name": "WLFI - Lafayette News", "domain": "wlfi.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wlfi.com/news/local/one-person-injured-after-bb-gun-breaks-citybus-window/article_702962a0-a42e-11ee-9d44-b36ef5d33cdc.html", "title": "One Person Injured After Bb Gun Breaks Citybus Window", "content": "Facebook Twitter YouTube Instagram Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Local Indiana Living Green National News Crime Indiana Farm Report Active Aging Mental Health Awareness Interactive Radar Alerts Closings and Delays Tower Cams High School Purdue Sports Frenzy Gold And Black Live On Demand Recipes Watch Now TV Apps YouTube The American Athlete Hometown Heroes Pet Of The Day Community Calendar Contests Obituaries Tools For School Livestream Local Now Contact Us Meet The Team TV Listings WLFI Newscasts Advertise With Us Jobs Deals Digital Marketing Sign up for Email Alerts Our Apps Site searchSearch Site searchSearch Site searchSearch 85° Search Search Search Open user controlsLog In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Facebook Twitter Instagram News Weather Sports Video Community Report It Watch Live Deals Contests More EVENTS TASTE of Tippecanoe Contests Pet of the Day WLFI Download Our Apps Obituaries Watch Live Facebook Twitter WhatsApp SMS Email Print Copy article link Save **One person injured after BB gun breaks CityBus window** Staff Reporters Dec 26, 2023 Dec 26, 2023UpdatedDec 28, 2023 0 Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Copy article link Save LAFAYETTE, Ind. (WLFI) — A CityBus passenger was injured after a BB gun shot hit the bus window. Lafayette police say the bus was on the 1800 block of Shoshone Drive when the window was broken around 3 P.M. Tuesday. Lt. Justin Hartman says a passenger suffered minor injuries from the broken glass. The investigation is ongoing, and no arrests have been made at this time. News 18 will continue to provide updates as they become available. Facebook Twitter WhatsApp SMS Email Print Copy article link Save Citybus Lafayette Gunshot Injury **More From WLFI News 18** UpdatedSep 6, 2024 UpdatedJul 12, 2023 UpdatedDec 21, 2022 Aug 15, 2023 UpdatedJan 12, 2022 UpdatedJun 22, 2022 **Recommended for you** Facebook Twitter Instagram News Weather Sports Video Community Report It Watch Live Contact Search FCC Applications FCC Public Inspection File EEO Report Child Programming Careers Advertise with Us Advertiser Payments AI Usage Policy Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}