{"id": 790, "name": "KTVB - Boise News", "domain": "ktvb.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ktvb.com/article/news/community/st-jude-dream-home/2025-st-jude-dream-home-giveaway-watch-live-results-special-june-11-ktvb-channel-7-home-winner-announced/277-e47f991c-fbd9-485c-aca3-b7d8e4f81cf4", "title": "2025 St Jude Dream Home Giveaway Watch Live Results Special June 11 Ktvb Channel 7 Home Winner Announced", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalCommunityNear MeCrimeNation WorldIdaho TodayRegionalFeaturesGrowing IdahoThe 208En EspañolLatest News StoriesTrump respalda al gobernador de Idaho, Brad Little, para las elecciones de 2026Police seek witnesses in fatal Lewiston crash involving elderly man Back Local Community Near Me Crime Nation World Idaho Today Regional Features Growing Idaho The 208 En Español Trump respalda al gobernador de Idaho, Brad Little, para las elecciones de 2026 Police seek witnesses in fatal Lewiston crash involving elderly man Back Local Community Near Me Crime Nation World Idaho Today Regional Features Growing Idaho The 208 En Español Trump respalda al gobernador de Idaho, Brad Little, para las elecciones de 2026 Police seek witnesses in fatal Lewiston crash involving elderly man WeatherBackForecastRadar7-Day & HourlyClosings & DelaysTrafficLatest Weather StoriesWednesday's storms fire up across Southwest IdahoTormentas se activan en el suroeste de Idaho, riesgo de inundaciones repentinas en las montañas Back Forecast Radar 7-Day & Hourly Closings & Delays Traffic Wednesday's storms fire up across Southwest Idaho Tormentas se activan en el suroeste de Idaho, riesgo de inundaciones repentinas en las montañas Back Forecast Radar 7-Day & Hourly Closings & Delays Traffic Wednesday's storms fire up across Southwest Idaho Tormentas se activan en el suroeste de Idaho, riesgo de inundaciones repentinas en las montañas SportsBackBoise StateScott SlantHigh School SportsLocked On Podcast NetworkFishingLatest StoriesScott Slant: Pac-12 hoops power will be you-know-whoBoise State track and field sends trio to NCAA Championships Back Boise State Scott Slant High School Sports Locked On Podcast Network Fishing Scott Slant: Pac-12 hoops power will be you-know-who Boise State track and field sends trio to NCAA Championships Back Boise State Scott Slant High School Sports Locked On Podcast Network Fishing Scott Slant: Pac-12 hoops power will be you-know-who Boise State track and field sends trio to NCAA Championships SearchSearch:Search Advertise With Us The 208 Growing Idaho En Español Crime Inside Ag Idaho Today Moscow Murders 7 Investigates Regional Boise State Football Wildfires 7's Hero KTVB Student News Viewpoint 7Cares **2025 St. Jude Dream Home Giveaway: Watch live Wednesday on KTVB** BOISE, Idaho — The 2025 St. Jude Dream Home Giveaway has arrived. One lucky winner is set to secure a brand new home, with several other prizes up for grabs on Wednesday evening on KTVB Channel 7. The 2,100 square-foot home in Star features three bedrooms and two bathrooms.Berkeley Building Company built the2025 St. Jude Dream Homeand has an estimated value of $750,000. Anxious ticket buyers can watch the St. Jude Dream Home Giveaway special starting at 6 p.m. Wednesday, followed by winner announcements during the live giveaway show at 6:30 p.m. on KTVB Channel 7,KTVB+ on Roku, Apple TV and Amazon Fire TV, andKTVB.COM. Live results will unveil the winners of the additional prizes, including a 2025 Ford truck, courtesy of Ford Idaho Stores, as well as four club seats to a Boise State football game and a $10,000 shopping spree at Mor Furniture for Less. RELATED:Get a look inside the 2025 St. Jude Dream Home and learn more Proceeds from the raffle go directly to St. Jude Children's Research Hospital, which researches potential cures for childhood cancers and other life-threatening illnesses, and treats children at no cost to their families. All 31,777 tickets were sold after going on sale for $100 each on April 23. The 2025 home in the Oaklawn Community is the 13th St. Jude Dream Home to be built by Berkeley Building Company, who is notorious for its signature secret rooms with high-end amenities. RELATED:‘Thankful beyond words’: 2024 St. Jude Dream Home winner shares personal connection to hospital **** To stream KTVB on your phone, you need the KTVB app. **** **Download the KTVB app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video In Other News **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}