{"id": 1022, "name": "NORML", "domain": "norml.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://norml.org/blog/2025/06/11/mississippi-indian-tribe-approves-referendum-regulating-the-possession-production-and-distribution-of-marijuana-on-tribal-lands/", "title": "Mississippi Indian Tribe Approves Referendum Regulating The Possession Production And Distribution Of Marijuana On Tribal Lands", "content": "NORML Facebook NORML Twitter NORML Instagram NORML YouTube **NORML** **Working to Reform Marijuana Laws Since 1970** Home Take Action Learn State Laws Chapters Lawyers News Donate **Mississippi: Indian Tribe Approves Referendum Regulating the “Possession, Production, and Distribution of Marijuana on Tribal Lands”** byNORML Posted onJune 11, 2025June 11, 2025 Members of the Mississippi Band of Choctaw Indians havevotedin favor of referendum expressing support for the legalization of marijuana on tribal lands. It is the only federally recognized Native American tribe in the state, withmore than 11,000 Tribal memberson 35,000 acres of territory. Referendum 2025-01asked voters if they “support the Tribe developing legislation to decriminalize and regulate possession, production, and distribution of marijuana on Tribal lands.” Fifty-five percent of voters endorsed the measure, according to unofficial tribal election results posted on the Mississippi Band of Choctaw IndiansFacebook page. While absentee votes remain to be counted, there are not enough outstanding votes to change the election result. In September 2023, members of North Carolina’s Eastern Band of Cherokee Indiansdecidedin favor of a similar ballot measure permitting the use and sale of marijuana on tribal land. The tribe began selling cannabis products to tribal members the following spring andexpanded salesto anyone age 21 or older that fall. As of April 2025, there are 77 tribally owned cannabis outlets in nine states, according todataprovided byMarijuana Business Daily. Currently, only North Carolina’s Eastern Band of Cherokee Indians is engaging in marijuana-related sales in a non-legal state. During last year’s congressional session, Republican Representative Chuck Edwardsintroduced federal legislationto withhold certain federal funding from states and tribes that permit the use of marijuana for those age 21 or older. Mississippi lawmakersapprovedmedical cannabis access legislation in 2022. About 81,000 patients currently participate in the state’s accessprogram. Minor marijuana possession (30 grams or less) has beendecriminalizedin Mississippi since the 1970s. **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook **Like this:** **Related** **Post navigation** **Subscribe to NORML News** **NORML Reports** **Become a Member** **Blog Archives** **NORML STORE** Join NORML About NORML Privacy Statement Sponsors Advertise Shop Contact Us **Discover more from NORML** Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading **** **** ****"}