{"id": 479, "name": "Freakonomics", "domain": "freakonomics.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://freakonomics.com/podcast/how-to-succeed-at-failing-part-4-extreme-resiliency-update/", "title": "How To Succeed At Failing Part 4 Extreme Resiliency Update", "content": "PodcastsFreakonomics RadioNo Stupid QuestionsPeople I (Mostly) AdmireThe Economics of Everyday ThingsThe Freakonomics Radio Book ClubSpecial SeriesOlder ShowsRecommendations Freakonomics Radio No Stupid Questions People I (Mostly) Admire The Economics of Everyday Things The Freakonomics Radio Book Club Special Series Older Shows Recommendations Freakonomics Radio No Stupid Questions People I (Mostly) Admire The Economics of Everyday Things The Freakonomics Radio Book Club Special Series Older Shows Recommendations Subscription Live Shows On the Radio Books Shop AboutThe HostsThe TeamHow to ListenFAQJOBS The Hosts The Team How to Listen FAQ JOBS The Hosts The Team How to Listen FAQ JOBS Blog Contact Search **Search the Site** **Follow on** **How to Succeed at Failing, Part 4: Extreme Resiliency (Update)** Everyone makes mistakes. How do we learn from them? Lessons from the classroom, the Air Force, and the world’s deadliest infectious disease. (Part four of afour-part series.) Comments Share this episode Listen to this episode **Freakonomics Radio Network Newsletter** Stay up-to-date on all our shows. We promise no spam. **Episode Transcript** Hey, it’s Stephen Dubner, and you’re about to hear the fourth and final episode of our series “How to Succeed at Failing,” which was first published in 2023. If you missed any of the earlier episodes, they should be right there in your podcast app. For this version, we’ve updated facts and figures as necessary. As always, thanks for listening. * * * If I asked you to name the world’s deadliest infectious disease, what would you say? Covid-19? That was the biggest infectious killer for a few years, but not anymore. How about malaria? Influenza? HIV? Those are all deadly — but not the deadliest. So what’s number one? Babak JAVID: Actually, TB for the last 20, 30 years has been theNo. 1 infectious-disease killer in the world. Babak Javidis a physician-scientist who studies tuberculosis, or TB. You may think of TB as a 19th-century disease, when it was called consumption. It killed John Keats, Anton Chekov, and at least two of the Brontë sisters; it killed the heroines of bothLa BohèmeandLa Traviata. And today, it still kills more than a million people each year, most of them in the developing world. JAVID: TB is a disease of poverty. It’s really a major problem in India, China, Indonesia, Pakistan, South Africa, Nigeria. TB is a bacterial infection. There is a vaccine for it, but it’s not always effective. It can be treated with antibiotics, but it’s a long and fairly complicated course of treatment. And as deadly as TB is, it doesn’t draw the attention — or the funding — that flow to other diseases. JAVID: There is no Hollywood star that gets TB, that puts it in the public mind, in everyday people’s thoughts. One of the reasons I was attracted to this field is I felt that infectious diseases in general and TB in particular is, you know, one of the mechanisms of injustice in our world. And I really wanted to tackle that. Javid runs a tuberculosis research lab at the University of California San Francisco. He has also worked at labs in Beijing and at Harvard. His kind of research comes with a lot of failure. JAVID: I remember in my graduate school, I went over a year and a half without a single experiment working, and it’s very hard to get up in the morning and go back and expect to fail again. The first drug that was found to successfully fight TB is called streptomycin. It wasdiscovered in 1943; it won a Nobel Prize for Selman Waksman, the main scientist behind it. JAVID: And the way that streptomycin works is that it does two things. It inhibits the process of making new proteins — it’s called a protein-synthesis inhibitor — but that in itself doesn’t kill the bug. What kills the bug is that in addition to that inhibitory action, it actually causes the bug to make mistakes when it makes these proteins. What interested Javid was this second function: the drug causing the bacteria to make mistakes as they’re creating the proteins that produce the symptoms of TB. So he went looking for other ways to trigger those mistakes. And he found some — but it turned out this wasn’t enough to thwart the bacteria. JAVID: What was really shocking and surprising to me is the bug didn’t seem to mind. It just carried on regardless. So I cranked up the error rate, and I kept pushing and pushing, and really the bugs were kind of fine with it until eventually when I had really cranked up the error rate an awful lot. Then, the bugs died. It takes a lot of error to kill these bugs. I was reflecting on my results and I was thinking, this just doesn’t make any sense to me. The prevailing dogma at the time is that with a small amount of error, you induce what’s called error catastrophe where the errors and the new proteins make faulty machinery in the cell that then makes more errors, and it just feeds on itself. And these bugs were extremely resilient. And that made me, take a step back. And I thought, what if, actually, these errors aren’t detrimental after all, at least in a moderate amount? And that was my, I guess, aha moment. I have to be honest, at the beginning, I had no idea why this was. We were coming up with lots of different ideas as to explain it. But after a lot of experimentation and blind alleys and wrong turns, we figured out that what’s happening is that this mistranslation is allowing the bacteria to innovate. And that was a really exciting moment. And I kind of coined the term “adaptive mistranslation,” that sometimes these errors in the right context and in the right degree can actually be good for the bug. “Adaptive mistranslation”: think about that for a minute. And let’s think about it outside the realm of tuberculosis research: it’s the idea that errors — in the right context and degree — can strengthen an organism, can make it more resilient and lead it to innovate. Now, that sounds like a magic trick, doesn’t it? But, if it can work for TB, can it work for us? Today onFreakonomics Radio, the final episode of our series “How to Succeed at Failing.” We’ll hear about another counterintuitive way to fight off failure: Gary KLEIN: The pre-mortem is designed to help you do better rather than to shut off innovation. We ask if failure should be taught, formally, in the classroom? MACPHAIL: The whole point of the whole semester is going to be, hey everybody fails, and we fail at everything. And whether failure needs a museum: WEST: We have a Ford Edsel. We have Pepsi Crystal. New Coke. “How to Succeed at Failing,” the final chapter. Starting right now. * * * Gary Kleinis a cognitive psychologist who advises organizations on how to respond to failure. Hislatest researchis around what are called “wicked problems.” KLEIN: A wicked problem is one where there’s not a clear right answer that people would generally agree upon. DUBNER: And what share of problems in the world are wicked problems? KLEIN: Most of the major social problems we wrestle with are wicked problems. You have multiple stakeholders. And there’s no way to please all of them. And so there’s all of this potential conflict. And resource situations change, or pandemics arise, wars arise, things that are unexpected that are going to upset what you’re doing. In any of those conflicts that Klein is describing — any of those disruptions, let’s call them — we suddenly crash into a complex situation that’s also fogged in by uncertainty. Now we have to essentially guess what’s going to happen next — and those guesses often turn out to be wrong. Theresa MACPHAIL: I actually went on Anderson Cooper during the early days of the pandemic to tell everyone how wrong I was. That isTheresa MacPhail. She is a medical anthropologist at the Stevens Institute of Technology, one of the country’s top engineering colleges. And yes, MacPhail is an appropriate name for a professor discussing her own failure in a series about failure — but just wait, it will get even more appropriate later in this episode. Anyway, MacPhail had studied the outbreak of the H1N1 influenza pandemic in 2009, so her expertise was in demand when Covid came along. MACPHAIL: I really thought when we heard the first rumblings out of China in 2019 and early 2020, I was like, “We have this. Like, there’s mechanisms in place.” But what I hadn’t really considered was what over a decade of cutting funding had done. And it had basically decimated a lot of public health. I thought we were more prepared, and it turns out we were not. And I felt badly because I had done an interview withVice Newsin February, and I said, “Calm down. You know, we’re not China. We’re better equipped, here is why.” I had to go to the E.R. in March, because I got very sick, on March 1st. I went to the E.R., and I remember the E.R. doctor saying to me that he had never seen a situation where they were so ill-equipped with PPE, or personal protective equipment. That’s when I realized, “Uh-oh, I was wrong.” Now, what might have happened if Theresa MacPhail — and not just MacPhail, but let’s say everyone in the realm of pandemic-preparedness — what if they had all thought a bit differently about this wicked problem? What if, before the failure happened, they pretended there had already been a failure? You’re probably familiar with the idea of a post-mortem, or what the military calls an “after-action review.” By that point, of course, the damage has been done. So what if you flip the order, and conduct a pre-mortem? That’s what Gary Klein called this strategy when he invented it in the 1980s. KLEIN: The pre-mortem is designed to help people surface realistic possibilities and threats so that you can improve the plan, improve the product, and increase your chance of success. At the time, Klein was running an R&D firm that studied decision-making in organizations. KLEIN: You know, many of our projects succeeded, but not all of them. And we would occasionally have an after-action review. Those weren’t exciting things to do, because we were pretty disgruntled. At one point, I said, “Why don’t we do this at the very beginning? Why don’t we imagine that it fails?” Often in organizations, if you have, like, a kickoff meeting, there’ll be a part where they say, “All right, now does anybody have any concerns? Are there any critiques? Does anybody see any problems?” And nobody says anything. Either because they don’t want to disrupt the harmony of the team, or because they’re not thinking that anything could go wrong, because they’re excited to get started. So, to break through that mindset, I developed this technique of a pre-mortem. And at the end of a kickoff meeting, we say, “All right, imagine that I’m looking at a crystal ball.” I’m dialing forward six months, maybe a year, whatever the right time frame is. And “Oh, no. This project has failed. It’s failed in a big way. We know that, there is no doubt. This crystal ball is infallible. Now, everybody in the room, you’ve got two minutes. Write down all the reasons why this project failed.” And it’s amazing, the types of issues that people surface that ordinarily they wouldn’t say in public, or even think about. DUBNER: Can you explain from a psychological perspective why that works? KLEIN: Well, after I developed the technique, I read about some research on prospective hindsight. And so I think a big part of it is the certainty that it’s failed. And so now, that changes my mindset, so I’m not resisting. If I say, “Here’s the plan, are there any problems” — there’s all kinds of pressure not to think about problems. But by being certain that the plan has failed, by entering into that exercise, it just changes the whole valence, the whole experience. DUBNER: So interesting. I mean, we always hear about how humans perform poorly under uncertainty, generally. So you’re saying, you’re just removing the uncertainty of whether it will work. You’re saying it didn’t. Now tell me why it didn’t, and that provides clarity. KLEIN: Right. DUBNER: So what happens next? After people voice these ideas, what happens now? KLEIN: Okay, so let me get to — we never thought about this as a tool outside our company. This was just something we did. But then we had a big project we were doing for the Air Force. It was a software tool for identifying ways of using precision-guided munitions. And I told my prime sponsor, I want to do a pre-mortem and he said, “What’s that?” And I explained it to him and he said, “Absolutely no way. We want everybody to be positive. This is such a depressing exercise. I don’t want to do it.” And I said, “This is an important project. We want it to succeed. This is a way to make it succeed.” And reluctantly, he agreed to do it. We were doing this pre-mortem, and there was this young captain, hadn’t said a word. The meeting had gone on for about two days. Hadn’t said a word, and it was time for him to come up with his, what he had on his list. We go around, one at a time around the room, and we do one or two or three sweeps. And he looked a little nervous and he said, “This tool that we’re building, it’s for people in the field. And they have these low-power laptops. The tool we’re building runs on a supercomputer that takes 48 hours. I don’t see how that’s going to work.” And there was silence in the room because everybody realized he was right. And then somebody said, “Now, I’ve got a back-of-the-envelope technique that I use that could be a shortcut.” And all of a sudden, we were back in business. But if we hadn’t done that, we would have failed. And he never would have said that if we didn’t give him that space. DUBNER: And you’re saying the person who spoke up was the most junior or among the most junior in the room? KLEIN: Yes, he was. DUBNER: So I’ve seen this myself many times, not in a pre-mortem, but just in a meeting generally where junior people, they have very little incentive to speak up. It seems like there’s more downside than upside. It strikes me that American meeting culture is dominated by noisy people who have a lot of confidence, which is often unearned. And I’m curious if you have any advice for having better ideas come through in meetings. KLEIN: I have a couple of ideas, but one of them is the pre-mortem, because the pre-mortem creates a culture of candor. People learn that they can voice unpopular ideas and not be punished for it. It also creates an environment where I’m surprised at the ideas that you come up with, or this young captain comes up with, because the pre-mortem really harvests the different experience and ability of the people in the room. I don’t know what’s in your head, so how can I appreciate your perspective? But in a pre-mortem, I realize, “Wow, I never thought of it that way.” So there’s a chance for the people in the room to start to gain more respect for their colleagues. DUBNER: I would think that anonymity would be a useful tool here. Why do you not use that? KLEIN: Anonymity could be useful in environments that are usually very punitive. But in terms of creating a culture of candor, it works better if we’re all face-to-face. DUBNER: Does it sometimes get personal, even ugly? KLEIN: I have never seen that happen. Surprisingly enough, no. No, because everybody knows that this is a made-up failure. So it’s not life-or-death, although it could be. And everybody knows that the intent is to improve the plan. DUBNER: Can you talk about how to encourage candid feedback generally? Again, it may be the more-junior employees, but whoever it is that might have a valuable insight, how can you best float that insight up to leadership? KLEIN: I’ve wrestled with that issue for a while because most organizations say that they want insights, but they don’t. Because insights are going to mean that we have to change. And if I’m a mid-level manager — now I’ve got to change my supply lines, I’ve got to change my staffing. “Can we just continue what we’re doing, and try to do it better?” They’ll say, “We want to be harmonious, so we’re going to make decisions where everybody agrees.” A harmonious decision is a terrible idea because that means that everybody has a veto. And so your chance of coming up with an innovation has been severely compromised. DUBNER: Do you ever have harmonious decisions in your personal life, maybe with your family? KLEIN: I am guilty of the delusion that we can have harmonious decisions. And despite personal experience, I hold on to this goal. DUBNER: Do you personally, routinely, do pre-mortems, even just a quick in-your-head one, when you’re about to make a decision? KLEIN: I do not do it when I — I make lots of decisions, and so I don’t do it automatically. DUBNER: Did you pre-mortem this interview today, Gary? That was a no. We ask the C.E.O. of a startup if he would like to try Gary Klein’s pre-mortem idea. COLEMAN: I guess I disagree with Gary. * * * In 2018,Will Colemanleft his job as a partner at McKinsey, the consulting firm, in order to launch a rideshare startupcalled Alto. Will COLEMAN: At Alto, we’re elevating rideshare for both drivers and passengers. We offer a really differentiated service through W-2 employees and company-owned vehicles. So, at Alto, you always know exactly what you’re going to get: a safe, clean, high-quality ride, every single time. DUBNER: A lot of those words sounded as if they were chosen to be contra Uber and Lyft. Is that essentially the case? COLEMAN: That is essentially the case. Uber and Lyft, we think, are the contra of safe, clean, consistent. Our brand was always built to go head-to-head against the big names and to compete directly against them in every major city. DUBNER: Are you also, to some degree, a luxury product? COLEMAN: We call it an accessible luxury. We want it to be something that feels luxurious, but that is for most people, a couple dollars more, it might be because you really value your safety and the type of vehicle that you’re in or the type of person that you’re in the vehicle with, or that you just value the consistency, knowing exactly what you’re going to get. So we see it a lot like a cup of Starbucks coffee. You can get a much cheaper cup of coffee, but most people choose that for that consistency and quality every single time. DUBNER: How many markets are you in right now? COLEMAN: Yeah, we’re in six markets across the U.S.: Los Angeles, San Francisco, Dallas, Houston, Miami, and Washington, D.C. DUBNER: I did not hear New York City there. Why not? That’s a big market. COLEMAN: New York is a very expensive market. It’s a very competitive market. It’s very big, and it’s a huge opportunity. But as efficient and maybe conservative allocators of capital, we want to perfect the product. The rideshare market is tough to break into. Uber and Lyftdominate both the drivers and the ridersin most places. Coleman hopes that Alto’s business model can set it apart. Instead of using freelance drivers who have their own cars, which is how Lyft and Uber do it, Alto employs the drivers directly and leases vehicles from manufacturers. Will that work? The history of the rideshare industry is already littered with firms that tried to challenge Uber and Lyft: Juno, Sidecar, Fasten, and more. We asked Gary Klein how he might help Alto stay off that list. KLEIN: Okay, so there’s a couple of things that I might do with them. First of all, we would want to run some pre-mortems, to inject a healthy dose of reality. Not that I don’t think they have that. A second is are they going to be able to pivot based on what they learn? Or are they going to get locked into a business model, and not be resilient or flexible as things develop? Because things will develop. Their plan is not going to continue as they’ve originally designed it, simply because nobody is smart enough to come up with a perfect plan right off the bat. So you do want to make discoveries, and you do want to be able to pivot and maybe even make massive changes in your business model. I mean, if you do some sort of pre-mortem, you might say, “What are the things that we might have to adapt for,” in part to build a more resilient organization. We went back to Will Coleman to ask what he thinks of Gary Klein’s suggestion. COLEMAN: Yeah, we’re not going to be running any pre-mortems at Alto. DUBNER: Because why? COLEMAN: I guess I disagree with Gary. I mean, if you’re constantly focused on the downside, then I think you’re probably not focused enough on the upside. I often tell my team, you know, the money-making machine hasn’t been built yet. If you’re in a company like Google or Apple or Amazon, the money-making machine has been built, and you’re just there to make it better. Here, you’re really building something from scratch. And so, honestly, the, the, the, the, the proposition of failure is almost — I mean, startups fail every day, you know? Probably, what, 99 percent of them? So you’re already going into this with an understanding that failure is the most likely outcome. So we could sit around and talk about that for hours, days, but we’ll never make any progress. It’s paralyzing. Instead, what we talk about and what I focus on is, you know, how do we just get to the next decision point? How do we just get to tomorrow? How do we just make this incrementally better now? DUBNER: I hate to keep leading you down the road of potential failure, but I do want to ask let’s say this doesn’t work, and a couple of years from now, you need to close up shop. Can you envision what that would feel like for you? COLEMAN: It would be devastating. Yeah. I mean, because, we’ve been on the brink of that before. In Covid, we — I mean, I’m not kidding, we lost 95 percent of our revenue in a day. We were more agile during that period of time than we had ever been. And the impact of that, was that many of those products that we built that were the ones that succeeded, which was maybe a tenth of them, but the ones that did are now 20, 30 percent of our revenue. Incremental things that we didn’t have before the pandemic have made our business more robust, more resilient. A couple months after we spoke with Coleman, we learned that Altoshut down service in San Francisco— and later, theystopped operations in two more cities. This all came with significant layoffs. Does this mean they’ll join the90-some percent of failed startupsthat Coleman mentioned? I, of course, have no way of knowing. But if they do fail, and fail spectacularly, they might end up with this man: Samuel WEST: Hi. My name isSamuel West. I’m a psychologist and I’m a curator. He is a curator and founder ofThe Museum of Failure. And how did that come to be? WEST: So I was in Croatia, in Zagreb, the capital, just on holiday with my family. And I stumbled into a museum called the Museum of Broken Relationships. So, I’d been thinking about ways to sort of spread the ideas of accepting failure, and how much room for improvement there is on learning from failure. And then I was in Zagreb and I just got this — you know, what do you call it? Hallelujah moment. And so it was that Samuel West invented the Museum of Failure. It’s a pop-up museum that has been traveling the world since 2017: Helsingborg, Sweden; Paris; Los Angeles; Washington, D.C. When we spoke with West, the museum was in Brooklyn. WEST: It’s a sunny, nice day, and we’re about to open in a few minutes. As it turns out, running a traveling museum is not easy. WEST: So here we have an example of failure at Museum of Failure. Our wall panels are falling off the wall. I’m going to kill somebody. The museum includes more than 150 failures, most of them inventions and commercial products; they range from trivial to fraudulent. WEST: Elizabeth Holmes. Do I need to say anything about her? No, come on. Gerber, back in the seventies, they launched a product of adult food in a baby food jar. This is the UroClub, from 2008. In case you didn’t hear that, it’s called the UroClub. Not “euro,” e-u-r-o, just u-r-o. WEST: It’s a golf club with yeah, it’s for us men when we’re out golfing and uh, need to urinate. So what you do is you unscrew the top of it. You clip it on your belt, and then you fiddle under the belt and you urinate into this canister camouflaged as a golf club, and then you screw it back up and you continue on with your golf.I mean, the criteria is that to be in the museum, it has to be an innovation and it has to be a failure, obviously. And then I have to find it interesting. The Museum of Failure will make you laugh; but West hopes that people walk away with more than that. WEST: So, the focus at the museum is on innovations, which is products and services. But in our personal lives we fail also. And the same principle applies there. We’re very bad at learning from our own failures because it’s uncomfortable. So if we’re willing to have those uncomfortable feelings and thoughts for a while, we can actually learn from them. I want people to feel liberated, that failing isn’t as bad as you think it is, usually. We also got Samuel West into a studio, to talk about failure more generally. WEST: I think failure is far more interesting than success. DUBNER: Because why? WEST: Because success is often sort of curated by whoever, whatever story the sender wants to present. Whereas failure feels much more authentic, much more human. DUBNER: Do you think it’s easier to learn from failure or from success? WEST: I think it maybe feels better to learn from success, but I think we can learn much more from failure. It’s a more natural way of learning. That’s how we learn how to eat, how to walk, how to do anything, is through a repeated trial and error. DUBNER: So here’s the thing. I agree with you, but it seems as though most of the world, certainly the business world, thinks the opposite. We are addicted to, you know, success porn. People read the books written by successful entrepreneurs and they say, okay, that’s what I’m going to do. People listen to popular music or watch popular films, and emulate that. It seems that there’s pretty much consensus that the best way to succeed is to copy success. What’s wrong with that idea? WEST: There’s nothing wrong with it, it’s just really difficult to do. And the thing is, it’s really low-effort learning. Because sometimes, you know, listening to that successful entrepreneur or listening to that successful artist, you think you’re just going to absorb the success by listening to the stories. Just because something works for someone else doesn’t mean it’s going to work for you. Since we spoke with Samuel West, the Museum of Failure itself seems to be failing. West and his former business partner areengaged in a bitter public dispute; West has encouraged people not to buy tickets to the museum; he says the partner stole his collection of failure memorabilia. The partner denies this. So if the Museum of Failure isn’t the place for instruction at the moment, how else might you learn from failure? Throughout this series, we’ve spoken withAmy Edmondson, a scholar of failure at the Harvard Business School; she argues that, for starters, we should not be hiding our failures. Amy EDMONDSON: One way to think about this is, we will be failing, so let’s do it joyfully. Let’s do it thoughtfully. And celebrate them appropriately. DUBNER: Talk to me for a moment about the ways in which failure is a good teacher, but we ignore its lessons. And I’m particularly thinking about the lack of publishing of null results, and things like that. EDMONDSON: We don’t, in academia, we don’t publish our null results. So that means not only do we not spend enough time on them to really learn what they’re teaching us. But even more importantly, our colleagues near and far don’t get to see them. So then they’re at risk of trying the same thing. Which to me is the most wasteful of the wasteful failures, is when we already had that knowledge, but somehow we aren’t able to share it. DUBNER: Should there be a journal of failed results somewhere? EDMONDSON: Yes. And, you know, it’s not as strange as it sounds. You could still have very high standards because you wouldn’t publish things that were just nonsensical, or didn’t have thoughtful hypotheses or theories that led you to spend that time studying them. DUBNER: You want to be the editor-in-chief, and I’ll be your amanuensis or something? EDMONDSON: Ah, let’s do it the other way around. DUBNER: Oh, I failed in my request to Tom-Sawyer you into painting the fence, there. EDMONDSON: I like the idea, though. Okay, so that’s one vote for a journal of failure — but Edmondson doesn’t want to run it. Maybe we can persuade this person. Roy SHALEM: My name isRoy Shalem. I have a Ph.D. in economics. Shalem teaches at Tel Aviv University and studies the economics of competition and regulation. He once published a paper called “The Market for R&D Failures.” SHALEM: So what I’m trying to analyze is a situation in which firms are competing head-to-head in a certain kind of a patent race. Patent races are quite common; think about when pharmaceutical firms are competing to find a disease treatment. But this goes way beyond pharma companies. SHALEM: One of the most famous examples is when Alexander Graham Bell and Elisha Grayboth filed a patent for the telephone on the same day in 1876. Bell won the patent, started this successful company, now synonymous with telephone, while far fewer people remember Gray. A typical patent race is winner-take-all. The competitors work hard, invest a lot of resources, but only the winner reaps the rewards. And the loser, or losers, are left with pretty much nothing. Roy Shalem, based on his research around corporate innovation, thinks this model is due for an upgrade. He thinks the losers should also have a way to monetize their efforts. SHALEM: My paper proves that theoretically there is a potential for a market for R&D failure. When you sell knowledge of past failures, you are expected both to reduce the cost of R&D because you’re not doing the same mistakes over and over again, and you also reduce the time until a discovery is made. So that’s also worth money. If Shalem had his way, there would be — as he titled his paper — a true market for R&D failures. SHALEM: Basically, when you’re doing something which is very hard, you mostly produce failures. And this is a very, very important part of the stock of knowledge. And so I think that it is possible to take all that knowledge and find the right price for a competitor to buy that knowledge. So far, at least, such a market does not exist. So what else can we do if we want to seriously consider the idea of learning from failure? Maybe we learn from failure in the old-fashioned way: in a classroom. MACPHAIL: I mean, I’m old-school. I’m talking about Hobbes. * * * Do you remember Theresa MacPhail? She’s the medical anthropologist who initially thought that Covid-19 wouldn’t be a big deal. MACPHAIL: I said, “Calm down. You know, we’re not China. We’re better-equipped, here’s why.” MacPhail’s day job is teaching undergraduate engineering students at Stevens Institute of Technology. MACPHAIL: Right. They’re all science and technology nerds and geeks, and I mean that in the best possible sense — my people. Very driven, very type-A personalities. I mean, you don’t get into science and tech lightly. It’s not an easy subject, and the course load is quite hefty. At some point in their lives, probably the majority of like, say, 70 percent will probably go on to get some sort of master’s or Ph.D. DUBNER: And then in terms of careers, what’s typical, what sort of careers? MACPHAIL: Engineers. Engineers. Engineers. And research scientist. DUBNER: And within engineering, is it software, mechanical, electrical, everything? MACPHAIL: The whole gamut. They’re building your bridges. They’re putting up your buildings, they’re designing your sewage pipes — DUBNER: All things I don’t want to fail. MACPHAIL: Exactly. Exactly. They’re designing your airplane engines, everything. DUBNER: Now, for someone studying engineering, who sees a future designing things where the stakes are high — an airplane, a bridge, whatever — how do they think about failure generally in their work? MACPHAIL: It’s the worst thing that can happen. It’s the worst thing that can happen. They’re all very high-achieving students, so they’re used to getting straight A’s or close to it. They come in thinking that failure is bad, and it needs to be avoided at all costs. And they have imbibed the cultural narrative of, Oh, you must learn from your failures and fail better and fail faster, but they kind of don’t buy it. DUBNER: Why do you think that is? MACPHAIL: I did a research project where a psychology professor and I designed a survey, and just wanted to get a sense of how they define failure for themselves and what they think about it, and what they think the American culture thinks about it. And they’re all really aware. When we asked them what Americans think about failure, some of their answers are, “You’re not doing a good job. You must be lazy, weak, incapable, stupid.” They say that if you fail, it’s going to lead you to poverty, perhaps, a lack of social status. One person, this is a direct quote that I wrote down, “If you fail, you suck.” So MacPhail got to thinking about whether there was a better way to talk to her students about failure — a more direct way. MACPHAIL: I know that business schools already teach case studies in failures, like they’ll teach what happened to Enron, what happened to WeWork. And that’s great for business students, but that’s not what I wanted to do. I wanted to really get them familiar with the concept of failure, and introduce it as a necessary and natural part of life and as a crucial component of a well-lived life. And she felt the stakes were high — higher than most of us are willing to admit. MACPHAIL: Around 2017, 2018, we had a year that had several suicides. And you know, we’re not alone. You pick up the newspaper, and you’re reading constantly about, Penn, Yale, Cornell. I mean you name a school and they’re having a suicide problem. And one of the students who committed suicide in 2018 was my student, one of my students in a class that I had. She was active. She was involved heavily in Amnesty International, which is how she came to me, because she took my global health class. She was very interested in helping others. She was cheery. She was a pleasure to be around. There were none of these signs, when she was in my classroom at least, of outward struggle. So I really felt blindsided when I heard that she had committed suicide. And I had heard from friends of multiple students who had committed suicide in that same time frame, that one of the things they were all worried about is that they were somehow going to screw up, that they had screwed up, that college was the last good years, and then everything else was just going to be a series of failure. And I thought, my God, what is happening? And so as a professor, you know, I’m teaching — and I teach depressing classes, let me just be honest about this. I teach about things that can hurt us. I teach about pandemics, I teach about illnesses, I teach medicine, which is all about disease and death. And so my classes are pretty depressing. And I thought, what can I do to make a difference or, like, just provide a different perspective to try to help all of this anxiety. And that’s when Theresa MacPhail started teaching a course she calls Failure 101. MACPHAIL: So I start off the class with the ultimate failure, which is death. I really think I’m an intellectual granddaughter of Ernest Becker,who famously wroteThe Denial of Death. He was an anthropologist as well. And his take was that society everywhere is a living myth of the significance of human life, that we defiantly create meaning where none exists because we do not want to deal with the terror, that the ultimate mistake is one that’s going to get us killed. I start off the class saying, listen, life is terrifying because death is terrifying. And I think evolutionarily, mistakes meant catastrophe. And that’s probably why we don’t like them. Because if you make a wrong move in the savannah when you’re hunting, you’re dead. DUBNER: When I read your course description, and you describe teaching about failures in all realms of science, and then you write that death is the ultimate failure, my response was, “Well, that’s not fair.” My reasoning would be that failure implies at least some small level of un-inevitability, whereas death has a perfect record, as far as I know. MACPHAIL: Yes, but if you look at biology, death is your systems all failing. See what I’m saying? But that’s a perfect example to try to get them to accept that failure is necessary. Because the example of something that doesn’t die is cancer. And that’s not what we want. And so there’s that tension that, yes, death is, if you think about it from that perspective, it’s all your systems shutting down one by one, in a cascade. And you can see that as the ultimate failure. But then I try to get them to embrace that because — and again, I’m just Becker’s granddaughter, because his argument was, if we distract ourselves and we try to push down our fears of failing, ultimately that’s about our fear of dying, that ironically, trying to push all of that down and not talking openly about it creates more problems. So that’s my take, is that, yeah, you have to embrace failure because you can’t have a successful life without it. I basically tell them at the start of my classes that I need you to get comfortable being uncomfortable. And I need you to be comfortable with uncertainty. And I really think embracing the idea that you’re going to fail is the antidote to that anxiety. DUBNER: Okay, but, Professor McPhail, I’ve gotten nothing but A’s the last 13 years of my life, and I’m not going to stop now. So would you please not say things like that and get out of the way and start lecturing and give me an A? MACPHAIL: No. I’m trying to take failure and put it on the table and look at it as a social object. From an economic perspective, what does it look like? From a business perspective? From a science perspective? Because failure is a changeable object. Like, one failure in one arena doesn’t necessarily have any of the components of the same label in another. I mean, I’m old-school, I’m talking about Hobbes. And we’re going over things like, what is the social contract, and what does the social good look like, and what does Hobbes think failure will be? DUBNER: Give me an example of a culture that dealt with or deals with failure very differently than 21st–century American. MACPHAIL: I mean, it’s never good. I mean, here’s the thing. So, anthropologists often ask, what are the things that all cultures everywhere struggle with? And failure is definitely something that all cultures grapple with on some level. DUBNER: That surprises me. I would have thought there have been many cultures and societies through time where — MACPHAIL: Where it’s fine? DUBNER: I don’t know about fine. MACPHAIL: It’s great? DUBNER: I definitely don’t think great. But I mean, here’s the way I’m thinking: if you look at our track record, humans, we’re pretty darn fallible. We screw up all the time in so many ways. MACPHAIL: Right. DUBNER: And so it’s surprising to me that we haven’t developed a philosophy or a science of failure that would be fairly timeless and robust and so on. MACPHAIL: You would think so, but not in my — I mean, maybe someone will listen to this and say, “Here’s the book that answers it all.” But the truth is, there’s something about the time you’re living in that it’s either hard to see what it is you’re doing wrong or it’s hard to admit where that buck stops. DUBNER: I know that the researchers Lauren Eskreis-Winkler and Ayelet Fishbackhave done work looking at why we hate failure so much. And it comes down to a pretty obvious point, which is that ego is real, and failure threatens our ego and universally it feels bad. So if we were to reduce it to that finite and concrete, psychological response, an emotional response, have you encountered any way to sort of take the sting out of that response? MACPHAIL: Not really, except for embracing it. So I would, I guess — DUBNER: Man, I came in thinking you were going to have all sorts of — MACPHAIL: All the answers? I went back to Amy Edmondson, the failure expert at Harvard, to ask what she would like to see taught in a Failure 101 class. EDMONDSON: Number one: distinguishing different kinds of failure. A failure is not a failure is not a failure. You know, we could be talking about a little mistake. We could be talking about a catastrophic accident. We could be talking about a scientific, you know, hypothesis that didn’t get supported. So, providing the students that useful terminology and that useful clarity. And then I think a second element that I’d love to see in the course is experimentation best practices, right? You know, how do you think about good experiments versus not good experiments? Here’s what Theresa MacPhail writes in her Failure 101 syllabus: “Some assignments will intentionally be set up for you to fail to complete them in full. But I expect you to cope with this as best you can and turn in something. I will not warn you which weeks are impossible to complete.” MacPhail has now taught the course seven times. The only grades she gives are an A for passing, or an F for failing. She has only had two students ever fail the class. MacPhail says she has gotten positive feedback from students, their parents, and, according to some students, their therapists. She would like to see her course taught at other schools. MACPHAIL: I think they should offer a Failure 101 course because it works. It changes the students’ perspectives on failure. It makes them embrace it. It completely alters their understanding of themselves in relationship to the norm. And I think that’s worth it. DUBNER: I’m looking at yourRate My Professor rankings. MACPHAIL: Oh, God. DUBNER: And you have a perfect score. I’ve never seen that before. Here’s one review: “Quite possibly the best professor I have ever had. Confident and knows what she’s talking about. She’s enthusiastic about her lectures, and that enthusiasm is truly contagious to students. She just loves what she does. Also, she is so cool. She’s had such an interesting life. Low-key, want to be her.” All right. So what’s your review of that review? MACPHAIL: Oh, my God. If they could only see me behind the scenes, they’d —you know what, though? I think they feel like that because I do show them my failures. DUBNER: For instance? MACPHAIL: Well, I mean, we’re all human beings. There are going to be days where I’m not entirely prepped for class. DUBNER: Ah, what do you do then? MACPHAIL: I announce it. I say, “Hey, guess what? I forgot my notes at home. So we’re off the books. Let’s do this.” Or I also will — I mean, we live in the age of lightning Googling. So, you know, “If I say something, feel free to fact-check me. And if I’m not right, raise your hand.” Because I want them to get the idea that you can be an expert, you can be highly knowledgeable, but there’s no way I know everything. DUBNER: What is the upside of embracing or at least processing failure in the way that you’re describing? MACPHAIL: Freedom. Freedom — and a lightness of moving through the world. DUBNER: Okay, but the people designing our airplanes and bridges, I don’t care if they feel free and light. MACPHAIL: So here’s the thing: before any of us step on a plane, there’s been so many prototypes and there’s been so many tests. And the thing I’d like to see more is letting people fail. There has to be a space for people to accept abject failure. Failure that doesn’t teach you anything. DUBNER: And in that space, what does one do? Does one grieve, for instance? MACPHAIL: I think, yes. I think one learns acceptance, and out of acceptance comes resilience. MACPHAIL: I asked them to reflect at the end of every class. And the answers I get back is that they’ve totally changed their definition of what failure is. Most of them will say it’s not the end of the world. It’s a setback that you learn from. And all of them understand that it’s subjective and a social construct. Simply having a class where you come in once a week for three hours and talk about failure just blatantly somehow made it okay for them to accept their own personal failures. And one of the things that shifts throughout the classes is, I asked them, “What do you think the rate of other people’s failures is compared to your own?” And before they take the class, they say, “Oh, I definitely fail more than other people.” And then at the end of the class, they go, “Everyone is failing every day at everything. And I’m like, “Yes, that’s right. Correct. You’ve passed this class.” I’d like to thank Theresa MacPhail for teaching all of us a new way to think about failure. And thanks to everyone who spoke with us for this “How to Succeed at Failing” series. I’m curious to know how you think we did, with this series; one key ingredient of learning from failure is getting good feedback, and I want yours. Our email isradio@freakonomics.com. You can also leave a rating or review on your podcast app. Until then, take care of yourself and, if you can, someone else too. * * * Freakonomics Radiois produced by Stitcher and Renbud Radio. This episode, and this entire series, was originally produced by Zack Lapinski, and was updated with help from Dalvin Aboagye. It was mixed by Greg Rippin and Jasmin Klinger, with help from Jeremy Johnston. The Freakonomics Radio Network staff also includes Alina Kulman, Augusta Chapman, Eleanor Osborne, Ellen Frankman, Elsa Hernandez, Gabriel Roth, Morgan Levey, Sarah Lilley, and Theo Jacobs. Our theme song is “Mr. Fortune,” by the Hitchhikers; our composer is Luis Guerra. **Sources** Will Coleman, founder and C.E.O. of Alto. Amy Edmondson, professor of leadership management at Harvard Business School. Babak Javid, physician-scientist and associate director of the University of California, San Francisco Center for Tuberculosis. Gary Klein, cognitive psychologist and pioneer in the field of naturalistic decision making. Theresa MacPhail, medical anthropologist and associate professor of science & technology studies at the Stevens Institute of Technology. Roy Shalem, lecturer at Tel Aviv University. Samuel West, curator and founder of The Museum of Failure. **Resources** “A Golf Club Urinal, Colgate Lasagna and the Bitter Fight Over the Museum of Failure,” by Zusha Elinson(Wall Street Journal,2025). Right Kind of Wrong: The Science of Failing Well,by Amy Edmondson (2023). “You Think Failure Is Hard? So Is Learning From It,” by Lauren Eskreis-Winkler and Ayelet Fishbach (Perspectives on Psychological Science,2022). “The Market for R&D Failures,” by Manuel Trajtenberg and Roy Shalem (SSRN,2010). “Performing a ProjectPremortem,” by Gary Klein (Harvard Business Review,2007). **Extras** “The Deadliest Disease in Human History,” byPeople I (Mostly) Admire(2025). “How to Succeed at Failing,” series byFreakonomics Radio(2023). “Moncef Slaoui: ‘It’s Unfortunate That It Takes a Crisis for This to Happen,’” byPeople I (Mostly) Admire(2020). **Comments** Freakonomics® is a registered service mark of Renbud Radio, LLC. All contents © Freakonomics. All rights reserved. As an Amazon Associate, Freakonomics may earn commissions from qualifying purchases made through links on this site. Privacy Policy|Terms of Service We have updated our Privacy Policy to clarify how we collect and process your personal data. By continuing to use this website, you acknowledge that you have read and agree to the updatedPrivacy Policy. We have updated our Privacy Policy to clarify how we collect and process your personal data. By continuing to use this website, you acknowledge that you have read and agree to the updatedPrivacy Policy. We have updated our Privacy Policy to clarify how we collect and process your personal data. By continuing to use this website, you acknowledge that you have read and agree to the updatedPrivacy Policy."}