{"id": 1534, "name": "Victoria Buzz", "domain": "victoriabuzz.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://victoriabuzz.com/2025/06/theres-a-bike-relay-happening-across-vancouver-island-to-raise-funds-for-island-kids-cancer-association/", "title": "Theres A Bike Relay Happening Across Vancouver Island To Raise Funds For Island Kids Cancer Association", "content": "Latest NewsEnvironmentLocal NewsHousingCrimeTransportationSports Environment Local News Housing Crime Transportation Sports Environment Local News Housing Crime Transportation Sports LifestyleFood and DrinksArtsOutdoorsPhotos and VideosBusinessOffbeat Food and Drinks Arts Outdoors Photos and Videos Business Offbeat Food and Drinks Arts Outdoors Photos and Videos Business Offbeat EventsLatest event storiesEvent Calendar Latest event stories Event Calendar Latest event stories Event Calendar MoreContestsEvents CalendarBrandedBecome an insiderAdvertiseThe Buzzle Contests Events Calendar Branded Become an insider Advertise The Buzzle Contests Events Calendar Branded Become an insider Advertise The Buzzle **News** Terms and Conditions Advertise Got a tip? Contact Us Commenting Policy Contest Rules **Company:** Become an Insider Our Team About Us Advertise Contact us **** **Join over 8,000 Victorians who receive our daily newsletter!** To subscribe, simply enter your email address on our website or click the subscribe button below. Don't worry, we respect your privacy and won't spam your inbox. Your information is safe with us. Latest NewsEnvironmentLocal NewsHousingCrimeTransportationSports Environment Local News Housing Crime Transportation Sports Environment Local News Housing Crime Transportation Sports LifestyleFood and DrinksArtsOutdoorsPhotos and VideosBusinessOffbeat Food and Drinks Arts Outdoors Photos and Videos Business Offbeat Food and Drinks Arts Outdoors Photos and Videos Business Offbeat EventsLatest event storiesEvent Calendar Latest event stories Event Calendar Latest event stories Event Calendar MoreContestsEvents CalendarBrandedBecome an insiderAdvertiseThe Buzzle Contests Events Calendar Branded Become an insider Advertise The Buzzle Contests Events Calendar Branded Become an insider Advertise The Buzzle **There’s a bike relay happening across Vancouver Island to raise funds for Island Kids Cancer Association** Share There’s a bike relay for a good cause happening next week, and you can get involved! The race, titled “End2End,” will take place on Tuesday, June 17th, and is a 1,000-kilometre relay involving eight cyclists, who will be pedaling from Victoria to Port Hardy and back. This relay is done in support of the Island Kids Cancer Association (IKCA), which is a small, but mighty, charity that works with families on Vancouver Island and the Gulf Islands who have been impacted by childhood cancer. IKCA was founded by Susan Kerr in 2017, who lost her own son, Jacob, to the disease. Her understanding and knowledge of the struggles these families face offers her intimate insight into their struggles, as well as the ability to provide adequate care. End2End, created by Andy Dunstan, was launched as a fundraising relay in hopes of providing IKCA with the support needed to continue their work. He envisioned four pairs of cyclists taking turns riding a succession of 50-kilometre segments. Each pair will be pedalling for around two hours, rest of six, then go for another leg in this round-the-clock journey. Upon completion of the relay, each rider will have cycled 250 kilometres. The funds raised from the relay will go towards IKCA’s mission to provide these families with essentials such as fuel, food, and mental health care, as many have to leave their jobs to care for their children. “Those three should never be out of reach for families supporting a child with cancer,” said Kerr in a media release. Not only will End2End support day-to-day essentials for these families, it will also give the community the chance to learn more about IKCA and ways they can get involved beyond race day. Dunstan will be racing, alongside Bill Fry, the owner of Trek Bicycle Store Victoria, who is also sponsoring the event. Dunstan and Fry will set out from Trek Bicycle Store in Vic West at 6 p.m., making their way to Cobble Hill before giving way to Saanich police officer Rob McDonald and Duncan resident Chris Day, a CFB Esquimalt firefighter. The next pair includes CHEK News’ Mary Griffin and retired Mountie Steve Foster, followed by commercial realtor Erin Glazier and VicPD detective Kevin Nystedt. The race is estimated to to end on Thursday, June 19th around suppertime, two days after they first began their journey. Already the event has created a lot of buzz, and has drawn a great deal of community support leading up to the relay. “I’ve never seen a group of people come together and ignite the community in the way they have,” said Kerr. If you wish to learn more about the relay and IKCA or donate, visitEnd2End’s website. **End2End Relay for IKCA** Where:Departing from Trek Bicycle Store Victoria, 338 Catherine Street When:Tuesday, June 17th at 6 p.m. to Thursday, June 19th around 6 p.m. 🏨 Oak Bay Beach Hotel 🏨 Oak Bay Beach Hotel 🥅 Victoria Royals Hockey Club 🥅 Victoria Royals Hockey Club 😋 Browns Crafthouse Vic West 😋 Browns Crafthouse Vic West 📝 Notaries on Douglas 📝 Notaries on Douglas 💻 Happy Sasquatch Websites and Hosting 💻 Happy Sasquatch Websites and Hosting **Jump to:[hide]** End2End Relay for IKCA Read more **Vancouver Island man fined $60K for destroying vital salmon habitat on Trent River** **A strawberry moon will light up Greater Victoria skies tonight** **Celebrate love: There’s a Pride celebration taking place in Tofino this weekend** **Thefts surge in Nanaimo as RCMP respond to car break-ins and scooter thefts** **Petition launched to stop the demolition of two Sidney apartments buildings** **Vancouver Island man fined $60K for destroying vital salmon habitat on Trent River** **A strawberry moon will light up Greater Victoria skies tonight** **Celebrate love: There’s a Pride celebration taking place in Tofino this weekend** **Thefts surge in Nanaimo as RCMP respond to car break-ins and scooter thefts** **Victoria Buzz** This article is intended for readers of legal age. Are you over 19 years of age? Last Updated on Wednesday, June 11th, 2025 byNevada Alde"}