{"id": 715, "name": "The Jewish Press", "domain": "jewishpress.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.jewishpress.com/news/elections-news/orthodox-right-scores-landslide-victory-over-reform-left-in-u-s-zionist-congress-delegate-vote/2025/06/06/", "title": "Orthodox Right Scores Landslide Victory Over Reform Left In U S Zionist Congress Delegate Vote", "content": "Home News & Views InDepth Blogs Judaism MagazineSectionsMagazineWord PromptBooksArtsFeatures On The Jewish WorldCommunityFamilyFoodAliyahSportsTravelReal EstateHealth and LivingMental HealthHealth and LivingIn Memoriam Sections Magazine Word Prompt Books Arts Features On The Jewish World Community Family Food Aliyah Sports Travel Real Estate Health and Living Mental Health Health and Living In Memoriam Sections Magazine Word Prompt Books Arts Features On The Jewish World Community Family Food Aliyah Sports Travel Real Estate Health and Living Mental Health Health and Living In Memoriam Radio Cartoons In Print AboutAbout UsContact UsSubmit an ArticleThe Siruv ListSupport Jewish JournalismAdvertise on The Jewish PressSubscribe: Daily Email List About Us Contact Us Submit an Article The Siruv List Support Jewish Journalism Advertise on The Jewish Press Subscribe: Daily Email List About Us Contact Us Submit an Article The Siruv List Support Jewish Journalism Advertise on The Jewish Press Subscribe: Daily Email List Classifieds e-Edition Print Subscriptions eMail Advertise Home News & Views InDepth Blogs Judaism MagazineSectionsMagazineWord PromptBooksArtsFeatures On The Jewish WorldCommunityFamilyFoodAliyahSportsTravelReal EstateHealth and LivingMental HealthHealth and LivingIn Memoriam Sections Magazine Word Prompt Books Arts Features On The Jewish World Community Family Food Aliyah Sports Travel Real Estate Health and Living Mental Health Health and Living In Memoriam Sections Magazine Word Prompt Books Arts Features On The Jewish World Community Family Food Aliyah Sports Travel Real Estate Health and Living Mental Health Health and Living In Memoriam Radio Cartoons In Print News & Views Jewish Politics Elections Left vs. Right US **Orthodox/Right Scores Landslide Victory Over Reform/Left in U.S. Zionist Congress Delegate Vote** tweet A record-breaking 230,257 votes were cast in the election for U.S. delegates to the 39th World Zionist Congress, according to preliminary results released by the American Zionist Movement (AZM), the umbrella organization overseeing the vote in the United States. The preliminary tally shows a clear lead for the Orthodox/Right bloc with 134,724 votes, compared to 95,500 votes for the Reform/Left bloc, although the single biggest vote winner was “Vote Reform”: ORTHODOX / RIGHT-WING SLATES (16 slates) Am Yisrael Chai 31,765Eretz HaKodesh 29,159Orthodox Israel Coalition (OIC) 26,975ZOA Coalition 8,511Israel365 Action 2,339SHAS 2,658Dorshei Torah V’Tzion 1,946Herut North America 1,109Americans 4 Israel 385Kol Israel 5,314Aish Ha’am 6,649Achdut Israel 1,592Beyachad 3,238American Forum for Israel 1,539Israeli American Council (IAC) 5,344VISION 6,201 REFORM / LEFT-WING SLATES (6 slates) VOTE REFORM 47,887MERCAZ USA 27,893HATIKVAH 11,537The Jewish Future 1,794ANU 1,509AID Coalition 4,880 Preliminary results released on Thursday confirm that participation in the 2025 election for U.S. delegates to the World Zionist Congress surged by over 86% compared to the last election in 2020. A total of 230,257 valid votes were cast—224,237 online and 6,020 via mailed paper ballots—up from 123,575 votes in the previous cycle. The election, held from March 10 to May 4, 2025, concluded with the tabulation of all ballots and final decisions by the Area Election Committee (AEC), which oversees the process. The 152 delegates elected from the United States—representing roughly one-third of the 525-member Congress—will join international delegates in determining the allocation of more than $1 billion annually in support of Israel and global Jewish initiatives. tweet **House Speaker Mike Johnson Soon to Address Knesset** **Breakthrough in Hostage Talks: Netanyahu Cites ‘Significant Progress’ with Hamas** **House Speaker Mike Johnson Soon to Address Knesset** **Breakthrough in Hostage Talks: Netanyahu Cites ‘Significant Progress’ with Hamas** **British Commonwealth, Norway Impose Sanctions on 2 Israeli Government Ministers** **Israeli Navy Launches First-Ever Strike on Houthi Port** **Stunning Roman Sarcophagus Depicting Dionysus and Hercules Unearthed in Caesarea** **IDF Intercepts Greta’s Gaza Flotilla, Shows Passengers Hamas Atrocity Footage** **PA Arabs with IDF Uniforms Arrested at Tel Aviv Light-Rail Station** **IDF Intercepts Houthi Missile Attack as Shavuot Ends with a ‘Boom’** **Stunning Roman Sarcophagus Depicting Dionysus and Hercules Unearthed in Caesarea** **Shkoyach: Financial Times Editorial Accuses Israel of Undermining Future Palestinian State** **Huge Pro-Israel Summit in Texas Canceled Due to Security Threats** **ICE Detains Family of Colorado Firebomber Mohamed Soliman** **DIR vs ABA – Parents Are Reconsidering Everything** **Jerusalem for Those Who Know** Home About Advertise Contact Privacy Dept. of Corrections Submit an Article Job Openings The Siruv List Subscribe (Email Newsletter) Subscriptions (Print Edition) Support Jewish Journalism Printed from: https://www.jewishpress.com/news/elections-news/orthodox-right-scores-landslide-victory-over-reform-left-in-u-s-zionist-congress-delegate-vote/2025/06/06/ Scan this QR code to visit this page online:"}