{"id": 1823, "name": "Thought Catalog", "domain": "thoughtcatalog.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://thoughtcatalog.com/callie-byrnes/2025/06/25-years-of-longing-the-best-quotes-from-in-the-mood-for-love-to-celebrate-its-25th-anniversary/", "title": "25 Years Of Longing The Best Quotes From In The Mood For Love To Celebrate Its 25th Anniversary", "content": "Explore↓ Latest Writers Books Originals Network↓ Thought Catalog Shop Catalog Creepy Catalog Collective World Agency Advertise About Us TV + Movies Mental Health Relationships Wellness Astrology Spooky 1.2m 935k 928k 2.5m Daily Devotionals TV + Movies Collective World Spooky Wellness Prayers The Life That’s Waiting Originals **25 Years Of Longing: The Best Quotes From ‘In The Mood For Love’ To Celebrate Its 25th Anniversary** \"She has kept her head lowered, to give him a chance to come closer. But he could not, for lack of courage.\" ByCallie Byrnes Updated 13 minutes ago,June 11, 2025 In The Mood For Love, the 2000 masterpiece by acclaimed filmmaker Wang Kar-Wai, officially turns 25 this year, and in celebration, the movie has returned to theaters for movie lovers to experience it again on the big screen. The film, known for its quiet yearning and heartache, revolves around Chow Mo-wan (Tony Leung) and Su Li-zhen Chan (Maggie Cheung), a man and a woman who are married to different people but learn that their spouses are having an affair with each other. The two grow closer as they try to understand why their partners would betray them—and in their quest to ward off the loneliness, they instead find love. The dialogue in the film is gut-punching, and it’s often what’s left unsaid that speaks the loudest. Here are the 10 best quotes fromIn The Mood For Love: **1.** Title Card: It is a restless moment. She has kept her head lowered, to give him a chance to come closer. But he could not, for lack of courage. She turns and walks away. **2.** Chow Mo-wan (Tony Leung): In the old days, if someone had a secret they didn’t want to share, you know what they did? Ah Ping (Ping-Lam Siu): Have no idea. Chow Mo-wan: They went up a mountain, found a tree, carved a hole in it, and whispered the secret into the hole. Then they covered it with mud. And leave the secret there forever. **3.** Su Li-zhen Chan (Maggie Cheung): You notice things if you pay attention. **4.** Chow Mo-wan (Tony Leung): Someone must have made the first move. Su Li-zhen Chan (Maggie Cheung): It doesn’t matter who made the first move. **5.** Chow Mo-wan (Tony Leung): I thought we wouldn’t be like them. But I was wrong. **6.** Su Li-zhen Chan (Maggie Cheung): Look at me, do you have a mistress? Chow Mo-wan (Tony Leung): Yes! Su Li-zhen Chan: I didn’t expect it to hurt that much. Chow Mo-wan: This is just a rehearsal. **7.** Su Li-zhen Chan (Maggie Cheung): Why did you call me at the office today? Chow Mo-wan (Tony Leung): I had nothing to do. I wanted to hear your voice. **8.** Chow Mo-wan (Tony Leung): I sometimes wonder what I’d be if I hadn’t married. Have you ever thought of that? Su Li-zhen Chan (Maggie Cheung): Maybe happier. I didn’t know married life would be so complicated. When you’re single, you are only responsible to yourself. Once you’re married, doing well on your own is not enough. **9.** Chow Mo-wan (Tony Leung): I can’t waste my time wondering if I made mistakes. Life’s too short for that. Something must change. **10.** Su Li-zhen Chan (Maggie Cheung): I didn’t think you’d fall in love with me. Chow Mo-wan (Tony Leung): I didn’t either. I was only curious to know how it started. Now I know. Feelings can creep up just like that. I thought I was in control. Read moreTV + Movies. About the author Callie Byrnes Callie joined Thought Catalog as an intern in 2017 and now works as the Editorial Director for its sister site,Collective World. She enjoys writing personal essays and articles about pop culture, astrology, and tarot. She published her first book, ‘The Words We Left Behind,’ in 2024. Instagram Facebook Twitter These are the moments that matter the most… The Words We Left Behind byCallie Byrnes MoreThoughtCatalog Celebrate ‘The Breakfast Club’s’ 40th Anniversary With The Most Memorable Quotes From The FilmDakota Johnson, Chris Evans, And Pedro Pascal Are A Press Tour Masterclass For ‘Materialists’Ranking The Disney Marvel Shows From Best To Mid To WorstRanking TV’s 7 Most Toxic Couples4 Thrillers To Stream On Netflix In June Celebrate ‘The Breakfast Club’s’ 40th Anniversary With The Most Memorable Quotes From The Film Dakota Johnson, Chris Evans, And Pedro Pascal Are A Press Tour Masterclass For ‘Materialists’ Ranking The Disney Marvel Shows From Best To Mid To Worst Ranking TV’s 7 Most Toxic Couples 4 Thrillers To Stream On Netflix In June Celebrate ‘The Breakfast Club’s’ 40th Anniversary With The Most Memorable Quotes From The Film Dakota Johnson, Chris Evans, And Pedro Pascal Are A Press Tour Masterclass For ‘Materialists’ Ranking The Disney Marvel Shows From Best To Mid To Worst Ranking TV’s 7 Most Toxic Couples 4 Thrillers To Stream On Netflix In June Answer This Honestly I am currently: Click what appliesand take what you need.💖 Books connect our company’s digital roots with our love of traditional book publishing. Our books are designed as beloved art pieces. We publish work we love. Trending Books ↓ **The Becoming Journal** **How To Manifest Anything** **This Is Me Letting You Go** **101 Quotes That Will Change The Way You Think** **This Was Meant To Find You (When You Needed It Most)** **The Pivot Year** **Network** Shop Catalog Quote Catalog Creepy Catalog God & Man Collective World Thought Catalog Agency Thought Catalog Books **Metadata** About Us Advertise Privacy Statement Terms of Use **Contacts** sales@ hello@ **Social** Discord TikTok Instagram Twitter YouTube Facebook Founded in 2010, Thought Catalog is owned and operated by The Thought & Expression Company, Inc. For over a decade, we've been at the bleeding edge of media, pioneering an infrastructure for creatives to flourish both artistically and financially. © 2010 The Thought & Expression Company, Inc."}