{"id": 1911, "name": "Catholic World Report", "domain": "catholicworldreport.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.catholicworldreport.com/2025/06/10/exploring-the-affinities-and-contrasts-of-the-thomist-and-ignatian-traditions/#mh-comments", "title": "Exploring The Affinities And Contrasts Of The Thomist And Ignatian Traditions", "content": "Facebook Twitter Email (Weekly Newsletter) RSS Home ColumnsChapp’s SchtickEcclesia et CivitasGod’s FirstGod’s Two BooksThe Past Present Chapp’s Schtick Ecclesia et Civitas God’s First God’s Two Books The Past Present Chapp’s Schtick Ecclesia et Civitas God’s First God’s Two Books The Past Present FeaturesAnalysisBooksEditorialEssayFilm & MusicHistoryInterviewNewsOpinionSpecial Report Analysis Books Editorial Essay Film & Music History Interview News Opinion Special Report Analysis Books Editorial Essay Film & Music History Interview News Opinion Special Report The Dispatch TopicsPope FrancisPoliticsCultureBooksCanon LawAll Topics Pope Francis Politics Culture Books Canon Law All Topics Pope Francis Politics Culture Books Canon Law All Topics About CWR Advertise Donate [ June 11, 2025 ]Bishop of Graz in Austria ‘stunned and shaken’ after school shooting leaves 10 deadNews Briefs [ June 11, 2025 ]School choice boosts Catholic school enrollment in FloridaNews Briefs [ June 11, 2025 ]Christian youths embark on a ‘spiritual revolution’ to restore Europe’s soulNews Briefs [ June 11, 2025 ]Fidelity Month kickoff event in Congress promotes renewal of country’s ‘common bonds’News Briefs [ June 11, 2025 ]Pope Leo XIV appoints new Chinese bishop for Archdiocese of FuzhouNews Briefs **Comparing the affinities, differences between Ignatius and Aquinas** The eleven essays inIgnatius of Loyola and Thomas Aquinas: A Jesuit Ressourcementare scholarly examinations of the juxtaposition between two great traditions. June 10, 2025Tracey RowlandBooks,Features5Print Sometime last century, at the Fisher House chaplaincy in Cambridge, the Dominican chaplain told a joke in his homily—it was the Feast of St. Ignatius of Loyola—about the difference between Jesuits and Dominicans. He explained that the Dominicans were founded to fight the Albigensian heresy and the Jesuits were founded to counter Protestants. He then rhetorically asked which of the two had been the most successful, and the punch line was: ‘How many Albigensians do you know’? No doubt if a Jesuit had been present, he would have made some comment about respect for religious freedom. However, to be fair to both sides, they have each produced some outstanding scholars who have promoted the faith through an appeal to truth and rationality, not social coercion. The editors ofIgnatius of Loyola and Thomas Aquinas: A Jesuit Ressourcementhave thus produced a collection of scholarly essays, highlighting the intellectual affinities and synergies and, in some cases, stark contrasts between the two traditions. Two of the editors are leading scholars of the Thomist tradition (Justin M. Anderson and Matthew Levering) while the third editor (Fr Aaron Pidel, SJ), is a rising star from the Jesuit stable and a leading authority in the Anglosphere on the theology of Erich Przywara, SJ. There are eleven essays in all, and the only thread uniting them is the juxtaposition of the Thomist and Ignatian traditions. To review the work, one therefore needs to mention each chapter individually. The first is by Thomas Osborne titled “The Early Jesuits and Scholastic Theology”. The research here is very deep. Osborne trawls through the history of the disputes between scholastics and humanists at the Sorbonne in the 1520s and 1530s and charts the reactions of St. Ignatius Loyola and other early Jesuits to these disputes. Osborne’s conclusion is that while the Jesuits were innovative in their understanding of religious life, in their theology they were staunch defenders of Thomist scholasticism. Loyola gave scholastic theology a special place in his Rules for Thinking (or Feeling) with the Church and in the JesuitConstitutions. Justin M Anderson follows Osborne with a chapter on ‘Experiencing the Divine according to Thomas and Ignatius’. This is an important theme in the relationship between the two orders since St. Ignatius’s ideas on precisely this point landed him in trouble with the Spanish Inquisition and its Dominican advisors, somewhat notoriously, Melchor Cano and Tomas de Pedroche. Specifically, their charge was that the IgnatianSpiritual Exerciseswas a work of thealumbradismo–a Spanish mystical movement with an array of ideas, some possibly sound, some very heterodox. Anderson notes the judgment of Hans Urs von Balthasar that Loyola’s ideas on the experience of the divine, far from having analumbradismoprovenance, were influenced by the Bonaventurian tradition of mysticism, probably through Ludolph of Saxony and hisVita Christiand through the medieval tradition of ‘spiritual senses’. Anderson concludes his chapter with the thought: If the young Ignatius did lean too far towards the subjective dimension…then Thomas can function as a corrective, and possibly did in Ignatius’s Parisian theological training. Yet, where theology; in particular scholastic-Thomistic theology, becomes too objective, in the sense of being divorced from the subject and experience of the one who practices, then perhaps it is the Ignatian voice we need to hear underscoring the mystical to which theology stands in intimate proximity; ‘for the one who does not taste, does not know’ (p. 57). Still on the territory of affectivity, the third chapter by Margaret I. Hughes looks at how Ignatius and Aquinas viewed the passions. Her conclusion is that although they emphasize different facets of the passions, they understand the phenomena of the passions in the same way and especially the role of the passions in prayer for glorifying God. The fourth chapter was written by Fr Joseph Koterski, SJ, to whose memory the book is dedicated. He offers an analysis of the Thomist account of prudence and the Ignatian account of the discernment of spirits. His macro-level argument is that properly understood, both the Thomist account of prudence and the Ignatian principles for the discernment of spirits are not only compatible with one another but are mutually beneficial for souls. The caveat ‘properly understood’ is underscored by Koterski in his affirmation of the Thomistic “worry” about ‘the integrity of moral reasoning when Ignatian discernment practices are offered as a justification for moral assessments that amount to ethical consequentialism or situation ethics’. (p. 80). Koterski notes that ‘Thomists rightly point out that feelings, emotions, and passions do not alter the moral character of an action’, and thus, ‘the use of Ignatian concepts for this purpose does not show fidelity to theSpiritual Exercises’(p. 80). Chapter five is also offered by a Jesuit scholar–Nicolas Steeves. He is an authority on the theological significance of the human imagination. He writes: ‘to oppose Thomas Aquinas, satirized as an aloof nerd, to Ignatius of Loyola, styled as a starry-eyed, relativistic mystic, is to fall headlong into the trap of a fixed imaginary’. (p. 106). He is sympathetic to those who find scholasticism a bit dry. As he writes: ‘we children of post-modernity do not associate the syllogistic method with the creative imagination’ (p.120). Nonetheless, Steeves affirms the judgment of Herbert McCabe, OP, that the goal of logic, central to syllogistic argumentation is ‘not to help people to make rational arguments, but to hinder them from making bogus arguments’. (p. 120). Moreover, Steeves affirms the reading of Frederick Christian Bauerschmidt that ‘Thomas knows that most human thought is of an intuitive kind’ and he also ‘recognizes that poetry and rhetoric,inter alia, can help order thought’. (p. 120). It’s thus a little unfair to declare Aquinas a nerd, even if some of his cheer squad does seem to lack imagination. As for Ignatius, Steeves’ judgment is that he ‘implicitly concurs with Aquinas’s views on the imagination’ and he ‘adds thoughts drawn from experience on how the imagination relates to emotions and ethics’. These can complement and challenge the theories of Thomas himself or of those who fill the varied schools of Thomist thought’ (p. 134). The sixth chapter moves back to a Dominican contributor (Fr Andrew Hofer) and is focused on the treatment of frequent communion in the thought of Aquinas and Loyola. Hofer concludes: It would be wrong to claim that Thomas Aquinas was the only influence on Ignatius of Loyola regarding the frequent reception of Communion. But we have good reason to conclude that Ignatius and his Society of Jesus were influenced by Aquinas in their Eucharistic teaching, including frequent Communion. The Jesuit Eucharistic zeal is a teaching stitched through with elements already taught centuries before by Thomas Aquinas, especially with his scholastic concern for the practice of the early Church. (p. 166). From Eucharistic theology, the collection moves to a study of Mariology in chapter seven, presented by Sr. Theresa Marie Chau Nguyen, OP. Her macro-level argument is that ‘the Marian theme is not a superfluous addendum to Ignatius’s legacy but an essential element in his spirituality’. (p. 179). She notes that the postulator for the cause of his canonization reported that Our Lady appeared to Ignatius more than thirty times during his eight-month stay at Manresa. From Mariology, the move flows logically into ecclesiology, with the eighth chapter examining notions of the hierarchical church in the understanding of Aquinas and Loyola. This chapter is offered by Aaron Pidel, SJ, who concludes: It is sometimes debated whether Ignatius was the last of the medieval or the first of the early moderns. This study suggests that the transition between the two periods and sensibilities was a gradual one. Ignatius leaves behind some of the florid speculations about the hierarchical structure of reality more typical of high Latin scholasticism, showing little concern either for the number and nomenclature of the angelic choirs or for the exact division of labor into purification, illumination, and perfection. At the same time, Ignatius shows striking affinities for certain aspects of the Thomist hierarchical world-view, especially those aspects where Aquinas complicates Dionysius’s fixed order of mediation. Like Aquinas, but unlike Dionysius, Ignatius holds that God may illuminate either immediately or through angelic intermediaries, that Mary outranks the angels, that jurisdictional authority radiates from the pope as from a principal hierarch, and that ecclesiastical inferiors may nonetheless enlighten their superiors. It is often assumed that mystical experience tends to explode all religious frameworks, submerging them in the universal solvent of divine immediacy. Ignatius’s illuminations, however, do not seem to have had this effect. While it is true that they led Ignatius to seek God “in all things”, they nevertheless left him expecting to find God more reliably in some things rather than others. After being transformed by grace into “another man with another mind”, Ignatius grows only firmer in his conviction that God wishes to perfect the lower things through a meaningful order of “mediadores”. In this respect for thelex divinitatis, Ignatius was a faithful Thomist. (p. 216). Sam Zeno Conedera, SJ, follows Pidel with a chapter on obedience within the two traditions. He concludes that there is no uniform position among the Jesuits about the relationship between the teaching of Aquinas and Ignatius on the subject of obedience and he acknowledges that ‘the emphasis on the conformity of will and judgment in Ignatius and all the Jesuit authors is simply absent from the works of the Angelic Doctor, and Thomists are well within their rights to underscore this point’. (p. 245). Conedera also observes that for Thomists the vow of obedience and its exercise has a clear foundation in nature, whereas for the Jesuits it does not. On this issue, the two traditions are thus not easily reconciled. The tenth chapter offered by Elisabeth Rain Kincaid addresses the issue of the status of theconversos(Jewish converts) in the early history of the Society of Jesus. She argues that one of the early Jesuits, Francisco de Toledo (1532-1596)–not to be confused with the Viceroy of Peru of the same name–‘incorporated Ignatius’s theological convictions regarding God’s ongoing special relationship with the Jews and his defense of equal treatment of those ofconversodescent into a robust theological system, drawing creatively upon foundational insights of St. Thomas Aquinas’ (p. 248). This theme of the place of Judaism in salvation history as understood by Francisco de Toledo is continued in the final chapter by Kevin Flannery, SJ, who narrows the topic down to the issue of the possibility of coerced faith. This includes an analysis of the treatment of predestination in both Aquinas and Toledo. Flannery’s judgment is that Toledo’s positions allow for a greater limitation on religious liberty than the positions of Thomas Aquinas and that this is due to his different understanding of predestination from that of Aquinas. The role of free will in the act of faith is given greater significance by Aquinas than by Toledo. No doubt there are many other themes and fault lines that could be addressed in a study of the character of the Thomist and Ignatian traditions and their relationship to one another. Erich Przywara SJ’s publications from the early decades of the twentieth century are littered with comparisons and analyses of their polar tensions. This collection of essays, however, is an engaging first port of call for exploring this topic. Ignatius of Loyola and Thomas Aquinas: A Jesuit RessourcementEdited by Justin M Anderson, Matthew Levering, and Aaron Pidel, SJ.Catholic University of America Press, 2024Hardcover, 400 pages If you value the news and views Catholic World Report provides,please consider donatingto support our efforts. Your contribution will help us continue to make CWR available to all readers worldwide for free, without a subscription. Thank you for your generosity! Click herefor more information on donating to CWR.Click hereto sign up for our newsletter. Pew report: How the global religious landscape changed from 2010 to 2020 Pew report: How the global religious landscape changed from 2010 to 2020 Apostolate helps grandparents pass on the faith to their grandchildren Apostolate helps grandparents pass on the faith to their grandchildren AFCzJune 10, 2025 at 5:41 amI shall take my stand with St Thomas Aquinas ss a budding Thomas though on some topics he may not have been quite right, St Thomas was never wrong.Reply I shall take my stand with St Thomas Aquinas ss a budding Thomas though on some topics he may not have been quite right, St Thomas was never wrong. I shall take my stand with St Thomas Aquinas ss a budding Thomas though on some topics he may not have been quite right, St Thomas was never wrong. Paolo GiosuèJune 10, 2025 at 6:57 amThis fascinating collection of essays brings to light many important aspects of the Thomist-Ignatian encounter—from prudence and discernment to Eucharistic theology and ecclesiology. It reminded me of a recent article I translated from Italian, written by a Dominican theologian, which explores the same dynamic in today’s theological climate, particularly through the lens of the Rahner vs. Saint Thomas debate that continues to shape Catholic thought. The author reflects on the ecclesial and missionary implications of these two traditions in our own time. I thought it might be of interest to fellow readers of CWR:🔗 Dominicans and Jesuits in the MissionThere is also a second related article by the same author that I hope to translate soon.Reply This fascinating collection of essays brings to light many important aspects of the Thomist-Ignatian encounter—from prudence and discernment to Eucharistic theology and ecclesiology. It reminded me of a recent article I translated from Italian, written by a Dominican theologian, which explores the same dynamic in today’s theological climate, particularly through the lens of the Rahner vs. Saint Thomas debate that continues to shape Catholic thought. The author reflects on the ecclesial and missionary implications of these two traditions in our own time. I thought it might be of interest to fellow readers of CWR: 🔗 Dominicans and Jesuits in the Mission There is also a second related article by the same author that I hope to translate soon. This fascinating collection of essays brings to light many important aspects of the Thomist-Ignatian encounter—from prudence and discernment to Eucharistic theology and ecclesiology. It reminded me of a recent article I translated from Italian, written by a Dominican theologian, which explores the same dynamic in today’s theological climate, particularly through the lens of the Rahner vs. Saint Thomas debate that continues to shape Catholic thought. The author reflects on the ecclesial and missionary implications of these two traditions in our own time. I thought it might be of interest to fellow readers of CWR: 🔗 Dominicans and Jesuits in the Mission There is also a second related article by the same author that I hope to translate soon. Fr Peter Morello PhDJune 10, 2025 at 8:07 amDominicans preexisted the Jesuits. Jesuit intellectual brilliance, philosophical theological exploration posed challenging questions to the Thomist, eventually gaining a form of superiority in Catholic academia. A result is the preeminence of the Gregorian Pontifical University [Gregoriana] as compared to the Pontifical University of St Thomas Aquinas [Angelicum].Contest between the two was replete with most future scholars, Church hierarchy graduating from the Gregoriana. Until John Paul II. John Paul revived an authentic, contemporaneously versed Thomist vision for the modern world.Tracey Rowland addresses a key issue which for this writer is essential for understanding the depth and value of Saint Thomas Aquinas:“Flannery’s [Kevin Flannery, SJ] is that Toledo’s positions allow for a greater limitation on religious liberty than the positions of Thomas Aquinas and that this is due to his different understanding of predestination from that of Aquinas. The role of free will in the act of faith is given greater significance by Aquinas than by Toledo”.Conversely, because freedom of will is definitive to human nature made in the image of God, it also accounts for the validity of coercion within and by the Church, which corresponds to the fact that Christ left us commandments. The Laxity that developed among the progressive element post V II was due to their rejection of the Christian’s requirement to comply.Reply Dominicans preexisted the Jesuits. Jesuit intellectual brilliance, philosophical theological exploration posed challenging questions to the Thomist, eventually gaining a form of superiority in Catholic academia. A result is the preeminence of the Gregorian Pontifical University [Gregoriana] as compared to the Pontifical University of St Thomas Aquinas [Angelicum].Contest between the two was replete with most future scholars, Church hierarchy graduating from the Gregoriana. Until John Paul II. John Paul revived an authentic, contemporaneously versed Thomist vision for the modern world.Tracey Rowland addresses a key issue which for this writer is essential for understanding the depth and value of Saint Thomas Aquinas:“Flannery’s [Kevin Flannery, SJ] is that Toledo’s positions allow for a greater limitation on religious liberty than the positions of Thomas Aquinas and that this is due to his different understanding of predestination from that of Aquinas. The role of free will in the act of faith is given greater significance by Aquinas than by Toledo”.Conversely, because freedom of will is definitive to human nature made in the image of God, it also accounts for the validity of coercion within and by the Church, which corresponds to the fact that Christ left us commandments. The Laxity that developed among the progressive element post V II was due to their rejection of the Christian’s requirement to comply. Dominicans preexisted the Jesuits. Jesuit intellectual brilliance, philosophical theological exploration posed challenging questions to the Thomist, eventually gaining a form of superiority in Catholic academia. A result is the preeminence of the Gregorian Pontifical University [Gregoriana] as compared to the Pontifical University of St Thomas Aquinas [Angelicum].Contest between the two was replete with most future scholars, Church hierarchy graduating from the Gregoriana. Until John Paul II. John Paul revived an authentic, contemporaneously versed Thomist vision for the modern world.Tracey Rowland addresses a key issue which for this writer is essential for understanding the depth and value of Saint Thomas Aquinas:“Flannery’s [Kevin Flannery, SJ] is that Toledo’s positions allow for a greater limitation on religious liberty than the positions of Thomas Aquinas and that this is due to his different understanding of predestination from that of Aquinas. The role of free will in the act of faith is given greater significance by Aquinas than by Toledo”.Conversely, because freedom of will is definitive to human nature made in the image of God, it also accounts for the validity of coercion within and by the Church, which corresponds to the fact that Christ left us commandments. The Laxity that developed among the progressive element post V II was due to their rejection of the Christian’s requirement to comply. Fr Peter Morello PhDJune 10, 2025 at 8:27 amIllustrative of my point, Christ didn’t come into our world and say, C’mon guys, why can’t we all get along?Let us keep in mind it was Francis I who hated rules. A Jesuit. Why commands and rules? Because it’s the most explicit manner to reveal who and what God is. And why Jesus didn’t pussyfoot around.Reply Illustrative of my point, Christ didn’t come into our world and say, C’mon guys, why can’t we all get along?Let us keep in mind it was Francis I who hated rules. A Jesuit. Why commands and rules? Because it’s the most explicit manner to reveal who and what God is. And why Jesus didn’t pussyfoot around. Illustrative of my point, Christ didn’t come into our world and say, C’mon guys, why can’t we all get along?Let us keep in mind it was Francis I who hated rules. A Jesuit. Why commands and rules? Because it’s the most explicit manner to reveal who and what God is. And why Jesus didn’t pussyfoot around. Peter D. BeaulieuJune 10, 2025 at 5:43 pmWe read: “How many Albigensians do you know?” More than a few…About their core dualistic belief, in how many ways is Technocracy revered as the path to overcome the defects of evil nature? Genetic screening and inventive manipulation. The contraceptive culture also comes to mind, as does the LGBTQ crusade (a “Crusade!) against binary and complementary human sexuality.Generally, the Albigensians rejected marriage and procreation. How about wife-swapping, cohabitation, porn, and the “rite” to abortion? And, in some cases the true believers even indulged in self-annihilation, as in self-starvation at least when the end seemed in sight. Physician assisted suicide.But, hey, who cares?The Jesuit Teilhard de Chardin just blends all this stuff into the early collective stages of his neologisms: hominization, and psychic planetization (synodalization?) and the noosphere! In this ‘cloud of unknowing’ (!), who needs to know any history at all; neither Jesuit nor Dominican, since out in front there’s always the receding goal-post Omega Point!Reply We read: “How many Albigensians do you know?” More than a few… About their core dualistic belief, in how many ways is Technocracy revered as the path to overcome the defects of evil nature? Genetic screening and inventive manipulation. The contraceptive culture also comes to mind, as does the LGBTQ crusade (a “Crusade!) against binary and complementary human sexuality. Generally, the Albigensians rejected marriage and procreation. How about wife-swapping, cohabitation, porn, and the “rite” to abortion? And, in some cases the true believers even indulged in self-annihilation, as in self-starvation at least when the end seemed in sight. Physician assisted suicide. But, hey, who cares? The Jesuit Teilhard de Chardin just blends all this stuff into the early collective stages of his neologisms: hominization, and psychic planetization (synodalization?) and the noosphere! In this ‘cloud of unknowing’ (!), who needs to know any history at all; neither Jesuit nor Dominican, since out in front there’s always the receding goal-post Omega Point! We read: “How many Albigensians do you know?” More than a few… About their core dualistic belief, in how many ways is Technocracy revered as the path to overcome the defects of evil nature? Genetic screening and inventive manipulation. The contraceptive culture also comes to mind, as does the LGBTQ crusade (a “Crusade!) against binary and complementary human sexuality. Generally, the Albigensians rejected marriage and procreation. How about wife-swapping, cohabitation, porn, and the “rite” to abortion? And, in some cases the true believers even indulged in self-annihilation, as in self-starvation at least when the end seemed in sight. Physician assisted suicide. But, hey, who cares? The Jesuit Teilhard de Chardin just blends all this stuff into the early collective stages of his neologisms: hominization, and psychic planetization (synodalization?) and the noosphere! In this ‘cloud of unknowing’ (!), who needs to know any history at all; neither Jesuit nor Dominican, since out in front there’s always the receding goal-post Omega Point! **Leave a ReplyCancel reply** Your email address will not be published. All comments posted at Catholic World Report are moderated.While vigorous debate is welcome and encouraged, please note that in the interest of maintaining a civilized and helpful level of discussion, comments containing obscene language or personal attacks—or those that are deemed by the editors to be needlessly combative or inflammatory—will not be published. Thank you. Comment Name* Email* Website Δ Italian abuse survivor: Bishops’ report doesn’t show full scale of crisisCatholic News AgencyJune 11, 20250 Italian abuse survivor: Bishops’ report doesn’t show full scale of crisis Italian abuse survivor: Bishops’ report doesn’t show full scale of crisis Down in my heart to stayDavid Paul DeavelJune 11, 20251 Down in my heart to stay Down in my heart to stay Extra, extra! News and views for Wednesday, June 11, 2025CWR StaffJune 11, 20255 Extra, extra! News and views for Wednesday, June 11, 2025 Extra, extra! News and views for Wednesday, June 11, 2025 Vatican News removes Rupnik art from websiteCatholic News AgencyJune 9, 202517 Vatican News removes Rupnik art from website Vatican News removes Rupnik art from website Italian abuse survivor: Bishops’ report doesn’t show full scale of crisis Down in my heart to stay Bishop of Graz in Austria ‘stunned and shaken’ after school shooting leaves 10 dead School choice boosts Catholic school enrollment in Florida Christian youths embark on a ‘spiritual revolution’ to restore Europe’s soul Fidelity Month kickoff event in Congress promotes renewal of country’s ‘common bonds’ Pope Leo XIV appoints new Chinese bishop for Archdiocese of Fuzhou meiron:Christian (Thomist) philosopher Dennis Bonnette wrote a book on this in 2014. See also his writing at Strange Notions, a… Mr Cracked Nut:Dear Robert, the Bugnini reformers claimed to be taking the ritual back to the early practices... How backwardist can you… Fr Peter Morello PhD:Monsieur Cracked Nut, I can't fully reply to Cdl Roche [not Roach as your Freudian slip] on the preeminence of… Email address Name Facebook Twitter Email (Weekly Newsletter) RSS meiron onExtra, extra! News and views for Wednesday, June 11, 2025 Mr Cracked Nut onImagine Liturgical Peace Fr Peter Morello PhD onImagine Liturgical Peace I d onChristian youths embark on a ‘spiritual revolution’ to restore Europe’s soul mrscracker onWhere infants are baptized: A look at the numbers **Fr. Joseph Fessio, SJ, starts “anti-blog”, www.AngelicPilgrim.com** Fr. Joseph Fessio, SJ, founder and editor of Ignatius Press, has started a blog. However, he describes it as a kind of “anti-blog”, or even an “anti-Tweet” site. The blog is not about him, but[…] Home About / Contact Free Newsletter Advertising Sitemap Privacy Policy © Catholic World Report You can see how this popup was set up in our step-by-step guide: https://wppopupmaker.com/guides/auto-opening-announcement-popups/ Sign up to receive a weekly email with news, analysis, and commentary from a voice you can trust! Email Frequency"}