{"id": 834, "name": "Leicester Mercury", "domain": "leicestermercury.co.uk", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.leicestermercury.co.uk/sport/football/transfer-news/celtic-receive-jamie-vardy-transfer-10255419#comments-wrapper", "title": "Celtic Receive Jamie Vardy Transfer 10255419#comments Wrapper", "content": "NewsLatest NewsCounty NewsLeicester NewsHinckley NewsLoughborough NewsTraffic & TravelCrimeEducationHealthPoliticsBusinessJobsHistoryCelebs & TVPropertyMotoringUK & World NewsNews By AreaExpand Latest News County News Leicester News Hinckley News Loughborough News Traffic & Travel Crime Education Health Politics Business Jobs History Celebs & TV Property Motoring UK & World News News By Area Latest News County News Leicester News Hinckley News Loughborough News Traffic & Travel Crime Education Health Politics Business Jobs History Celebs & TV Property Motoring UK & World News News By Area In Your Area What's OnLatest What's OnFood & DrinkFamily & KidsMusic & NightlifeShoppingStay InExpand Latest What's On Food & Drink Family & Kids Music & Nightlife Shopping Stay In Latest What's On Food & Drink Family & Kids Music & Nightlife Shopping Stay In Leicester City FC Tigers Business SportFootballRugbyLeicester RidersOther SportSport OpinionExpand Football Rugby Leicester Riders Other Sport Sport Opinion Football Rugby Leicester Riders Other Sport Sport Opinion Partner Stories Follow us Buy a Paper Funeral Notices Jobs Book an ad Buy a photo Advertise with us Property Marketplace Directory Public Notices Dating Newsletter Signup InYourArea mynewsassistant Mirror Bingo Beauty Box Subscription Yimbly Shop Buy a photo Contact Us About Us Marketplace Public Notices Work for us Advertise with Us Subscriptions Competition Rules How to Complain Corrections and Clarifications Terms and Conditions Privacy Notice AI Notice Cookie Notice RSS feeds Newsletters Signup Syndication & Licensing Notifications and Alerts help © 2025 Local World frontpage Sport Football Jamie Vardy **Celtic receive Jamie Vardy transfer thumbs up as Rangers dismissed** **The future of Jamie Vardy is in the spotlight during the summer transfer window as he prepares to leave Leicester City** Bookmark Share Comments 10:12, 11 JUN 2025 Updated10:25, 11 JUN 2025 Bookmark Our community members are treated to special offers, promotions and adverts from us and our partners. You can check out at any time.More info Celtic have been urged to sign “natural predator” Jamie Vardy from under the nose of Rangers. Vardywill leaveLeicester Citywhen his contract at the King Power Stadium expires this summer, having signed off in style with his 200th goal in his 500th appearance. It has been claimed the striker wants to stay in the Premier League, whileGary Lineker says he can see Vardy moving to America to play in the MLS. While he considers his next move, Celtic legend Frank McAvennie has encouraged his former club to swoop for the 38-year-old and reunite him with ex-Leicester boss Brendan Rodgersamid links with a move to their Old Firm rivals Rangers. “Vardy. I would take Vardy,”said McAvennie. “I know they are talking about him going to Rangers, but I would take Vardy at Celtic. “They (Danny Ings and Vardy) are goal scorers. Two of them are goal scorers. They are just natural predators. Get them up here. Good names. “The two of them know where the back of the net is. People keep saying, ‘you don’t look up’. You don’t have to look up. Goals don’t move. It’s the only thing on the pitch that doesn’t move.” It comes after Rangers legend Ally McCoist previously said he would love to see Vardy at Ibrox. “I would take him in two minutes at Rangers. I really, really would,” he said. \"I'd take him in two minutes.\" **Where do you think Vardy will be playing next season?Tell us HERE** **Get your special Jamie Vardy edition of the Leicester Mercury** It was certainly a fairytale ending to Jamie Vardy's Leicester City career - netting his 200th goal in his final match for the club. To celebrate, we are launching athis special edition of the Leicester Mercurywhere we look back at the striker's amazing career - his journey from non-league to England international, his greatest goals and where he stands in the Foxes' list of all-time greats. We also revisit the trophy-winning campaigns - the 2021 FA Cup and, of course, the 2016 Premier League title. And there are plenty of tributes from those who played with him, against him and worked with him. Jamie Vardy, it's certainly been a party! **GET YOUR COPY HERE** Buy nowand have it delivered directly to your door. Alternatively you can purchase in participating supermarkets, high street retailers and independent newsagents from June 4 2025. Pre-orders will be dispatched from June 4. Please allow 5 working days for delivery. This is a newsprint product and may be folded for dispatch. World wide shipping available Brendan Rodgers Jamie Vardy King Power Stadium Leicester City FC Sport all Most Read Most Recent Most Read Most Recent News Sport What's On Follow us InYourArea mynewsassistant Mirror Bingo Beauty Box Subscription Yimbly Shop Buy a photo Contact Us About Us Marketplace Public Notices Work for us Advertise with Us Subscriptions Competition Rules How to Complain Corrections and Clarifications Terms and Conditions Privacy Notice AI Notice Cookie Notice RSS feeds Newsletters Signup Syndication & Licensing Notifications and Alerts help © 2025 Local World"}