{"id": 251, "name": "Climate Feedback", "domain": "climatefeedback.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://climatefeedback.org/claimreview/wildfires-in-la-influenced-by-santa-ana-winds-and-dry-vegetation-climate-change-a-likely-factor-contrary-to-viral-misinformation/", "title": "Wildfires In La Influenced By Santa Ana Winds And Dry Vegetation Climate Change A Likely Factor Contrary To Viral Misinformation", "content": "Article Reviews Claim Reviews Insights Support us **.** We've Moved **Wildfires in LA influenced by Santa Ana winds and dry vegetation; climate change a likely factor, contrary to viral misinformation** SOURCE:Social media users,Facebook, 12 Jan. 2025 **REVIEW** Source:AP Photo/Ethan SwopeKey takeaways:Wildfires occur when several unfortunate conditions align; they cannot be blamed on one factor alone, contrary to recent misinformation (which keeps spreading in crisis situations)Climate change can increase the risk and severity of wildfires by worsening the conditions that lead and sustain them (e.g., arid/dry conditions)Two prior years of high precipitation increased vegetation, which was later dried out by high temperatures and low precipitation, increasing the fuel available for wildfiresEarly analyses by climate researchers suggest that both climate change and natural weather variability worsened the fires by increasing dry vegetation (which serves as fuel)Climate scientists explain that more research is needed to better understand how climate change impacted these firesHot dry winds (called Santa Ana winds) reached exceptionally high speeds at the start of the wildfires and were likely the “final ingredient” stacked on several other conditions conducive to wildfiresOn the morning of 7 January 2025, a wildfire was reported in the Los Angeles (LA) region which, in just over a week, has burned over 40,600 acres (~16,400 hectares) of land (Figures 1 and 2).The fires quickly made international news and many people took to social media to share helpful information and aid however possible. However, in the midst of this wildfire burning through large swaths of LA and engulfing people’s homes in flames, some decided to use this tragedy as an opportunity to spread misinformation and conspiracies – a dark reflection of what followed several other disasters in 2024 (as shown in our previous reviews tied toHurricanes HeleneandMilton).Some haveclaimedthat budget cuts and mismanagement of resources were to blame, while othersclaimed– without providing evidence – that the fires were caused by arson and that climate change had no influence. Some evenshared vague conspiraciesabout the fires being tied to insurance companies and policy cancellations. During these events, it’s easy to get lost in a sea of information – particularly in recent times where misinformation is rampant.In this article we will explore the conditions that lead to the recent LA fires, investigate what role climate change plays in wildfires, and unravel recent claims on social media.Figure 1 –Locations and size of the LA fires as of 14 January 2025. Source:BBCwith data fromCal FireFigure 2 –Size of largest part of the largest LA fire (the Palisades fire) – on the outskirts of LA – as of 14 January 2025, relative to New York and London for a size comparison. Source:BBCwith data fromCal FireWildfires spread when several unfortunate conditions align – they can’t be blamed on one single factorWhen wildfires spread, people are quick to assign blame. The blame can shift between policies, forestry management, climate change, or even specific people. In the recent LA fires, we’ve seen all of the above and more. But pointing fingers in this way misses a crucial fact: wildfires don’t spread because of one factor. That’s not to say that fires aren’ttriggeredby a single event or accident. In the case of the LA wildfires, their ignition source is stillunder investigationat the time of this writing. But despite what starts a given wildfire, a series of conditions need to align for that fire to spread.Let’s quickly look at the basics of wildfires, which we covered in apast review. Fundamentally, firesrequire three things: heat, oxygen, and fuel. Remove any one of these three, and fires will extinguish. For example, if you blow on fire and introduce more oxygen, the fire will strengthen, but if you cover a fire and reduce the oxygen, it will extinguish.However, even with fuel, oxygen, and a source of ignition, that doesn’t mean an uncontrolled wildfire will necessarily spread. This is because several other conditions need to be met for wildfires to spread once they start: ignition, continuous fuel, drought, and appropriate weather[1].As shown in Figure 3 below, factors driving wildfires include things like wind direction and speed; fuel characteristics (e.g., vegetation can be dry, wet, continuous, sparse, etc.); topography (slope and elevation of surrounding landscapes) and more.Figure 3– Wildfires are driven by many complex factors which interact to shape the occurrence, behaviour, duration, spread, and overall impact of the fire. According to Pausas and Keeley (2021)[1], there are four main transversal factors: ignitions, fuels, droughts, and weather conditions. Source:GRID-Arendal.For example, if there is lots of fuel (like dry vegetation) but it is too spread out and there is no wind, the fire is far more likely to stay put and burn only until it uses up the local fuel source. Governments use this knowledge to reduce the spread of future potential wildfires by performingfuel management– specific practices like brush removal, forest thinning, and prescribed burns which make fuel less available to feed wildfires.However, it is important to remember that wildfires are a natural occurrence that would still happen without humans. So it is nearly impossible to prevent all wildfires from occurring, despite our best policies and hazard-reduction efforts. That being said, humans have undoubtedly influenced the behavior of wildfires[2]. Some human activities have worsened wildfires, while others – such as fuels management – have helped. As explained in a peer-reviewed paper published in 2020 in Nature Reviews Earth & Environment:“Anthropogenic influences on fire activity have become more pronounced since the late eighteenth century, reflecting the effects of industrialization and climate change, land clearance, human population growth, replacement of indigenous and traditional fire management, and the subsequent development of large-scale firefighting and fuels management in the twentieth century.”[3]In recent decades, wildfire activity in California has been on the rise. In a 2019 peer-reviewed paper published inEarth’s Future, the authors explain:“Human-caused warming has already significantly enhanced wildfire activity in California, particularly in the forests of the Sierra Nevada and North Coast, and will likely continue to do so in the coming decades.”[4]In fact, from 1972 to 2018, California’s annual wildfire burn area has increased fivefold[4].In the next section, we will dive into the details of the most recent LA fires and why climate scientists believe several conditions – including climate change and natural weather variation – worsened these wildfires.It’s not an ‘either or’ situation: the wildfires were likely worsened both by climate change and natural variability in weather conditionsWith the recent wildfires beingthe worston record in the LA region, many people are asking, “Why now?” – a simple question with a complex answer.Despite this, some are still trying to latch onto a single cause. This is a natural response to tragedies and disasters – to assign blame and seek ‘justice’ for such events or, perhaps, to understand why these events weren’t preventable. But for wildfires, the answer isn’t often clear-cut. Given the complexity of wildfires, a more informed question would be: what are the key factors that lead to the wildfires and what role did they play? Luckily, experts are already on the case.With climate change being a hot topic surrounding this wildfire, six climate scientists at the University of California Los Angeles (UCLA) began analyzing what role climate change might have played in worsening the fire. In anarticleposted on 13 January 2025, these researchers summarized the current state of understanding* about this wildfire :“It will require extensive research to fully understand the relative importance of the various factors underlying the fires, and how the factors interacted, but there is broad consensus as to what those factors might be: there was a buildup of fuels—i.e. vegetation—from 2022–2024, followed by a very warm summer in 2024. Then the winter rains that normally arrive in November and December largely failed to materialize. On top of all that, we saw a nearly unprecedented Santa Ana wind event that was critical for the rapid spread of wildfires beginning on January 7, 2025.”Note:*This article (archived here) has not yet been peer-reviewed (at the time of this writing), as this is typically a months-long process. The information is therefore subject to updates as new evidence is found.The build up of fuels is somewhat self-explanatory – the more fuel available for a fire, the longer it can potentially burn. But why did this buildup occur? As the researchers explain, there were two wet years in a row. Your intuition may tell you that this should have prevented the fires, but unfortunately – once again – it’s not so simple.The two years of high precipitation increased the vegetation cover, and thus the fuel available to burn once it dried. Asexplainedin a July 2024Fuels and Fire Behavior Advisory, “The above normal grass and herbaceous load creates a continuous fuel bed, allowing for rapid spread of fires when these fuels are cured.”In this context, curing refers to the transition from moist living vegetation to dry dead materials, which increases their flammability. After two prior years of high precipitation that created high fuel build up, the LA regionexperiencedanomalously high temperatures and low precipitation that cured these fuels, increasing the wildfire potential.As explained by the UCLA researchers, “The clearest way in which climate change may have intensified the January 2025 wildfires is the anomalously warm summer and fall of 2024 (3rd hottest since 1895), and its drawdown effect on fuel moisture.” However, they also explain that the recent low wet-season precipitation also had a part to play and is more likely attributed to natural variability than human-driven climate change.Between these two contributing factors, the researchers’analyses suggestthat the anomalous heat – likely intensified by climate change – accounted for roughly 25% of the fuel-moisture deficit, while the other 75% was tied to the low precipitation.Although more research is needed to better understand how climate change contributed to these fires, early analyses suggest that climate change did, in fact, play a role but was not the sole driving factor. The researchers expect that the wildfires would have occurred without human-driven climate change, but likely would have been smaller and less intense.This finding is important because it demonstrates that multiple factors – likely including climate change –contributedto these wildfires, rather than caused them. In contrast, recent social media posts claimed that the fires were either ‘caused’ by climate change or were not, but this is not how scientists actually measure the influence of climate change on wildfires.For example, in a 2023 Nature paper about the influence of anthropogenic climate on daily wildfire growth risk in California, researchers explain:“Some portion of the change in wildfire behaviour is attributable to anthropogenic climate warming, but formally quantifying this contribution is difficult because of numerous confounding factors[3,5]and because wildfires are below the grid scale of global climate models.”[2]The researchers also explain that “[s]o far, anthropogenic warming has enhanced the aggregate expected frequency of extreme daily wildfire growth by 25% […] on average, relative to preindustrial conditions”[2]. However, when estimating the impacts of global warming on past fires, they found large variations between different fires; they explain that “for some fires, there was approximately no change, and for other fires, the enhancement has been as much as 461%”[2]This was mostly dependent on whether or not climate warming pushed conditions past certain thresholds of aridity (i.e., dryness) – a factor that played a large role in the recent LA fires, as explained by UCLA researchers.So how does this all tie together to create a massive wildfire? The UCLA researchers explain:“Given the extreme aridity and fuel abundance in the wildlands around Los Angeles, the hurricane-force Santa Ana winds that arrived on January 7 were the final ingredient in a perfect recipe for major wildfire development.”Santa Ana winds– named after Southern California’s Santa Ana Canyon – are dry hot winds that blow from the desert towards the coast of California. These winds become hot and dry due to the compression and humidity-drop effect they experience as they move downslope from the deserts to the California coast. Along the way, these winds also pick up speed as they are channeled through the canyons and passes. While these winds typically dry out vegetation and increase fire risk[6], the UCLA researchers explain that the recent Santa Ana winds were particularly extreme.To compare the recent Santa Ana wind speeds to those of the past, the UCLA researchers plotted it along with airport wind speed data from 2001 to 2025. As Figure 4 shows, the wind speeds on 7 and 8 January 2025 were unusually high compared to those recorded over the last couple of decades.Figure 4 –Maximum hourly-average wind speeds (on days with Santa Ana winds) recorded at three airports (from top to bottom: Santa Monica Airport, Van Nuys Airport, and Los Angeles Airport) from 2001 to 2025. Two lines – January 7 (red) and January 8 (pink) are added to compare the Santa Ana winds occurring near the start of the wildfires to those over this observational period. Source:UCLA(data source:NOAA)So what’s the takeaway from this? Although claims have suggested that there was a single cause of the wildfire, the truth is that wildfires spread when several conditions align. Trying to blame one single factor not only misrepresents the science of how wildfires start and spread, but also shifts society away from productive and accurate conversations about wildfires that could help prevent them in the future. In other words, a society which is misinformed about wildfires is more prone to taking actions – or inaction – that increases the risk of future wildfires.Rather than having ‘either or’ types of discussions where we seek to understand only one aspect of the fires or blame a single cause, a more comprehensive understanding is critical for our future understanding of wildfires. This point is summarized well in a2019 research articlepublished in Earth Futures:“A nuanced understanding of how, when, where, and why California wildfire activity has increased in recent decades is critical for sustainable environmental and development decisions that specifically take into account how anthropogenic climate change is likely to proceed and affect wildfire across California’s diverse landscapes.”[4]While the information above offers more context behind the role of natural conditions and climate change on the recent LA fires, there are of course other human influences as well (see Figure 3 above). Although covering every factor is outside the scope of this article, we will offer brief context on other factors below by reviewing related misinformation.Examples of misleading claim surrounding the January 2025 LA wildfires:Claim 1 (Unsupported):‘The LA fires were an intentional act to clear buildings and rebuild LA into a smart city called SmartLA 2028’(as seen here)Details:The SmartLA 2028 initiative exists but does not involve burning down the city to replace homes with smart infrastructure. Instead, the initiative is apublicly available planthat has been underway since 2020 with projects that focus on upgrading and optimizing the existing infrastructure – not tearing or burning it down. In this plan, they explain that the project’s vision is to reduce the city’s reliance on old technology by, for example, increasing the availability of updated transit options (like on-demand shuttles) to transition away from being the “car capital of the world”. Claims that the wildfires were an intentional act to make progress in these plans are unsubstantiated and based on conspiracies that are not supported with reputable evidence.Claim 2 (Misleading):‘The fires were caused by arson, not climate change’(as seenhere)Details:This claim is misleading because it conflates climate change – a factor that studies have shown influences wildfires in California[2]– to triggering events like arson. Climate change is not a source of ignition like arson, but rather a long term change in conditions that can worsen wildfires[2]. For the recent LA wildfires, the source of ignition is stillunder investigationat the time of this writing. Although events like arson can start fires, wildfires only spread when numerous conditions align.For a wildfire to spread, four main conditions are required: ignition, continuous fuel, drought, and appropriate weather conditions[1]. Another variation of this claim is that climate change played no role at all in the fires. Early analyses of conditions leading to the wildfires suggest this claim is inaccurate; climate researchers at UCLA suggest that anthropogenic climate change likely worsened the fires through increasing dry vegetation/fuel availability.Claim 3 (Inaccurate):‘Fires were burning the hollywood sign’(as seenhere)Details:Several videos and photos have circulated on social media showing alleged fires burning right next to the Hollywood sign, but there is no evidence that this actually occurred. Several lines of evidence show the Hollywood sign is intact and not burned. As of 21 January 2024, the Hollywood Sign Trust – a non-profit responsible for maintaining, repairing, and protecting the Hollywood sign – has announced on their website (archived here) that the Hollywood sign is safe from the fires (Figure 5). Their live 24/7 webcam (linked here) of the Hollywood sign is available to view at the time of this writing and clearly show the Hollywood sign is intact, and both the sign and vegetation surrounding it are unburned.Science Feedback used an AI-generated content detection tool called Hive Moderation to assess one of the videos allegedly showing the Hollywood sign burning. The results indicated that the video is 97.8% likely to contain AI-generated or deepfake content (see Figure 6). An article posted on 10 January 2025 by AFP Fact Check (linked here) found similar evidence of AI-generated and manipulated photos and videos of the Hollywood sign burning. Another video – which received over 500,000 likes – showed footage of what appeared to be downtown Los Angeles burning with teams of helicopters hovering above (archived here). The Hive Moderation tool indicates that the video was 99.9% likely to contain AI-generated or deepfake content (Figure 7).Figure 5 –Announcement from the Hollywood Sign Trust that the Hollywood sign is safe from the fires. Source:Hollywood TrustFigure 6 –AI-generated content detection results captured on 21 January 2025 for a video allegedly showing the Hollywood sign burning. The results suggest that the video is 97.8% likely to contain AI-generated or deepfake content. Source:Hive ModerationFigure 7 –AI-generated content detection results captured on 21 January 2025 for a video allegedly showing the Hollywood sign burning. The results suggest that the video is 97.8% likely to contain AI-generated or deepfake content. Source:Hive ModerationClaim 4 (Misleading):‘Governor Gavin Newsom cut fire budgets by 100 million prior to the January 2025 LA wildfires’(linked here)Details:Numerous claims blaming Gavin Newsom for the recent wildfires rapidly went viral on social media. One of the main claims was that he cut fire budgets by 100 million prior to the fires. This suggests that Newsom lowered the budget, which is inaccurate; the multi-billion dollar California wildfire budget has increased under Newsom (Figure 8). While a one-time budget adjustment of 144 million dollars was made for the fire budget for the 2024-2025 fiscal year, the budget has still gone up year after year (Figure 8).According to the Legislative Analyst’s Office– a non-partisan fiscal and policy advisor – California retained 93% – or 2.6 billion dollars – of the planned multi-year wildfire budget even after making one-time adjustments to address state’s deficits. Cherry picking this one-time budget adjustment when numerous budget cuts were made to several departments (see link here) and presenting it as a targeted action by Newsom against protecting wildfires is misleading.Figure 8 –Total Cal FIRE expenditures by fiscal year from 2019 to 2025, including those from emergency spending. Note that the expenditures used to the January 2025 wildfires are still underway and not included in this figure. Source:Factcheck.orgwith data from theCalifornia Legislative Analyst’s OfficeReferences:1 – Pausas and Keeley (2021).Wildfires and global change. Frontiers in Ecology and the Environment.2 – Brown et al. (2023)Climate warming increases extreme daily wildfire growth risk in California. Nature.3 – Bowman et al. (2020)Vegetation fires in the Anthropocene. Nature Reviews Earth & Environment.4 – Williams et al. (2019)Observed Impacts of Anthropogenic Climate Change on Wildfire in California. Earth’s future.5 – Starrs et al. (2018)The impact of land ownership, firefighting, and reserve status on fire probability in California. Environmental Research Letters.6 – Keeley et al. (2024)Climate and weather drivers in southern California Santa Ana Wind and non-Santa Wind fires. International Journal of Wildland Fire. Source:AP Photo/Ethan Swope Wildfires occur when several unfortunate conditions align; they cannot be blamed on one factor alone, contrary to recent misinformation (which keeps spreading in crisis situations) Climate change can increase the risk and severity of wildfires by worsening the conditions that lead and sustain them (e.g., arid/dry conditions) Two prior years of high precipitation increased vegetation, which was later dried out by high temperatures and low precipitation, increasing the fuel available for wildfires Early analyses by climate researchers suggest that both climate change and natural weather variability worsened the fires by increasing dry vegetation (which serves as fuel) Climate scientists explain that more research is needed to better understand how climate change impacted these fires Hot dry winds (called Santa Ana winds) reached exceptionally high speeds at the start of the wildfires and were likely the “final ingredient” stacked on several other conditions conducive to wildfires On the morning of 7 January 2025, a wildfire was reported in the Los Angeles (LA) region which, in just over a week, has burned over 40,600 acres (~16,400 hectares) of land (Figures 1 and 2). The fires quickly made international news and many people took to social media to share helpful information and aid however possible. However, in the midst of this wildfire burning through large swaths of LA and engulfing people’s homes in flames, some decided to use this tragedy as an opportunity to spread misinformation and conspiracies – a dark reflection of what followed several other disasters in 2024 (as shown in our previous reviews tied toHurricanes HeleneandMilton). Some haveclaimedthat budget cuts and mismanagement of resources were to blame, while othersclaimed– without providing evidence – that the fires were caused by arson and that climate change had no influence. Some evenshared vague conspiraciesabout the fires being tied to insurance companies and policy cancellations. During these events, it’s easy to get lost in a sea of information – particularly in recent times where misinformation is rampant. In this article we will explore the conditions that lead to the recent LA fires, investigate what role climate change plays in wildfires, and unravel recent claims on social media. Figure 1 –Locations and size of the LA fires as of 14 January 2025. Source:BBCwith data fromCal Fire Figure 2 –Size of largest part of the largest LA fire (the Palisades fire) – on the outskirts of LA – as of 14 January 2025, relative to New York and London for a size comparison. Source:BBCwith data fromCal Fire When wildfires spread, people are quick to assign blame. The blame can shift between policies, forestry management, climate change, or even specific people. In the recent LA fires, we’ve seen all of the above and more. But pointing fingers in this way misses a crucial fact: wildfires don’t spread because of one factor. That’s not to say that fires aren’ttriggeredby a single event or accident. In the case of the LA wildfires, their ignition source is stillunder investigationat the time of this writing. But despite what starts a given wildfire, a series of conditions need to align for that fire to spread. Let’s quickly look at the basics of wildfires, which we covered in apast review. Fundamentally, firesrequire three things: heat, oxygen, and fuel. Remove any one of these three, and fires will extinguish. For example, if you blow on fire and introduce more oxygen, the fire will strengthen, but if you cover a fire and reduce the oxygen, it will extinguish. However, even with fuel, oxygen, and a source of ignition, that doesn’t mean an uncontrolled wildfire will necessarily spread. This is because several other conditions need to be met for wildfires to spread once they start: ignition, continuous fuel, drought, and appropriate weather[1]. As shown in Figure 3 below, factors driving wildfires include things like wind direction and speed; fuel characteristics (e.g., vegetation can be dry, wet, continuous, sparse, etc.); topography (slope and elevation of surrounding landscapes) and more. Figure 3– Wildfires are driven by many complex factors which interact to shape the occurrence, behaviour, duration, spread, and overall impact of the fire. According to Pausas and Keeley (2021)[1], there are four main transversal factors: ignitions, fuels, droughts, and weather conditions. Source:GRID-Arendal. For example, if there is lots of fuel (like dry vegetation) but it is too spread out and there is no wind, the fire is far more likely to stay put and burn only until it uses up the local fuel source. Governments use this knowledge to reduce the spread of future potential wildfires by performingfuel management– specific practices like brush removal, forest thinning, and prescribed burns which make fuel less available to feed wildfires. However, it is important to remember that wildfires are a natural occurrence that would still happen without humans. So it is nearly impossible to prevent all wildfires from occurring, despite our best policies and hazard-reduction efforts. That being said, humans have undoubtedly influenced the behavior of wildfires[2]. Some human activities have worsened wildfires, while others – such as fuels management – have helped. As explained in a peer-reviewed paper published in 2020 in Nature Reviews Earth & Environment: “Anthropogenic influences on fire activity have become more pronounced since the late eighteenth century, reflecting the effects of industrialization and climate change, land clearance, human population growth, replacement of indigenous and traditional fire management, and the subsequent development of large-scale firefighting and fuels management in the twentieth century.”[3] In recent decades, wildfire activity in California has been on the rise. In a 2019 peer-reviewed paper published inEarth’s Future, the authors explain: “Human-caused warming has already significantly enhanced wildfire activity in California, particularly in the forests of the Sierra Nevada and North Coast, and will likely continue to do so in the coming decades.”[4] In fact, from 1972 to 2018, California’s annual wildfire burn area has increased fivefold[4]. In the next section, we will dive into the details of the most recent LA fires and why climate scientists believe several conditions – including climate change and natural weather variation – worsened these wildfires. With the recent wildfires beingthe worston record in the LA region, many people are asking, “Why now?” – a simple question with a complex answer. Despite this, some are still trying to latch onto a single cause. This is a natural response to tragedies and disasters – to assign blame and seek ‘justice’ for such events or, perhaps, to understand why these events weren’t preventable. But for wildfires, the answer isn’t often clear-cut. Given the complexity of wildfires, a more informed question would be: what are the key factors that lead to the wildfires and what role did they play? Luckily, experts are already on the case. With climate change being a hot topic surrounding this wildfire, six climate scientists at the University of California Los Angeles (UCLA) began analyzing what role climate change might have played in worsening the fire. In anarticleposted on 13 January 2025, these researchers summarized the current state of understanding* about this wildfire : “It will require extensive research to fully understand the relative importance of the various factors underlying the fires, and how the factors interacted, but there is broad consensus as to what those factors might be: there was a buildup of fuels—i.e. vegetation—from 2022–2024, followed by a very warm summer in 2024. Then the winter rains that normally arrive in November and December largely failed to materialize. On top of all that, we saw a nearly unprecedented Santa Ana wind event that was critical for the rapid spread of wildfires beginning on January 7, 2025.” The build up of fuels is somewhat self-explanatory – the more fuel available for a fire, the longer it can potentially burn. But why did this buildup occur? As the researchers explain, there were two wet years in a row. Your intuition may tell you that this should have prevented the fires, but unfortunately – once again – it’s not so simple. The two years of high precipitation increased the vegetation cover, and thus the fuel available to burn once it dried. Asexplainedin a July 2024Fuels and Fire Behavior Advisory, “The above normal grass and herbaceous load creates a continuous fuel bed, allowing for rapid spread of fires when these fuels are cured.” In this context, curing refers to the transition from moist living vegetation to dry dead materials, which increases their flammability. After two prior years of high precipitation that created high fuel build up, the LA regionexperiencedanomalously high temperatures and low precipitation that cured these fuels, increasing the wildfire potential. As explained by the UCLA researchers, “The clearest way in which climate change may have intensified the January 2025 wildfires is the anomalously warm summer and fall of 2024 (3rd hottest since 1895), and its drawdown effect on fuel moisture.” However, they also explain that the recent low wet-season precipitation also had a part to play and is more likely attributed to natural variability than human-driven climate change. Between these two contributing factors, the researchers’analyses suggestthat the anomalous heat – likely intensified by climate change – accounted for roughly 25% of the fuel-moisture deficit, while the other 75% was tied to the low precipitation. Although more research is needed to better understand how climate change contributed to these fires, early analyses suggest that climate change did, in fact, play a role but was not the sole driving factor. The researchers expect that the wildfires would have occurred without human-driven climate change, but likely would have been smaller and less intense. This finding is important because it demonstrates that multiple factors – likely including climate change –contributedto these wildfires, rather than caused them. In contrast, recent social media posts claimed that the fires were either ‘caused’ by climate change or were not, but this is not how scientists actually measure the influence of climate change on wildfires. For example, in a 2023 Nature paper about the influence of anthropogenic climate on daily wildfire growth risk in California, researchers explain: “Some portion of the change in wildfire behaviour is attributable to anthropogenic climate warming, but formally quantifying this contribution is difficult because of numerous confounding factors[3,5]and because wildfires are below the grid scale of global climate models.”[2] The researchers also explain that “[s]o far, anthropogenic warming has enhanced the aggregate expected frequency of extreme daily wildfire growth by 25% […] on average, relative to preindustrial conditions”[2]. However, when estimating the impacts of global warming on past fires, they found large variations between different fires; they explain that “for some fires, there was approximately no change, and for other fires, the enhancement has been as much as 461%”[2]This was mostly dependent on whether or not climate warming pushed conditions past certain thresholds of aridity (i.e., dryness) – a factor that played a large role in the recent LA fires, as explained by UCLA researchers. So how does this all tie together to create a massive wildfire? The UCLA researchers explain: “Given the extreme aridity and fuel abundance in the wildlands around Los Angeles, the hurricane-force Santa Ana winds that arrived on January 7 were the final ingredient in a perfect recipe for major wildfire development.” Santa Ana winds– named after Southern California’s Santa Ana Canyon – are dry hot winds that blow from the desert towards the coast of California. These winds become hot and dry due to the compression and humidity-drop effect they experience as they move downslope from the deserts to the California coast. Along the way, these winds also pick up speed as they are channeled through the canyons and passes. While these winds typically dry out vegetation and increase fire risk[6], the UCLA researchers explain that the recent Santa Ana winds were particularly extreme. To compare the recent Santa Ana wind speeds to those of the past, the UCLA researchers plotted it along with airport wind speed data from 2001 to 2025. As Figure 4 shows, the wind speeds on 7 and 8 January 2025 were unusually high compared to those recorded over the last couple of decades. Figure 4 –Maximum hourly-average wind speeds (on days with Santa Ana winds) recorded at three airports (from top to bottom: Santa Monica Airport, Van Nuys Airport, and Los Angeles Airport) from 2001 to 2025. Two lines – January 7 (red) and January 8 (pink) are added to compare the Santa Ana winds occurring near the start of the wildfires to those over this observational period. Source:UCLA(data source:NOAA) So what’s the takeaway from this? Although claims have suggested that there was a single cause of the wildfire, the truth is that wildfires spread when several conditions align. Trying to blame one single factor not only misrepresents the science of how wildfires start and spread, but also shifts society away from productive and accurate conversations about wildfires that could help prevent them in the future. In other words, a society which is misinformed about wildfires is more prone to taking actions – or inaction – that increases the risk of future wildfires. Rather than having ‘either or’ types of discussions where we seek to understand only one aspect of the fires or blame a single cause, a more comprehensive understanding is critical for our future understanding of wildfires. This point is summarized well in a2019 research articlepublished in Earth Futures: “A nuanced understanding of how, when, where, and why California wildfire activity has increased in recent decades is critical for sustainable environmental and development decisions that specifically take into account how anthropogenic climate change is likely to proceed and affect wildfire across California’s diverse landscapes.”[4] While the information above offers more context behind the role of natural conditions and climate change on the recent LA fires, there are of course other human influences as well (see Figure 3 above). Although covering every factor is outside the scope of this article, we will offer brief context on other factors below by reviewing related misinformation. Claim 1 (Unsupported): ‘The LA fires were an intentional act to clear buildings and rebuild LA into a smart city called SmartLA 2028’(as seen here) Details: The SmartLA 2028 initiative exists but does not involve burning down the city to replace homes with smart infrastructure. Instead, the initiative is apublicly available planthat has been underway since 2020 with projects that focus on upgrading and optimizing the existing infrastructure – not tearing or burning it down. In this plan, they explain that the project’s vision is to reduce the city’s reliance on old technology by, for example, increasing the availability of updated transit options (like on-demand shuttles) to transition away from being the “car capital of the world”. Claims that the wildfires were an intentional act to make progress in these plans are unsubstantiated and based on conspiracies that are not supported with reputable evidence. Claim 2 (Misleading): ‘The fires were caused by arson, not climate change’(as seenhere) Details: This claim is misleading because it conflates climate change – a factor that studies have shown influences wildfires in California[2]– to triggering events like arson. Climate change is not a source of ignition like arson, but rather a long term change in conditions that can worsen wildfires[2]. For the recent LA wildfires, the source of ignition is stillunder investigationat the time of this writing. Although events like arson can start fires, wildfires only spread when numerous conditions align. For a wildfire to spread, four main conditions are required: ignition, continuous fuel, drought, and appropriate weather conditions[1]. Another variation of this claim is that climate change played no role at all in the fires. Early analyses of conditions leading to the wildfires suggest this claim is inaccurate; climate researchers at UCLA suggest that anthropogenic climate change likely worsened the fires through increasing dry vegetation/fuel availability. Claim 3 (Inaccurate): ‘Fires were burning the hollywood sign’(as seenhere) Details: Several videos and photos have circulated on social media showing alleged fires burning right next to the Hollywood sign, but there is no evidence that this actually occurred. Several lines of evidence show the Hollywood sign is intact and not burned. As of 21 January 2024, the Hollywood Sign Trust – a non-profit responsible for maintaining, repairing, and protecting the Hollywood sign – has announced on their website (archived here) that the Hollywood sign is safe from the fires (Figure 5). Their live 24/7 webcam (linked here) of the Hollywood sign is available to view at the time of this writing and clearly show the Hollywood sign is intact, and both the sign and vegetation surrounding it are unburned. Science Feedback used an AI-generated content detection tool called Hive Moderation to assess one of the videos allegedly showing the Hollywood sign burning. The results indicated that the video is 97.8% likely to contain AI-generated or deepfake content (see Figure 6). An article posted on 10 January 2025 by AFP Fact Check (linked here) found similar evidence of AI-generated and manipulated photos and videos of the Hollywood sign burning. Another video – which received over 500,000 likes – showed footage of what appeared to be downtown Los Angeles burning with teams of helicopters hovering above (archived here). The Hive Moderation tool indicates that the video was 99.9% likely to contain AI-generated or deepfake content (Figure 7). Figure 5 –Announcement from the Hollywood Sign Trust that the Hollywood sign is safe from the fires. Source:Hollywood Trust Figure 6 –AI-generated content detection results captured on 21 January 2025 for a video allegedly showing the Hollywood sign burning. The results suggest that the video is 97.8% likely to contain AI-generated or deepfake content. Source:Hive Moderation Figure 7 –AI-generated content detection results captured on 21 January 2025 for a video allegedly showing the Hollywood sign burning. The results suggest that the video is 97.8% likely to contain AI-generated or deepfake content. Source:Hive Moderation Claim 4 (Misleading): ‘Governor Gavin Newsom cut fire budgets by 100 million prior to the January 2025 LA wildfires’(linked here) Details: Numerous claims blaming Gavin Newsom for the recent wildfires rapidly went viral on social media. One of the main claims was that he cut fire budgets by 100 million prior to the fires. This suggests that Newsom lowered the budget, which is inaccurate; the multi-billion dollar California wildfire budget has increased under Newsom (Figure 8). While a one-time budget adjustment of 144 million dollars was made for the fire budget for the 2024-2025 fiscal year, the budget has still gone up year after year (Figure 8).According to the Legislative Analyst’s Office– a non-partisan fiscal and policy advisor – California retained 93% – or 2.6 billion dollars – of the planned multi-year wildfire budget even after making one-time adjustments to address state’s deficits. Cherry picking this one-time budget adjustment when numerous budget cuts were made to several departments (see link here) and presenting it as a targeted action by Newsom against protecting wildfires is misleading. Figure 8 –Total Cal FIRE expenditures by fiscal year from 2019 to 2025, including those from emergency spending. Note that the expenditures used to the January 2025 wildfires are still underway and not included in this figure. Source:Factcheck.orgwith data from theCalifornia Legislative Analyst’s Office 1 – Pausas and Keeley (2021).Wildfires and global change. Frontiers in Ecology and the Environment. 2 – Brown et al. (2023)Climate warming increases extreme daily wildfire growth risk in California. Nature. 3 – Bowman et al. (2020)Vegetation fires in the Anthropocene. Nature Reviews Earth & Environment. 4 – Williams et al. (2019)Observed Impacts of Anthropogenic Climate Change on Wildfire in California. Earth’s future. 5 – Starrs et al. (2018)The impact of land ownership, firefighting, and reserve status on fire probability in California. Environmental Research Letters. 6 – Keeley et al. (2024)Climate and weather drivers in southern California Santa Ana Wind and non-Santa Wind fires. International Journal of Wildland Fire. Source:AP Photo/Ethan Swope Wildfires occur when several unfortunate conditions align; they cannot be blamed on one factor alone, contrary to recent misinformation (which keeps spreading in crisis situations) Climate change can increase the risk and severity of wildfires by worsening the conditions that lead and sustain them (e.g., arid/dry conditions) Two prior years of high precipitation increased vegetation, which was later dried out by high temperatures and low precipitation, increasing the fuel available for wildfires Early analyses by climate researchers suggest that both climate change and natural weather variability worsened the fires by increasing dry vegetation (which serves as fuel) Climate scientists explain that more research is needed to better understand how climate change impacted these fires Hot dry winds (called Santa Ana winds) reached exceptionally high speeds at the start of the wildfires and were likely the “final ingredient” stacked on several other conditions conducive to wildfires On the morning of 7 January 2025, a wildfire was reported in the Los Angeles (LA) region which, in just over a week, has burned over 40,600 acres (~16,400 hectares) of land (Figures 1 and 2). The fires quickly made international news and many people took to social media to share helpful information and aid however possible. However, in the midst of this wildfire burning through large swaths of LA and engulfing people’s homes in flames, some decided to use this tragedy as an opportunity to spread misinformation and conspiracies – a dark reflection of what followed several other disasters in 2024 (as shown in our previous reviews tied toHurricanes HeleneandMilton). Some haveclaimedthat budget cuts and mismanagement of resources were to blame, while othersclaimed– without providing evidence – that the fires were caused by arson and that climate change had no influence. Some evenshared vague conspiraciesabout the fires being tied to insurance companies and policy cancellations. During these events, it’s easy to get lost in a sea of information – particularly in recent times where misinformation is rampant. In this article we will explore the conditions that lead to the recent LA fires, investigate what role climate change plays in wildfires, and unravel recent claims on social media. Figure 1 –Locations and size of the LA fires as of 14 January 2025. Source:BBCwith data fromCal Fire Figure 2 –Size of largest part of the largest LA fire (the Palisades fire) – on the outskirts of LA – as of 14 January 2025, relative to New York and London for a size comparison. Source:BBCwith data fromCal Fire When wildfires spread, people are quick to assign blame. The blame can shift between policies, forestry management, climate change, or even specific people. In the recent LA fires, we’ve seen all of the above and more. But pointing fingers in this way misses a crucial fact: wildfires don’t spread because of one factor. That’s not to say that fires aren’ttriggeredby a single event or accident. In the case of the LA wildfires, their ignition source is stillunder investigationat the time of this writing. But despite what starts a given wildfire, a series of conditions need to align for that fire to spread. Let’s quickly look at the basics of wildfires, which we covered in apast review. Fundamentally, firesrequire three things: heat, oxygen, and fuel. Remove any one of these three, and fires will extinguish. For example, if you blow on fire and introduce more oxygen, the fire will strengthen, but if you cover a fire and reduce the oxygen, it will extinguish. However, even with fuel, oxygen, and a source of ignition, that doesn’t mean an uncontrolled wildfire will necessarily spread. This is because several other conditions need to be met for wildfires to spread once they start: ignition, continuous fuel, drought, and appropriate weather[1]. As shown in Figure 3 below, factors driving wildfires include things like wind direction and speed; fuel characteristics (e.g., vegetation can be dry, wet, continuous, sparse, etc.); topography (slope and elevation of surrounding landscapes) and more. Figure 3– Wildfires are driven by many complex factors which interact to shape the occurrence, behaviour, duration, spread, and overall impact of the fire. According to Pausas and Keeley (2021)[1], there are four main transversal factors: ignitions, fuels, droughts, and weather conditions. Source:GRID-Arendal. For example, if there is lots of fuel (like dry vegetation) but it is too spread out and there is no wind, the fire is far more likely to stay put and burn only until it uses up the local fuel source. Governments use this knowledge to reduce the spread of future potential wildfires by performingfuel management– specific practices like brush removal, forest thinning, and prescribed burns which make fuel less available to feed wildfires. However, it is important to remember that wildfires are a natural occurrence that would still happen without humans. So it is nearly impossible to prevent all wildfires from occurring, despite our best policies and hazard-reduction efforts. That being said, humans have undoubtedly influenced the behavior of wildfires[2]. Some human activities have worsened wildfires, while others – such as fuels management – have helped. As explained in a peer-reviewed paper published in 2020 in Nature Reviews Earth & Environment: “Anthropogenic influences on fire activity have become more pronounced since the late eighteenth century, reflecting the effects of industrialization and climate change, land clearance, human population growth, replacement of indigenous and traditional fire management, and the subsequent development of large-scale firefighting and fuels management in the twentieth century.”[3] In recent decades, wildfire activity in California has been on the rise. In a 2019 peer-reviewed paper published inEarth’s Future, the authors explain: “Human-caused warming has already significantly enhanced wildfire activity in California, particularly in the forests of the Sierra Nevada and North Coast, and will likely continue to do so in the coming decades.”[4] In fact, from 1972 to 2018, California’s annual wildfire burn area has increased fivefold[4]. In the next section, we will dive into the details of the most recent LA fires and why climate scientists believe several conditions – including climate change and natural weather variation – worsened these wildfires. With the recent wildfires beingthe worston record in the LA region, many people are asking, “Why now?” – a simple question with a complex answer. Despite this, some are still trying to latch onto a single cause. This is a natural response to tragedies and disasters – to assign blame and seek ‘justice’ for such events or, perhaps, to understand why these events weren’t preventable. But for wildfires, the answer isn’t often clear-cut. Given the complexity of wildfires, a more informed question would be: what are the key factors that lead to the wildfires and what role did they play? Luckily, experts are already on the case. With climate change being a hot topic surrounding this wildfire, six climate scientists at the University of California Los Angeles (UCLA) began analyzing what role climate change might have played in worsening the fire. In anarticleposted on 13 January 2025, these researchers summarized the current state of understanding* about this wildfire : “It will require extensive research to fully understand the relative importance of the various factors underlying the fires, and how the factors interacted, but there is broad consensus as to what those factors might be: there was a buildup of fuels—i.e. vegetation—from 2022–2024, followed by a very warm summer in 2024. Then the winter rains that normally arrive in November and December largely failed to materialize. On top of all that, we saw a nearly unprecedented Santa Ana wind event that was critical for the rapid spread of wildfires beginning on January 7, 2025.” The build up of fuels is somewhat self-explanatory – the more fuel available for a fire, the longer it can potentially burn. But why did this buildup occur? As the researchers explain, there were two wet years in a row. Your intuition may tell you that this should have prevented the fires, but unfortunately – once again – it’s not so simple. The two years of high precipitation increased the vegetation cover, and thus the fuel available to burn once it dried. Asexplainedin a July 2024Fuels and Fire Behavior Advisory, “The above normal grass and herbaceous load creates a continuous fuel bed, allowing for rapid spread of fires when these fuels are cured.” In this context, curing refers to the transition from moist living vegetation to dry dead materials, which increases their flammability. After two prior years of high precipitation that created high fuel build up, the LA regionexperiencedanomalously high temperatures and low precipitation that cured these fuels, increasing the wildfire potential. As explained by the UCLA researchers, “The clearest way in which climate change may have intensified the January 2025 wildfires is the anomalously warm summer and fall of 2024 (3rd hottest since 1895), and its drawdown effect on fuel moisture.” However, they also explain that the recent low wet-season precipitation also had a part to play and is more likely attributed to natural variability than human-driven climate change. Between these two contributing factors, the researchers’analyses suggestthat the anomalous heat – likely intensified by climate change – accounted for roughly 25% of the fuel-moisture deficit, while the other 75% was tied to the low precipitation. Although more research is needed to better understand how climate change contributed to these fires, early analyses suggest that climate change did, in fact, play a role but was not the sole driving factor. The researchers expect that the wildfires would have occurred without human-driven climate change, but likely would have been smaller and less intense. This finding is important because it demonstrates that multiple factors – likely including climate change –contributedto these wildfires, rather than caused them. In contrast, recent social media posts claimed that the fires were either ‘caused’ by climate change or were not, but this is not how scientists actually measure the influence of climate change on wildfires. For example, in a 2023 Nature paper about the influence of anthropogenic climate on daily wildfire growth risk in California, researchers explain: “Some portion of the change in wildfire behaviour is attributable to anthropogenic climate warming, but formally quantifying this contribution is difficult because of numerous confounding factors[3,5]and because wildfires are below the grid scale of global climate models.”[2] The researchers also explain that “[s]o far, anthropogenic warming has enhanced the aggregate expected frequency of extreme daily wildfire growth by 25% […] on average, relative to preindustrial conditions”[2]. However, when estimating the impacts of global warming on past fires, they found large variations between different fires; they explain that “for some fires, there was approximately no change, and for other fires, the enhancement has been as much as 461%”[2]This was mostly dependent on whether or not climate warming pushed conditions past certain thresholds of aridity (i.e., dryness) – a factor that played a large role in the recent LA fires, as explained by UCLA researchers. So how does this all tie together to create a massive wildfire? The UCLA researchers explain: “Given the extreme aridity and fuel abundance in the wildlands around Los Angeles, the hurricane-force Santa Ana winds that arrived on January 7 were the final ingredient in a perfect recipe for major wildfire development.” Santa Ana winds– named after Southern California’s Santa Ana Canyon – are dry hot winds that blow from the desert towards the coast of California. These winds become hot and dry due to the compression and humidity-drop effect they experience as they move downslope from the deserts to the California coast. Along the way, these winds also pick up speed as they are channeled through the canyons and passes. While these winds typically dry out vegetation and increase fire risk[6], the UCLA researchers explain that the recent Santa Ana winds were particularly extreme. To compare the recent Santa Ana wind speeds to those of the past, the UCLA researchers plotted it along with airport wind speed data from 2001 to 2025. As Figure 4 shows, the wind speeds on 7 and 8 January 2025 were unusually high compared to those recorded over the last couple of decades. Figure 4 –Maximum hourly-average wind speeds (on days with Santa Ana winds) recorded at three airports (from top to bottom: Santa Monica Airport, Van Nuys Airport, and Los Angeles Airport) from 2001 to 2025. Two lines – January 7 (red) and January 8 (pink) are added to compare the Santa Ana winds occurring near the start of the wildfires to those over this observational period. Source:UCLA(data source:NOAA) So what’s the takeaway from this? Although claims have suggested that there was a single cause of the wildfire, the truth is that wildfires spread when several conditions align. Trying to blame one single factor not only misrepresents the science of how wildfires start and spread, but also shifts society away from productive and accurate conversations about wildfires that could help prevent them in the future. In other words, a society which is misinformed about wildfires is more prone to taking actions – or inaction – that increases the risk of future wildfires. Rather than having ‘either or’ types of discussions where we seek to understand only one aspect of the fires or blame a single cause, a more comprehensive understanding is critical for our future understanding of wildfires. This point is summarized well in a2019 research articlepublished in Earth Futures: “A nuanced understanding of how, when, where, and why California wildfire activity has increased in recent decades is critical for sustainable environmental and development decisions that specifically take into account how anthropogenic climate change is likely to proceed and affect wildfire across California’s diverse landscapes.”[4] While the information above offers more context behind the role of natural conditions and climate change on the recent LA fires, there are of course other human influences as well (see Figure 3 above). Although covering every factor is outside the scope of this article, we will offer brief context on other factors below by reviewing related misinformation. Claim 1 (Unsupported): ‘The LA fires were an intentional act to clear buildings and rebuild LA into a smart city called SmartLA 2028’(as seen here) Details: The SmartLA 2028 initiative exists but does not involve burning down the city to replace homes with smart infrastructure. Instead, the initiative is apublicly available planthat has been underway since 2020 with projects that focus on upgrading and optimizing the existing infrastructure – not tearing or burning it down. In this plan, they explain that the project’s vision is to reduce the city’s reliance on old technology by, for example, increasing the availability of updated transit options (like on-demand shuttles) to transition away from being the “car capital of the world”. Claims that the wildfires were an intentional act to make progress in these plans are unsubstantiated and based on conspiracies that are not supported with reputable evidence. Claim 2 (Misleading): ‘The fires were caused by arson, not climate change’(as seenhere) Details: This claim is misleading because it conflates climate change – a factor that studies have shown influences wildfires in California[2]– to triggering events like arson. Climate change is not a source of ignition like arson, but rather a long term change in conditions that can worsen wildfires[2]. For the recent LA wildfires, the source of ignition is stillunder investigationat the time of this writing. Although events like arson can start fires, wildfires only spread when numerous conditions align. For a wildfire to spread, four main conditions are required: ignition, continuous fuel, drought, and appropriate weather conditions[1]. Another variation of this claim is that climate change played no role at all in the fires. Early analyses of conditions leading to the wildfires suggest this claim is inaccurate; climate researchers at UCLA suggest that anthropogenic climate change likely worsened the fires through increasing dry vegetation/fuel availability. Claim 3 (Inaccurate): ‘Fires were burning the hollywood sign’(as seenhere) Details: Several videos and photos have circulated on social media showing alleged fires burning right next to the Hollywood sign, but there is no evidence that this actually occurred. Several lines of evidence show the Hollywood sign is intact and not burned. As of 21 January 2024, the Hollywood Sign Trust – a non-profit responsible for maintaining, repairing, and protecting the Hollywood sign – has announced on their website (archived here) that the Hollywood sign is safe from the fires (Figure 5). Their live 24/7 webcam (linked here) of the Hollywood sign is available to view at the time of this writing and clearly show the Hollywood sign is intact, and both the sign and vegetation surrounding it are unburned. Science Feedback used an AI-generated content detection tool called Hive Moderation to assess one of the videos allegedly showing the Hollywood sign burning. The results indicated that the video is 97.8% likely to contain AI-generated or deepfake content (see Figure 6). An article posted on 10 January 2025 by AFP Fact Check (linked here) found similar evidence of AI-generated and manipulated photos and videos of the Hollywood sign burning. Another video – which received over 500,000 likes – showed footage of what appeared to be downtown Los Angeles burning with teams of helicopters hovering above (archived here). The Hive Moderation tool indicates that the video was 99.9% likely to contain AI-generated or deepfake content (Figure 7). Figure 5 –Announcement from the Hollywood Sign Trust that the Hollywood sign is safe from the fires. Source:Hollywood Trust Figure 6 –AI-generated content detection results captured on 21 January 2025 for a video allegedly showing the Hollywood sign burning. The results suggest that the video is 97.8% likely to contain AI-generated or deepfake content. Source:Hive Moderation Figure 7 –AI-generated content detection results captured on 21 January 2025 for a video allegedly showing the Hollywood sign burning. The results suggest that the video is 97.8% likely to contain AI-generated or deepfake content. Source:Hive Moderation Claim 4 (Misleading): ‘Governor Gavin Newsom cut fire budgets by 100 million prior to the January 2025 LA wildfires’(linked here) Details: Numerous claims blaming Gavin Newsom for the recent wildfires rapidly went viral on social media. One of the main claims was that he cut fire budgets by 100 million prior to the fires. This suggests that Newsom lowered the budget, which is inaccurate; the multi-billion dollar California wildfire budget has increased under Newsom (Figure 8). While a one-time budget adjustment of 144 million dollars was made for the fire budget for the 2024-2025 fiscal year, the budget has still gone up year after year (Figure 8).According to the Legislative Analyst’s Office– a non-partisan fiscal and policy advisor – California retained 93% – or 2.6 billion dollars – of the planned multi-year wildfire budget even after making one-time adjustments to address state’s deficits. Cherry picking this one-time budget adjustment when numerous budget cuts were made to several departments (see link here) and presenting it as a targeted action by Newsom against protecting wildfires is misleading. Figure 8 –Total Cal FIRE expenditures by fiscal year from 2019 to 2025, including those from emergency spending. Note that the expenditures used to the January 2025 wildfires are still underway and not included in this figure. Source:Factcheck.orgwith data from theCalifornia Legislative Analyst’s Office 1 – Pausas and Keeley (2021).Wildfires and global change. Frontiers in Ecology and the Environment. 2 – Brown et al. (2023)Climate warming increases extreme daily wildfire growth risk in California. Nature. 3 – Bowman et al. (2020)Vegetation fires in the Anthropocene. Nature Reviews Earth & Environment. 4 – Williams et al. (2019)Observed Impacts of Anthropogenic Climate Change on Wildfire in California. Earth’s future. 5 – Starrs et al. (2018)The impact of land ownership, firefighting, and reserve status on fire probability in California. Environmental Research Letters. 6 – Keeley et al. (2024)Climate and weather drivers in southern California Santa Ana Wind and non-Santa Wind fires. International Journal of Wildland Fire. Extreme weather attributionWildfires Published on: 22 Jan 2025 | Editor:Darrik Burns Climate Feedback is a non-partisan, non-profit organization dedicated to science education. Our reviews are crowdsourced directly from a community of scientists with relevant expertise. We strive to explain whether and why information is or is not consistent with the science and to help readers know which news to trust.Pleaseget in touchif you have any comment or think there is an important claim or article that would need to be reviewed. **Stay informed** Get email news updates:Follow us: **Method** See how we rate claims **Reviewers** **Editor** **Support our work** We depend on your support to operate. Help us create a more trustworthy Internet! Donate **climate feedback** Reviewers Community standards Apply to become a reviewer About Our method to evaluate articles Our method to evaluate claims Contact us"}