{"id": 1089, "name": "PBS News Hour", "domain": "pbs.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.pbs.org/wgbh/masterpiece/specialfeatures/episode-1-history-the-poles-charles-v-and-the-holy-roman-empire/", "title": "Episode 1 History The Poles Charles V And The Holy Roman Empire", "content": "Official Site Schedule Watch ShowsPopular ShowsGrantchesterMiss AustenWolf HallAll Creatures Great and SmallMiss ScarletMr Bates vs The Post OfficeComing SoonGrantchesterThe Marlow Murder ClubUnforgottenFeatured ShowsAlice & JackAnnikaThe Durrells in CorfuGrantchesterMagpie MurdersMaryLandMoonflower MurdersMr Bates vs The Post OfficeThe Marlow Murder ClubMiss AustenNollyPoldarkSanditonSherlockUnforgottenVan der ValkVictoriaWolf HallWorld on FireClose ×All Shows » **Popular Shows** Grantchester Miss Austen Wolf Hall All Creatures Great and Small Miss Scarlet Mr Bates vs The Post Office **Coming Soon** Grantchester The Marlow Murder Club Unforgotten **Featured Shows** Alice & Jack Annika The Durrells in Corfu Grantchester Magpie Murders MaryLand Moonflower Murders Mr Bates vs The Post Office The Marlow Murder Club Miss Austen Nolly Poldark Sanditon Sherlock Unforgotten Van der Valk Victoria Wolf Hall World on Fire **Popular Shows** Grantchester Miss Austen Wolf Hall All Creatures Great and Small Miss Scarlet Mr Bates vs The Post Office **Coming Soon** Grantchester The Marlow Murder Club Unforgotten **Featured Shows** Alice & Jack Annika The Durrells in Corfu Grantchester Magpie Murders MaryLand Moonflower Murders Mr Bates vs The Post Office The Marlow Murder Club Miss Austen Nolly Poldark Sanditon Sherlock Unforgotten Van der Valk Victoria Wolf Hall World on Fire Podcasts Newsletter **Wolf Hall** Episodes Special Features Video **Episode 1 History: The Poles, Charles V, and the Holy Roman Empire** The world ofWolf Hall: The Mirror and the Lightis a dangerous one of politics, passions, and precarious alliances. And to fully appreciate the nuanced power plays that Thomas Cromwell must navigate and the dizzying high-wire act that he must perform, it helps to understand the historical context of King Henry VIII’s world. To that end, MASTERPIECE spoke with the production’s researcher, the author and Tudor historian Kirsten Claiden-Yardley, to illuminate the period’s backdrop where our own historical knowledge may benefit, and our viewing experience be enriched. Episode 1ofWolf Hall: The Mirror and the Lightfinds King Henry VIII marrying Jane Seymour, thereby renewing hopes for succession and a stable throne. But the Tudor dynasty remains vulnerable as trouble simmers at home in the form of the Pole family, and abroad, in the form of Charles V and the Holy Roman Empire, and Thomas Cromwell must manage them while dealing with an increasingly unstable monarch. His skills are put to the test right away asGeoffrey Polereminds him that “we made a bargain with you…We expect Mary to be restored to the succession.” So who are the Poles, what power do they hold, and where do they stand with regards to the throne? Claiden-Yardley explained, “To understand the Poles and their power, you have to go way back into the 15th century when we had the Wars of the Roses in England, between the York side and the Lancastrian side. On the York side, you had King Edward IV, and his two children, Edward V and Richard, the princes [moved to] the Tower of London [for their protection], who disappeared. Did they escape, or were they killed, and who killed them? It’s a big debate that still comes up every so often. But they disappeared and Richard III, Edward IV’s brother, became king. Then there was the Battle of Bosworth, and Richard III was defeated by Lancastrian Henry Tudor, who became Henry VII. But he inherited a little bit more tenuously via his mother, who was descended from an illegitimate son who was later legitimized, so in some ways, Henry Tudor’s claim was a little bit weak, and it largely hung on the fact that he won the Battle of Bosworth. “But there was actually another brother [of Edward IV and Richard III], George, Duke of Clarence, and his daughter, Margaret, isMargaret Pole, who appears inWolf Hall: The Mirror and the Light. The Pole family were the last of the Yorkist line. They and the Courtenay family are referred to as “the old families,” because they go all the way back to King Edward III. And the thing with the Pole family is that in some ways, they had about as good a claim to the English throne as Henry VIII did—if not, some could argue, possibly slightly better. They could cause trouble, and to a certain extent they’d chosen not to—they’d accepted the Tudors and become part of the regime. But they were quite generally traditionally Catholic in their religious outlook. “Margaret had three sons, Geoffrey, Henry, and Reginald, and Reginald was a Catholic cardinal over in Europe. So they were quite Catholic, and thus are not a natural fit for Thomas Cromwell. They came together to oust Anne Boleyn because their interests aligned at that point, but they were not natural allies all the time. And from the Poles’ point of view, they wanted to see a return to how things were before Anne Boleyn. They want to see the Pope back as head of the church in England and Princess Mary back in the line of succession, rather than the whole annulment of Catherine of Aragon’s marriage. “They were basically a constant threat. That was the problem with having them there—they could claim the throne. Since the Battle of Bosworth, a lot of the threats had gradually subsided. But particularly while Henry VIII didn’t have a male heir, the Tudor dynasty was not strong—it wasn’t a long dynasty, and if Henry VIII were to die without a son, what would happen?” This famous question of dynasty requires Cromwell’s diplomatic efforts abroad, as well, as he meet in Episode 1 with the Holy Roman Emperor’s ambassador,Eustace Chapuys, who too is advocating for Mary’s restoration to the line of succession. For anyone trying to make sense of the situation on the continent, with Emperor Charles V, the Holy Roman Empire, and the pope, Kirsten Claiden-Yardley shed some light. “When Henry VIII declared himself head of the Church of England, rather than recognizing papal supremacy, it opened up all sorts of issues with international diplomacy. The Catholic church’s response was to issue a Bull of Excommunication. And at the same time, you had the Holy Roman Emperor and the Holy Roman Empire, which was a huge conglomeration of regions of Europe. The Holy Roman Emperors were elected by what were called ‘the prince-electors,’ most of whom came from regions that you would recognize within Germany now. But at this time, the Holy Roman Emperor Charles V was also king of Spain. And along with Spain also came regions of the Netherlands and the Low Countries. So because he was king of Spain and Holy Roman Emperor, and he had bits of Austria, the area that Charles V nominally ruled over through his various different titles was huge, covering swathes of the Iberian Peninsula, Central Europe, Germany, Austria, and bits of the Low Countries. “So the Holy Roman Empire had been around for a long time—we’re talking practically back to the Roman Empire. Was it the succession to the Roman Empire? That’s a little bit sketchy. But the Catholic Church saw it as the successor to the Roman Empire. The emperors were considered by the Catholic Church to be the most prestigious of the Catholic European monarchs’ status—though I think the “holy” is a little bit misleading because it’s not to do with the papacy, because then, the Pope obviously was God’s representative on Earth. And that’s how you can have both the Holy Roman Emperorandthe Pope. But crucially, the Holy Roman Emperor, Charles V, was still strongly Catholic. And also crucially, Catherine of Aragon was Charles the V’s aunt, so Princess/Lady Mary was his cousin. So there was always this slight fear of, ‘Will the Holy Roman Emperor intervene on Mary’s side?’ “Obviously, as with anything political, it’s not quite as simple as that, because there’s all sorts of other concerns. It’s not as easy as just ride to your cousin’s aid. He’s going to weigh at lots of other things. But it was certainly there as a concern. And it’s also I think why Eustace Chapuys had quite a high standing—he was representing the Holy Roman Emperor. So if you had to rank your ambassadors by the standing of their masters, then he ranked highly.” The Characters of Wolf Hall: The Mirror and the Light Video: Who's Who: Allies & Enemies Watch All 6 Episodes Now with PBS Passport (an added member benefit) Share Link Share on Facebook Share on Facebook **MASTERPIECE Newsletter** Sign up to get the latest news on your favorite dramas and mysteries, as well as exclusive content, video, sweepstakes and more. **Popular Shows** show_featured_image:0 hide_title:0 mp_sf_type:None suppress_modal:0 flipcard:0 interview:0 letter_format:0 listicle:0 question_answer:0 timeline:0 related_content_module:1 related_content_intro: related_content_links_0_title:The Characters of Wolf Hall: The Mirror and the Light related_content_links_0_url:https://www.pbs.org/wgbh/masterpiece/specialfeatures/the-characters-of-wolf-hall-the-mirror-and-the-light/ related_content_links_0_open_in_new_window:1 related_content_links:a:3:{i:0;s:4:\"link\";i:1;s:4:\"link\";i:2;s:4:\"link\";} related_content: related_content_links_1_title:Video: Who's Who: Allies & Enemies related_content_links_1_url:https://www.pbs.org/wgbh/masterpiece/clips/wolf-hall-the-mirror-and-the-light-allies-and-enemies-whos-who/ related_content_links_1_open_in_new_window:1 related_content_links_2_title:Watch All 6 Episodes Now with PBS Passport (an added member benefit) related_content_links_2_url:https://www.pbs.org/wgbh/masterpiece/shows/wolf-hall/episodes/ related_content_links_2_open_in_new_window:1 **More from PBS** **Marie Antoinette** **Marie Antoinette** **Call the Midwife** **Call the Midwife** **Velvet** **Velvet** About MASTERPIECE Watch MASTERPIECE with PBS Passport Teacher’s Resources Feedback Credits Corporate Sponsorship Funders Privacy Policy Find out about new shows, get updates on your favorite dramas and mysteries, enjoy exclusive content and more! Funding forMASTERPIECEis provided byVikingandRaymond James, with additional support from public television viewers and contributors toThe Masterpiece Trust, created to help ensure the series' future. Terms of Use: PBS is a 501(c)(3) not-for-profit organization. ©2025 WGBH Educational Foundation Produced by GBH Subscribe to the free MASTERPIECE email newsletter for updates on great dramas and mysteries likeGrantchester! No, thanks"}