{"id": 266, "name": "CommonWealth Beacon", "domain": "commonwealthbeacon.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://commonwealthbeacon.org/raceracism/new-survey-shows-that-asian-and-pacific-islander-americans-are-concerned-about-cost-of-living-lean-democrat-and-have-high-levels-of-civic-engagement/", "title": "New Survey Shows That Asian And Pacific Islander Americans Are Concerned About Cost Of Living Lean Democrat And Have High Levels Of Civic Engagement", "content": "**Stay in the know.** Get the latest CommonWealth Beacon news and opinion in your inbox. The DownloadDaily news, analysis, and opinion. CommonWealth VoicesSunday roundup of incisive commentary from our opinion page. The Saturday SendWeekly digest of stories you may have missed. Submit a Tip Donate Sign In NewsOpen dropdown menuEducationEnergy & EnvironmentHealth CareHousingPoliticsTransportationAll News Education Energy & Environment Health Care Housing Politics Transportation All News Education Energy & Environment Health Care Housing Politics Transportation All News Opinion Our Changing Climate NewslettersOpen dropdown menuThe Download The Download The Download The Codcast Membership AboutOpen dropdown menuAbout UsOur ImpactJob BoardPoliciesFinancesStaff & LeadershipSupport UsContact Us About Us Our Impact Job Board Policies Finances Staff & Leadership Support Us Contact Us About Us Our Impact Job Board Policies Finances Staff & Leadership Support Us Contact Us **Topics** Education Energy & Environment Health Care Housing Politics Transportation All News **Featured** CommonWealth Voices In Depth By The Numbers NewslettersThe Download The Download The Download The Codcast Print Archive CommonWealth Beacon Politics, ideas, and civic life in Massachusetts Submit a Tip Donate Sign In NewsOpen dropdown menuEducationEnergy & EnvironmentHealth CareHousingPoliticsTransportationAll News Education Energy & Environment Health Care Housing Politics Transportation All News Education Energy & Environment Health Care Housing Politics Transportation All News Opinion Our Changing Climate NewslettersOpen dropdown menuThe Download The Download The Download The Codcast Membership AboutOpen dropdown menuAbout UsOur ImpactJob BoardPoliciesFinancesStaff & LeadershipSupport UsContact Us About Us Our Impact Job Board Policies Finances Staff & Leadership Support Us Contact Us About Us Our Impact Job Board Policies Finances Staff & Leadership Support Us Contact Us **New survey shows that Asian and Pacific Islander Americans are concerned about cost of living, lean Democrat, and have high levels of civic engagement** ASIAN AND PACIFIC ISLANDER AMERICANSin Massachusetts are concerned about the cost of living and housing in the state, tend to have a high level of civic engagement, and are more likely to vote for Democrats, according toa new statewide pollconducted by the MassINC Polling Group. On Tuesday, a group of organizations that work on issues relating to Asian and Pacific Islander Americans (APIA) released a survey report – titled No Longer Invisible – on the lived experiences and civic engagement of APIA residents in the state. The study included responses from 1,414 APIA residents in the state and was conducted from March 5 to March 31, 2025. Asian and Pacific Islander Americans make up 7 percent of the population and are the fastest-growing racial group in Massachusetts, with the population rising by nearly 38 percent since 2012, according to the survey. However, little data has been collected that provides insights into the experiences of APIA in the state. Top of mind for APIA survey respondents were issues around the affordability of housing and the cost of living in the state. Twenty-seven percent cited housing, and 32 percent picked cost of living as the most pressing issue. Broader statewidesurveyshave shown that housing shows up as the top issue for people living in Massachusetts. **Recommended** New poll: Mass. residents want back-up plan for funding transportation projectsDateMarch 26, 2025 Voters support more action to boost housing, new poll findsDateMay 14, 2025 Transportation insecurity is holding Massachusetts residents backDateApril 23, 2025 The survey asked questions about political participation, safety and sense of belonging, and viewpoints on the Trump administration and its policies. Nearly a quarter of respondents said that they had experienced discrimination with 21 percent saying that they faced ethnic slurs. Only 39 percent of respondents said that they strongly agree that they feel like they belong in the United States. Respondents largely said that they anticipated negative impacts from the Trump administration on critical issues like immigration policy (61 percent), racism (65 percent), reproductive rights (63 percent), climate change (63 percent), and LGBTQ+ rights (67 percent). A majority of survey respondents opposed President Donald Trump’s executive orders purportedly ending birthright citizenship; rolling back diversity, equity, and inclusion efforts; and increasing deportation actions. However, the results were a bit more divided on the deportation executive order compared to the others, with lower overall opposition. Advocates for APIA communities say that their work is more difficult without adequate data, and elected officials might overlook APIA voters. The survey is meant to address that gap and provide some of the data necessary for more advocacy and policy changes regarding APIA issues. The project was a collaboration between the Massachusetts Asian American and Pacific Islanders Commission, the Institute for Asian American Studies at UMass Boston, the Asian Community Fund at The Boston Foundation, and APIs CAN. The groups worked with the MassINC Polling Group, which is partly owned by MassINC, the nonprofit organization that publishesCommonWealth Beacon, to create the survey questions. Anti-Asian hate and discrimination have been on the rise nationwide. Nearly 36 percent of Asian Americans across the country reported having experienced harassment, and 63 percent reported that they have felt unsafe in a public place, according to the2025 STAATUS Index– an annual survey of Asian Americans in the US. “This project is both a wake-up call and a call to action,” said Danielle Kim, the executive director of the Asian Community Fund at the Boston Foundation and a member of the Massachusetts Asian American and Pacific Islanders Commission, at an event on Tuesday launching the survey report. “This reported partnership represents an important milestone in uplifting greater visibility for our communities and harnessing our collective voice to advocate for lasting change.” The survey also found that APIA survey participants were engaged politically at a relatively high rate, with 80 percent saying that they were registered to vote. Among those who were registered, 84 percent said that they had voted in the 2024 election. APIA survey respondents reported being politically active in other ways as well – 23 percent signed petitions, 19 percent attended government meetings, and 15 percent attended rallies. A majority of APIA survey respondents – 56 percent – leaned Democrat, and 67 percent of those who reported voting in the 2024 election said they voted for Kamala Harris, the Democratic candidate for president. At the report launch event, members of the APIA community spoke of the importance of data in empowering APIA communities to advocate for themselves. Chahat Kalia, a member of the Massachusetts Asian American and Pacific Islanders Commission’s Youth Council, noted that more work needs to be done to include other APIA voices that aren’t present in this survey report. “As a young person, I want to inform a future where our mental health, our safety, our education, and our identities are not an afterthought,” said Kalia. “To the policy-makers and community members in this room, thank you for listening. Please continue to listen to us, include us, and value our stories because we are not just the future. We are the present, and we’re ready to be part of the conversation.” **Related** Click to share on Mail (Opens in new window)Mail Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Bluesky (Opens in new window)Bluesky Click to share on Print (Opens in new window)Print Republish This Story Republish our articles for free, online or in print. **Republish this article** This work is licensed under aCreative Commons Attribution-NoDerivatives 4.0 International License. You must use the HTML code provided below. You must republish the whole story, credit us appropriately, and, if you’re republishing CommonWealth Beacon stories online, include a link to our original publication page. You can’t sell the work separately or grant downstream publication rights to other republishers. Please note that images are not included in this blanket license as in most cases we are not the copyright owner. **New survey shows that Asian and Pacific Islander Americans are concerned about cost of living, lean Democrat, and have high levels of civic engagement** by Bhaamati Borkhetaria, CommonWealth BeaconJune 4, 2025 **Stay in the know.** Get the latest CommonWealth Beacon news and opinion in your inbox. Δ **Most Popular** **LEARN** About Us Policies Staff & Leadership Finances Job Board **GET INVOLVED** Support Us Membership Make a Donation Advertise With Us **CONTACT US** Mail Twitter Facebook LinkedIn Bluesky **Sign in** Enter the code sent to your email. Email address Enter your password Sign in by entering the code we sent to, or clicking the magic link in the email. Terms & Privacy Policies. This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply."}