{"id": 79, "name": "New York Amsterdam News", "domain": "amsterdamnews.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://amsterdamnews.com/news/2025/06/05/after-crossing-the-border-for-better-schools-some-parents-are-pulling-their-kids-and-leaving-the-us/", "title": "After Crossing The Border For Better Schools Some Parents Are Pulling Their Kids And Leaving The Us", "content": "Support us Subscribe Sign In NewsOpen dropdown menuLocalNationalInternationalOpen dropdown menuCaribbean ConnectionImmigration KornerPoliticsOpen dropdown menuPolitics NoirElection 2025Black Vote, Black PowerBlack Financial HealthOpen dropdown menuBlack EntrepreneurshipHealthOpen dropdown menuCOVID-19Knowing Alzheimer’s DiseaseEducationOpen dropdown menuHBCU NewsDivine Nine NewsReligionWeather Local National InternationalOpen dropdown menuCaribbean ConnectionImmigration Korner Caribbean Connection Immigration Korner PoliticsOpen dropdown menuPolitics NoirElection 2025Black Vote, Black Power Politics Noir Election 2025 Black Vote, Black Power Black Financial HealthOpen dropdown menuBlack Entrepreneurship Black Entrepreneurship HealthOpen dropdown menuCOVID-19Knowing Alzheimer’s Disease COVID-19 Knowing Alzheimer’s Disease EducationOpen dropdown menuHBCU News HBCU News Divine Nine News Religion Weather Local National InternationalOpen dropdown menuCaribbean ConnectionImmigration Korner Caribbean Connection Immigration Korner Caribbean Connection Immigration Korner PoliticsOpen dropdown menuPolitics NoirElection 2025Black Vote, Black Power Politics Noir Election 2025 Black Vote, Black Power Politics Noir Election 2025 Black Vote, Black Power Black Financial HealthOpen dropdown menuBlack Entrepreneurship Black Entrepreneurship Black Entrepreneurship HealthOpen dropdown menuCOVID-19Knowing Alzheimer’s Disease COVID-19 Knowing Alzheimer’s Disease COVID-19 Knowing Alzheimer’s Disease EducationOpen dropdown menuHBCU News HBCU News HBCU News Divine Nine News Religion Weather OpinionOpen dropdown menuEditorialsOp-EdsAmNews Roving CameraSubmit an Op-EdColumnsOpen dropdown menuChristina GreerImmigration KornerUrban Agenda Editorials Op-Eds AmNews Roving Camera Submit an Op-Ed ColumnsOpen dropdown menuChristina GreerImmigration KornerUrban Agenda Christina Greer Immigration Korner Urban Agenda Editorials Op-Eds AmNews Roving Camera Submit an Op-Ed ColumnsOpen dropdown menuChristina GreerImmigration KornerUrban Agenda Christina Greer Immigration Korner Urban Agenda Christina Greer Immigration Korner Urban Agenda Union MattersOpen dropdown menuAnnual Labor Awards BreakfastUnion NewsUnion Matters-1199Union Matters-32BJUnion Matters-DC37Union Matters-RWDSUUnion Matters-Local Teamsters 237Union Matters–NY/NJ VA Council 246 Annual Labor Awards Breakfast Union News Union Matters-1199 Union Matters-32BJ Union Matters-DC37 Union Matters-RWDSU Union Matters-Local Teamsters 237 Union Matters–NY/NJ VA Council 246 Annual Labor Awards Breakfast Union News Union Matters-1199 Union Matters-32BJ Union Matters-DC37 Union Matters-RWDSU Union Matters-Local Teamsters 237 Union Matters–NY/NJ VA Council 246 A&EOpen dropdown menuJazz NotesTheaterDanceFilm/TVMusicFashionGo With The FloHoroscopeTravelArtBooks Jazz Notes Theater Dance Film/TV Music Fashion Go With The Flo Horoscope Travel Art Books Jazz Notes Theater Dance Film/TV Music Fashion Go With The Flo Horoscope Travel Art Books EventsOpen dropdown menuAdd Your Event Add Your Event Add Your Event Sports Black History BlacklightOpen dropdown menuBeyond The Barrel of the GunConvenings Beyond The Barrel of the Gun Convenings Beyond The Barrel of the Gun Convenings Black To Nature OfferingsOpen dropdown menuMerchandiseNewsletter Sign-UpWord in BlackBlack to NatureThe Black New YorkersAmNews FoodCurtain RaiserHarlem WeekAmNews PodcastSpecial SectionsJobs Merchandise Newsletter Sign-Up Word in Black Black to Nature The Black New Yorkers AmNews Food Curtain Raiser Harlem Week AmNews Podcast Special Sections Jobs Merchandise Newsletter Sign-Up Word in Black Black to Nature The Black New Yorkers AmNews Food Curtain Raiser Harlem Week AmNews Podcast Special Sections Jobs Obits AboutOpen dropdown menuOur TeamInternship ProgramFreelance For UsAmNews Awards and ImpactAmsterdam News Editorial PolicyArchives, Permissions and Copyrights Our Team Internship Program Freelance For Us AmNews Awards and Impact Amsterdam News Editorial Policy Archives, Permissions and Copyrights Our Team Internship Program Freelance For Us AmNews Awards and Impact Amsterdam News Editorial Policy Archives, Permissions and Copyrights Contact AdvertiseOpen dropdown menuMedia KitLegal and LLC Media Kit Legal and LLC Media Kit Legal and LLC Subscribe Newsletter AboutOpen dropdown menuOur TeamInternship ProgramFreelance For UsAmNews Awards and ImpactAmsterdam News Editorial PolicyArchives, Permissions and Copyrights Our Team Internship Program Freelance For Us AmNews Awards and Impact Amsterdam News Editorial Policy Archives, Permissions and Copyrights Our Team Internship Program Freelance For Us AmNews Awards and Impact Amsterdam News Editorial Policy Archives, Permissions and Copyrights Contact AdvertiseOpen dropdown menuMedia KitLegal and LLC Media Kit Legal and LLC Media Kit Legal and LLC Subscribe Newsletter New York Amsterdam News The New Black View Support us Subscribe Sign In NewsOpen dropdown menuLocalNationalInternationalOpen dropdown menuCaribbean ConnectionImmigration KornerPoliticsOpen dropdown menuPolitics NoirElection 2025Black Vote, Black PowerBlack Financial HealthOpen dropdown menuBlack EntrepreneurshipHealthOpen dropdown menuCOVID-19Knowing Alzheimer’s DiseaseEducationOpen dropdown menuHBCU NewsDivine Nine NewsReligionWeather Local National InternationalOpen dropdown menuCaribbean ConnectionImmigration Korner Caribbean Connection Immigration Korner PoliticsOpen dropdown menuPolitics NoirElection 2025Black Vote, Black Power Politics Noir Election 2025 Black Vote, Black Power Black Financial HealthOpen dropdown menuBlack Entrepreneurship Black Entrepreneurship HealthOpen dropdown menuCOVID-19Knowing Alzheimer’s Disease COVID-19 Knowing Alzheimer’s Disease EducationOpen dropdown menuHBCU News HBCU News Divine Nine News Religion Weather Local National InternationalOpen dropdown menuCaribbean ConnectionImmigration Korner Caribbean Connection Immigration Korner Caribbean Connection Immigration Korner PoliticsOpen dropdown menuPolitics NoirElection 2025Black Vote, Black Power Politics Noir Election 2025 Black Vote, Black Power Politics Noir Election 2025 Black Vote, Black Power Black Financial HealthOpen dropdown menuBlack Entrepreneurship Black Entrepreneurship Black Entrepreneurship HealthOpen dropdown menuCOVID-19Knowing Alzheimer’s Disease COVID-19 Knowing Alzheimer’s Disease COVID-19 Knowing Alzheimer’s Disease EducationOpen dropdown menuHBCU News HBCU News HBCU News Divine Nine News Religion Weather OpinionOpen dropdown menuEditorialsOp-EdsAmNews Roving CameraSubmit an Op-EdColumnsOpen dropdown menuChristina GreerImmigration KornerUrban Agenda Editorials Op-Eds AmNews Roving Camera Submit an Op-Ed ColumnsOpen dropdown menuChristina GreerImmigration KornerUrban Agenda Christina Greer Immigration Korner Urban Agenda Editorials Op-Eds AmNews Roving Camera Submit an Op-Ed ColumnsOpen dropdown menuChristina GreerImmigration KornerUrban Agenda Christina Greer Immigration Korner Urban Agenda Christina Greer Immigration Korner Urban Agenda Union MattersOpen dropdown menuAnnual Labor Awards BreakfastUnion NewsUnion Matters-1199Union Matters-32BJUnion Matters-DC37Union Matters-RWDSUUnion Matters-Local Teamsters 237Union Matters–NY/NJ VA Council 246 Annual Labor Awards Breakfast Union News Union Matters-1199 Union Matters-32BJ Union Matters-DC37 Union Matters-RWDSU Union Matters-Local Teamsters 237 Union Matters–NY/NJ VA Council 246 Annual Labor Awards Breakfast Union News Union Matters-1199 Union Matters-32BJ Union Matters-DC37 Union Matters-RWDSU Union Matters-Local Teamsters 237 Union Matters–NY/NJ VA Council 246 A&EOpen dropdown menuJazz NotesTheaterDanceFilm/TVMusicFashionGo With The FloHoroscopeTravelArtBooks Jazz Notes Theater Dance Film/TV Music Fashion Go With The Flo Horoscope Travel Art Books Jazz Notes Theater Dance Film/TV Music Fashion Go With The Flo Horoscope Travel Art Books EventsOpen dropdown menuAdd Your Event Add Your Event Add Your Event Sports Black History BlacklightOpen dropdown menuBeyond The Barrel of the GunConvenings Beyond The Barrel of the Gun Convenings Beyond The Barrel of the Gun Convenings Black To Nature OfferingsOpen dropdown menuMerchandiseNewsletter Sign-UpWord in BlackBlack to NatureThe Black New YorkersAmNews FoodCurtain RaiserHarlem WeekAmNews PodcastSpecial SectionsJobs Merchandise Newsletter Sign-Up Word in Black Black to Nature The Black New Yorkers AmNews Food Curtain Raiser Harlem Week AmNews Podcast Special Sections Jobs Merchandise Newsletter Sign-Up Word in Black Black to Nature The Black New Yorkers AmNews Food Curtain Raiser Harlem Week AmNews Podcast Special Sections Jobs Obits **After crossing the border for better schools, some parents are pulling their kids and leaving the US** **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Tumblr (Opens in new window)Tumblr Click to share on Pinterest (Opens in new window)Pinterest Click to email a link to a friend (Opens in new window)Email **Not possible without you!** Our journalism is only possiblewith support from you, our readers. The news mainstream media just doesn’t cover. Racial justice journalism since 1909. Thanks for your contribution! **Sign up for our FREE acclaimed newsletters!** The news mainstream media just doesn’t cover. Racial justice journalism since 1909. **Protect our Racial Justice Journalism— Subscribe Now!** We need you NOW!For 115 years we have delivered award winning racial justice journalism —and only with your support can we continue! Digital Only $5/month Print & Digital $6/month MORE OPTIONS Already a subscriber?Log into hide this. For the last two months of their life in the United States, José Alberto González and his family spent nearly all their time in their one-bedroom Denver apartment. They didn’t speak to anyone except their roommates, another family from Venezuela. They consulted WhatsApp messages for warnings of immigration agents in the area before leaving for the rare landscaping job or to buy groceries. But most days at 7:20 a.m., González’s wife took their children to school. **Sign up for our FREE acclaimed newsletters!** The news mainstream media just doesn't cover. Racial justice journalism since 1909. The appeal of their children learning English in American schools, and the desire to make money, had compelled González and his wife to bring their 6- and 3-year-old on the monthslong journey to the United States. They arrived two years ago, planning to stay for a decade. But on Feb. 28, González and his family boarded a bus from Denver to El Paso, where they would walk across the border and start the trip back to Venezuela. Even as immigrants in the U.S. avoid going out in public, terrified of encountering immigration authorities, families across the country are mostly sending their children to school. That’s not to say they feel safe. In some cases, families are telling their children’s schools that they’re leaving. Already, thousands of immigrants have notified federal authorities they plan to “self-deport,” according to the Department of Homeland Security. President Donald Trump has encouraged more families to leave by stoking fears of imprisonment, ramping up government surveillance, and offering people $1,000 and transportation out of the country. And on Monday, the Supreme Court allowed the Trump administration to strip legal protections from hundreds of thousands of Venezuelan immigrants, potentially exposing them to deportation. Without Temporary Protective Status, even more families will weigh whether to leave the U.S., advocates say. “The amount of fear and uncertainty that is going through parents’ heads, who could blame somebody for making a choice to leave?” said Andrea Rentería, principal of a Denver elementary school serving immigrant students. Rumors of immigration raids on schools became a turning point When Trump was elected in November after promising to deport immigrants and depicting Venezuelans, in particular, as gang members, González knew it was time to go. He was willing to accept the trade-off of earning just $50 weekly in his home country, where public schools operate a few hours a day. “I don’t want to be treated like a delinquent,” González said in Spanish. “I’m from Venezuela and have tattoos. For him, that means I’m a criminal.” It took González months to save up the more than $3,000 he needed to get his family to Venezuela on a series of buses and on foot. They sent their children to their Denver school regularly until late February, when González’s phone lit up with messages claiming immigration agents were planning raids inside schools. That week, they kept their son home. “Honestly, we were really scared for our boy,” González said. In the months following Trump’s inauguration, Denver Public School attendance suffered, according to district data. Attendance districtwide fell by 3% in February compared with the same period last year, with even steeper declines of up to 4.7% at schools primarily serving immigrant newcomer students. Data obtained from 15 districts across eight additional states, including Texas, Alabama, Idaho and Massachusetts, showed a similar decline in school attendance after the inauguration for a few weeks. In most places, attendance rebounded sooner than in Denver. Nationwide, schools are still reporting drops in daily attendance during weeks when there is immigration enforcement — or even rumors of Immigration and Customs Enforcement raids — in their communities, said Hedy Chang of the nonprofit Attendance Works, which helps schools address absenteeism. In late February, González and his wife withdrew their children from school and told administrators they were returning to Venezuela. He posted a goodbye message on a Facebook group for Denver volunteers he used to find work and other help. “Thank you for everything, friends,” he posted. Immigrant families are gathering documents they need to return home Countries with large populations living in the United States are seeing signs of more people wanting to return home. Applications for Brazilian passports from consulates in the U.S. increased 36% in March, compared to the previous year, according to data from the Brazilian Foreign Ministry. Guatemala reports a 5% increase over last year for passports from its nationals living in the United States. Last month, Melvin Josué, his wife and another couple drove four hours from New Jersey to Boston to get Honduran passports for their American-born children. It’s a step that’s taken on urgency in case these families decide life in the United States is untenable. Melvin Josué worries about what might happen if he or his wife is detained, but lately he’s more concerned with the difficulty of finding work. Demand for his drywall crew immediately stopped amid the economic uncertainty caused by tariffs. There’s also more reluctance, he said, to hire workers here illegally. (The Associated Press agreed to use only his first and middle name because he’s in the country illegally and fears being separated from his family.) “I don’t know what we’ll do, but we may have to go back to Honduras,” he said. “We want to be ready.” Trump’s offer to pay immigrants to leave and help them with transportation could hasten the departures. González, now back in Venezuela, says he wouldn’t have accepted the money, because it would have meant registering with the U.S. government, which he no longer trusts. And that’s what he’s telling the dozens of migrants in the U.S. who contact him each week asking the best way home. Go on your own, he tells them. Once you have the cash, it’s much easier going south than it was getting to the U.S. in the first place. **Support our Racial Justice Journalism** Since 1909, bringing you the news that mainstream media just doesn't. Only possible with support from you, our readers. Thanks for your contribution! **Like this:** **Related** **Leave a comment** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. Δ **Most Recent** **Key moments from the third week of Sean ‘Diddy’ Combs’ sex trafficking trial** **In a crowded NYC mayoral debate, Cuomo faces attacks from all sides** **Summer Books 2025** **Jobs With Justice’s Erica Smiley among Women’s Media Center honorees** **A Q & A with A’Lelia Bundles, author of ‘Joy Goddess’** Newsletter **Sections** News Opinion-AN Arts-Entertainment Sports **Info** About Media Kit Contact **Contact** Amsterdam News2340 Frederick Douglass Blvd.New York, NY 10027Phone: 212-932-7400 **Sign in** Enter the code sent to your email. Email address Enter your password Sign in by entering the code we sent to, or clicking the magic link in the email. By signing up, you agree to our Terms and Conditions.This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. **Complete your transaction**"}