{"id": 1194, "name": "St. Louis Riverfront Times", "domain": "riverfronttimes.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.riverfronttimes.com/music/the-fresh-face-of-rock-is-a-50-year-old-meet-outlaw-alt-rocker-annie-davis-of-trashy-annie-44605161", "title": "The Fresh Face Of Rock Is A 50 Year Old Meet Outlaw Alt Rocker Annie Davis Of Trashy Annie 44605161", "content": "Music Music News & Interviews NewsLatest NewsSt. Louis Metro NewsMissouri NewsSportsAbortion RightsSt. Louis GuidesDigital Issue Latest News St. Louis Metro News Missouri News Sports Abortion Rights St. Louis Guides Digital Issue Latest News St. Louis Metro News Missouri News Sports Abortion Rights St. Louis Guides Digital Issue Food & DrinkLatest Food & DrinkFood & Drink NewsRestaurant ReviewsSt. Louis StandardsOpenings & ClosingsFind a Restaurant Latest Food & Drink Food & Drink News Restaurant Reviews St. Louis Standards Openings & Closings Find a Restaurant Latest Food & Drink Food & Drink News Restaurant Reviews St. Louis Standards Openings & Closings Find a Restaurant MusicLatest MusicMusic News & InterviewsConcert ReviewFind a Concert Latest Music Music News & Interviews Concert Review Find a Concert Latest Music Music News & Interviews Concert Review Find a Concert MoviesLatest MoviesMovie Reviews & NewsMovie TimesFind a TheaterGiveaways Latest Movies Movie Reviews & News Movie Times Find a Theater Giveaways Latest Movies Movie Reviews & News Movie Times Find a Theater Giveaways Things to DoToday's EventsThis WeekendFree EventsSubmit an Event Today's Events This Weekend Free Events Submit an Event Today's Events This Weekend Free Events Submit an Event Reeferfront TimesLatest ReeferfrontCannabisKratomMushrooms Latest Reeferfront Cannabis Kratom Mushrooms Latest Reeferfront Cannabis Kratom Mushrooms After Dark **Search** in Articles & Posts in Locations in Events in Slideshows All Music Music News & Interviews Latest Music Music News & Interviews Concert Review Find a Concert **The Fresh Face of Rock is a 50-Year-Old: Meet Outlaw Alt-Rocker Annie Davis of Trashy Annie** **Throw on a pair of cat ears, find something sparkly, and get ready to get trashy.** The club is small and dark, and the hallways are narrow, but as we follow the music into the back of the industrial space, the sound is the kind of big that is both overwhelming and feels like a hug from your favorite aunt. You know, the one who used to take you to the zoo and let you be your true weird self when your parents needed a minute? Trashy Annie’s music sounds the way you felt when you heard your aunt’s car pull into the driveway, and you knew that for the next hour or so, you could be seen and celebrated for exactly who you are. Annie Davis hasn’t always been a rock star, but she’s here now, and thank God for that. To the outside world, Annie’s a Doctor and Biomechanist who ensures that everyone keeps running (literally). But when Annie’s onstage, her performance is an open invitation to throw on that thing you’ve been saving for a special occasion, and dance like the world is watching and loves what it sees. For a band that came together as most of the world was remembering how to interact with other humans after lockdown, to do what they do is nothing short of a divinely inspired beam of sunlight that shines directly into your soul. But…how did they get here? How did an entrepreneur with a successful physical therapy business decide in her 40s that it was time to be a rockstar, and then make it happen? The simple answer is: that it’s who she’s always been. The more complicated answer involves a glimpse into Annie’s history, and an understanding that making something out of nothing is just what Annie does. **Trashy stories have humble beginnings.** Born in Texas to two parents who were destined for a swift breaking, Annie didn’t have the easiest start to life. Her parents moved to Washington State for work at Braniff Airlines that ended soon after, and then split when she was still just learning her alphabet, leaving Annie to learn to navigate between her parents as she was just beginning to figure out what it meant to be a person. As was frequently the case in the era when Annie was little, parents being unemployed and divorced meant that money was tight, and much of the food that went into wee Annie’s belly was purchased with food stamps, and whatever money she and her mother could get from turning in the beer and soda cans they collected from the side of the road. When parents can’t afford to buy food, they don’t have access to the kind of music education that most world-class musicians enjoy as young children. Annie may not have had access to private music instruction, but when there’s a love for the art of making music in the heart, the mind finds a way. The public school that Annie attended had a band program, so Annie decided to join. As a child, she had high hopes of playing the drums in the percussion section, but given that every child between the ages of 9 - 13 has an innate desire to bang on things and the fact that Annie was the last one to sign up, her choices were pretty limited. So limited that she had only one option left— a dinged up old trumpet. Says Annie, “It was the last instrument that my elementary school had to borrow. I was super poor when I grew up, there was no money for renting instruments or music lessons. So there was a trumpet and it was all dented and the tuning slide was broken, but I thought… it's perfect.” Annie gladly took home the beaten up old trumpet, and lovingly carried it with her to school only to realize that there was a major problem she’d overlooked in her eagerness to become a musician: she had no idea how to play the thing. Where most people would take that as a sign to give up and go home, Annie didn’t. She watched the kids in her section, and faked it the whole first year, making it look like she was playing along with everyone else, when in reality she was soaking up what she saw and heard around her. That summer, she took her trumpet home, and utilizing what she’d observed in class, she taught herself to play. When school started again the next fall, Annie strode into the band hall ready to fight for her place in the brass section. “I went home that summer and decided that I was gonna learn how to play this thing. And then I came back in sixth grade, and I loved it. I got first chair, and then I became a drum major in high school, and that was really when music felt like the thing that I wanted to do. I was super introverted and nerdy, and it just became this sort of connector to the world.” She’s been fighting for her love of music ever since. **How do you make a living as a musician?** Annie stayed involved in band through her senior year of high school, the love of music driving her to keep reaching, keep growing. Where other teens rebelled, Annie just practiced harder. “I would skip school, and instead of going and doing something cool, like smoking weed on the street corner, I would go practice my trumpet in the band room.” When it was time for her to graduate and decide what was next, Annie knew one thing above all others: she didn’t ever want to worry about how to feed herself ever again, but music was a part of her soul that she couldn’t give up altogether. College wasn’t really something Annie’s family could afford, but fate had other ideas. “The only reason I ended up going [to college] was because we had a jazz concert my senior year, and the band director from the community college across the street saw the concert. He said, ‘I want to offer you a full scholarship to come play trumpet for us over here’.” Off to Clark College Annie went, and under the guidance of Chuck Ramsey, she was able to continue her musical studies. Never one to do things the boring way, Annie also completed her EMT certification and joined a local volunteer fire department. Unfortunately, as is so often the case, an insecure man entered the picture. When women are young and still learning who they are, it’s so much harder to recognize it when someone who never learned to shine is trying to dim the light of a woman who sparkles like a star in the sky. Annie was in an abusive romantic relationship that resulted in her dropping out of school. In order to make ends meet without a degree or any kind of experience that would give her a well-paying job, Annie got her realtor license, and let her dreams slowly gather dust. Eventually she kicked the guy to the curb, and at Portland State University in 2003, Annie completed her degree in Biology with the intention of becoming an ER doc. Here is where we’re going to pause the conversation about Annie’s return to higher education, because in order for the rest of this part of her story to make sense, it’s crucial to understand something about Annie. She’s a conqueror of fears. When she’s afraid to do something, she takes that fear as a sign that she’s on the right track and should encounter her fears head-on. To quote Annie herself, \"Doing things that are scary has been something that has driven me my entire life. Scary things get me up in the morning.” Around this time in her life is when Annie decided that it was time to conquer her lifelong fear of water, and what better way to do that than to do it the same way she’s done everything? With hard mode fully engaged. Annie decided that a triathlon was the best way to force herself to encounter and conquer her fear of water, so she signed up, began training, and got to it. In the process of training for her first triathlon, Annie fell in love with running, got injured, and when her doctor told her that she needed to “just stop running” in order to not be in pain anymore, Annie decided that wasn’t going to work for her. That same attitude has carried Annie through to the point when she decided that it was time to conquer another fear; it was time to get back to music. **The heart of the matter.** All of the success in the world doesn’t mean a thing when you don’t feel like you in your own life. Annie was a successful business owner. A fierce competitor in triathlon and adventure racing. A world-renown specialist in the field of biomechanics, but something was missing. There was no music. There needed to be music. When Annie was asked to pull her trumpet off the shelf to sub in for one of her favorite bands — playing music made her feel like herself again. She was home. …and then the Covid-19 pandemic arrived and squashed all good things. Well, notallof them. But enough of them that Annie decided it was time to dig deep, and learn to make her own music from the beginning of the process. She buckled down and taught herself to play more than just a few chords on the guitar she’d begun playing on prior to the world shutting down, and in November of 2020 she performed solo for the first time ever with only two songs in her repertoire. There wasoneplace open in Austin TX at the time, and they were hosting a socially distanced open mic night. Annie only knew how to play the guitar sitting down at the time, and had to ask for a chair to be brought onstage so that she could perform. Once the dust and the jitters from that night settled, Annie was hooked. She dug deep, teaching herself to play guitar standing, learning more about how to sing the way she wanted to be singing, honing her skills as a songwriter all the while. She practiced, performed, kept writing, and then soon she decided it was time to take on another challenge: a music video. Annie shot the whole thing herself, and her costumes were entirely composed of fun things that she found in thrift stores— tutus, sequins, you name it. A few people who watched that video had just one takeaway: Aren’t those clothes a little too young for you? Annie disagreed, dressed that way even harder, and decided that the best way to clap back at the haters was to get even louder. The best way to make noise is to find the people who are willing to yell with you, so Annie decided it was time to start a band. She needed to do a search, and find other people who were looking for the same thing she’d so recently found: a place to make music that reminds you of who you truly are at the heart of it all. Each and every member of the band was recruited not only because they can play the music, but because they understand deep in their bones what it means to be the ones making the music that reminds each person who hears it that their weirdness is worth celebrating. **A place to belong, and a soundtrack for celebrating.** Once assembled, the band needed a name, and what better identity to claim than the insults that were lobbied at Annie’s earliest work? Trashy Annie is more than the woman who pulled it all together. It’s a fight to honor the truest version of self. It’s about being seen, and known for who you are underneath all of the armor that you’ve picked up in order to protect yourself from the grit of surviving in this world. At a Trashy Annie show, you should feel less like you’re at a concert where you’re expected to do concert things, and more like you’ve stepped into a dress-up box that comes with the world’s best playlist and a dance floor. At a Trashy Annie show, you are free to just… be. “I got one comment from a fan really early, and the message I got… I'll never forget it. They said, ‘your music makes me feel less alone.’ I'm going to be in this forever, because if somebody out there feels like that, even one person? It's so important for me. I connect through this music, and when I feel like I can say something that people relate to, it's my reason to be doing this. It makes me want to write from my guts and from my heart and not be afraid to talk about stuff.” You can wear the velvet jumpsuit and cat ears, and freely shake your ass to the music the way you’ve wanted to your whole life, because the whole audience will be participating in their own version of doing the exact same thing. The collective audience experience is one of moving and sweating together as you loudly sing along with music about having a glass eye and tipping your musicians. It doesn’t matter if you can’t carry a tune in a bucket, if you’re openly celebrating your authentic self as you sing along with Trashy Annie and the boys, you’re doing it right. That underground show in the old hotel in Austin was small, but it sure packed a punch. Watching the audience take in the sounds coming from the stage, and witnessing the way each and every person there felt seen, celebrated, and safe… is there anything else that can be asked of a musician? What began with a little girl clutching a trumpet in band class has grown into something so much bigger and more beautiful than little Annie ever could have dreamed. Her relentless pursuit of chasing down her own identity led to so many more people learning to do the same. Trashy Annie is a band, yes. But it’s more than that: it’s a movement that elevates the pursuit of honesty and the celebration over fame and fortune. “We feel the best about ourselves when we conquered something that we didn't think we could do, you know? Every once in a while we have a show that's really well attended, people are into it, and all the stuff is happening. And three or four years ago, I never, ever would have envisioned myself doing this thing. And now … it's fulfilled me in such a powerful way.” The show that night in Austin ended with candles on a birthday cake being blown out by her bass guitarist. Here’s hoping that we all get our wish, because the world needs to get a little more trashy. Editor’s Note:As of today (May 9th), Trashy Annie has released a new single. Annie’s turned her love for the Paul Simon hitMe and Julio Down by the Schoolyardinto a rhythm driven cover of the classic.Me and Julio Down By The Schoolyard— the Trashy Annie version— is now available for streaming here:https://ffm.to/meandjulio Catch Trashy live at 21 Rock in Arnold on July 26, 2025 — right after the local bike event! Come as you are and leave even more yourself. **Tags:** **About The Author** **You Need To Calm Down** **You Need To Calm Down** **Trending in Music** You Need To Calm Down By JD Davis and RFT Writers You Need To Calm Down By JD Davis and RFT Writers Kris Kristofferson, Modern Renaissance Man, Dead At 88 By JD Davis and RFT Writers Kris Kristofferson, Modern Renaissance Man, Dead At 88 By JD Davis and RFT Writers Best Laser Hair Removal In St. Louis, According To Our Readers By RFT Writers Best Laser Hair Removal In St. Louis, According To Our Readers By RFT Writers Movember: OnlyFans Johnny Sins Men’s Sexual Health Campaign Had Over 150 People On Set By Hazel Hawke Movember: OnlyFans Johnny Sins Men’s Sexual Health Campaign Had Over 150 People On Set By Hazel Hawke Local St. Louis News Things to Do Food & Drink Music Movies More Best Of St. Louis St. Louis Guides After Dark Reeferfront Times Local St. LouisNewsThings to DoFood & DrinkMusicMovies News Things to Do Food & Drink Music Movies News Things to Do Food & Drink Music Movies MoreBest Of St. LouisSt. Louis GuidesAfter DarkReeferfront Times Best Of St. Louis St. Louis Guides After Dark Reeferfront Times Best Of St. Louis St. Louis Guides After Dark Reeferfront Times All material © 2025 Riverfront Times, St. Louis, MO. All rights reserved."}