{"id": 476, "name": "KMSP - Fox 9 - Minneapolis", "domain": "fox9.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.fox9.com/tag/crime-publicsafety/george-floyd-death/after-george-floyd", "title": "Crime Publicsafety", "content": "Live News Weather Sports Things to Do Contests More Local News National News World News Investigators Politics Consumer FOX News Sunday FOX 9 Weather App Forecast School Closings Live Weather Cameras Traffic FOX Weather Vikings Gophers Twins Wild Timberwolves Lynx United Aurora Shayne Wells Garden Guy Recipes Personal Finance Business Stock Market Small Business Savings FOX Shows The Jason Show FOX 9 Good Day All Day Enough Said Vikings Gameday Live The PJ Fleck Show FOX 9 Sports Now Taste Buds The Afternoon Shift The Jason Show Swag Shop The FOX 9 Store Milwaukee News - FOX 6 News Chicago News - FOX 32 Chicago Detroit News - FOX 2 Detroit Contact Us Contests Personalities Jobs at FOX 9 What's On FOX Advertise FCC Public File FCC Applications How to stream FOX LOCAL Mobile Newsletter Facebook Instagram Twitter TikTok YouTube **After George Floyd** **National Guard soldier reflects on George Floyd unrest deployment** A former Minnesota National Guard solider is opening up about her deployment to assist with security amid rioting and looting following the police killing of George Floyd in 2020. **National Guard soldier reflects on George Floyd unrest deployment** It's been five years since the Minnesota National Guard had to be deployed after civil unrest in Minneapolis due to rioting following George Floyd's death. **Minneapolis’ 3rd Police Precinct burned 5 years ago. This is what it looks like now.** The Minneapolis police precinct that was abandoned during the protests and riots that followed George Floyd’s murder in 2020 is currently being renovated and will soon be re-purposed into an election hub and community center. **Lake Street businesses destroyed in George Floyd riots rebuild** It's been five years since George Floyd's death in Minneapolis, and businesses along Lake Street damaged or destroyed in the rioting are still in the rebuilding process. **MPD chief addresses efforts to rewrite history after George Floyd’s murder: 'Everyone knew what they saw'** The current and former chiefs of the Minneapolis Police Department are pushing back on efforts to rewrite history five years after the murder of George Floyd. **DOC 9 presents: After George Floyd** Five years after the murder of George Floyd, FOX 9 journalists examine what has--and hasn't--changed since May 25, 2020. This one-hour documentary includes in-depth conversations with neighbors and police about the city's efforts to move forward at George Floyd Square and with the state's consent decree that requires fundamental changes within the police department. **After George Floyd** George Floyd’s murder in Minneapolis sparked protests, civil unrest and calls for police reform across the country. Five years later, FOX 9 examines what has –and hasn’t – changed since May 25, 2020. **Businesses left struggling 5 years after George Floyd’s murder** The city council and Minneapolis mayor haven’t agreed on how to transform the space and business owners say it is costing them their jobs. **George Floyd Square businesses continue to struggle** The argument about George Floyd Square has impacted businesses tremendously. FOX 9's Symone Woolridge has the full story. **After George Floyd: What is happening at George Floyd Square?** Sunday will mark five years since George Floyd was murdered at 38th and Chicago in Minneapolis, and former officer Derek Chauvin was convicted in his death. FOX 9's Symone Woolridge gives an update on how the incident has impacted the community and beyond. **George Floyd’s murder shook the country. Can his mural help it heal?** As protests and riots swept over Minneapolis after the murder of George Floyd in 2020, an iconic painting emerged as a destination for healing. Five years later, one of the artists who created the colorful mural reflects on the impact it has had in a “sad place to be.\" **After George Floyd: The Mural** To mark the 5-year anniversary of George Floyd’s murder, FOX 9 has been speaking with many people in the community as part of its \"After Floyd: 5 years, 5 stories\" series airing every night at 9 p.m. This episode focuses on the now-famous mural found at George Floyd Square. **After George Floyd: FOX 9 Documentary explores police reforms 5 years later** George Floyd’s murder in Minneapolis sparked protests, civil unrest and calls for police reform across the country. Five years later, a FOX 9 documentary examines what has – and hasn’t – changed since May 25, 2020. **If Trump Administration walks away from consent decree, MPD reforms all on state** The Trump Administration could decide this week whether it will continue to pursue a federal consent decree with the Minneapolis Police Department. **DOJ could decide about federal consent decree with MPD** The Trump Administration could decide this week if they will pursue a federal consent with the Minneapolis Police Department. FOX 9's Symone Woolridge. **At George Floyd Square, these officers hope to build trust in MPD** Five years after the murder of George Floyd exposed the depths of mistrust in the Minneapolis Police Department, two officers are walking a new beat in an area that still feels forgotten. **George Floyd Square: Officers try to building trust** Five years later after Floyd's death, we followed along with Minneapolis police on the beat at George Floyd Square to see how officers are trying to rebuild trust. **Latest News** **Isle Royale camping deaths: FBI assisting in investigation of two found dead** **Hiker missing in India, San Francisco family desperate to find him** **Woman, 66, hit by car that drove into downtown protest crowd, CPD says** **National Guard in LA: Why is Newsom suing the Trump administration?** **Enough fentanyl to kill 4 times Georgia's population: Massive drug bust** **Trending** Local News National News World News Investigators Politics Consumer FOX News Sunday FOX 9 Weather App Forecast School Closings Live Weather Cameras Traffic FOX Weather Vikings Gophers Twins Wild Timberwolves Lynx United Aurora Shayne Wells Garden Guy Recipes Personal Finance Business Stock Market Small Business Savings FOX Shows The Jason Show FOX 9 Good Day All Day Enough Said Vikings Gameday Live The PJ Fleck Show FOX 9 Sports Now Taste Buds The Afternoon Shift The Jason Show Swag Shop The FOX 9 Store Milwaukee News - FOX 6 News Chicago News - FOX 32 Chicago Detroit News - FOX 2 Detroit Contact Us Contests Personalities Jobs at FOX 9 What's On FOX Advertise FCC Public File FCC Applications How to stream FOX LOCAL Mobile Newsletter Facebook Instagram Twitter TikTok YouTube facebook twitter email New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File Jobs at FOX 9 Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"}