{"id": 1621, "name": "Washington's Top News (WTOP)", "domain": "wtop.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://wtop.com/local/2025/06/kilmar-abrego-garcias-lawyers-human-smuggling-charges-are-pure-farce-md-suit-should-continue-until-the-government-is-held-accountable/", "title": "Kilmar Abrego Garcias Lawyers Human Smuggling Charges Are Pure Farce Md Suit Should Continue Until The Government Is Held Accountable", "content": "Headlines Local NewsClick to expand menu.VirginiaClick to expand menu.AlexandriaArlingtonFairfax CountyLoudoun CountyPrince William CountyStafford CountyMarylandClick to expand menu.Anne Arundel CountyBaltimoreCalvert CountyCharles CountyFrederick CountyHoward CountyMontgomery CountyPrince George's CountyDCCrime NewsMatt About TownWeather NewsTransportation News VirginiaClick to expand menu.AlexandriaArlingtonFairfax CountyLoudoun CountyPrince William CountyStafford County Alexandria Arlington Fairfax County Loudoun County Prince William County Stafford County MarylandClick to expand menu.Anne Arundel CountyBaltimoreCalvert CountyCharles CountyFrederick CountyHoward CountyMontgomery CountyPrince George's County Anne Arundel County Baltimore Calvert County Charles County Frederick County Howard County Montgomery County Prince George's County DC Crime News Matt About Town Weather News Transportation News VirginiaClick to expand menu.AlexandriaArlingtonFairfax CountyLoudoun CountyPrince William CountyStafford County Alexandria Arlington Fairfax County Loudoun County Prince William County Stafford County Alexandria Arlington Fairfax County Loudoun County Prince William County Stafford County MarylandClick to expand menu.Anne Arundel CountyBaltimoreCalvert CountyCharles CountyFrederick CountyHoward CountyMontgomery CountyPrince George's County Anne Arundel County Baltimore Calvert County Charles County Frederick County Howard County Montgomery County Prince George's County Anne Arundel County Baltimore Calvert County Charles County Frederick County Howard County Montgomery County Prince George's County DC Crime News Matt About Town Weather News Transportation News NationalClick to expand menu.National Security National Security National Security World Business & FinanceClick to expand menu.ConsumerReal EstateRecalls Consumer Real Estate Recalls Consumer Real Estate Recalls GovernmentClick to expand menu.CongressSupreme CourtWhite HouseToday on the Hill Congress Supreme Court White House Today on the Hill Congress Supreme Court White House Today on the Hill LifestyleClick to expand menu.Animals & PetsFood & RestaurantsHealth & FitnessLife & StyleParentingTravel Animals & Pets Food & Restaurants Health & Fitness Life & Style Parenting Travel Animals & Pets Food & Restaurants Health & Fitness Life & Style Parenting Travel Entertainment SportsClick to expand menu.Baltimore OriolesBaltimore RavensDC UnitedWashington CapitalsWashington MysticsWashington NationalsWashington CommandersWashington Wizards Baltimore Orioles Baltimore Ravens DC United Washington Capitals Washington Mystics Washington Nationals Washington Commanders Washington Wizards Baltimore Orioles Baltimore Ravens DC United Washington Capitals Washington Mystics Washington Nationals Washington Commanders Washington Wizards ScienceClick to expand menu.The Space Place The Space Place The Space Place Photo Galleries WTOP Noticias Advertise on WTOP Federal News Network Fun & Games WTOP Insights News Traffic Weather **Back in the US, still not home: Kilmar Abrego Garcia facing human smuggling charges in Tennessee** Neal Augenstein|naugenstein@wtop.com June 9, 2025, 10:00 AM Share This: share on facebook share on X share on threads share on linkedin share on email print Now facing federal human trafficking charges in Tennessee, lawyers for Kilmar Abrego Garcia, the Salvadoran national who was living in Prince George’s County before being wrongly deported, said his Maryland lawsuit should continue “until the Government is held accountable for its blatant, willful, and persistent violations of court orders at excruciating cost to Abrego Garcia and his family.” Last Friday,Abrego Garcia was returned to the U.S. to face criminal charges related to what the Trump administration said was a large human smuggling operation that helped transport immigrants who were in the United States illegally. As Attorney General Pam Bondi announced the unsealing of a grand jury indictment, an acting assistant attorney general filed a motion in federal court in Maryland, saying the U.S. had “complied with the Court’s order, and indeed have successfully facilitated Abrego Garcia’s return.” In addition, Yaakov Roth, said Abrego Garcia’s suit against the government “should be dismissed as moot.” However, in a motion filed Sunday in federal court in Greenbelt, Maryland, Abrego Garcia’s attorney Andrew Rossman wrote the idea that the Trump administration complied with the court’s order “is pure farce.” Abrego Garcialived in the U.S.for roughly 14 years, during which he worked construction, got married and was raising three children with disabilities, according to court records. Trump administration officials said he was deported based on a 2019 accusation from Maryland police that he was an MS-13 gang member. Abrego Garcia denied the allegation and was never charged with a crime, his attorneys said. In the newly-filed motion, Abrego Garcia’s lawyers said the federal government has “engaged in an elaborate, all of government effort to defy court orders, deny due process, and disparage Abrego Garcia.” His attorneys said the federal government only began developing the human trafficking case against Abrego Garcia under threat of sanctions. And the decision to return him to Tennessee, rather than Maryland didn’t comply with the U.S. Supreme Court directive to “ensure that his case is handled as it would have been had he not been improperly sent to El Salvador.” Even with Abrego Garcia in Tennessee, and facing criminal charges, his lawyers said the Maryland court is still in a position to impose sanctions, and the plaintiffs “are entitled to examine in discovery whether Government officials acted in good faith.” As of Monday morning, the federal government had not filed a response to Abrego Garcia’s objection to its request to dismiss the suit. The Associated Press contributed to this report. Get breaking news and daily headlines delivered to your email inbox by signing uphere. © 2025 WTOP. All Rights Reserved. This website is not intended for users located within the European Economic Area. Neal Augenstein has been a general assignment reporter with WTOP since 1997. He says he looks forward to coming to work every day, even though that means waking up at 3:30 a.m. @AugensteinWTOP **Related News** **Bear with a taste for the burbs is relocated — again** **DC’s fireboat is back on the water after years of repairs are completed** **Md., DC join fight to outlaw devices that effectively turn semiauto guns fully automatic** **Recommended** **Trump plans to attend 'Les Misérables' at the Kennedy Center after taking over the institution** **Veterans are divided over the Army's big parade, being held on Trump's birthday** **Anti-Trump protests in DC area will coincide with military parade** **Related Categories:** **Tags:** 5425 Wisconsin AveChevy Chase, MD 20815 hello@wtop.com 202.895.5000 Copyright © 2025 by WTOP. All rights reserved. This website is not intended for users located within the European Economic Area. About Us News Philosophy News Team Careers Advertise Contests Contacts News Tips Charities Events Press Podcasts Federal News Network **Sign up for or manage your WTOP email subscriptions** Feedback Privacy Policy Terms of Use Copyright Hubbard Radio DMCA Notice EEO FCC Public Inspection Files FCC Applications Do Not Sell My Info – CA Resident Only"}