{"id": 850, "name": "Public Accountability Initiative", "domain": "littlesis.org", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://littlesis.org/news/archiving-our-movements-how-power-research-supported-the-fight-to-save-philadelphias-chinatown/", "title": "Archiving Our Movements How Power Research Supported The Fight To Save Philadelphias Chinatown", "content": "AboutProgram AreasTeamJobsContact Program Areas Team Jobs Contact Program Areas Team Jobs Contact DatabaseInformation Review Form Information Review Form Information Review Form ResearchReportsNews: Eyes on the Ties Reports News: Eyes on the Ties Reports News: Eyes on the Ties TrainingsUpcoming TrainingsPast Trainings Upcoming Trainings Past Trainings Upcoming Trainings Past Trainings ResourcesLittleSis Power Research DatabaseMap the Power ToolkitPowerlines MicrositeBig Tech Sells War#AllEyesOnYass MicrositeFossil Fuel Finance HubNewsletters LittleSis Power Research Database Map the Power Toolkit Powerlines Microsite Big Tech Sells War #AllEyesOnYass Microsite Fossil Fuel Finance Hub Newsletters LittleSis Power Research Database Map the Power Toolkit Powerlines Microsite Big Tech Sells War #AllEyesOnYass Microsite Fossil Fuel Finance Hub Newsletters Press Research News **Archiving Our Movements: How Power Research Supported the Fight to Save Philadelphia’s Chinatown** The “No Arena in Chinatown” movement swept through the city, bringing together youth, labor, community organizations, and civic groups, to build one of the broadest multi-racial, cross-class coalitions the city has seen in decades. Interview with Debbie Wei, Save Chinatown Coalition In a shocking turn of events, the Philadelphia 76ers announced in January that they were abandoning plans to build a new basketball arena just south of Philadelphia’s historic Chinatown neighborhood. Their proposal faced major opposition from people across Philadelphia who opposed city leaders handing over subsidies and favors to major corporations and billionaire developers while residents face severe housing shortages and cuts to public programs. Since 2022, the “No Arena in Chinatown” movement had swept through the city, bringing together youth, labor, community organizations, and civic groups, to build one of the broadest multi-racial, cross-class coalitions the city has seen in decades. The plan to build the new sports arena in the heart of the city had already secured support from the city’s mayor, the majority of city council, and other power brokers. It was set to be financed by a powerful set of investors and developers, despite its broad unpopularity among Philadelphians. When the arena plan was suddenly abandoned, it surprised many. But the on-the-ground organizers fighting this project knew that if they kept their eyes on the prize and continued to build opposition against the plan, victory was not only possible but just a matter of time. At the heart of this organizing is Debbie Wei, a longtime activist, educator, and organizer in Philadelphia. She is the co-founder ofAsian Americans Unitedand has been a part of campaigns across the city for decades. In March we sat down with Debbie at Ray’s Cafe in Philly’s Chinatown to talk about the role that research played in building a case against the proposed plan, and how decades of organizing led to this major victory for activists who faced down some of the city’s most powerful people and institutions. How did the organizing for “No Arena in Chinatown” begin? Who were the different communities, groups, stakeholders that you all were connecting with to help push the organizing off the ground? Well, fortunately, or unfortunately, Chinatown has had a long history of having to fight off projects like this. So it was almost like the usual suspects were coming together. Once we heard everybody got on the phone with each other and said, “Damn, we have to do it again.” Major organizations anchoring this wereAsian Americans UnitedandAsian Pacific Islander Political Alliance (APIPA). And they used their staff time, which should have been spent on other things, and a raft of volunteers, me being one of them, to start to get together and brainstorm. And initially the research had to come from us, because we didn’t know what this was, or what we’re getting into. We knew that arenas had decimated Chinatowns in Seattle and in Washington, DC. We saw what happened at the Staples Center in LA. So we already knew that this was not a good thing for us. But we didn’t know much else. We didn’t know the borders [of the proposed development project]. We didn’t know who the developers were. We found out about this the way the whole city found out – through a newspaper article. We started by trying to put together facts and statistics around what we did know. We started to do opposition research. That was something I largely took on, where I was just trying to see who the hell were these developers, and I quickly was like, “oh, these are very, very bad players.” These are probably the biggest people that we’ve ever had to take on. Our last big fight was maybe the casino in 2008. That was before Wall Street crashed. That was before the rise of private equity investment and mega corporations likeBlackstone Group. This is a new beast that our communities are facing. It was easy to see that we were not going to get the politicians on this one. We knew we weren’t going to get the mayor. She ran on a pro-arena stance. We knew we couldn’t get the City Council. Chinatown would never be able to win a political fight. We have to think strategically in other ways. We did some reading about Community Benefit Agreements (CBAs) and how they’re used to buy off communities. We looked really hard at what happened in Brooklyn [around the Barclay’s Center]. We had to make sure that people had all the facts … [the developers] were courting elements in Chinatown and throwing out $50 million figures and trying to cut a CBA deal. We had to mount a collective resistance in Chinatown that was strong enough that the community would collectively refuse. One thing that benefited us was our reputation. So much of our organizing is relationship-based and over the years of doing this we’ve been able to build deep relationships with … everyone from undocumented folks to non-English speaking Chinese residents to PhDs, you know, heads of departments in different universities across the country. So we were lucky in that aspect, I think fighting this many times over this many years has helped us lay that groundwork. How did you all approach research in the beginning of the campaign? We have good relationships with lots of folks. So we did get the majority of Chinatown to oppose. The rest of Chinatown came along six months later. The major organization, Philadelphia Chinatown Development Corporation (PCDC), which has a large voice in the government of Philadelphia finally came out against the arena in March. The same day that they announced they were going to oppose the arena, the Sixers held a press conference, announcing that they got support from the Black Clergy of Philadelphia and the African American Chamber of Commerce. And that’s when we knew they were pulling out the racial politics. We quickly realized we couldn’t win without a united Chinatown, but we also couldn’t win with only Chinatown. We needed the city to understand this project and to oppose it. That’s when we started thinking through, well, how can we use a research team? Now there was another committee that had formed early on called the ‘Technical and Planning Committee’ because they were looking at some of the more technical aspects of this development project – around feasibility and traffic and all that kind of stuff. That was a powerhouse committee, we had the former commissioner for [the Department of] Streets on that committee. We then started to do research going back to the core committee around the neighboring Registered Community Organizations (RCOs)(civic groups in Philadelphia), …because we knew this would decimate Chinatown, [and] it could screw with anything within like a two mile radius. So we started setting up meetings with these RCOs. We had monthly meetups where so many people wanted to volunteer to fight this thing and we didn’t know how to bring them in, but we also didn’t want to lose their passion. So another organization was formed – it’s called the No Arena Chinatown Solidarity (NACS) group. They became like the action arm of the movement. So there’s like the strategy arm that was like us in the very beginning and then quickly the action arm started. There’s an organization called the Jewish Federation Real Estate Group that was started by [Sixers arena developer] David Adelman. Answer found out that he was giving himself and [fellow developer] Josh Harris an award at a breakfast event and I’m like, “Oh no!” And they had it all over the press and the papers and it was an award for envisioning this wonderful arena that we were organizing to stop. So I was like, “We gotta protest this thing.” And then I stopped and I thought it might be a bad look for a group of Chinese people to protest outside of a Jewish event. So I called a few Jewish organizer friends of mine and I explained the dilemma and they said, “We got you.” And so they were out front, they were brilliant. They had signs, like “It’s a shanda” [It’s a shame!]. They had a klezmer band. They were fabulous. Their next event was carolling in Chinatown and the Jewish community came down to Chinatown on Christmas day to support this action. NACS continued to create a number of committees, the outreach committee had started to table all over the city at different events. We started a postcard campaign. We started petition signing. We had an art hive that came out of NACS that was doing the banner creation and designing all the signs for actions. Someone in the technical committee put together all these really good facts about the project, but we wanted to make them digestible. So we created what we came to know as “one pagers”. We had to distill everything into one page. That one page has to try to explain these points as graphically as possible for a wide audience. We started using those to educate people. As part of outreach we started to do weekly City Council visits. So they’d be in City Council every week holding up signs, but after Council session broke, we would go to their offices with our one pagers. We would talk to whoever was there and we would give them the facts so they couldn’t say they didn’t get the facts! So at one of the monthly meetups, I realized there was way too much research that we couldn’t handle on our own. And most importantly, we had filed a slew of Right-to-Know requests. We filed 91 Right to Know requests and the city denied every single one of them in a single letter. I didn’t know about the appeals process. I was like, what do we do now? Eventually the Penn Carey law clinic and then the Asian American Legal Defense and Education Fund in New York volunteered to be pro bono attorneys for us. They resubmitted all the right to know requests on our behalf. We started to get some responses in, but you know how that goes? So at one of the meetups I said, I pointed out that we really have a need for a research committee. We need a bunch of people who can read through the Right-to Know documents, summarize them, and help point out some of the salient things that are coming through. We had a few people with project management skills volunteer to chair and lead the committee and it all came together. What I love about the Research Hive is that they’re like – we joke about it lovingly – the introverted, wonky arm of the movement. The people that, you know, don’t want to be out front, but they are passionate about research. They like to go down rabbit holes, like, you know, like a weasel. So that’s how the Research Hive started. How did the Research Hive grow and shift over time? Another thing that’s great about the Research Hive is that they’re not just similar kinds of people, but they also spin in similar circles, meaning a lot of them are graduate students, some of them are professors, many are post-docs. They live and breathe research. And so they also have friends that live and breathe research that they can bring into the fold and into the campaign. So the hive was expanding pretty rapidly. They did an incredible amount of work and were great at bringing new people in. In the initial reach outs to RCOs. I was trying to get meetings set up to talk about the arena project. I did presentations on my own with the information I had at the time, and they voted to oppose [the arena]. So that was good. But we also had heavy hitter RCOs, like Washington Square West that were critical and more challenging in some ways. You have to figure out how to get different neighborhoods with different kinds of power involved in our fight, like the Gayborhood and Society Hill. Because it doesn’t matter if only poor communities are opposing this thing. They don’t care. But if some of the wealthier neighborhoods are opposing this, then it helps the campaign. So the Research Hive helped put together more presentations that distilled all their research to support this effort to bring in more neighborhoods. They created an incredible presentation that they took on the road to different RCOs. I was asked to speak at this thing for Women’s Way, and I asked the Executive Director of Women’s Way, “hey, do you think you could do an information session on the arena with the other philanthropic organizations in town?” and she said, “sure, I’d be happy to.” So she organized [an information session] – we were hoping to get, like, the Philadelphia Foundation and people like that to come. Ultimately, they did not come. But the Research Hive gave the presentation to a number of smaller groups that came and suddenly they are starting to blossom as a more public-facing part of the campaign, which came as a pleasant surprise to us all! Eventually it evolved into presenting research during the City Council hearings. Our Research Hive members became some of the expert panelists that we presented during these critical public forums. So their research was really instrumental to winning over more neighborhoods and groups across the city. What were some examples that stand out to you about really effective research in the campaign? Once we started research we started to draw the complexities of Jefferson Hospital. We started digging into ambulance response times and the trauma center and then before we knew it, we had a Medical Hive. The Medical Hive was made up of a lot of medical students, doctors, nurses who provided additional information about the potential impacts of the arena on their work and started to become more outspoken. I’m not going to be naive and think that people in Philadelphia actually give a shit about Chinatown. But I think when we started bringing in the medical angle it started to make people think about how this isn’t JUST about saving Chinatown, but how this kind of development project touches everyone in the city. We started talking about life and death issues – you never know what things will speak to different people. I realize the other thing that made our Research Hive really successful is that they created their own community. The hive gets together for socials. They like each other’s company. If you look at our group chat, it’s hilarious because [they] share jokes about dialectics and I’m like, this is the only group that finds dialectics funny! But you know, having this sense of community after we beat the arena, they didn’t want to stop meeting. They are still meeting. We’re also extending our work together to other community fights We havePhillyThriveand their fight [against] Hilco and you know, some [Research Hive] members are working on that. We finally got a Right-to-Know dump from [Councilmember] Squilla’s office and some members are working on that. So folks still get together. I think at least in these times where everything is so grim, that sense of community – without that – it’s hard to keep going. It’s hard to not feel overwhelmed. But I think having a community that’s created that you know, can laugh together and can get excited around facts together is also really fundamental to the success of our research team. How did organizing, research, communications, strategy and action all interact in the campaign? Were the same people working together or were there different working groups for each? The one paid person in this whole campaign was our communications person. She was fabulous, absolutely fabulous. I highly recommend getting a professional comms person because they know the reporters, they know the lay of the land. For movement stuff, you need a comms person whose heart is movement-based. We were lucky we found someone who committed. So there were like several arms of communications that were going on. Social media – NACS, Students for the Preservation of Chinatown, Students against the Sixers Arena – that was a high school group – they had their own Instagram handles. And AAU had API and then No Arena, the Save Chinatown Coalition had one. So like there’s all these different Instagrams going. So one of the things we said early on in the coalition was that we have a strategy group and we need other groups to check in with the strategy group so we don’t inadvertently do things that could tank the broader strategy and goals. But other than that, you have full autonomy. So some of the stuff that you were seeing came out of comms, some of it came out of NACS and the Research Hive, some of it came out of just various people finding out different things and creating messaging around it. We also had an Art Hive, which was a lot of young people – high school and college students. I’m sixty seven, I don’t know a reel from a story on Instagram. I learned quickly like I never wanted to go on Twitter and I ended up having to go on Twitter for the campaign. What a horrible thing. But I was on Twitter, right? We were trying to push things out on places like Twitter because that’s what the reporters read, right? As well as politicians. And then in our community in Chinatown we went straight to old school printing our own newspapers and putting out bilingual one-pagers and having youth run around the community and deliver them. So we were trying to find all the different ways to push things out to different people and groups. Our communications lead served as a clearing house for public messaging to make sure that what we were saying was clear, to make sure that we were aligned around how we were talking about things. Because this was such a big fight and very complex with a lot of moving parts, that we needed to make sure we were always moving in the same direction. Our research, when we got it, would go through the strategy committee and comms sat on that strategy committee. And then we would say which pieces we think would be good to make public. I think what made our research effective was that it was embedded in a larger organizational structure. That was how the different pieces worked together. It’s hard to think about them as separate, because we were so symbiotic. It’s not like we can even say that something worked because of the research or because of social media because it was like all of it working together. We also knew that for developers, time is money, and that if we could drag it out,– it would jack up the expense for them. It would make it harder for them to meet their deadlines. If we made it toxic, it might be hard to get funding if it keeps getting delayed and met with resistance. We started organizing at the state level, getting state senators to commit to not approving any state money for the arena. Governor Shapiro came out and agreed with that. So we were starting to cut off their sources of funding behind the scenes. The developers didn’t know what we were doing. We were very busy bees. I think ultimately it was our delay that killed the project. I believe that in my heart and soul. Ultimately, we did make it toxic. One of the things I think that became clear was how profoundly dysfunctional city government is because the entire city could see — the entire city could see the breadth of the opposition. The entire city could see the facts that were being presented to them. We even hired the Mayor’s own polling company to conduct an independent poll and that came up with 70% of the city opposing the arena project. We made this thing toxic. For new movement researchers out there, what advice do you have for encouraging them to get started? I think one of the things I’ve realized is that there’s different kinds of research. For instance, some of the old ladies in Chinatown are the best researchers. They give us inside information about the community, about the people, about who’s leaning what way or who’s saying what things. Sometimes there’s the wonky stuff that is above our heads, but there’s the human side of research. Because all of us, any good movement I think has to be about relationships. It has to be led by people that have relationships. I mean, any community based movement, like communities, are their own mechanism and organism. Sometimes we silo research as just this technical thing, and we forget that some of our best researchers are sitting in the barbershop or dancing on weekends with the other aunties, you know, like some of our best researchers are our own people. It’s something I don’t ever want to forget. I think you have to be embedded in a movement, so part of it is just showing up to different events and like making connections and meeting people and then offering your skills when they’re useful. I think a lot of folks don’t realize actually what research can do or how research can help frame a story. So I think there’s just something about being embedded in a community that helps to make sure that the research is answering the questions that the community needs answered but also helping them to land the questions that they need to be asking. I really think these are the times that we’re gonna need to talk, we’re gonna need all of them, it’s scary as hell. What’s really interesting to me is as compelling as all our research was they still voted for the damn thing! That’s not to say that the research was useless, the research was incredibly helpful to build a movement and I think these are the times where we need to build movements. We can’t expect that any governmental body is gonna have our backs. Cultural programming seemed to be such an important part of the “No Arena in Chinatown” campaign? Can you tell us a bit about that? I mean, the one thing about Chinatown that I love, because we’re 150 years old and we’ve been fighting shit for like 60 years at least…and at the same time as a culturally marginalized community we have to create the spaces for cultural expression and in fact even things like cultural maintenance is an act of resistance especially in the current America. I think so much of the arts and artistic expression is just embedded here almost by necessity – how do we keep our cultural rootedness especially as this is all happening in the context of COVID when everything was about the “Chinese flu” and some people were afraid to walk down the street because they would get assaulted. What does it mean to have an Asian face in this country at this time? What does it mean to have a community where you finally feel safe, the only place in the city where you can feel safe to just speak your home language? I think it’s also – like, it would suck to always be serious and wallowing in the possible destruction of our community. You have to find spaces of joy, you have to find spaces where you can celebrate and I think arts and culture does that for us. I think actually we have a great sense of humor. I mean, some of our stuff is just very funny, it makes us all laugh. I think one of the most beautiful things I have to say that came out of this movement is – one of the things that we always tell people is we believe resistance is a tradition in this community. With my kids, I give them red envelopes on the New Year, mooncakes on the Mid-Autumn Festival and when we’re under attack you come up and hit the streets. That’s just what we do, we hand it down. So my daughter, who was in college at the time, and her best friend from childhood co-founded Students for the Preservation of Chinatown (SPOC). So SPOC started by just organizing on campus and then because all three of the developers have ties to [University of Pennsylvania], really focusing on Penn. But they also took to heart something that we’ve always said – fight the things you don’t want but don’t forget to build the things you do want. They were sitting around saying “we’re not going to move Penn…this is ridiculous what can we do for our community?” They were organizing youth and they organized them so well that the high school students created their own organization Students Against the Sixers Arena (SASA). We’ve got cuts to school programming, we’ve got public parks that play sound that drives youth away, we’ve got rec centers cutting back on hours and we have a fricken fashion district that won’t let anyone under 18 walk in. They were like we need a third space for youth. So they created a youth center called theGinger Arts Center. This came from this movement. It came from them dreaming about how we build our community, how do we not just fight things that are attacking us but how do we, even as young people, contribute to the health of our community. It’s the most beautiful little center. It’s all volunteer run, they take shifts, they do everything. They raise the money to pay the rent and to buy art materials. They have a level of programming that is like through the roof. I love that that movement can also be generative in that way. Any movement against something also carries a dream of what could be or should be. Being able to enact those things out of the movement is really so special to me. CERAWeek, the 'Superbowl of Energy' - A Spectacle of Billionaire Power to Advance Fossil Fuels **Sign up for our Email Newsletter** **Support Us** About Database Research Trainings Resources Press Twitter Instagram Facebook Contact Site Credits Privacy Policy"}