{"id": 1947, "name": "Dollar Collapse", "domain": "dollarcollapse.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://dollarcollapse.com/connor-okeeffe-the-federal-judiciarys-war-on-trump-is-not-about-protecting-us-from-government-overreach/", "title": "Connor Okeeffe The Federal Judiciarys War On Trump Is Not About Protecting Us From Government Overreach", "content": "**\"We Track the Financial Collapse For You, so You'll Thrive and Profit, In Spite of It... \"** Δ Home Top Videos Breaking News Gold NewsGold IRA Investing Gold IRA Investing Gold IRA Investing Gold-Backed Cryptos AboutContributeContact Contribute Contact Contribute Contact Home Top Videos Breaking News Gold NewsGold IRA Investing Gold IRA Investing Gold IRA Investing Gold-Backed Cryptos AboutContributeContact Contribute Contact Contribute Contact **\"We Track the Financial CollapseFor You,so You'llThrive and Profit, In Spite of It... \"** Δ **Connor O’Keeffe: The Federal Judiciary’s War on Trump Is Not About Protecting Us from Government Overreach** Bryan Lutz June 5, 2025 12:49 pm 5 Comments Most of Trump’s campaign promises have been cancelled by the Federal courts. The reason is… They’re protecting from government overreach. At least, that’s what they say, or that’s how they see their role. And, in fact, that is the classical role of the legal system in the whole formation of a nation-state. There are generally three major institutions used in the formation of a nation: Parliament / Congress Legal System And the Mainstream Media For the most part, congress has been on Trump’s side, and he’s had major control of the mainstream media. He’s barred certain media outlets from the White House Press Room, and he pretty much runs a reality TV show from the Oval Office to his own benefit. But the courts… The courts are where the buck has been stopping. Generally, the courts would not block the efforts of the President Americans elected, but they are. According to Connor O’Keeffe, “In May alone, federal courtsruled againstthe Trump administration in 96 percent of the cases brought before them. And while that was a particularly dramatic month, the administration’s loss rate for the entire term so far still stands at a staggering 77 percent. Nearly every one of Trump’s central campaign promises has either been tied up in the courts or blocked entirely by lone federal judges. Everything from the deportation of illegal immigrants, the enactment of tariffs, and the defunding and cutting of federal agencies have come under attack by the federal judiciary.” It seems like Trump’s bulldozing, record-breaking amount of executive orders aren’t dismantling the Deep State the way he’d like to. And as I’ve been talking about, he’s not reducing spending either. In this article, O’Keeffe argues that the courts aren’t for the people. They’re for the preservation and growth of government. Are the courts against the people? Are they responsible for the lack of change, and eventually, the collapse of the West? O’Keeffe implies, “The courts are our enemy.” Originally posted by Connor O’Keeffe on Mises.org: So far, in his second term, Donald Trump’s biggest headaches haven’t come from the Democrats or his fellow Republicans. Nor have they come from the groups that were his biggest enemies in his first term—the media, federal bureaucrats, or the intelligence agencies. This time around, Trump’s biggest difficulties are coming from the courts. “The Resistance” has been celebrating the judicial branch as the tip of the spear in the effort to thwart the president’s agenda—and for good reason. In May alone, federal courtsruled againstthe Trump administration in 96 percent of the cases brought before them. And while that was a particularly dramatic month, the administration’s loss rate for the entire term so far still stands at a staggering 77 percent. Nearly every one of Trump’s central campaign promises has either been tied up in the courts or blocked entirely by lone federal judges. Everything from the deportation of illegal immigrants, the enactment of tariffs, and the defunding and cutting of federal agencies have come under attack by the federal judiciary. The battle between the Trump administration and the courts is quickly becoming the defining dynamic of this second Trump term. It may be tempting for opponents of big government to find much of what the federal judiciary is doing commendable. After all, we’re taught in elementary school that the purpose of the judicial branch is to “check” the power of the other branches and halt government overreach. But, like a lot of what we were taught about the federal government in school, that simple characterization of the federal judiciary is not accurate. If the purpose of the judicial branch were really to limit the scope of the federal government to the handful of tasks laid out in the Constitution, one would only have to glance at the behemoth in Washington DC—intervening in every aspect of our lives while running a global empire—to conclude that the judicial branch has failed more spectacularly than any other group of watchdogs in history. And yet, the branch continues on as if it’s all working great, which suggests that the federal judiciary is actually serving a different purpose. What might that be? Well, as scholars like Murray Rothbard havepointedoutextensively, there is a much better case to be made that the true purpose of the judicial branch has been the precise opposite of what it claims. That its role has actually been to help the federal government transcend the limits placed on it in the original Constitution. That may sound counterintuitive, but it’s not the first time limits on state power have been turned around and used to help states expand past those limits. As Rothbard explains in Chapter 3 ofFor a New Liberty, the concept of the “divine right of kings” actually began as a doctrine promoted by the church to limit state power. The idea was that a king could not do anything he wanted because he was constrained by divine law. But as absolutism began to take hold in Europe, kings flipped the concept around to mean that the very fact that they were kings meant their rule represented the will of God. So therefore, anything they did necessarily had God’s approval because otherwise, he wouldn’t have made them kings. Rothbard goes on to explain how parliamentary democracy, utilitarian liberalism, and every other device devised to check state power has eventually come to lose its original purpose and instead, as Bertrand de Jouvenel put it, “to act merely as a springboard to Power.” The same has happened with the federal judiciary and its task to interpret the constitutionality of federal government programs. Because as Rothbardnotes, “If a judicial decree of ‘unconstitutional’ is a mighty check on governmental power, so too a verdict of ‘constitutional’ is an equally mighty weapon for fostering public acceptance of ever greater governmental power.” In other words, while federal courts are defined in the public mind by the few times they have blocked government actions, their more enduring contribution to American history has actually been helping the continuous growth of the federal government by giving it their stamp of legitimacy. One of the major turning points in the judiciary’s transition from a check on power to an enabler of power was the Supreme Court’s ruling on FDR’s New Deal. The Court was hesitant and refused to approve the president’s actions for two whole years—likely because the New Deal programs were so obviously well outside the role of the government as laid out in the Constitution. But then, after some threats from FDR that he would pack the Court, the justices gave their full approval and defined the entire New Deal as presented by Roosevelt as “constitutional.” The federal government’s enormous and blatantly illegal power grab was, from then on, to be considered entirely legitimate. That dynamic has only accelerated in the decades since, especially as the progressive movement gained prominence. As Roger Pilonput it, while the authors of the Constitution were fairly explicit that any federal government action not directly authorized by the Constitution was forbidden, progressives “turned that on its head” and reasoned that any federal government action not explicitly forbidden in the Constitution is authorized. Today’s federal courts are not basing their rulings on the same text of the Constitution that you can read on the National Archives website. They use what’s called the Constitution Annotated, which is a much longer document containing both the Constitution and annotations with all the previous federal court decisions. Federal court decisions which, like the New Deal ruling, have been increasingly driven by political considerations and the progressive interpretation of the founder’s intent. That is how we get government programs that are obviously well beyond the limits of the original Bill of Rights, like the Federal Reserve, restrictions on firearm ownership, the mass imprisonment of Japanese-Americans, the FBI, the Patriot Act, Obamacare, major undeclared wars, and much, much more. Not in spite of the efforts of the judicial branch, but because of them. That said, there’s some important nuance to consider when analyzing how the established political class, or establishment, has actually gone about expanding its power. They have not tried to expand the federal government as rapidly as possible, nor are they aiming for the federal government to take over every single aspect of American life. If that happened, they wouldn’t get to fully enjoy all the benefits of their ill-gotten profits. It is better to think of the establishment as a coalition of groups that are committed to a specific rate of government growth. It’s a rate that is steady and unyielding during relatively normal times but also fast and ferocious during periods of crisis. There is some dissension—establishment Democrats want the rate of growth to be a bit faster, while establishment Republicans want the rate of growth to slow slightly (never reverse). But overall, that trajectory of government growth, which continues steadily and then ratchets up during crises, is the status quo that the establishment is committed to protecting against anti-establishment forces from all sides of the political spectrum. And that is the status quo that the federal judiciary, which is an integral part of the American political class, is trying to protect against the Trump administration. Because Trump’s attempts to change the status quo in ways that actually benefit the American public for a change have ranged from excellent, like the attempts to cut federal agencies, to terrible, like the raising of import taxes, the rulings from federal courts cannot simply be considered as uniformly good or bad. But it is vitally important to recognize that the establishment judges and justices who make up the federal judiciary are not, in fact, trying to prevent government overreach, as they claim. They are trying to stop Trump from threatening the establishment’s ability to continue pursuing the government overreach they want in a way and at the pace that benefits them. Even if they occasionally rule in ways that opponents of big government may like, it is a mistake to view the judicial branch as an ally. They are anything but. **5 thoughts on \"Connor O’Keeffe: The Federal Judiciary’s War on Trump Is Not About Protecting Us from Government Overreach\"** Harrysays:June 7, 2025 at 10:14 amI agree with this article. Something that was left out has been the perverting of the states representation. At one time individual states decided who would represent them by appointing individual federal senators. Now they are decided by statewide elections which removed the states representation in the federal system and just duplicated the election of the House.In addition, they desparately want to completely gut the 2nd amendment in order to fully implement their Marxist desires but have not been able to. The founders were wise to have included that because they knew the hearts of men are desparately wicked. Something tells me the 2nd amendment will play a major roll in the next iteration of US government.Reply I agree with this article. Something that was left out has been the perverting of the states representation. At one time individual states decided who would represent them by appointing individual federal senators. Now they are decided by statewide elections which removed the states representation in the federal system and just duplicated the election of the House.In addition, they desparately want to completely gut the 2nd amendment in order to fully implement their Marxist desires but have not been able to. The founders were wise to have included that because they knew the hearts of men are desparately wicked. Something tells me the 2nd amendment will play a major roll in the next iteration of US government. I agree with this article. Something that was left out has been the perverting of the states representation. At one time individual states decided who would represent them by appointing individual federal senators. Now they are decided by statewide elections which removed the states representation in the federal system and just duplicated the election of the House.In addition, they desparately want to completely gut the 2nd amendment in order to fully implement their Marxist desires but have not been able to. The founders were wise to have included that because they knew the hearts of men are desparately wicked. Something tells me the 2nd amendment will play a major roll in the next iteration of US government. Joe Usays:June 6, 2025 at 10:24 amThe first Constitution, known as The Articles of Confederation, had no provision for a federal court system. Judiciary matters were left to the states. It also limited congressional terms to 3 years in any given 6 year period.The second constitution, which came about 8 years later in 1788, created a massive Federal Court system. It also removed direct limits on congressional seats, allowing only for biennial elections.Readers should consider to whom this 2nd constitution transferred power, as in “Cui Bono?”ReplyBryan Lutzsays:June 6, 2025 at 1:09 pmYes, much of the matters were left to the States. A lot changed after the civil war. Thanks for in-depth info on this one, Joe.Reply The first Constitution, known as The Articles of Confederation, had no provision for a federal court system. Judiciary matters were left to the states. It also limited congressional terms to 3 years in any given 6 year period. The second constitution, which came about 8 years later in 1788, created a massive Federal Court system. It also removed direct limits on congressional seats, allowing only for biennial elections. Readers should consider to whom this 2nd constitution transferred power, as in “Cui Bono?” Bryan Lutzsays:June 6, 2025 at 1:09 pmYes, much of the matters were left to the States. A lot changed after the civil war. Thanks for in-depth info on this one, Joe.Reply Yes, much of the matters were left to the States. A lot changed after the civil war. Thanks for in-depth info on this one, Joe. The first Constitution, known as The Articles of Confederation, had no provision for a federal court system. Judiciary matters were left to the states. It also limited congressional terms to 3 years in any given 6 year period. The second constitution, which came about 8 years later in 1788, created a massive Federal Court system. It also removed direct limits on congressional seats, allowing only for biennial elections. Readers should consider to whom this 2nd constitution transferred power, as in “Cui Bono?” Bryan Lutzsays:June 6, 2025 at 1:09 pmYes, much of the matters were left to the States. A lot changed after the civil war. Thanks for in-depth info on this one, Joe.Reply Yes, much of the matters were left to the States. A lot changed after the civil war. Thanks for in-depth info on this one, Joe. Yes, much of the matters were left to the States. A lot changed after the civil war. Thanks for in-depth info on this one, Joe. Todd Smekenssays:June 6, 2025 at 7:55 amSCOTUS had no problem ruling against Biden. While many believe the courts are stacked against Trump, that’s not the case at all. It’s that Trump’s executive orders violate Constitutional law. He ignores the Emoluments Clause and due process.Our local Congresswoman told a group of her constituents that, “Unless you’re a legal citizen, you don’t have due process.”She obviously hasn’t read the Constitution she swore to uphold. Trump’s administration is full of ignorance as well, and they are the ones preparing the EOs for Trump to sign.Our government, in theory, is designed with checks and balances to maintain our constitutional republic, but we’ve never fully lived up to that ideal. We were an oligarchy at inception, and we’re still an oligarchy. The oligarchy corrupts the courts.The Fourth Branch of Government (the Fourth Estate) was intended to hold the government accountable, but we haven’t seen that happen either. Especially when you consider the Entertainment Industry oligarchy owns the mainstream media.Lastly, the “deep state” has nothing to do with public employees. Musk firing them and claiming victory or damage against the deep state demonstrates his ignorance of who controls the Anglo-Zionist Western Empire. The string pullers aren’t even in government. The closest you will find in government are the upper echelons of the Pentagon, or the military-industrial complex.ReplyBryan Lutzsays:June 6, 2025 at 1:08 pmThanks for the level head on this one, Todd.What are some examples of SCOTUS ruling against Biden?Reply SCOTUS had no problem ruling against Biden. While many believe the courts are stacked against Trump, that’s not the case at all. It’s that Trump’s executive orders violate Constitutional law. He ignores the Emoluments Clause and due process. Our local Congresswoman told a group of her constituents that, “Unless you’re a legal citizen, you don’t have due process.” She obviously hasn’t read the Constitution she swore to uphold. Trump’s administration is full of ignorance as well, and they are the ones preparing the EOs for Trump to sign. Our government, in theory, is designed with checks and balances to maintain our constitutional republic, but we’ve never fully lived up to that ideal. We were an oligarchy at inception, and we’re still an oligarchy. The oligarchy corrupts the courts. The Fourth Branch of Government (the Fourth Estate) was intended to hold the government accountable, but we haven’t seen that happen either. Especially when you consider the Entertainment Industry oligarchy owns the mainstream media. Lastly, the “deep state” has nothing to do with public employees. Musk firing them and claiming victory or damage against the deep state demonstrates his ignorance of who controls the Anglo-Zionist Western Empire. The string pullers aren’t even in government. The closest you will find in government are the upper echelons of the Pentagon, or the military-industrial complex. Bryan Lutzsays:June 6, 2025 at 1:08 pmThanks for the level head on this one, Todd.What are some examples of SCOTUS ruling against Biden?Reply Thanks for the level head on this one, Todd. What are some examples of SCOTUS ruling against Biden? SCOTUS had no problem ruling against Biden. While many believe the courts are stacked against Trump, that’s not the case at all. It’s that Trump’s executive orders violate Constitutional law. He ignores the Emoluments Clause and due process. Our local Congresswoman told a group of her constituents that, “Unless you’re a legal citizen, you don’t have due process.” She obviously hasn’t read the Constitution she swore to uphold. Trump’s administration is full of ignorance as well, and they are the ones preparing the EOs for Trump to sign. Our government, in theory, is designed with checks and balances to maintain our constitutional republic, but we’ve never fully lived up to that ideal. We were an oligarchy at inception, and we’re still an oligarchy. The oligarchy corrupts the courts. The Fourth Branch of Government (the Fourth Estate) was intended to hold the government accountable, but we haven’t seen that happen either. Especially when you consider the Entertainment Industry oligarchy owns the mainstream media. Lastly, the “deep state” has nothing to do with public employees. Musk firing them and claiming victory or damage against the deep state demonstrates his ignorance of who controls the Anglo-Zionist Western Empire. The string pullers aren’t even in government. The closest you will find in government are the upper echelons of the Pentagon, or the military-industrial complex. Bryan Lutzsays:June 6, 2025 at 1:08 pmThanks for the level head on this one, Todd.What are some examples of SCOTUS ruling against Biden?Reply Thanks for the level head on this one, Todd. What are some examples of SCOTUS ruling against Biden? Thanks for the level head on this one, Todd. What are some examples of SCOTUS ruling against Biden? **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. Notify me when the dollar implodes (and other news). Δ Contact Contribute Advertise Contact Contribute Advertise **Contact Us** **Send Us Your Video Links** **Send us a message.We value your feedback,questions and advice.** **We Track the Dollar Collapse For You!** Cut through the clutter and mainstream media noise. Getfree, concise dispatches on vital news, videos and opinions. Delivered to Your email inbox daily. You’ll never miss a critical story,guaranteed. Δ"}