{"id": 2037, "name": "FDD's Long War Journal", "domain": "longwarjournal.org", "bias": "right-center", "credibility": "medium-credibility", "reporting": "high", "questionable": null, "url": "https://www.longwarjournal.org/archives/2025/06/yemeni-president-meets-with-russian-president-despite-russias-ongoing-relationship-with-the-houthis.php", "title": "Yemeni President Meets With Russian President Despite Russias Ongoing Relationship With The Houthis.php", "content": "**** Home About Generation Jihad Post Archives **Yemeni president meets with Russian president despite Russia’s ongoing relationship with the Houthis** President Rashad al Alimi, the chairman of Yemen’s Presidential Leadership Council (PLC), met with Russian President Vladimir Putin on May 28 to discuss the relationship between their two countries. According to the Russian news agency Tass, it is the first visit to Moscow by the leader of the PLC, the Yemeni executive body created in 2022. Alimi reportedlythankedPutin for supporting the internationally recognized government (IRG) of Yemen. In early 2025, Russiaannouncedits intention to open an embassy in Aden, the interim capital of Yemen after the Houthi capture of Sanaa in 2014, but it has not yet done so. While Russia technically recognizes Yemen’s IRG and claims tosupport“security and stability” in the region, it routinely engages with and supports the Houthi terrorists ruling northern Yemen. Recent Russia-Houthi interactions Recent sanctions targeting Houthileaders, financiers, andweapons procurement networkshave demonstrated the extent of Russian involvement with the Yemeni terrorists. In the first round of sanctions leveled by the second Trump administration against the group, the Treasury Departmentstatedthat Mohammed Abdulsalam, a Houthi spokesman and financier based in Muscat, “has traveled to Moscow to meet with Russian Ministry of Foreign Affairs personnel and has coordinated with Russian military personnel to arrange for additional Houthi delegations to visit Russia.” Multiple sanctioned Houthi officials have participated in Houthi-Russia discussions, including for the purpose of weapons procurement. These meetings have included Russian civilians as well as government and military officials. One scheme identified in US sanctions involved sending Yemenis to fight for Russia in Ukraine. The Houthis were compensated for these fighters. A second round of sanctionshighlightedthe involvement of Russia-based businessmen in the financing network ofSaid al Jamal, an “Iran-based Houthi financier.” Jamal’s network benefits the Houthis as well as Iran’s Islamic Revolutionary Guards Corps and Tehran’s regional proxies. This support includedtransportinggrain stolen from Russian-occupied territory in Ukraine to Houthi-controlled territory in Yemen. There have been repeated reports of possible arms transfers from Russia to the Houthis, including proposals foranti-ship missilesandsmall arms. However, diplomatic efforts to prevent Russia from providingadvancedweapons to the Houthisappearto have been successful. TheWall Street Journal,which first reported on a $10 million small arms deal, could not confirm if the agreement was discussed at the direction of the Kremlin but noted that it was being conducted by Viktor Bout. Bout, also dubbed the “Merchant of Death,” is aprolific arms dealerthought to be connected to Russian intelligence. He was serving a 25-year prison sentence in the US after being sentenced in 2011 but was released back to Russia in exchange for American Brittney Griner in December 2022. In early 2024, Bloombergreportedthat the Houthis had reached an agreement with Russia and China to provide their vessels safe passage through the Red Sea despite the terror group’s campaign against commercial shipping and naval vessels. The report said that in return, Russia and China could provide the Yemeni terrorist group with support in international forums such as the United Nations Security Council, where both countries have veto power. The Wall Street Journalreportedin October 2024 that Russia was also providing the Houthis with targeting intelligence for their attacks in the Red Sea. Additional supportincludedsending GRU (Russian intelligence) officials to Houthi-controlled territory to advise the group, according to a senior US official. Bridget Toomey is a research analyst at the Foundation for Defense of Democracies focusing on Iranian proxies, specifically Iraqi militias and the Houthis. Tags:houthis,Iran,russia,Yemen Search Tweets by LongWarJournal Topics of Interest **Iraq** **Islamic state** **Syria** **Aqap** **Al shabaab** **Boko Haram** **Isis** Privacy Policy Terms of Use Copyright @ 2007 - 2025, Public Multimedia Inc . All Rights Reserved"}