{"id": 2133, "name": "TFPP Wire", "domain": "tfppwire.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://tfppwire.com/trump-admin-approves-waivers-from-three-more-states-to-ban-junk-food-purchases-with-food-stamps/", "title": "Trump Admin Approves Waivers From Three More States To Ban Junk Food Purchases With Food Stamps", "content": "Home Economy Immigration Politics World Culture Opinion AboutMenu TogglePrivacy PolicyTerms of UseContact Privacy Policy Terms of Use Contact Privacy Policy Terms of Use Contact **Trump Admin Approves Waivers From Three More States To Ban Junk Food Purchases With Food Stamps** Arkansas, Idaho, and Utah received federal waivers to ban soda, candy, and other junk food from being purchased with food stamps. The move aligns with a growing push by GOP-led states and the Trump administration to improve public health through SNAP reform. **Key Facts:** USDA Secretary Brooke Rollins signed SNAP junk food ban waivers for Arkansas, Idaho, and Utah on Tuesday. These states join Nebraska, Indiana, and Iowa in restricting junk food purchases with food stamps. The initiative is part of the Trump administration’s “Make America Healthy Again” campaign. Other states—including Texas, Ohio, Florida, and Kansas—are seeking or implementing similar restrictions. Roughly 42 million Americans rely on SNAP benefits each month, including 1 in 5 children under 17. **The Rest of The Story:** The Department of Agriculture granted Arkansas, Idaho, and Utah newauthorityto block food stamp users from spending taxpayer-funded benefits on items like soda, candy, and other ultra-processed junk food. USDA Secretary Brooke Rollins made the announcement at a Tuesday press conference, saying the decision is about encouraging healthier habits while respecting public dollars. “Since my confirmation, [the USDA] has encouraged states to think differently and creatively about how to solve the many health issues facing Americans,” Rollins said. These waivers now bring the total to six states that have implemented similar restrictions, all operating under guidance from the Trump administration. More states, including Colorado and West Virginia, are moving forward with similar proposals. Texas passed its own law, Senate Bill 379, to restrict SNAP purchases—potentially bypassing the need for a federal waiver altogether. Today, alongside@SecKennedy, we signed historic waivers removing junk food from SNAP in AR, ID, and UT. 🇺🇸 Honored to stand with@GovBraun,@SarahHuckabee, and@RepJimBairdas they represent their states in this historic SNAP signing. This is a MAJOR step towards Making…pic.twitter.com/IjSO0xs5fu — Secretary Brooke Rollins (@SecRollins)June 11, 2025 **Commentary:** This is exactly the kind of reform long overdue in America’s public assistance programs. For too long, taxpayer-funded food stamps have been used to buy soda, chips, candy, and other items that contribute to obesity, diabetes, and heart disease. These new waivers are a step toward aligning government assistance with personal and national responsibility. No one is saying people can’t buy these items—but they shouldn’t do it with taxpayer dollars. If someone wants to drink a liter of cola or eat a bag of candy, that’s their choice. But SNAP benefits are meant to help feed struggling Americans with nutritious food—not fund bad habits. Robert F. Kennedy Jr. talks about the SNAP programs that Agriculture Secretary Brooke Rollins signed in an effort to Make America Healthy Again. READ MORE:https://t.co/1YNh8m2QSLpic.twitter.com/zSoUPQQnxT — The National Desk (@TND)June 11, 2025 The USDA’s move under Secretary Rollins puts health back at the center of food assistance. It’s also a practical financial decision. Billions in taxpayer money should not go to items that make people sicker, ultimately raising healthcare costs and burdening public systems even more. What’s refreshing is the proactive leadership from states like Arkansas and Utah. They’re not just waiting for D.C. to solve their problems—they’re innovating. That’s the kind of federalism we need more of. These states are showing that it’s possible to support low-income families while still enforcing commonsense limits on government programs. And it’s encouraging to see momentum building. Texas is leading the way with legislation that bans junk food purchases without even waiting for USDA approval. This sends a clear message: the public doesn’t want government dollars wasted on soda and snacks. Critics may try to frame this as punitive or unfair, but it’s actually the opposite. It’s about protecting the long-term well-being of families and children. When 1 in 5 American kids receives food stamp support, it matters deeply what kind of food that money buys. Every state should be following this model. It’s time to make health—not junk food—a national priority, especially when taxpayer funds are involved. **The Bottom Line:** Three more states have joined the growing movement to limit SNAP purchases to healthier food options. Backed by the Trump administration and a rising number of state legislatures, this reform effort aims to improve public health and ensure responsible use of taxpayer money. If the trend continues, we could see a national shift in how food assistance programs are managed. **Sign Up For The TFPP Wire Newsletter** **Read Next** Rep. McIver Gets Hit With Three Count Federal Indictment Over Newark ICE Assault Federal Judge Shoots Down Newsom, Hands Victory To Trump Over National Guard, Troop Deployment Sam’s Club Follows RFK Jr.’s Lead—Scrubs Synthetic Junk From Its Products Federal Judge Accused of Helping Illegal Immigrant Escape Faces Explosive DOJ Showdown President Trump Signals Openness to Invoking The Insurrection Act To Stop The Riots in LA Home Economy Immigration Politics World Culture Opinion AboutMenu TogglePrivacy PolicyTerms of UseContact Privacy Policy Terms of Use Contact Privacy Policy Terms of Use Contact Home Economy Immigration Politics World Culture Opinion AboutMenu TogglePrivacy PolicyTerms of UseContact Privacy Policy Terms of Use Contact Privacy Policy Terms of Use Contact Home Economy Markets & Finance Politics 2024 Elections Culture Opinion **About** TFPP Wire helps you stay ahead with breaking news, analysis, and bold conservative insights on the economy, politics, national security, culture, and more. **Company** About Contact **Legal** Privacy Policy Terms of Use **Follow Us** Facebook X / Twitter Truth Social Copyright © 2025 TFPP Wire Powered by TFPP Wire"}