{"id": 2118, "name": "RocketNews", "domain": "rocketnews.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://rocketnews.com/2025/06/education-dept-considering-cuts-for-california-universities-while-making-progress-with-harvard-and-columbia-mcmahon-says-cnn/", "title": "Education Dept Considering Cuts For California Universities While Making Progress With Harvard And Columbia Mcmahon Says Cnn", "content": "RN Home About RocketNewsAbout RocketNewsArticle Submission FormCommercial News Posting and Writing ServicesContact RocketNews About RocketNews Article Submission Form Commercial News Posting and Writing Services Contact RocketNews About RocketNews Article Submission Form Commercial News Posting and Writing Services Contact RocketNews News CategoriesBusinessClimate ChangeEducationEnergyEntertainmentFinancialHealthJobsPoliticsReligionScienceSportsStock Market NewsTechnologyTop StoriesTravelWorld Business Climate Change Education Energy Entertainment Financial Health Jobs Politics Religion Science Sports Stock Market News Technology Top Stories Travel World Business Climate Change Education Energy Entertainment Financial Health Jobs Politics Religion Science Sports Stock Market News Technology Top Stories Travel World **Education Dept. considering cuts for California universities while making ‘progress’ with Harvard and Columbia, McMahon says – CNN** byNews Feed Editor|Jun 10, 2025|Education Education Dept. considering cuts for California universities while making ‘progress’ with Harvard and Columbia, McMahon says CNN Article Attribution | Read More at Article Source **About RN** **Website Awards** RocketNews nominated for aWebby Award Search Engine Watch past honorable mention winner for Best News Search Engine. **More Info** About RocketNews Contact RocketNews COVID-19 Dashboard Definitions and Terms Privacy Policy Site Design and Operation by Murray Owen LLC | A Web Development and Operations Company"}