{"id": 2041, "name": "MEAWW", "domain": "meaww.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://meaww.com/did-breanna-nix-really-judge-american-idols-first-ever-live-auditions-at-the-cma-fest-in-nashville", "title": "Did Breanna Nix Really Judge American Idols First Ever Live Auditions At The Cma Fest In Nashville", "content": "**An 'American Idol' finalist is stepping into the judge’s chair — with a twist no one saw coming** WhileJamal Roberts clinched the victory on 'American Idol' Season 23, the other two finalists,John Foster and Breanna Nix, are also grabbing major headlines. While both runners-up are expanding their musical careers at a rapid pace, Nix is all set to make a surprising comeback on the show, but this time not as a contestant. In a surprising reveal, reports suggest that Nix will take on the responsibility of 'American Idol' judge, but there is a twist. Reportedly, Nix is making her return to 'American Idol,' but as a guest judge. The 25-year-old stay-at-home mom participated in the show's first-ever live auditions at the CMA Fest in Nashville, Tennessee, on friday, June 6, perEntertainment Now. Nix shared her excitement with fans on Instagram, offering a behind-the-scenes look at her experience from the judge's table. In a video, she encouraged hopefuls to give it their shot, saying, 'Hey guys, I am at the first-ever in-person CMA auditions for 'American Idol.' I'm getting a seat behind the little judge seats and get to hear people.\" A post shared by Breanna Nix (@breannanixmusic) Nix also grabbed major headlines recently as her debut single, 'Higher,' has proven to be a breakout hit, debuting at No. 1 onBillboard's Christian Digital Song Sales chart, making it her first No. 1 on any Billboard list, as perForbes. The song also made major news beyond the Christian genre, landing at No. 4 on the all-genre Digital Song Sales chart with nearly 4,700 pure sales, according to Luminate. The song 'Higher' debuted at No. 40 on Billboard’s Hot Christian Songs chart, thanks mainly to strong sales. As a new artist with limited promotion, sales were the key driver behind its success on the Christian-only ranking, which also factors in streams and airplay. Notably, Nix also reunited with Foster, delighting fans with a surprise visit to Seacrest Studios at Vanderbilt Children's Hospital, according toGood Housekeeping. A post shared by Breanna Nix (@breannanixmusic) In a playful Instagram clip shared by nix on Tuesday, June 3, the two were seen posing with a life-size cutout ofhost Ryan Seacrest.\"We miss you, @ryanseacrest,\" she captioned the video, tagging @americanidol, @officialjohnfoster, and @ryanfoundation. When news of John and Breanna’s unexpected reunion began spreading online, Seacrest chimed in with a playful response on social media. \"I froze from being starstruck,\" he joked in the comments, adding, \"Thanks for coming by Seacrest Studios!\" Notably, before the finale, Nix also shared an interesting part of her journey. In an interview withBillboard, Nix revealed she secretly submitted an audition tape to 'American Idol' without telling anyone, including her husband, Austin. \"I submitted a video [to Idol] and didn't tell anyone,\" she said. \"I forgot about it. Didn't tell my husband. Didn't tell anybody. I didn't think anything was going to come out of it. Two months went by, and I checked my email.\" Eventually, nix auditioned for season 23 with Austin and their son Emerson by her side. Taking inspiration fromJudge Carrie Underwood, she impressed the panel with her rendition of 'Jesus, Take the Wheel.'"}