{"id": 1952, "name": "Ecowatch", "domain": "ecowatch.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.ecowatch.com/global-energy-investment-clean-tech-iea-2025.html", "title": "Global Energy Investment Clean Tech Iea 2025.html", "content": "Climate Energy Conservation Food + Agriculture Renewables Oceans Policy Insights + Opinion Go Solar TodayTop Companies By StateCalifornia Solar CompaniesTexas Solar CompaniesNew York Solar CompaniesFlorida Solar CompaniesSee All StatesTop Incentives By StateCalifornia Solar IncentivesTexas Solar IncentivesNew York Solar IncentivesFlorida Solar IncentivesSee All StatesSolar Panel Costs By StateSolar Panel Costs in CaliforniaSolar Panel Costs in TexasSolar Panel Costs in New YorkSolar Panel Costs in FloridaSee All StatesValue of Solar by StateIs Solar Worth It In California?Is Solar Worth It in Texas?Is Solar Worth It New York?Is Solar Worth It In Florida?See All StatesCompany ReviewsTesla Solar ReviewSunrun Solar ReviewSunPower Solar ReviewVivint Solar ReviewSee All CompaniesCommon Solar QuestionsCan You Get Free Solar Panels?Does Solar Increase Home Value?What’re The Best Solar Batteries?Can You Finance Solar?Where To Buy Solar Panels?Payback On Solar Panels?Solar ResourcesInteractive Solar CalculatorFederal Solar Tax CreditBest Solar Panels For Most HomesTesla Solar Roof ReviewCheapest Solar PanelsCompanies ComparedSunPower vs Tesla SolarSunRun vs Tesla SolarSunRun vs SunPowerSunPower vs Momentum SolarSunPower vs ADT Solar Top Companies By StateCalifornia Solar CompaniesTexas Solar CompaniesNew York Solar CompaniesFlorida Solar CompaniesSee All StatesTop Incentives By StateCalifornia Solar IncentivesTexas Solar IncentivesNew York Solar IncentivesFlorida Solar IncentivesSee All States Top Companies By StateCalifornia Solar CompaniesTexas Solar CompaniesNew York Solar CompaniesFlorida Solar CompaniesSee All States California Solar Companies Texas Solar Companies New York Solar Companies Florida Solar Companies See All States Top Incentives By StateCalifornia Solar IncentivesTexas Solar IncentivesNew York Solar IncentivesFlorida Solar IncentivesSee All States California Solar Incentives Texas Solar Incentives New York Solar Incentives Florida Solar Incentives See All States Solar Panel Costs By StateSolar Panel Costs in CaliforniaSolar Panel Costs in TexasSolar Panel Costs in New YorkSolar Panel Costs in FloridaSee All StatesValue of Solar by StateIs Solar Worth It In California?Is Solar Worth It in Texas?Is Solar Worth It New York?Is Solar Worth It In Florida?See All States Solar Panel Costs By StateSolar Panel Costs in CaliforniaSolar Panel Costs in TexasSolar Panel Costs in New YorkSolar Panel Costs in FloridaSee All States Solar Panel Costs in California Solar Panel Costs in Texas Solar Panel Costs in New York Solar Panel Costs in Florida See All States Value of Solar by StateIs Solar Worth It In California?Is Solar Worth It in Texas?Is Solar Worth It New York?Is Solar Worth It In Florida?See All States Is Solar Worth It In California? Is Solar Worth It in Texas? Is Solar Worth It New York? Is Solar Worth It In Florida? See All States Company ReviewsTesla Solar ReviewSunrun Solar ReviewSunPower Solar ReviewVivint Solar ReviewSee All CompaniesCommon Solar QuestionsCan You Get Free Solar Panels?Does Solar Increase Home Value?What’re The Best Solar Batteries?Can You Finance Solar?Where To Buy Solar Panels?Payback On Solar Panels? Company ReviewsTesla Solar ReviewSunrun Solar ReviewSunPower Solar ReviewVivint Solar ReviewSee All Companies Tesla Solar Review Sunrun Solar Review SunPower Solar Review Vivint Solar Review See All Companies Common Solar QuestionsCan You Get Free Solar Panels?Does Solar Increase Home Value?What’re The Best Solar Batteries?Can You Finance Solar?Where To Buy Solar Panels?Payback On Solar Panels? Can You Get Free Solar Panels? Does Solar Increase Home Value? What’re The Best Solar Batteries? Can You Finance Solar? Where To Buy Solar Panels? Payback On Solar Panels? Solar ResourcesInteractive Solar CalculatorFederal Solar Tax CreditBest Solar Panels For Most HomesTesla Solar Roof ReviewCheapest Solar PanelsCompanies ComparedSunPower vs Tesla SolarSunRun vs Tesla SolarSunRun vs SunPowerSunPower vs Momentum SolarSunPower vs ADT Solar Solar ResourcesInteractive Solar CalculatorFederal Solar Tax CreditBest Solar Panels For Most HomesTesla Solar Roof ReviewCheapest Solar Panels Interactive Solar Calculator Federal Solar Tax Credit Best Solar Panels For Most Homes Tesla Solar Roof Review Cheapest Solar Panels Companies ComparedSunPower vs Tesla SolarSunRun vs Tesla SolarSunRun vs SunPowerSunPower vs Momentum SolarSunPower vs ADT Solar SunPower vs Tesla Solar SunRun vs Tesla Solar SunRun vs SunPower SunPower vs Momentum Solar SunPower vs ADT Solar Top Companies By StateCalifornia Solar CompaniesTexas Solar CompaniesNew York Solar CompaniesFlorida Solar CompaniesSee All StatesTop Incentives By StateCalifornia Solar IncentivesTexas Solar IncentivesNew York Solar IncentivesFlorida Solar IncentivesSee All States Top Companies By StateCalifornia Solar CompaniesTexas Solar CompaniesNew York Solar CompaniesFlorida Solar CompaniesSee All States California Solar Companies Texas Solar Companies New York Solar Companies Florida Solar Companies See All States Top Incentives By StateCalifornia Solar IncentivesTexas Solar IncentivesNew York Solar IncentivesFlorida Solar IncentivesSee All States California Solar Incentives Texas Solar Incentives New York Solar Incentives Florida Solar Incentives See All States Top Companies By StateCalifornia Solar CompaniesTexas Solar CompaniesNew York Solar CompaniesFlorida Solar CompaniesSee All States California Solar Companies Texas Solar Companies New York Solar Companies Florida Solar Companies See All States California Solar Companies Texas Solar Companies New York Solar Companies Florida Solar Companies See All States Top Incentives By StateCalifornia Solar IncentivesTexas Solar IncentivesNew York Solar IncentivesFlorida Solar IncentivesSee All States California Solar Incentives Texas Solar Incentives New York Solar Incentives Florida Solar Incentives See All States California Solar Incentives Texas Solar Incentives New York Solar Incentives Florida Solar Incentives See All States Solar Panel Costs By StateSolar Panel Costs in CaliforniaSolar Panel Costs in TexasSolar Panel Costs in New YorkSolar Panel Costs in FloridaSee All StatesValue of Solar by StateIs Solar Worth It In California?Is Solar Worth It in Texas?Is Solar Worth It New York?Is Solar Worth It In Florida?See All States Solar Panel Costs By StateSolar Panel Costs in CaliforniaSolar Panel Costs in TexasSolar Panel Costs in New YorkSolar Panel Costs in FloridaSee All States Solar Panel Costs in California Solar Panel Costs in Texas Solar Panel Costs in New York Solar Panel Costs in Florida See All States Value of Solar by StateIs Solar Worth It In California?Is Solar Worth It in Texas?Is Solar Worth It New York?Is Solar Worth It In Florida?See All States Is Solar Worth It In California? Is Solar Worth It in Texas? Is Solar Worth It New York? Is Solar Worth It In Florida? See All States Solar Panel Costs By StateSolar Panel Costs in CaliforniaSolar Panel Costs in TexasSolar Panel Costs in New YorkSolar Panel Costs in FloridaSee All States Solar Panel Costs in California Solar Panel Costs in Texas Solar Panel Costs in New York Solar Panel Costs in Florida See All States Solar Panel Costs in California Solar Panel Costs in Texas Solar Panel Costs in New York Solar Panel Costs in Florida See All States Value of Solar by StateIs Solar Worth It In California?Is Solar Worth It in Texas?Is Solar Worth It New York?Is Solar Worth It In Florida?See All States Is Solar Worth It In California? Is Solar Worth It in Texas? Is Solar Worth It New York? Is Solar Worth It In Florida? See All States Is Solar Worth It In California? Is Solar Worth It in Texas? Is Solar Worth It New York? Is Solar Worth It In Florida? See All States Company ReviewsTesla Solar ReviewSunrun Solar ReviewSunPower Solar ReviewVivint Solar ReviewSee All CompaniesCommon Solar QuestionsCan You Get Free Solar Panels?Does Solar Increase Home Value?What’re The Best Solar Batteries?Can You Finance Solar?Where To Buy Solar Panels?Payback On Solar Panels? Company ReviewsTesla Solar ReviewSunrun Solar ReviewSunPower Solar ReviewVivint Solar ReviewSee All Companies Tesla Solar Review Sunrun Solar Review SunPower Solar Review Vivint Solar Review See All Companies Common Solar QuestionsCan You Get Free Solar Panels?Does Solar Increase Home Value?What’re The Best Solar Batteries?Can You Finance Solar?Where To Buy Solar Panels?Payback On Solar Panels? Can You Get Free Solar Panels? Does Solar Increase Home Value? What’re The Best Solar Batteries? Can You Finance Solar? Where To Buy Solar Panels? Payback On Solar Panels? Company ReviewsTesla Solar ReviewSunrun Solar ReviewSunPower Solar ReviewVivint Solar ReviewSee All Companies Tesla Solar Review Sunrun Solar Review SunPower Solar Review Vivint Solar Review See All Companies Tesla Solar Review Sunrun Solar Review SunPower Solar Review Vivint Solar Review See All Companies Common Solar QuestionsCan You Get Free Solar Panels?Does Solar Increase Home Value?What’re The Best Solar Batteries?Can You Finance Solar?Where To Buy Solar Panels?Payback On Solar Panels? Can You Get Free Solar Panels? Does Solar Increase Home Value? What’re The Best Solar Batteries? Can You Finance Solar? Where To Buy Solar Panels? Payback On Solar Panels? Can You Get Free Solar Panels? Does Solar Increase Home Value? What’re The Best Solar Batteries? Can You Finance Solar? Where To Buy Solar Panels? Payback On Solar Panels? Solar ResourcesInteractive Solar CalculatorFederal Solar Tax CreditBest Solar Panels For Most HomesTesla Solar Roof ReviewCheapest Solar PanelsCompanies ComparedSunPower vs Tesla SolarSunRun vs Tesla SolarSunRun vs SunPowerSunPower vs Momentum SolarSunPower vs ADT Solar Solar ResourcesInteractive Solar CalculatorFederal Solar Tax CreditBest Solar Panels For Most HomesTesla Solar Roof ReviewCheapest Solar Panels Interactive Solar Calculator Federal Solar Tax Credit Best Solar Panels For Most Homes Tesla Solar Roof Review Cheapest Solar Panels Companies ComparedSunPower vs Tesla SolarSunRun vs Tesla SolarSunRun vs SunPowerSunPower vs Momentum SolarSunPower vs ADT Solar SunPower vs Tesla Solar SunRun vs Tesla Solar SunRun vs SunPower SunPower vs Momentum Solar SunPower vs ADT Solar Solar ResourcesInteractive Solar CalculatorFederal Solar Tax CreditBest Solar Panels For Most HomesTesla Solar Roof ReviewCheapest Solar Panels Interactive Solar Calculator Federal Solar Tax Credit Best Solar Panels For Most Homes Tesla Solar Roof Review Cheapest Solar Panels Interactive Solar Calculator Federal Solar Tax Credit Best Solar Panels For Most Homes Tesla Solar Roof Review Cheapest Solar Panels Companies ComparedSunPower vs Tesla SolarSunRun vs Tesla SolarSunRun vs SunPowerSunPower vs Momentum SolarSunPower vs ADT Solar SunPower vs Tesla Solar SunRun vs Tesla Solar SunRun vs SunPower SunPower vs Momentum Solar SunPower vs ADT Solar SunPower vs Tesla Solar SunRun vs Tesla Solar SunRun vs SunPower SunPower vs Momentum Solar SunPower vs ADT Solar Climate Energy Conservation Food + Agriculture Renewables Oceans Policy Insights + Opinion Go Solar TodayGo Solar TodayTop Companies By StateCalifornia Solar CompaniesTexas Solar CompaniesNew York Solar CompaniesFlorida Solar CompaniesSee All StatesTop Incentives By StateCalifornia Solar IncentivesTexas Solar IncentivesNew York Solar IncentivesFlorida Solar IncentivesSee All StatesSolar Panel Costs By StateSolar Panel Costs in CaliforniaSolar Panel Costs in TexasSolar Panel Costs in New YorkSolar Panel Costs in FloridaSee All StatesValue of Solar by StateIs Solar Worth It In California?Is Solar Worth It in Texas?Is Solar Worth It New York?Is Solar Worth It In Florida?See All StatesCompany ReviewsTesla Solar ReviewSunrun Solar ReviewSunPower Solar ReviewVivint Solar ReviewSee All CompaniesCommon Solar QuestionsCan You Get Free Solar Panels?Does Solar Increase Home Value?What’re The Best Solar Batteries?Can You Finance Solar?Where To Buy Solar Panels?Payback On Solar Panels?Solar ResourcesInteractive Solar CalculatorFederal Solar Tax CreditBest Solar Panels For Most HomesTesla Solar Roof ReviewCheapest Solar PanelsCompanies ComparedSunPower vs Tesla SolarSunRun vs Tesla SolarSunRun vs SunPowerSunPower vs Momentum SolarSunPower vs ADT Solar Go Solar Today Top Companies By StateCalifornia Solar CompaniesTexas Solar CompaniesNew York Solar CompaniesFlorida Solar CompaniesSee All States California Solar Companies Texas Solar Companies New York Solar Companies Florida Solar Companies See All States Top Incentives By StateCalifornia Solar IncentivesTexas Solar IncentivesNew York Solar IncentivesFlorida Solar IncentivesSee All States California Solar Incentives Texas Solar Incentives New York Solar Incentives Florida Solar Incentives See All States Solar Panel Costs By StateSolar Panel Costs in CaliforniaSolar Panel Costs in TexasSolar Panel Costs in New YorkSolar Panel Costs in FloridaSee All States Solar Panel Costs in California Solar Panel Costs in Texas Solar Panel Costs in New York Solar Panel Costs in Florida See All States Value of Solar by StateIs Solar Worth It In California?Is Solar Worth It in Texas?Is Solar Worth It New York?Is Solar Worth It In Florida?See All States Is Solar Worth It In California? Is Solar Worth It in Texas? Is Solar Worth It New York? Is Solar Worth It In Florida? See All States Company ReviewsTesla Solar ReviewSunrun Solar ReviewSunPower Solar ReviewVivint Solar ReviewSee All Companies Tesla Solar Review Sunrun Solar Review SunPower Solar Review Vivint Solar Review See All Companies Common Solar QuestionsCan You Get Free Solar Panels?Does Solar Increase Home Value?What’re The Best Solar Batteries?Can You Finance Solar?Where To Buy Solar Panels?Payback On Solar Panels? Can You Get Free Solar Panels? Does Solar Increase Home Value? What’re The Best Solar Batteries? Can You Finance Solar? Where To Buy Solar Panels? Payback On Solar Panels? Solar ResourcesInteractive Solar CalculatorFederal Solar Tax CreditBest Solar Panels For Most HomesTesla Solar Roof ReviewCheapest Solar Panels Interactive Solar Calculator Federal Solar Tax Credit Best Solar Panels For Most Homes Tesla Solar Roof Review Cheapest Solar Panels Companies ComparedSunPower vs Tesla SolarSunRun vs Tesla SolarSunRun vs SunPowerSunPower vs Momentum SolarSunPower vs ADT Solar SunPower vs Tesla Solar SunRun vs Tesla Solar SunRun vs SunPower SunPower vs Momentum Solar SunPower vs ADT Solar Go Solar Today Top Companies By StateCalifornia Solar CompaniesTexas Solar CompaniesNew York Solar CompaniesFlorida Solar CompaniesSee All States California Solar Companies Texas Solar Companies New York Solar Companies Florida Solar Companies See All States California Solar Companies Texas Solar Companies New York Solar Companies Florida Solar Companies See All States Top Incentives By StateCalifornia Solar IncentivesTexas Solar IncentivesNew York Solar IncentivesFlorida Solar IncentivesSee All States California Solar Incentives Texas Solar Incentives New York Solar Incentives Florida Solar Incentives See All States California Solar Incentives Texas Solar Incentives New York Solar Incentives Florida Solar Incentives See All States Solar Panel Costs By StateSolar Panel Costs in CaliforniaSolar Panel Costs in TexasSolar Panel Costs in New YorkSolar Panel Costs in FloridaSee All States Solar Panel Costs in California Solar Panel Costs in Texas Solar Panel Costs in New York Solar Panel Costs in Florida See All States Solar Panel Costs in California Solar Panel Costs in Texas Solar Panel Costs in New York Solar Panel Costs in Florida See All States Value of Solar by StateIs Solar Worth It In California?Is Solar Worth It in Texas?Is Solar Worth It New York?Is Solar Worth It In Florida?See All States Is Solar Worth It In California? Is Solar Worth It in Texas? Is Solar Worth It New York? Is Solar Worth It In Florida? See All States Is Solar Worth It In California? Is Solar Worth It in Texas? Is Solar Worth It New York? Is Solar Worth It In Florida? See All States Company ReviewsTesla Solar ReviewSunrun Solar ReviewSunPower Solar ReviewVivint Solar ReviewSee All Companies Tesla Solar Review Sunrun Solar Review SunPower Solar Review Vivint Solar Review See All Companies Tesla Solar Review Sunrun Solar Review SunPower Solar Review Vivint Solar Review See All Companies Common Solar QuestionsCan You Get Free Solar Panels?Does Solar Increase Home Value?What’re The Best Solar Batteries?Can You Finance Solar?Where To Buy Solar Panels?Payback On Solar Panels? Can You Get Free Solar Panels? Does Solar Increase Home Value? What’re The Best Solar Batteries? Can You Finance Solar? Where To Buy Solar Panels? Payback On Solar Panels? Can You Get Free Solar Panels? Does Solar Increase Home Value? What’re The Best Solar Batteries? Can You Finance Solar? Where To Buy Solar Panels? Payback On Solar Panels? Solar ResourcesInteractive Solar CalculatorFederal Solar Tax CreditBest Solar Panels For Most HomesTesla Solar Roof ReviewCheapest Solar Panels Interactive Solar Calculator Federal Solar Tax Credit Best Solar Panels For Most Homes Tesla Solar Roof Review Cheapest Solar Panels Interactive Solar Calculator Federal Solar Tax Credit Best Solar Panels For Most Homes Tesla Solar Roof Review Cheapest Solar Panels Companies ComparedSunPower vs Tesla SolarSunRun vs Tesla SolarSunRun vs SunPowerSunPower vs Momentum SolarSunPower vs ADT Solar SunPower vs Tesla Solar SunRun vs Tesla Solar SunRun vs SunPower SunPower vs Momentum Solar SunPower vs ADT Solar SunPower vs Tesla Solar SunRun vs Tesla Solar SunRun vs SunPower SunPower vs Momentum Solar SunPower vs ADT Solar The best of EcoWatch right in your inbox. Sign up for our email newsletter! About EcoWatch Contact EcoWatch Terms of Use Privacy Policy Learn About Solar Energy About EcoWatch Contact EcoWatch Terms of Use Privacy Policy Learn About Solar Energy **2025 Global Energy Investment to Reach Record $3.3 Trillion, Driven by ‘Clean Technologies’: IEA Report** Founded in 2005 as an Ohio-based environmental newspaper, EcoWatch is a digital platform dedicated to publishing quality, science-based content on environmental issues, causes, and solutions. An increase in spending onclean energyis expected to drive record globalenergy investmentof 3.3 trillion in 2025, with 2.2 trillion of that in “clean-energy technologies,” according to the latest report from the International Energy Agency (IEA). Despite economic uncertainty and geopolitical tensions, theWorld Energy Investment 2025report showsChinaleads the way as the largest investor in energy. Clean energy technologies will attract twice the capital offossil fuels, with more investment being made insolar PVthan in any other technology, the report said. “Amid the geopolitical and economic uncertainties that are clouding the outlook for the energy world, we see energy security coming through as a key driver of the growth in global investment this year to a record $3.3 trillion as countries and companies seek to insulate themselves from a wide range of risks,” said Executive Director of the IEAFatih Birolin a press release from the intergovernmental organization. “The fast-evolving economic and trade picture means that some investors are adopting a wait-and-see approach to new energy project approvals, but in most areas we have yet to see significant implications for existing projects.” Investment inrenewablesand other clean technologies likenuclear, storage, low-emissions fuels, electrification and efficiency are on track to reach a record $2.2 trillion in 2025. This reflects not just efforts to lower emissions, but the expanding influence of energy security concerns, industrial policy and electricity-based solutions being more cost competitive. Investment in natural gas,oilandcoalis expected to total $1.1 trillion. The report provides a comprehensive look at the global landscape of current investment across regions, fuels and technologies. It also explores some major changes that have happened over the past decade. “When the IEA published the first ever edition of itsWorld Energy Investmentreport nearly ten years ago, it showed energy investment in China in 2015 just edging ahead of that of the United States,” Birol said. “Today, China is by far the largest energy investor globally, spending twice as much on energy as the European Union – and almost as much as the EU and United States combined.” China’s share of clean energy spending worldwide has risen in the past decade from one-quarter to nearly a third, supported by investments in a range of technologies, from solar andwindto hydropower, nuclear,EVsandbatteries. “Today’s investment trends clearly show a new Age of Electricity is drawing nearer. A decade ago, investments in fossil fuels were 30% higher than those in electricity generation, grids and storage. This year, electricity investments are set to be some 50% higher than the total amount being spent bringing oil, natural gas and coal to market,” IEA said. Spending on the generation of low-emissions power globally has nearly doubled in the past five years, with solar PV leading the way. Investment in both rooftop and utility-scale solar is projected to reach $450 billion this year. Investment in battery storage is also growing rapidly, and is expected to soar to more than $65 billion in 2025. However, grid investment, while now $400 billion annually, is failing to keep up with spending on electrification and generation. In order to maintain electricity security, investment in grids would need to climb toward being equal with spending on generation by the early 2030s. But this is being hampered by tight supply chains for cables and transformers, in addition to lengthy permitting procedures. According to the report, lower demand and prices for oil are poised to result in a decrease in upstream oil investment for the first time since 2020. “Its short investment cycle makes US tight oil the bellwether for changing market dynamics, with an anticipated fall of almost 10% in spending in 2025. Nonetheless, a recent wave of consolidation and technology improvements have kept costs in check and production is still set to grow in 2025,” the report said. Meanwhile,liquefied natural gas(LNG) investment is rising, as new projects in Qatar, Canada, the United States and elsewhere are preparing to come online. The global LNG market from next year to 2028 is set for its largest ever surge in capacity. Spending patterns of nations remain uneven, the report said, with many developing economies — particularly in Africa — struggling to raise capital for energy infrastructure. Africa currently accounts for two percent of global investment in clean energy. “Despite being home to 20% of the world’s population and rapidly growing energy demand, total investment across the continent has fallen by a third over the past decade due to declining fossil fuel spending and insufficient growth in clean energy,” the press release said. “To close the financing gap in African countries and other emerging and developing economies, international public finance needs to be scaled up and used strategically to bring in larger volumes of private capital.” **Subscribe to get exclusive updates in our daily newsletter!** By signing up, you agree to theTerms of UseandPrivacy Policy,and to receive electronic communications from EcoWatch Media Group, which may include marketing promotions, advertisements and sponsored content. **Read More** **Subscribe to get exclusive updates in our daily newsletter!** By signing up, you agree to theTerms of UseandPrivacy Policy,and to receive electronic communications from EcoWatch Media Group, which may include marketing promotions, advertisements and sponsored content. Latest Articles U.S. Produced Record Amount of Energy in 2024, EIA Reportsby Paige BennettJune 11, 2025 37 Countries Commit to Tackling ‘Invisible Yet Powerful Threat’ of Ocean Noise Pollutionby Cristen Hemingway JaynesJune 11, 2025 18 New Countries Ratify High Seas Treaty at 2025 UN Ocean Conferenceby Cristen Hemingway JaynesJune 10, 2025 Meet the Winners of the 12th Annual UN World Oceans Day Photo Competitionby Cristen Hemingway JaynesJune 10, 2025 Rainbow Trout Feel Pain and Suffer for Minutes After Being Caught, Study Findsby Paige BennettJune 10, 2025 Protected Bike Lanes Lead to Nearly Twice as Many Bicycle Commuters: Studyby Cristen Hemingway JaynesJune 10, 2025 ‘Ticking Time Bomb’ of Ocean Acidification Has Already Crossed Planetary Boundary, Threatening Marine Ecosystems: Studyby Cristen Hemingway JaynesJune 9, 2025 Kabul Could Become First Modern City Globally to Run Out of Water: Reportby Paige BennettJune 9, 2025 The best of EcoWatch right in your inbox. Sign up for our email newsletter! Climate Animals Health + Wellness Insights + Opinion Adventure Oceans Business Solar About EcoWatch Contact EcoWatch EcoWatch Reviews Terms of Use Privacy Policy Learn About Solar Energy Learn About Deregulated Energy EcoWatch UK Experts for a healthier planet and life. Privacy Policy Terms of Use Cookie Preferences Do Not Sell My Information Advertiser Disclosure Our editorial team is committed to creating independent and objective content focused on helping our readers make informed decisions. To help support these efforts we receive compensation from companies that advertise with us. The compensation we receive from these companies may impact how and where products appear on this site. This compensation does not influence the recommendations or advice our editorial team provides within our content. We do not include all companies, products or offers that may be available."}