{"id": 634, "name": "Hechinger Report", "domain": "hechingerreport.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://hechingerreport.org/una-de-cada-cinco-personas-que-proveen-cuidado-infantil-es-inmigrante-muchos-estan-aterrorizados-por-las-deportaciones-y-redadas-de-trump/", "title": "Una De Cada Cinco Personas Que Proveen Cuidado Infantil Es Inmigrante Muchos Estan Aterrorizados Por Las Deportaciones Y Redadas De Trump", "content": "Support nonprofit news Newsletters About Donate Twitter Facebook Instagram RSS Feed The Hechinger Report Covering Innovation & Inequality in Education Newsletters About Donate **Una de cada cinco personas que proveen cuidado infantil es inmigrante. Muchos están aterrorizados por las deportaciones y redadas de Trump** **Share this:** Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Bluesky (Opens in new window)Bluesky Click to share on Pinterest (Opens in new window)Pinterest Click to share on WhatsApp (Opens in new window)WhatsApp Click to email a link to a friend (Opens in new window)Email The Hechinger Report is a national nonprofit newsroom that reports on one topic: education. Sign up for ourweekly newslettersto get stories like this delivered directly to your inbox. Consider supporting our stories and becominga membertoday. Nueve días después de que el presidente Donald Trump firmara órdenes ejecutivas con medidas enérgicas contra la inmigración ilegal, Damaris Alvarado-Rodríguez decidió cerrar un aula en una de sus guarderías en Filadelfia. Traducción de Anabelle Garay Read it in English A pesar de tener tarjetas de residencia, las maestras de ese salón de clases, en donde atienden a niños y niñas que tienen un año de edad, estaban demasiado nerviosas para ir a trabajar. Desde que Trump tomó posesión, sus funcionarios se han enfocado en Filadelfia y otras denominadas ciudades santuario donde se limita la cooperación en la aplicación de las leyes de inmigración. Los agentes de inmigración han estado presentes constantemente en los vecindarios donde están situados los tres centros de Alvarado-Rodríguez. “Tengo mucho miedo de cómo esto va a afectar a nuestros niños, familias y personal”, dijo. En un programa de cuidado infantil familiar en Albuquerque, Nuevo México, Maggie, de 47 años, quien fue abogada antes de emigrar desde México hace 10 años, también ha visto los rápidos efectos de las órdenes ejecutivas. Cinco de los 12 niños a su cuidado dejaron de presentarse. Maggie dijo a través de un intérprete que los padres deciden dejar a sus hijos pequeños con hermanos mayores o abuelos en lugar de con ella, es decir, que salen de casa solo para trabajar y así estar fuera del alcance de las autoridades lo más posible. (The Hechinger Report no utiliza los nombres completos de algunos de los entrevistados porque temen por su seguridad). **Stay up to date on K-12 education** We take you inside school districts and classrooms weekly to see how K-12 education is changing and how it can be strengthened. Δ “Los padres dijeron: ‘Vamos a esperar a que las cosas se calmen’”, dijo Maggie. Relacionado: La educación es una labor de toda la vida. Suscríbete a nuestroboletín semanalgratuito, que incluye las noticias más importantes sobre el mundo de la educación. En Estados Unidos,1 de cada 5trabajadores de cuidado infantil es inmigrante. En ciudades grandes como Nueva York, los inmigrantes constituyen más del 40 % de la fuerza laboral de cuidado infantil. En Los Ángeles, es de casi el 50 %. “En la economía del cuidado infantil, los inmigrantes son la columna vertebral de este trabajo”, afirma Erica Phillips, directora ejecutiva de la Asociación Nacional de Cuidado Infantil Familiar. Estos educadores de la primera infancia se “dedican a prestar uno de los servicios más esenciales y con mayor impacto para los niños pequeños de todo el país”. Los expertos opinan que las órdenes ejecutivas de Trump amenazan dicha columna vertebral. Entre otros cambios, las órdenes amplían las normas sobrequé inmigrantespueden ser deportados rápidamente, sin tener una audiencia; exigen que algunos no ciudadanos se registren y presenten huellas dactilares; y limitan los permisos de trabajo. Varios proveedores de cuidado infantil dijeron que la situación parece más grave que en años anteriores. La actual administración haestablecido cuotas diariasde aprehensiones de inmigrantes, lo que ha producido arrestos demás inmigrantes por día que el promedio bajo la administración anterior. Esto incluyea muchos sin antecedentes penales, que no eran el blanco de la ejecución de la ley bajo el expresidente Joe Biden. Asimismo, Trump ha impulsado medidas para terminar con el estatus legal de millones de personas pues propuso eliminarla ciudadanía por nacimiento. Estados Unidos no puede permitirse perder personal de cuidado infantil. Hay ya muchos programas que tienen problemas crónicos de rotación de trabajadores, lo que puede crear inestabilidad en las vidas de los niños y niñas a su cuidado. Las tasas de rotación en el sector de cuidado infantil son65 % más altasque el promedio en otros sectores. Los salarios bajos (una trabajadora promedio de cuidado infantil gana 13,07 dólares la hora) dificultan la contratación de personal. A menudo, los cuidadores carecen de prestaciones y pueden ganar más al trabajar en restaurantes decomida rápida o en venta minorista. La pandemia debilitó la fuerza laboral, algo que seha tardado en reponer. Para lidiar con la escasez de cuidadores infantiles, varios estados hanintentado aprobar leyes que permitan a los adolescentestrabajar en dichas aulas. “Ya estamos empezando desde un punto en el que no hay suficiente cuidado infantil, los programas están en apuros y la fuerza laboral ya está viviendo un estrés increíble”, dijo Lea Austin, directora ejecutiva del Centro para el Estudio del Empleo en el Cuidado Infantil de la Universidad de California en Berkeley. “Solo podemos esperar que esto vaya a devastar aún más todo el ecosistema de cuidado y educación temprana”. El país lleva mucho tiempo recurriendo a los inmigrantes paralos trabajos de cuidado, incluido el cuidado infantil y otras labores como el cuidado de personas mayores. Los inmigrantes tienen mayor probabilidad de servir como cuidadores de “amistades, familiares y vecinos” al asumir acuerdos informales de atención donde hay flexibilidad y que son máspopulares entrepadres de familia. Al desempeñar estas funciones de cuidado, los inmigrantes permiten que otros padres puedan trabajar. Se calcula que hay142.000inmigrantes indocumentados que trabajan como niñeras y asistentes de atención personal o de salud en el hogar en todo el país, lo que crea “un efecto multiplicador de productividad en toda la economía”, según una investigación del Center for American Progress. En la ciudad de Nueva York, lamayoría delas 14.000 niñeras de la ciudad son inmigrantes. Relacionado:‘Hay una cultura de temor’: Estudiantes indocumentados agonizan ante comienzo del nuevo mandato de Trump En el norte de California, Adriana, una joven de 27 años que emigró de México hace dos años, dijo que quiere empezar a trabajar y que recientemente le ofrecieron un empleo en una compañía grande. No obstante, primero necesita encontrar una guardería para su bebé de 3 meses, y le preocupa que los funcionarios de inmigración la separen de su bebé. “Tengo miedo, sobre todo porque parece que podrán entrar en mi lugar de trabajo”, dijo a través de un intérprete. “Me preocupa dejar a mi bebé solo”. El Servicio de Inmigración y Control de Aduanas de EE. UU. (ICE, por sus siglas en inglés) no respondió a las múltiples solicitudes de comentarios. Una de las órdenes ejecutivas de Trump, firmada poco después de haber asumido el cargo, anuló las restricciones que impedían que ICE realice redadas en escuelas y programas de cuidado infantil. La política de inmigración puede tener un efecto paralizador en las comunidades, lo que hace que los inmigrantes eviten trabajos que podrían aumentar su visibilidad ante las autoridades, dijo Chris Herbst, profesor asociado de la Universidad Estatal de Arizona, que estudió el impacto de la política en el cuidado infantil entre 2008 y 2014. Debido a que el sistema de cuidado infantil de Estados Unidos depende tanto del trabajo de los inmigrantes, “los impactos son instantáneos”, añadió. En Albuquerque, Ana dirige un programa de cuidado infantil que atiende a 50 familias del área, la mayoría de las cuales son ciudadanas estadounidenses. Ana se fue de México en 2020 con su esposo y su hijo pequeño cuando la violencia aumentó en su estado natal de Sinaloa, y ahora le preocupa que la puedan deportar. Ese tipo de preocupación la comparte su personal: tres de sus 14 empleados han dejado de ir a trabajar por miedo a las redadas de inmigración. Recientemente, Ana y su esposo reunieron algunas pertenencias en caso de ser detenidos. Para prepararse, también han considerado certificar un documento de tutela encargando a su hijo de 3 años, que es ciudadano estadounidense, así como de su hijo de 8 años, que no es ciudadano, a un familiar. “Lo que nos motiva es mejorar la situación de nuestras familias, vivir en mejores lugares y aumentar las oportunidades para nuestros hijos”, dijo. “Esperamos que [los funcionarios de inmigración] persigan a los delincuentes y no intenten seguir o perseguir a personas que son buenas y trabajadoras”. Elida Cruz dirige un programa de cuidado infantil en el centro de California donde atiende a los hijos de trabajadores migrantes. Cruz opina que el miedo es palpable en algunos de los padres de familia; tanto ella como su esposo reparten víveres y transportan a los pequeños hacia y desde su programa de cuidado infantil para que los padres puedan limitar su tiempo fuera de casa. Su esposo escogió una palabra clave con una familia, la cual pronuncia tres veces para que los padres sepan que es seguro abrir la puerta. Relacionado:Las amenazas de deportación de Trump pesan sobre los grupos que ofrecen ayuda con la FAFSA Cruz, como muchas otras proveedoras de cuidado infantil, ha intentado educar a las familias inmigrantes sobre sus derechos al compartir con ellasrecursos disponiblesy entregarles “tarjetas rojas” que aconsejan a las personas sobre qué hacer si se les acercan agentes de inmigración. Además de preocuparse por los efectos en las familias y los niños, le preocupa qué sucederá si dichas familias se van. “Financieramente, sería la devastación de mi negocio”, dijo. “Tendría que cerrar. Me quedaría sin clientes, sin niños”, añadió. “Nuestros negocios se van a hundir porque todos dependemos de los trabajadores del campo”. Puede que solo sea cuestión de tiempo: incluso los niños pequeños a su cargo parecen estar conscientes de que las cosas podrían cambiar en cualquier momento. “Es desgarrador ver las caritas de los niños, llenas de miedo”, dijo. Un niño preguntó si los agentes de inmigración vendrían a su centro. Cruz le dijo lo único que se le ocurrió, aunque sabía que era una mentira piadosa. “Le dije: ‘¿Sabes por qué no van a venir aquí? … Porque ni siquiera tienen nuestra dirección, así que no saben que estamos aquí, mijo’”. Camilla Forte contribuyó con el reportaje. Comunícate conJackie Maderal 212-678-3562 omader@hechingerreport.org. Este artículo sobreel cuidado infantilfue producido porThe Hechinger Report, una organización de noticias independiente sin fines de lucro centrada en la desigualdad y la innovación en la educación. Suscríbete a nuestroboletín de noticias. The Hechinger Report provides in-depth, fact-based, unbiased reporting on education that is free to all readers. But that doesn't mean it's free to produce. Our work keeps educators and the public informed about pressing issues at schools and on campuses throughout the country. We tell the whole story, even when the details are inconvenient. Help us keep doing that. Join us today. About Our Impact Topics Interactives Use Our Stories Corrections Newsletters Sponsorship Jobs Twitter Facebook Instagram RSS Feed"}