{"id": 156, "name": "Borgen Project", "domain": "borgenproject.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://borgenproject.org/innovative-solutions-to-poverty-and-hunger/", "title": "Innovative Solutions To Poverty And Hunger", "content": "Link to X Link to Facebook Link to Instagram Link to TikTok Link to Youtube AboutAbout UsPresidentBoard of DirectorsFinancialsOur MethodologySuccess TrackerContact About UsPresidentBoard of DirectorsFinancialsOur MethodologySuccess TrackerContact President Board of Directors Financials Our Methodology Success Tracker Contact About UsPresidentBoard of DirectorsFinancialsOur MethodologySuccess TrackerContact President Board of Directors Financials Our Methodology Success Tracker Contact President Board of Directors Financials Our Methodology Success Tracker Contact IssuesThe Good NewsGlobal Poverty & U.S. JobsPoverty & National SecurityPoverty and OverpopulationInventions Helping the PoorPoverty & Aid FAQ’s The Good News Global Poverty & U.S. Jobs Poverty & National Security Poverty and Overpopulation Inventions Helping the Poor Poverty & Aid FAQ’s The Good News Global Poverty & U.S. Jobs Poverty & National Security Poverty and Overpopulation Inventions Helping the Poor Poverty & Aid FAQ’s Act Now30 Ways to HelpEmail CongressCall CongressVolunteerCourses & CertificatesBe a DonorInternshipsIn-Office InternshipsRemote InternshipsLegislationPolitics 101 30 Ways to HelpEmail CongressCall CongressVolunteerCourses & CertificatesBe a Donor Email Congress Call Congress Volunteer Courses & Certificates Be a Donor InternshipsIn-Office InternshipsRemote Internships In-Office Internships Remote Internships LegislationPolitics 101 Politics 101 30 Ways to HelpEmail CongressCall CongressVolunteerCourses & CertificatesBe a Donor Email Congress Call Congress Volunteer Courses & Certificates Be a Donor Email Congress Call Congress Volunteer Courses & Certificates Be a Donor InternshipsIn-Office InternshipsRemote Internships In-Office Internships Remote Internships In-Office Internships Remote Internships LegislationPolitics 101 Politics 101 Politics 101 The Blog The Podcast Magazine Donate Click to open the search input fieldClick to open the search input fieldSearch MenuMenu **Innovative Solutions to Poverty and Hunger** **** **These are some of the many inventions that are improving conditions for people living in the poorest regions of the world.** Below are a handful of the many wonderful inventions that organizations and businesses are developing and utilizing to help the world’s poor. The Borgen Project works to raise public and political awareness of ways that life can be improved for people who are struggling to survive. We don’t make or distribute the products below. **Roughrider Wheelchairs** Over 20 million people in developing countries are in need of wheelchairs. With 15 different seat settings, Roughrider wheelchairs are an inexpensive solution that can handle myriad terrains, are portable, and are easy to repair. **The Hippo Roller** With millions of people walking several miles a day to access clean water, the Hippo Roller helps impoverished people conserve energy and provide water for their families. **Solar-Powered Irrigation** Innovations in solar pump design now make all kinds of irrigation to make agriculture possible in areas that previously could not be farmed.(Learn More) **One Laptop Per Child** Low cost computer designed for children in developing countries. It has built-in wireless and screen that is readable under direct sunlight. **HotPot Solar Ovens** Using the power of the sun, Hotpot ovens provide families with an inexpensive way to cook meals.(Learn More) **Plumpy’nut** Plumpy’nut is a simple yet ground-breaking substance that in 2-4 weeks transforms a malnourished toddler from near death to healthy. Plumpy’nut contains 500 calories of peanut butter, milk, vitamins and minerals in a paste form.(Learn More) **The Uhuru Ambulance** In many remote regions, lack of effective transportation to a hospital or clinic results in death. The Uhuru is a cost effective way for poor, rural communities to transport the sick. **LifeStraw** The LifeStraw filters water as people drink from lakes, puddles and any source of dirty water.(Learn More) **KickStart Irrigation Pump** An innovative manual pump system, designed to cheaply and effectively irrigate 1 to 2 acres of land is finding customers, rich and poor, across East Africa.(Learn More) **Lifesaver Water-Purification Bottle** The Lifesaver bottle can make the most revolting swamp water drinkable in seconds. A single long-lasting filter can clean 6,000 liters of water. **Kite Patch** Kite Patch is a small sticker that protects humans from mosquitoes for up to 48 hours.(Learn More) **Jet Injector** Injections are no longer needed to provide vaccines. The new Jet Injector uses high pressure to deliver the substance, a safer and simpler method for children to get the vaccines they need. **Uniject** The Uniject auto disable injection system (Uniject), born in PATH’s Seattle shop, is little more than a small bubble of plastic attached to a needle. Originally developed for use with vaccines, Uniject now promises to extend the reach of other lifesaving drugs as well as contraception.(Learn More) **Life Sack** The Life Sack is an ingenious water purification device that does double duty as a container for shipping grains and other food staples. Once the food has been received, the sack can be used as a solar water purification kit through its UV-A-radiation and thermal treatments.(Learn More) **Omni Processor** Innovative machine converts human waste into drinkable water.(Learn More) **Take Action** Call Congress Email Congress Donate 30 Ways to Help Volunteer Ops Internships Courses & Certificates The Podcast **Get Smarter** Global Poverty 101 Global Poverty… The Good News Global Poverty & U.S. Jobs Global Poverty and National Security Innovative Solutions to Poverty Global Poverty & Aid FAQ’s “The Borgen Project is an incredible nonprofit organization that is addressing poverty and hunger and working towards ending them.” **-The Huffington Post** **Inside The Borgen Project** Contact About Financials President Board of Directors Newsletter **International Links** UK Email Parliament UK Donate Canada Email Parliament **Get Smarter** Global Poverty 101 Global Poverty… The Good News Global Poverty & U.S. Jobs Global Poverty and National Security Innovative Solutions to Poverty Global Poverty & Aid FAQ’s **Ways to Help** Call Congress Email Congress Donate 30 Ways to Help Volunteer Ops Internships Courses & Certificates The Podcast"}