{"id": 1877, "name": "Americans for Prosperity", "domain": "americansforprosperity.org", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://americansforprosperity.org/press-release/afps-emily-seidel-responds-to-ongoing-debate-on-spending-restraint-and-pro-growth-tax-policy/", "title": "Afps Emily Seidel Responds To Ongoing Debate On Spending Restraint And Pro Growth Tax Policy", "content": "About IssuesEconomic ProgressHealth CareEducationCriminal JusticeFree SpeechImmigration Economic Progress Health Care Education Criminal Justice Free Speech Immigration Economic Progress Health Care Education Criminal Justice Free Speech Immigration State Chapters Newsroom Take Action Donate MoreContact UsCareersStoriesScorecardAmicus BriefsGovernment AffairsPolicy Corner Contact Us Careers Stories Scorecard Amicus Briefs Government Affairs Policy Corner Contact Us Careers Stories Scorecard Amicus Briefs Government Affairs Policy Corner About IssuesEconomic ProgressHealth CareEducationCriminal JusticeFree SpeechImmigration Economic Progress Health Care Education Criminal Justice Free Speech Immigration Economic Progress Health Care Education Criminal Justice Free Speech Immigration State Chapters Newsroom Take Action Donate MoreContact UsCareersStoriesScorecardAmicus BriefsGovernment AffairsPolicy Corner Contact Us Careers Stories Scorecard Amicus Briefs Government Affairs Policy Corner Contact Us Careers Stories Scorecard Amicus Briefs Government Affairs Policy Corner Subscribe **AFP’s Emily Seidel Responds to Ongoing Debate on Spending Restraint and Pro-Growth Tax Policy** Washington, DC—Today Americans for Prosperity (AFP) President and CEO Emily Seidel responded to the ongoing debate on Capitol Hill about the need to address our skyrocketing national debt while also extending and making permanent as much of the Trump tax cuts as possible before they expire at the end of the year. AFP President and CEO Emily Seidelissued the following statement: “AFP has been fighting reckless and wasteful government spending—on both sides—for the last twenty years. There is no question Washington must address our debt crisis. But we didn’t get here overnight, and Washington isn’t going to fix it with one bill. “We agree we have to cut spending, but we can’t lose sight of an immediate and urgent need—ensuring Americans aren’t hit with the largest tax increase in history. “Millions of families are struggling to pay their bills, buy groceries, and afford today’s skyrocketing cost of living. Killing this bill crushes those families. We know because we talk to them every day. “Even if this bill cuts enough spending to be fully offset, we’re still on a course for bankruptcy that requires comprehensive reforms to how Congress makes spending decisions. That’s why Washington needs to move to budget reform once this bill is done. “AFP fully supports efforts to root out more waste, fraud, and abuse now and in the future. But sinking this important pro-growth and reform-rich bill because it doesn’t solve our debt crisis is reckless and wrong.” Background: On Tuesday, AFPpraisedthe President’s first rescission package. Last month, AFP Senior Fellow in Fiscal Policy Kurt Couchman penned an op-ed in theDaily Callerurging Congress to sign off on the President’s spending cuts. Since thelaunchof AFP’s “Protect Prosperity” campaign, AFP has been a driving force to secure the permanent extension of the Tax Cuts & Jobs Act and advance this legislation: Holding more than 500 events andralliesacross the country with dozens of lawmakers, Reaching out to more than 250,000 voters in key Congressional districts over duringNational Days of Actionand grassroots outreach, Hosting conversationsSpeaker Mike Johnson,Majority Leader Steve Scalise&House Conference Chair Lisa McClain, Millions of dollars inadsand testimonials, More than 1,000 meetings with key legislators and Hill staff, And comprehensivepollingin partnership with Public Opinion Strategies. AFP will continue to leverage its unparalleled grassroots infrastructure to show the overwhelming support for extending the Trump tax cuts and send a message to Republican lawmakers that the American people are with them and now is the time to deliver. -###- **Join the Fight Today (Stay in Touch) (Sidebars)** First Name* Last Name* Email* Zip Code* PhoneThis field is for validation purposes and should be left unchanged. About Terms of Use Legacy Giving Careers **Newsletter Footer** © 2025 AMERICANS FOR PROSPERITY. ALL RIGHTS RESERVED. |PRIVACY POLICY Receive email alerts to learn how to get involved **Join the Fight Today (Stay in Touch) (Sidebars)** First Name* Last Name* Email* Zip Code* PhoneThis field is for validation purposes and should be left unchanged."}