{"id": 2072, "name": "National Republican Congressional Committee", "domain": "nrcc.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://nrcc.org/2025/06/11/californians-wont-forget-that-adam-gray-voted-to-allow-illegals-to-decide-u-s-elections/", "title": "Californians Wont Forget That Adam Gray Voted To Allow Illegals To Decide U S Elections", "content": "About About the Chairman NRCC Patriots Get Involved Press Room Contribute TextVICTORYto21818to helpDEFENDour conservative majority! GIVE **Californians won’t forget that Adam Gray voted to allow illegals to decide U.S. elections** Theoverwhelming majority of Americansagree that only American citizens should decide American elections, yet out of touch Democrat Adam Gray voted to allow illegal immigrants to decide our elections. Then under mounting pressure, Gray flip-flopped but the damage was done and Gray proved he will prioritize the radical far-left agenda ahead of Californians. Gray’s flip-flop followed two separatelawsuitsby Democrats against President Trump’s executive order requiring voters to prove they’re U.S. citizens before registering to vote in federal elections. “Adam Gray’s vote to let illegal immigrants decide our elections was a slap in the face to every American citizen. While Gray scrambles to rewrite history, voters in California won’t forget: Adam Gray chose illegal immigrants and political games over Californians and our democratic process.”– NRCC Spokesman Christian Martinez Major Donor Benefits PAC Benefits Blog Press Releases Video Chairman Hudson Media Kit About Campaign Jobs Internships Contact Us Privacy Policy By providing your cell phone or mobile phone number you are consenting to receive calls and texts, including autodialed and automated calls and texts, to that number with campaign notifications from the National Republican Congressional Committee. NRCC is happy to help at 1-888-606-1023. Reply HELP for help, STOP to end. Message & data rates may apply. Message frequency may vary. Messaging may include requests for donation. Terms and Conditionshere. Privacy Policyhere."}