{"id": 2000, "name": "India Today", "domain": "indiatoday.in", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.indiatoday.in/sports/cricket/story/wtc-2025-final-day-1-australia-vs-south-afria-live-updates-world-test-championship-aus-sa-match-lord-cricket-ground-in-london-2739036-2025-06-11", "title": "Wtc 2025 Final Day 1 Australia Vs South Afria Live Updates World Test Championship Aus Sa Match Lord Cricket Ground In London 2739036 2025 06 11", "content": "India Today Aaj Tak GNTTV Lallantop Business Today Bangla Malayalam Northeast BT Bazaar Harper's Bazaar Sports Tak Crime Tak Astro Tak Gaming Brides Today Cosmopolitan Kisan Tak Ishq FM India Today Hindi Reader’s Digest India Today Aaj Tak GNTTV Lallantop Business Today Bangla Malayalam Northeast BT Bazaar Harper's Bazaar Sports Tak IN US Home TVLive TVPrimetime Live TV Primetime Live TV Primetime MagazineLatest EditionInsightBest Colleges Latest Edition Insight Best Colleges Latest Edition Insight Best Colleges Life+Style India South GlobalAll World NewsUS NewsCanada NewsUK NewsChina NewsIndians Abroad All World News US News Canada News UK News China News Indians Abroad All World News US News Canada News UK News China News Indians Abroad Business All SportsIPL 2025TennisCricketFootballSports Today IPL 2025 Tennis Cricket Football Sports Today IPL 2025 Tennis Cricket Football Sports Today Technology ShowbuzzEntertainmentBollywoodHollywoodTelevisionOTTLatest Reviews Entertainment Bollywood Hollywood Television OTT Latest Reviews Entertainment Bollywood Hollywood Television OTT Latest Reviews Newspresso SpecialsPodcastsFirst Things FastSunday SpecialHistory of ItNewsMoDIUInteractivesOpinionGames Podcasts First Things Fast Sunday Special History of It NewsMo DIU Interactives Opinion Games Podcasts First Things Fast Sunday Special History of It NewsMo DIU Interactives Opinion Games Videos Short Videos Fact Check Other NewsEducationIt's ViralScienceHealthAutoLaw TodayEnvironmentCitiesWeatherWeb StoriesHoroscopes Education It's Viral Science Health Auto Law Today Environment Cities Weather Web Stories Horoscopes Education It's Viral Science Health Auto Law Today Environment Cities Weather Web Stories Horoscopes **Download App** **AUS vs SA highlights, WTC Final 2025 Day 1: SA (43/4) trail AUS by 169, Australian pacers rattle South Africa** Hello and welcome to the live coverage of Day 1 of the World Test Championship between Australia and South Africa from Lord's. South Africa have lost early wickets. Their openers Ryan Rickelton and Aiden Markram failed to get going in their maiden World Test Championship final. Mitchell Starc set the tone for South Africa with a masterclass of new-ball bowling. Earlier in the day, Kagiso Rabada took a five-wicket haul while Marco Jansen took three as Australia were bowled out for 2012. Captain Temba Bavuma's call to bowl first worked in their favour. For Australia, Beau Webster (72) and Steve Smith (66) scored fifties in an otherwise sorry batting card. **AUS vs SA Live: Webster praises Australia's experienced bowling attack** Webster: \"I had a bit of luck, no doubt, in the first 20-30 balls. They came really hard at us, but I managed to get through that period and get a total on the board. I've played a bit of County cricket over here-different level, obviously-but with Rabada and Jansen coming in, it was very tough. I just stuck to my game plan, which has worked for me over the last three or four years. I'd be angry with myself if I went away from it. There were some minor adjustments here and there, considering the conditions and the slope. There's definitely plenty in the pitch. We saw in the last session that the ball is still nibbling around-Starcy had it on a string. The ball nipping up the slope is the tricky one. The delivery that bowled Stubbsy, for example, nipped up the slope-that's always challenging for a batter. Our bowling attack has been so strong for a number of years. We know that if we don't quite get it done with the bat, the big guys can certainly get it done with the ball.\" **AUS vs SA Live: Stumps! Australia dominate Day 1** David Bedingham wrapped up proceedings on Day 1 with two stylish boundaries off Pat Cummins, but it's Australia who will be the more content side heading back to the dressing room. It's been a compelling day of Test cricket at Lord's - 78.4 overs, 14 wickets, and flashes of quality with the bat. Steve Smith and Beau Webster offered some resistance for Australia, but it was Kagiso Rabada's superb five-wicket haul that lit up the morning, bowling the Aussies out for 212. In reply, South Africa struggled to find any rhythm. The top order collapsed to 4 for under 50, with Starc making early inroads before Cummins and Hazlewood chipped in. The Proteas look stuck and will need a strong response on Day 2 to stay in the contest. The WTC Final has certainly lived up to its billing so far. LIVE SCORE WTC FINAL: South Africa (43 for 4 in 22 ov) trail by 169 vs Australia (212) at Lord's. Bedingham (8*), Bavuma (2*), **AUS vs SA Live: David Bedingham joins Bavuma in the middle** David Bedingham walks out to join skipper Temba Bavuma with just a few minutes left in the session. Hazlewood immediately tests him with a probing length delivery that angles across and thuds into the pads as Bedingham tries to flick it away. The ball rolls away for leg byes, and despite some interest, Australia opts not to review. Replays suggest it was drifting down the leg side — a good call in the end. **AUS vs SA Live: WICKET! Hazlewood dismisses Stubbs** OUT! Josh Hazlewood joins the party to castle Tristan Stubbs. Precision from Hazlewood as he strikes again. This one angled in on a fuller length, and Stubbs, expecting it to hold its line, offered a tentative forward defence. But the ball straightened just enough to sneak through the gap and clip the top of middle stump. A classic Hazlewood dismissal — tight, controlled, and clinical. Stubbs b Hazlewood 2(13). LIVE SCORE WTC FINAL: South Africa (30 for 4 in 20.2 ov) trail by 182 vs Australia (212) at Lord's. Bavuma (2*), **AUS vs SA Live: Temba Bavuma finally gets off the mark** South Africa captain Temba Bavuma finally opens his account with a couple off Josh Hazlewood, drawing a loud cheer from the Lord's crowd. Hazlewood bowled a length delivery on the pads, and Bavuma calmly tucked it behind square for two runs. It may seem like a small moment, but it brought visible relief to the skipper after a long wait at the crease. LIVE SCORE WTC FINAL: South Africa (29 for 3 in 19 ov) trail by 183 vs Australia (212) at Lord's. Bavuma (2*), Stubbs (1*) **AUS vs SA Live: Another maiden over from Cummins** Pat Cummins continues to pile on the pressure with relentless accuracy, bowling his third maiden over of the day at Lord's. His sixth over to Tristan Stubbs was a masterclass in control and consistency, mixing fuller deliveries with probing lengths around the off-stump channel. Stubbs, under immense pressure, managed to keep out each delivery-defending solidly, playing with soft hands, and wisely leaving a couple outside off. Cummins, clocking speeds around 136-139 km/h, gave nothing away, drawing a false edge and beating the bat with subtle movement. LIVE SCORE WTC FINAL: South Africa (27 for 3 in 18 ov) trail by 185 vs Australia (212) at Lord's. Bavuma (0*), Stubbs (1*) **AUS vs SA Live: Stubbs joins Bavuma** Tristan Stubbs walks in with his team in deep trouble and a mountain to climb. He joins skipper Temba Bavuma, who has faced over 20 deliveries without getting off the mark. The pressure is immense, and South Africa desperately need a partnership. Stubbs has a challenging job on his hands — can he absorb the pressure and steady the innings? **AUS vs SA Live: OUT! Cummins removes Mulder** Australian captain Pat Cummins brings Wiaan Mulder's scratchy innings to an end with a classic nip-backer. Bowling at a brisk 140kph, Cummins pitches it full and targets the stumps. Mulder aims a straight drive but leaves a gap between bat and pad - the ball seams in sharply and crashes into middle stump. A tidy piece of bowling and a reward well-earned. Mulder departs for 6 off 44 balls. LIVE SCORE WTC FINAL: South Africa (25 for 3 in 15.2 ov) trail by 187 vs Australia (212) at Lord's. Bavuma (0*), Mulder (2*) **AUS vs SA Live: The Lord's pitch continues to be a key factor** Both sides have faced trouble with the swing and bounce that pitch has offered while batting, across both innings. The ball is still getting a good bounce, and now the likes of Starc has also started to find some seam movement. South Africa batters - Mulder and Bavuma stay steady and hold ground. LIVE SCORE WTC FINAL: South Africa (21 for 2 in 13 ov) trail by 191 vs Australia (212) at Lord's. Bavuma (0*), Mulder (2*) **WTC final live: Australia hesitant to review** BIG APPEAL FROM EVERY AUSTRALIA PLAYER ON THE FIELD!! The umpire denies the line of impact of the Mitchel Starc delivery on Mulder's pads to be threatening, and after a long discussion between the pacer, skipper Cummins and wicketkeeper Alkex Carey- Australia chose not to take a review.\\ The replay shows it would've been very close but an umpires call would've saved Mulder. **AUS vs SA Live: RICKLETON BECOMES STARC'S SECOND** RYAN RICKLETON DISMISSED 16!! Second wicket already for Mitchell Starc and it has been a great start for Australia in this innings. South Africa captain Termba Bavuma is in at number 4, and he will have the responsibility stable the ship for his side. LIVE SCORE WTC FINAL: South Africa (19 for 2 in 8.4 ov) trail by 193 vs Australia (212) at Lord's. Bavuma (0*), Mulder (1*) **WTC final live: Dale Steyn has mixed feelings with Mulder at no.3** Former South Africa star pacer Dale Steyn believes that Wian Mulder batting at no.3 for this Proteas is a sudden move that will up in demanding too much at too big a stage from the all-rounder. **AUS vs SA Live: A look back at Markram wicket** A look back at Australia first breakthrough in this match. **Watch the video:** #MitchellStarcstrikes in the very first over! How often have we seen that? 🔥The defending champions are up and roaring as#AidenMarkramdeparts without scoring! 💪🏻LIVE NOW 👉https://t.co/9lZGHcdeVP#WTCFinal|#SAvAUS, Day 1, watch LIVE on Star Sports 1, Star Sports 1…pic.twitter.com/rZ74sbO1Hq **WTC final live: Mulder and Rickleton remain steady** Wian Mulder and Ryan Rickleton have not tried anything risky at the moment, as South Africa hold ground after the early wicket of Aiden Markram. It has been pace after pace from Australia with the skipper Pat Cummins now joining the attack after the first few overs from Mitchell Starc and Josh Hazlewood. LIVE SCORE WTC FINAL: South Africa (14 for 7 in 7 ov) vs Australia (212) at Lord's. Rickleton (11*), Mulder (1*) **AUS vs SA Live: ALEX CAREY DROPS MULDER ON 1** Alex Carey drops a sitter of a chance for the wicket of Wian Mulder, who is just on 1. A simple carry to the keeper after catching an edge from Mulder's bat - an absolute blunder from Carey. LIVE SCORE WTC FINAL: South Africa (8 for 1 in 5 ov) vs Australia (212) at Lord's. Rickleton (7*), Mulder (1*) **WTC final live: Hazlewood bowls an excellent over** Josh Hazlewood tested Wiaan Mulder with a relentless over, hitting the right channels and getting the ball to move just enough to trouble the batter. He beat Mulder's outside edge a couple of times, once with a ball that nipped away and another that the batter may have deliberately left. A sharp delivery jagged back in to strike Mulder on the thigh pad, while another inside edge deflected onto his pad as he looked to punch through the off-side. Mulder struggled to settle as Hazlewood kept the pressure on throughout the over. LIVE SCORE WTC FINAL: South Africa (7 for 1 in 4 ov) vs Australia (212) at Lord's. Rickleton (6*), Mulder (1*) **WTC final live: Starc the magician in first over in Test cricket** Wiaan Mulder, the right-handed batter, makes his way to the crease to join Rickleton in the middle. Mitchell Starc has claimed 19 wickets in the first over of a Test innings — the joint-most by any bowler since his debut in 2012. He shares this feat with England's James Anderson, underlining his reputation as one of the most dangerous new-ball bowlers in modern cricket. **WTC final live: OUT! Starc removes Markram for duck** Mitchell Starc delivered a trademark early breakthrough, dismissing Aiden Markram for a duck. The left-armer angled one in from just outside off, landing it on a good length. Markram, unsure in his footwork, offered a hesitant push and managed only an inside edge that cannoned into the stumps. It was vintage Starc — pace, swing, and precision in the very first over. LIVE SCORE WTC FINAL: South Africa (0 for 1 in 1 ov) vs Australia at Lord's. Rickleton (0) **WTC final live: South African openers out in the middle** Now, with momentum firmly on their side, South African opening duo Aiden Markram and Ryan Rickelton stride out to the middle. Markram takes strike, and it will be Mitchell Starc, who opens the attack for Australia. **WTC final live: Kagiso Rabada reflects on five-wicket haul** Back from a doping ban, Kagiso Rabada has really silenced his naysayers. The star fast bowler picked up his second five-wicket haul at Lord's. He is only the second bowler after Kyle Jamieson to take a five-wicket haul in the World Test Championship final. \"Means a lot to play for South Africa. Given my all each and every time. Happy to do the job. It was moving around a bit. With the new ball it seemed harder to score. As the ball got softer and they showed intent, they got some runs away. But you always felt that, on this wicket, especially with the way they were playing, any ball had their name on it,\" Rabada said. **Also Watch** **Speaking for India is a national duty: Anand Sharma, Op Sindoor global envoy** **Watch: Lalu Yadav cuts humongous cake of laddoos with sword on 78th birthday** **Hang her if she is found guilty: Sonam Raghuvanshi's brother** **Lt Commander Yashasvi Solanki Becomes First Woman Naval ADC to President** **So Sorry: Elon-e-Musk** **Read This** **Iran warns it will target US bases if conflict erupts over nuke talks** **Diesel theft busted as tunnel found under Jaipur home disguised as water business** **Disney and NBCUniversal sue AI firm Midjourney over copyright infringement** **Troops in Los Angeles can arrest protesters as unrest spreads across US** **Trump deployed more troops to Los Angeles than Syria, Iraq combined: Report** **PUBLICATIONS** India Today Business Today India Today-Hindi TIME **TELEVISION** India Today TV Aaj Tak Good News Today **EVENTS** Agenda AajTak India Today Conclave Sahitya AajTak **RADIO** Ishq FM AajTak Radio **GAMING** India Today Gaming World Esports Cup **USEFUL LINKS** Press Release Sitemap News Newsletter Privacy Policy Correction Policy LMIL Documents **PRINTING** Thomson Press **WELFARE** Care Today **DISTRIBUTION** Rate Card **SYNDICATIONS** Headlines Today **WEBSITES** India Today India Today Malayalam India Today NE Business Today DailyO AajTak Lallantop Bangla GNTTV iChowk Reader’s Digest Cosmopolitan **EDUCATION** Vasant Valley Best Colleges Best Universities ABOUT US CONTACT US TERMS AND CONDITIONS ARCHIVES"}