{"id": 1092, "name": "People Magazine", "domain": "people.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://people.com/candice-king-reveals-surprising-place-she-bonded-with-we-were-liars-sisters-mamie-gummer-caitlin-fitzgerald-exclusive-11752687", "title": "Candice King Reveals Surprising Place She Bonded With We Were Liars Sisters Mamie Gummer Caitlin Fitzgerald Exclusive 11752687", "content": "SearchPlease fill out this field. Log In My AccountLog OutSettings Log Out Settings Log Out Settings MagazineSubscribeManage Your SubscriptionGive a Gift SubscriptionGet Help Subscribe Manage Your Subscription Give a Gift Subscription Get Help Subscribe Manage Your Subscription Give a Gift Subscription Get Help Newsletters Sweepstakes Subscribe EntertainmentEntertainmentCelebrityMoviesMusicTVSportsAwards & EventsBooks Celebrity Movies Music TV Sports Awards & Events Books Celebrity Movies Music TV Sports Awards & Events Books CrimeCrimeCrime NewsSerial KillersCultsCrime History Crime News Serial Killers Cults Crime History Crime News Serial Killers Cults Crime History Human InterestHuman InterestReal PeopleNewsAstrologyAnimals Real People News Astrology Animals Real People News Astrology Animals LifestyleLifestyleFoodHealthHomeTravelStyleStyleWatch Food Health Home Travel Style StyleWatch Food Health Home Travel Style StyleWatch RoyalsRoyalsRoyals Royals Royals PEOPLE StyleWatch Summer 2025 ShoppingShoppingFashionBeautyHomeKitchenTravelPetsGiftsSales & DealsPeople TestedShopping Fashion Beauty Home Kitchen Travel Pets Gifts Sales & Deals People Tested Shopping Fashion Beauty Home Kitchen Travel Pets Gifts Sales & Deals People Tested Shopping Subscribe Log In My AccountMy AccountLog OutSettings Log Out Settings Log Out Settings MagazineMagazineSubscribeManage Your SubscriptionGive a Gift SubscriptionGet Help Subscribe Manage Your Subscription Give a Gift Subscription Get Help Subscribe Manage Your Subscription Give a Gift Subscription Get Help Newsletters Sweepstakes EntertainmentCelebrityMoviesMusicTVSportsAwards & EventsBooks Celebrity Movies Music TV Sports Awards & Events Books Celebrity Movies Music TV Sports Awards & Events Books CrimeCrime NewsSerial KillersCultsCrime History Crime News Serial Killers Cults Crime History Crime News Serial Killers Cults Crime History Human InterestReal PeopleNewsAstrologyAnimals Real People News Astrology Animals Real People News Astrology Animals LifestyleFoodHealthHomeTravelStyleStyleWatch Food Health Home Travel Style StyleWatch Food Health Home Travel Style StyleWatch Royals StyleWatch ShoppingFashionBeautyHomeKitchenTravel ProductsPetsGiftsSales & DealsPeople Tested Fashion Beauty Home Kitchen Travel Products Pets Gifts Sales & Deals People Tested Fashion Beauty Home Kitchen Travel Products Pets Gifts Sales & Deals People Tested 1Travis Decker, Dad Accused of Killing 3 Daughters, Allegedly Tracked By Authorities After Weeklong Manhunt: Police 2Barbara Walters' Friends Reveal Her Biggest Regrets, Private Struggles and Greatest Triumphs (Exclusive) 3Terry Moran Terminated from ABC After X Post Criticizing Trump Administration 4Mom Saw Part of Son's Brain on the Ground After Accident. Doctors Told His Parents to Say Their Goodbyes (Exclusive) **Candice King Reveals the Surprising Place She Bonded with HerWe Were LiarsSisters Mamie Gummer and Caitlin Fitzgerald (Exclusive)** King, Gummer and Fitzgerald play the three older Sinclair sisters in the Prime Video adaptation of E. Lockhart's bestselling book Jamie McCarthy/Getty **NEED TO KNOW** Candice King stars alongside Mamie Gummer and Caitlin FitzGerald as the three older Sinclair sisters in the upcoming Prime Video adaptation of E. Lockhart's bestselling novelWe Were Liars At the Tribeca Film Festival premiere of the series in New York City, King, 38, tells PEOPLE how she quickly bonded with Gummer and FitzGerald before shooting began \"It was very easy to bond with Mamie and Caitlin,\" the actress admits It wasn't hard for the Sinclair sisters to bond before filming started onWe Were Liars. In the upcoming Prime Video adaptation ofE. Lockhart's beloved book,Candice King, Caitlin Fitzgerald andMamie Gummerplay the three Sinclair sisters, Bess (King), Penny (FitzGerald) and Carrie (Gummer), whose children, the titular \"Liars,\" make some life-changing decisions one summer. The actresses first met after they were cast, and King says they developed their chemistry off-screen quite quickly. \"It was very easy to bond with Mamie and Caitlin,\" King tells PEOPLE on the red carpet at the June 10 Tribeca Film Festival premiere ofWe Were Liarsin New York City. Jamie McCarthy/Getty **King says she was able to bond quickly with her costars over motherhood, as they all have young kids** \"We laughed the first day that we met at the production office [and] the next stop that we all made together to get to know each other was to go to Walmart because we had to buy summer toys for our kids.\" Looking back on it, she says there's \"really no [better] way to bond than going to a giant superstore with a bunch of new, amazing women.\" Afterward, they were \"hanging out in the car and having some girl therapy for a few hours\" together, which connected them even more. **Related Stories** Both King and Gummer are mothers of two. King shares daughtersFlorenceandJosephinewithex-husband Joe King, while Gummer shares son Peter and daughter Mary withher ex-husband Mehar Sethi. Meanwhile, Fitzgerald welcomed her first child with husband Aidan Turner in 2022. **Fitzgerald says that their real-life connection helped them play around with how vicious their characters are to each other onscreen** Though the women play sisters who are most often at each other's throats rather than empathizing with each other, Fitzgerald, 41, tells PEOPLE the trio are \"much nicer to each other in real life than we are on television.\" \"I think we were able to be so unkind to each other [on camera] because it felt like a really safe space,\" she says on the red carpet. Jessie Redmond/Prime \"They're such great girls,\" theMasters of Sexstar adds of King and Gummer, 41. \"We had so much fun.\" **When it came to playing Bess, who is keeping plenty of her own secrets over the course of the summer, King says there was a \"lot of family drama to unpack\"** \"It's a very sharp relationship,\" she says of her character's dynamic with her daughter Miren, played byEsther McGregor. Miren is one of the four titular \"Liars,\" along with Cadence (Emily Alyn Lind), Johnny (Joseph Zada) and Gat (Shubham Maheshwari). \"I feel like that's the only word that pops into [my head]. It's a cutting relationship.\" Jessie Redmond/Prime \"[Bess is] always trying to kind of curate her life, and if she can curate it enough on the outside, maybe she'll find joy on the inside, which, according to therapists, is not the way to find joy,\" King quips of her character. The upcoming series takes place over the course of two summers and follows Cadence (Lind) and her \"tight-knit inner circle, nicknamed the Liars, during their summer escapades on her grandfather's New England private island.\" \"The Sinclairs are American royalty—known for their good looks, old money, and enviable bond—but after a mysterious accident changes Cadence's life forever, everyone, including her beloved Liars, seems to have something to hide,\" reads the official synopsis. Never miss a story — sign up forPEOPLE's free daily newsletterto stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories. We Were Liarspremieres Wednesday, June 18 on Prime Video. Entertainment TV Scripted TV Shows Settings Sign Out **Related Articles** **Follow Us** News Entertainment Royals Lifestyle StyleWatch Shopping About Us PEOPLE Tested Editorial Policy Careers Privacy Policy Contact Us Terms of Service Advertise Your Privacy Choices"}