{"id": 1014, "name": "Nine.com.au", "domain": "nine.com.au", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://wwos.nine.com.au/cricket/icc-world-test-championship-final-2025-beau-webster-kagiso-rabada-review-stuart-broad-comments-australia-south-africa/4debfb5d-c255-45cc-8ea8-1e80889ffaad", "title": "Icc World Test Championship Final 2025 Beau Webster Kagiso Rabada Review Stuart Broad Comments Australia South Africa", "content": "Watch TV News Sport Lifestyle Travel Entertainment Product Reviews openNewStan openNewDomain openNewDrive openNew2GB Nine’s Wide World of Sports All sports Crickettick AFL NRL Rugby Football Golf Motorsport Netball Tennis T20RCB190/9 (20.0)PBKS184/7 (20.0) ODINED225 (49.1)NEP226/5 (47.1) ODISCO262/9 (50.0)NED218 (45.0) T20JSY116/8 (20.0)GSY65/2 (10.0) T20ENG188/6 (20.0)WI167/9 (20.0) T20SER214/6 (20.0)SVN211/9 (20.0) T20SER200/1 (14.1)SVN199/7 (20.0) T20JSY116/3 (12.1)GSY107/7 (13.0) T20JSY130/8 (20.0)GSY127/8 (20.0) T20CZE113 (18.4)AUT117/0 (11.4) T20SER226/3 (20.0)SVN202/8 (20.0) ODISCO323/6 (50.0)NEP321 (50.0) T20CZE102/9 (13.0)NOR139/4 (13.0) T20ENG199/6 (18.3)WI196/6 (20.0) T20AUT137 (19.3)NOR159/6 (20.0) T20CZE63 (13.2)AUT224/5 (20.0) T20CZE133/5 (20.0)NOR174/6 (20.0) ODINED220 (49.2)NEP236/9 (50.0) T20NOR149/8 (20.0)AUT155/1 (13.5) T20ENG248/3 (20.0)WI211/8 (20.0) T20INA71/4 (11.1)CAM- TESTSA43/4 (22.0)AUS212 (56.4) T20INA-CAM- T20INA-CAM- ODISCO-NED- T20IRE-WI- T20DEN-FIN- T20INA-CAM- T20INA-CAM- T20FIN-NOR- T20DEN-SWE- T20DEN-NOR- T20IRE-WI- T20FIN-SWE- T20INA-CAM- T20INA-CAM- Sport Cricket **'Goodness me': South Africa cruelled by skipper's DRS blemish after Beau Webster's lucky reprieve** Following Australia's horror start in the World Test Championship final, things could've been even worse during the second session. But luckily,Beau Webstersurvived an lbw shout that should've sent him packing. South Africa's Kagiso Rabada was on fire with the ball during day one having dismissed Usman Khawaja and Cameron Green early.Australia were 4-67 at lunch. READ MORE:Origin star in doubt as Bulldogs flyer called into camp READ MORE:Saints star calls rival to 'clear the air' after wild report READ MORE:Gould whacks 'flawed system' as 'unfair' Kikau call reversed On 8 off 13 balls, Webster was unable to keep out a Rabada delivery that nipped back in with an appeal following. Umpire Richard Illingworth gave it not out and Temba Bavuma didn't review. Beau Webster survived an lbw shout.Amazon Prime \"Rabada is all over Beau Webster like a rash,\" Nasser Hussain said on Amazon Prime. Upon watching a replay, England great and South Africa bowling consultant Stuart Broad suggested there should've been a review. \"Goodness me, does that not look pretty close?,\" he said. Matthew Hayden added: \"You could mount a case there\". Bavuma was seen suggesting the ball had hit the pad. Temba Bavuma suggests to his teammates Beau Webster hit the ball.Amazon Prime However, the replay showed Webster whacked his bat into his back pad and missed the ball. Ball tracking technology then showed the impact was in line and the ball was hitting the stumps. \"Three reds, Stuart Broad spot on,\" Hussain said. \"Classic Test match cricket, brilliant from Rabada,\" he added as Webster played and missed the final delivery. In the previous over, Bavuma had reviewed a similar delivery from Marco Jansen to Webster. The impact of that ball was ruled as umpire's call after Chris Gaffaney had said not out. Marco Jansen's delivery to Beau Webster.Amazon Prime \"An absolute whisker at best,\" Hayden said. Towards the end of the first session, Jansen was denied a wicket too with Steve Smith given not out for an lbw appeal. The wickets hitting was ruled as umpire's call. Steve Smith is given not out.Amazon Prime Smith at the time was on 26 before moving past 50 in the second session. Later, at 4-129, another lbw review came with Webster on 23. It was off Lungi Ngidi's bowling but the replay showed Webster middled the delivery. \"The reviews have not been the best part of their play today,\" Ian Smith said. Webster was eventually dismissed for 72 by Rabada. Cricket Test cricket Kagiso Rabada Stuart Broad South Africa Cricket Australia **Most viewed in Cricket** 14 wickets fall as Aussies fire late on chaotic day **14 wickets fall as Aussies fire late on chaotic day** **14 wickets fall as Aussies fire late on chaotic day** 'Unbelievable' catch puts heat on Aussie top order **'Unbelievable' catch puts heat on Aussie top order** **'Unbelievable' catch puts heat on Aussie top order** 'Had a point to prove': Inside story of 'angry' Smith's finest moment **'Had a point to prove': Inside story of 'angry' Smith's finest moment** **'Had a point to prove': Inside story of 'angry' Smith's finest moment** Proteas rue DRS blemish after Webster's lucky reprieve **Proteas rue DRS blemish after Webster's lucky reprieve** **Proteas rue DRS blemish after Webster's lucky reprieve** **Latest** State of Origin **'Mind games': NSW star accuses Slater of faking team changes** 1 hour ago NRL **'Didn't look good': Dogs deny rift after sheds video leaked** 2 hours ago Swimming **Sweet thought driving dad-to-be Chalmers to Olympics** 2 hours ago facebook instagram x About Contact Meet the Team Live TV TV Shows Categories Connect your TV How to watch TV Guide Latest National World Politics Tech Weather Finance Today Show A Current Affair 60 Minutes Live Scores Olympics NRL Cricket Tennis AFL Rugby Football Athletics Golf Combat Latest Royals Style Celebrity Kitchen Travel Coach You Parenting Money Horoscopes Latest TV Shows MAFS The Block Love Island Lego Masters Tipping Point The Floor The Golden Bachelor Getaway Travel Guides Technology Beauty Style + Fashion Living Kitchen Health + Fitness Parenting Gift Ideas 2GB 3AW 4BC 6PR TV Shows Movies Sport Stan Originals Advice & Guides Property Search Home Loans Home Price Guide Car Reviews Car News New Car Showroom Cars for Sale Entertainment News Online Television Home Log In Newsletters Work with us Advertise with us Support Terms of use Privacy ©2025Nine Entertainment Co."}