{"id": 985, "name": "WJXT - News4Jax", "domain": "news4jax.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.news4jax.com/station/2024/04/18/how-we-are-using-ai-at-graham-media-group/", "title": "How We Are Using Ai At Graham Media Group", "content": "NewsWatch LiveLocal NewsFloridaGeorgiaNationalPolitics & PowerPoliticsI-TeamTrust IndexCommunityHealthMoneyEducationConsumerEntertainmentWeird News News Watch Live Local News Florida Georgia National Politics & Power Politics I-Team Trust Index Community Health Money Education Consumer Entertainment Weird News News Watch Live Local News Florida Georgia National Politics & Power Politics I-Team Trust Index Community Health Money Education Consumer Entertainment Weird News WeatherWeather NewsTrafficSnapJAXSkycamsAlertsHurricanesPlan and PrepareGeorgiaSt. AugustineEnvironmentForecasting Change Weather Weather News Traffic SnapJAX Skycams Alerts Hurricanes Plan and Prepare Georgia St. Augustine Environment Forecasting Change Weather Weather News Traffic SnapJAX Skycams Alerts Hurricanes Plan and Prepare Georgia St. Augustine Environment Forecasting Change News4JAX+Watch LiveNews4JAX InsiderHow To Watch News4JAX+Download News4JAX AppsThe Morning ShowRiver City LivePodcastsThis Week In JacksonvilleBusiness EditionSolutionariesNEXTGEN TVTV ListingsFlorida Justice News4JAX+ Watch Live News4JAX Insider How To Watch News4JAX+ Download News4JAX Apps The Morning Show River City Live Podcasts This Week In Jacksonville Business Edition Solutionaries NEXTGEN TV TV Listings Florida Justice News4JAX+ Watch Live News4JAX Insider How To Watch News4JAX+ Download News4JAX Apps The Morning Show River City Live Podcasts This Week In Jacksonville Business Edition Solutionaries NEXTGEN TV TV Listings Florida Justice SportsSports VideosJaguarsJaguars StatsNews4JAGS PodcastGators BreakdownGators StatsHigh School SportsVarsity 4Going Ringside PodcastV4rsity PodcastAll Star AthleteOlympics Sports Sports Videos Jaguars Jaguars Stats News4JAGS Podcast Gators Breakdown Gators Stats High School Sports Varsity 4 Going Ringside Podcast V4rsity Podcast All Star Athlete Olympics Sports Sports Videos Jaguars Jaguars Stats News4JAGS Podcast Gators Breakdown Gators Stats High School Sports Varsity 4 Going Ringside Podcast V4rsity Podcast All Star Athlete Olympics FeaturesNews4JAX InsiderFlorida Justice4 Your NeighborhoodEvents CalendarPositively JAXRiver City LiveDeals4JAXNews4JAX+Women’s History MonthLook LocalTravelJacksonville Image AwardsFood & RecipesLive HealthyContests & RulesTalking HealthPetsuSay Voting Features News4JAX Insider Florida Justice 4 Your Neighborhood Events Calendar Positively JAX River City Live Deals4JAX News4JAX+ Women’s History Month Look Local Travel Jacksonville Image Awards Food & Recipes Live Healthy Contests & Rules Talking Health Pets uSay Voting Features News4JAX Insider Florida Justice 4 Your Neighborhood Events Calendar Positively JAX River City Live Deals4JAX News4JAX+ Women’s History Month Look Local Travel Jacksonville Image Awards Food & Recipes Live Healthy Contests & Rules Talking Health Pets uSay Voting River City LiveWatch River City LiveRiver City+Eats & TreatsBeatsWellnessLocal SpotlightPetsShopping River City Live Watch River City Live River City+ Eats & Treats Beats Wellness Local Spotlight Pets Shopping River City Live Watch River City Live River City+ Eats & Treats Beats Wellness Local Spotlight Pets Shopping SnapJAXSnapJAX StoriesBreaking News Photos SnapJAX SnapJAX Stories Breaking News Photos SnapJAX SnapJAX Stories Breaking News Photos NewslettersSign Up For Newsletters Newsletters Sign Up For Newsletters Newsletters Sign Up For Newsletters WJXTContact UsHelp CenterCareers at WJXT/WCWJSnapJAXMeet the TeamAdvertise with us WJXT Contact Us Help Center Careers at WJXT/WCWJ SnapJAX Meet the Team Advertise with us WJXT Contact Us Help Center Careers at WJXT/WCWJ SnapJAX Meet the Team Advertise with us CW17CW Program GuideBounce CW17 CW Program Guide Bounce CW17 CW Program Guide Bounce News Weather News4JAX+ Sports Features River City Live SnapJAX Newsletters WJXT CW17 News Weather News4JAX+ Sports Features River City Live SnapJAX Newsletters WJXT CW17 LIVE BREAKING NEWS BREAKING NEWS Published:April 18, 2024 at 3:42 PM Updated:April 19, 2024 at 4:27 PM **LATEST NEWS** **JSO arrests man accused of making threats against ICE protesters on social media** **JSO arrests man accused of making threats against ICE protesters on social media** **LIVE RADAR: Scattered showers, thunderstorms pushing through Northeast Florida** **LIVE RADAR: Scattered showers, thunderstorms pushing through Northeast Florida** **Mayor Deegan’s office says she has concerns about the immigration bill. She will review it and weigh all options** **Mayor Deegan’s office says she has concerns about the immigration bill. She will review it and weigh all options** **JSO responding to reported shooting near Copeland’s on city’s Southside; 1 person critically injured** **JSO responding to reported shooting near Copeland’s on city’s Southside; 1 person critically injured** **DEALS 4 JAX** **Get 8 Japanese Master Chef knives in a gift box for just $109.97!** **Get 8 Japanese Master Chef knives in a gift box for just $109.97!** **How we are using AI at Graham Media Group** **How We Use AI** Content Creation and Curation:We use AI to assist in generating news summaries, identifying trending topics, and curating personalized content for our readers. AI algorithms analyze large volumes of information to highlight relevant news stories based on your interests. Automated Reporting:We utilize AI to produce accurate and immediate coverage for specific types of data-driven stories, such as financial reports or sports results. These algorithms are designed to understand and convert data into readable articles. This content might be used for articles, descriptions or captions for videos, graphics or images, or comments. All automated reporting will be reviewed and edited before it is published. Fact-Checking and Verification:In addition to traditional and rigorous means our journalists use to fact-check content, AI tools help us verify the authenticity of content, including images and videos. They assist in identifying potential misinformation and ensuring the accuracy of the information we publish. Reader Engagement:AI enhances user experience on our website, including chatbots for customer service inquiries and algorithms that recommend articles tailored to individual reading habits. **Our Commitment** Transparency:We are transparent about using AI and its role in our news production process. While AI aids in efficiency and accuracy, our journalists always make final editorial decisions. Ethical Considerations:We adhere to strict ethical guidelines in using AI, ensuring that it is used responsibly and does not compromise journalistic integrity or bias in our reporting. Data Protection:We prioritize the privacy and security of our readers. Any personal data used to train our AI algorithms or to personalize content is handled in strict compliance with ourprivacy policy. Accuracy and Accountability:Our editorial team monitors and reviews all AI-generated content to maintain our high standards of accuracy and reliability. We are committed to correcting any errors and being accountable for the content we publish. Anthropomorphizing AI:We do not anthropomorphize AI. Although attributing human characteristics to AI can be engaging and amusing, such practices may lead to confusion and inadvertently ascribe undue merit to artificial entities. **Continuous Evaluation** We continuously evaluate our use of AI technologies to ensure they align with our mission to inform and delight our communities and maintain the standards of trust our communities have given us. We welcome feedback from our readers and are committed to adjusting our practices to serve you better. Graham Media Group 2024 **DEALS 4 JAX** **Get 8 Japanese Master Chef knives in a gift box for just $109.97!** **Get 8 Japanese Master Chef knives in a gift box for just $109.97!** **Stop what you’re doing—get this MacBook Air for $199.97 (79% off!)** **Stop what you’re doing—get this MacBook Air for $199.97 (79% off!)** TV Listings TV Listings TV Listings Email Newsletters Email Newsletters Email Newsletters RSS Feeds RSS Feeds RSS Feeds Contests and Rules Contests and Rules Contests and Rules Contact Us Contact Us Contact Us Careers at WJXT / WCWJ Careers at WJXT / WCWJ Careers at WJXT / WCWJ Closed Captioning / Audio Description Closed Captioning / Audio Description Closed Captioning / Audio Description WJXT Public File WJXT Public File WJXT Public File WJXT EEO Report WJXT EEO Report WJXT EEO Report WCWJ Public File WCWJ Public File WCWJ Public File WCWJ EEO Report WCWJ EEO Report WCWJ EEO Report Terms of Use Terms of Use Terms of Use Privacy Policy Privacy Policy Privacy Policy Do Not Sell My Info Do Not Sell My Info Do Not Sell My Info FCC Applications FCC Applications FCC Applications Cookie Preferences Cookie Preferences Cookie Preferences If you need help with the Public File, call(904) 393-9801 At WJXT, we are committed to informing and delighting our audience. In our commitment to covering our communities with innovation and excellence, we incorporate Artificial Intelligence (AI) technologies to enhance our news gathering, reporting, and presentation processes.Read our articleto see how we are using Artificial Intelligence. Copyright © 2025 News4JAX.com is managed by Graham Digital and published by Graham Media Group, a division of Graham Holdings."}