{"id": 1362, "name": "The Canadian Press", "domain": "thecanadianpress.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thecanadianpress.com/content-services/newsfeed-subscription/digital-signage-content-feeds/", "title": "Digital Signage Content Feeds", "content": "**Your cart** ServicesContent ServicesNewsfeed SubscriptionDigital Signage ContentCustom Content CreationMultimediaArticlesGraphicsAudioPhotosVideoCP Images PlatformEditorial ProductionEditing ServicesPage Design & LayoutDigital Content CurationEditorial Planning Content ServicesNewsfeed SubscriptionDigital Signage ContentCustom Content Creation Newsfeed Subscription Digital Signage Content Custom Content Creation MultimediaArticlesGraphicsAudioPhotosVideoCP Images Platform Articles Graphics Audio Photos Video CP Images Platform Editorial ProductionEditing ServicesPage Design & LayoutDigital Content CurationEditorial Planning Editing Services Page Design & Layout Digital Content Curation Editorial Planning Content ServicesNewsfeed SubscriptionDigital Signage ContentCustom Content Creation Newsfeed Subscription Digital Signage Content Custom Content Creation Newsfeed Subscription Digital Signage Content Custom Content Creation MultimediaArticlesGraphicsAudioPhotosVideoCP Images Platform Articles Graphics Audio Photos Video CP Images Platform Articles Graphics Audio Photos Video CP Images Platform Editorial ProductionEditing ServicesPage Design & LayoutDigital Content CurationEditorial Planning Editing Services Page Design & Layout Digital Content Curation Editorial Planning Editing Services Page Design & Layout Digital Content Curation Editorial Planning Topics & RegionsTopicsBusiness & FinancePoliticsSportsEntertainmentView All TopicsSpecial EventsElectionsOlympicsWorld Cup SoccerRegionsCanada/NationalRegionalWorldDataElection ResultsSports DataFinancial Data TopicsBusiness & FinancePoliticsSportsEntertainmentView All Topics Business & Finance Politics Sports Entertainment View All Topics Special EventsElectionsOlympicsWorld Cup Soccer Elections Olympics World Cup Soccer RegionsCanada/NationalRegionalWorld Canada/National Regional World DataElection ResultsSports DataFinancial Data Election Results Sports Data Financial Data TopicsBusiness & FinancePoliticsSportsEntertainmentView All Topics Business & Finance Politics Sports Entertainment View All Topics Business & Finance Politics Sports Entertainment View All Topics Special EventsElectionsOlympicsWorld Cup Soccer Elections Olympics World Cup Soccer Elections Olympics World Cup Soccer RegionsCanada/NationalRegionalWorld Canada/National Regional World Canada/National Regional World DataElection ResultsSports DataFinancial Data Election Results Sports Data Financial Data Election Results Sports Data Financial Data Media Monitoring & PRTools for PR Pros and MarketersNEW – Live CalendarMedia MonitoringPress Release Distribution Tools for PR Pros and MarketersNEW – Live CalendarMedia MonitoringPress Release Distribution NEW – Live Calendar Media Monitoring Press Release Distribution Tools for PR Pros and MarketersNEW – Live CalendarMedia MonitoringPress Release Distribution NEW – Live Calendar Media Monitoring Press Release Distribution NEW – Live Calendar Media Monitoring Press Release Distribution StylebooksWriting ResourcesStylebookCaps & SpellingGuide de rédactionCP Style WebinarsStyle WorkshopsStyle Certification Writing ResourcesStylebookCaps & SpellingGuide de rédaction Stylebook Caps & Spelling Guide de rédaction CP Style WebinarsStyle WorkshopsStyle Certification Style Workshops Style Certification Writing ResourcesStylebookCaps & SpellingGuide de rédaction Stylebook Caps & Spelling Guide de rédaction Stylebook Caps & Spelling Guide de rédaction CP Style WebinarsStyle WorkshopsStyle Certification Style Workshops Style Certification Style Workshops Style Certification AboutOur StoryOur Team & ValuesOur AchievementsOur Work PortfolioPartnershipsAnnouncementsCareers Our StoryOur Team & ValuesOur AchievementsOur Work PortfolioPartnershipsAnnouncementsCareers Our Team & Values Our Achievements Our Work Portfolio Partnerships Announcements Careers Our StoryOur Team & ValuesOur AchievementsOur Work PortfolioPartnershipsAnnouncementsCareers Our Team & Values Our Achievements Our Work Portfolio Partnerships Announcements Careers Our Team & Values Our Achievements Our Work Portfolio Partnerships Announcements Careers Contact Case StudiesBy SolutionMarketingPublic Relations By SolutionMarketingPublic Relations Marketing Public Relations By SolutionMarketingPublic Relations Marketing Public Relations Marketing Public Relations AboutOur StoryOur Team & ValuesOur AchievementsPartnershipsCareers Our StoryOur Team & ValuesOur AchievementsPartnershipsCareers Our Team & Values Our Achievements Partnerships Careers Our StoryOur Team & ValuesOur AchievementsPartnershipsCareers Our Team & Values Our Achievements Partnerships Careers Our Team & Values Our Achievements Partnerships Careers **Digital Signage Content Feeds** **Compelling content for digital signage networks** Home / Content Services / Newsfeed Subscription / Digital Signage Content **Digital Signage Content Feeds** As Canada's bilingual national news agency, The Canadian Press is the source trusted by major digital, broadcast and print media such as MSN, Cineplex, CBC, La Presse and the Globe and Mail. Maximize viewer engagement for your brand messages or increase ad revenue for your digital signage network by having your promotional content appear alongside fresh, dynamic news from a reputable source. We help digital signage clients captivate their audiences in: Airports & airplanes Cars & car dealerships Movie theatres & sports centres Banks, grocery stores & malls Elevators in buildings Medical & dental offices Schools, gas stations & more **Need us to package the news in a turnkey design?** We provide our raw feeds to clients that prefer using their own design templates for displaying our news. If you need us to deliver our headlines and photos in a turnkey design that can be published \"as is\", we offer the following options that can also work without audio, powered by Screenfeed (SEE DETAILSon available delivery methods and size formats): **** **** **Screenfeed’s infotainment products available from CP** **Delivery Options** MRSS, Direct URL, Flash playback, HTML playback, and XML. **Size Formats** Available in 16:9, 9:16, and 4:3. Easily customized to fit alternate-size zones, such as sidebars and footers. **Content Control** Keyword filtering, and online moderation options. **Audio Optional** No audio requirement for content presentation. **** **** Screens served globally every day Recent stories, at all times Screen time per graphic asset Available loop fill per category **Trusted by leading brands for digital signage content** Former Senior Editor at Captivate says: The Canadian Press is invaluable as a provider of up-to-the-minute news for Captivate’s network of flat-panel TVs in elevators and office towers across Canada. When a big story breaks, we know they will be on top of it. Michal Kapral Content Manager at Impax Media says: For our digital signage network of screens in grocery stores, we needed quality, local-oriented news in French with daily pictures and text via FTP. The Canadian Press fulfilled that mandate when others could not. Their stories are sourced very thoughtfully – they’re timely, interesting, sometimes fun, not offensive and the pictures are excellent quality. We’re also able to filter out content our customers don’t want using keywords. The service and tech support are very good, and the pricing is competitive. Rona Katz Senior Creative Director at Neo Traffic says: We have digital screens in shopping centres across Canada, including Montreal. We needed sports and entertainment news headlines with photos for our screens. Neo Traffic was looking for something affordable and it was important to have English and French Canadian news. We also wanted real-time updates, so when news breaks, it’s on screens right away. Getting all this content from one provider is the biggest benefit of working with The Canadian Press. They deliver news content in a way that works well for digital signs. Trent Martin **Ready to add real-time, reliable news to captivate your digital audience?** Contact us today for pricing and a free trial to evaluate our content. **Ready to use news and infotainment to engage your digital audience?** Contact us today to get: A response in 24 hours from a knowledgeable specialist. Answers to your questions about pricing and more. A no-obligation demo or free trial of our digital signage feeds. sales@thecanadianpress.com Response in 24 hours (Monday-Friday) Content Services Newsfeed Subscription Digital Signage Content Custom Content Creation Multimedia Articles Graphics Audio Photos Video CP Images Platform Editorial Production Editing Services Page Design & Layout Digital Content Curation Editorial Planning Topics Business & Finance Politics Sports Entertainment View All Topics Special Events Elections Olympics World Cup Soccer Regions Canada/National Regional World Data Election Results Sports Data Financial Data Tools for PR Pros and Marketers NEW – Live Calendar Media Monitoring Press Release Distribution Writing Resources Stylebook Caps & Spelling Guide de redaction CP Style Webinars CP Style Workshops CP Style Certification By Solution Media Marketing Public Relations Our Story Our Team & Values Our Achievements Our Work Portfolio Partnerships Careers How can we help? Sales & Customer Service Our Newsrooms © The Canadian Press 2025 Privacy & Accessibility"}