{"id": 2207, "name": "FM Observer", "domain": "fmobserver.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://fmobserver.com/west-fargos-new-mask-strategy-is-basically-to-not-upset-anyone-by-imposing-a-mask-mandate/#respond", "title": "West Fargos New Mask Strategy Is Basically To Not Upset Anyone By Imposing A Mask Mandate", "content": "**FM Observer Fargo Moorhead Satire News and Entertainment** **The Fargo Moorhead area's greatest satirical news and entertainment source. Most stories are farcical in nature.** Home NewsLocalNationalNews Of YoreNews From The FutureStrange But True Local National News Of Yore News From The Future Strange But True Local National News Of Yore News From The Future Strange But True EntertainmentCelebrityFashion & StyleFilmGamingMusicOffbeatTechnologyReviewsMoviesMusicVideo GamesTelevisionVideo Celebrity Fashion & Style Film Gaming Music Offbeat Technology ReviewsMoviesMusicVideo Games Movies Music Video Games Television Video Celebrity Fashion & Style Film Gaming Music Offbeat Technology ReviewsMoviesMusicVideo Games Movies Music Video Games Movies Music Video Games Television Video SportsACTIONHIGHSCHOOLMLBMMANASCARNBANCAA BasketballNCAA FootballNFL ACTION HIGHSCHOOL MLB MMA NASCAR NBA NCAA Basketball NCAA Football NFL ACTION HIGHSCHOOL MLB MMA NASCAR NBA NCAA Basketball NCAA Football NFL EditorialRecipes For SuccessYa Heard? Recipes For Success Ya Heard? Recipes For Success Ya Heard? The LoungeGifsPicturesVideos Gifs Pictures Videos Gifs Pictures Videos AboutLinks Links Links Contact Us **West Fargo’s New Mask Strategy Is Basically To Not Upset Anyone By Imposing A Mask Mandate** Question: What is the mask strategy? Answer: To not do anything that would effectively slow the spread of the coronavirus. West Fargo, ND – Rather than imposing a mask mandate like neighboring Fargo finally did, West Fargo’s wizards of smart decided to implement a Mask Strategy. You may ask: What is West Fargo’s mask strategy? Apparently West Fargo’s mask strategy is to “strongly encourage” the wearing of masks without hurting the feelings of any pandemically-challenged people who think wearing a mask is just too difficult. (Most anti-maskers realize too late that being intubated is a lot more difficult than simply wearing a mask.) Unfortunately, it seems that strong encouragement and invitations for personal responsibility don’t get through to blockheads that either don’t understand the serious nature of a highly contagious pandemic or whose stubbornness will eventually lead to our collective demise. The FM Observer would like to congratulate the West Fargo City Commission on having a special meeting to come up with a strategy that has less teeth than a jellyfish and which will result in zero effect toward stemming the tidal wave of exponential covidian spread. Bio Latest Posts Family’s Robot Vacuum Cleaner Found Guilty Of Terrorizing And Threatening Behavior- March 12, 2021 The Great Musk Ox Migration To Come Directly Through The Fargo Area- November 30, 2020 West Fargo’s New Mask Strategy Is Basically To Not Upset Anyone By Imposing A Mask Mandate- October 27, 2020 Punditic Thoughts On The Vice Presidential Debate- October 8, 2020 **About Johnnny** Contributing writer since January, 2013. I've been described by myself as a piano-playing omnivore who hates typos but loves chocolate milk in his coffee. As a Life Coach, some lessons I like to pass onto others are: 1. don't stare at strangers, especially in jail, 2. don't leave fun to find fun, 3. never pet a burning dog, 4. don't eat more than you can lift, and 5. when in doubt, jot it down. Click on any picture in my posts to see them in their full glory. All have been tweaked with either PicMonkey.com or Pixlr.com/Express or Lunapic.com :o) **Post navigation**"}