{"id": 275, "name": "Corriere della Sera", "domain": "corriere.it", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://corrieredibologna.corriere.it/notizie/cultura-e-tempo-libero/25_giugno_09/lisa-varolo-la-ragazza-che-vive-negli-anni-cinquanta-mi-pettino-come-doris-day-e-mi-vesto-come-grace-kelly-cosi-faccio-anche-del-58eee625-1f96-4280-9462-1f20bd67axlk.shtml", "title": "Lisa Varolo La Ragazza Che Vive Negli Anni Cinquanta Mi Pettino Come Doris Day E Mi Vesto Come Grace Kelly Cosi Faccio Anche Del 58eee625 1f96 4280 9462 1f20bd67axlk.shtml", "content": "**Corriere di Bologna** ABBONATI Lo stato del tuo abbonamento #PLACEHOLDER# è sospeso.Per verificareclicca qui Carta di credito è SCADUTA.Per aggiornareclicca qui Carta di credito è IN SCADENZA.Per aggiornareclicca qui AccediProfiloNewsletterAbbonamentoEsci Le lezioni del Corriere Calcio Ucraina Russia Tennis Israele Cinema e Serie TV Meloni Podcast daily news Trump Ricette Putin Oroscopo Fox Prima Pagina Oggi Corriere TV Newsletter Sfoglia il giornale Gli eventi del corriere Le guide del Corriere Archivio Il punto Youreporter CRONACHE POLITICA ESTERI ECONOMIA OPINIONI DATAROOM SPORT SALUTE VIDEO - Corriere TV SPETTACOLI CULTURA LA LETTURA LOGIN: TECNOLOGIA E INNOVAZIONE LA SCELTA GIUSTA MODA COOK MOTORI 7 - Il settimanale LA27ORA SCUOLA Buone Notizie PIANETA 2030 Scienze & Ambiente ANIMALI PODCAST DIZIONARI OROSCOPO LOTTERIE METEO MAGAZINE Indietro News Ricette Wine & Cocktails Eventi Locali Video Cucina Indietro Design Design In Viaggio con Corriere Le notizie del 2024 Fotosintesi di Beppe Severgnini Palomar di Antonio Polito Visto da vicino Indietro 18 secondi A domani Accademia Arrampicare Dalla parte delle donne Dante Italia Essere Grandi Fortissime Genealogie Geni invisibili Giorno per Giorno I divini dell'Olimpo Il Corriere racconta Il futuro sostenibile Il Tempo delle Donne reloaded La Milanese Le figlie della Repubblica Le nostre vite L'ultima volontà Mama non mama Mi fido di Lei Nebbia Prima, durante, dopo Prime alla Scala Processo all'Auto Elettrica Questa è l'Europa Solo è il coraggio Sull'ali dorate Tech Emotion Tienimi la mano Tracce Tutta colpa di Basaglia Indietro Dizionario Citazioni Dizionario Come si dice Dizionario Francese Dizionario Inglese Dizionario Italiano Dizionario Latino Dizionario Modi di dire Dizionario Spagnolo Dizionario Tedesco Sinonimi e Contrari Indietro Le Firme Facce nuove di Paolo Lepri Frammenti di Ferruccio de Bortoli Il caffè di Gramellini Italians di Beppe Severgnini L'angolo di Gianluca di Marzio Lettere al direttore Lo dico al Corriere Oriente Occidente di Federico Rampini Padiglione Italia di Aldo Grasso Piccole Dosi di Franco Berrino Ultimo banco di Alessandro D'Avenia Indietro Finanza Borsa Risparmio Tasse Consumi Casa Affitti Mutui Lavoro Trasporti Imprese Life Pensioni Chiedi all'Esperto Guide Calcolatori Innovazione Opinioni Professionisti Euractiv Economia del futuro Eventi Snack News L'economia del futuro Non solo numeri di Daniele Manca Persone e Talenti Indietro Domande&Guide Quiz&Meme CampBus A Scuola con Corriere Mal di Tech Colazioni Digitali Indietro Cinema e Serie Tv Eurovision Festival di Cannes Festival di Venezia Oscar Sanremo Indietro News Ricette Wine & Cocktails Eventi Locali Video Cucina Indietro Figli & Genitori Sportello cancro Nutrizione Cardiologia Reumatologia Neuroscienze Dermatologia Eventi Dizionario Il Medico risponde eHealth Il tempo della salute Indietro Serie A Champions League Europa League Conference League Coppa Italia Serie B Calciomercato Tennis Formula 1 MotoGP Ciclismo Risultati live Nations League Europei Olimpiadi Australian Open Triathlon Un centimetro alla volta di Paolo Condò Man of the match Indietro News Prove Mobilità Sostenibile Saloni ed Eventi Moto Guide Video Motori Marche Blog Heavy Rider L'Esperto Risponde Indietro Elezioni Voci dal Parlamento Indietro Elezioni Francia Elezioni Germania Elezioni Regno Unito Elezioni Usa Voci dal vicino Oriente Oriente Occidente di Federico Rampini L'ultima Fenice: Democrazie vs Autocrazie Indietro la Lettura Infografiche Indietro Scuole elementari Scuole medie Scuole superiori e licei Università Maturità Test orientamento/ammissione Simulazione test medicina e altri La parola della settimana A scuola con il Corriere Indietro Muoviamoci contro la violenza sulle donne Il Tempo delle Donne reloaded Il Tempo delle Donne Uomini: I segni del cambiamento La felicità adesso Indietro Beauty & Bellezza Sfilate Donna News & Business Sfilate Uomo Indietro Pride Indietro Cani Biodiversità Gatti Opinioni Fauna selvatica Guide Mondo marino Adozioni Indietro IoDonna Living QuiMamme Style Viaggi Indietro Video Cronaca Video Politica Video Esteri Video Sport Video Spettacoli Video Dataroom Video Salute Video Virali Eventi Indietro Indice Climatico 2025 Meteo Milano Meteo Bologna Meteo Roma Meteo Firenze Meteo Napoli Meteo News Meteo Torino Indietro Ariete Toro Gemelli Cancro Leone Vergine Bilancia Scorpione Sagittario Capricorno Acquario Pesci CRONACA POLITICA ECONOMIA SPORT CULTURA E TEMPO LIBERO METEO È morto Brian Wilson, il genio visionario che fondò i Beach Boys: aveva 82 anni **I tuoi preferiti** Salva questo articolo e leggilo quando vuoi. Il servizio è dedicato agli utenti registrati. **Hai salvato un nuovo articolo** Trovi tutti gli articoli salvati nella tuaarea personalenella sezione preferiti e sull'app Corriere News. **Lisa Varolo, la ragazza che vive negli anni Cinquanta. «Mi pettino come Doris Day e mi vesto come Grace Kelly: così faccio anche del bene anche al pianeta»** Autrice del podcast «Vintagista moderna» e creator di una seguitissima pagina sui social nella quale condivide i suoi outfit anni ’50 e dispensa consigli sull’eleganza «circolare», ha fatto di una passione, un vero e proprio stile di vita Sembra che sia arrivata a bordo di una macchina del tempo quando la vedi passeggiare per le vie di Modenacon il suo look inconfondibile. Lisa Varolo, autrice del podcast«Vintagista moderna»e creator di una seguitissima pagina sui social nella quale condivide i suoi outfit anni ’50 e dispensaconsigli sull’eleganza «circolare», ha fatto di una passione, un vero e proprio stile di vita. Diplomatasi inarchitettura d’interni ed esternia Pavia, dopo una parentesi lavorativa come commessa in una profumeria, frequenta un corso di restauro di mobili antichi che accresce e approfondisce la suapassione per il vintage. Poi è arrivata la pandemia e la noia delle giornate passate a «scrollare» i social che però le fa scoprire i profili che parlavano della moda di epoche passate. «Da lì ho iniziato a prendere ispirazione per dei look che ricreassero lo stile degli anni ’50 e a vestirmi con capi attuali che ricordassero quelli d’epoca. Non ho iniziato subito acquistando i capi originali perché volevo prima capire quale fosse lo stile più adatto a me. Negli stessi anni ’50 ci sono varie tendenze che si adattavano alle differenti tipologie morfologiche presenti in quegli anni.Ad ogni corpo corrispondeva uno stile. Pian piano che prendevo confidenza, ho fatto il primo acquisto e ho iniziato a seguire le pagine social di vari negozi che propongono moda vintage. Uno qua, uno là ho trasformato completamente il mio guardaroba, facendo del bene anche all’ambiente». E non solo dato che ha anche un taglio di capelli degno di Doris Day. «Sì, per far rendere bene tutto l’outfit, bisogna curare i dettagli e acconciatura e trucco devono essere in armonia con gli abiti». Cosa caratterizza gli anni ’50 e perché proprio quest’epoca?«Non dobbiamo limitarci all’immagine iconica della donna con il vitino da vespa e la gonna a ruota. Sono anni in cui c’era l’imbarazzo della scelta nel crearsi un guardaroba e adattarlo alla propria fisicità. Il perché ha radici dalla mia infanzia, adolescenza quando ho visto i primi film di quegli anni, con le canzoni che sono degli evergreen. Anche se vestivo con abiti contemporanei, sceglievo sempre qualcosa che richiamasse lo stile dei “Fifties” L’estetica aveva una compostezza che oggi si è un po’ persa ed è impossibile ricrearla senza averla studiata. Un ’eleganza costruita sul dettaglio, sul “mai troppo”, sulla capacità di valorizzarsi con grazia, senza ostentazione. Mi è sempre piaciuta la ricerca di armonia, di proporzione e dignità nel vestire. La moda di oggi è più scialba, frenetica, legata a tendenze che durano una stagione. Invece io trovo straordinario che un abito degli anni ’50 possa emozionare ancora, raccontare qualcosa e avere una sua forza estetica anche nel presente. Quello stile aveva un’identità forte che incanta ancora oggi dopo tutti quegli anni». Quanto tempo impiega a vestirsi ogni giorno?«Dico sempre che la fase della “vestizione” deve essere un momento di estremo piacere, ovviamente richiede tempo che non sempre abbiamo nella frenesia della vita d’oggi. Però ci sono occasioni in cui mi prendo tutto il tempo che mi serve per prepararmi». Da una passione è nato un lavoro.«Non proprio a tempo pieno, ma sì. Ho iniziato a fotografarmi e a postare video sulla preparazione dei miei outfit sui social e piano, piano si è formata una community di donne appassionate come me alla moda vintage, con le quali ci scambiamo consigli o indirizzi per trovare la scarpa perfetta, la borsa dei sogni o l’abito dei film. I miei consigli continuano con una newsletter e nel podcast». Il look anni ’50 è considerato super accessoriato e quindi poco pratico.«Siamo portati a pensarlo perché il dress code a quel tempo prevedeva l’uso costante di cappello e guanti, accessori ormai quasi dimenticati ora, soprattutto quest’ultimi perché abbiamo sempre in mano il telefono che non può essere usato, ma in realtà erano cose che accrescevano la femminilità anche in chi non l’aveva. Un po’ tutto il modo di vestirsi dell’epoca era molto incline a far uscire la femmina che è in ogni donna». Qual è il capo di abbigliamento più richiesto?«C’è tanto interesse per le scarpe. Décolletés con un tacco medio alto, ma molto più comodo, più donanti, secondo me, delle calzature di oggi. Non facili da trovare, però». Ci si può realmente vestire come negli anni ’50 nella quotidianità?«Sì e lo dico andando contro lo stereotipo che vuole legare questa estetica agli abiti super glamour dei film hollywoodiani del tempo. In realtà io spesso esco con dei pantaloni, una camicetta e una scarpa con tacco basso, che era il look tipico delle donne ai tempi di Grace Kelly, che è la mia preferita. Quando porto al parco mia figlia, scelgo un abitino in cotone e le ballerine: comodo, pratico ed elegante». Come la prende la gente che la vede in giro abbigliata così?«C’è chi mi fa i complimenti e chi mi addita come fossi un alieno». Fate dei raduni?«Capita di partecipare ad eventi che riguardano il vintage in senso lato (auto d’epoca, modernariato…), ma non ho ancora organizzato nulla di mio. Quando e se lo farò, mi piacerebbe incentrarlo solo sull’eleganza, sulla moda». Art City, il pop up store di Margherita Maccapani Missoni: «In una galleria d'arte i miei capi versatili e vivaci» Art City, il pop up store di Margherita Maccapani Missoni: «In una galleria d'arte i miei capi versatili e vivaci» Art City, il pop up store di Margherita Maccapani Missoni: «In una galleria d'arte i miei capi versatili e vivaci» Bologna, i 60 anni di Vogue al Cinema Modernissimo con i film di Antonioni, Fellini, Coppola. «Resti un evento fisso per la città» Bologna, i 60 anni di Vogue al Cinema Modernissimo con i film di Antonioni, Fellini, Coppola. «Resti un evento fisso per la città» Bologna, i 60 anni di Vogue al Cinema Modernissimo con i film di Antonioni, Fellini, Coppola. «Resti un evento fisso per la città» Chi è Marco Bizzarri, il manager dell’alta moda. Dopo Gucci punta su Elisabetta Franchi: amico di Bottura, ama la cucina Chi è Marco Bizzarri, il manager dell’alta moda. Dopo Gucci punta su Elisabetta Franchi: amico di Bottura, ama la cucina Chi è Marco Bizzarri, il manager dell’alta moda. Dopo Gucci punta su Elisabetta Franchi: amico di Bottura, ama la cucina Nima Benati, fotografa di moda e la mostra a Bologna con i suoi scatti: «Donne forti e glamour, ora vorrei uno studio mio» Nima Benati, fotografa di moda e la mostra a Bologna con i suoi scatti: «Donne forti e glamour, ora vorrei uno studio mio» Nima Benati, fotografa di moda e la mostra a Bologna con i suoi scatti: «Donne forti e glamour, ora vorrei uno studio mio» Da Bologna all'Appennino, la storia dell'artigiana: «Torno a vivere in montagna e apro una bottega di moda contro lo spreco della pelle» Da Bologna all'Appennino, la storia dell'artigiana: «Torno a vivere in montagna e apro una bottega di moda contro lo spreco della pelle» Da Bologna all'Appennino, la storia dell'artigiana: «Torno a vivere in montagna e apro una bottega di moda contro lo spreco della pelle» Roberta Tagliavini, da «Cash or Trash» all'Ambrogino d'oro: «In tv facciamo più ascolti di Amadeus, con Bologna ci fu un addio violento ma la amo» Roberta Tagliavini, da «Cash or Trash» all'Ambrogino d'oro: «In tv facciamo più ascolti di Amadeus, con Bologna ci fu un addio violento ma la amo» Roberta Tagliavini, da «Cash or Trash» all'Ambrogino d'oro: «In tv facciamo più ascolti di Amadeus, con Bologna ci fu un addio violento ma la amo» La Ferrari nera di Maradona o la Bianchina di Fantozzi: «Auto e moto d’epoca» è cult La Ferrari nera di Maradona o la Bianchina di Fantozzi: «Auto e moto d’epoca» è cult La Ferrari nera di Maradona o la Bianchina di Fantozzi: «Auto e moto d’epoca» è cult Vai a tutte le notizie di Bologna Iscriviti alla newsletter del Corriere di Bologna 9 giugno 2025 ( modifica il 9 giugno 2025 | 12:22) © RIPRODUZIONE RISERVATA I primi appassionati sono arrivati verso le sette del mattino partendo, chi in macchina chi in treno, un po’ da tutta Italia **Corriere di Bologna** Le news principali su BolognaOgni giorno alle 18, a cura della redazione Per usufruire del servizio di domande e risposte de ilMedicoRispondeè necessario essere registrati al sito Corriere.ito a un altro dei siti di RCS Mediagroup. Non ricordi le credenziali? Recupera il tuo account Recupera il tuo account **La lettura di Corriere.it è in corso su un altro dispositivo!** Ti informiamo che con il tuo piano puoi leggere Corriere.it su1 dispositivoalla volta Questo messaggio verrà visualizzato su un altro dispositivo/accesso e tu potrai continuare a leggere le notizie da qui. L'altro dispositivo/accesso rimarrà collegato a questo account. Puoi accedere con il tuo account su tutti i dispositivi che desideri, ma utilizzandoli in momenti diversi secondo il tuo piano di abbonamento. Perché tu o qualcun altro sta leggendo Corriere.it con questo account su più didue dispositivi/accessi. Il tuo attuale abbonamento permette di leggere Corriere.it solo sudue dispositiviin contemporanea (computer, telefono o tablet). Se sei abbonato con un altro account accedi con le tue credenziali. Se siete in 2 o più che utilizzano lo stesso abbonamento, passa all'offerta Family e condividi l'abbonamento con altre due persone. Altrimenti, fai clic su \"Continua a leggere qui\" e assicurati di essere l'unica persona che visualizza Corriere.it con questo account. Ti consigliamo di cambiare la tua passwordcliccando qui"}