{"id": 1462, "name": "Norris Times-Herald", "domain": "timesherald.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.timesherald.com/2025/06/04/boys-volleyball-lansdale-catholic-gets-first-state-set-win-falls-to-york-suburban-in-piaa-2a-opener/", "title": "Boys Volleyball Lansdale Catholic Gets First State Set Win Falls To York Suburban In Piaa 2a Opener", "content": "E-Edition E-Edition NewsNewsLocal NewsThe LeaderRoxborough ReviewCoronavirusNational NewsElectionBusinessBest Reviews News Local News The Leader Roxborough Review Coronavirus National News Election Business Best Reviews News Local News The Leader Roxborough Review Coronavirus National News Election Business Best Reviews SportsSportsHigh School SportsPhiladelphia 76ersPhiladelphia EaglesPhiladelphia FlyersPhiladelphia PhilliesPhiladelphia Union Sports High School Sports Philadelphia 76ers Philadelphia Eagles Philadelphia Flyers Philadelphia Phillies Philadelphia Union Sports High School Sports Philadelphia 76ers Philadelphia Eagles Philadelphia Flyers Philadelphia Phillies Philadelphia Union Things to DoThings to DoEntertainmentRestaurants Food and DrinkMoviesMusic and ConcertsTV ListingsComicsPuzzlesEvents Things to Do Entertainment Restaurants Food and Drink Movies Music and Concerts TV Listings Comics Puzzles Events Things to Do Entertainment Restaurants Food and Drink Movies Music and Concerts TV Listings Comics Puzzles Events Opinion ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary ClassifiedsClassifiedsJobsPublic Notices Classifieds Jobs Public Notices Classifieds Jobs Public Notices Special Sections ToolsContact UsContests Contact Us Contests Contact Us Contests Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Subscribe Log in Logout Sign up for email newsletters to submit an obituary To place an obituary Monday through Friday, 8:30am to 3:00pm, please email obits@timesherald.com or call us at 610-235-2690 for further information. Saturday & Sunday, please contact obits@timesherald.com **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Subscribe Log in Sign up for email newsletters Subscribe Log in E-Edition E-Edition High School Sports 76ers Eagles Flyers Phillies Union TRENDING: Montco primary election results **BOYS VOLLEYBALL: Lansdale Catholic gets first state set win, falls to York Suburban in PIAA-2A opener** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X LANSDALE – Playing in their gym for a final time, Lansdale Catholic’s seniors wanted to go down swinging. With their graduation earlier in the day adding another layer of finality to Tuesday’s PIAA Class 2A boys volleyball first round game against York Suburban, the Crusaders tried for a major upset but settled on a bit of history. The state-ranked Trojans proved formidable in winning three straight sets only after LC had done something it never had prior. York Suburban claimed the match 3-1 (22-25, 25-11, 28-26, 25-16) while the Crusaders won their first-ever set in a state playoff match. “Earlier in the season, most times in a match like this, we’d just fold but I’m just proud of each and every one of my teammates,” LC senior libero Jordan Miller said. “We went down swinging. We left it all on the court and to know that’s the way we’re going out, that makes me happy. I can go out with that.” The Trojans, who were ranked No. 4 in the state in Class 2A by the PA Volleyball Coaches Association’s most recent poll, are a program that expects to contend for District III titles if not state titles on a yearly basis. Lansdale Catholic isn’t on that level yet and boys volleyball as a whole hasn’t quite reached the level in southeastern PA as it has in the mid-state but the Crusaders have made notable growth recently. Take the Crusaders’ nine seniors for example. Prior to their freshman year, none of them had played competitive volleyball and in Tuesday’s match, two of the senior starters were first-year volleyball players. They’ll leave having helped LC win the PCL title in 2024 – the school’s first Catholic League title in any boys’ team sport – win its first set in the state playoffs and with a PCL MVP thanks to outside hitter Sean Carr taking home the honors this season. “It’s not the result we wanted with a loss but these guys are my family,” Carr said. “They’re my best friends here and to go out fighting against a great team like that, to fight in that first and third set how we did, it’s amazing and I’m never going to forget that.” York Suburban scored the first point of the match, but LC responded with the next two. Carr knocked down a kill for a 3-2 lead in the first set the Crusaders wouldn’t give up, the senior adding another point on a block on the next rally. The Trojans hung around but a pair of three-point bursts by LC, the first started on a side-out kill by Carr helped the hosts at arm’s reach. Carr, seniors Shaun Emmerich and Kevin Montagna and sophomore Gavin Moore all had key points as LC took the set 25-22 and accomplished something no other Crusaders group had. “To have this group of guys who have played four years and to see it culminate with a state set win was really nice for our seniors to have,” LC coach Rachel Picozzi said. “We’re a very unassuming, small school in Lansdale but we have some big competitors and big athletes and I think coming out that way in the first set really showed the framework of what these guys are and what they can be.” The Trojans looked every bit the state-ranked squad they are in the second set, using a 9-0 scoring run to take a 13-3 lead on their way to a lopsided win to even the match. Much of their production came off the arm of junior outside hitter Trent Weinstein, who knocked down seven kills in the second set and 23 overall on the night. With Truett Miller also swinging well on the outside and the Trojan defense flying around the court, LC had to fight for every point. Picozzi explained York Suburban’s offensive tempo was level higher than most of the competition the Crusaders had seen during the year and coupled with some dynamic hitters, it made slowing the Trojans – especially Weinstein – down more difficult once they got going. “He did a really good job of getting around our block,” Miller said. “There were times where he would jump, our block would jump and come down and he would just hang up there. We have a couple guys that it’s their first time playing volleyball so there’s a little bit of inexperience but they did everything they could up there, he just played a fantastic game.” Carr and Miller both chalked up the team’s closeness as a significant part of its success this spring. The seniors particularly had come a long way from having no volleyball experience as freshman to having a league title as part of their legacy. Miller, who is attending West Chester and hopes to play club volleyball there, was effusive in his praise of all his teammates including first-year players Tim O’Brien and Peter Cusumano and made special note of Montagna, who has committed to play at Penn State-Altoona next year. Carr added that even though his class is leaving, he hopes to see the program continue adding more firsts like the Crusaders did the last two years. “We played for each other, that’s what it was,” Carr, who is attending the University of Maryland and also hoping to play club, said. “This is our first ever state set win, so to make history like that, it’s something we get to carry with us and you’ve gotta feel good about it.” This LC group also developed plenty of resiliency. With York Suburban looking at set point holding a 24-22 lead in the third set, the Crusaders staved off the end of the match four times before finally going down 28-26 in an extended frame. It was the kind of fight that Picozzi has seen become the normal with this group, one she listed among her all-time favorites to have coached. Whether it was Sean Williamson coming in to serve or Sean Patrick Walsh and Anthony Riccio playing different spots, all of the seniors had a part in the team identity. “They’re a great group of athletes who just want to compete,” Picozzi said. “They will do whatever it takes to get to that point. They knew this was their last time playing in this gym, win or lose, and coming off graduation today, I told them to fight for every single point and it’s a testament to who they are.” The Crusaders will have a very different looking team next year. Moore, who was tremendous late in that third set, is the only returning starter although Carr said there are some promising younger players coming up and Miller added his younger brother is planning to play next year when he gets to LC. “It goes by quickly,” Carr said. “You wish you could do it all over again, play a little harder here and there but it’s the lessons you learn along the way that make you see that.” Lansdale Catholic didn’t get the match win on Tuesday, but a significant senior class left their gym for the last time knowing they’d left all they had to give within its walls. “I trust every single one of my teammates with my whole heart, I would go to war for them,” Miller said. “They would say the same thing about everybody else and that’s what sets us apart. This isn’t just a team, it’s a family.” **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X **RevContent Feed** **Most Popular** Norristown High School graduation honors immigration as opportunity through sacrifice [Photos]Norristown High School graduation honors immigration as opportunity through sacrifice [Photos] **Norristown High School graduation honors immigration as opportunity through sacrifice [Photos]** **Norristown High School graduation honors immigration as opportunity through sacrifice [Photos]** Limerick man convicted of stalking, harassing girl he met in high schoolLimerick man convicted of stalking, harassing girl he met in high school **Limerick man convicted of stalking, harassing girl he met in high school** **Limerick man convicted of stalking, harassing girl he met in high school** PIAA-5A BASEBALL: Upper Dublin outduels Elizabethtown in 8 innings to reach state finalPIAA-5A BASEBALL: Upper Dublin outduels Elizabethtown in 8 innings to reach state final **PIAA-5A BASEBALL: Upper Dublin outduels Elizabethtown in 8 innings to reach state final** **PIAA-5A BASEBALL: Upper Dublin outduels Elizabethtown in 8 innings to reach state final** Hundreds rally in Norristown to support immigrants in face of ICE uptickHundreds rally in Norristown to support immigrants in face of ICE uptick **Hundreds rally in Norristown to support immigrants in face of ICE uptick** **Hundreds rally in Norristown to support immigrants in face of ICE uptick** Wawa to open newest Montgomery County storeWawa to open newest Montgomery County store **Wawa to open newest Montgomery County store** **Wawa to open newest Montgomery County store** Norristown teen accused in gunshot slaying seeks court-appointed lawyerNorristown teen accused in gunshot slaying seeks court-appointed lawyer **Norristown teen accused in gunshot slaying seeks court-appointed lawyer** **Norristown teen accused in gunshot slaying seeks court-appointed lawyer** Former Penn Christian Academy administrator charged with $579,000 theftFormer Penn Christian Academy administrator charged with $579,000 theft **Former Penn Christian Academy administrator charged with $579,000 theft** **Former Penn Christian Academy administrator charged with $579,000 theft** Andrew Painter struggles in 2nd consecutive start; IronPigs lose 4th in a rowAndrew Painter struggles in 2nd consecutive start; IronPigs lose 4th in a row **Andrew Painter struggles in 2nd consecutive start; IronPigs lose 4th in a row** **Andrew Painter struggles in 2nd consecutive start; IronPigs lose 4th in a row** Montgomery County food safety inspections found damaged floors and pooling waterMontgomery County food safety inspections found damaged floors and pooling water **Montgomery County food safety inspections found damaged floors and pooling water** **Montgomery County food safety inspections found damaged floors and pooling water** 2025 primary results in Montgomery County: Fewer voters, more candidates2025 primary results in Montgomery County: Fewer voters, more candidates **2025 primary results in Montgomery County: Fewer voters, more candidates** **2025 primary results in Montgomery County: Fewer voters, more candidates** **More in High School Sports** PIAA Class 3A Boys Lacrosse: Early La Salle lead doesn’t deter Springfield from appointed state date **PIAA Class 3A Boys Lacrosse: Early La Salle lead doesn’t deter Springfield from appointed state date** **PIAA Class 3A Boys Lacrosse: Early La Salle lead doesn’t deter Springfield from appointed state date** PIAA-5A BASEBALL: Upper Dublin meets Shaler in state championship game **PIAA-5A BASEBALL: Upper Dublin meets Shaler in state championship game** **PIAA-5A BASEBALL: Upper Dublin meets Shaler in state championship game** PHOTO GALLERY: North Penn baseball defeats Neshaminy in PIAA-6A semifinals **PHOTO GALLERY: North Penn baseball defeats Neshaminy in PIAA-6A semifinals** **PHOTO GALLERY: North Penn baseball defeats Neshaminy in PIAA-6A semifinals** PIAA-2A BASEBALL: Reid Miller throws shutout, Faith Christian tops Mount Union in state semifinals **PIAA-2A BASEBALL: Reid Miller throws shutout, Faith Christian tops Mount Union in state semifinals** **PIAA-2A BASEBALL: Reid Miller throws shutout, Faith Christian tops Mount Union in state semifinals** 2025 June 4 Media News GroupThe MercuryDaily Local NewsThe ReporterMainline Media NewsTrentonianReading EagleDelaware Co Daily Times The Mercury Daily Local News The Reporter Mainline Media News Trentonian Reading Eagle Delaware Co Daily Times The Mercury Daily Local News The Reporter Mainline Media News Trentonian Reading Eagle Delaware Co Daily Times Subscriber ServicesSubscribeSign Up For Newsletterse-EditionSubmit News Subscribe Sign Up For Newsletters e-Edition Submit News Subscribe Sign Up For Newsletters e-Edition Submit News Contact UsWork With UsClassifiedsPublic Notices Work With Us Classifieds Public Notices Work With Us Classifieds Public Notices About UsSubmit AnnouncementsiOS AppAndroid AppPrivacy PolicyAccessibilitySitemap Submit Announcements iOS App Android App Privacy Policy Accessibility Sitemap Submit Announcements iOS App Android App Privacy Policy Accessibility Sitemap MediaNews Group AdvertisingPlace Classified AdAdvertising InquiryJobs Place Classified Ad Advertising Inquiry Jobs Place Classified Ad Advertising Inquiry Jobs Subscribe Now Terms of Use Cookie Policy Cookie Preferences Do Not Sell/Share My Personal Information Notice of Financial Incentive California Notice at Collection Arbitration MediaNews Group Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}