{"id": 293, "name": "Cronkite News", "domain": "cronkitenews.azpbs.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://cronkitenews.azpbs.org/2025/06/10/arizona-families-homeschooling-athletic-program-east-valley-program/", "title": "Arizona Families Homeschooling Athletic Program East Valley Program", "content": "Newscast GIVE Borderlands Health Indigenous Money Next Gen Noticias Politics Social Justice Sports Sustainability Newscast GIVE Subscribe About What we do Arizona PBS Walter Cronkite School of Journalismand Mass Communication © 2025 Cronkite News. All rights reserved. Creative Commons. Editor's PicksSports **Homeschooling is for athletes, too: East Valley program leads charge for more sports opportunities** Share on Facebook Submit to Reddit Tweet Send email EVAC students and fans cheer on their girls varsity basketball team in the CAA Division 2 State Championship final against Ridgeline Academy on Feb. 22, 2023 at Desert Financial Arena in Tempe, Arizona. (Photo courtesy of Tracy Miller) GILBERT – Hoisting a state championship trophy is the pinnacle of many high school athletes’ experience. For Mesa native Allison Miller and a host of other homeschool competitors across the U.S., however, their aspirations extend to nationals. Miller, a 2023 alum of the homeschool athletic program East Valley Athletes for Christ (EVAC) based in Gilbert, won back-to-back state titles in the second division of the Canyon Athletic Association (CAA). These moments, while special in their own right, paled in comparison to her three week-long runs at the National Christian Homeschool Basketball Championships (NCHBC) in Springfield, Missouri. “The difference in how people play basketball around the country is really interesting. … There’s just a different feel at that tournament,” said Miller, a rising junior basketball player at The Master’s University, an NAIA school in Santa Clarita, California. “I think it just opened up another gear of competitiveness within EVAC and (was) something else to work towards because some of the years in EVAC my teams were pretty dominant.” NBA players Blake Griffin and Allonzo Trier, who competed for the OKC Storm and NOAH Tigers, respectively, are notable past participants in the now-34-year-old NCHBC. The prospect of even entering such an event – in which EVAC first appeared with boys basketball in 2021 – was as foreign as homeschooling back when EVAC was established in 2003. **EVAC’s beginnings** EVAC, an association of homeschool families, began more than 20 years ago with a single boys high school basketball team. Back then, the national homeschooling rate was roughly 2.2%, according to the National Center for Education Statistics. Hit the fast-forward button to 2025 and EVAC is fielding 37 teams and developing 291 students (124 girls and 167 boys) across elementary, junior high and high school age groups. (Left) Allison Miller takes a jump shot against AZ Compass Prep School in Chandler, Arizona during her 2022-23 senior season as an EVAC Eagle. (Photo courtesy of Tracy Miller) (Right) The Master’s University sophomore Miller sizes up an Arizona Christian University defender in the GSAC Women’s Basketball Tournament final in Glendale, Arizona on March 3, 2025. (Photo courtesy of Nikole Siroky) Arizona’s individual homeschool rate came in at 5.26% for the 2023-24 academic year, per U.S. Census Data collected by Johns Hopkins School of Education. Conservative growth estimates place the percentage of homeschool students near 8% by 2028, using multiple studies including one done by The Washington Post that shows religion is not even a primary needle-mover. One enabler for homeschooling families in Arizona has been the Empowerment Scholarship Account (ESA) program, which was first instituted in 2011 as a financial lifeline for students with disabilities. The game-changer came in 2022 when the program administered by the Arizona Department of Education was made universally available for all students, no matter their enrollment status or location. Perhaps the fallout from the COVID-19 pandemic has had something to do with this trend. But why are families investing in homeschooling and, for some, making the trek from places like Anthem, Maricopa and the West Valley to Gilbert to enroll their child in EVAC? Especially when the program has to rent out facilities and is reliant on volunteers to keep it afloat? The simple answer boils down to families desiring flexibility and parent-directed learning while keeping their children involved in sport, according to EVAC administrative assistant Tracy Miller. Plus, the program is the only one of its kind in the state. “It was worth it for us to stay in something that was maybe less competitive because of the relationships in the community,” said Tracy Miller, Allison’s mother. “It’s kind of twofold that way and I think it drives the mission of our organization, (which) is community, our dedication to Christ and then competition. “So, I think that’s why people stay with us because in the schools, I guess at a private school, a private Christian school, you have the same focus.” Now at an enrollment near 300 students, EVAC is officially maxing out its capacity. An influx in volunteers would be the only way it can sustainably expand. And the demand reaches far beyond the East Valley. EVAC communications director Grant Botma claimed “five or six EVACs” would be easily filled throughout the state if established. The EVAC varsity boys basketball team huddles after a March Gladness tournament game against Christian Heritage Sports at Norte Vista High School in Riverside, California on March 22, 2025. (Photo courtesy of Nikole Siroky) **Fewer boundaries** More than just empowering educational choice, Botma said EVAC erases typical athletic boundaries. “EVAC actually has greater and better and more customized extracurricular athletic experiences … because it’s parent-led,” Botma said. “There’s not bureaucracy or red tape for what is part of a public school. If the parent has an idea, and it fits within the mission, vision and core values of EVAC, OK, parents step up and do it and we support it. And that’s a really big thing because that creates, again, athletic experiences that would not have been had anywhere else.” An example of this popped up last school year. Brian Baker, a co-worker of Botma’s at Stewardship, a Gilbert finance advisory company, started homeschooling his two boys last April before coming aboard the EVAC train. Baker’s oldest son, a junior in high school, slotted into a CAA state championship-winning flag football team but his youngest, a seventh-grader with a passion for golf, did not have the same type of outlet. So, Baker decided to do something about it. “My youngest son was like, ‘You know, EVAC doesn’t have a golf team. I guess that means we have to start a golf team,’” Baker said. “So we talked, and that’s what we did.” Baker emphasized that his family’s homeschooling decision came before any athletic aspirations. Like Miller, Botma and even EVAC athletic director Jason Fender, Baker learned about EVAC via word-of-mouth. EVAC communications director and boys basketball coordinator Grant Botma walks on the court at Desert Financial Arena in Tempe, Arizona before the EVAC girls varsity basketball team faces Imagine Prep Surprise in the CAA Division 2 State Championship on Feb. 22, 2025. (Photo courtesy of Nikole Siroky) Fender said EVAC does not actively market itself the way other businesses do, a large reason for that being its current inability to service more students without help. By all accounts, the intermingling of homeschooling and athletics – particularly at the high school level – is rarely advertised as an option for students. At least hardly at all until recently. Arizona Christian University, an NAIA school in Glendale, hosted a college prep event on April 23 for homeschool students in which they could tour campus and speak with coaches. Botma said many different options exist for homeschooling athletes, but there needs to be a greater “education piece” within current and future programs like EVAC so these opportunities aren’t lost. Botma’s oldest child, Cambria, was one of the targets of informational events such as this, being a rising junior and four-sport athlete for EVAC (basketball, volleyball, beach volleyball and track). Eighth grade was her first year in the program and her parents gave her the choice of staying homeschooled or attending AIA 3A-level Valley Christian. “(EVAC kinds) of created that community that I think I was wanting going (into) high school. … EVAC was that for me instead, so I chose to stay (in) homeschool,” Cambria said. Her decision was rewarded with hardware, as she contributed to CAA girls basketball and track titles, but also with reciprocated loyalty from EVAC coaches. Fourteen of its 60 coaches are EVAC alumni (two coaching Cambria’s basketball team), the lifeblood of the program. Cambria said their example has made college athletics a possibility for her and coaching itself a realistic career choice. **Paving the way** EVAC sophomore Cambria Botma drives in for a layup against Imagine Prep Surprise in the CAA Division 2 State Championship title game at Desert Financial Arena in Tempe, Arizona on Feb. 22, 2025. The EVAC girls varsity basketball team won 43-38 after scoring six unanswered points in the final minute of the game. (Photo courtesy of Nikole Siroky) Before Cambria and even the homeschool program’s official beginnings, EVAC families helped start the CAA in 1999, which has become the interscholastic roadway for more than 200 K-12 schools. Despite not fitting the K-12 requirement for CAA membership eligibility, EVAC was “grandfathered in” due to it being an organizational founder, according to CAA Executive Director Randall Baum. As of early April, the 2024-26 academic block shows 107 homeschool students – 83 junior high and 24 high school – are participating in CAA athletics. Baum said these numbers, which are pooled from approximately 14,000 students, are largely unreported at this point and that he has been encouraging member schools to accept homeschool students. Current tally aside, Baum said CAA is proud of helping “a wide-range of student-athletes,” including its ongoing relationship with incarcerated youth at the Adobe Mountain School in Phoenix. Baum, the CAA executive director since 2005, said future EVAC-esque programs will be supported if they should arise. “If another homeschool organization starts up, they would have to look at waiving our bylaw in article one that says you have to be a K-12-recognized Arizona school,” Baum said. “But I think at the end of the day, (adding more homeschool programs) is definitely possible. … If you look at Mississippi – and this is the craziness about (the National Federation of State High School Associations) – Mississippi (is) an approved NFHS affiliate member for (its) homeschool networks.” Baum said he has been having conversations with an “exploratory” homeschooling group in Yuma. In those conversations, he explained the uniqueness of CAA’s partnership with EVAC and the people in Yuma revealed their attempt at finding athletic footing at a nearby Christian school. “That’s probably a better foundation, to get in with a private school and offer sports through that, but use the homeschool community to come together rather than trying to say, ‘We’re the Yuma Athletes for Christ,’” Baum said. EVAC’s Fender said a recent CAA meeting reported that about 20 private schools – primarily in the western half of the state – were added as new members of the athletic organization, thus installing the necessary outlet for start-up homeschool programs. Fonda Wilson, who wrapped up her first season as the coach of The Master’s University women’s basketball team, said she had virtually no experience working with homeschooled athletes in more than 20 years of coaching basketball at public high schools in Southern California. That is until she met EVAC product Allison Miller in July 2024. “Wow, (Allison) just blew me away,” said Wilson of Miller’s warm approach with 9- to 10-year-olds at the program’s two summer basketball camps. “It’s not even about that she came from homeschool. She was really taught well. I think her basketball IQ is just right there where (the other players’) is too.” Wilson not only took note of Miller’s demeanor but said her first go at offseason recruiting is being influenced by it. “(Miller) has been informing me about (homeschool athletes) all year, and that’s really where my heart wants to be, is to look in that portal because the Lord’s going to glorify that,” Wilson said. “He’s going to be so faithful, I’m just looking for his kids. “(God) has me here for a different mission. It’s not just basketball. … So, there’s no fear of going (for homeschool athletes).” Wilson’s 2024-25 Mustangs defeated Arizona Christian, 72-66, in the Great Southwest Athletic Conference (GSAC) Women’s Basketball Tournament to qualify for their second straight NAIA National Championship tournament. Miller, who posted four games with double-digit points in her sophomore season, scored two points in seven minutes against Arizona Christian in Glendale, not too far from her winning moments as an EVAC Eagle. It was only the summer following her freshman year of high school that Miller set her sights on college ball by playing club at Mesa’s Work Athletics. “In the back of my head, I always wanted to play in college, but never really thought it would happen,” Miller said. “Most of my experience with (college searching) was reaching out and really having to put yourself out there because, naturally, what I’ve noticed with my teammates here at college, a lot of high schools do a lot with recruiting and putting their own roster out there. “And so, that was kind of on me if I wanted to try to figure that out.” The trajectory of homeschooling in Arizona may transform a previously untapped area into a common meeting ground for athletes and coaches alike. Payne Moses expects to graduate in summer 2025 with a master’s degree in sports journalism. Moses currently works as a web content editor for Arizona Sports and KTAR. He previously worked as assistant sports information director at Arizona Christian University in Glendale. ‘I’ve earned the right to be here’: Suns introduce new coach Jordan OttJune 11, 2025 **‘I’ve earned the right to be here’: Suns introduce new coach Jordan Ott** **‘I’ve earned the right to be here’: Suns introduce new coach Jordan Ott** **‘I’ve earned the right to be here’: Suns introduce new coach Jordan Ott** Hobbs urges civics camp students to find mentors, grab opportunitiesJune 10, 2025 **Hobbs urges civics camp students to find mentors, grab opportunities** **Hobbs urges civics camp students to find mentors, grab opportunities** **Hobbs urges civics camp students to find mentors, grab opportunities** ‘I trust my work’: Sabally finds peace in Phoenix before hosting former teamJune 10, 2025 **‘I trust my work’: Sabally finds peace in Phoenix before hosting former team** **‘I trust my work’: Sabally finds peace in Phoenix before hosting former team** **‘I trust my work’: Sabally finds peace in Phoenix before hosting former team** Homeschooling is for athletes, too: East Valley program leads chargeJune 10, 2025 **Homeschooling is for athletes, too: East Valley program leads charge** **Homeschooling is for athletes, too: East Valley program leads charge** **Homeschooling is for athletes, too: East Valley program leads charge** Angel City FC’s Pride Night full of heart for Strauss debut, injured KingJune 10, 2025 **Angel City FC’s Pride Night full of heart for Strauss debut, injured King** **Angel City FC’s Pride Night full of heart for Strauss debut, injured King** **Angel City FC’s Pride Night full of heart for Strauss debut, injured King** ASU’s Davis, Lopez Arias seek dominant NCAA track and field championshipsJune 10, 2025 **ASU’s Davis, Lopez Arias seek dominant NCAA track and field championships** **ASU’s Davis, Lopez Arias seek dominant NCAA track and field championships** **ASU’s Davis, Lopez Arias seek dominant NCAA track and field championships** June 9, 2025, NewscastJune 10, 2025 **June 9, 2025, Newscast** **June 9, 2025, Newscast** **June 9, 2025, Newscast** Popular Phoenix Fan Fusion invades downtown, brings out die-hard fansJune 9, 2025 **Popular Phoenix Fan Fusion invades downtown, brings out die-hard fans** **Popular Phoenix Fan Fusion invades downtown, brings out die-hard fans** **Popular Phoenix Fan Fusion invades downtown, brings out die-hard fans** Cronkite News is produced by theWalter Cronkite School of Journalism and Mass CommunicationatArizona State University. Staff members are listedhere. Learn moreabout what we do and how to find our content on our broadcast, digital and social media platforms. Find out how your news organization can useCronkite News content. Sign upfor daily headlines. 555 N. Central Ave. Phoenix, AZ, 85004 602.496.5050 [email protected] Cronkite Noticias Carnegie-Knight News21 Special Reports RSS Weather © 2025 Cronkite News. All rights reserved. Creative CommonsPrivacy statement"}