{"id": 1699, "name": "Cureus Journal of Medical Science", "domain": "cureus.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.cureus.com/users/983765-elisabeth-estefan-a-arrojo-lvarez", "title": null, "content": "Home SpecialtiesSpecialtiesBrowseArticlesPostersAbstractsCureus CollectionsSpecialtiesAllergy / ImmunologyAnatomyAnesthesiologyCardiac / Thoracic / Vascular SurgeryCardiologyDentistryDermatologyEmergency MedicineEndocrinology / Diabetes / MetabolismEnvironmental HealthEpidemiology / Public HealthFamily / General PracticeForensic MedicineGastroenterologyGeneral SurgeryGeneticsGeriatricsHealthcare TechnologyHealth PolicyHematologyHIV / AIDSInfectious DiseaseIntegrative / Complementary MedicineInternal MedicineMedical EducationMedical PhysicsMedical SimulationNephrologyNeurologyNeurosurgeryNuclear MedicineNutritionObstetrics / GynecologyOccupational HealthOncologyOphthalmologyOral MedicineOrthopedicsOsteopathic MedicineOtolaryngologyPain ManagementPalliative CarePathologyPediatricsPediatric SurgeryPharmacologyPhysical Medicine & RehabilitationPlastic SurgeryPodiatryPreventive MedicinePsychiatryPsychologyPublic HealthPulmonologyQuality ImprovementRadiation OncologyRadiologyRheumatologySports MedicineSubstance Use and AddictionTherapeuticsTransplantationTraumaUrologyMiscellaneous Articles Posters Abstracts Cureus Collections Allergy / Immunology Anatomy Anesthesiology Cardiac / Thoracic / Vascular Surgery Cardiology Dentistry Dermatology Emergency Medicine Endocrinology / Diabetes / Metabolism Environmental Health Epidemiology / Public Health Family / General Practice Forensic Medicine Gastroenterology General Surgery Genetics Geriatrics Healthcare Technology Health Policy Hematology HIV / AIDS Infectious Disease Integrative / Complementary Medicine Internal Medicine Medical Education Medical Physics Medical Simulation Nephrology Neurology Neurosurgery Nuclear Medicine Nutrition Obstetrics / Gynecology Occupational Health Oncology Ophthalmology Oral Medicine Orthopedics Osteopathic Medicine Otolaryngology Pain Management Palliative Care Pathology Pediatrics Pediatric Surgery Pharmacology Physical Medicine & Rehabilitation Plastic Surgery Podiatry Preventive Medicine Psychiatry Psychology Public Health Pulmonology Quality Improvement Radiation Oncology Radiology Rheumatology Sports Medicine Substance Use and Addiction Therapeutics Transplantation Trauma Urology Miscellaneous Articles Posters Abstracts Cureus Collections Allergy / Immunology Anatomy Anesthesiology Cardiac / Thoracic / Vascular Surgery Cardiology Dentistry Dermatology Emergency Medicine Endocrinology / Diabetes / Metabolism Environmental Health Epidemiology / Public Health Family / General Practice Forensic Medicine Gastroenterology General Surgery Genetics Geriatrics Healthcare Technology Health Policy Hematology HIV / AIDS Infectious Disease Integrative / Complementary Medicine Internal Medicine Medical Education Medical Physics Medical Simulation Nephrology Neurology Neurosurgery Nuclear Medicine Nutrition Obstetrics / Gynecology Occupational Health Oncology Ophthalmology Oral Medicine Orthopedics Osteopathic Medicine Otolaryngology Pain Management Palliative Care Pathology Pediatrics Pediatric Surgery Pharmacology Physical Medicine & Rehabilitation Plastic Surgery Podiatry Preventive Medicine Psychiatry Psychology Public Health Pulmonology Quality Improvement Radiation Oncology Radiology Rheumatology Sports Medicine Substance Use and Addiction Therapeutics Transplantation Trauma Urology Miscellaneous ResourcesResourcesAbout PublishingWhy publish in Cureus? Click below to find out.Learn moreFor Authors & ReviewersAuthor GuideReviewer GuideGuest Editor GuideAcademic Channels GuideMedia GuideAbout CollectionsAuthor Fees (Preferred Editing)Cureus HonorsArticle PromotionNew Authors HubArticle Sharing GuideSIQ Why publish in Cureus? Click below to find out. Learn more Author Guide Reviewer Guide Guest Editor Guide Academic Channels Guide Media Guide About Collections Author Fees (Preferred Editing) Cureus Honors Article Promotion New Authors Hub Article Sharing Guide SIQ Why publish in Cureus? Click below to find out. Learn more Author Guide Reviewer Guide Guest Editor Guide Academic Channels Guide Media Guide About Collections Author Fees (Preferred Editing) Cureus Honors Article Promotion New Authors Hub Article Sharing Guide SIQ ChannelsChannelsAbout ChannelsUnlock discounted publishing that highlights your organization and the peer-reviewed research and clinical experiences it produces.Learn moreAcademic Channels GuideFind out how channels are organized and operated, including details on the roles and responsibilities of channel editors.Learn moreChannelsACOS Cardiothoracic and Vascular SurgeryACOS General SurgeryACOS Neurological SurgeryACOS Plastic and Reconstructive SurgeryACOS Urological SurgeryAjantaMed Dialogue (CVD)Alabama College of Osteopathic Medicine ResearchAmerican Red Cross Scientific Advisory CouncilAmrita Vishwa Vidyapeetham Healthcare CampusAstroMedica: Advances in Transportation Medicine, Flight, Spaceflight, and MicrogravityATARI FrontiersBaylor College of Medicine at Christus Children’sBaylor Scott & White All Saints Medical Center Graduate Medical EducationBaylor Scott & White Medical Center Department of NeurosurgeryBharati Vidyapeeth (Deemed to be University), PuneBLDE (Deemed to be University)Canadian Association of Radiation OncologyContemporary Reviews in Neurology and NeurosurgeryContemporary Updates: Radiotherapy Innovation & Evidence (CURiE)Dalhousie Emergency MedicineDr. D Y Patil Medical College, Hospital and Research Centre, Dr. D Y Patil Vidyapeeth (Deemed to be University), PuneDr. Kiran C. Patel College of Allopathic Medicine (NSUMD)Dr. Kiran C. Patel College of Osteopathic Medicine (KPCOM)Eisenhower HealthFLAGSHIP: Medical Scholarly ProceedingsFlorida Atlantic UniversityFlorida International UniversityFlorida State UniversityFondazione Paolo ProcacciGreat Eastern Medical School and HospitalGreat Western Hospital AcademyHoward University Internal MedicineInternational Liaison Committee on ResuscitationInternational Pediatric Simulation SocietyJapan Radiosurgery SocietyKarnavati School of Dentistry, Karnavati University (KU)KIMSAC - Kalinga Institute of Medical Sciences Academic ChannelKrishna Vishwa Vidyapeeth (Deemed to be University), Karad.Lake Erie College of Osteopathic Medicine (LECOM)Liberty Medicine Research ChannelLSUHS Family Medicine AlexandriaManav Rachna Dental CollegeMedCats do Research: The University of Arizona College of Medicine - TucsonMedical Society of Delaware Academic ChannelMed-Peds Academic ChannelMichigan Institute for Clinical & Health Research (MICHR)Midwestern University, Arizona College of Osteopathic MedicineMilitary Medical SimulationModern Medical EducatorNB Social Pediatrics ResearchNEMA Research GroupNovoBliss Research - Contract Research Organization (CRO)Orlando College of Osteopathic MedicinePenn State NeurosurgeryProceedings of the UCLA Department of MedicineSam Houston State University College of Osteopathic MedicineSBH Health SystemSinai Chicago ResearchStanford NeurosurgerySUNY Downstate Health Sciences UniversityTawam OncologyTexas Tech University Health Sciences Center El PasoThe Florida Medical Student Research PublicationsThe Hong Kong Institute Of Musculoskeletal Medicinethe Radiosurgery SocietyToronto Metropolitan University School of Medicine: Health InsightsUCSF Surgical Neuroanatomy CollectionUniversity of Florida College of Medicine – JacksonvilleUniversity of Florida-Jacksonville NeurosurgeryUniversity of Louisville NeurosurgeryUniversity of South FloridaUTMB AnesthesiologyUTRGV SOM - The University of Texas Rio Grande Valley School of MedicineVCOM Clinical, Biomedical, and Educational ResearchWilliam Carey University College of Osteopathic Medicine Scholarly Activities Unlock discounted publishing that highlights your organization and the peer-reviewed research and clinical experiences it produces. Learn more Find out how channels are organized and operated, including details on the roles and responsibilities of channel editors. Learn more ACOS Cardiothoracic and Vascular Surgery ACOS General Surgery ACOS Neurological Surgery ACOS Plastic and Reconstructive Surgery ACOS Urological Surgery AjantaMed Dialogue (CVD) Alabama College of Osteopathic Medicine Research American Red Cross Scientific Advisory Council Amrita Vishwa Vidyapeetham Healthcare Campus AstroMedica: Advances in Transportation Medicine, Flight, Spaceflight, and Microgravity ATARI Frontiers Baylor College of Medicine at Christus Children’s Baylor Scott & White All Saints Medical Center Graduate Medical Education Baylor Scott & White Medical Center Department of Neurosurgery Bharati Vidyapeeth (Deemed to be University), Pune BLDE (Deemed to be University) Canadian Association of Radiation Oncology Contemporary Reviews in Neurology and Neurosurgery Contemporary Updates: Radiotherapy Innovation & Evidence (CURiE) Dalhousie Emergency Medicine Dr. D Y Patil Medical College, Hospital and Research Centre, Dr. D Y Patil Vidyapeeth (Deemed to be University), Pune Dr. Kiran C. Patel College of Allopathic Medicine (NSUMD) Dr. Kiran C. Patel College of Osteopathic Medicine (KPCOM) Eisenhower Health FLAGSHIP: Medical Scholarly Proceedings Florida Atlantic University Florida International University Florida State University Fondazione Paolo Procacci Great Eastern Medical School and Hospital Great Western Hospital Academy Howard University Internal Medicine International Liaison Committee on Resuscitation International Pediatric Simulation Society Japan Radiosurgery Society Karnavati School of Dentistry, Karnavati University (KU) KIMSAC - Kalinga Institute of Medical Sciences Academic Channel Krishna Vishwa Vidyapeeth (Deemed to be University), Karad. Lake Erie College of Osteopathic Medicine (LECOM) Liberty Medicine Research Channel LSUHS Family Medicine Alexandria Manav Rachna Dental College MedCats do Research: The University of Arizona College of Medicine - Tucson Medical Society of Delaware Academic Channel Med-Peds Academic Channel Michigan Institute for Clinical & Health Research (MICHR) Midwestern University, Arizona College of Osteopathic Medicine Military Medical Simulation Modern Medical Educator NB Social Pediatrics Research NEMA Research Group NovoBliss Research - Contract Research Organization (CRO) Orlando College of Osteopathic Medicine Penn State Neurosurgery Proceedings of the UCLA Department of Medicine Sam Houston State University College of Osteopathic Medicine SBH Health System Sinai Chicago Research Stanford Neurosurgery SUNY Downstate Health Sciences University Tawam Oncology Texas Tech University Health Sciences Center El Paso The Florida Medical Student Research Publications The Hong Kong Institute Of Musculoskeletal Medicine the Radiosurgery Society Toronto Metropolitan University School of Medicine: Health Insights UCSF Surgical Neuroanatomy Collection University of Florida College of Medicine – Jacksonville University of Florida-Jacksonville Neurosurgery University of Louisville Neurosurgery University of South Florida UTMB Anesthesiology UTRGV SOM - The University of Texas Rio Grande Valley School of Medicine VCOM Clinical, Biomedical, and Educational Research William Carey University College of Osteopathic Medicine Scholarly Activities Unlock discounted publishing that highlights your organization and the peer-reviewed research and clinical experiences it produces. Learn more Find out how channels are organized and operated, including details on the roles and responsibilities of channel editors. Learn more ACOS Cardiothoracic and Vascular Surgery ACOS General Surgery ACOS Neurological Surgery ACOS Plastic and Reconstructive Surgery ACOS Urological Surgery AjantaMed Dialogue (CVD) Alabama College of Osteopathic Medicine Research American Red Cross Scientific Advisory Council Amrita Vishwa Vidyapeetham Healthcare Campus AstroMedica: Advances in Transportation Medicine, Flight, Spaceflight, and Microgravity ATARI Frontiers Baylor College of Medicine at Christus Children’s Baylor Scott & White All Saints Medical Center Graduate Medical Education Baylor Scott & White Medical Center Department of Neurosurgery Bharati Vidyapeeth (Deemed to be University), Pune BLDE (Deemed to be University) Canadian Association of Radiation Oncology Contemporary Reviews in Neurology and Neurosurgery Contemporary Updates: Radiotherapy Innovation & Evidence (CURiE) Dalhousie Emergency Medicine Dr. D Y Patil Medical College, Hospital and Research Centre, Dr. D Y Patil Vidyapeeth (Deemed to be University), Pune Dr. Kiran C. Patel College of Allopathic Medicine (NSUMD) Dr. Kiran C. Patel College of Osteopathic Medicine (KPCOM) Eisenhower Health FLAGSHIP: Medical Scholarly Proceedings Florida Atlantic University Florida International University Florida State University Fondazione Paolo Procacci Great Eastern Medical School and Hospital Great Western Hospital Academy Howard University Internal Medicine International Liaison Committee on Resuscitation International Pediatric Simulation Society Japan Radiosurgery Society Karnavati School of Dentistry, Karnavati University (KU) KIMSAC - Kalinga Institute of Medical Sciences Academic Channel Krishna Vishwa Vidyapeeth (Deemed to be University), Karad. Lake Erie College of Osteopathic Medicine (LECOM) Liberty Medicine Research Channel LSUHS Family Medicine Alexandria Manav Rachna Dental College MedCats do Research: The University of Arizona College of Medicine - Tucson Medical Society of Delaware Academic Channel Med-Peds Academic Channel Michigan Institute for Clinical & Health Research (MICHR) Midwestern University, Arizona College of Osteopathic Medicine Military Medical Simulation Modern Medical Educator NB Social Pediatrics Research NEMA Research Group NovoBliss Research - Contract Research Organization (CRO) Orlando College of Osteopathic Medicine Penn State Neurosurgery Proceedings of the UCLA Department of Medicine Sam Houston State University College of Osteopathic Medicine SBH Health System Sinai Chicago Research Stanford Neurosurgery SUNY Downstate Health Sciences University Tawam Oncology Texas Tech University Health Sciences Center El Paso The Florida Medical Student Research Publications The Hong Kong Institute Of Musculoskeletal Medicine the Radiosurgery Society Toronto Metropolitan University School of Medicine: Health Insights UCSF Surgical Neuroanatomy Collection University of Florida College of Medicine – Jacksonville University of Florida-Jacksonville Neurosurgery University of Louisville Neurosurgery University of South Florida UTMB Anesthesiology UTRGV SOM - The University of Texas Rio Grande Valley School of Medicine VCOM Clinical, Biomedical, and Educational Research William Carey University College of Osteopathic Medicine Scholarly Activities PartnershipsPartnershipsCureus PartnershipsOffering a variety of advertising and sponsorship options for reaching influential specialists from targeted demographic splits.Learn moreInstitutional PartnersAbout ChannelsList of Cureus ChannelsAdvertising & SponsorshipAdvertise With UsAdvertising PolicyDownload Media KitCompetitionsAbout CompetitionsCompetitions Offering a variety of advertising and sponsorship options for reaching influential specialists from targeted demographic splits. Learn more About Channels List of Cureus Channels Advertise With Us Advertising Policy Download Media Kit About Competitions Competitions Offering a variety of advertising and sponsorship options for reaching influential specialists from targeted demographic splits. Learn more About Channels List of Cureus Channels Advertise With Us Advertising Policy Download Media Kit About Competitions Competitions NewsroomNewsroomBrowseAllNewsCureus UNewslettersHighlightsLatest Highlighted Dermatology ArticlesLatest Highlighted Endocrinology ArticlesLatest Highlighted Emergency Medicine ArticlesLatest Highlighted Family Medicine ArticlesLatest Highlighted Infectious Disease ArticlesLatest Highlighted Gastroenterology Articles Latest Highlighted Dermatology Articles Latest Highlighted Endocrinology Articles Latest Highlighted Emergency Medicine Articles Latest Highlighted Family Medicine Articles Latest Highlighted Infectious Disease Articles Latest Highlighted Gastroenterology Articles Latest Highlighted Dermatology Articles Latest Highlighted Endocrinology Articles Latest Highlighted Emergency Medicine Articles Latest Highlighted Family Medicine Articles Latest Highlighted Infectious Disease Articles Latest Highlighted Gastroenterology Articles About UsAbout UsAbout CureusCureus provides an equitable, efficient publishing and peer reviewing experience without sacrificing publication times.Learn moreWho We AreEditorial BoardAssociate EditorsAcademic CouncilContributorsAuthorsReviewersMore From CureusCareersEmail Alerts Cureus provides an equitable, efficient publishing and peer reviewing experience without sacrificing publication times. Learn more Editorial Board Associate Editors Academic Council Authors Reviewers Careers Email Alerts Cureus provides an equitable, efficient publishing and peer reviewing experience without sacrificing publication times. Learn more Editorial Board Associate Editors Academic Council Authors Reviewers Careers Email Alerts Competitions 🏆Competitions 🏆CompetitionsGenerate broad awareness and deliver relevant, peer-reviewed clinical experiences directly to potential customers.Learn moreOngoing CompetitionsAll CompetitionsDedicated Cranial Radiosurgery: Clinical Experience with New & Innovative SRS TechnologiesSponsored by Zap Surgical SystemsReal-Time Adaptive Motion Management on Helical and Robotic RT PlatformsSponsored by Accuray, Inc. Generate broad awareness and deliver relevant, peer-reviewed clinical experiences directly to potential customers. Learn more Dedicated Cranial Radiosurgery: Clinical Experience with New & Innovative SRS TechnologiesSponsored by Zap Surgical Systems Dedicated Cranial Radiosurgery: Clinical Experience with New & Innovative SRS Technologies Sponsored by Zap Surgical Systems Real-Time Adaptive Motion Management on Helical and Robotic RT PlatformsSponsored by Accuray, Inc. Real-Time Adaptive Motion Management on Helical and Robotic RT Platforms Sponsored by Accuray, Inc. Generate broad awareness and deliver relevant, peer-reviewed clinical experiences directly to potential customers. Learn more Dedicated Cranial Radiosurgery: Clinical Experience with New & Innovative SRS TechnologiesSponsored by Zap Surgical Systems Dedicated Cranial Radiosurgery: Clinical Experience with New & Innovative SRS Technologies Sponsored by Zap Surgical Systems Dedicated Cranial Radiosurgery: Clinical Experience with New & Innovative SRS Technologies Sponsored by Zap Surgical Systems Dedicated Cranial Radiosurgery: Clinical Experience with New & Innovative SRS Technologies Sponsored by Zap Surgical Systems Real-Time Adaptive Motion Management on Helical and Robotic RT PlatformsSponsored by Accuray, Inc. Real-Time Adaptive Motion Management on Helical and Robotic RT Platforms Sponsored by Accuray, Inc. Real-Time Adaptive Motion Management on Helical and Robotic RT Platforms Sponsored by Accuray, Inc. Real-Time Adaptive Motion Management on Helical and Robotic RT Platforms Sponsored by Accuray, Inc. ISSN #2168-8184 Sign InCreate an Account Sign In Create an Account Sign In Create an Account SpecialtiesBrowseArticlesPostersAbstractsCureus CollectionsSpecialtiesMoreAllergy / ImmunologyAnatomyAnesthesiologyCardiac / Thoracic / Vascular SurgeryCardiologyDentistryDermatologyEmergency MedicineEndocrinology / Diabetes / MetabolismEnvironmental HealthEpidemiology / Public HealthFamily / General PracticeForensic MedicineGastroenterologyGeneral SurgeryGeneticsGeriatricsHealthcare TechnologyHealth PolicyHematologyHIV / AIDSInfectious DiseaseIntegrative / Complementary MedicineInternal MedicineMedical EducationMedical PhysicsMedical SimulationNephrologyNeurologyNeurosurgeryNuclear MedicineNutritionObstetrics / GynecologyOccupational HealthOncologyOphthalmologyOral MedicineOrthopedicsOsteopathic MedicineOtolaryngologyPain ManagementPalliative CarePathologyPediatricsPediatric SurgeryPharmacologyPhysical Medicine & RehabilitationPlastic SurgeryPodiatryPreventive MedicinePsychiatryPsychologyPublic HealthPulmonologyQuality ImprovementRadiation OncologyRadiologyRheumatologySports MedicineSubstance Use and AddictionTherapeuticsTransplantationTraumaUrologyMiscellaneous ResourcesAbout PublishingWhy publish in Cureus? Click below to find out.Learn moreFor Authors & ReviewersAuthor GuideMedia GuideArticle Sharing GuideReviewer GuideCureus HonorsSIQGuest Editor GuideArticle PromotionAuthor Fees (Preferred Editing)Academic Channels GuideNew Authors HubAbout Collections Why publish in Cureus? Click below to find out. Why publish in Cureus? Click below to find out. ChannelsAbout ChannelsUnlock discounted publishing that highlights your organization and the peer-reviewed research and clinical experiences it produces.Learn moreAcademic Channels GuideFind out how channels are organized and operated, including details on the roles and responsibilities of channel editors.Learn moreChannelsMoreACOS Cardiothoracic and Vascular SurgeryACOS General SurgeryACOS Neurological SurgeryACOS Plastic and Reconstructive SurgeryACOS Urological SurgeryAjantaMed Dialogue (CVD)Alabama College of Osteopathic Medicine ResearchAmerican Red Cross Scientific Advisory CouncilAmrita Vishwa Vidyapeetham Healthcare CampusAstroMedica: Advances in Transportation Medicine, Flight, Spaceflight, and MicrogravityATARI FrontiersBaylor College of Medicine at Christus Children’sBaylor Scott & White All Saints Medical Center Graduate Medical EducationBaylor Scott & White Medical Center Department of NeurosurgeryBharati Vidyapeeth (Deemed to be University), PuneBLDE (Deemed to be University)Canadian Association of Radiation OncologyContemporary Reviews in Neurology and NeurosurgeryContemporary Updates: Radiotherapy Innovation & Evidence (CURiE)Dalhousie Emergency MedicineDr. D Y Patil Medical College, Hospital and Research Centre, Dr. D Y Patil Vidyapeeth (Deemed to be University), PuneDr. Kiran C. Patel College of Allopathic Medicine (NSUMD)Dr. Kiran C. Patel College of Osteopathic Medicine (KPCOM)Eisenhower HealthFLAGSHIP: Medical Scholarly ProceedingsFlorida Atlantic UniversityFlorida International UniversityFlorida State UniversityFondazione Paolo ProcacciGreat Eastern Medical School and HospitalGreat Western Hospital AcademyHoward University Internal MedicineInternational Liaison Committee on ResuscitationInternational Pediatric Simulation SocietyJapan Radiosurgery SocietyKarnavati School of Dentistry, Karnavati University (KU)KIMSAC - Kalinga Institute of Medical Sciences Academic ChannelKrishna Vishwa Vidyapeeth (Deemed to be University), Karad.Lake Erie College of Osteopathic Medicine (LECOM)Liberty Medicine Research ChannelLSUHS Family Medicine AlexandriaManav Rachna Dental CollegeMedCats do Research: The University of Arizona College of Medicine - TucsonMedical Society of Delaware Academic ChannelMed-Peds Academic ChannelMichigan Institute for Clinical & Health Research (MICHR)Midwestern University, Arizona College of Osteopathic MedicineMilitary Medical SimulationModern Medical EducatorNB Social Pediatrics ResearchNEMA Research GroupNovoBliss Research - Contract Research Organization (CRO)Orlando College of Osteopathic MedicinePenn State NeurosurgeryProceedings of the UCLA Department of MedicineSam Houston State University College of Osteopathic MedicineSBH Health SystemSinai Chicago ResearchStanford NeurosurgerySUNY Downstate Health Sciences UniversityTawam OncologyTexas Tech University Health Sciences Center El PasoThe Florida Medical Student Research PublicationsThe Hong Kong Institute Of Musculoskeletal Medicinethe Radiosurgery SocietyToronto Metropolitan University School of Medicine: Health InsightsUCSF Surgical Neuroanatomy CollectionUniversity of Florida College of Medicine – JacksonvilleUniversity of Florida-Jacksonville NeurosurgeryUniversity of Louisville NeurosurgeryUniversity of South FloridaUTMB AnesthesiologyUTRGV SOM - The University of Texas Rio Grande Valley School of MedicineVCOM Clinical, Biomedical, and Educational ResearchWilliam Carey University College of Osteopathic Medicine Scholarly Activities Unlock discounted publishing that highlights your organization and the peer-reviewed research and clinical experiences it produces. Find out how channels are organized and operated, including details on the roles and responsibilities of channel editors. Unlock discounted publishing that highlights your organization and the peer-reviewed research and clinical experiences it produces. Find out how channels are organized and operated, including details on the roles and responsibilities of channel editors. PartnershipsCureus PartnershipsOffering a variety of advertising and sponsorship options for reaching influential specialists from targeted demographic splits.Learn moreInstitutional PartnersAdvertising & SponsorshipsCompetitionsAbout ChannelsAdvertise With UsAbout CompetitionsList of Cureus ChannelsAdvertising PolicyCompetitionsDownload Media Kit Offering a variety of advertising and sponsorship options for reaching influential specialists from targeted demographic splits. Offering a variety of advertising and sponsorship options for reaching influential specialists from targeted demographic splits. NewsroomBrowseAllNewsCureus UNewslettersHighlightsMoreLatest Highlighted Dermatology ArticlesLatest Highlighted Endocrinology ArticlesLatest Highlighted Emergency Medicine ArticlesLatest Highlighted Family Medicine ArticlesLatest Highlighted Infectious Disease ArticlesLatest Highlighted Gastroenterology Articles About UsAbout CureusCureus provides an equitable, efficient publishing and peer reviewing experience without sacrificing publication times.Learn moreWho We AreContributorsMore From CureusEditorial BoardAuthorsCureus PartnershipsAssociate EditorsReviewersCareersAcademic CouncilEmail Alerts Cureus provides an equitable, efficient publishing and peer reviewing experience without sacrificing publication times. Cureus provides an equitable, efficient publishing and peer reviewing experience without sacrificing publication times. Competitions 🏆CompetitionsGenerate broad awareness and deliver relevant, peer-reviewed clinical experiences directly to potential customers.Learn moreOngoing CompetitionsAll CompetitionsDedicated Cranial Radiosurgery: Clinical Experience with New & Innovative SRS TechnologiesSponsored by Zap Surgical SystemsReal-Time Adaptive Motion Management on Helical and Robotic RT PlatformsSponsored by Accuray, Inc. Generate broad awareness and deliver relevant, peer-reviewed clinical experiences directly to potential customers. Dedicated Cranial Radiosurgery: Clinical Experience with New & Innovative SRS Technologies Sponsored by Zap Surgical Systems Real-Time Adaptive Motion Management on Helical and Robotic RT Platforms Sponsored by Accuray, Inc. Generate broad awareness and deliver relevant, peer-reviewed clinical experiences directly to potential customers. Dedicated Cranial Radiosurgery: Clinical Experience with New & Innovative SRS Technologies Sponsored by Zap Surgical Systems Dedicated Cranial Radiosurgery: Clinical Experience with New & Innovative SRS Technologies Sponsored by Zap Surgical Systems Real-Time Adaptive Motion Management on Helical and Robotic RT Platforms Sponsored by Accuray, Inc. Real-Time Adaptive Motion Management on Helical and Robotic RT Platforms Sponsored by Accuray, Inc. **Elisabeth Estefanía Arrojo Álvarez,MD, PhD** Join the discussion with physicians and researchers around the globe - sign up for your free Cureus account today. Recent article categories: Neurosurgery, Radiation Oncology, Oncology **Download Cureus Media Kit** Whether you’ve just heard of us or have already published with Cureus, your input matters. This quick 3-7 minute survey helps us understand how we’re doing—and how we can serve you better. Specialties Articles Posters Abstracts Collections Channels Competitions Cureus Guides Cureus Honors Author Fees SIQ Article Promotion Advertising Policy Advertise With Us Privacy Policy Terms of Use FAQ Manage Cookies About Cureus Editorial Board Associate Editors About Publishing About Channels About Collections About Competitions Partnerships Careers Blog Sitemap Contact Us Emails and Alerts LinkedIn Facebook X Instagram Youtube **SUBSCRIBE TO OUR NEWSLETTER FOR ALL THE LATEST NEWS AND UPDATES** ISSN: 2168-8184 Public user content licensed CC-BY 4.0"}