{"id": 1333, "name": "The Century Foundation", "domain": "tcf.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://tcf.org/content/commentary/we-led-federal-agencies-here-are-10-ways-that-president-trump-and-elon-musks-attacks-on-federal-workers-will-hurt-you/", "title": "We Led Federal Agencies Here Are 10 Ways That President Trump And Elon Musks Attacks On Federal Workers Will Hurt You", "content": "**The Century FoundationThe Century FoundationThe Century Foundation** The Century Foundation takes your data security and privacy seriously. That's why we want you to know that, when you visit our website, we use technologies like cookies to collect anonymized data so that we can better understand and serve our audience. For more information, see our fullPrivacy Policy. The Century FoundationThe Century FoundationThe Century Foundation Research Experts Events Publications About Donate Century International PK-12 Education English Learners Housing Bridges Collaborative Early Education School Integration Higher Education Higher Education Equity College Accountability College Affordability For-Profit Education Health Care Health Equity Reproductive Justice Expanding Coverage Black Maternal Health COVID-19 Economic Opportunity Manufacturing Ending Poverty Disability Care Economy Unemployment Unions & Organizing **We Led Federal Agencies. Here Are 10 Ways That President Trump and Elon Musk’s Attacks on Federal Workers Will Hurt You** Mark ZuckermanContributor Julie SuSenior Fellow Lauren McFerranSenior Fellow Gayle GoldinSenior Fellow Rachel WestSenior Fellow Chiquita Brooks-LaSureSenior Fellow Ruth FriedmanSenior Fellow Carole JohnsonSenior Fellow Viviann AnguianoSenior Fellow Kayla PatrickSenior Fellow Loredana ValtierraSenior Fellow **Introduction** **Mark Zuckerman, Former Deputy Director of President Obama’s Domestic Policy Council and TCF President** Since taking office, President Donald Trump’s administration—in an initiative led by Elon Musk—has conductedmass firingsat federal agencies. Musk and his so-called Department of Government Efficiency (DOGE) have indiscriminately and illegally fired whole classes of workers without cause or explanation, including thousands of veterans and workers with disabilities. And they have begunlarge-scale“reductionsin force” among federal employees,80 percentof whom live outside the Washington area. That includes laying off10,000 workersat the Department of Health and Human Services and shrinking the Department of Education bynearly half. The Trump administration’s attacks on our federal workforce—manyof whichcourts have already declared illegal—are not just rash. These attacks will make Americans less safe, reduce their earnings and savings, and expose them to scams from big corporations. After my decades of service both on the Hill and in the White House, and ten years as TCF’s president, I know the constant work toward improvement at these federal agencies is never done. But thanks to the efforts of these agencies, we don’t have to fear that drinking water will make our children sick, that our boss will try to skim off the top of our paycheck, or that the schools we send our children to are unsafe places for them to learn and grow. We don’t have to worry that our bank will steal our savings, that the food we eat has spoiled, or that our parent’s Social Security check will never arrive. Many Americans may not recognize the myriad ways the federal government enables us to go about our everyday lives—unless and until it fails to function well. The Trump administration’s indiscriminate layoffs undermine government’s ability to function in ways both large and small. In many cases, people will not be aware of the danger until it’s too late. I asked ten of my TCF colleagues who led federal agencies and programs to share just one example of how the layoffs at their former agency will impact Americans’ everyday lives—from their ability to get health care and work on safe job sites, to being able to access safe, affordable child care programs. For each example below, there are countless additional impacts that will be felt by Americans nationwide. Simply put, families across the country will suffer as the administration continues to work at breakneck speed to unwind programs that have put food on kitchen tables and lifted communities out of poverty. Americans deserve a government that prioritizes their lives. **If you are a worker…** **Julie Su, Former Acting Secretary of Labor, U.S. Department of Labor (DOL)** No job should be a death sentence. The U.S. Department of Labor (DOL) investigates, educates, and holds employers accountable to make sure every worker comes home healthy and safe at the end of the day. After the creation of the Occupational Safety and Health Administration (OSHA), workplace injury, illness, and fatalities have fallen dramatically. This isn’t an accident; it’s the result of tireless, dedicated work by thousands of safety monitors and inspectors across the country who stand up for workers when their employers put them in harm’s way. Mine safety was such a concern that a separate agency was created within the DOL to protect miners. Because of the powers given to the Mine Safety and Health Administration (MSHA),mining fatalities have droppedfrom 273 in 1977 to 28 last year. The so-called Department of Government Efficiency (DOGE) is undermining the work of these agencies. It has begunclosingover thirty MSHA offices,threatening mining communities from coast to coast. DOGE has beendoing the samewith OSHA, in places like Mobile and Baton Rouge, where workers work in plants with dangerous equipment and are responsible for high-risk disaster recovery and oil and gas work along the Gulf coast. When this administration and Elon Musk talk about “efficiency,” we should remember: workers die in the name of efficiency. Already this year, there have been tenminerfatalities, triple the rate of the same time last year. The only people for whom gutting the Department of Labor is “efficient” are greedy corporations that cut corners to line their own pockets. No worker should lose their limbs, lungs and even their lives on the job. Cuts to the DOL mean more preventable injuries, avoidable tragedies, more pain, addiction, more funerals. This is as anti-worker as you can get. **Lauren McFerran, Former Chair, National Labor Relations Board (NLRB)** Seismic shifts in the economy over the past several years have brought a surge in worker organizing and collective action. Health care workers whose lives were at risk during the pandemic joined together to call for safer working conditions and staffing ratios. Retail and service workers who have been treated as disposable demanded fair scheduling and living wages. Workers across industries—from writers and artists to technology workers—spoke out to save their skilled work from being replaced by artificial intelligence. With workers facing such immense challenges, it’s hardly surprising that support for labor unions is near record-high levels. Recent polling shows that70 percentof Americans support labor unions—and workers are taking action. Petitions for union elections have increased dramatically,more than doublingbetween 2021 and 2024. The National Labor Relations Board (NLRB)—the agency that safeguards workers’ right to form and join a union—met this moment with action during the Biden–Harris administration. With the help of the agency’s first funding increase in almost a decade, we put more staff in our field offices across the country to conduct union elections. And the NLRB put outnew rulesto make the union election process more efficient and effective. These rules meaningfully shortened the time it takesfor workers who want a unionto get a vote,more than triplingthe share of union elections that go from petition to vote count in thirty days or less. Even modest new personnel cuts would be devastating to the NLRB’s ability to function. The NLRB’s past efforts to make elections more fair and efficient have already been jeopardized by theunlawful terminationof board member Gwynne Wilcox and bydangerous executive ordersthat would politicize the agency’s efforts to administer the union election process in a neutral manner. The number of employees in NLRB field offices has shrunk by50 percentover the past twenty years—and with further cuts, there may not be enough staff to process petitions, effectively paralyzing the agency from carrying out its mission. Politicizing or otherwise sabotaging the union election process would produce long-term costs for the entire economy. The NLRB is designed to give workers a peaceful mechanism—namely, collective bargaining—to address concerns and resolve disputes. If this process becomes unavailable, workers, unions and employers will inevitably turn to other, more disruptive economic weapons—such as strikes, lockouts, or worse—to serve their interests. If the recent surge in labor activity were to become a surge in labor unrest, workers, employers, and the whole country would suffer the consequences. **Gayle Goldin, Former Deputy Director, U.S. DOL Women’s Bureau** Even before women had secured the right to vote, Congress created theWomen’s Bureau, the only Congressionally mandated agency focused on the needs of working women. The Women’s Bureau conducts research, funds programs, and connects people to the information they need. The successful efforts of the Women’s Bureau have not only benefitted women, from funding apprenticeship programs that break down barriers for women entering high-paying nontraditional careers such as the skilled trades, to pushing Congress to pass thePregnant Workers Fairness Act; but their tireless efforts have also led to the creation of the forty-hour work week and made workplaces safer for all Americans. Despite the progress our nation has made thanks to the Women’s Bureau, President Trump and Republicans in Congress seemdetermined to ensure that it ceases to exist. Sadly, it’s not shocking that an agency focused on the needs of working women would be targeted by this administration. In his first administration, President Trump proposed slashing the Women’s Bureau’s funding by 76 percent, and last year House Republicans attempted to eliminate the bureau entirely. This time around, the bureau’sWomen in Apprenticeship and Nontraditional Occupations(WANTO) grants are on the chopping block, despite historically strong bipartisan support. Chicago Women in the Trades (CWIT), a WANTO grantee, hasfiled suit against the Trump administrationto ensure that their programming can continue to help women move from lower-paid jobs—such as retail—to high-paying jobs in the trades. These programs have helped thousands of women move into good jobs for decades, while challenging the idea of what “women’s work” is. Americans across the political spectrum don’t need partisan attacks on the Women’s Bureau—instead, they need and deserve paid family and medical leave, safe and healthy workplaces, and fair pay. **Rachel West, Former Special Assistant to the President for Labor and Workers, White House Domestic Policy Council** More than one in four workers is employed by a company that does business with the federal government—and Americans deserve to know that our public dollars are not going to companies that illegally discriminate or pay poverty wages. DOL’s Office of Federal Contract Compliance Programs (OFCCP) is the watchdog agency that protectsworkers at the nation’s25,000 federal contractingfirms. Between 2014 and 2024, OFCCP won more than $260 million in damages for workers who had been discriminated against on the job. And it obtained salary adjustments and job opportunities for more than 22,600 workers who were denied equal pay or a fair shot because of their gender, race, or other characteristics, from employers includingLinkedIn,Princeton University,State Street Corp., andNewport News Shipping. The Trump administrationplansto slash OFCCP’s workforce by 90 percent and close all but four of its fifty-five offices, according to a February memo. If implemented, these cuts would essentially end the agency’s ability to conduct compliance reviews and address complaints on hiring, pay, and promotion at thousands of federal contractors—a sector that had contractsworth nearly$770 billionin 2024.That would mean that major companies like Elon Musk’s own SpaceX—one of the largest government contractors—could discriminate against its employees without fear of repercussions.Weakening OFCCP would also increase the risk that federal contract work undercuts pay, protections, and working conditions at other businesses in the local area. What’s more, the Trump administration is now attempting to turn the agency away from its core mission of preventing illegal discrimination—and insteadweaponize OFCCPin Trump’s war against antidiscrimination policies. Cuts to OFCCP and efforts to undermine its mission would escalate Trump and Musk’s assault on the 20 percent of American workers who work for federal contractors. Already, Trump reversed alandmark Civil Rights-era executive orderthat prevented companies from profiting from public dollars while practicing discrimination. And he stripped more than 300,000 federal contract workers of their right to fair pay by reversing President Biden’s2021 executive orderthat would have raised contractors’ minimum wage to $17.75 in 2025. American taxpayers need a strong OFCCP to ensure that our dollars support businesses that uphold our values—not fuel a race to the bottom of unchecked discrimination. **If you or a loved one is sick and needs care…** **Chiquita Brooks-LaSure, Former Administrator for the Centers for Medicare and Medicaid Services (CMS), U.S. Department of Health and Human Services (HHS)** Any cut you make to a health agency should be done with incredible care and consideration for the hundreds of millions of Americans who rely on that agency’s work to stay healthy and get treatment when they’re sick. When you take awrecking ball to an agency like CMS, you’re taking a wrecking ball to the people who are out across the country ensuring our parents and grandparents can get safe, affordable care as they age. You’re taking a wrecking ball to cancer patients who need a new, innovative treatment to be covered. You’re taking a wrecking ball to mothers and newborns who are both at the most critical points of their lives. The new administrationclaimsthat these layoffs will not impact Medicare and Medicaid. They need to prove it. During my time as CMS’s administrator, I learned more than anyone that just because a federal worker’s job title may not mention Medicare and Medicaid explicitly, it does not mean that they are not providing critical support to these programs. We certainly have progress to make to ensure every American can access safe, affordable, timely health care, but laying off thousands of people working toward that progress doesn’t move us forward. **Dr. Ruth Friedman, Former Director of the Office of Child Care at the Administration for Children and Families, HHS** Every day, millions of parents with young children across the nation go to work so that they can put food on the table. These parents need child care programs that are affordable, safe, and support their children’s learning and development. As director of theOffice of Child Care at the Administration for Children and Familieswithin the U.S. Department of Health and Human Services, I ensured that the work my office did each day benefitted every single one of these families. The main goal of the dedicated expert staff is to make child care more affordable for families with low incomes, while also improving the overall quality of care for all families nationwide. We implemented and oversaw theChild Care and Development Fund(CCDF) program, which helps nearly 1 million low-income families afford child care every month. It also sets minimum health and safety standards for nearly all child care programs, and funds activities to expand the supply of child care so more families can access the care they need. Elon Musk and President Trump’sreckless firings and layoffsof the staff at the Office of Child Care will harm the millions of children and families who rely on safe and reliable child care programs, as well as the child care providers who provide an essential community service to American families and the economy at large. By indiscriminately removing staff who direct the office’s $12 billion annual investment in children and families needing child care—without any assessment of program need or employee performance—Musk and Trump have all but ensured that families who are already struggling to make ends meet will have an even more difficult timesecuring and paying for care. That means more parents having to quit their jobs because they simply can’t afford child care. It also means—for the parents who can still afford care—that the classrooms and buildings they send their babies and toddlers to will be less safe, with fewer child care staff to help them safely learn and grow. Today’s parents already have enough challenges to face without having to decide between paying for child care or for rent, or worrying about whether their child care program’s staff has had safe sleep training or are prepared to respond if their child has a food allergy emergency. Every parent who sends a child to child care has the strongest, most personal reason to make sure the Office of Child Care can do its job. These reckless firings will not create savings for the American people—but they will make the lives of families with young children even harder and more expensive. **Carole Johnson, Former Administrator of Health Resources and Services Administration, HHS** TheHealth Resources and Services Administration(HRSA) is the federal agency that works to deliver health care in historically underserved communities, expand the health workforce, support new moms and babies, provide treatment to individuals with HIV, and expand care in rural communities. HRSA programs, which have always had wide bipartisan backing, include supporting federally qualified health centers in urban and rural areas across the country where people can get the care they need at a cost that is based on their resources. This makes health centers a major source of care for people who struggle to afford coverage, deductibles, and co-pays. In my time as administrator, I had the honor and good fortune to meet people all across the country who told me how HRSA programs changed their lives. For example, I met mothers who relied on HRSA-funded maternal health programs as a lifeline to support their newborn babies and connect with critical resources—from emergency diapers to help with post-partum depression. On more than one occasion a mother has told me she wasn’t sure she and her family would be here without their HRSA-supported team helping them every step of the way. HRSA also plays a pivotal role in training the next generation of the health care workforce—from doctors and nurses, to mental health and substance use disorder treatment providers, to maternal health providers. After their training, many of these professionals return to be the only providers in rural and other underserved communities. HRSA is making a life-changing difference. Now that critical work is threatened, as DOGE’srecently announced layoffsat HHS threaten HRSA’s staff. While it is unfair to those whose work at HRSA makes such an important impact, it is devastating for the already-fragile families and individuals who depend on HRSA’s programs—people who will now likely experience disruptions, delays, and potential denials in support, service, and care as a result of the decision to fire the people who make these programs work. **If you are a parent, a student, or a student borrower…** **Viviann Anguiano, Former Director of Education, White House Domestic Policy Council** Every year, 17 million people apply for federal grants and loans so they can pursue their dreams of going to college. And nearly 43 million people owe $1.6 trillion in outstanding federal student loan debt. The Department of Education’s Office of Federal Student Aid (FSA) isobligatedto not only provide federal student aid but also manage student loan repayment in order to make college more affordable for Americans. These obligations include running the Free Application for Federal Student Aid (FAFSA) form each year, annually distributing grants and loans to 10 million people, and managing loan repayment while conducting oversight over companies servicing student loans and providing customer support and outreach to borrowers. FSA has suffered the largest reduction of any part of the Department of Education. Thanks to Elon Musk and President Trump attacks, FSA has lost600 staffdue to layoffs and voluntary resignations. Despite the Trump administration’s claims,expertsdon’tbelievethere are enough staff remaining with the necessary expertise at FSA to successfully administer statutorily mandated activities—activities that affect tens of millions of students and borrowers. Already, the Trump administration was forced to call back fifty workers who were laid off from FSA’s technology office afternational outagesof the FAFSA form took place just one day after the layoffs. But the remaining layoffsincludestaff who ensure student loan servicers are delivering for students; who collect, track, and resolve borrowers’ complaints; who inform stakeholders and borrowers about repayment and forgiveness programs; and who conduct oversight and enforcement to prevent waste, fraud, and abuse. Getting federal money to go to college should be seamless, and managing student loans should be affordable and easy to understand.The Trump administration’s reckless layoffs will mean less opportunity and greater frustration for American students and borrowers. It will mean families with lower incomes who forgo college for their children because they can’t get the information they need to apply for financial aid. It will meanborrowers who find their credit destroyed due to errors by servicers who face little oversight from the diminished FSA workforce. Students and borrowers deserve an FSA that makes their dreams more—not less—attainable. **Kayla Patrick, Former Senior Policy Advisor, U.S. Department of Education** TheU.S. Department of Education’s Office for Civil Rights(OCR) is the frontline defense against discrimination in schools, investigating cases of racism, sexual assault, and disability rights violations. But thelayoff of 240 staff by the Trump administration—which cut its workforce nearly in half—severely weakened OCR’s ability to protect students. Seven of its twelve regional offices have been closed, leaving students and families in vast areas of the country without direct access to civil rights enforcement. This gutting of OCR will create a backlog of cases and leave students vulnerable to unchecked discrimination, harassment, and even assault. The Biden–Harris administration asked Congress toincrease funding to OCRbecause the office operates best when its caseload per attorney is no more than twenty-five. After the cuts, estimates suggest caseloads will balloon to over 200. This overload means families seeking justice for discrimination—whether due to disability, race, religion, or sexual violence—will face months or even years of unnecessary delays. For many, OCR is the only accessible avenue for relief, as private legal action is often too costly and complex. These cuts will havereal-world consequences. Recently, OCR receiveda complaint from Melody and Kamora Dabney, two Black students at Millbury Memorial Junior/Senior High School in Massachusetts, who endured relentless racial bullying, including slurs, threats, and unfair disciplinary actions. Despite their reports, the school failed to intervene and instead punished Melody and Kamora disproportionately. It is the responsibility of this administration to ensure that students like Melody and Kamora receive relief without political interference. A fully staffed OCR could enforce accountability, pushing schools like Millbury to systematically protect students and create safe learning environments for all students. But with reduced resources, cases like Melody and Kamora’s risk going unaddressed, allowing racial hostility to continue unchecked and denying students of color their right to a safe learning environment. Without proper oversight from OCR, schools may neglect or dismantle programs designed to promote equity, increasing discrimination and deepening educational disparities. The stakes are high: weakened civil rights enforcement doesn’t just delay justice—it denies it. A fully staffed OCR is essential to ensuring every student, regardless of background, receives the protections they deserve. **Loredana Valtierra, Former Senior Policy Advisor, U.S. Department of Education** Parents deserve clear, transparent information when making choices and evaluating progress in their child’s education. TheNational Center for Education Statistics(NCES)—a lesser-known but critical arm of the U.S. Department of Education—exists to provide that information. NCES has collected and evaluated data on student achievement, progress, and learning since 1867. The independent, nonpartisan subagency provides the country with regular snapshots on how schools and students are faring, as well as what works in teaching and learning, and what doesn’t. Among other duties, NCES runs and publishes the results of theNation’s Report Card, which helps federal, state, and local level leaders decide the most effective way to spend our tax dollars when it comes to education. During the pandemic, NCES rapidly leveraged their resources to track schools’ reopening progress and students’ attendance by taking a monthly “School Pulse” across the country. This real-time data was critical to Congress and the Department of Education in their mission to equip and safely reopen schools, while also providing parents and school communities with transparent information to hold leaders at every level accountable. The Trump administration has nowgutted the NCES, leaving fewer than five of its 175 employees to carry out the many duties mandated by Congress. This will hurt policymakers’ ability to improve public schools on behalf of America’s children—and it will hurt families’ ability to make school decisions that are right for their children. Though they may not know it, many parents rely on NCES data to compare schools in their local area and even decide where to raise their families. Simply put, without a strong NCES, transparent information on public schools and students’ progress will become a thing of the past. The Trump administration claims to care about parental choice, but gutting NCES will destroy the very tools parents need to make informed decisions about their children’s futures. **Conclusion** No one is arguing that the federal government is doing a perfect job—effective government often requires periods of reform. But the reckless gutting of these agencies is not only throwing the baby out with the bathwater—it’s throwing out the whole bathtub as well. By haphazardly slashing the federal workforce, Trump and Musk are threatening the very basics of day-to-day life that millions of Americans rely on—from health care, to affordable child care, to safe workplaces, to education. This commentary offers a glimpse of the countless ways that Americans will be impacted by Musk and DOGE’s cuts—across geographies, incomes, occupations, and political parties. We can and should constantly mold our federal government into the government Americans deserve—but that improvement cannot be achieved using a chainsaw. Tags:working families,federal workers,Government layoffs **Mass Federal Layoffs Present Unprecedented Unemployment Insurance Challenges** **Trump’s Rapid-Fire Anti-Worker Actions** **RTO (Return to Office) Is WTF (Way Too Formal)** **Merit Staffing in State Employment Service and Unemployment Insurance Programs: Putting the Toothpaste Back into the Tube** **Mark Zuckerman,Contributor** Mark Zuckerman was the President of The Century Foundation from 2015 to 2025, served as President Obama's Deputy Director of the White House Domestic Policy Council from 2011 to 2013, and is a former Democratic Staff Director of the U.S. House Education and Workforce Committee. **Julie Su,Senior Fellow** Julie Su is a senior fellow at The Century Foundation, where she works on a range of issues focused on protecting labor rights, growing worker power, and advancing equity in the economy. **Lauren McFerran,Senior Fellow** Lauren McFerran is a senior fellow at The Century Foundation, having previously served as chairman of the National Labor Relations Board (NLRB) during the Biden administration, from 2021 to 2024. **Gayle Goldin,Senior Fellow** Gayle Goldin is a senior fellow at The Century Foundation, previously having served as deputy director of the Women’s Bureau, U.S. Department of Labor, during the Biden–Harris administration, where she provided executive leadership to the only federal agency mandated by Congress to focus on the needs of working women. **Rachel West,Senior Fellow** Rachel West is a senior fellow at The Century Foundation, most recently having served as special assistant to the president for labor and workers at the White House Domestic Policy Council, where she led efforts to strengthen workers’ pay and overtime protections, advance health and safety protections, and strengthen workplace rights. **Chiquita Brooks-LaSure,Senior Fellow** Chiquita Brooks-LaSure is a senior fellow at The Century Foundation, having previously served as the administrator for the Centers for Medicare and Medicaid Services in the Biden administration from 2021 to 2025. **Ruth Friedman,Senior Fellow** Dr. Ruth Friedman is a senior fellow at The Century Foundation, having previously served as director of the Office of Child Care at the Administration for Children and Families in the U.S. Department of Health and Human Services during the Biden administration. **Carole Johnson,Senior Fellow** Carole Johnson joins The Century Foundation from her role as Administrator of the Health Resources and Services Administration. **Viviann Anguiano,Senior Fellow** Viviann Anguiano is a senior fellow at The Century Foundation, having formerly served as director of education at the White House Domestic Policy Council during the Biden administration, where she led the higher education portfolio. **Kayla Patrick,Senior Fellow** Kayla Patrick is a senior fellow at The Century Foundation, most recently having served as a senior policy advisor in the Office of Planning, Evaluation, and Policy Development at the U.S. Department of Education, where she was the primary policy and political lead for all K–12 grant programs. **Loredana Valtierra,Senior Fellow** Loredana Valtierra is a senior fellow at The Century Foundation, having previously served as senior policy advisor in the Biden–Harris administration in the Office of Planning, Evaluation, and Policy Development at the U.S. Department of Education. **Latest** **Why Doesn’t the Trump NLRB Want Workers to Know their Rights?** **There’s a Smart Way to Renew American Manufacturing. It’s Not Trump’s Strategy.** **TCF President Julie Margetta Morgan: GOP Budget Bill Will Inflict “Immense Pain on Millions”** **Can AI improve America’s unemployment safety net?** **The Top Five Trump Attacks Exacerbating the Child Care Crisis** **America Narrowly Escapes a Terrible Trump Head Start Policy Idea (for Now)** Century InternationalPK-12 EducationHigher EducationHealth CareEconomic Opportunity Century International PK-12 Education Higher Education Health Care Economic Opportunity Century International PK-12 Education Higher Education Health Care Economic Opportunity All PublicationsExperts All Publications Experts All Publications Experts EventsDonateAboutFinancial StatementsContact UsPrivacy Policy Events Donate About Financial Statements Contact Us Privacy Policy Events Donate About Financial Statements Contact Us Privacy Policy ResearchCentury InternationalPK-12 EducationEnglish LearnersHousingBridges CollaborativeEarly EducationSchool IntegrationHigher EducationHigher Education EquityCollege AccountabilityCollege AffordabilityFor-Profit EducationHealth CareHealth EquityReproductive JusticeExpanding CoverageBlack Maternal HealthCOVID-19Economic OpportunityManufacturingEnding PovertyDisabilityCare EconomyUnemploymentUnions & Organizing Century International PK-12 Education English Learners Housing Bridges Collaborative Early Education School Integration Higher Education Higher Education Equity College Accountability College Affordability For-Profit Education Health Care Health Equity Reproductive Justice Expanding Coverage Black Maternal Health COVID-19 Economic Opportunity Manufacturing Ending Poverty Disability Care Economy Unemployment Unions & Organizing Century International PK-12 Education English Learners Housing Bridges Collaborative Early Education School Integration Higher Education Higher Education Equity College Accountability College Affordability For-Profit Education Health Care Health Equity Reproductive Justice Expanding Coverage Black Maternal Health COVID-19 Economic Opportunity Manufacturing Ending Poverty Disability Care Economy Unemployment Unions & Organizing Experts Events Publications About Donate"}