{"id": 2059, "name": "Ayn Rand Institute", "domain": "newideal.aynrand.org", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://newideal.aynrand.org/announcing-ayn-rands-philosophic-achievement-and-other-essays-a-new-book-by-harry-binswanger/", "title": "Announcing Ayn Rands Philosophic Achievement And Other Essays A New Book By Harry Binswanger", "content": "PODCAST IN DEPTH TOPICS ABOUT DONATE Search Search Search PODCAST IN DEPTH TOPICS ABOUT DONATE Search Search Search Search Search Search **AnnouncingAyn Rand’s Philosophic Achievement and Other Essays: A New Book by Harry Binswanger** A collection of nine timely and timeless philosophical essays, now available for purchase. We are happy to announce that a new ARU Press book published on June 1:Ayn Rand’s Philosophic Achievement and Other Essaysby Harry Binswanger. This incisive collection of nine essays was originally printed on the occasion of Dr. Binswanger’sretirementfrom ARI’s board of directors, celebrating his “sixty years of writing about and teaching the philosophy of Objectivism.” The book was given to donors at ARI’s 2024 Gala. To bring it to a wider audience, ARU Press is now making it available for purchase by the public. The collection offers abundant evidence of the breadth of Dr. Binswanger’s scholarship. From reflection on the foundations of morality to the analysis of key concepts in metaphysics and epistemology to commentary on literature and politics, Dr. Binswanger’s philosophic insight on timeless and timely issues has ranged across the board. Consider the essay “The Possible Dream,” which examines how and why the conventional meaning of the concept “perfect” is rooted in mysticism and ultimately destroys self-esteem. But there is a rational need for such a concept and Dr. Binswanger provides a rational, this-worldly conception of “perfection,” showing how it applies in ethics, politics, and epistemology. (Three essays have previously been published inNew Ideal: “The Possible Dream,” “Ayn Rand’s Philosophic Achievement,” and “A Tale of Two Novels.”) In another essay, “Life-Based Teleology and the Foundations of Ethics,” Dr. Binswanger argues that all actions of biological organisms, whether conscious or not, are directed toward goals while inanimate entities are not. Drawing on Rand’s philosophy (particularly “The Objectivist Ethics”), he shows how this thesis helps provide the factual basis for value concepts and the basic premises of a rational ethics. Dr. Binswanger also analyzes important political debates. In debates about capitalism, we often hear that corporations wield tyrannical power over workers and markets, and so need to be regulated by the government. Dr. Binswanger argues that this charge involves a basic equivocation between economic power and political power. As he explains in “The Dollar and the Gun,” the former means the ability to offer value through voluntary transactions, while the latter means the ability to threaten actual, physical force. Ayn Rand’s Philosophic Achievement and Other Essaysisavailable in paperback and Kindle, with audiobook coming soon. If you value the ideas presented here, please become an ARI Member today. **Do you have a comment or question?** Ziemowit Gowin, PhD candidate in philosophy, was a junior fellow at the Ayn Rand Institute and former web editor ofNew Ideal. **Now Online: ‘Altruism as Appeasement’** **The Biological Basis of Teleological Concepts: Excerpt from the Re-issue** Explore unique philosophical content that challenges conventional views — in courses you can take on the go. Available onGoogle PlayandtheApp Store. Media Inquiries Contact Us Privacy Policy Terms & Conditions STAY IN TOUCH facebook twitter linkedin youtube Copyright © 1985 – 2025 The Ayn Rand Institute (ARI). Reproduction of content and images in whole or in part is prohibited. All rights reserved. ARI is a 501(c)(3) nonprofit organization. based in the United States. Contributions to ARI in the United States are tax-exempt to the extent provided by law. Objectivist Conferences (OCON), Ayn Rand Conference (AynRandCon), ARU and the Ayn Rand Institute eStore are operated by ARI. Payments to OCON, AynRandCon, ARU or the Ayn Rand Institute eStore do not qualify as tax-deductible contributions to the Ayn Rand Institute. AYN RAND, AYN RAND INSTITUTE, ARI and the AYN RAND device are trademarks of the Ayn Rand Institute. registered in the United States and other jurisdictions where applicable. All rights reserved. PODCAST IN DEPTH TOPICS ABOUT DONATE Welcome to New Ideal! If you like what you’re reading, be sure to subscribe to our weekly newsletter! You’ll also receive a FREE copy of our book, Illuminating Ayn Rand."}