{"id": 1207, "name": "Sage Journals", "domain": "sagepub.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.sagepub.com/explore-our-content/news/2025/06/06/academic-librarians-call-to-challenge-censorship-in-new-sage-blog-collection", "title": "Academic Librarians Call To Challenge Censorship In New Sage Blog Collection", "content": "UK & Europe North America Africa Asia Australia & New Zealand China Hong Kong SAR, China India Middle East Oceania Taiwan, China South America **Choose your location** Please select your region so that we can show you content and products available in your location UK & Europe North America Africa Asia Australia & New Zealand China Hong Kong SAR, China India Middle East Oceania Taiwan, China South America **Sage news** **Academic librarians call to challenge censorship in new Sage blog collection** A new blog series features nine academic librarian thought leaders address how they navigate current challenges. As censorship and book bans continue to rise across the United States,a new blog seriesfrom Sage features nine academic librarian thought leaders address how they navigate current challenges. Librarians play a vital role in teaching, learning, and research across educational landscapes, and Sage recognizes them as crucial arbiters of knowledge. In this series, collected in 2024, our writers call on their colleagues, coworkers, and the public to protect the freedom to read and learn. Offering insights into the current climate and the future of scholarship, the librarians responded to the following questions: Why is academic freedom so important? How do you think book bans and other forms of censorship in higher education and books will impact the future of scholarship, research, learning? How will it impact librarians more specifically? What do you want your colleagues in higher ed to know and what can they do to help? Their responses highlighted the importance of inclusivity, support, and collective action. “Fellow academics,” writes contributor Amanda Bosch, “rally and support academic freedom and library initiatives! Use and promote library resources. […] Foster self-directed learners, champions of empathy and seekers of truth.” Download the blog collectionand help support academic freedom by sharing with your colleagues. Sage believes free expression in all forms is a basic human right.Visit our Academic Freedom pageto learn more about our efforts to support academic freedom. **The latest from** **Marking 20 years of Apollo Medicine – Celebration by Apollo and Sage** **Sage Campus Adds New Collection Covering Generative AI and EDI in Research** **Sage Honored at Independent Publishing Awards** **Share this article** **You May Also Be Interested In** **Sage grows through key acquisitions ahead of its 60th year** **Charleston Essay Contest Winners** **Sage highlights 2024 achievements in annual Independence with Impact Report** **Sage Honored at Independent Publishing Awards** UK & Europe North America Africa Asia Australia & New Zealand China Hong Kong SAR, China India Middle East Oceania Taiwan, China South America **Choose your location** Please select your region so that we can show you content and products available in your location UK & Europe North America Africa Asia Australia & New Zealand China Hong Kong SAR, China India Middle East Oceania Taiwan, China South America Help and supportHelp and supportAdvertise with usRights & permissionsCareers with SageContact usHelp & FAQs Advertise with us Rights & permissions Careers with Sage Contact us Help & FAQs Advertise with us Rights & permissions Careers with Sage Contact us Help & FAQs About usAbout usAbout SageOur impactOur initiatives About Sage Our impact Our initiatives About Sage Our impact Our initiatives Useful toolsUseful toolsSage TrackSage AdvanceSage Author Services Sage Track Sage Advance Sage Author Services Sage Track Sage Advance Sage Author Services Our other websitesOur other websitesCollege PublishingCorwinTechnology from SageSocial Science SpaceSage Research Methods Community College Publishing Corwin Technology from Sage Social Science Space Sage Research Methods Community College Publishing Corwin Technology from Sage Social Science Space Sage Research Methods Community"}