{"id": 487, "name": "Frontiers Media", "domain": "frontiersin.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/news/2025/06/05/survival-of-the-greenest-worlds-oldest-organizations-sustainability-frontiers-organizational-psychology", "title": "Survival Of The Greenest Worlds Oldest Organizations Sustainability Frontiers Organizational Psychology", "content": "**Frontiers | Science News** Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Mind and body Health Humanities Life sciences Microbiome Neuroscience Psychiatry Psychology Social science Earth and beyond Climate action Earth science Environment Space sciences and astronomy Sustainability Future tech Engineering Robotics and AI Frontiers updates Frontiers news Impact analysis Institutional partnerships Publishing partnerships Society journal news Open science eBooks Open science and peer review Open science policy Research Topics Young Minds Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Mind and body Health Humanities Life sciences Microbiome Neuroscience Psychiatry Psychology Social science Earth and beyond Climate action Earth science Environment Space sciences and astronomy Sustainability Future tech Engineering Robotics and AI Frontiers updates Frontiers news Impact analysis Institutional partnerships Publishing partnerships Society journal news Open science eBooks Open science and peer review Open science policy Research Topics Young Minds Mind and body Health Humanities Life sciences Microbiome Neuroscience Psychiatry Psychology Social science Earth and beyond Climate action Earth science Environment Space sciences and astronomy Sustainability Future tech Engineering Robotics and AI Frontiers updates Frontiers news Impact analysis Institutional partnerships Publishing partnerships Society journal news Open science eBooks Open science and peer review Open science policy Research Topics Young Minds Science News Featured news Survival of the greenest: why world’s oldest organizations are surpassing young upstarts in environmental sustainability **Survival of the greenest: why world’s oldest organizations are surpassing young upstarts in environmental sustainability** In a new article published inFrontiers in Organizational Psychology, Daria Haner, Dr Yilei Wang, Dr Deniz Ones, and Dr Stephan Dilchert, Dr Yagizhan Yazar, and Karn Kaura unveil surprising new findings: the world’s most sustainable businesses are the world’s most long-lived businesses, too. In this guest editorial, they explain their results, discuss the potential underlying reasons for their findings, and underline the importance of sustainability to the future of business. ByDaria Haner,Dr Deniz Ones, andDr Stephan Dilchert What does it take for a company to last for centuries? Ask most business analysts, and you’ll hear about innovation, financial acumen, or strategic pivots. But new research suggests another key to organizational survival: environmental sustainability. In a study recently published inFrontiers in Organizational Psychology, an international team of researchers reveals a robust link between organizations’ longevity and their commitment to environmentally sustainable business practices. The findings challenge the assumption that younger, more agile companies are best positioned to lead on climate and environmental issues. The study explores whether firms that have stood the test of time — some over a century old — are also those most committed to preserving the planet. It’s a timely question. As climate change accelerates and the call for corporate accountability grows louder, understanding the organizational characteristics associated with environmental responsibility is more critical than ever. The study analyzed data from hundreds of firms including industry leaders in tech, manufacturing, and finance in the United States, Europe, the Middle East and North Africa (MENA), and Asia. Our goal was simple yet ambitious: determine whether older organizations exhibit stronger environmental sustainability performance than younger ones. To answer this, our team analyzed environmental, social, and governance (ESG) ratings drawn from multiple independent sources, including CSRHub, S&P Global, and Thomson Reuters, that evaluate companies on dimensions of climate strategy, eco-efficiency, and environmental reporting. **Standing the test of time** The results were striking. In every region examined, older organizations outperformed their younger counterparts on environmental metrics. These effects held even when accounting for company size and wealth, suggesting that longevity itself — not just financial clout — correlates with environmental stewardship. In the United States, for example, companies established more than a century ago showed markedly higher sustainability scores than those formed in the last two decades. The same pattern emerged in MENA and Asian markets. The effect was slightly less pronounced in Europe, likely due to limited availability of incorporation dates of companies in that region, rather than reflecting a substantive difference in sustainability performance. Beyond establishing this link, our paper takes a deeper dive intowhyolder organizations might be greener, building on evolutionary theories of organizations, resource dependence theory, and psychological frameworks like Cybernetic Trait Complexes Theory. Our central thesis: surviving over time requires adaptation—not just to markets, but to environmental and societal demands. Organizations that endure are those that have learned to navigate resource scarcity, respond to public scrutiny, and build sustainable systems into their operations. In this light, sustainability is not an add-on; it is a survival strategy. The implications of this work extend beyond theory. One key takeaway is that sustainability is not just the domain of startups or mission-driven newcomers. Older firms, often seen as sluggish or resistant to change, may in fact be the most effective stewards of sustainability, thanks to decades of institutional knowledge, established systems, and embedded norms. These organizations are not only capable of setting long-term goals; they often have the operational discipline and stakeholder networks to see those goals through. Read and download original article **Green shoots of growth** Our findings also carry weight for policy and practice. Policymakers might consider designing incentives that recognize the sustainability strengths of mature organizations, while also supporting younger companies in building long-term environmental strategies. For investors, the message is equally compelling. ESG scores are increasingly used to evaluate corporate risk and resilience. If sustainability performance is a signal of adaptability and thus of long-term viability, then green credentials may offer a glimpse into a company’s staying power. Still, we must be careful not to paint a one-sided picture. Of course, some legacy firms emerged from eras of industrial pollution and ecological harm. Nonetheless, what matters is not where these companies started but how they have evolved. Our data show that many older firms have adapted meaningfully, outperforming younger peers even in innovation-related sustainability metrics. Perhaps most powerfully, we believe these data call for a new narrative about sustainability in business. Sustainability is not a generational rivalry. It is not a race between new and old, small and large, or East and West; it is a test of adaptation, a shared evolutionary journey where the most enduring organizations are often those that embrace sustainability as central to who they are. The climate crisis is rewriting what it means to lead in business, and in this new chapter, the champions will be not only the boldest or the strongest, but the greenest. About the authors Daria M. Haneris a junior at the University of Pennsylvania, double-majoring in Earth & Environmental Science and Biological Anthropology. A Benjamin Franklin Scholar, she studies human evolution, ecological systems, and the long-term impacts of environmental change. Her research spans excavation and conservation at the Gordion World Heritage Site in Türkiye to large-scale digital preservation efforts at the Penn Museum Archives, work critical to preserving archaeological integrity and human civilization’s collective memory. Daria previously studied sustainable design at Stanford and now explores archaeogenetics, paleobiology, and geoscience, focusing on how human activity shapes—and is shaped by—Earth’s dynamic systems. She is passionate about how the past informs our understanding of environmental futures. Dr Deniz S. Onesis the Hellervik Professor of Industrial Psychology and Distinguished McKnight University Professor, as well as Distinguished University Teacher at the University of Minnesota. An internationally recognized expert in individual differences and employee selection, her research spans environmental sustainability, organizational effectiveness, and the long-term viability of human systems. Her sustainability research focuses on how organizational human resources, leadership, and workforce characteristics contribute to environmental performance and corporate performance. Dr Stephan Dilchertis Associate Professor of Management at the Zicklin School of Business, Baruch College, City University of New York, where he also serves as Academic Director of the Executive MBA and Executive Master’s Program in Human Resource Management. His research focuses on the intersection of individual differences, organizational effectiveness, and workplace sustainability, with particular emphasis on how human capital factors influence pro-environmental behaviors at work. Dr. Dilchert has published widely on topics including green HR practices, corporate social responsibility, and sustainable talent management. REPUBLISHING GUIDELINES: Open access and sharing research is part ofFrontiers’ mission. Unless otherwise noted, you can republish articles posted in the Frontiers news site — as long as you include a link back to the original research. Selling the articles is not allowed. **Related Content** **Sustainability in space travel can aid efforts here on Earth** **Sustainability in space travel can aid efforts here on Earth** **Antarctic extreme events: ‘All-time records are being shattered not from decades ago, but from the last few years and months’** **Antarctic extreme events: ‘All-time records are being shattered not from decades ago, but from the last few years and months’** **Scientists call for urgent action to prevent immune-mediated illnesses caused by climate change and biodiversity loss** **Scientists call for urgent action to prevent immune-mediated illnesses caused by climate change and biodiversity loss** **Our power, our planet: Five Frontiers articles for Earth Day** **Our power, our planet: Five Frontiers articles for Earth Day** **Post related info** June 05, 2025 **Angharad Brewer Gillham** Editor **Angharad Brewer Gillham** Editor **Post categories** **Featured news** **Featured news** **Environment** **Environment** **Humanities** **Humanities** **Related Subjects** **Environment** **Environment** **Humanities** **Humanities** **Frontiers in Organizational Psychology** **Frontiers in Organizational Psychology** **Latest posts** **An Alaskan volcano could help scientists understand why ‘stealthy’ volcanoes erupt without warning** **An Alaskan volcano could help scientists understand why ‘stealthy’ volcanoes erupt without warning** **Protected Antarctic oceanic life threatened by ships anchoring, first underwater videos show** **Protected Antarctic oceanic life threatened by ships anchoring, first underwater videos show** **Statins may reduce risk of death by 39% for patients with life-threatening sepsis** **Statins may reduce risk of death by 39% for patients with life-threatening sepsis** **Survival of the greenest: why world’s oldest organizations are surpassing young upstarts in environmental sustainability** **Survival of the greenest: why world’s oldest organizations are surpassing young upstarts in environmental sustainability** **Young people discover the technologies shaping their future in the World Economic Forum and Frontiers for Young Minds collection** **Young people discover the technologies shaping their future in the World Economic Forum and Frontiers for Young Minds collection** **Related Content** **Sustainability in space travel can aid efforts here on Earth** **Sustainability in space travel can aid efforts here on Earth** **Antarctic extreme events: ‘All-time records are being shattered not from decades ago, but from the last few years and months’** **Antarctic extreme events: ‘All-time records are being shattered not from decades ago, but from the last few years and months’** **Scientists call for urgent action to prevent immune-mediated illnesses caused by climate change and biodiversity loss** **Scientists call for urgent action to prevent immune-mediated illnesses caused by climate change and biodiversity loss** **Our power, our planet: Five Frontiers articles for Earth Day** **Our power, our planet: Five Frontiers articles for Earth Day** Get the latest research updates, subscribe to our newsletter GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}