{"id": 1263, "name": "Staten Island Advance", "domain": "silive.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.silive.com/highschoolsports/2025/06/college-signings-6-wrestling-or-baseball-this-petrides-senior-made-a-decision-and-landed-at-this-d2-school.html", "title": "College Signings 6 Wrestling Or Baseball This Petrides Senior Made A Decision And Landed At This D2 School.html", "content": "**College Signings 6: Wrestling or baseball? This Petrides senior made a decision and landed at this D2 school** Updated:Jun. 11, 2025, 1:06 p.m. |Published:Jun. 11, 2025, 1:06 p.m. Petrides senior Lorenzo Lamattina is joined by mom Maria and dad Lawrence as he signs a National Letter of Intent to attend Georgian Court.(Courtesy of Courtesy of Joe Pena) Charlie De Biase Jr. | debiase@siadvance.com STATEN ISLAND, N.Y. — There’s nothing like having choices and Petrides senior Lorenzo Lamattina had plenty when it came to deciding where he’d go to college. Those choices, however, didn’t come from just one sport. As a four-year varsity student-athlete for the Panthers’ baseball and wrestling teams, he drew a plethora of interest from coaches in both sports If you purchase a product or register for an account through a link on our site, we may receive compensation.By using this site, you consent to ourUser Agreementand agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with ourPrivacy Policy. **Footer Navigation** Community Rules Contact Us Advertise with us About SILive.com Accessibility Statement SILive.com Staten Island Advance Newsletters Manage Your Subscription Place a Vacation Hold Make a Payment Delivery Feedback Reprints View E-Edition Entertainment High School Sports Business Sports Betting News Opinion Rentals Autos Classifieds Obituaries Jobs Real Estate Mobile apps Videos Weather News Post a job Archives Local Life Special Sections Post a classified ad Sell/rent your home Search Sell your car Sponsor Content Facebook Twitter YouTube Instagram RSS Your Privacy Choices Privacy Policy |User Agreement |Ad Choices **Disclaimer** Use of and/or registration on any portion of this site constitutes acceptance of ourUser Agreement, (updated 8/1/2024) and acknowledgement of ourPrivacy Policy,andYour Privacy Choices and Rights(updated 1/1/2025). ©2025Advance Local Media LLC. All rights reserved (About Us).The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Advance Local. Community Rulesapply to all content you upload or otherwise submit to this site. YouTube's privacy policyis availablehereandYouTube's terms of serviceis availablehere. Ad Choices"}