{"id": 220, "name": "Chicago Tribune", "domain": "chicagotribune.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.chicagotribune.com/2025/06/10/state-agrees-to-pay-1-3m-for-never-built-migrant-tent-encampment-despite-gov-jb-pritzkers-assurances/", "title": "State Agrees To Pay 1 3m For Never Built Migrant Tent Encampment Despite Gov Jb Pritzkers Assurances", "content": "eNewspaper eNewspaper Subscriber ServicesSubscriber ServicesManage SubscriptionEZ PayVacation StopDelivery Issue Subscriber Services Manage Subscription EZ Pay Vacation Stop Delivery Issue Subscriber Services Manage Subscription EZ Pay Vacation Stop Delivery Issue Today’s E-EditionsChicago TribuneEvening EditionThe Beacon NewsThe Courier-NewsDaily SouthtownLake County News-SunNaperville SunPost-TribuneNaperville Magazine Chicago Tribune Evening Edition The Beacon News The Courier-News Daily Southtown Lake County News-Sun Naperville Sun Post-Tribune Naperville Magazine Chicago Tribune Evening Edition The Beacon News The Courier-News Daily Southtown Lake County News-Sun Naperville Sun Post-Tribune Naperville Magazine Advertise with UsAdvertise with UsClassifiedWho’s WhoJobs Advertise with Us Classified Who’s Who Jobs Advertise with Us Classified Who’s Who Jobs BusinessBusinessCareers & FinanceTop WorkplacesReal EstateTransportation Business Careers & Finance Top Workplaces Real Estate Transportation Business Careers & Finance Top Workplaces Real Estate Transportation DiningDiningLouisa Kung Liu ChuRecipes Dining Louisa Kung Liu Chu Recipes Dining Louisa Kung Liu Chu Recipes EntertainmentEntertainmentAdviceArtsBooksHome and GardenMoviesMuseumsMusicThe Theater LoopTravelTV and Streaming Entertainment Advice Arts Books Home and Garden Movies Museums Music The Theater Loop Travel TV and Streaming Entertainment Advice Arts Books Home and Garden Movies Museums Music The Theater Loop Travel TV and Streaming En Español NewsLatest HeadlinesCrime and Public SafetyEducationEnvironmentHealthHistoryImmigrationInvestigationsLocal NewsMarijuanaNational NewsScienceWorld NewsWeather Latest Headlines Crime and Public Safety Education Environment Health History Immigration Investigations Local News Marijuana National News Science World News Weather Latest Headlines Crime and Public Safety Education Environment Health History Immigration Investigations Local News Marijuana National News Science World News Weather OpinionOpinionEditorialsCommentaryLettersTribune Voices Opinion Editorials Commentary Letters Tribune Voices Opinion Editorials Commentary Letters Tribune Voices PoliticsPoliticsElections Politics Elections Politics Elections Chicago Bulls Chicago White Sox Chicago Bears Chicago Cubs Chicago Blackhawks SportsSportsChicago BearsChicago BullsChicago BlackhawksChicago CubsChicago White SoxChicago SkyCollege SportsSoccer Sports Chicago Bears Chicago Bulls Chicago Blackhawks Chicago Cubs Chicago White Sox Chicago Sky College Sports Soccer Sports Chicago Bears Chicago Bulls Chicago Blackhawks Chicago Cubs Chicago White Sox Chicago Sky College Sports Soccer Aurora Beacon-News Daily Southtown Elgin Courier-News Lake County News-Sun Naperville Sun Post-Tribune SuburbsAll SuburbsAurora Beacon NewsDaily SouthtownElgin Courier-NewsLake County News-SunNaperville SunPost-Tribune All Suburbs Aurora Beacon News Daily Southtown Elgin Courier-News Lake County News-Sun Naperville Sun Post-Tribune All Suburbs Aurora Beacon News Daily Southtown Elgin Courier-News Lake County News-Sun Naperville Sun Post-Tribune Classifieds Jobs ObituariesObituariesNews ObituariesPlace an obituary Obituaries News Obituaries Place an obituary Obituaries News Obituaries Place an obituary Special Sections Branded ContentPaid Partner ContentAdvertising by AscendPaid Content by Brandpoint Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Subscribe Log In Logout Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to share on X (Opens in new window)X Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email Subscribe Log In Sign up for email newsletters Subscribe Login eNewspaper eNewspaper Trending: 🏫 Northwestern cuts 📜 ICE raids: Legal experts weigh in 🛣️ Route 66 road trip ✝️ Pope Leo XIV: What to know ✍️ Asking Eric 📆 Today in History **State agrees to pay $1.3M for never-built migrant tent encampment despite Gov. JB Pritzker’s assurances** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to share on X (Opens in new window)X Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email Signs proclaiming environmental hazards are posted on a fence as the tent encampment for migrants in constructed in the Brighton Park neighborhood, Nov. 29, 2023. (E. Jason Wambsgans/Chicago Tribune) Workers begin building the tent encampment for migrants in Chicago, Nov. 29, 2023. (Antonio Perez/Chicago Tribune) Tents for a migrant camp sit empty in Brighton Park, Dec. 5, 2023, in Chicago. Gov. JB Pritzker moved to officially halt construction of the shelter encampment. (Talia Sprague/Chicago Tribune) Workers build the tent encampment for migrants at a lot in the Brighton Park neighborhood, Nov. 29, 2023. (E. Jason Wambsgans/Chicago Tribune) Workers begin work on a frame for a tent as they start building Chicago’s tent encampment for migrants, Nov. 29, 2023.(Antonio Perez/Chicago Tribune) A police officer watches a protester during a rally to demand a stop to the proposed tent city for migrants on Sacramento Avenue, Oct. 19, 2023. (Antonio Perez/Chicago Tribune) Worker dismantle parts of the formerly proposed migrant encampment in Chicago's Brighton Park area on Dec. 7, 2023. (Antonio Perez/Chicago Tribune) Homes across the street from the closed migrant tent encampment site in the 3700 block of South California Avenue in the Brighton Park neighborhood, Dec. 14, 2023, in Chicago. (John J. Kim/Chicago Tribune) Antonio Perez/Chicago TribuneDozens of protesters demand a stop to a proposed tent city for migrants at 3800 S. California Ave. in Chicago's Brighton Park neighborhood on Oct. 19, 2023. Antonio Perez/Chicago TribuneA worker removes fabric material on Dec. 7, 2023, from a large tent structure two days after Gov. J.B. Pritzker's administration moved to officially scrap Mayor Brandon Johnson's plan to build a migrant camp in Brighton Park. Antonio Perez/Chicago TribuneA worker on a lift removes material from the frame of a large tent at the formerly proposed Brighton Park migrant encampment on Dec. 7, 2023, in Chicago. Trent Sprague/Chicago TribunePeople celebrate the cancellation of a proposed migrant camp in Brighton Park on Dec. 5, 2023, in Chicago. Trent Sprague/Chicago TribuneSigns proclaiming environmental hazards hang on a fence at the site of a proposed migrant camp in Brighton Park on Dec. 5, 2023. The project has been cancelled. Trent Sprague/Chicago TribuneLarge tents emerge at a proposed migrant encampment in the Brighton Park neighborhood on Dec. 5, 2023. Trent Sprague/Chicago TribuneJudy Mai, of Brighton Park, dances while celebrating the cancellation of a proposed migrant camp in Brighton Park on Dec. 5, 2023. Gov. J.B. Pritzker's administration moved to officially scrap Mayor Brandon Johnson's plan to build a migrant camp on a Southwest Side lot, the state announced Tuesday morning while issuing a scathing rebuke of the city's evaluation of the land's potential environmental hazards. Armando L. Sanchez/Chicago TribuneA construction site for a proposed migrant camp sits empty in Brighton Park on Dec. 5, 2023. Trent Sprague/Chicago TribuneA construction site for a proposed migrant camp sits empty in Brighton Park on Dec. 5, 2023. Gov. J.B. Pritzker's administration moved to officially scrap Mayor Brandon Johnson's plan to build a migrant camp on a controversial Southwest Side lot, the state announced Tuesday morning. Armando L. Sanchez/Chicago TribuneA sign across the street for a proposed migrant camp site in Brighton Park on Dec. 5, 2023. Gov. J.B. Pritzker's administration moved to officially scrap Mayor Brandon Johnson's plan to build a migrant camp on a controversial Southwest Side lot, the state announced Tuesday morning while issuing a scathing rebuke of the city's evaluation of the land's potential environmental hazards. Armando L. Sanchez/Chicago TribuneA construction site for a proposed migrant camp sits empty in Brighton Park on Dec. 5, 2023. Armando L. Sanchez/Chicago TribunePeople walk past a proposed migrant camp site in Brighton Park on Dec. 5, 2023. Trent Sprague/Chicago TribuneA construction site for a proposed migrant camp sits empty in Brighton Park on Dec. 5, 2023. Trent Sprague/Chicago TribuneSigns proclaiming environmental hazards on a fence at the site of a proposed migrant camp in Brighton Park on Dec. 5, 2023. Eileen T. Meslar/Chicago TribuneThe Chicago Coalition Against GardaWorld protests at the Brighton Park migrant camp site on Dec. 4, 2023. Trent Sprague/Chicago TribuneWorkers install a large structure in Brighton Park on Dec. 1, 2023, at the site of a migrant tent encampment near 38th Street and California Avenue. E. Jason Wambsgans/Chicago TribuneProtesters rally as work progresses on the Chicago's first government-run tent encampment for migrants at a lot in the Brighton Park neighborhood on Nov. 29, 2023. E. Jason Wambsgans/Chicago TribuneWork progresses on the Chicago's first government-run tent encampment for migrants in the Brighton Park neighborhood on Nov. 29, 2023. Antonio Perez/Chicago TribuneWorkers frame a structure as they start building Chicago's first government-run tent encampment for migrants at 38th Street and California Avenue in Chicago, Nov. 29, 2023. Antonio Perez/Chicago TribuneWorkers build Chicago's first government-run tent encampment for migrants, Nov. 29, 2023, in the Brighton Park neighborhood. Antonio Perez/Chicago TribuneWorkers erect a structure as they start building the Brighton Park tent encampment for migrants on Nov. 29, 2023. Antonio Perez/Chicago TribuneWorkers lay out several beams as they begin building the Brighton Park tent encampment for migrants at 38th Street and California Avenue in Chicago on Nov. 29, 2023. E. Jason Wambsgans/Chicago TribuneRoberto Silvestre protests at the gate of the proposed tent city site in the Brighton Park neighborhood on 38th Street on Nov. 27, 2023. E. Jason Wambsgans/Chicago TribuneConstruction equipment is seen at the proposed tent city site in the Brighton Park neighborhood on Nov. 27, 2023. E. Jason Wambsgans/Chicago TribuneProtesters hold signs at the gate at the intersection of 38th Street and South California Avenue as work gets underway at the proposed tent city site in the Brighton Park neighborhood on Nov. 27, 2023. E. Jason Wambsgans/Chicago TribuneWorkers walk through the proposed tent city site in Chicago's Brighton Park neighborhood on Nov. 27, 2023. Terrence Antonio James/Chicago TribunePeople protest across the street from the proposed migrant tent camp at 38th Street and South California Avenue in Chicago, Nov. 16, 2023. Terrence Antonio James/Chicago TribuneA man peers through an opening in a fence in the 3700 block of South California Avenue in Chicago, Nov. 10, 2023, at a vacant lot that is a proposed site for construction of a winterized tent to shelter migrants. Terrence Antonio James/Chicago TribunePeople protesting against the possible construction of a winterized tent camp for migrants on a vacant lot at 38th Street and South California Avenue in Chicago march on Archer Avenue, Nov. 10, 2023. Terrence Antonio James/Chicago TribunePeople stand in their doorway as protesters against the possible construction of a winterized tent camp for migrants march to the Archer Avenue office of 12th Ward Ald. Julia Ramirez, Nov. 10, 2023. Trent Sprague/Chicago TribuneProtesters march on West 38th Street in the Brighton Park neighborhood on Nov. 10, 2023, against a proposed migrant camp at 38th and South California Avenue. Trent Sprague/Chicago TribuneHundreds of people against a proposed tent city for migrants in Brighton Park protest in front of the office of Ald. Julia Ramirez, 12th, on Nov. 10, 2023. Chris Sweda/Chicago TribunePeople against a plan for temporary shelter for migrants at 38th Street and South California Avenue in Chicago's Brighton Park neighborhood cheer at a public meeting at Kelly High School, Oct. 24, 2023. Chris Sweda/Chicago TribunePeople unable to get into Kelly High School due to capacity restrictions relax outside during a public meeting about a proposed temporary shelter for migrants on Oct. 24, 2023. Chris Sweda/Chicago TribunePeople line up on Oct. 24, 2023, to enter Kelly High School for a public meeting about a proposed migrant temporary shelter in Chicago's Brighton Park neighborhood. Chris Sweda/Chicago TribuneAld. Julia Ramirez, 12th, speaks at a meeting to discuss a plan for a temporary shelter for migrants in Chicago's Brighton Park neighborhood on Oct. 24, 2023. Antonio Perez/Chicago TribuneDozens of protesters rally against the proposed tent city for migrants along the 3800 block of South California Avenue in Chicago on Oct. 24, 2023. Antonio Perez/Chicago TribuneDan Pattan watches protesters from the window of his home, which is across the street from the site of a proposed migrant tent city in the 3800 block of South California Avenue, Oct. 24, 2023. Although he said he sympathizes with the migrants, he is not pleased that he and his neighbors were not told of the proposal. \"No one let us know. I thought it was going to be a strip mall,\" Pattan said. Antonio Perez/Chicago TribuneDozens of protesters block the entrance along 38th Street as they rally against a proposed migrant tent city in the Brighton Park neighborhood on Oct. 24, 2023. Antonio Perez/Chicago TribuneProtesters rally in front of workers at a proposed winterized tent city site for migrants in the 3800 block of South California Avenue in Chicago on Oct. 24, 2023. Antonio Perez/Chicago TribunePolice officers and firefighters stand outside the site of a proposed migrant tent city in the 3800 block of South California Avenue in Chicago on Oct. 24, 2023. Antonio Perez/Chicago TribuneA police officer passes by a work site as dozens of protesters rally against a proposed migrant tent city along the 3800 block of South California Avenue in Chicago, Oct. 24, 2023. Antonio Perez/Chicago TribuneDozens of protesters rally against the proposed migrant tent city in the Brighton Park neighborhood on Oct. 24, 2023. Antonio Perez/Chicago TribuneA scooter rider passes by several handwritten signs against the proposed migrant tent city site on Oct. 24, 2023. Antonio Perez/Chicago TribuneA police officer operates a gate for truck traffic as dozens of protesters demand a stop to the migrant tent city plan at Sacramento Avenue, Oct. 19, 2023. Antonio Perez/Chicago TribuneDozens of protesters demand a stop to a proposed migrant tent city at 3800 S. California Ave. in Chicago's Brighton Park neighborhood on Oct. 19, 2023. Antonio Perez/Chicago TribunePeople protest a proposed migrant tent city in the Brighton Park neighborhood on Oct. 19, 2023. Antonio Perez/Chicago TribuneProtesters line the 2800 block of Chicago's 38th Street to demand a stop to a tent city plan for migrants. Antonio Perez/Chicago TribunePeople protest a proposed tent city for migrants in Chicago's Brighton Park neighborhood. Antonio Perez/Chicago TribuneA home displays a sign protesting a proposed migrant tent city in the Brighton Park neighborhood. Antonio Perez/Chicago TribuneA protester beats a drum as demonstrators in the Brighton Park neighborhood demand a stop to the proposed migrant tent city at 3800 S. California Ave. Antonio Perez/Chicago TribunePeople block an entrance to a proposed migrant tent city for on Oct. 19, 2023, in Chicago's Brighton Park neighborhood. Antonio Perez/Chicago TribunePeople protest a migrant tent city plan in the Brighton Park neighborhood on Oct. 19, 2023. Antonio Perez/Chicago TribuneA Chicago police officer works as protesters demand a stop to the proposed Brighton Park tent city for migrants. Antonio Perez/Chicago TribuneA police officer watches while a protester puts up a sign as people demand a halt to a proposed migrant tent camp in the Brighton Park neighborhood on Oct. 19, 2023. Antonio Perez/Chicago TribuneProtesters hold signs and demand a stop to the proposed tent city for migrants. Antonio Perez/Chicago TribunePolice keep watch as people protest a possible tent encampment for migrants in the Brighton Park neighborhood on Oct. 19, 2023. Antonio Perez/Chicago TribuneA police officer opens a gate as people protest a possible tent encampment for migrants in the Brighton Park neighborhood. Antonio Perez/Chicago TribuneConstruction equipment works at a proposed site for a migrant tent encampment at 3800 S. California Ave., Oct. 17, 2023. Antonio Perez/Chicago TribunePeople work in an empty parking lot at 38th Street and California Avenue, Oct. 17, 2023. Antonio Perez/Chicago TribuneA worker sprays water on a sidewalk outside a fenced former parking lot along 38th Street, the site of the possible migrant tent city. John J. Kim/Chicago TribuneSofia Salinas walks along the fenced-in area that was to become a migrant tent encampment near her home in the Brighton Park neighborhood, Dec. 14, 2023, in Chicago. Salinas and her neighbors are concerned about the presence of ground chemicals on the site that prevented the encampment from opening. She said all of the construction that had been completed was taken down fully by the previous night. Despite assurances from Gov. JB Pritzker that state taxpayers would not end up footing the bill for a migrant tent encampment in Chicago that was never built, the state recently agreed to pay $1.3 million to the project’s contractor. Pritzker made thehighly publicized decisionto halt construction of the shelter encampment in Chicago’s Brighton Park neighborhood in December 2023, saying “serious environmental concerns” were still present at the city-selected site. The governor’s decision caused theBrighton Park projectto be scrapped, and it signaled an early political rift between the governor and Mayor Brandon Johnson, who was pushing for the shelter to be built as winter arrived and the migrant crisis in the city continued. Pritzker that month also made public assurances that the project’s state contractor, GardaWorld Federal Services, would absorb the costs of the work that it had already put into constructing the camp. “The understanding with GardaWorld is that they will do other work with us,” Pritzkertold reportersat an unrelated event in December 2023. “And they knew, as they were building this shelter, before the environmental report came in, that it was possible that the environmental report wouldn’t allow the building — the completion, rather — of the shelter. And so they understood that, and they were willing to take that liability on through the state’s contract.” Officials with Pritzker’s office also said the company had agreed not to charge the state if the land was deemed unsafe. But a $1.3 million payment to GardaWorld was tucked into the recently approved $55 billion state spending plan being sent to Pritzker’s desk. And Pritzker’s Illinois Department of Human Services, which spearheaded the state’s portion of the migrant response, agreed this April to settle a dispute with GardaWorld over payment for its work at the site, other state records show. In response to questions about the apparent contradiction, a Pritzker spokesman maintained that “GardaWorld had no contractual right to payment.” Nevertheless, the state agreed to pay the company because “the situation evolved,” Pritzker spokesman Alex Gough said. Neither Pritzker’s office nor officials with the state Human Services Department would explain why the state agreed to pay if it was under no legal obligation to do so. GardaWorld did not respond to requests for comment. The so-calledbase camp at the former industrial siteat 38th Street and California Avenue was initially pitched in the fall of 2023 as a way to safely house migrants who arrived from the southern border in such large numbers that the city’s shelter system was overwhelmed. At the time, more than 24,000 migrants had come to Chicago, mostly hailing from Central and South America, with the influx being so great during fall 2023 that a peak of about 3,800 arrivals were camped at police stations and O’Hare International Airport. Johnson initially unveiled the general tent camp idea in September 2023. While Pritzker publicly said at the time he preferred to use existing buildings if possible,the Tribune later revealedPritzker’s administration had first pitched the idea of “outdoor (soft sided)” lodging options even before Johnson took office. Once Johnson did formally present the idea, he suggested the city could place asylum-seekers in heated winter tents, and theBrighton Park base campcould house approximately 2,000 migrants at a time as they waited for brick-and-mortar shelters to become available. While Pritzker pledged $65 million in state funding for tent encampment work, the Brighton Park site could not be opened until it cleared an environmental study. Despite that, just after Thanksgiving of 2023 and before the environmental report was concluded, GardaWorld began construction on the site, with the governor later saying the company had agreed not to charge the state if the land was deemed unsafe. That happened weeks later with the release of the city’s environmental review late on a Friday evening. Pritzker’s staff saw its contents at roughly the same time as those who’d filed open records requests for the nearly 800-page document and the governor’s office said the site was not safe to house people. The incident set off days of finger-pointing between the governor’s office and City Hall and stirred controversy and inflamed tensions between Pritzker and Johnson early in the new mayor’s tenure. Now, according to records from the Illinois Court of Claims, which handles monetary claims against the state, the Human Services Department and the contractor were “in agreement” that GardaWorld was owed $1.3 million “for services rendered at the 38th and California site” during the state budget year that ended June 30, 2024. They also agreed that the money would be “considered full payment and satisfaction of all claims by GardaWorld against the Illinois Department of Human Services” for the site work. The state payment, to be made in the state budget year that begins July 1 if Pritzker signs the spending plan as expected, would essentially close the books on the unrealized migrant tent encampment plan. But it isn’t the only cost borne by taxpayers for the unused site. Aside from the money the state is set to pay out, the city spent about $1.7 million on environmental remediation and a settlement with the property’s owner. The mayor’s office has said the remediation will provide “a lasting community benefit.” Republicans nationally have long blamed the migrant crisis on what they characterized as former President Joe Biden’s failure to enforce immigration laws. The Illinois GOP also blamed Pritzker and other Democrats in Springfield for enacting policies that welcome immigrants and provide government services regardless of legal status. The Democrats in Washington, D.C., Springfield and elsewhere, meanwhile, faulted congressional Republicans for blocking comprehensive efforts to overhaul the immigration system and GOP governors for sending migrants to other states with little care for what would happen to them after they arrived at more northern locales. “It’s clear taxpayers are still on the hook for the migrant crisis of the Democrat majority’s making,” Illinois House Republican Leader Tony McCombie of Savanna said in a recent statement. “This is just one of the many repercussions taxpayers will face for continued agency mismanagement under the Pritzker administration.” About a month after the brouhaha between Pritzker and Johnson over the Brighton Park site, the state opened a long-discussed but much smaller shelter in a former CVS store in the Little Village neighborhood. The shelter, large enough to accommodate about 300 migrants, was operated by GardaWorld and nonprofit New Life Centers and closed after about 10 months in late October 2024. GardaWorld also worked with the state to open two other shelters last summer: One in a recently renovated Holiday Inn in the West Lawn neighborhood that could house up to 1,700 people and another 750-bed facility for families in a former Hyde Park hotel. Migrant and homeless shelters have since been merged through the “One System Initiative.” GardaWorld completed its work with the state Human Services Department in January, an agency spokeswoman said. Over the past two years, the state has paid the Virginia-based company nearly $46.7 million, according to the state comptroller’s office. Chicago Tribune’s Jeremy Gorner contributed. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to share on X (Opens in new window)X Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email **RevContent Feed** **Most Popular** 17 arrested as Chicago protesters march against Donald Trump’s immigration crackdown17 arrested as Chicago protesters march against Donald Trump's immigration crackdown **17 arrested as Chicago protesters march against Donald Trump’s immigration crackdown** **17 arrested as Chicago protesters march against Donald Trump’s immigration crackdown** Daily Horoscope for June 11, 2025Daily Horoscope for June 11, 2025 **Daily Horoscope for June 11, 2025** **Daily Horoscope for June 11, 2025** Daily Horoscope for June 10, 2025Daily Horoscope for June 10, 2025 **Daily Horoscope for June 10, 2025** **Daily Horoscope for June 10, 2025** Loss of over-the-air TV leaves some Chicago sports fans frustrated with new CHSN-Comcast dealLoss of over-the-air TV leaves some Chicago sports fans frustrated with new CHSN-Comcast deal **Loss of over-the-air TV leaves some Chicago sports fans frustrated with new CHSN-Comcast deal** **Loss of over-the-air TV leaves some Chicago sports fans frustrated with new CHSN-Comcast deal** State agrees to pay $1.3M for never-built migrant tent encampment despite Gov. JB Pritzker’s assurancesState agrees to pay $1.3M for never-built migrant tent encampment despite Gov. JB Pritzker's assurances **State agrees to pay $1.3M for never-built migrant tent encampment despite Gov. JB Pritzker’s assurances** **State agrees to pay $1.3M for never-built migrant tent encampment despite Gov. JB Pritzker’s assurances** Chicago responds to President Donald Trump’s aggressive immigration raids with protests. Here’s what we know.Chicago responds to President Donald Trump's aggressive immigration raids with protests. Here's what we know. **Chicago responds to President Donald Trump’s aggressive immigration raids with protests. Here’s what we know.** **Chicago responds to President Donald Trump’s aggressive immigration raids with protests. Here’s what we know.** Northwestern announces cost-cutting measures amid growing financial pressuresNorthwestern announces cost-cutting measures amid growing financial pressures **Northwestern announces cost-cutting measures amid growing financial pressures** **Northwestern announces cost-cutting measures amid growing financial pressures** Chicago Bears CEO Kevin Warren pays nearly $2.3M for Lake Forest mansionChicago Bears CEO Kevin Warren pays nearly $2.3M for Lake Forest mansion **Chicago Bears CEO Kevin Warren pays nearly $2.3M for Lake Forest mansion** **Chicago Bears CEO Kevin Warren pays nearly $2.3M for Lake Forest mansion** Chicago could force Uber and Lyft to hike driver payChicago could force Uber and Lyft to hike driver pay **Chicago could force Uber and Lyft to hike driver pay** **Chicago could force Uber and Lyft to hike driver pay** Prime Healthcare cutting about 100 jobs across its Illinois facilities, months after acquiring hospitals from AscensionPrime Healthcare cutting about 100 jobs across its Illinois facilities, months after acquiring hospitals from Ascension **Prime Healthcare cutting about 100 jobs across its Illinois facilities, months after acquiring hospitals from Ascension** **Prime Healthcare cutting about 100 jobs across its Illinois facilities, months after acquiring hospitals from Ascension** **More in Politics** Defense Secretary Pete Hegseth defends use of troops to protect LA immigration raids **Defense Secretary Pete Hegseth defends use of troops to protect LA immigration raids** **Defense Secretary Pete Hegseth defends use of troops to protect LA immigration raids** President Donald Trump says US gets rare earth minerals from China in trade deal, tariffs on Chinese goods go to 55% **President Donald Trump says US gets rare earth minerals from China in trade deal, tariffs on Chinese goods go to 55%** **President Donald Trump says US gets rare earth minerals from China in trade deal, tariffs on Chinese goods go to 55%** Michael Madigan, ComEd and corruption: How the investigation into the ex-Illinois Speaker unfolded **Michael Madigan, ComEd and corruption: How the investigation into the ex-Illinois Speaker unfolded** **Michael Madigan, ComEd and corruption: How the investigation into the ex-Illinois Speaker unfolded** What’s targeted in President Donald Trump’s request for $9.4 billion in budget cuts from Congress? **What’s targeted in President Donald Trump’s request for $9.4 billion in budget cuts from Congress?** **What’s targeted in President Donald Trump’s request for $9.4 billion in budget cuts from Congress?** 2025 June 10 Tribune PublishingNew York Daily NewsThe Morning CallDaily PressThe Virginian-PilotOrlando SentinelSun SentinelHartford CourantStudio 1847 New York Daily News The Morning Call Daily Press The Virginian-Pilot Orlando Sentinel Sun Sentinel Hartford Courant Studio 1847 New York Daily News The Morning Call Daily Press The Virginian-Pilot Orlando Sentinel Sun Sentinel Hartford Courant Studio 1847 Company InfoAbout UsCareersHelp CenterMedia KitPrivacy PolicyChicago Tribune StoreSite MapArchives About Us Careers Help Center Media Kit Privacy Policy Chicago Tribune Store Site Map Archives About Us Careers Help Center Media Kit Privacy Policy Chicago Tribune Store Site Map Archives Subscribe Now Subscriber Terms and Conditions Terms of Service Cookie Policy Cookie Preferences California Notice at Collection CA Notice of Financial Incentive Do Not Sell/Share My Personal Information Copyright © 2025 Chicago Tribune"}