{"id": 2, "name": "KGTV - San Diego News", "domain": "10news.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.10news.com/science-and-tech/animals-and-insects/invasive-asian-needle-ants-with-potentially-deadly-sting-spreading-across-multiple-states", "title": "Invasive Asian Needle Ants With Potentially Deadly Sting Spreading Across Multiple States", "content": "Menu Submit News Tips ABOUT ABC 10NEWSMeet the ABC 10News TeamAdvertise With UsContact UsJobsSupportFacebookInstagramTwitter Meet the ABC 10News Team Advertise With Us Contact Us Jobs Support Facebook Instagram Twitter Meet the ABC 10News Team Advertise With Us Contact Us Jobs Support Facebook Instagram Twitter WATCH ABC 10NEWS LIVEABC 10News Live News CastsABC 10News VideosYouTube - ABC 10News San DiegoWATCH LIVE: BREAKING NEWS AND CONTINUING COVERAGE ABC 10News Live News Casts ABC 10News Videos YouTube - ABC 10News San Diego WATCH LIVE: BREAKING NEWS AND CONTINUING COVERAGE ABC 10News Live News Casts ABC 10News Videos YouTube - ABC 10News San Diego WATCH LIVE: BREAKING NEWS AND CONTINUING COVERAGE News | Local, U.S., WorldNewsUS/WorldAmerica VotesMaking it in San DiegoPositively San DiegoStories for ChangeFact or FictionYour Health MattersMilitaryPolitics News US/World America Votes Making it in San Diego Positively San Diego Stories for Change Fact or Fiction Your Health Matters Military Politics News US/World America Votes Making it in San Diego Positively San Diego Stories for Change Fact or Fiction Your Health Matters Military Politics WeatherAlertsRadarDaily ForecastHourly ForecastWildfiresEarthquake Preparedness Alerts Radar Daily Forecast Hourly Forecast Wildfires Earthquake Preparedness Alerts Radar Daily Forecast Hourly Forecast Wildfires Earthquake Preparedness TrafficGas PricesFlight Status Gas Prices Flight Status Gas Prices Flight Status Team 10 Investigates Positively San Diego Fact or Fiction SportsSan Diego PadresSDSU Sports San Diego Padres SDSU Sports San Diego Padres SDSU Sports CommunityPet of the WeekLeadershipSpelling BeeIf You Give a Child a BookStory TimeCommunity ConnectionCelebrating Community Pet of the Week Leadership Spelling Bee If You Give a Child a Book Story Time Community Connection Celebrating Community Pet of the Week Leadership Spelling Bee If You Give a Child a Book Story Time Community Connection Celebrating Community EntertainmentTV ListingsContests TV Listings Contests TV Listings Contests MoneyJob SearchShop SmartConsumer NewsDon't Waste Your MoneyFinancial Fitness ZoneApproved Home Pros Job Search Shop Smart Consumer News Don't Waste Your Money Financial Fitness Zone Approved Home Pros Job Search Shop Smart Consumer News Don't Waste Your Money Financial Fitness Zone Approved Home Pros MarketplaceSan Diego ConnectBrand SpotlightHome Improvement CollectiveThe Doctor Is In San Diego Connect Brand Spotlight Home Improvement Collective The Doctor Is In San Diego Connect Brand Spotlight Home Improvement Collective The Doctor Is In Advertising with 10News Sign In Newsletters Sign Out Manage Emails Apps Careers Search Weather Team 10 Investigates We Follow Through District 1 Debate Exploring San Diego SUBMIT NEWS TIPS Resource Center Contests Viewer Photos Positively San Diego **Actions** Facebook Tweet Email **Invasive Asian needle ants with potentially deadly sting spreading across multiple states** Asian needle ants that carry a potentially fatal sting have spread across multiple states, with experts warning people to be cautious when spending time outdoors. The invasive species has been found in more than a dozen states from Washington to Florida, but is expanding more rapidly in the southeastern United States. Entomologists at the University of Georgiaare tracking these ants and have warned that their stings could be deadly. RELATED STORY |3 rodeo horses killed by a swarm of bees in Central Texas People who have strong reactions to stings from insects like bees, wasps or yellowjackets should be especially careful, experts said. If you suffer from anaphylaxis, you should be especially vigilant and carry an EpiPen. The insect has been in the U.S. since at least the 1930s, but only recently has started to disrupt local ecosystems by competing with other ant species that are important to the ecology of that area. RELATED STORY |'Flying' venomous Joro spiders spotted for the first time in this state The Asian needle ants are tiny — about a fifth of an inch long — and are dark brown or black with lighter orange-brown on their antennae and legs. They can be difficult to notice because, unlike fire ants, for example, they don't build mounds or establish foraging trails. These ants prefer to hide under logs, stones and in leaf litter — anywhere with high moisture. Researchers said you should contact a professional exterminator if you think you have spotted these ants in or around your home. This story was reported on-air by a journalist and has been converted to this platform with the assistance of AI. Our editorial team verifies all reporting on all platforms for fairness and accuracy. **Sign up for theBreaking News Newsletterand receive up to date information.** **now signed up to receive theBreaking News Newsletter.** News Weather Sports Entertainment Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact abc10news abc10news 10news"}