{"id": 465, "name": "WFLD - Fox 32 - Chicago", "domain": "fox32chicago.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.fox32chicago.com/news/fox-news-sunday-with-shannon-bream", "title": "Fox News Sunday With Shannon Bream", "content": "Live News Weather Good Day Sports Contests Email More Local News National News World News Crime & Public Safety Good Day Special Reports FOX 32 Instapoll FOX News Sunday Weather Alerts Closings Weather Team Weather App Hurricanes FOX Weather Transportation Travel CTA Metra O'Hare Airport Midway Airport Union Station Election Paris on Politics Donald Trump JB Pritzker Brandon Johnson Chicago City Council Bears Blackhawks Bulls Cubs White Sox Fire Sky College Sports What's On FOX Fox Chicago+ FOX All-Stars Food & Drink Movies! Watch FOX Shows Business Consumer Deals Jobs Personal Finance Real Estate Small Business Stock Market Cancer Coronavirus Cannabis Fitness & Well-being Health Care Recalls Education Lifestyle Science Technology Unusual Pets & Animals Military Missing Persons 1st and North Week in Review Wearing the Badge Jake's Takes Monument Moment Voice of Change Good News Guarantee Orange Friday Milwaukee News - FOX 6 News Detroit News - FOX 2 Detroit Minneapolis News - FOX 9 How To Stream Mobile Apps Email Newsletters Contact Us Contests Personalities Jobs at FOX 32 Internships FCC Public File FCC Applications **FOX News Sunday with Shannon Bream: How and when to watch on FOX 32 Chicago** Share Copy Link Email Facebook Twitter LinkedIn Reddit Watch FOX News Sunday with Shannon Bream on FOX 32 Chicago starting at 9 a.m. on Sundays. CHICAGO-Shannon Bream has ushered in a new era of Sunday morning talk shows as she interviews the biggest newsmakers of the week on FOX News Sunday. You can catch all the action ofFOX News Sunday with Shannon Breamon FOX 32 Chicago from 9 a.m. to 10 a.m. on Sundays. Leading guests in providing context and analysis of the issues facing Americans, Bream’s weekly guest roster is among the most diverse in Sunday morning talk, featuring interviews with political, business and public affairs newsmakers from the U.S. and abroad. Before becoming the first woman to host FOX News Sunday in its nearly three-decade history, Bream served as anchor of FOX News @ Night for five years. In addition to her new role, she also continues to serve as the network’s chief legal correspondent. WatchFOX News Sunday with Shannon Breamon FOX 32 Chicago starting at 9 a.m. on Sundays. **** **Trending** **** **Latest News** **Chicago Board of Education picks interim CPS head** **Chicago high school senior gifted $15K scholarship from Burger King** **ICE tactical teams on standby for Chicago deployment after protests, officials say** **Beach Boys legend Brian Wilson dies: Family 'heartbroken' over loss** **Chicago ICE protest: 17 arrested during chaotic evening downtown** **DAILY NEWSLETTER** All the news you need to know, every day By clicking Sign Up, I confirmthat I have read and agreeto thePrivacy PolicyandTerms of Service. Local News National News World News Crime & Public Safety Good Day Special Reports FOX 32 Instapoll FOX News Sunday Weather Alerts Closings Weather Team Weather App Hurricanes FOX Weather Transportation Travel CTA Metra O'Hare Airport Midway Airport Union Station Election Paris on Politics Donald Trump JB Pritzker Brandon Johnson Chicago City Council Bears Blackhawks Bulls Cubs White Sox Fire Sky College Sports What's On FOX Fox Chicago+ FOX All-Stars Food & Drink Movies! Watch FOX Shows Business Consumer Deals Jobs Personal Finance Real Estate Small Business Stock Market Cancer Coronavirus Cannabis Fitness & Well-being Health Care Recalls Education Lifestyle Science Technology Unusual Pets & Animals Military Missing Persons 1st and North Week in Review Wearing the Badge Jake's Takes Monument Moment Voice of Change Good News Guarantee Orange Friday Milwaukee News - FOX 6 News Detroit News - FOX 2 Detroit Minneapolis News - FOX 9 How To Stream Mobile Apps Email Newsletters Contact Us Contests Personalities Jobs at FOX 32 Internships FCC Public File FCC Applications facebook instagram twitter email New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File Closed Captioning About Us Jobs at FOX 32 Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"}