{"id": 1239, "name": "Shadow Proof", "domain": "shadowproof.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://shadowproof.com/2023/02/28/georgia-prisoners-may-lose-critical-lifelines-as-prison-officials-overhaul-communications-and-target-contraband-phones/#respond", "title": "Georgia Prisoners May Lose Critical Lifelines As Prison Officials Overhaul Communications And Target Contraband Phones", "content": "Latest NewsFeatured ReportingThe Marvel Cooke FellowshipTrans Behind BarsRoad To Single-PayerThe Protest Music ProjectIslam In AmericaGaming the SystemDNC 2016Shadowproof Podcast SeriesLivestreamThe DissenterPrison ProtestSharp EdgesThe BullpenGOVINTThe Idiocrat Featured ReportingThe Marvel Cooke FellowshipTrans Behind BarsRoad To Single-PayerThe Protest Music ProjectIslam In AmericaGaming the SystemDNC 2016Shadowproof Podcast Series The Marvel Cooke Fellowship Trans Behind Bars Road To Single-Payer The Protest Music Project Islam In America Gaming the System DNC 2016 Shadowproof Podcast Series Livestream The Dissenter Prison Protest Sharp Edges The Bullpen GOVINT The Idiocrat Featured ReportingThe Marvel Cooke FellowshipTrans Behind BarsRoad To Single-PayerThe Protest Music ProjectIslam In AmericaGaming the SystemDNC 2016Shadowproof Podcast Series The Marvel Cooke Fellowship Trans Behind Bars Road To Single-Payer The Protest Music Project Islam In America Gaming the System DNC 2016 Shadowproof Podcast Series The Marvel Cooke Fellowship Trans Behind Bars Road To Single-Payer The Protest Music Project Islam In America Gaming the System DNC 2016 Shadowproof Podcast Series Livestream The Dissenter Prison Protest Sharp Edges The Bullpen GOVINT The Idiocrat AboutFreelance SubmissionsThe Marvel Cooke FellowshipContactStaff & ContributorsOrganizational GoalsPrivacy StatementTerms And Conditions Freelance SubmissionsThe Marvel Cooke Fellowship The Marvel Cooke Fellowship Contact Staff & Contributors Organizational Goals Privacy Statement Terms And Conditions Freelance SubmissionsThe Marvel Cooke Fellowship The Marvel Cooke Fellowship The Marvel Cooke Fellowship Contact Staff & Contributors Organizational Goals Privacy Statement Terms And Conditions The DissenterChelsea Manning CoverageThe Protest Music ProjectUnauthorized Disclosure Podcast Chelsea Manning Coverage The Protest Music Project Unauthorized Disclosure Podcast Chelsea Manning Coverage The Protest Music Project Unauthorized Disclosure Podcast Prison ProtestThe Marvel Cooke FellowshipBeyond Prisons PodcastGaming The SystemTrans Behind BarsResources On Incarceration The Marvel Cooke Fellowship Beyond Prisons Podcast Gaming The System Trans Behind Bars Resources On Incarceration The Marvel Cooke Fellowship Beyond Prisons Podcast Gaming The System Trans Behind Bars Resources On Incarceration Featured Reporting Protest Music Project The DissenterChelsea Manning CoverageThe Protest Music ProjectUnauthorized Disclosure Podcast Chelsea Manning Coverage The Protest Music Project Unauthorized Disclosure Podcast Chelsea Manning Coverage The Protest Music Project Unauthorized Disclosure Podcast Prison ProtestThe Marvel Cooke FellowshipBeyond Prisons PodcastGaming The SystemTrans Behind BarsResources On Incarceration The Marvel Cooke Fellowship Beyond Prisons Podcast Gaming The System Trans Behind Bars Resources On Incarceration The Marvel Cooke Fellowship Beyond Prisons Podcast Gaming The System Trans Behind Bars Resources On Incarceration Featured Reporting Protest Music Project **Georgia Prisoners May Lose Critical Lifelines As Prison Officials Overhaul Communications And Target Contraband Phones** As Georgia prison officials move towards fully digitizing communications with Securus and curtailing access to contraband cellphones, incarcerated people and their loved ones are speaking out. According to advocates, contraband phones are both a vital transparency tool and are increasingly used by Georgia prison officials as a scapegoat for agency brutality and incompetence. When Tim Ward was commissioner of the Georgia Department of Corrections (GDC) last year, he told the state senate that the department believes cellphones are used tocommit crimes and plan “hits”on civilians within the prison walls. The crackdown on such devices is allegedly a response to threats tosafety and security within the prison system. However, incarcerated people and their advocates say the GDCis attending to fears of media exposureand enjoysfinancial incentivesto remove the devices. BT, a Georgia prisoner, is the spokesperson for the incarcerated group calledGeorgia Prisoners Speak. Shadowproof is withholding BT’s name to protect him from retaliation from prison officials. The self-described “auto-advocacy” group aims to expose the prison system and hold prisoncrats accountable through its YouTube platform, website gallery, and blog posts. “This isn’t about cellphones,” argues BT. “It’s about money and exposing the prison system. There are serious problems in the GDC, starting with all the deaths, suicide, murder, lack of medical care.” “People are starving and the lack of vital nutrition has become a serious concern, especially as most of the ‘food’ is inedible. There are no programs for rehabilitation and job skills, despitewhat they claim in their fiscal reports, and so for many prisoners there is nothing to do.” “GDC doesn’t want taxpayers or lawmakers to know just how terribly they are failing in their mandate,” BT said. There have been reports ofprisoners forced to live in shower stalls or outside. Georgia prison conditions are so abysmal that it has prompted theU.S. Department of Justiceto announce the launch of a secondinvestigation into GDC’s deadly prison conditions. In recent years, cellphones have become a major talking point for prisoncrats who are questioned about conditions. In order to legitimize their assertions that contraband phones are mainly used for nefarious ends, the GDC has invested in security technology such as Mobile Access Management systems that allow them to control devices on their property, and sensors to detect drones and the presence of electronic devices. The agency has also made use of full body scanners, electronic detection-trained dogs, and prolific searches. In aletter dated January 26, Georgia Attorney General Chris Carr and 21 other state attorneys general called on congressional leaders to pass legislation that would allow states to use cellphone-jamming technology in correctional facilities. Currently, federal law prohibits the use of such technology. Securus—a telecommunications company that provides phone and video services to prison systems across the country—has acontract with the Georgia Department of Corrections, and the company stands to benefit if the use of contraband cellphones is reduced. This is because when prisoners use Securus’ tablets and pay phones, the company charges them and their families high rates. Zombr3x, 28, is incarcerated within a Middle Georgia men’s prison. Shadowproof is withholding his identity to protect him from retaliation. “The reason they want to take away phones is because the more we are able to establish lines of communication outside of ‘official’ channels, the less money companies such as Securus and JPay make off of us,” Zombr3x explained. “Less money for the prison industrial complex means less money for kickbacks to wardens and commissioners.” The GDC entered into arevenue-sharing agreementwith Securus and also reportedly receives over$8 million dollars per year in kickbacks fromthe company for prisoner phone calls. Additionally, there may be unrecorded kickbacks given to select GDC employees. The crackdown is also about ensuring access to surveillance, narrative control, and, of course, punishment. Contraband phones and jailbroken tablets have been among the most prominent means that prisoners, their loved ones, and prison reform activists have to compel transparency and demand accountability. Prisoners’ use of cellphones to document and share evidence of abusive guards, inadequate medical care, and unsanitary living conditions has put pressure on the GDC to improve conditions. It is likely that the crackdown on these devices is an attempt to prevent prisoners from continuing toexpose these issues. Campaigns forfree prison phone callshave become more common, and pretty much everyone except for prison officials and prison profiteers agrees this is a good and fair demand. But those campaigns alone arguably do not obviate the other roles contraband phones play in terms of avoiding surveillance and reporting conditions of confinement. Several Facebook groups, such as They Have No Voice and The Human and Civil Rights Coalition of Georgia, actively communicate with prisoners via social media in order to get the hard details on what’s happening inside. “GDC wants the absolute isolation and deprivation of the incarcerated,” said Susan Burns of They Have No Voice. “GDC is trying to prevent exposure as a failed agency providing cover to a remarkably inept and corrupt staff. GDC cannot afford to be transparent with stakeholders when violence, cruelty, callous treatment of the sick, injured, and elderly, starvation rations, and disrespect are not considered abhorrent behavior by its workforce.” Nonprofits such as The Southern Center for Human Rights and Ignite Justice have also corresponded with prisoners through their phones and tablets in order to collect evidence that has resulted in rare steps towards accountability. The COVID-19 pandemic has contributed to strained communications access as well, including the suspension of in-person visits in most prisons and jails. Since then, most prison systems have reopened “limited visitation,” but a handful still have not returned to their pre-pandemic arrangements,according to the latest available databy the Marshall Project. Adding new communications obstacles to this situation further isolates incarcerated individuals and weakens their connection to their friends and family, and other support systems. This is a recipe for disaster as around 600,000 people leave prisons in the US and a larger number cycle in and out of jails. Approximately2.7 million childrenin the US have a parent who is incarcerated. By removing cellphones,the process of rehabilitation and reentry can be hindered, increasing the risk of recidivism. Maintaining these bonds is critical to the health and safety of communities. Prisoners’ access to phones and other unrestricted internet devices needs to be encouraged and protected, possibly even legislated, because of the roles they play in the lives of incarcerated people. Ultimately, this is about the GDC’s financial interests and the agency’s efforts to conceal the inhumane realities of the prison system. Prisoners, their loved ones, and the communities to which prisoners must return suffer most from these pernicious prison cellphone policies. **C. Dreams** C. Dreams is a writer and advocate interested in prison/criminal justice reform, LGBTQ rights, harm reduction and government/cultural criticism. She has studied history/theology with the Third Order of Carmelites and completed degrees in Systematic Theology. She is currently studying law. About Shadowproof Contact Shadowproof Donor & Member Support Freelance Submissions Copyright Notice Privacy Statement Terms And Conditions **About Shadowproof** Shadowproof publishes independent journalism on grassroots movements for justice. Started by former Firedoglake staff in 2015. **DISCLAIMER** Content published prior to August 1, 2015, under the“Community” tagis the opinion of the author alone, and should not be attributed to Shadowproof. For more information, read full disclaimerhere. **Shadowproof is 100% reader-funded** SUBSCRIBE TO NEWSLETTER **Georgia Prisoners May Lose Critical Lifelines As Prison Officials Overhaul Communications And Target Contraband Phones** Accessibility Tools Increase TextIncrease Text Decrease TextDecrease Text GrayscaleGrayscale High ContrastHigh Contrast Negative ContrastNegative Contrast Light BackgroundLight Background Links UnderlineLinks Underline Readable FontReadable Font ResetReset"}