{"id": 1912, "name": "Christian Coalition of America", "domain": "cc.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://cc.org/senator-kennedy-champions-bill-to-block-taxpayer-funding-of-medical-schools-that-indoctrinate-students-with-dei-ideology/", "title": "Senator Kennedy Champions Bill To Block Taxpayer Funding Of Medical Schools That Indoctrinate Students With Dei Ideology", "content": "About Our Priorities Get InformedCommentaryCapitol Hill Updates Commentary Capitol Hill Updates Commentary Capitol Hill Updates Get InvolvedHelp build the Christian Coalition of AmericaChurch LiaisonRegister to VoteContact Your Elected Officials Help build the Christian Coalition of America Church Liaison Register to Vote Contact Your Elected Officials Help build the Christian Coalition of America Church Liaison Register to Vote Contact Your Elected Officials Contact **Senator Kennedy champions bill to block taxpayer funding of medical schools that indoctrinate students with DEI ideology** WASHINGTON – Sen. John Kennedy (R-La.), a member of the Senate Budget Committee, today reintroduced the Embracing anti-Discrimination, Unbiased Curricula and Advancing Truth in Education (EDUCATE) Act, which would block federal funding for medical schools and accrediting institutions that force students to affirm ideological beliefs and prioritize diversity, equity and inclusion (DEI). “Medical schools should be in the business of training our future doctors to save lives—not indoctrinating students with anti-American DEI ideology. The EDUCATE Act would make sure the government isn’t wasting your money on woke struggle sessions and blatant discrimination in medical schools,”said Kennedy. Sen. Eric Schmitt (R-Mo.) joined Kennedy in reintroducing the bill in the Senate. “For too long the radical Left has used our education system to advance their woke DEI agenda rather than advancing scientific achievement. This has now injected itself into medical schools across the nation putting the lives of countless Americans in danger all to appease the woke mob. I am proud to be leading this legislation to once again put merit above social justice quotas,”said Schmitt. Rep. Greg Murphy (R-N.C.) reintroduced the bill in the House of Representatives. “American medical schools are the best in the world and should remain free from discrimination, politicization, and acceptance of anything other than excellence. The EDUCATE Act bans race-based mandates at medical schools, protects the First Amendment and civil rights of students, and promotes objective, science-based medicine. Excluding individuals based on appearance or beliefs in the name of diversity is wrong and debases the integrity of the profession. Doctors must be taught to treat patients with the highest quality of care regardless of who they are. This includes dealing with other medical professionals who may not look like they do. I have dedicated my life to serving others as a physician and will not stand for discrimination in our nation’s institutions of medicine,”said Murphy. Kennedy and Murphy also authoredthis op-edin the Washington Examiner urging Congress to pass their EDUCATE Act. The EDUCATE Act would block federal funding from medical schools that: Direct, compel or incentivize students, faculty or staff to affirm or adopt certain ideological tenets. Take any action that would deprive a student of educational opportunities or otherwise adversely affect his or her status as a student on the basis of race or ethnicity. Require a course of instruction that directs or compels students, faculty or staff to state, pledge, recite, affirm or adopt certain ideological tenets. Maintain a DEI or equivalent office within the medical school. Require or incentivize an individual to complete a diversity statement that affirms or capitulates to DEI as a condition of the person’s being admitted to or employed by a school. Do No Harm, America First Policy Institute, Eagle Forum, Heritage Action and CPAC support the EDUCATE Act. “Do No Harm applauds Congressman Murphy and Senator Kennedy for their relentless work to end harmful DEI practices and to restore integrity to American medical schools. For too long, accrediting bodies and medical colleges have prioritized identity politics over merit and expertise—putting patients’ health at serious risk. President Trump’s Administration has taken critical steps to dismantle these political activists’ grip on medical education, even causing some accreditors and schools to suspend their discriminatory practices. But the EDUCATE Act could enshrine the President’s actions into law, thereby eradicating DEI programs from medical education permanently,”said Dr. Stanley Goldfarb, founder and Board Chairman of Do No Harm. “Diversity Equity and Inclusion (DEI) initiatives are an offshoot of Critical Race Theory—designed to promote race-stereotyping, race-exclusion, and indoctrination into divisive far-left ideologies. When publicly funded universities and medical schools teach students to make snap judgments about each other and our broader society based on skin color, they are conditioning them to reject foundational American commitments, including equal treatment and opportunity for all, administrative impartiality, and due process. Congressman Murphy’s bill is an essential first step toward restoring academic excellence and truth-seeking as the focal points of medical education so that tomorrow’s health professionals are prepared to provide exceptional care to every patient, regardless of their race or sex,”said Dr. Michael Shires, Ph.D., Vice Chair of Education Opportunity at the America First Policy Institute. “DEI has invaded US medical schools like a virus in recent years—harming these institutions and the public as well. Senator Kennedy’s EDUCATE Act is the cure. We urge the Senate to move this bill forward,”said Kris Ullman, President of the Eagle Forum. Full text of the EDUCATE Act is availablehere. **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. Senator Kennedy champions bill to block taxpayer funding of medical schools that indoctrinate students with DEI ideology Weekly House of Representatives’ Schedule 5/19/25 Weekly House of Representatives’ Schedule 5/5/25 House Speaker Johnson Joins Sunday Night in America with Trey Gowdy Senator Rick Scott, Colleagues Lead Legislation Targeting Organizations Enabling and Funding Terrorists About Our Priorities Get InformedCommentaryCapitol Hill Updates Commentary Capitol Hill Updates Commentary Capitol Hill Updates Get InvolvedHelp build the Christian Coalition of AmericaChurch LiaisonRegister to VoteContact Your Elected Officials Help build the Christian Coalition of America Church Liaison Register to Vote Contact Your Elected Officials Help build the Christian Coalition of America Church Liaison Register to Vote Contact Your Elected Officials Contact"}